{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cd\/Urn_of_Shadows.mp3\/revision\/latest?cb=20141214195232",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев \/ Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Двойное нажатие использует предмет на себя.",
        "Несколько применений на одну цель не складываются, но обновляется длительность.",
        "Лечение развеивается любым уроном от игроков (до уменьшений), включая урон по себе.",
        "Атаки Рошана и фонтана не развеивают лечение.",
        "Не развеивается заклинаниями требующими затрат здоровья, манипулирующими со здоровьем заклинаниями, негативной регенерацией, Poison Sting и Dispersion.",
        "Можно применять на иллюзии, Spirit Bear у Lone Druid, Гаргульи у Visage, Голема у Warlock и духов от Primal Split.",
        "Если у предмета нет зарядов, то от следующей смерти вражеского героя он наполнится 2 зарядами вместо 1."
      ],
      "mana": null,
      "abilityName": "Soul Release",
      "cooldown": "7",
      "description": "Эффект зависит от выбранной цели: либо увеличивает восстановление здоровья союзника на 30, либо наносит противнику 25 урона в секунду. Действует 8 сек. Получает заряды каждый раз, когда в радиусе 1400 умирает вражеский герой. Заряд получит только один, ближайший к умершему герою предмет.",
      "params": [
        "Дальность применения: 950",
        "Радиус получения заряда: 1400",
        "Бонус к регенерации здоровья союзника: 30",
        "Урон врагу в секунду: 25",
        "Длительность лечения\/урона: 8",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя использовать на врагов с иммунитетом к заклинаниям. Пытается нанести урон если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 40 здоровья, 0,2 регенерации здоровья, 2,33 брони, 2 скорости атаки, 24 маны, 1,6 регенерации маны и 2 урона от атаки.",
    "Для героев ловкости, даёт 40 здоровья, 0,2 регенерации здоровья, 2,33 брони, 2 скорости атаки, 24 маны, 1,6 регенерации маны и 2 урона от атаки.",
    "Для героев интеллекта, даёт 40 здоровья, 0,2 регенерации здоровья, 2,33 брони, 2 скорости атаки, 24 маны, 1,6 регенерации маны и 2 урона от атаки.",
    "В отличии от других собираемых предметов Urn of Shadows после сборки невозможно разобрать даже при десятисекундном отсчете."
  ],
  "cost": "850",
  "lore": null,
  "consistFrom": [
    "Sage's Mask",
    "Circlet",
    "Ring of Protection",
    "Recipe"
  ],
  "boughtFrom": "Поддержка",
  "name": "Urn of Shadows",
  "description": "Содержит пепел могучих демонов.",
  "trivia": null,
  "upgradeIn": [
    "Spirit Vessel"
  ],
  "bonuses": [
    "+2 к силе",
    "+2 к ловкости",
    "+2 к интеллекту",
    "+1,5 к регенерации маны",
    "+2 к броне"
  ],
  "tips": null
}