{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−8 сек. перезарядки Snowball",
          "talentRight": "Walrus PUNCH! сработает при атаке с шансом в 12%"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+80% к критическому урону от Walrus PUNCH!",
          "talentRight": "−6 сек. перезарядки Ice Shards"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+120 к урону от Snowball",
          "talentRight": "+325 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0,4 сек. оглушения от Walrus Punch",
          "talentRight": "+25 к урону от Tag Team"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Tusk_Ice_Shards_1.mp3\/revision\/latest?cb=20191216025612",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд движется со скоростью 1200 до достижения выбранной точки.",
        "Ледяные осколки всегда появляются в одном и том же порядке. Осколки размещены по полукругу с радиусом в 200 единиц, центром которого является расстояние в 200 единиц до выбранной точки. Первый осколок всегда появляется в выбранной точке, поэтому он всегда будет на одной линии с позицией Tusk при использовании заклинания. Следующие осколки располагаются под углом в 40° друг к другу, появляясь в количестве 7 штук. 9 осколков создали бы полный круг. Поэтому незавершенная часть круга всегда расположена по направлению к месту применения заклинания Tusk. Радиус столкновения осколков равен 67, расстояние между ними - 6, поэтому между осколками пройти нельзя.",
        "Осколки размещены по полукругу с радиусом в 200 единиц, центром которого является расстояние в 200 единиц до выбранной точки.",
        "Первый осколок всегда появляется в выбранной точке, поэтому он всегда будет на одной линии с позицией Tusk при использовании заклинания.",
        "Следующие осколки располагаются под углом в 40° друг к другу, появляясь в количестве 7 штук. 9 осколков создали бы полный круг.",
        "Поэтому незавершенная часть круга всегда расположена по направлению к месту применения заклинания Tusk.",
        "Радиус столкновения осколков равен 67, расстояние между ними - 6, поэтому между осколками пройти нельзя.",
        "Существа, которые не контролируются игроками, не пытаются обойти осколки, а просто упираются в них. То есть так можно останавливать существ, пока они не поменяют направление (например, их что-либо спровоцирует).",
        "То есть так можно останавливать существ, пока они не поменяют направление (например, их что-либо спровоцирует).",
        "Осколки дают летающий обзор в радиусе 100. Он длится 2 секунды выбранной точки после её достижения."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "23\/20\/17\/14 (TagTalent 17\/14\/11\/8)",
      "description": "Герой сжимает осколки льда в шар холодной энергии, который наносит урон всем задетым врагам. Когда шар достигнет точки назначения, осколки высвободятся, создавая барьер на 4\/5\/6\/7 сек.",
      "spellName": "Ice Shards",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 1800",
        "Радиус урона: 200",
        "Радиус появления осколков: 200",
        "Урон: 70\/140\/210\/280",
        "Длительность осколков: 4\/5\/6\/7",
        "Блокировка пути действует на существ с иммунитетом к заклинаниям. Не пытается нанести урон врагам с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Snowball_1.mp3\/revision\/latest?cb=20191216025616",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снежный ком движется со скоростью в 600\/625\/650\/675.",
        "Snowball достигает цель за 3 секунды, поэтому расстояние может достигать до 1800\/1875\/1950\/2025 единиц.",
        "Правой кнопкой мыши в любой момент можно добавлять других союзных героев. Союзники таким же образом могут самостоятельно залезать в ком. Союзников, затронутых Black Hole, Chronosphere или Flaming Lasso, нельзя поместить в ком. При этом попытка поместить затронутого союзника все равно добавит Snowball урона. Может забирать призываемых существ, но не варды. Может забирать невидимых или неуязвимых союзников. Не захватывает союзников с опцией \"Без помощи\" от Tusk.",
        "Союзников, затронутых Black Hole, Chronosphere или Flaming Lasso, нельзя поместить в ком.",
        "При этом попытка поместить затронутого союзника все равно добавит Snowball урона.",
        "Может забирать призываемых существ, но не варды.",
        "Может забирать невидимых или неуязвимых союзников.",
        "Не захватывает союзников с опцией \"Без помощи\" от Tusk.",
        "Существа внутри кома неуязвимы, спрятаны и имеют иммунитет к заклинаниям. Союзники в коме также обезвреживаются.",
        "Сам Tusk лишь заглушается и обезоруживается, что позволяет ему использовать заклинания, но не атаковать или использовать предметы.",
        "Радиус увеличивается на 40 в секунду сразу же после начала движения, составляя 240\/280\/320 каждую секунду.",
        "Только союзные герои (включая клонов) увеличивают урон. Остальные существа урона не добавляют. Иллюзии не считаются за героев.",
        "Сам Tusk не может покинуть Snowball, в то время как другие существа могут это сделать с помощью заклинаний телепортации без снижения урона кома. Dark Rift - единственная способность, способная забрать Tusk из Snowball. Как только это произойдет - Snowball отменяется.",
        "Dark Rift - единственная способность, способная забрать Tusk из Snowball. Как только это произойдет - Snowball отменяется.",
        "Как только Snowball соприкасается с целью, Tusk получает приказ атаковать её. То есть Tusk все равно будет атаковать цель, даже если в настройках игрока опция автоатаки отключена.",
        "То есть Tusk все равно будет атаковать цель, даже если в настройках игрока опция автоатаки отключена.",
        "Отключение функции \"помощь\" предотвратит добавление героя в Snowball союзного Tusk.",
        "Снежный ком разрушает деревья в пределах своего радиуса при движении.",
        "Здесь указано, сколько урона нанесет Snowball (до уменьшений) с определенным количеством героев внутри (учитывая Tusk): 2 героя: 100\/160\/220\/280 (TagTalent 220\/280\/340\/400) 3 героя: 120\/200\/280\/360 (TagTalent 240\/320\/400\/480) 4 героя: 140\/240\/340\/440 (TagTalent 260\/360\/460\/560) 5 героев: 160\/280\/400\/520 (TagTalent 280\/400\/520\/640)",
        "2 героя: 100\/160\/220\/280 (TagTalent 220\/280\/340\/400)",
        "3 героя: 120\/200\/280\/360 (TagTalent 240\/320\/400\/480)",
        "4 героя: 140\/240\/340\/440 (TagTalent 260\/360\/460\/560)",
        "5 героев: 160\/280\/400\/520 (TagTalent 280\/400\/520\/640)",
        "Snowball сначала применяет дебафф, затем наносит урон.",
        "Дебафф modifier_tusk_snowball_visible дает общий обзор на цель до остановки Snowball. Не дает эффект True Sight."
      ],
      "mana": "75",
      "hotKey": "W",
      "cooldown": "21\/20\/19\/18 (TagTalent 13\/12\/11\/10)",
      "description": "Герой заворачивается в снежный ком. Союзников в радиусе 350 также можно поместить в ком, нажав на них правой кнопкой мыши, даже если ком уже движется. После запуска все враги на пути кома будут оглушены и получат урон. Чем больше в коме союзных героев, тем больше урон от него.",
      "spellName": "Snowball",
      "params": [
        "Анимация применения: 0,1+0,5",
        "Дальность применения: 1150",
        "Радиус урона и оглушения: 200",
        "Увеличение радиуса в секунду: 40",
        "Радиус сбора: 350",
        "Макс. время простоя: 3",
        "Макс. длительность преследования: 3",
        "Базовый урон: 80\/120\/160\/200 (TagTalent 200\/240\/280\/320)",
        "Урона за героя: 20\/40\/60\/80",
        "Скорость кома: 600\/625\/650\/675",
        "Длительность оглушения: 0,5\/0,75\/1\/1,25",
        "Не может выбрать врагов с иммунитетом к заклинаниям. Не пытается нанести урон или оглушить врагов с иммунитетом. Может поместить в шар союзников с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Snowball до достижения комом цели или завершения длительности.",
        "Tusk может использовать Ice Shards, Tag Team, Walrus Kick и переключать автоприменение Walrus PUNCH! во время запуска, в то время как остальные существа не могут использовать заклинания."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Запускает снежный ком в сторону цели.",
      "spellName": "Launch Snowball",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Tusk_Tag_Team_1.mp3\/revision\/latest?cb=20191216025619",
      "effects": [
        "Способность Ненаправленная \/ Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Tusk.",
        "Дает Tusk временную ауру. Её дебафф задерживается на 0,5 секунды.",
        "Срабатывает только на атаки союзных героев (включая иллюзии и клонов, исключая крипов-героев) и любые атаки подконтрольных Tusk существ.",
        "Урон непосредственно добавляется к урону от атаки существа, поэтому он учитывается вампиризмом, критическим и прорубающим ударом. Но при этом урон добавляется в качестве дополнительного, поэтому иллюзии его не используют, а любые бонусы или снижения, использующие процентное значение, его не учитывают.",
        "Но при этом урон добавляется в качестве дополнительного, поэтому иллюзии его не используют, а любые бонусы или снижения, использующие процентное значение, его не учитывают.",
        "Замедление от нескольких атак складывается, каждый раз накладывая отдельный дебафф.",
        "Активировавшая атака сначала применяет дебафф замедления, затем наносит урон."
      ],
      "mana": "70",
      "hotKey": "E",
      "cooldown": "24\/21\/18\/15",
      "description": "Временно даёт герою ауру, в которой атаки замедляют передвижение врагов и наносят им дополнительный физический урон. Действует секунд.",
      "spellName": "Tag Team",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 350",
        "Доп. урон: 20\/45\/70\/95",
        "Замедление скорости передвижения: 75%",
        "Длительность замедления: 0,4",
        "Время действия ауры: 5",
        "Длительность задержки ауры: 0,5",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Walrus_Kick.mp3\/revision\/latest?cb=20191216025621",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. В режиме Ability Draft Walrus Kick можно разблокировать игроку, выбравшему Walrus PUNCH!.",
        "В режиме Ability Draft Walrus Kick можно разблокировать игроку, выбравшему Walrus PUNCH!.",
        "В отличии от Walrus PUNCH! способность Walrus Kick не активный модификатор атаки.",
        "Выбирает ближайшего в радиусе врага и отпинывает его в выбранную точку. Приоритет героев (включая иллюзии и клонов) выше, чем у других существ не-героев. Считает крипов-героев за героев. Цель не обязательно должна быть перед Tusk: способность выбирает существо, пока оно в радиусе поиска. Если поблизости нет врагов, перезарядка сбрасывается, а мана возвращается. Не выбирает древних крипов.",
        "Приоритет героев (включая иллюзии и клонов) выше, чем у других существ не-героев. Считает крипов-героев за героев.",
        "Цель не обязательно должна быть перед Tusk: способность выбирает существо, пока оно в радиусе поиска.",
        "Если поблизости нет врагов, перезарядка сбрасывается, а мана возвращается.",
        "Не выбирает древних крипов.",
        "Цель отлетает от Tusk по дуге длиной в 1400 единиц и высотой в 360. Walrus Kick не может быть перезаписана другими источниками принудительного движения.",
        "Walrus Kick не может быть перезаписана другими источниками принудительного движения.",
        "Пока цель в воздухе, остальные существа могут под ним проходить.",
        "Замедление накладывается при применении, поэтому фактическая длительность замедления равна 4 секундам после первой секунды оглушения цели.",
        "Walrus Kick сначала применяет дебафф, затем наносит урон.",
        "Во время отбрасывания разрушает деревья в радиусе 100 единиц от выбранного существа."
      ],
      "mana": "100",
      "hotKey": "D",
      "cooldown": "8",
      "description": "Отпинывает цель от себя, нанося ей урон и замедляя её.",
      "spellName": "Walrus Kick",
      "params": [
        "Анимация применения: 0,2+1,3",
        "Дальность применения: Глобальная",
        "Радиус поиска: 250",
        "Дальность пинка: 1400",
        "Урон: 350",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 5",
        "Длительность оглушения: 1",
        "Усиление анимации атаки: 40%"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/73\/Tusk_Frozen_Sigil.mp3\/revision\/latest?cb=20201007213717",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Печать появляется в текущем местоположении Tusk.",
        "После применения печать автоматически следует за Tusk, если её не отдали иных приказов.",
        "Замедление предоставлено аурой. Ее дебафф задерживается на 0,5 сек.",
        "Можно поместить в Snowball, несмотря на то, что это существо — вард."
      ],
      "mana": "70",
      "hotKey": "F",
      "cooldown": "30",
      "description": "Призывает летающую печать с морозной аурой радиусом 650, которая замедляет передвижение врагов на 40%. Длительность: 25 секунд. Перезарядка: 30 секунд.",
      "spellName": "Frozen Sigil",
      "params": [
        "Анимация применения: 0,1+0,94",
        "Радиус: 650",
        "Атак героев для разрушения: 6",
        "Атак не-героев для разрушения: 24",
        "Замедление скорости передвижения: 40%",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Tusk_Walrus_PUNCH%21.mp3\/revision\/latest?cb=20191216025622",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов"
      ],
      "notes": [
        "Дальность применения Walrus PUNCH! всегда равна дальности атаки заклинателя.",
        "Несмотря на то, что эта способность - активный модификатор атаки, на Walrus PUNCH! срабатывают все эффекты, реагирующие на применение, как на обычное заклинание.",
        "Walrus PUNCH! не может промахнуться из-за уклонения или ослепления.",
        "Жертва закручивается в воздухе на 650 единиц (1200, если удар был смертельным) на длительность оглушения. Скорость адаптируется к измененной длительности оглушения. Walrus PUNCH! не может быть перезаписана другими источниками принудительного движения, поднимающих цель вверх.",
        "Walrus PUNCH! не может быть перезаписана другими источниками принудительного движения, поднимающих цель вверх.",
        "Пока цель в воздухе, остальные существа могут под ним проходить.",
        "Замедление накладывается при применении, поэтому фактическая длительность замедления равна 2\/3\/4 сек. после первой секунды оглушения цели.",
        "Walrus PUNCH! сначала применяет дебаффы, затем наносит урон.",
        "Подкидывает всех, за исключением вардов, строений, союзников и существ под контролем Tusk. Tusk может атаковать их с включенным автоприменением без ухода способности на перезарядку.",
        "Поскольку этот урон просто критический, он может быть прорубающим и Tusk получает лечение от вампиризма.",
        "Проигрывает звук при начале атаки. Звук завершится только после попадания удара.",
        "Можно использовать на Рошана, но к нему применятся только оглушение и замедление.",
        "При выборе таланта на 25-ом уровне Walrus PUNCH! текущего уровня сможет пассивно сработать при обычной атаке. Срабатывание не зависит от перезарядки, не активирует её и может сработать при активном таймере. Также срабатывание не расходует ману. В среднем увеличивает урон Tusk на 30% (TagTalent 39,6%). Если способность пассивно срабатывает при включенном автоприменении или применении вручную, то перезарядка не начинается и мана не расходуется. Пассивные срабатывания используют псевдослучайное распределение.",
        "Срабатывание не зависит от перезарядки, не активирует её и может сработать при активном таймере. Также срабатывание не расходует ману.",
        "В среднем увеличивает урон Tusk на 30% (TagTalent 39,6%).",
        "Если способность пассивно срабатывает при включенном автоприменении или применении вручную, то перезарядка не начинается и мана не расходуется.",
        "Пассивные срабатывания используют псевдослучайное распределение."
      ],
      "mana": "50\/75\/100",
      "hotKey": "R",
      "cooldown": "36\/24\/12",
      "description": "Герой совершает свой коронный удар — настолько мощный, что подбрасывает жертву в воздух, нанося ей критический урон. После приземления жертва будет замедлена.",
      "spellName": "Walrus PUNCH!",
      "params": [
        "Критический урон: 350% (TagTalent 430%)",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 3\/4\/5",
        "Длительность оглушения: 1 (TagTalent 1,4)",
        "Ускорение анимации атаки: 40%",
        "Шанс срабатывания: 12%",
        "Дарует новую способность: Walrus Kick.",
        "Дарует новую способность: Frozen Sigil.",
        "Пассивный шанс срабатывания от таланта не отключается."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.9,
    "attrStrength": 23.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Tusk — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Ice Shards, сжимает осколки льда в шар холодной энергии, который наносит урон всем врагам, которых он коснется. Когда шар достигнет точки назначения, то осколки высвободятся, создавая барьер. Вторая способность, Snowball, начинает сворачивать Tusk в снежный ком. Союзников в радиусе 400 можно поместить в ком, нажав на них правой кнопкой мыши, даже если ком уже движется. После запуска все враги на пути кома будут оглушены и получат урон. Чем больше в коме союзных героев, тем больше урон от него. Ком можно запустить сразу, использовав Launch Snowball. Третья способность, Tag Team, создаёт вокруг героя ауру, позволяющую ему и союзным героям наносить дополнительный урон и замедлять противника. Ультимативная способность, Walrus PUNCH!, дает Tusk нанесет следующей атакой критический урон и подбросит жертву в воздух. После приземления жертва будет замедлена. Улучшение с Aghanim's Scepter добавляет способность Walrus Kick, которая пинает цель и замедляет на некоторое время.",
  "history": "Славная была потасовка! После нее в таверне «Волчья дыра» на ногах остался стоять лишь Имир — он же Бивень, он же Ужас из Барьера, он же Снежный ком из Кобальта и единственный, кому удалось одолеть одного небезызвестного вышибалу с иглами на спине. Все началось с безобидного спора «кто кого?», что не редкость среди завсегдатаев заведений подобного рода. В итоге у трактирщика не осталось ни одной целой бутылки, кувшина или стула, а в глубокий нокаут отправились четверо здешних постояльцев, один кузнец и шестеро лучших вояк Морозной дружины. Созерцая эту картину, Имир провозгласил громкий тост в свою честь и осушил кружку хмельного. Как только проигравшие пришли в себя, тут же начали требовать реванша и ставок повыше. Имиру это было лишь в радость, вот только он сомневался, что у этих бедолаг еще что-то осталось из наличности. Видя весь этот погром и пытаясь любым способом предотвратить очередной дебош, трактирщик пошел на хитрость. Поскольку Имир, несмотря на свои отменные боевые качества, никогда не участвовал в реальной битве, не ведал хаоса, творящегося на поле брани, и не знал, какой неразборчивой порой бывает смерть, трактирщик предложил ему новое пари: принять участие в самом масштабном сражении, неважно за какую сторону, при этом выжить и разгромить врага. Ну а что на кону? Конечно же, добротная порция выпивки за счет заведения.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−8 сек. перезарядки Snowball",
      "talentRight": "Walrus PUNCH! сработает при атаке с шансом в 12%"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+80% к критическому урону от Walrus PUNCH!",
      "talentRight": "−6 сек. перезарядки Ice Shards"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+120 к урону от Snowball",
      "talentRight": "+325 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0,4 сек. оглушения от Walrus Punch",
      "talentRight": "+25 к урону от Tag Team"
    }
  ]
}