{"abilities":[{"spell":"Launches a salvo of rockets at nearby enemy units in a radius around the Gyrocopter. Lasts 3 seconds.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Rocket Barrage interrupts Gyrocopter's channeling spells upon cast.","Despite the visual effects, the damage is dealt instantly, rather than on each rocket's impact.","Rocket Barrage cannot hit invisible units or units in the Fog of War.","Gyrocopter can act freely during Rocket Barrage.","Does not fire rockets while Gyrocopter is hidden.","Deals damage in 0.1 second intervals, resulting in 30 damage instances.","Can deal a total of 210\/360\/510\/660 ( 540\/690\/840\/990) damage (before reductions), assuming all rockets hit."],"mana":"90","elements":["Does not pierce spell immunity."],"cooldown":"7\/6.5\/6\/5.5","name":"Rocket Barrage","description":["Cast Animation: 0+0","Search Radius: 400","Rockets per Second: 10","Damage per Rocket: 7\/12\/17\/22 ( 18\/23\/28\/33)","Barrage Duration: 3"],"hot_key":"Q","legacy_key":"R"},{"spell":"Fires a homing missile to seek the targeted enemy unit. The missile gains speed over time, dealing damage and stunning when it impacts the target. Enemy units can destroy the missile before it reaches its target.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["When Cast, a stationary missile is placed 150 range in front of Gyrocopter, which begins to move 3 seconds later.","Homing Missile's initial speed is 500 and increases by 20 per second, growing by 1 every 0.05 seconds. The speed acceleration is not capped, and continues to increase until it hits the target or is destroyed.","If the missile's target dies, it automatically switches to the nearest valid target within 700 range of the previous target.","Only attacks from heroes, illusions (counting as heroes), towers, and the fountains (counting as towers) can damage the missile.","The rocket first applies the debuff, then the damage.","The crosshair over the target is visible to allies only.","Although the spell grants no vision over the target, the missile follows and hits invisible units.","If the missile hits its target, its 400 range flying vision stays at the location for 3.5 seconds.","The missile can be targeted by Force Staff and Hurricane Pike, pushing the rocket forwards (or backwards). The missile cannot impact the target during the forced movement, and passes through, reorients, and continues to chase the target.","When the missile gets affected by Chronosphere it gets instantly destroyed."],"mana":"120\/130\/140\/150","elements":["Cannot be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"26\/21\/16\/11 ( 0)","name":"Homing Missile","description":["Cast Animation: 0+0","Cast Range: 1050","Hero Attacks to Destroy: 3","Tower Attacks to Destroy: 6","Damage: 100\/175\/250\/325","Stun Duration: 2.25\/2.5\/2.75\/3 ( 2.75\/3\/3.25\/3.5)","Number of Charges: 0 ( 3)","Charge Replenish Time: 0 ( 26\/21\/16\/11)"],"hot_key":"W","legacy_key":"E"},{"spell":"Gyrocopter's attacks hit all enemy units in an area around it for a limited number of attacks. Only the main target of attacks will receive attack bonuses such as Critical Strike. Lasts 15 seconds or until the attacks are used.","effects":["Ability No Target","Affects Enemies","Damage Instant Attack"],"notes":["Flak Cannon interrupts Gyrocopter's channeling spells upon cast.","Causes Gyrocopter to perform instant attacks on all nearby enemies whenever he launches an attack projectile. This means all projectiles are released at the same time together with the main attack. Therefore, it does not matter whether the primary attack misses or not, the flaks are still released. The flaks have no count limit. All valid nearby targets get attacked. Flaks are not launched when the Side Gunner attacks.","The primary attack target is not affected by Flak Cannon. It is only hit by the primary attack.","The projectiles from the instant attacks travel at a speed of 800.","Unlike most other instant attacks, the ones from Flak Cannon may not proc any attack modifiers or on-hit effects. However, they still count as regular attacks. Damage done by Flak Cannon does not count as spell damage. They are also affected by armor type, and blocked by Damage Block like regular attacks. The flaks can miss to evasion or if Gyrocopter is blinded, unless he has True Strike.","Does not target couriers, wards, buildings, invisible units, or units inside the Fog of War. However, attacking couriers, wards, buildings, or allied units still causes flaks to hit all valid targets within the radius.","The number of attacks left is visible (to everyone) on the buff icon.","The visual effect above Gyrocopter while active is visible to everyone."],"mana":"50","elements":["Cannot be used by illusions.","Can be disjointed.","Pierces spell immunity."],"cooldown":"40","name":"Flak Cannon","description":["Cast Animation: 0+0","Search Radius: 1250","Number of Attacks: 3\/4\/5\/6","Duration: 15"],"hot_key":"E","legacy_key":"F"},{"spell":"Call down an aerial missile strike on enemy units in a target area. After 2 seconds, two missiles arrive in succession, with 2 seconds between them, the first dealing major damage and minor slow for 2 seconds; the second dealing minor damage and major slow for 4 seconds.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The first missile impacts 2 seconds and the second missile 4 seconds after cast.","Provides 300 radius flying vision at the targeted area for 4 seconds upon cast.","Can deal a total of 250\/400\/550 damage (before reductions), assuming both missiles hit.","The rockets first applies their debuffs, then their damage.","The big red area indicator is visible to allies only, but the sound effects are audible and the missiles visible to everyone."],"mana":"125","elements":["Does not pierce spell immunity."],"cooldown":"55\/50\/45 ( 30\/25\/20)","name":"Call Down","description":["Cast Animation: 0.3+0.5","Cast Range: 1000 ( Global)","Effect Radius: 600","Delay per Rocket: 2","Missile One Damage: 150\/250\/350","Missile Two Damage: 100\/150\/200","Missile One Move Speed Slow: 30%","Missile Two Move Speed Slow: 60%","Missile One Slow Duration: 2","Missile Two Slow Duration: 4"],"hot_key":"R","legacy_key":"C"},{"spell":"A Side Gunner that at random attacks enemy units within a 700 radius every 1.2 seconds.","effects":["Ability Passive","Affects Enemies","Damage Instant Attack"],"notes":["Requires Aghanim's Scepter in the active inventory, or an Aghanim's Scepter buff to be unlocked.","The Side Gunner is not bound to any of Gyrocopter's spells and is not visible in the HUD. However, its values are in Flak Cannon's description.","The Side Gunner performs an instant attack in the set interval. Its target is chosen randomly, but prioritizes the furthest unit within range. Since it uses instant attacks, it neither interferes with the regular attacks, nor does it use animations. It also ignores disarms. It does not interfere with any other actions of Gyrocopter either. It still attacks while e.g. stunned or while channeling. The gunner can proc any attack modifier or any on-hit effect like a regular attack, except for Flak Cannon. The gunner can miss to evasion or if Gyrocopter is blinded, unless he has True Strike.","The Side Gunner uses the same 3000 projectile speed as Gyrocopter's attack.","The Side Gunner does not attack when Gyrocopter is hidden, invisible, or affected by Break. However, the gunner ignores fade times and fade delays of spells. It only does not attack when fully invisible.","The Side Gunner does not attack wards and couriers, but does attack buildings. Only attacks units Gyrocopter has vision over.","The Side Gunner completely ignores attack immune units within its range.","Side Gunner attack speed and range are not affected by anything."],"mana":"0","elements":["Cannot be used by illusions.","Can be disjointed.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Side Gunner","description":["Attack Range: 700","Attack Interval: 1.2"]}],"bio":"After serving through a lifetime of wars, upheaval, riots, and revolutions, the brass figured Aurel had seen enough. But in addition to a few trinkets and his considerable pension, the erstwhile engineer left with something far more interesting: a long-forgotten, incomplete schematic for a Gyrocopter, the world’s first manned, non-magical flying device. Retiring to the tropical obscurity of the Ash Archipelago with little else but time and money, he set to work building the device. As the years wore on and the remains of failed prototypes began to pile up, he began to wonder if mechanical flight was even possible. A decade and a day after his retirement, on a sunny afternoon with a southerly breeze, Aurel sat in his latest attempt bristling with indignation and expectant failure. With a grunt of effort he pulled the ignition cord and covered his head, waiting for the inevitable explosion. However to his great surprise he began to lift and, following a few panicked adjustments, stabilize. Within an hour, he was ducking and weaving with the breeze, level with the gulls, and Aurel found himself filled with the breathless wonder of flight. As dusk settled in he set a course back to his workshop, but no sooner had he turned his craft when a cannonball tore through his tailfin. Disentangling himself from the wreckage, he swam toward the nearest piece of land in sight, and cursed to see the ship responsible for the cannonball collecting the debris. Days later, when Aurel returned to his workshop, he set to work on yet another gyrocopter, this one capable of carrying a much heavier, more dangerous payload.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Aurel Vlaicu was a Romanian pioneer of early flight.","Gyrocopter's response upon meeting Viper \"Holy shit, it's Viper!\" is a reference to a scene of the movie Top Gun.","Gyrocopter's helmet is similar to Gaetan \"The Mole\" Moliere's headgear from Atlantis: The Lost Empire.","Gyrocopter's response upon using homing missile \"Fox Two\" is a reference to the NATO brevity code for an air-to-air infrared-guided missile launch."],"talents":["Global Call Down:3 Homing Missile Charges","-25s Call Down Cooldown:+40 Movement Speed","+11 Rocket Barrage Damage:+0.5s Homing Missile Stun Duration","+250 Health:+20 Damage"],"desc":"Aurel, the Gyrocopter, is a ranged agility hero, capable of outputting a lot of single target and area of effect damage at a multitude of ranges. Early game Gyrocopter is a strong ganker, with Rocket Barrage able to output a lot of damage in a short amount of time if he and his target are alone. His second ability, Homing Missile, is a long range projectile that forces opponents to either stop and engage to take out the missile, or run to a safe location before being stunned. Thanks to his third ability, Flak Cannon, he is also an excellent pusher, and with it can farm up big items in the midgame as his spells start to fall off in damage. Flak Cannon also allows him to hit everyone in a teamfight with his attacks, and with enough damage items he can inflict a lot of damage to the entire enemy team. Call Down is a useful ultimate with a low cooldown, providing a large area slow and nuke making it great for team fights. With the right items, he can also transition into a carry role."}