{"abilities":[{"spell":"Запускает ракеты залпом на ближайших вражеских юнитов вокруг Gyrocopter. Длится 3 секунды.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Rocket Barrage прерывает произносимые способности Gyrocopter.","Вопреки визуальным эффектам урон наносится мгновенно, а не при каждом попадании ракет.","Rocket Barrage не поражает невидимых юнитов или юнитов в тумане войны.","Gyrocopter может свободно действовать, пока активна Rocket Barrage.","Не выпускает ракеты, если Gyrocopter спрятан.","Наносит урон с интервалом в 0,1 секунды, срабатывая 30 раз.","Может нанести до 210\/360\/510\/660 ( 540\/690\/840\/990) единиц урона (до учета сопротивления), учитывая все ракеты."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"7\/6,5\/6\/5,5","name":"Rocket Barrage","description":["Анимация применения: 0+0","Радиус: 400","Ракет в секунду: 10","Урона за каждую ракету: 7\/12\/17\/22 ( 18\/23\/28\/33)","Длительность: 3"],"hot_key":"Q","legacy_key":"R"},{"spell":"Запускает самонаводящуюся ракету в цель. Во время полета ракета набирает скорость, а при столкновении с врагом наносит урон и оглушает его. Урон, наносимый ракетой, зависит от дальности ее полета. Пока ракета не достигла своей цели, враги могут ее уничтожить.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["При использовании стационарная ракета размещается в 150 единицах перед Gyrocopter, начиная движение спустя 3 секунды.","Базовая скорость Homing Missile - 500 и она увеличивается на 20 единиц в секунду, ускоряясь на 1 единицу каждые 0,05 секунды. Скорость ускорения не ограничена, поэтому продолжается увеличиваться до поражения цели или разрушения ракеты.","Если выбранная цель умирает, то ракета автоматически переключится к ближайшей подходящей цели в радиусе 700 единиц от предыдущей.","Может быть атакована только героями, иллюзиями (считаются за героев), башнями и фонтаном (считается за башню).","Ракета сначала применяет дебафф, затем наносит урон.","Отметка над целью видна только союзникам.","Несмотря на то, что заклинание не дает обзора на цель, ракета следует и поражает невидимых юнитов.","Если ракета поражает цель, то вокруг неё в радиусе 400 единиц появляется летающий обзор на 3,5 секунды.","Ракета может быть выбрана Force Staff и Hurricane Pike, подталкивая её вперед (или отталкивая назад). Ракета под действием принудительного движения не может попать в цель, поэтому проходит сквозь неё, меняя положение в пространстве, и продолжает её преследование.","Если на ракету действует Chronosphere, то она мгновенно разрушается."],"mana":"120\/130\/140\/150","elements":["Нельзя избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"26\/21\/16\/11 ( 0)","name":"Homing Missile","description":["Анимация применения: 0+0","Дальность применения: 1050","Ударов героя для уничтожения: 3","Ударов башни для уничтожения: 6","Урон: 100\/175\/250\/325","Длительность оглушения: 2.25\/2.5\/2.75\/3 ( 2.75\/3\/3.25\/3.5)","Количество зарядов: 0 ( 3)","Время восстановления заряда: 0 ( 26\/21\/16\/11)"],"hot_key":"W","legacy_key":"E"},{"spell":"Атаки Gyrocopter наносят урон всем вражеским юнитам вокруг него в течение ограниченного количества атак. Только главная цель атак получит бонусы атаки, такие как критический удар. Длится 15 секунд или до тех пор, пока не израсходуются все атаки.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["При использовании Flak Cannon прерывает произносимые способности Gyrocopter.","Позволяет Gyrocopter совершать мгновенные атаки по всем врагам поблизости при запуске основного снаряда от атаки. То есть все снаряды выпускаются одновременно с основной атакой. При этом неважно, попала или промахнулась основная атака, дополнительные ракеты все равно будут выпущены. Для ракет нет ограничений по количеству. Атакованы будут все ближайшие подходящие цели. Ракеты не выпускаются при срабатывании автоматической турели.","На основную цель атаки не действует Flak Cannon. Способность поражает только вторичные цели.","Снаряды от мгновенной атаки летят со скоростью в 800 единиц.","В отличии от других мгновенных атак на Flak Cannon не могут сработать модификаторы атаки или эффекты, срабатывающие при атаке. При этом они продолжают считаться обычными атаками. Урон, наносимый Flak Cannon, не считается за урон заклинаний. Также на эти атаки (как и на обычные) влияет тип брони и их может заблокировать блокировка урона. Ракеты могут промахнутся из-за уклонения или если Gyrocopter ослеплен, кроме случая, когда у него есть эффект True Strike.","Не считает целями курьеров, варды, строения, невидимых юнитов или юнитов в тумане войны. При этом атака курьеров, вардов, строений или союзных юнитов выпускает ракеты по всем ближайшим подходящим целям в радиусе.","Количество оставшихся атак видно всем в иконке баффа.","Визуальный эффект над Gyrocopter, появляющийся при активации, виден всем."],"mana":"50","elements":["Не может использоваться иллюзиями.","Можно избежать.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"40","name":"Flak Cannon","description":["Анимация применения: 0+0","Радиус: 1250","Количество атак: 3\/4\/5\/6","Длительность: 15"],"hot_key":"E","legacy_key":"F"},{"spell":"Вызывает воздушный удар на выбранную область. С неба падает 2 снаряда: первый наносит большой урон и немного замедляет всех в области на 2 секунды, а второй наносит незначительный урон, но сильно замедляет врагов на 4 секунды.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Первый снаряд действует спустя 2 секунды, второй - спустя 4 секунды после применения.","При применении дает летающий обзор в радиусе 300 единиц вокруг выбранной области на 4 секунды.","Может нанести до 250\/400\/550 единиц урона (до учета сопротивления), учитывая успешное воздействие двух снарядов.","Снаряды сначала применяют дебафф, затем наносят урон.","Большой красный индикатор-область виден только союзникам, но звуковые эффекты слышны и снаряды видны всем."],"mana":"125","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"55\/50\/45 ( 30\/25\/20)","name":"Call Down","description":["Анимация применения: 0,3+0,5","Дальность применения: 1000 ( Глобальная)","Радиус: 600","Урон первого снаряда: 150\/250\/350","Урон второго снаряда: 100\/150\/200","Замедление скорости передвижения от первого снаряда: 30%","Замедление скорости передвижения от второго снаряда: 60%","Длительность замедления от первого снаряда: 2","Длительность замедления от второго снаряда: 4"],"hot_key":"R","legacy_key":"C"},{"spell":"Автоматическая турель, которая каждые 1,1 секунды стреляет по случайной вражеской цели в радиусе 600.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Требует Aghanim's Scepter в активном инвентаре, или бафф от Эссенция Aghanim's Scepter.","Автоматическая турель не связана ни с каким заклинанием Gyrocopter и не отображается в интерфейсе. При этом её значения находятся в описании Call Down.","Автоматическая турель совершает мгновенную атаку с установленным интервалом. Цель для неё выбирается случайно. Поскольку способность использует мгновенную атаку, то она не мешает обычным атакам и не использует их анимацию атаки. Также турель игнорирует обезоруживание. Также способность не мешает остальным действиям Gyrocopter. Она продолжает атаковать при оглушении владельца или при произнесении им заклинания. На турель может сработать любой модификатор атаки или эффект, срабатывающий от атаки за исключением Flak Cannon. Турель может промахнутся из-за уклонения или если Gyrocopter ослеплен, кроме случая, когда у него есть эффект True Strike.","Автоматическая турель использует ту же скорость снаряда в 3000 единиц, что и атака Gyrocopter.","Автоматическая турель не атакует, если Gyrocopter спрятан, невидим или на него действует истощение. Но при этом турель игнорирует время до невидимости и задержку невидимости заклинаний. Турель не атакует только при полной невидимости владельца.","Автоматическая турель не атакует варды и курьера, но атакует строения. Турель атакует юнитов только в случае, если у Gyrocopter есть на них обзор.","На скорость и дальность атаки турель ничто не может повлиять."],"mana":"0","elements":["Не может использоваться иллюзиями.","Можно избежать.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Автоматическая турель","description":["Дальность атаки: 600","Интервал между атаками: 1,1"]}],"bio":"Отслужив всю свою жизнь и побывав во всяческих восстаниях, бунтах, повстанческих нашествиях и революциях, старый вояка Аурел понял, что больше он так не может. Но вдобавок к парочке причиндалов и солидной пенсии бывший инженер удалился на отдых с кое-чем поинтереснее: давно забытый, незавершенный чертеж Gyrocopter, первого пилотируемого не магического летательного аппарата в мире. Обустроившись на заслуженные пенсионные годы в удаленных тропиках Архипелага Эш, где у него было в избытке времени и денег, он решил приступить к работе над машиной. Шли годы, а несработавшие прототипы продолжали скапливаться в огромную кучу - и он начал сомневаться, был ли вообще возможен механический полет. Десятилетие и один день спустя своей отставки, в солнечный вечер, когда дул южный бриз, Аурел сел в свое последнее творение, сверкая негодованием и уже чувствуя надвигающийся провал. Прорычав, он с силой потянул шнур зажигания и прикрыл голову, ожидая неизбежного взрыва. Однако, к его величайшему удивлению, он вдруг начал подниматься, и, после нескольких панических поправок, выравниваться. Спустя час он уже с легкостью совершал виражи и следовал за дуновением ветра, летал на одном уровне с чайками, и тогда Аурел ощутил, что наполнен неописуемым восторгом полета. Когда солнце начало садиться, он направил курс обратно в свою мастерскую, но стоило ему развернуть аппарат, как пушечное ядро пробило его хвост. Высвободившись из сбитого прототипа, он доплыл до ближайшего куска земли, и, собирая обломки, поклялся вновь увидеть корабль, который выпустил то ядро. Дни спустя, когда Аурел вернулся в мастерскую, он приступил к работе над очередным Gyrocopter - таким, который смог бы переносить более тяжелый, более опасный груз.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Имя героя Aurel Vlaicu (Аурел Влайку), является отсылкой к одноименному Румынскому пилоту, инженеру и одного из лучших асов раннего полета в начале XX века.","Реплика Gyrocopter в приветствии героя Viper \"Holy shit, it's Viper!\" является отсылкой к фильму Лучший стрелок.","Gyrocopter's helmet is similar to Gaetan \"The Mole\" Moliere's headgear from Atlantis: The Lost Empire."],"talents":["Неограниченная дальность применения Call Down:3 заряда Homing Missile","-25 сек. перезарядки Call Down:+40 к скорости передвижения","+11 к урону за ракету от Rocket Barrage:+0,5 сек. оглушения от Homing Missile","+250 к здоровью:+20 к урону"],"desc":"Gyrocopter — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Rocket Barrage, запускает ракеты залпом на ближайших вражеских юнитов вокруг Gyrocopter, нанося немалый урон. Вторая способность, Homing Missile, запускает самонаводящуюся ракету в цель. Во время полета ракета набирает скорость, а при столкновении с врагом наносит урон и оглушает его. Урон, наносимый ракетой, зависит от дальности ее полета. Пока ракета не достигла своей цели, враги могут ее уничтожить. Третья способность, Flak Cannon, позволяет наносить урон всех вражеским юнитам вокруг Gyrocopter в течение ограниченного количества атак. Ультимативная способность, Call Down, вызывает воздушный удар на выбранную область. С неба падает 2 снаряда: первый наносит большой урон и немного замедляет всех в области, а второй наносит незначительный урон, но сильно замедляет врагов. Улучшение с Aghanim's Scepter увеличивает урон второго снаряда и добавляет автоматическую турель которая атакует случайных врагов в радиусе 600 каждые 1,1 секунды."}