{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Unlike regular heal amplification, Greater Healing amplifies outgoing healing, not incoming healing. This means any healing provided by the owner gets ampified, regardless of who the target is. Vice versa, other sources of healing applied to the owner are not amplified.",
        "This means any healing provided by the owner gets ampified, regardless of who the target is.",
        "Vice versa, other sources of healing applied to the owner are not amplified.",
        "Health regen amplification, lifesteal amplification, and spell lifesteal amplification are provided by the item separately, and not by this ability.",
        "Multiple instances of Greater Healing do not stack.",
        "Stacks diminishingly with other sources of heal amplification."
      ],
      "mana": null,
      "abilityName": "Greater Healing",
      "cooldown": null,
      "description": "Amplifies the wearer's Regeneration, Healing, Lifesteal and Spell Lifesteal by 14%.",
      "params": [
        "Heal Amplification: 14%"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Paladin Swords are fully sharable.",
    "Stacks additively with other sources of lifesteal.",
    "The health regen amplification stacks diminishingly with other sources of health regen amplification.",
    "The lifesteal amplification stacks diminishingly with other sources of lifesteal amplification.",
    "The spell lifesteal amplification stacks diminishingly with other sources of spell lifesteal amplification."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Paladin Sword",
  "description": "The sigil blade of the legendary Brother Yhols of Gausra, stripped from its scabbard on the day of his controversial excommunication.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+20 Attack Damage",
    "+16% Lifesteal",
    "+14% Health Regen Amplification",
    "+14% Lifesteal Amplification",
    "+14% Spell Lifesteal Amplification"
  ],
  "tips": null
}