{"abilities":[{"spell":"Spectre flings a dagger to draw a Shadow Path, dealing damage and slowing the movement speed of any enemies along the trail. Units hit by the dagger also trail a Shadow Path. While treading the path, Spectre phases through otherwise impassable terrain.","effects":["Ability Target Point \/ Target Unit","Affects Self \/ Enemies","Damage Magical"],"notes":["The Spectral Dagger travels at a speed of 800.","Can directly target heroes and creep-heroes. When targeting a hero, the dagger homes in on the target until reaching it.","When targeting the ground or creep-heroes, the dagger travels 2000 range in a straight line. It does not home in on creep-heroes.","Every enemy unit which comes within 125 range of the traveling dagger gets damaged.","Hit enemy heroes and illusions also receive the Spectral Dagger debuff, making them trail a shadow path like the dagger itself. This debuff also grants shared vision over the enemy heroes, revealing their silhouette when invisible.","Spectre and enemies gain the Spectral Dagger In Path modifier while on the path, increasing her\/decreasing their movement speed. This modifier lingers for 4 seconds after leaving the path. The modifier only refreshes from the same source. Meaning that spectre will not be slowed by an enemy Spectral Dagger when she has the buff modifier.","Spectre also gains the Spectral Dagger Path Phased buff, which grants her unobstructed movement. This buff lingers for 1 second after leaving the path.","The shadow path's segments last 12 seconds from the moment on they were created, not as the spell was cast.","The shadow path grants 200 radius flying vision around itself."],"mana":"100\/120\/140\/160","elements":["Cannot be used by illusions.","Cannot be disjointed.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"16 ( 6)","name":"Spectral Dagger","description":["Cast Animation: 0.3+0.37","Cast Range: 2000","Effect Radius: 125","Damage: 90\/140\/190\/240","Move Speed Slow\/Bonus: 10%\/14%\/18%\/22% ( 28%\/32%\/36%\/40%)","Path Duration: 12","Path Creator Duration: 7","Move Speed Slow\/Bonus Linger Duration: 4","Free Pathing Linger Duration: 1"],"hot_key":"Q","legacy_key":"D"},{"spell":"Deals bonus damage whenever Spectre attacks an enemy who is alone. Reduces the enemy vision for 5 seconds.","effects":["Ability Passive","Affects Enemies","Damage Pure"],"notes":["Desolate's effects are applied upon finishing an attack, regardless of whether the attack actually hits the target or not. This means Desolate applies its effects even when the leading attack misses the target. When used by ranged heroes, this means the effect is applied on projectile launch, not hit.","The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","Works against any enemy unit, except for wards and buildings.","Desolate completely ignores nearby wards, buildings, invulnerable and hidden units. This means that Desolate still deals its damage when the target only has any of the above as allies nearby.","Only checks for allies of the target, meaning nearby neutral creeps do not prevent it from dealing damage to units of the enemy team, and vice versa.","The vision reduction is applied after all vision bonuses, except for Moon Shard. Reduces vision before Dark Ascension does, but whichever results in lower vision takes priority."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Desolate","description":["Radius: 500","Damage: 20\/30\/40\/50 ( 35\/45\/55\/65)","Vision Reduction: 40%\/50%\/60%\/70%","Duration: 5"],"hot_key":"W","legacy_key":"L"},{"spell":"Damage done to Spectre is reflected on her enemies, leaving her unharmed. The effect lessens with distance.","effects":["Ability Passive","Affects Self \/ Enemies","Damage HP Removal"],"notes":["Grants Spectre incoming damage reduction, increasing her survivability against any damage by 8%\/14%\/20%\/28% ( 15%\/22%\/30%\/39%).","Dispersed damage is returned as the same damage type as it was received.","The damage from Dispersion is flagged as HP Removal, so it does not trigger any on-damage effects.","Dispersion reflects the damage before any form of damage manipulation.","Always reflects a percentage of the full damage value, no matter how much health Spectre had left when she received the damage. This means it reflects overkill damage dealt to Spectre, so if a damage source exceeded Spectre's current health and killed her, the reflected damage is based on the full damage value.","Dispersion reflects the damage right before it is actually done to Spectre, so if both Spectre and an enemy would die to the damage simultaneously, the enemy is always killed first.","Reflected damage is not divided between enemies. All of them take the full reflected damage.","The damage dealt decreases linearly from a 300 radius to a 700 radius from Spectre.","This is how much damage Dispersion deals to enemies at certain distances: 300 Distance: 7%\/12%\/17%\/22% ( 13%\/18%\/23%\/28%) of dealt damage 400 Distance: 5.25%\/9%\/12.75%\/16.5% ( 9.75%\/13.5%\/17.25%\/21%) of dealt damage 500 Distance: 3.5%\/6%\/8.5%\/11% ( 6.5%\/9%\/11.5%\/14%) of dealt damage 600 Distance: 1.75%\/3%\/4.25%\/5.5% ( 3.25%\/4.5%\/5.75%\/7%) of dealt damage"],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Dispersion","description":["Minimum Radius: 300","Maximum Radius: 700","Damage Reflected: 7%\/12%\/17%\/22% ( 13%\/18%\/23%\/28%)"],"hot_key":"E","legacy_key":"I"},{"spell":"Creates a spectral nemesis to attack each enemy hero after a short delay. At any moment during the duration, Spectre can use Reality to exchange places of a given haunt. Haunt illusions are uncontrollable, take extra damage, and deal less damage than Spectre herself. They move at 400 base movement speed and ignore terrain.","effects":["Ability No Target","Affects Enemy Heroes"],"notes":["Haunt illusions are selectable, but uncontrollable.","The illusions have 400 movement speed and unobstructed pathing.","The illusions spawn 58 range away from their targets, at a random spot around them.","The illusions start attacking their targets 1 second after being spawned.","They do not attack but still follow invisible units. They also spawn on and follow invulnerable and hidden units.","Haunt illusions spawn for enemy Divided We Stand clones, but not for other clones or illusions.","The illusions disappear once their target dies."],"mana":"150\/200\/250","elements":["Pierces spell immunity."],"cooldown":"180\/150\/120","name":"Haunt","description":["Cast Animation: 0.3+0.5","Radius: Global","Illusion Damage Dealt: 40%\/60%\/80% ( 80%\/100%\/120%)","Illusion Damage Taken: 200%","Haunt Duration: 5\/6\/7"],"hot_key":"R","legacy_key":"T"},{"spell":"Spectre exchanges places with a chosen Haunt.","effects":["Ability Target Point \/ Target Unit","Affects Self"],"notes":["Reality is unlocked upon learning Haunt and always stays active.","Does not disjoint projectiles upon cast.","When targeting ground, Spectre exchanges places with the closest Haunt illusion from the targeted point.","Can be cast multiple times until Haunt ends or all Haunt illusions are dead.","After swapping positions, the Haunt illusion still walks towards its target and attacks it."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Reality","description":["Cast Animation: 0+0.7","Cast Range: Global"],"hot_key":"D","legacy_key":"R"},{"spell":"Allows you to perform a single target unit Haunt.","effects":["Ability Target Unit","Affects Enemy Heroes"],"notes":["Requires Aghanim's Scepter to be unlocked.","The level of this Shadow Step scales with the level of the main Haunt.","The Haunt illusion is selectable, but uncontrollable.","The illusion has 400 movement speed and unobstructed pathing.","The illusion spawns 58 range away from the target, at a random spot around them.","The illusion starts attacking the target 1 second after being spawned.","It does not attack but still follows the target if it turns invisible.","The illusion disappears once the target dies.","Cannot be cast on creep-heroes."],"mana":"180","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"70","name":"Shadow Step","description":["Cast Animation: 0.3+0.5","Cast Range: Global","Illusion Damage Dealt: 40%\/60%\/80% ( 80%\/100%\/120%)","Illusion Damage Taken: 200%","Haunt Duration: 5\/6\/7"],"hot_key":"F","legacy_key":"E"}],"bio":"Just as higher states of energy seek a lower level, the Spectre known as Mercurial is a being of intense and violent energy who finds herself irresistibly drawn to scenes of strife as they unfold in the physical world. While her normal spectral state transcends sensory limitations, each time she takes on a physical manifestation, she is stricken by a loss of self--though not of purpose. In the clash of combat, her identity shatters and reconfigures, and she begins to regain awareness. She grasps that she is Mercurial the Spectre--and that all of her Haunts are but shadows of the one true Spectre. Focus comes in the struggle for survival; her true mind reasserts itself; until in the final moments of victory or defeat, she transcends matter and is restored once more to her eternal form.","talentsTips":["The all stats talent effectively grants Spectre 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["The name Mercurial most likely comes from the DeviantART account of Kenneth Tan, the person who made the 6.28-6.32 loadscreen. 6.28 is also the version in which Spectre got released in DotA.","\"Mercurial\" means \"swift, shrewd, and deceitful\", which is attributed to the Roman god of thieves, Mercury, as Spectre is an agile and quick Hero. It can also refer to the planet Mercury, since Spectre is an otherworldly entity. Mercurial can also hint towards the element Mercury, often called \"quicksilver,\" which is another reference to Spectre's speed and mobility. When used as an personal adjective, mercurial can mean a personality quick to change and dangerous to both the person receiving and transmitting. Someone quick to forgive and quick to anger would be mercurial, but not someone who holds grudges or holds none. See Mercutio (obviously named) from Romeo and Juliet.","Spectre's alternate\/fun name \"Qwerty-\" was given to her for remembering a legendary Dota player Zaven \"Qwerty\" Terminasov, who died on December 5, 2010.","Spectre's voice responses are overlayed with the same track playing backwards, bearing a huge similarity to the Spirit of Vengeance's voice in Warcraft III: Frozen Throne, which is also the voice of Spectre in DotA.","Spectre has fewer model animations than any other hero in the game."],"talents":["+6% Dispersion:+40% Haunt Illusion Damage","+18% Spectral Dagger Slow\/Bonus:+500 Health","-10s Spectral Dagger Cooldown:+15 Desolate Damage","+5 All Stats:+6 Health Regen"],"desc":"Mercurial the Spectre is a melee agility hero, adept at dealing pure damage to lone targets, and is powerful both offensively and defensively. Spectral Dagger provides a significant amount of mobility, allowing Spectre to go through objects, units and terrain while slowing foes that come in contact with the shadowy path left by her Spectral Dagger. Desolate allows her to inflict high pure damage to enemy heroes when she catches them alone. Dispersion reduces and reflects all damage, whether by attacks or spells, to an area around her. Dispersion gives her great durability, especially when equipped with items that provide health, armor, and damage block. Finally, her Haunt creates a malevolent spectral illusion to all enemy heroes in the map. Haunt lets Spectre wreak havoc in clashes and ganks, while her allies take advantage of the confusion. Spectre can use Reality during the Haunt, instantly teleporting her to her illusion to take its form. This lets her hound her victim anywhere on the map. Mercurial is a dangerous supernatural being, relentless as she can chase and stalk down her victim to a global range, unhindered by boundaries. Her kit allows her to play the role of the team's hard carry by applying an immense amount of pressure in late game team fights. More specifically, the damage reflection from Dispersion makes it disadvantageous for teams to focus her. Her abilities have a complex nature, and newer players should generally not play Spectre as she is extremely farm and level dependent. It is best to face Spectre with allied help and strength, as encountering her alone is not always the best option."}