{"abilities":[{"spell":"Spectre бросает кинжал, наносящий урон и оставляющий теневой след, который замедляет всех врагов. Враги, пораженные кинжалом, также будут оставлять за собой след. Двигаясь по нему, Spectre преодолевает любую непроходимую территорию.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Spectral Dagger летит со скоростью 800 единиц.","Может напрямую выбирать героев и крипов-героев. При выборе героя кинжал будет следовать за целью до момента, пока её не достигнет.","При выборе точки на земле или крипа-героя кинжал летит по прямой на расстояние 2000 единиц. Он не следует за крипом-героем.","Каждый вражеский юнит, попавший в радиус 125 единиц летящего кинжала, получит урон.","Поражает вражеских героев и иллюзии, также накладывая дебафф от Spectral Dagger, который создает за ними след из тени как и обычный кинжал. Этот дебафф также дает общий обзор на вражеских героев, оставляя видимым их силуэт в невидимом состоянии.","Spectre и враги при нахождении на следе получают модификатор \"Spectral Dagger In Path\", увеличивая её и снижая их скорость передвижения. Модификатор сохраняется еще 4 секунды после ухода с тени.","Spectre также получает бафф Spectral Dagger Path Phased, который позволяет ей перемещаться по непроходимой территории. Бафф задерживается на 1 секунду после ухода с следа.","Части теневого следа длятся 12 секунд, начиная с момента, когда они были созданы, а не когда была использована способность.","След дает летающий обзор в радиусе 200 единиц вокруг себя."],"mana":"100\/120\/140\/160","elements":["Не может использоваться иллюзиями.","Нельзя избежать.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"16 ( 6)","name":"Spectral Dagger","description":["Анимация применения: 0,3+0,37","Дальность применения: 2000","Радиус: 125","Урон: 90\/140\/190\/240","Доп. скорость передвижения\/Замедление: 10%\/14%\/18%\/22% ( 28%\/32%\/36%\/40%)","Длительность: 12"],"hot_key":"Q","legacy_key":"D"},{"spell":"Каждая атака наносит дополнительный урон, если рядом с жертвой никого нет. Уменьшает радиус обзора противника на 5 сек.","effects":["Способность Пассивная","Действует на Врагов","Урон Чистый"],"notes":["Урон от Desolate наносится отдельным источником и применяется до нанесения атаки. То есть урон наносится, даже если атака промахнулась.","Действует на любых вражеских юнитов, исключая варды и строения.","Desolate полностью игнорирует наличие рядом вардов, строений, неуязвимых или спрятанных юнитов. То есть Desolate продолжит наносить урон, когда рядом с целью находятся только вышеперечисленные юниты в качестве союзников.","Проверяет наличие только союзных для цели юнитов, поэтому ближайшие нейтральные крипы не предотвращают нанесение урона юнитам вражеской команды и наоборот.","Снижение обзора применяется после всех бонусов, исключая Moon Shard. Снижает обзор до Darkness, но приоритет будет за способностью, которая сильнее снижает обзор."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Desolate","description":["Радиус: 500","Дополнительный урон: 20\/35\/50\/65 ( 35\/50\/65\/80)","Уменьшение обзора: 40%\/50%\/60%\/70%","Длительность: 5"],"hot_key":"W","legacy_key":"L"},{"spell":"Урон, причиненный Spectre, отражается на ее врагов, не нанося ей повреждений. Эффект ослабевает с расстоянием.","effects":["Способность Пассивная","Действует на Себя \/ Врагов","Урон Отнимающий здоровье"],"notes":["Дает Spectre снижение входящего урона, увеличивая её выживаемость против любого урона на 8%\/14%\/20%\/28% ( 15%\/22%\/30%\/39%).","Dispersed отражает тот тип урона, который был получен.","Урон от Dispersion отмечен как отнимающий здоровье, поэтому на него не реагируют любые эффекты, реагирующие на урон.","Dispersion отражает урон до любого вида манипуляции уроном.","Всегда отражает процент от полного значения наносимого урона, при этом не важно, достаточно ли осталось здоровья у Spectre до получения урона. То есть способность отражает излишний урон, убивающий Spectre, поэтому если источник урона превышает текущее здоровье Spectre и убивает её, то отраженный урон основан на полном значении нанесенного урона.","Dispersion отражает урон до нанесения его Spectre, поэтому если Spectre и её противник одновременно умирают от урона, то враг всегда умирает первым.","Отраженный урон не распределяется между противниками. Каждый противник получает полный урон.","Урон снижается с расстояния 300 до 700 от Spectre.","Здесь указано, сколько урона Dispersion нанесет врагам на определенном расстоянии: Расстояние в 300 единиц: 7%\/12%\/17%\/22% ( 13%\/18%\/23%\/28%) от нанесенного урона Расстояние в 400 единиц: 5.25%\/9%\/12.75%\/16.5% ( 9.75%\/13.5%\/17.25%\/21%) от нанесенного урона Расстояние в 500 единиц: 3.5%\/6%\/8.5%\/11% ( 6.5%\/9%\/11.5%\/14%) от нанесенного урона Расстояние в 600 единиц: 1.75%\/3%\/4.25%\/5.5% ( 3.25%\/4.5%\/5.75%\/7%) от нанесенного урона"],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Dispersion","description":["Минимальный радиус: 300","Максимальный радиус: 700","Отражение урона: 7%\/12%\/17%\/22% ( 13%\/18%\/23%\/28%)"],"hot_key":"E","legacy_key":"I"},{"spell":"Создаёт рядом с каждым вражеским героем спектральную копию, которая атакует его после небольшой задержки. Во время действия владелец способности может применить способность Reality, чтобы поменяться местами с выбранной иллюзией. Иллюзии не находятся под контролем игрока, имеют базовую скорость в 400 единиц, игнорируют препятствия, получают дополнительный урон и наносят меньше урона, чем сам герой.","effects":["Способность Ненаправленная","Действует на Вражеских героев"],"notes":["Иллюзии от Haunt выделяемы, но они неподконтрольны герою.","Скорость передвижения иллюзий - 400 единиц и они могут проходить по непроходимой территории.","Иллюзии появляются в 58 единицах в случайной точке от целей.","Иллюзии начинают атаковать свою цель через секунду после появления.","Иллюзии преследуют невидимых противников, но не атакуют. Также они появляются и следуют за неуязвимыми и спрятанными юнитами.","Иллюзии не появляются возле вражеских иллюзий, но появятся рядом с каждым клоном Meepo и Tempest Double.","Иллюзии исчезают, когда их цель умирает."],"mana":"150\/200\/250","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"140\/130\/120","name":"Haunt","description":["Анимация применения: 0,3+0,5","Радиус: Глобальный","Иллюзии наносят урона: 40%\/60%\/80% ( 80%\/100%\/120%)","Иллюзии получают урона: 200%","Длительность Haunt: 5\/6\/7"],"hot_key":"R","legacy_key":"T"},{"spell":"Spectre замещает собой выбранную иллюзию Haunt.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Себя"],"notes":["Reality разблокируется при изучении Haunt и всегда остается активной.","Использование не позволяет избегать снаряды.","При выборе точки на земле Spectre меняется местами с ближайшей от выбранной точки иллюзией от Haunt.","По иллюзиям можно перемещаться пока действует способность или все иллюзии не умрут.","После перемещения на иллюзию Haunt на месте Spectre появится иллюзия, которая атакует цель."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Reality","description":["Анимация применения: 0+0,7","Дальность применения: Глобальная"],"hot_key":"D","legacy_key":"R"}],"bio":"Равно как самая непостижимая энергия всегда стремится к состоянию покоя, так и Меркуриал, воплощающую неудержимые и жестокие силы, непреодолимо притягивает к сценам раздора, что возникают в материальном мире. Её обычное спектральное состояние превосходит пределы восприятия, и каждый раз, обретая физическую форму, она теряет воспоминания о себе... но не о своей цели. В пылу схватки её личность разбивается и преображается, и вновь начинается процесс самоосознания. Она быстро вспоминает, что имя ей — Меркуриал, а заполонившие поле боя призраки — не более чем тени её самой, единственной и настоящей. В борьбе за выживание приходит концентрация, истинный разум вновь заявляет о себе, и Меркуриал превосходит материю, вновь и вновь возрождаясь в своей вечной форме вплоть до последних моментов победы или поражения.","talentsTips":["Талант на все атрибуты в общем даёт Spectre: 100 здоровья, 0.5 усиления регенерации здоровья, 0.4% сопротивления магии, 0.8 брони, 5 скорости атаки, 0.25% скорости передвижения, 60 маны, 0.25 регенерации маны, 0.35% урона заклинаний и 5 урона от атаки.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Имя Mercurial впервые появилась на DeviantArt, на рисунке Кеннета Тан, человека, который нарисовал загрузочный экран для обновлений 6.28-6.32 ","\"Mercurial\" означает \"быстрый, проницательный и хитрый\", это связано с римским богом Меркурием, покровителем воров, а Spectre является гибким и быстрым Героем. Это может также относиться к планете Меркурий, так как Spectre является потусторонним существом. Mercurial также может намекать на элемент Mercury, часто называемый \"ртутью\", что является еще одной отсылкой к скорости и мобильности призрака.","Альтернативное неофициальное имя — \"Qwerty-\", было дано в честь легендарного игрока в Dota Завена Терминасова, ушедшего из жизни 15 декабря 2010 года.","Голос Spectre является отсылкой к голосу Avatar of Vengeance в Warcraft III и голосу Spectre в Dota I."],"talents":["+6% к Dispersion:Иллюзии Haunt наносят на 40% больше урона","+18% к замедлению\\ускорению врагов\\себя от Spectral Dagger:+500 к здоровью","-10 секунд перезарядки Spectral Dagger:+15 к урону от Desolate","+5 ко всем атрибутам:+6 здоровья в секунду"],"desc":"Меркуриал, Spectre – герой с ближним типом атаки и основной характеристикой ловкость, умеющий наносить чистый урон одиноким целям и мощен как в наступлении, так и в защите. Spectral Dagger обеспечивает значительную мобильность, позволяя Spectre проходить сквозь объекты, существ и ландшафт, замедляя врагов, которые вступают в контакт с теневым следом, оставленным её кинжалом. Desolate позволяет Spectre наносить большой чистый урон вражеским героям, рядом с которыми нет союзников. Dispersion уменьшает и отражает весь урон, будь то атаки или заклинания, в области вокруг Spectre. Dispersion даёт ей большую прочность, особенно при наличии предметов, дающих здоровье, броню и блокировку урона. И наконец, Haunt создаёт злобную спектральную иллюзию для всех вражеских героев на карте. Haunt позволяет Spectre наносить ущерб в столкновениях и при ганках, в то время как её союзники будут вводить врагов в заблуждение. Spectre может использовать Reality во время Haunt, мгновенно телепортируя её к своей иллюзии, чтобы принять её форму. Это позволяет Spectre преследовать свою жертву в любом месте на карте. Меркуриал является опасным сверхъестественным существом, поскольку она может преследовать свою жертву по всей карте. Её набор способностей позволяет ей играть роль фарм в команде, очень сильно воздействуя на врагов в боях в конце игры. Более конкретно, отражение повреждений от Dispersion делает его невыгодным для команд, чтобы сфокусироваться на Spectre. Её способности имеют сложный характер, и новые игроки обычно не играют за Spectre, поскольку она чрезвычайно зависима от фарма и уровня. Лучше встретить союзную Spectre, поскольку встреча с ней как с врагом в одиночку не всегда является лучшим вариантом."}