{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1f\/Zeus_Arc_Lightning_1.mp3\/revision\/latest?cb=20191216030834",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The lightning bounces in 0.25-second intervals, so hitting all targets takes 1\/1.5\/2\/3.5 seconds.",
        "Does not bounce on invisible units or units in the Fog of War.",
        "Can never hit the same unit twice per cast.",
        "All bounces together can deal up to 450\/840\/1350\/2700 (TagTalent 950\/1540\/2250\/4200) damage (before reductions).",
        "The hidden buff is required for the lightning to jump."
      ],
      "mana": "1.6",
      "item_behaviour": [],
      "name": "Arc Lightning",
      "cooldown": "80\/85\/90\/95",
      "description": "Hurls a bolt of lightning that leaps through nearby enemy units.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.63",
        "Cast Range:  850",
        "Bounce Distance: 500",
        "Number of Bounces: 5\/7\/9\/15",
        "Bounce Interval: 0.25",
        "Damage: 90\/120\/150\/180 ( 190\/220\/250\/280)"
      ],
      "legacy_key": "C",
      "story": "Arc Lightning is Zeus' favorite spell to use against puny mortals."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/91\/Zeus_Lightning_Bolt.mp3\/revision\/latest?cb=20191216030837",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Lightning Bolt first applies the damage, then the debuff.",
        "When unit-targeted, the 750 range flying vision and True Sight are provided at the target's position upon cast. The vision is stationary and does not follow the target.",
        "When ground-targeted, Lightning Bolt searches for any enemy unit within its area. Chooses the closest target to the center. Prioritizes heroes, including illusions, clones, and creep-heroes. It does not require any vision or True Sight to hit invisible or enemies in the Fog of War. With the cast range and search radius, it can hit an enemy up to 1025\/1075\/1125\/1175 range away. When cast this way, the vision, and True Sight is always centered on the targeted point, regardless of hitting a unit.",
        "Prioritizes heroes, including illusions, clones, and creep-heroes.",
        "It does not require any vision or True Sight to hit invisible or enemies in the Fog of War.",
        "With the cast range and search radius, it can hit an enemy up to 1025\/1075\/1125\/1175 range away.",
        "When cast this way, the vision, and True Sight is always centered on the targeted point, regardless of hitting a unit.",
        "The flying vision and True Sight last for 5 seconds. The True Sight is provided by an aura, and its debuff lingers for 0.5 seconds.",
        "The lightning particles and sound effects during the cast time are visible and audible to everyone.",
        "TALENT NOTES The area of effect talent turns Lightning Bolt into a 325 radius area-targeted ability, so that it cannot directly target units anymore. Lightning Bolt now hits every enemy units within the search radius. Does not hit invulnerable or hidden enemies, but still hits invisible enemies and enemies inside the Fog of War. SCEPTER NOTES Does not upgrade the Lightning Bolts of Nimbus. The reveal aura is still created where his cursor points, not at every hit units location.",
        "Lightning Bolt now hits every enemy units within the search radius.",
        "Does not hit invulnerable or hidden enemies, but still hits invisible enemies and enemies inside the Fog of War.",
        "SCEPTER NOTES Does not upgrade the Lightning Bolts of Nimbus.",
        "The reveal aura is still created where his cursor points, not at every hit units location."
      ],
      "mana": "6",
      "item_behaviour": [],
      "name": "Lightning Bolt",
      "cooldown": "120\/125\/130\/135",
      "description": "Calls down a bolt of lightning to strike an enemy unit, causing damage and a mini-stun. When cast, Lightning Bolt briefly provides unobstructed vision and True Sight around the target in a 750 radius. Can be cast on the ground, affecting the closest enemy hero in 325 range.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.67",
        "Cast Range:  700\/750\/800\/850",
        "Search Radius: 325",
        "Vision\/True Sight Radius: 750",
        "Damage: 125\/200\/275\/350",
        "Stun Duration: 0.3 ( 0.7)",
        "Vision\/True Sight Duration: 5",
        "True Sight Linger Duration: 0.5"
      ],
      "legacy_key": "G",
      "story": "A shocking punishment for rebellious heathen."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/83\/Zeus_Heavenly_Jump_1.mp3\/revision\/latest?cb=20220618223447",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Interrupts Zeus' channeling abilities upon cast.",
        "If cast while stationary, Zeus only leaps 250 range upwards over 1.6 seconds. If cast while moving, he leaps in an arc with a height of 250 and a distance of 500 over 1.6 seconds. Zeus' movement speed does not matter, he always leaps the same distance. The forward leap also triggers if Zeus was being moved by other sources of forced movement. Always leaps in the direction Zeus is being moved in, so if he was being moved backward or sideways, he also leaps backward or sideways.",
        "If cast while moving, he leaps in an arc with a height of 250 and a distance of 500 over 1.6 seconds.",
        "Zeus' movement speed does not matter, he always leaps the same distance.",
        "The forward leap also triggers if Zeus was being moved by other sources of forced movement.",
        "Always leaps in the direction Zeus is being moved in, so if he was being moved backward or sideways, he also leaps backward or sideways.",
        "During Leap, Zeus can attack, use items, and cast abilities. However, he cannot turn, so targeted abilities and items may only be used in the direction he is facing. Casting Heavenly Jump while already leaping has no effect, wasting the mana and cooldown.",
        "However, he cannot turn, so targeted abilities and items may only be used in the direction he is facing.",
        "Casting Heavenly Jump while already leaping has no effect, wasting the mana and cooldown.",
        "Heavenly Jump provides 900 radius flying vision for 3 seconds at the cast location upon cast. This vision is stationary and does not follow Zeus.",
        "This vision is stationary and does not follow Zeus.",
        "0.13 seconds after cast, Heavenly Jump searches for the 1 (TagTalent 2) closest enemies within its search area to apply the the damage and debuff to. Can target any unit, but prioritizes heroes, including illusions, clones, and creep-heroes. Does not target invulnerable, invisible, or hidden enemies. Debuff and buff of successive casts do not stack but refresh its duration instead. TALENT NOTES Increases Zeus' total movement speed to 345 after cast.",
        "Can target any unit, but prioritizes heroes, including illusions, clones, and creep-heroes.",
        "Does not target invulnerable, invisible, or hidden enemies.",
        "Debuff and buff of successive casts do not stack but refresh its duration instead.",
        "TALENT NOTES Increases Zeus' total movement speed to 345 after cast.",
        "Heavenly Jump first applies the debuff, the damage, and then movement speed increasing buff."
      ],
      "mana": "26\/22\/18\/14 (TagTalent 22\/18\/14\/10)",
      "item_behaviour": [],
      "name": "Heavenly Jump",
      "cooldown": "50\/60\/70\/80",
      "description": "Zeus performs a Heavenly Jump shocking the closest visible nearby enemy (prioritizing heroes), dealing damage, reducing their movement, attack speed and increasing their cast time. If Zeus was moving forward, he will jump forwards that direction. Zeus gets 900 unobstructed vision around him for 3 seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Search Radius: 700\/800\/900\/1000",
        "Leap Distance: 500",
        "Number of Targets: 1 ( 2)",
        "Damage: 25\/50\/75\/100",
        "Move Speed Slow: 80%",
        "Attack Speed Slow: 100",
        "Cast Time Increase: 50%",
        "Buff\/Debuff Duration: 1.6",
        "Leap Duration: 0.5",
        "<span image=\"images\\Talent\"><\/span> Move Speed Bonus: 30"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Zeus_Nimbus_1.mp3\/revision\/latest?cb=20191216030841",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Casts regular Lightning Bolt based on its current level on the closest valid enemy target. This means it also applies the mini-stun and provides vision and True Sight around the target. Lightning Bolt notes fully apply. If it is not learned, nothing happens. TALENT NOTES The area of effect talent does not upgrade Nimbus' Lightning Bolt.",
        "This means it also applies the mini-stun and provides vision and True Sight around the target.",
        "Lightning Bolt notes fully apply. If it is not learned, nothing happens.",
        "TALENT NOTES The area of effect talent does not upgrade Nimbus' Lightning Bolt.",
        "The damage source is the Nimbus itself, meaning certain on-damage effects react on the Nimbus rather than on Zeus (e.g. Blade Mail). This also means that any outgoing damage amplification or damage reduction do not affect the Nimbus' bolt damage either. Despite this, the bolts still trigger Static Field on their targets, which is still sourced to Zeus, and thus affected by outgoing damage manipulation.",
        "This also means that any outgoing damage amplification or damage reduction do not affect the Nimbus' bolt damage either.",
        "Despite this, the bolts still trigger Static Field on their targets, which is still sourced to Zeus, and thus affected by outgoing damage manipulation.",
        "Starts striking immediately upon cast if an enemy is within the radius. Also strikes immediately when the last strike was longer than an interval ago and an enemy enters the area. Always strikes the closest valid target. There are no priorities. Cannot target wards or buildings. The Nimbus can strike invisible units and units inside the Fog of War. Can strike up to 13 times over its full duration, considering the default 2.5 strike interval. The strike interval is not affected by any cooldown reduction and cooldown resets sources.",
        "Also strikes immediately when the last strike was longer than an interval ago and an enemy enters the area.",
        "Always strikes the closest valid target. There are no priorities. Cannot target wards or buildings.",
        "The Nimbus can strike invisible units and units inside the Fog of War.",
        "Can strike up to 13 times over its full duration, considering the default 2.5 strike interval.",
        "The strike interval is not affected by any cooldown reduction and cooldown resets sources.",
        "The visual effects on the ground that mark the Nimbus' radius is visible to everyone.",
        "SPELL STEAL Nimbus does not disappear, but stops casting Lightning Bolts upon losing the ability. Reacquring Lightning Bolt or Nimbus causes Nimbus to cast Lightning Bolts again."
      ],
      "mana": "45",
      "item_behaviour": [],
      "name": "Nimbus",
      "cooldown": "325",
      "description": "Creates a storm cloud anywhere on the map that automatically casts Lightning Bolt on nearby enemies.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.64",
        "Cast Range: Global",
        "Radius: 450",
        "Melee Hero Attacks to Destroy: 4",
        "Ranged Hero Attacks to Destroy: 8",
        "Non-Hero Attacks to Destroy: 16",
        "Lightning Bolt Interval: 2.5",
        "Duration: 30"
      ],
      "legacy_key": "T",
      "story": "Where the thunder god's ire grows, storm clouds quickly gather."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/70\/Zeus_Static_Field_1.mp3\/revision\/latest?cb=20210103161946",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Static Field only works with Zeus' abilities. It does not react on items or other abilities. Static Field always applies its damage before the triggering ability applies any of its effects. Arc Lightning applies Static Field's damage on each enemy units it bounces on. Lightning Bolt (including from Nimbus) applies Static Field's damage on whoever it hits, regardless of whether they were unit-targeted or ground-targeted. Heavenly Jump applies Static Field's damage to the chosen enemy within the search radius. Thundergod's Wrath applies Static Field's damage on all hit enemies, except invisible enemies. Neither works on Roshan, nor applies its damage if the ability is blocked by Spell Block sources.",
        "Static Field always applies its damage before the triggering ability applies any of its effects.",
        "Arc Lightning applies Static Field's damage on each enemy units it bounces on.",
        "Lightning Bolt (including from Nimbus) applies Static Field's damage on whoever it hits, regardless of whether they were unit-targeted or ground-targeted.",
        "Heavenly Jump applies Static Field's damage to the chosen enemy within the search radius.",
        "Thundergod's Wrath applies Static Field's damage on all hit enemies, except invisible enemies.",
        "Neither works on Roshan, nor applies its damage if the ability is blocked by Spell Block sources.",
        "For Zeus' attacks, Static Field applies its damage first, then the attack damage. Damage dealt is considered as spell damage and not conditional attack damage bonus. Does not work against buildings or wards.",
        "Damage dealt is considered as spell damage and not conditional attack damage bonus.",
        "Does not work against buildings or wards."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Static Field",
      "cooldown": null,
      "description": "Zeus shocks any enemy that he attacks or is hit by his abilities, causing damage equal to 8% of their current health.",
      "hot_key": "?",
      "params": [
        "Current Health as Damage: 8%"
      ],
      "legacy_key": "",
      "story": "The air crackles with static when the Thundergod walks the world."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Zeus_Thundergod%27s_Wrath_1.mp3\/revision\/latest?cb=20191216030845",
      "effects": [
        "Ability: No Target",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "notes": [
        "Only hits enemy heroes, including the Tempest Double, but excluding Meepo Clones, illusions and creep-heroes. Does not hit invulnerable or hidden enemies.",
        "Does not hit invulnerable or hidden enemies.",
        "Thundergod's Wrath first applies its damage, then provides its vision and True Sight. This means if an invisible enemy is not revealed beforehand, it only applies the vision and True Sight around them, but not the damage. The damage affects enemy heroes on the scoreboard from top to bottom.",
        "This means if an invisible enemy is not revealed beforehand, it only applies the vision and True Sight around them, but not the damage.",
        "The damage affects enemy heroes on the scoreboard from top to bottom.",
        "Thundergod's Wrath provides 500 radius flying vision and 900 radius True Sight around each struck hero. The vision and True Sight last for 3 seconds. The True Sight is provided by an aura, its debuff lingers for 0.5 seconds.",
        "The vision and True Sight last for 3 seconds.",
        "The True Sight is provided by an aura, its debuff lingers for 0.5 seconds.",
        "Hitting all 5 enemy heroes collectively deals 1500\/2125\/2750 (TagTalent 2000\/2625\/3250) damage (before reductions).",
        "The visual and sound effects during the cast time are visible and audible to everyone. The sound effects upon cast are global. Enemies can hear it when they have vision over Zeus, or else they can only hear the local hit sound. Shifts the lighting of the whole map for a split second, which is also visible to everyone.",
        "The sound effects upon cast are global. Enemies can hear it when they have vision over Zeus, or else they can only hear the local hit sound.",
        "Shifts the lighting of the whole map for a split second, which is also visible to everyone."
      ],
      "mana": "130\/125\/120",
      "item_behaviour": [],
      "name": "Thundergod's Wrath",
      "cooldown": "300\/400\/500",
      "description": "Strikes all enemy heroes with a bolt of lightning, no matter where they may be. Thundergod's Wrath also provides True Sight around each hero struck. If an enemy hero is invisible, it takes no damage, but the True Sight is still created at that hero's location.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.4+0.43",
        "Effect Radius: Global",
        "Vision Radius: 500",
        "True Sight Radius: 900",
        "Damage: 300\/425\/550 ( 400\/525\/650)",
        "Vision\/True Sight Duration: 3",
        "True Sight Aura Linger Duration: 0.5"
      ],
      "legacy_key": "W",
      "story": "The Lord of Heaven smites all who oppose him, near or far."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 19.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.2,
    "attrAgility": 11.0
  },
  "description": "Strikes enemies near and far with lightning. Charged with godly might, a Static Field constantly surrounds Zeus, making enemies more susceptible to his lightning. As the Lord of Heaven Jumping around, Zeus calls down Lightning Bolts to smite foes and reveal the surroundings, sends Arc of Lightning through his nearest enemies, and calls forth a terrifying Nimbus upon his enemies that repeatedly strikes enemies with Lightning Bolts. None can hide from Zeus, pointing his arms skyward to bring divine punishment down on each and every foe. Wherever they may be, none shall stand against the Thundergod's Wrath.  Nuker Carry ★☆☆",
  "trivia": [
    "Zeus was the first hero to be implemented in Dota 2.",
    "Zeus is based on the Greek mythological god of the same name.",
    "As suggested by the game's files, Zeus's name was, at one time, Zuus. The possible reason being that 'Zuus' is the correct pronunciation of his name 'Zeus'.",
    "Zeus' alternate\/fun name in DotA was \"Merlini\", a tribute to a professional DotA player.",
    "Zeus' title in DotA was \"Lord of Olympus\".",
    "Static Field is most likely a reference to the Sorceress' skill of the same name in Diablo II. In Diablo II, the spell also reduced enemies' HP by a percentage within a short radius.",
    "Zeus' respawn line Link▶️ \"To err is human. To respawn, divine.\" is a reference to Alexander Pope, whose quote is \"To err is human; to forgive, divine.\"",
    "Zeus' rival line towards Chen, Link▶️ \"Keep in mind, Chen, godliness is next to deadliness.\" is a reference to an old and well-known saying \"Cleanliness is next to godliness.\"",
    "Zeus' rare response line, Link▶️ \"In Me I Trust.\", refers to the national motto of the United States – \"In God We Trust\".",
    "Zeus' rare response line, Link▶️ \"If I didn't exist, it would be necessary to invent me.\", is a reference to a similar quote by french philosopher Voltaire: \"If God did not exist, it would be necessary to invent him.\"",
    "Zeus' bottling line, Link▶️ \"Nature abhors an empty bottle.\", is a reference to the Plenism postulate attributed to Aristotle, which states that nature contains no vacuums because the denser surrounding material continuum would immediately fill the rarity of an incipient void – \"Nature abhors a vacuum.\""
  ],
  "history": "Lord of Heaven, father of gods, Zeus treats all the Heroes as if they are his rambunctious, rebellious children. After being caught unnumbered times in the midst of trysts with countless mortal women, his divine wife finally gave him an ultimatum: 'If you love mortals so much, go and become one. If you can prove yourself faithful, then return to me as my immortal husband. Otherwise, go and die among your creatures.' Zeus found her logic (and her magic) irrefutable, and agreed to her plan. He has been on his best behavior ever since, being somewhat fonder of immortality than he is of mortals. But to prove himself worthy of his eternal spouse, he must continue to pursue victory on the field of battle.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "325 AOE Lightning Bolt",
        "talent_left": "+100 Arc Lightning Damage"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+100 Thundergod's Wrath Damage",
        "talent_left": "+0.4s Lightning Bolt Ministun"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+30 Movement Speed after Heavenly Jump",
        "talent_left": "+1 Heavenly Jump Target"
      },
      {
        "talent_lvl": "10",
        "talent_right": "-4s Heavenly Jump Cooldown",
        "talent_left": "+250 Health"
      }
    ],
    "notes": [
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}