{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "The summons always spawn in front of the caster.",
        "Recasting this with the same Book of the Dead replaces the summons from the previous cast, no matter under whose control they are. However, recasting it with a second Book of the Dead (stolen from the enemy or copied by a Tempest Double) creates new summons.",
        "However, recasting it with a second Book of the Dead (stolen from the enemy or copied by a Tempest Double) creates new summons.",
        "The summons cannot be targeted by Helm of the Dominator, and the warrior cannot be targeted by Hand of Midas. However, they can be targeted by other converting or instantly killing spells like Holy Persuasion or Devour.",
        "However, they can be targeted by other converting or instantly killing spells like Holy Persuasion or Devour.",
        "Does not share cooldown with Necronomicon."
      ],
      "mana": "0",
      "abilityName": "Greater Demonic Summoning",
      "cooldown": "90",
      "description": "Summons 4 level 3 Necronomicon Units that last 75 seconds. Units have 100% more health and 50% more damage.",
      "params": [
        "Number of Warriors: 2",
        "Number of Archers: 2",
        "Bonus Health: 100%",
        "Bonus Attack Damage: 50%",
        "Duration: 75"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, but it is not considered by crit or cleave.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Effectively increases the warrior's attack damage by 15\/20\/25 against units which have enough mana to burn.",
        "Applies the mana loss first, and then the damage.",
        "Works against allied units when attacking them.",
        "Fully stacks with other sources of Mana Break."
      ],
      "mana": null,
      "abilityName": "Mana Break",
      "cooldown": null,
      "description": "Mana burned per hit, a portion of which is dealt as damage.",
      "params": [
        "Mana Burned per Hit: 50",
        "Burned Mana as Damage: 50%"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Does not affect allied units, so it can be denied without taking damage.",
        "The distance between the Necronomicon Warrrior and the killing unit does not matter.",
        "The warrior’s gold and experience bounty is granted first, the damage is applied afterwards.",
        "Does not affect buildings."
      ],
      "mana": null,
      "abilityName": "Last Will",
      "cooldown": null,
      "description": "Deals damage to the unit that kills the Necronomicon Warrior.",
      "params": [
        "Damage: 800"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Enemies"
      ],
      "notes": [
        "Available for level 3 Necronomicon Warriors only.",
        "The True Sight is provided within the whole area, regardless of the warrior's actual vision. It is fully unobstructed.",
        "The True Sight is provided by an aura which affects enemies. Its debuff lingers for 0.5 seconds.",
        "Cannot detect units under the effect of Shadow Dance, Smoke of Deceit and Techies' mines under the effect of an Aghanim's Scepter upgraded Minefield Sign."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Reveals invisible units.",
      "params": [
        "Radius: 1000",
        "Aura Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cc\/Necronomicon_Archer_Purge.mp3\/revision\/latest?cb=20191227200433",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Available for level 3 Necronomicon Archers only.",
        "Applies a basic dispel on the target upon cast.",
        "Purge first applies the dispel, then the slow.",
        "The slow decreases in 0.8 second intervals, so it slows for 100%\/80%\/60%\/40%\/20%, going one step down every 0.8 seconds.",
        "Can be cast on and fully affect invulnerable units."
      ],
      "mana": null,
      "abilityName": "Purge",
      "cooldown": "15",
      "description": "Affects Enemies",
      "params": [
        "Cast Animation: 0.3+0.47",
        "Cast Range: 600",
        "Move Speed Slow: 100%",
        "Slow Duration: 4"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Books of the Dead are fully sharable."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Book of the Dead",
  "description": "A record of the final reckoning. With one page torn out.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+30 Strength",
    "+30 Intelligence"
  ],
  "tips": []
}