{"abilities":[{"spell":"Раскалывает землю под врагами. Наносит урон и ненадолго оглушает.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Уничтожает деревья в зоне действия способности.","Split Earth сначала применяет дебафф, затем наносит урон.","Не выделяет задержку визуальным или звуковым индикатором."],"mana":"80\/100\/120\/140","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"9","name":"Split Earth","description":["Анимация применения: 0,7+0,67","Дальность применения: 650","Радиус: 150\/175\/200\/225","Задержка: 0,35","Урон: 120\/180\/240\/300","Длительность оглушения: 2"],"hot_key":"Q","legacy_key":"T"},{"spell":"Окружает героя магическими взрывами, которые наносят физический урон врагам и постройкам. Чем меньше рядом врагов, тем больше урона они получат. Башни получают на 40% больше урона. Действует 10 секунд.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Физический"],"notes":["Центр радиуса всегда закреплен за текущим расположением Leshrac, а не за местом применения.","Случайно выбирает ближайших подходящих юнитов для каждого взрыва без какого-либо приоритета.","Полностью работает на невидимых юнитов и юнитов в тумане войны.","Если поблизости нет подходящих целей, взрывы появляются случайным образом в квадрате со стороной в 500 единиц. Они не наносят урона.","Создает взрывы с интервалом в 0.25 ( 0.11) секунды сразу после использования способности, вызывая 40 ( 90) взрывов.","Строения получают 12.6\/25.2\/37.8\/50.4 единиц урона за взрыв.","Может нанести до 360\/720\/1080\/1440 ( 810\/1620\/2430\/3240) единиц урона одному юниту или до 504\/1008\/1512\/2016 ( 1134\/2268\/3402\/4536) единиц урона по одному строению (до учета сопротивления).","Взрывы продолжат появляться на месте смерти Leshrac."],"mana":"95\/120\/135\/155","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"22","name":"Diabolic Edict","description":["Анимация применения: 0,5+0,87","Радиус: 500","Взрывов: 40 ( 90)","Урон: 9\/18\/27\/36","Доп. урон строениям: 40%","Длительность: 10"],"hot_key":"W","legacy_key":"C"},{"spell":"Призывает шквал молний, которые бьют и замедляют сначала выбранного противника, а затем и соседних от него. Задетые юниты замедляются на 75%.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Молния поражает начальную цель после задержки в 0.25 секунды и затем перескакивает между остальными юнитами с интервалом в 0.25 секунды; для поражения всех целей требуется 1\/1.5\/2\/2.5 секунды.","Поскольку у способности есть задержка применения, начальную молнию можно избежать с помощью иммунитета к заклинаниям, неуязвимости или перехода в спрятанное состояние. При этом всё это не предотвращает скачки молний.","Не отскакивает от невидимых юнитов или юнитов в тумане войны.","Не может дважды поразить одну и ту же цель за применение.","Все отскоки вместе могут нанести до 320\/720\/1280\/2000 единиц урона (до учета сопротивления).","Модификатор Lightning Storm - скрытый бафф, требующийся для отскакивания молний."],"mana":"80\/100\/120\/140","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"4","name":"Lightning Storm","description":["Анимация применения: 0,4+0,77","Дальность применения: 650","Дистанция скачков: 475","Количество скачков: 4\/6\/8\/10","Задержка скачков: 0.25","Урон: 80\/120\/160\/200","Замедление передвижения: 75%","Длительность замедления: 0.4\/0.6\/0.8\/1.0 ( 3.4\/3.6\/3.8\/4)"],"hot_key":"E","legacy_key":"G"},{"spell":"Создает вокруг героя волны энергии, которые раз в секунду наносят повреждения вражеским существам поблизости.","effects":["Способность Переключаемая","Действует на Врагов","Урон Магический"],"notes":["При использовании Pulse Nova не прерывает произносимые способности Leshrac.","Наносит урон с интервалом в 1 секунду сразу после переключения способности.","Расходует ману с таким же интервалом; активация расходует 90\/130\/170 единиц маны. При этом, если у героя при переключении будет меньше чем 90\/130\/170 единиц маны, то способность нанесет 1 единицу урона и самостоятельно отключится.","Полностью действует на невидимых юнитов и юнитов в тумане войны.","Безмолвие или обезвреживание не отключает Pulse Nova, как и состояние исчезновения.","С Aghanim's Scepter одна молния от Lightning Storm поражает случайного юнита в радиусе. Как только молния ударяет, эффект уходит на перезарядку в 1,75 секунды. Время перезарядки нельзя изменять."],"mana":"70\/90\/110","elements":["Не провоцирует эффекты своим применением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"1","name":"Pulse Nova","description":["Анимация применения: 0+0","Радиус: 450","Радиус Lightning Storm: 0 ( 750)","Урон в секунду: 100\/140\/180 ( 1,75)","Расход маны в секунду: 20\/40\/60"],"hot_key":"R","legacy_key":"V"}],"bio":"Leshrac, истерзанная душа — это существо, попавшее в этот мир прямиком из сердца самой природы; создание, живущее на границе между миром живых и миром мертвых. Голос его разума не дремлет даже в минуты кромешного кошмара, вселяющего ужас во всё живое. Однажды великий философ, пытаясь познать суть бытия, проник вглубь природы при помощи хроноптических кристаллов, и навсегда изменился из-за тех ответов, что он нашел. Теперь же самые темные глубины его посвященного разума озаряются лишь его собственной гордостью. Как и другие элементали, он един с природой, но в его случае природа к нему не так уж благосклонна. Он один видел всю страшную суть реальности, и не видит смысла в вере в то, что где-то там, вдалеке, найдется награда для добросердечных глупцов.","talentsTips":["Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.","Талант на броню не дается иллюзиям.","Талант на силу в общем даёт Leshrac: 270 здоровья, 1,5 регенерации здоровья и 1,2% сопротивления магии.","Талант на уклонение мультипликативно сочетается с другими источниками уклонения."],"trivia":["Имя \"Leshrac\" происходит от Planeswalker, магического персонажа в игре Magic: The Gathering Diabolic Edict в той игре - черные карты. И как в Dota 2, магические карты были эффективны против одиночных целей, где игрок должен выбирать цель для заклинания."],"talents":["+3 сек. к замедлению от Lightning Storm:+50 взрывов Diabolic Edict","+50 урона от Pulse Nova:+25% к уклонению","+30 к скорости передвижения:+15 к силе","+250 к мане:+5 к броне"],"tips":["Способность Split Earth имеет задержку в 0.35 секунды перед применением. Рассчитываете приблизительное местоположение противника, перед использованием способности.","Diabolic Edict хорошо подходит для уничтожения вражеских башен. Старайтесь постоянно ею пользоваться, чтобы нанести башне как можно больше урона. Также эта способность наносит немалый урон одиночной цели. Используйте ее, если уверены что цель одна - таким образом, вы гарантированно ее убьете."],"desc":"Leshrac — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Split Earth, раскалывает землю под врагами. Наносит урон и оглушает. Вторая способность, Diabolic Edict, окружает Leshrac магическими взрывами, которые наносят физический урон врагам и сооружениям. Башни получают больше урона. Чем меньше рядом врагов, тем больше урона они получат. Третья способность, Lightning Storm, Призывает грозовой разряд, ударяющий в выбранного противника и отскакивающий в соседних, замедляя их. Ультимативная способность, Pulse Nova, создает волну энергии вокруг Leshrac, которая раз в секунду наносит повреждения вражеским юнитам поблизости. Улучшение с Aghanim's Scepter позволяет способности Lightning Storm поражать случайного юнита в радиусе способности каждые 1,75 секунды."}