{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Skull_Basher_Bash.mp3\/revision\/latest?cb=20191227195535",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Skull Basher's bash does not stack with the bash of Abyssal Blade and other Skull Bashers.",
        "When obtaining multiple items with the bash ability, only the one that has been continuously the longest in the inventory works.",
        "The proccing attack first applies the debuff, then its own damage.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, but it is not considered by crit or cleave.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Adds an average of 25 damage to every attack for melee heroes, and 10 damage for ranged heroes.",
        "Does not work against wards and buildings, but works against allied units.",
        "Bash uses pseudo-random distribution."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": "2.3",
      "description": "Grants melee heroes a 25% chance on hit to stun the target for 1.5 seconds and deal 100 bonus physical damage. Bash chance for ranged heroes is 10%.",
      "params": [
        "Proc Chance (Melee): 25%",
        "Proc Chance (Ranged): 10%",
        "Damage: 100",
        "Stun Duration: 1.5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 200 health, 1 health regen and 35 attack damage.",
    "For agility heroes, it grants 200 health, 1 health regen and 25 attack damage.",
    "For intelligence heroes, it grants 200 health, 1 health regen and 25 attack damage.",
    "When held by Slardar, Spirit Breaker, or Faceless Void, Bash cannot proc.",
    "When held by a hero that has the Time Lock passive (e.g. in Ability Draft), Bash cannot proc either."
  ],
  "cost": "2950",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Belt of Strength",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Skull Basher",
  "description": "A feared weapon in the right hands, this maul's ability to shatter the defenses of its opponents should not be underestimated.",
  "trivia": [
    "In the original DotA, this item was called \"Cranium Basher\", a reference to a unique item in Diablo 2."
  ],
  "upgradeIn": [
    "Abyssal Blade"
  ],
  "bonuses": [
    "+10 Strength",
    "+25 Attack damage"
  ],
  "tips": []
}