{"abilities":[{"spell":"Герой опаляет цель призрачным огнём, оглушая её и нанося ей урон. После оглушения цель будет получать периодический урон и замедлится.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Скорость полета снаряда - 1000 единиц.","Оглушение и замедление применяются одновременно, поэтому замедление будет длится 3.1\/3.4\/3.7\/4 ( 4.6\/4.9\/5.2\/5.5) секунд.","Наносит базовый урон сразу при попадании, а периодический - с интервалом в 1 секунду сразу после оглушения.","Может нанести до 120\/160\/200\/240 ( 130\/190\/250\/310) единиц урона (до учета сопротивления).","Способность сначала наносит урон, затем применяет дебафф.","Применение Wraithfire Blast отдает приказ атаковать цель всем скелетам Wraith King.","Если изучен соответствующий талант на 25-м уровне, способность будет автоматически применяться на вражеских юнитов, которые окажутся в радиусе единиц от Wraith King при срабатывании Reincarnation. В этом случае скорость полёта снаряда меньше - 500. Будет применять оглушение и урон, соответствующие оригинальному. Если при выбранном таланте Wraithfire Blast не будет изучен, то Reincarnation все еще будет замедлять противников после срабатывания. После изучения способность заменяет замедление. Снаряды будут задевать юнитов в тумане войны и невидимых юнитов. При этом невидимые цели мгновенно избегают снарядов."],"mana":"95\/110\/125\/140","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/12\/10\/8","name":"Wraithfire Blast","description":["Анимация применения: 0,35+0,5","Дальность применения: 525","Урон: 100","Периодический урон: 10\/30\/50\/70","Замедление скорости передвижения: 20%","Длительность оглушения: 1.1\/1.4\/1.7\/2","Длительность замедления и периодического урона: 2 ( 3.5)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Каждая ближняя атака союзников неподалёку восстанавливает им здоровье в зависимости от нанесённого ей урона.","effects":["Способность Переключаемая \/ Аура","Действует на Союзников"],"notes":["Способность можно переключать, тогда аура будет работать только на союзных героев. Считает крипов-героев за крипов.","Складывается с другими источниками вампиризма.","Не восстанавливает здоровье за урон по вардам, строениям и союзным юнитам.","Эффект от ауры задерживается на 0,5 секунд.","Действует на неуязвимых, но не спрятанных союзников.","Эффекты частиц вампиризма не появляются, если Wraith King не виден врагам.","Способность не работает на героев дальнего боя."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Vampiric Aura","description":["Радиус ауры: 1200","Вампиризм: 18%\/22%\/26%\/30% ( 43%\/47%\/51%\/55%)"],"hot_key":"W","legacy_key":"V"},{"spell":"Позволяет нанести атакой дополнительный урон. Каждые два убитых существа дают один заряд, за который можно призвать скелета. Погибшие скелеты возрождаются один раз.","effects":["Способность Ненаправленная \/ Пассивная","Действует на Врагов"],"notes":["Увеличивает урон в среднем на 18%\/22%\/26%\/30%.","Заряд дается после убийства Wraith King любых двух юнитов. Неважно, как именно были убиты юниты.","Скелеты появляются с интервалом в 0,25 секунды сразу после применения.","Скелеты неподконтрольны. Они автоматически выбирают цель для атаки в пределах радиуса в 6500 единиц. Если юнитов поблизости нет, они движутся к ближайшей линии и идут по маршруту обычных линейных крипов. Если цель атаки стала невидимой, то скелеты могут остановится и ничего не делать. Спустя некоторое время они выберут новую цель или вернутся на линию. Все скелеты в пределах радиуса в [ Требуется информация ] единиц вокруг Wraith King переключаются на цель Wraithfire Blast. Скелеты не блокируют лагери нейтральных крипов.","Скелеты умирают при потере модификатора \"Mortal Strike Summon\", так что помимо обычного убийства их можно просто развеять.","После смерти скелеты возрождаются. Возрождение нельзя предотвратить. Как и в случае с воскреснувшими героями, за возродившихся скелетов не дают золота и опыта. Возрождение не сбрасывает длительность жизни скелетов, поэтому после истечения времени они не возрождаются.","Шанс срабатывания сочетается с другими источниками критического удара. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","В отличие от всех остальных критических ударов действует на варды.","Использует псевдослучайное распределение.","Звук и частицы появляются при начале атаки, а не при попадании."],"mana":"30\/45\/60\/75","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"50","name":"Mortal Strike","description":["Анимация применения: 0,1+0,5","Шанс крита: 9%\/11%\/13%\/15%","Критический урон: 300%","Количество крипов для заряда: 2","Максимум зарядов: 2\/4\/6\/8","Призывает скелетов за заряд: 1 ( 2)","Задержка возрождения скелета: 3","Длительность скелета: 90"],"hot_key":"E","legacy_key":"C"},{"spell":"После смерти тело Wraith King вновь собирается воедино, воскрешая его на поле боя. При этом все враги в радиусе 900 замедляются.","effects":["Способность Пассивная ( Аура)","Действует на Себя ( Союзных героев)"],"notes":["Reincarnation нельзя ничем отменить, если у Wraith King достаточно маны, а сама способность не на перезарядке.","Возвращает к жизни с полным запасом здоровья и маны. Перезарядка заклинаний и предметов не обновляется.","Дает наземный обзор в радиусе 1800\/800 в месте смерти в момент перерождения.","Если Wraith King имеет одновременно Aegis of the Immortal, готовую способность и достаточно маны, то способность сработает первой.","Замедление применяется один раз при начале перерождения, но не в конце.","Улучшение от Aghanim's Scepter добавляет способности ауру. Бафф ауры задерживается на 0,5 секунды.","Аура действует на союзных героев, включая самого Wraith King. Она не действует на иллюзии или крипов-героев.","Задержка смерти не действует на неуязвимых или спрятанных героев, поэтому они умрут до превращения в призрака.","Союзник становится призраком, когда его здоровье достигает 1, если только на него не действует Shallow Grave, или у него есть воскрешение или Aegis of the Immortal. Призраки остаются живыми, поскольку их минимальное здоровье приравнено к 1. Урон, получаемый ими, технически не уменьшается. Когда Meepo или один из его клонов умирает вне радиуса ауры, в то время как любой из клонов остается внутри, то умерший не становится призраком. При этом если клон Meepo умирает в пределах ауры, Meepo становится призраком, откладывая смерть. Несколько Meepo могут одновременно быть призраками. Когда у одного из них завершится форма или другой умрет вне радиуса ауры, то Meepo умирает. Все союзные Tempest Double могут стать призраками, если их здоровье достигнет 1 до завершения длительности. Tempest Double не становится призраком, если таймер длительности достигает 0. Он просто исчезает вне зависимости от того, действовала на него аура или нет. Tempest Double, ставшие призраками, исчезнут, как только таймер длительности достигнет 0. Их длительность не увеличивается.","Задержка смерти дает героям беспрепятственное движение, позволяя проходить сквозь юнитов, деревья и через возвышения.","Союзники-призраки могут действовать как обычные герои, но на них все так же можно воздействовать чем угодно - просто это не убьет их. То есть призраков можно атаковать и выбирать целью заклинаний, обезвреживая их. Также при превращении на героев продолжают действовать все баффы и дебаффы. Эффекты не развеиваются.","По окончанию действия способности призрак исчезает, а награду за убийство получает тот, кто нанес смертельный удар перед воскрешением.","Если герой превратился в призрака, то его уже никак нельзя спасти. Он обязательно умрет, как только эффект завершится, даже если герой успел получить неуязвимость или эффект Shallow Grave. Если герой получит воскрешение в форме призрака, то способность сработает.","Форма призрака увеличивает модель героя на 25% на всю длительность. Это не влияет на размер столкновения.","Аура задержки смерти дается ближайшим союзникам даже если Wraith King мертв."],"mana":"160 ( 0)","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"200\/120\/40","name":"Reincarnation","description":["Радиус замедления\/применения Wraithfire Blast: 900","Время перерождения: 3","Замедление скорости передвижения: 75% ( 0%)","Замедление скорости атаки: 75 ( 0)","Длительность замедления: 5 ( 0)","Радиус появления призраков: 0 ( 1200)","Длительность призраков: 0 ( 7)"],"hot_key":"R","legacy_key":"R"}],"bio":"Бессчётные годы Остарион строил королевство на останках своих врагов. То была навязчивая привычка, в которой монарх коротал вечное, будто бы нескончаемое правление. Он считал, что будет жить вечно, покуда башни его дворца продолжают стремиться ввысь. Но со временем он осознал, что заблуждался... Что даже кости однажды обратятся в прах. Не веря плоти, он искал надёжный способ продлить своё правление, и в конце концов заключил: ему нужна была энергия призраков, форма чистого духа, которую некоторые тёмные души выделяют в миг смерти. Остарион надеялся вселить в себя призрачное естество и этим обрести лик столь же ясный и вечный, как его самолюбие. В Ночь призраков, солнцестояние на границе веков, он погрузился в обряд превращения и приказал подданным собрать достаточно душ, дабы он обрёл желанное бессмертие. Никто не знает, сколько его слуг пало в ту ночь, ведь единственным достойным внимания выжившим был сам король, перерождённый со следующим восходом солнца. Отныне он не восседает на престоле, но идёт по полю боя с мечом наголо, требуя верности не только до самой смерти, но и за её пределами.","talentsTips":["Талант на силу в общем даёт Wraith King: 300 здоровья, 1,5 регенерации здоровья, 1,2% сопротивления магии и 15 урона от атаки."],"trivia":["До 13-го декабря 2013 года, Остарион, Wraith King был известен как Остарион, Skeleton King. 10-го декабря 2013 года, Skeleton King был убран из игры по \"церемониальным причинам\". После события Ночь Призраков, он был возвращен как Wraith King. Его модель была полностью переработана из костяной в текущую. Его тематический цвет был изменен из красного на зелёный и все его иконки также были изменены. Он также получил новые реплики, тем же актером что и озвучил Skeleton King до этого. Реплики Skeleton King можно найти тут.","Оригинальное имя Skeleton King было Леорик, что является отсылкой к \"King of Khanduras\" из серии Diablo.Skeleton King из Diablo, который также имеет имя Леорик. В Dota2, его имя было изменено на Остарион, чтобы не нарушать авторские права.","Реплики при покупке Armlet of Mordiggian Играть \"I NOW HAVE ALL THE SEXY\" и Divine Rapier Играть \"Oh, Rapier. NOW YOUR KING IS BALLING OUT OF CONTROL!\" имеют отсылку к популярному руководству в DotA \"CAPS LOCK LEORIC\"."],"talents":["Срабатывание Reincarnation активирует Wraithfire Blast:+25% к вампиризму от Vampiric Aura","Вдвое больше скелетов:На Reincarnation не требуется мана","+35 к урону скелетов:+15 к силе","+20 к скорости атаки:+1,5 сек. к длительности замедления Wraithfire Blast"],"tips":["Способность Wraithfire Blast очень эффективна для обезвреживания противника. Замечательный инструмент для нападений и командных битв. У неё относительно маленькое время перезарядки, так что её можно постоянно кидать в противника, если достаточно маны. Также этой способностью можно прерывать чтение заклинания противника. Например, ею можно сбить применение свитка телепортации, не дав противнику сбежать, или сбить применение ульты некоторых героев, у которых для её применения требуется некоторые время.","Vampiric Aura позволит лечить себя просто ударами по врагу. Эффект ауры затрагивает всех ваших союзников, как ближнего боя, так и дальнего. Хорошо подходит для позднего этапа игры.","Mortal Strike радикально увеличивает урон в секунду (но не в начале игры). Хорошо сочетается с Vampiric Aura, достаточно хорошо лечит героя каждый раз, когда он критует ударом.","Reincarnation оживляет героя, если он умирает в битве. Всегда следите, чтобы у вас было достаточно маны. Если у вас будет недостаточно маны - вы не воскреснете. Герой будет возрожден даже если перед смертью на нем был эффект безмолвия.","Wraithfire Blast прокачивается до конца первым, в то же время Reincarnation следует получить как можно быстрее.","Armlet of Mordiggian и Soul Ring часто покупаются для героя, так как Vampiric Aura позволяет ему быстро восполнять здоровье после урона полученного от этих предметов, а Soul Ring может дать необходимую ману для срабатывания Reincarnation практически в любой момент.","Используйте Phase Boots и Drum of Endurance одновременно и у вас будет достаточно мобильности чтобы преследовать и убивать.","Ваша тактика проста и прямолинейна - включайте Armlet of Mordiggian, Phase Boots и любой другой предмет который у вас есть, оглушайте самого слабого врага с помощью Wraithfire Blast и бейте его пока он не умрет.","Покупка Divine Rapier для вас будет менее рискованной и более оправданной, нежели для других героев."],"desc":"Wraith King — это герой с ближним типом атаки, основной характеристикой которого является Сила. Его первая способность, Wraithfire Blast, поджигает врага спектральным огнем, оглушая его и нанося урон. После окончания оглушения жертва продолжает получать урон в течение некоторого времени, а скорость ее передвижения снижается. Первая пассивная способность, Vampiric Aura, дает эффект вампиризма. Вторая пассивная способность, Mortal Strike, дает шанс нанести критический удар по герою, а также призывать скелетов в зависимости от количества убитых ранее крипов. Пассивная ультимативная способность, Reincarnation, воскрешает его после смерти подобно Aegis of the Immortal, делая его трудно убиваемым, и замедляет всех врагов в радиусе вокруг него. Улучшение с Aghanim's Scepter превращает в призраков, умерших вблизи героев, отложив их и свою смерть на 7 секунд."}