{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/59\/Mekansm.mp3\/revision\/latest?cb=20141214195825",
      "effects": [
        "Радиус: 1200",
        "Восстановление здоровья: 275",
        "Время до повторной активации: 64"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания.",
        "Действует на союзников, включая иллюзии, неуязвимых и невидимых существ, кроме вардов и строений.",
        "Не лечит героев, на которых уже подействовал эффект Restore менее 64 секунд назад или Mend менее 39 секунд назад. В панели эффектов можно посмотреть время окончания эффекта для его повторной активации. Время запрета лечения равняется времени перезарядки предмета после всех уменьшений, уменьшенного на одну секунду. Продолжительность запрета нельзя изменить после использования предмета. Сброс перезарядки Mekansm не уберёт запрет.",
        "В панели эффектов можно посмотреть время окончания эффекта для его повторной активации.",
        "Время запрета лечения равняется времени перезарядки предмета после всех уменьшений, уменьшенного на одну секунду.",
        "Продолжительность запрета нельзя изменить после использования предмета. Сброс перезарядки Mekansm не уберёт запрет."
      ],
      "mana": "100",
      "abilityName": "Restore",
      "cooldown": "65",
      "description": "Восстанавливает 275 здоровья всем союзникам в радиусе 1200.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Доп. регенерация здоровья: 2,5",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Эффект от нескольких Mekansm не складывается. Эффект регенерации складывается с другими источниками с фиксированным значением, включая улучшения Headdress.",
        "Эффект регенерации складывается с другими источниками с фиксированным значением, включая улучшения Headdress.",
        "Восстанавливает до 150 здоровья в минуту.",
        "Не действует на варды, постройки и неуязвимых юнитов.",
        "Аура регенерации задерживается на 0,5 секунды."
      ],
      "mana": null,
      "abilityName": "Mekansm Aura",
      "cooldown": null,
      "description": "Увеличивает восстановление здоровья на 2,5 всем союзникам в радиусе 1200.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1875",
  "lore": null,
  "consistFrom": [
    "Headdress",
    "Chainmail",
    "Recipe"
  ],
  "name": "Mekansm",
  "description": "Сияющий алмаз, собранный из разных частей, которые почему-то прекрасно объединяются.",
  "trivia": null,
  "upgradeIn": [
    "Guardian Greaves"
  ],
  "tips": null
}