{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "When a hero has an upgrade available, the item's and the upgraded spell's tooltip states what exactly is upgraded.",
        "Single target spells with Aghanim's Scepter upgrades that are reflected by Spell Reflection depend on whether the reflecting hero has Aghanim's Scepter, not the original caster of the reflected spell."
      ],
      "mana": null,
      "abilityName": "Ability Upgrade",
      "cooldown": null,
      "description": "Upgrades the ultimate, and some abilities, of all heroes.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 375 health, 1 health regen, 1.67 armor, 10 attack speed, 295 mana, 0.5 mana regen and 10 attack damage.",
    "For agility heroes, it grants 375 health, 1 health regen, 1.67 armor, 10 attack speed, 295 mana, 0.5 mana regen and 10 attack damage.",
    "For intelligence heroes, it grants 375 health, 1 health regen, 1.67 armor, 10 attack speed, 295 mana, 0.5 mana regen and 10 attack damage."
  ],
  "cost": "4200",
  "lore": null,
  "consistFrom": [
    "Point Booster",
    "Staff of Wizardry",
    "Ogre Axe",
    "Blade of Alacrity"
  ],
  "boughtFrom": "Magical",
  "name": "Aghanim's Scepter",
  "description": "The scepter of a wizard with demigod-like powers.",
  "trivia": [
    "Aghanim's Scepter is named after Agahnim, one of the main villains in The Legend of Zelda: A Link to the Past.",
    "Rubick is the son of Aghanim. He also possesses an imitation of Aghanim's Scepter. With the exception of Dark Willow, Grimstroke, Razor, Snapfire and Void Spirit, heroes never mention Aghanim's name in their voice responses, simply referring to it as \"The Scepter\". The reason for this is unknown. Riki and Lion are the only heroes who do not have any Scepter responses (excluding Io and Phoenix, who do not speak).",
    "With the exception of Dark Willow, Grimstroke, Razor, Snapfire and Void Spirit, heroes never mention Aghanim's name in their voice responses, simply referring to it as \"The Scepter\". The reason for this is unknown.",
    "Riki and Lion are the only heroes who do not have any Scepter responses (excluding Io and Phoenix, who do not speak)."
  ],
  "upgradeIn": [
    "Aghanim's Blessing"
  ],
  "bonuses": [
    "+10 Strength",
    "+10 Agility",
    "+10 Intelligence",
    "+175 Health",
    "+175 Mana"
  ],
  "tips": null
}