{
  "abilities": [
    {
      "notes": [
        "The agility talent effectively grants Vengeful Spirit 1.67 armor, 10 attack speed, and 10 main attack damage.",
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Vengeful Spirit's magic resistance to 34%.",
        "Increases Vengeful Spirit's magic resistance to 34%."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Magic Missile Pierces Spell Immunity",
          "talentRight": "+16% Vengeance Aura Base Damage Bonus"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-15s Nether Swap Cooldown",
          "talentRight": "+200 Magic Missile Damage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-2.75s Magic Missile Cooldown",
          "talentRight": "-2 Wave of Terror Armor"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 Agility",
          "talentRight": "+12% Magic Resistance"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Vengeful_Spirit_Magic_Missile_1.mp3\/revision\/latest?cb=20191216030141",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1350.",
        "Magic Missile first applies the debuff, then the damage."
      ],
      "mana": "100\/110\/120\/130",
      "item_behaviour": [],
      "name": "Magic Missile",
      "cooldown": "12\/11\/10\/9 (TagTalent 9.25\/8.25\/7.25\/6.25)",
      "description": "Fires a magic missile at an enemy unit, stunning and dealing damage.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 575\/600\/625\/650",
        "Damage: 90\/180\/270\/360 (TagTalent 290\/380\/470\/560)",
        "Stun Duration: 1.4\/1.5\/1.6\/1.7",
        "Cannot target or affect spell immune units. Can target and affect spell immune units.",
        "Blocked upon impact."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Vengeful_Spirit_Wave_of_Terror.mp3\/revision\/latest?cb=20191216030144",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The wave travels at a speed of 2000, taking 0.7 seconds to travel the full distance.",
        "With the travel distance and effect radius, Wave of Terror can hit units up to 1725 range away.",
        "The wave provides 350 radius flying vision as it travels, which lasts for 4 seconds. This vision starts 100 range away from Vengeful Spirit. With the travel distance and vision radius, the vision reaches up to 2000 range away.",
        "This vision starts 100 range away from Vengeful Spirit. With the travel distance and vision radius, the vision reaches up to 2000 range away.",
        "The debuff from successive casts does not stack, only the duration gets refreshed.",
        "The wave first applies the debuff, then the damage.",
        "Does not affect Couriers.",
        "With Aghanim's Shard, Vengeful Spirit gains a buff for each enemy hit by Wave of Terror. Multiple instances of this buff fully stack. Uses the regular Wave of Terror debuff to steal attack damage and armor from the targets. The debuff does not stack. This means it reduces attack damage and armor of all enemies hit. However, Vengeful Spirit only gains the buff from affected heroes, including clones, excluding illusions and creep-heroes.",
        "Uses the regular Wave of Terror debuff to steal attack damage and armor from the targets. The debuff does not stack.",
        "This means it reduces attack damage and armor of all enemies hit.",
        "However, Vengeful Spirit only gains the buff from affected heroes, including clones, excluding illusions and creep-heroes.",
        "Both 20% attack damage and armor reduction is directly reduced from the target's main attack damage and main armor. Bonus attack damage and bonus bonuses are not reduced. The attack damage gained is added as main attack damage for Vengeful Spirit, however the armor gained is added as bonus armor. The stolen values are set upon gaining the buff and do not adapt to the target's main attack damage or main armor, and it equals the exact amount of values the target lost upon debuffed.",
        "The attack damage gained is added as main attack damage for Vengeful Spirit, however the armor gained is added as bonus armor.",
        "The stolen values are set upon gaining the buff and do not adapt to the target's main attack damage or main armor, and it equals the exact amount of values the target lost upon debuffed.",
        "Wave of Terror's default armor reduction is applied normally on the targets still. Vengeful Spirit does not gain this armor. With Aghanim's Shard, Wave of Terror effectively removes 20% main armor + 3\/4\/5\/6 (TagTalent 5\/6\/7\/8) bonus armor in total.",
        "With Aghanim's Shard, Wave of Terror effectively removes 20% main armor + 3\/4\/5\/6 (TagTalent 5\/6\/7\/8) bonus armor in total."
      ],
      "mana": "25\/30\/35\/40",
      "item_behaviour": [],
      "name": "Wave of Terror",
      "cooldown": "16\/14\/12\/10",
      "description": "Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the path ahead.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 1400",
        "Wave Travel Distance: 1400",
        "Effect Radius: 325",
        "Damage: 70\/90\/110\/130",
        "Armor Reduction: 3\/4\/5\/6 (TagTalent 5\/6\/7\/8)",
        "Duration: 8",
        "Main Attack Damage Steal: 20%",
        "Main Armor Steal: 20%",
        "Wave of Terror steals 20% of enemy hero base damage and base armor, granting it to Vengeful Spirit for the debuff duration."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies (TagAghanim Self)"
      ],
      "notes": [
        "The aura's buff lingers for 0.5 seconds.",
        "Grants flat bonus attack damage based on the affected unit's main attack damage. Does not further increase bonus attack damage.",
        "The aura affects invulnerable, but not hidden allies.",
        "With Aghanim's Scepter, The illusion spawns 108 range away either north, east, south or west from Vengeful Spirit's death location. The illusion is a strong illusion, meaning it cannot be instantly killed by abilities which normally kill illusions instantly. It always spawns with full mana and health and all abilities off-cooldown, regardless of their cooldown status on Vengeful Spirit. It can cast abilities, but not item abilities. The illusion spawns on every death, including with Reincarnation sources. It does not have a set duration upon spawning and is equal of Vengeful Spirit's normal death duration. The next respawn time increase from buying back does not further increase the illusion's duration. The illusion disappear once Vengeful Spirit respawns, or when it reaches the normal death duration.",
        "The illusion is a strong illusion, meaning it cannot be instantly killed by abilities which normally kill illusions instantly.",
        "It always spawns with full mana and health and all abilities off-cooldown, regardless of their cooldown status on Vengeful Spirit.",
        "It can cast abilities, but not item abilities.",
        "The illusion spawns on every death, including with Reincarnation sources.",
        "It does not have a set duration upon spawning and is equal of Vengeful Spirit's normal death duration.",
        "The next respawn time increase from buying back does not further increase the illusion's duration.",
        "The illusion disappear once Vengeful Spirit respawns, or when it reaches the normal death duration.",
        "The created illusion is visually distinguishable from the real Vengeful Spirit for the enemies. This illusion uses the hero health bar instead of the regular unit health bar like other illusions. Unlike other illusions, this illusion does not have a gold bounty. This illusion cannot be Enchanted. It gets slowed instead.",
        "This illusion uses the hero health bar instead of the regular unit health bar like other illusions.",
        "Unlike other illusions, this illusion does not have a gold bounty.",
        "This illusion cannot be Enchanted. It gets slowed instead.",
        "With Aghanim's Scepter, Vengeful Spirit can gain experience even while dead. While dead, she is periodically moved along with the Vengeance Illusion, allowing her to gain experience around the illusion. This also allows her to respawn at the illusion's location, instead of at the fountain. However, these effects require the illusion to be alive. If it dies, she no longer gains experience, and stops moving along with it.",
        "While dead, she is periodically moved along with the Vengeance Illusion, allowing her to gain experience around the illusion.",
        "This also allows her to respawn at the illusion's location, instead of at the fountain.",
        "However, these effects require the illusion to be alive. If it dies, she no longer gains experience, and stops moving along with it."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Vengeance Aura",
      "cooldown": null,
      "description": "Vengeful Spirit's presence increases the damage of nearby friendly heroes.",
      "hot_key": "E",
      "params": [
        "Radius: 1200",
        "Attack Damage Bonus: 11%\/18%\/25%\/32% (TagTalent 27%\/34%\/41%\/48%)",
        "Aura Linger Duration: 0.5",
        "Number of Illusions on Death: 1",
        "Illusion Damage Dealt: 100%",
        "Illusion Damage Taken: 100%",
        "Illusion Move Speed Bonus: 12%",
        "Upon death, creates a strong illusion of Vengeful Spirit that deals and takes 100% damage and can cast all of her spells. Illusion has 12% movement speed bonus. If the illusion is alive when Vengeful Spirit respawns, she will take its place. XP earned by her illusion is given to her.",
        "Aura is disabled by break. Still spawns a Vengeance illusion on death.",
        "Illusions bestow the aura. Illusions do not spawn a Vengeance illusion on their death."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Vengeful_Spirit_Nether_Swap.mp3\/revision\/latest?cb=20191216030143",
      "effects": [
        "Ability Target Unit",
        "Affects Heroes",
        "Damage Magical"
      ],
      "notes": [
        "The target is given a stop command as soon as it is swapped back, effectively canceling channeling abilities.",
        "Does not disjoint projectiles upon swapped, neither for the caster, nor for the target.",
        "Destroys trees within 300 radius around Vengeful Spirit and the target.",
        "Can be cast on illusions, Spirit Bear and on invulnerable units.",
        "The damage is only applied to enemy targets.",
        "Vengeful Spirit always gains the buff, no matter if she targets an ally or an enemy. Applies generic incoming damage reduction on allies. Stacks additively with other sources of generic incoming damage manipulation. The reduction affects all damage the allies take that is not flagged as HP removal.",
        "Applies generic incoming damage reduction on allies. Stacks additively with other sources of generic incoming damage manipulation.",
        "The reduction affects all damage the allies take that is not flagged as HP removal."
      ],
      "mana": "100\/150\/200",
      "item_behaviour": [],
      "name": "Nether Swap",
      "cooldown": "50\/40\/30 (TagTalent 35\/25\/15)",
      "description": "Instantaneously swaps positions with a target Hero, friend or enemy. Nether Swap interrupts channeling abilities on the target. Enemy Swapped units take 50 damage Allied swapped units receive less damage for a short duration",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.4+0",
        "Cast Range: 800\/950\/1100",
        "Enemy Damage: 50",
        "Ally\/Self Incoming Damage Reduction: 30%\/40%\/50%",
        "Damage Reduction Duration: 3"
      ],
      "legacy_key": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 19.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.2,
    "attrAgility": 20.0
  },
  "description": "Shendelzare, the Vengeful Spirit, is a ranged agility hero who excels at ganking, disabling, and kill hunts. She is one of the most well-rounded supports in the game, possessing a skill set that allows her to set up kills for her team during ganks and teamfights, strengthening her team and weakening the enemy in large-scale engagements, and saving allies from certain death if they are caught by the enemy.",
  "history": "Even the most contented Skywrath is an ill-tempered creature, naturally inclined to seek revenge for the slightest insult. But Vengeful Spirit is the essence of vengeance. Once a proud and savage Skywrath scion, Shendelzare was first in succession for the Ghastly Eyrie until a sister's treachery robbed her of her birthright. Snared in an assassin's net, Shendelzare tore free only at the cost of her wings, limping away in the ultimate humiliation: On foot. With her wings broken, she knew the Skywrath would never accept her as ruler; and in the highest roost of the Eyrie, inaccessible except by winged flight, her sister was untouchable. Unwilling to live as a flightless cripple, and desiring revenge far more than earthly power, the fallen princess drove a bargain with the goddess Scree'auk: She surrendered her broken body for an imperishable form of spirit energy, driven by vengeance, capable of doing great damage in the material plane. She may spend eternity flightless, but she will have her revenge.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Magic Missile Pierces Spell Immunity",
      "talentRight": "+16% Vengeance Aura Base Damage Bonus"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-15s Nether Swap Cooldown",
      "talentRight": "+200 Magic Missile Damage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-2.75s Magic Missile Cooldown",
      "talentRight": "-2 Wave of Terror Armor"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 Agility",
      "talentRight": "+12% Magic Resistance"
    }
  ]
}