{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Arena Of Blood Grants Team +180 HP Regen",
          "talentRight": "God's Rebuke +65% Crit"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0.8s Spear of Mars Stun",
          "talentRight": "+10%\/5% Bulwark Front\/Side Damage Reduction"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 Spear of Mars Damage",
          "talentRight": "-4s God's Rebuke Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-10% Bulwark Movement Penalty",
          "talentRight": "+1.5s God's Rebuke Slow"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Mars_Spear_of_Mars_1.mp3\/revision\/latest?cb=20191216020055",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The spear travels at a speed of 1400, taking 0.64\/0.71\/0.79\/0.86 seconds to reach maximum distance.",
        "The spear starts traveling exactly on Mars' location, and travels forward up to 900\/1000\/1100\/1200 range. Although within the spear's search radius, it does not hit enemies behind Mars upon cast. With the travel distance and search radius, it can hit units up to 1025\/1125\/1225\/1325 range away.",
        "Although within the spear's search radius, it does not hit enemies behind Mars upon cast.",
        "With the travel distance and search radius, it can hit units up to 1025\/1125\/1225\/1325 range away.",
        "A spear may only damage and drag 1 (or 2) heroes along with it, and are stunned during the drag. If that hero dies or gets freed from the spear, it cannot impale a new hero. Dragged heroes are made to face towards the direction the spear came from. When hitting a building, tree, or cliff, the hero is moved closely to the pinned object and stunned. Buildings include every building, enemy and allied ones alike, but excludes the shops. Cliffs include all natural cliffs onto elevated areas, as well as pathing blockers (i.e. Ice Shards) and Arena Of Blood. Terrain decorations like the walls at the borders of both bases, the random statues on the map, and the arches at stairs cannot be used to pin enemies.",
        "If that hero dies or gets freed from the spear, it cannot impale a new hero.",
        "Dragged heroes are made to face towards the direction the spear came from.",
        "When hitting a building, tree, or cliff, the hero is moved closely to the pinned object and stunned.",
        "Buildings include every building, enemy and allied ones alike, but excludes the shops.",
        "Cliffs include all natural cliffs onto elevated areas, as well as pathing blockers (i.e. Ice Shards) and Arena Of Blood.",
        "Terrain decorations like the walls at the borders of both bases, the random statues on the map, and the arches at stairs cannot be used to pin enemies.",
        "Provides true sight over the impaled enemy. No true sight is applied while dragging the enemy along with the spear.",
        "Upon losing the impale stun debuff, trees within a 100 radius around the hero get destroyed.",
        "Hit non-hero units (including creep-heroes), as well as secondary heroes are damaged and knocked back instead. The knockback direction is based on the angle between the hit unit and the spear. The knockback does not disable units. They can still turn, attack and use items. Channeling abilities or items are not interrupted by it. The knockback destroys every tree the units collide with.",
        "The knockback direction is based on the angle between the hit unit and the spear.",
        "The knockback does not disable units. They can still turn, attack and use items. Channeling abilities or items are not interrupted by it.",
        "The knockback destroys every tree the units collide with.",
        "The spear cannot collide with invulnerable or hidden units, it simply flies through them.",
        "The spear provides 300 radius flying vision as it travels. When not impaling a hero to an object, the vision lingers at the final location for 1 second. When impaling a hero to an object, the vision lingers based on the default stun duration.",
        "When not impaling a hero to an object, the vision lingers at the final location for 1 second.",
        "When impaling a hero to an object, the vision lingers based on the default stun duration.",
        "Beginning casting Spear of Mars automatically toggles Bulwark Off.",
        "With Aghanim's Shard, Spear of Mars leaves behind a fire trail as it travels. The fire lasts 10 seconds from the moment it is created. This means the fire created at the starting location disappears earlier than the fire created at the ending location. The fire places a debuff on enemies within the area in 0.5-second intervals, starting 0.5 seconds after the fire was created. The debuff deals 17.5 damage in 0.5-second intervals, starting 0.5 seconds after being placed, resulting in 4 damage instances. This results in a maximum of 24 damage instances when standing within the area the full duration. One instance of the debuff can deal up to 70 damage (before reductions). The entire fire trail can deal up to 420 damage to a single unit (before reductions). Multiple overlapping fire trails do not stack, instead they refresh the same debuff on enemies.",
        "The fire lasts 10 seconds from the moment it is created.",
        "This means the fire created at the starting location disappears earlier than the fire created at the ending location.",
        "The fire places a debuff on enemies within the area in 0.5-second intervals, starting 0.5 seconds after the fire was created.",
        "The debuff deals 17.5 damage in 0.5-second intervals, starting 0.5 seconds after being placed, resulting in 4 damage instances.",
        "This results in a maximum of 24 damage instances when standing within the area the full duration.",
        "One instance of the debuff can deal up to 70 damage (before reductions).",
        "The entire fire trail can deal up to 420 damage to a single unit (before reductions).",
        "Multiple overlapping fire trails do not stack, instead they refresh the same debuff on enemies."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "Q",
      "cooldown": "14\/13\/12\/11",
      "description": "Mars throws his legendary Spear with deadly precision, damaging each enemy unit it strikes. The first enemy hero it hits is skewered on the spear, pushing it back. If a skewered hero hits a tree, building, or cliff, they will be impaled to it and stunned.",
      "spellName": "Spear of Mars",
      "params": [
        "Cast Animation: 0.25+1.03",
        "Cast Range: Global",
        "Max Travel Distance: 900\/1000\/1100\/1200",
        "Spear Collision Size: 125",
        "Spear Damage: 100\/175\/250\/325 (TagTalent 200\/275\/350\/425)",
        "Knockback Distance: 75",
        "Knockback Duration: 0.25",
        "Number of Impaled Units: 1 (TagTalent 2)",
        "Impale Stun Duration: 1.6\/2\/2.4\/2.8 (TagTalent 2.4\/2.8\/3.2\/3.6)",
        "Fire Trail Radius: 200",
        "Fire Damage per Second: 35",
        "Fire Move Speed Slow: 20%",
        "Fire Trail Duration: 10",
        "Fire Trail Debuff Duration: 2",
        "Spear of Mars impales up to two units and leaves a fire trail behind for 10 seconds. Deals 35 damage per second and slows by 20%. Debuff lingers for 2 seconds."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "The legendary Spear of Mars still glows with the heat of the forge god's fires."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8d\/Mars_God%27s_Rebuke_1.mp3\/revision\/latest?cb=20191216020052",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "God's Rebuke's effects are instantly applied within its whole area. There is no travel time.",
        "The area is shaped like a circular sector, with a radius of 500 and an angle of 140°.",
        "God's Rebuke affects an area based on Mars's facing angle, not where the ability was targeted. This means when Bulwark is toggled On, it always launches towards the locked facing direction, since Mars cannot turn towards the targeted point.",
        "This means when Bulwark is toggled On, it always launches towards the locked facing direction, since Mars cannot turn towards the targeted point.",
        "Causes Mars to perform an instant attack on all hit enemies. These instant attacks can proc any attack modifiers and on-hit effects normally, with cleave being an exception. They have True Strike, but ignore disarms. God's Rebuke has an ensured critical strike, crits with a lower value have no effect if they proc, since the higher crit value takes priority.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally, with cleave being an exception. They have True Strike, but ignore disarms.",
        "God's Rebuke has an ensured critical strike, crits with a lower value have no effect if they proc, since the higher crit value takes priority.",
        "If not killed, hit enemies are knocked back and slowed. The direction is based on the angle between the hit unit and the caster. Units are not disabled during the knockback. They can still turn, attack, cast abilities and use items. Channeling abilities are not interrupted. Does not push heroes affected by the impale stun of Spear of Mars. The knockback destroys every tree the units collide with.",
        "Units are not disabled during the knockback. They can still turn, attack, cast abilities and use items. Channeling abilities are not interrupted.",
        "Does not push heroes affected by the impale stun of Spear of Mars.",
        "The knockback destroys every tree the units collide with.",
        "God's Rebuke first applies knockback, then the slow, then the instant attack.",
        "The slow and knockback are applied at the same time, so the slow effectively lasts for 1.7 seconds."
      ],
      "mana": "80",
      "hotKey": "W",
      "cooldown": "16\/14\/12\/10 (TagTalent 12\/10\/8\/6)",
      "description": "Mars smashes enemies in front of him with his shield, knocking them back and damaging them with a critical hit based on his attack. Bonus damage is added when hitting heroes. Has True Strike.",
      "spellName": "God's Rebuke",
      "params": [
        "Cast Animation: 0.2+1.07",
        "Cast Range: 500",
        "Radius: 500",
        "Circle Sector Angle: 140°",
        "Critical Damage: 150%\/190%\/230%\/270% (TagTalent 215%\/255%\/295%\/335%)",
        "Hero Attack Damage Bonus: 20\/25\/30\/35",
        "Move Speed Slow: 40%",
        "Knockback Distance: 150",
        "Knockback Duration: 0.3",
        "Slow Duration: 2 (TagTalent 3.5)",
        "The instant attack fully pierces spell immunity. Does not knock spell immune enemies back."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "There isn't a warrior alive who can stand unmoved by the sting of Mars' rebuke."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f2\/Mars_Bulwark_1.mp3\/revision\/latest?cb=20191216020049",
      "effects": [
        "Ability Toggle \/ Passive",
        "Affects Self (TagAghanim Enemies)",
        "Damage Instant Attack"
      ],
      "notes": [
        "Bulwark does not interrupt Mars' channeling abilities upon toggling On \/ Off.",
        "Applies generic incoming damage reduction on Mars. Stacks additively with other sources of generic incoming damage manipulation. The reduction follows the same targeting rules as damage block does, reacting mainly on attack damage. However, this means it also reacts on abilities that react on damage block and is bypassed by some sources of instant attacks. Increases Mars' effective health by 67%\/100%\/150%\/233% when taking front damage. Increases Mars' effective health by 25%\/33%\/43%\/54% when taking side damage.",
        "The reduction follows the same targeting rules as damage block does, reacting mainly on attack damage.",
        "However, this means it also reacts on abilities that react on damage block and is bypassed by some sources of instant attacks.",
        "Increases Mars' effective health by 67%\/100%\/150%\/233% when taking front damage.",
        "Increases Mars' effective health by 25%\/33%\/43%\/54% when taking side damage.",
        "Checks the damage source's current position and Mars' facing angle when the attack connects, not when the attack is released.",
        "Bulwark damage reduction occurs after Damage Block. Although both Bulwark and Damage Block use the same visuals when showing how much damage was blocked, they do not interfere with each other.",
        "Although both Bulwark and Damage Block use the same visuals when showing how much damage was blocked, they do not interfere with each other.",
        "Plays a visual effect and a sound whenever damage is blocked. The default hit sound does not play. When blocking hero damage from the front, a bigger visual effect and the default sound are played. When blocking hero damage from the sides, or creep damage from the front, a smaller visual effect and the small sound are played. When blocking creep damage from the sides, no effect and sound are played.",
        "When blocking hero damage from the front, a bigger visual effect and the default sound are played.",
        "When blocking hero damage from the sides, or creep damage from the front, a smaller visual effect and the small sound are played.",
        "When blocking creep damage from the sides, no effect and sound are played.",
        "While toggled On, Mars is disarmed and slowed, and has his facing direction locked. He can still cast abilities and items, and move normally, but no longer requires facing the target to do so. Automatically toggles Off when Spear of Mars is cast. Any attack projectile within 800 range of Mars, and within the front and side angles of Bulwark have a chance to get redirected. The ally being attacked does not need to be anywhere near Mars, only the attacking enemy needs to be within range of Mars. The redirect happens immediately upon projectile launch. Instead of targeting the intended attack target, it targets Mars instead.",
        "He can still cast abilities and items, and move normally, but no longer requires facing the target to do so.",
        "Automatically toggles Off when Spear of Mars is cast.",
        "Any attack projectile within 800 range of Mars, and within the front and side angles of Bulwark have a chance to get redirected.",
        "The ally being attacked does not need to be anywhere near Mars, only the attacking enemy needs to be within range of Mars.",
        "The redirect happens immediately upon projectile launch. Instead of targeting the intended attack target, it targets Mars instead.",
        "Goes on a 0.2-second cooldown upon toggling Off.",
        "With Aghanim's Scepter, 5 invulnerable soldiers are spawned in an arc in front of Mars. The first soldier is located exactly in front of Mars, and the others are offset by 30° to either side, forming an arc. Each soldier attacks enemies within 250 range around them. However, they do not attack enemies within 150 range of Mars. This results in a total area shaped like a horseshoe. Each soldier can attack only one enemy at a time. The enemies are chosen randomly, there are no priorities. The soldiers always attack together, even if not all of them have a target, so that their interval is always synchronized. The soldiers attack in 1-second intervals, and the attack interval timer only counts down while Bulwark is toggled On. For example, if Bulwark is toggled off 0.4 seconds after their last attack, the next time it is toggled on, they still have to wait 0.6 seconds before they can attack again. The instant attacks are performed by Mars himself. They first apply the damage, then the slow. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "The first soldier is located exactly in front of Mars, and the others are offset by 30° to either side, forming an arc.",
        "Each soldier attacks enemies within 250 range around them.",
        "However, they do not attack enemies within 150 range of Mars. This results in a total area shaped like a horseshoe.",
        "Each soldier can attack only one enemy at a time. The enemies are chosen randomly, there are no priorities.",
        "The soldiers always attack together, even if not all of them have a target, so that their interval is always synchronized.",
        "The soldiers attack in 1-second intervals, and the attack interval timer only counts down while Bulwark is toggled On.",
        "For example, if Bulwark is toggled off 0.4 seconds after their last attack, the next time it is toggled on, they still have to wait 0.6 seconds before they can attack again.",
        "The instant attacks are performed by Mars himself. They first apply the damage, then the slow.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms."
      ],
      "mana": "0",
      "hotKey": "E",
      "cooldown": "0.2",
      "description": "Mars wields his massive shield to block a portion of each physical attack when hit from the front or sides. Can be toggled, removing Mars's ability to attack, and locking the direction he is facing. When active, reduces movement speed and re-directs 70% of the attack projectiles aimed at Mars's allies towards Mars instead.",
      "spellName": "Bulwark",
      "params": [
        "Front Angle: 140°",
        "Side Angle: 240°",
        "Front Damage Reduction: 40%\/50%\/60%\/70% (TagTalent 50%\/60%\/70%\/80%)",
        "Side Damage Reduction: 20%\/25%\/30%\/35% (TagTalent 25%\/30%\/35%\/40%)",
        "Active Projectile Redirect Chance: 70%",
        "Active Projectile Redirect Range: 800",
        "Active Self Move Speed Slow: 20% (TagTalent 10%)",
        "Instant Attack Interval: 1",
        "Instant Attack Damage Bonus: 75",
        "Number of Soldiers: 5",
        "Soldiers Distance: 200",
        "Soldiers Attack Range: 250",
        "Enemy Move Speed Slow: 30%",
        "Slow Duration: 1",
        "Creates invulnerable soldiers around Mars' front while Bulwark is toggled on. Soldiers move alongside Mars, dealing his full damage +75 and applying procs. Attacks slow enemies by 30% for 1 second. An enemy can only be attacked by one soldier at a time.",
        "The attacks of the soldiers pierces spell immunity.",
        "Break does not disable the projectile redirect (TagTalent or the soldiers) when toggled on, but does disable the damage reduction."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Only the very foolish dare to fight fair with the god of war."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Mars_Arena_of_Blood_1.mp3\/revision\/latest?cb=20191216020059",
      "effects": [
        "Ability Target Area",
        "Affects Enemies (TagAghanim Allies)",
        "Damage Magical"
      ],
      "notes": [
        "The effect delay is not included in the field's duration. The actual duration starts right after the delay.",
        "Inside the arena, enemies without flying movement coming within 160 range of the wall get damaged. If not killed by the damage, the enemy is knocked back towards the arena center. Units are not disabled during the knockback. They can still turn, attack, cast abilities and use items. Channeling abilities are not interrupted. Does not push heroes affected by the impale stun of Spear of Mars. The knockback destroys every tree the units collide with.",
        "If not killed by the damage, the enemy is knocked back towards the arena center.",
        "Units are not disabled during the knockback. They can still turn, attack, cast abilities and use items. Channeling abilities are not interrupted.",
        "Does not push heroes affected by the impale stun of Spear of Mars.",
        "The knockback destroys every tree the units collide with.",
        "A unit may only be damaged and knocked back once every 1 second.",
        "Stops enemies without flying movement by slowing them with a slow aura. The aura has a radius of 750 and is centered on the field. The slow gets exponentially stronger towards the walls, which has a 550 radius. This effectively causes enemy units touching the walls to come to halt. The slow is only present when facing towards the walls. Units at the walls facing away from it are not slowed. The slow aura's effect lingers for 0.5 seconds, resulting in an effective duration of 5.5\/6.5\/7.5 seconds. Since the slow is fluctuating a lot, it is not displayed in the HUD.",
        "The slow gets exponentially stronger towards the walls, which has a 550 radius.",
        "This effectively causes enemy units touching the walls to come to halt.",
        "The slow is only present when facing towards the walls. Units at the walls facing away from it are not slowed.",
        "The slow aura's effect lingers for 0.5 seconds, resulting in an effective duration of 5.5\/6.5\/7.5 seconds.",
        "Since the slow is fluctuating a lot, it is not displayed in the HUD.",
        "Besides preventing enemies from walking in or out of the area, the following movement spells are unable to pass the walls either: Skewer, Sun Ray Movement, God's Rebuke, Force Staff and Hurricane Pike. All other sources of horizontal movement can move units through the walls freely. However, the knockback from inside the arena still triggers and can cancel forced movement.",
        "Skewer, Sun Ray Movement, God's Rebuke, Force Staff and Hurricane Pike.",
        "All other sources of horizontal movement can move units through the walls freely.",
        "However, the knockback from inside the arena still triggers and can cancel forced movement.",
        "Units with flying movement and units affected by vertical movement can enter and leave the arena at any time. This means units thrown in the air by spells may be pushed in or out of the arena freely.",
        "This means units thrown in the air by spells may be pushed in or out of the arena freely.",
        "Any attack projectile coming from an enemy gets blocked upon coming within 100 range of the walls. These blocked projectiles count as completely negated, so that no on-attack effects can trigger (e.g. Retaliate). This means ranged enemies outside the arena cannot attack units inside of it and vice versa. Melee units can attack freely, if they have enough attack range. Projectiles from abilities are completely unaffected as well.",
        "These blocked projectiles count as completely negated, so that no on-attack effects can trigger (e.g. Retaliate).",
        "This means ranged enemies outside the arena cannot attack units inside of it and vice versa.",
        "Melee units can attack freely, if they have enough attack range. Projectiles from abilities are completely unaffected as well.",
        "Provides 550 range flying vision at the center of the area for 5\/6\/7 seconds upon cast.",
        "After the effect delay, any tree within 550 range of the wall gets destroyed. This means it effectively destroys trees within a 825 radius.",
        "This means it effectively destroys trees within a 825 radius.",
        "The level 25 talent adds health regeneration to the arena. The regeneration is provided by an aura, which lingers for 0.5 seconds. Can regenerate up to 990\/1170\/1350 health over its full duration with the aura linger duration.",
        "Can regenerate up to 990\/1170\/1350 health over its full duration with the aura linger duration."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "90",
      "description": "After a short formation time, Mars summons an arena lined with the undead warriors of the Ash Legion, who block enemy attacks and movement. Enemy heroes near the inside edge of the arena will be attacked by spears, dealing damage and knocking them back.",
      "spellName": "Arena Of Blood",
      "params": [
        "Cast Animation: 0.2+0.97",
        "Cast Range: 400",
        "Arena Radius: 550",
        "Wall Width: 100",
        "Effect Delay: 0.3",
        "Spear Trigger Distance: 160",
        "Spear Damage: 100\/160\/220",
        "Spear Attack Interval: 1",
        "Spear Knockback Distance: 160",
        "Spear Knockback Duration: 0.2",
        "Arena Duration: 5\/6\/7",
        "Aura Linger Duration: 0.5",
        "Ally Health Regen Bonus: 180",
        "Does not affect spell immune enemies. Affects spell immune allies."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "The long-dead members of the Ash Legion, assembled from the finest warriors to ever test the might of Mars, still revel in the thrill of combat, gladly beholden to the hand that fell them for as long as he so commands."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 23.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 1.7,
    "attrAgility": 20.0
  },
  "description": "Mars, the First Son of Heaven, is an aggressive melee strength hero who controls the battlefield with numerous knockbacks and impassable terrain. Equipped with a large shield, his Bulwark passively blocks attacks from the front and sides, making him a very durable fighter in most situations. The same shield allows him to smash enemies and knock them back, dealing critical damage that ignores all evasion. The Spear of Mars can be thrown at long range, piercing enemies to push them back, and stunning them upon contact with trees or terrain. Mars' most potent ability creates an Arena Of Blood, a circular zone where no enemy can exit or enter, as well as blocking enemy attacks from the outside. Used correctly, the Arena Of Blood can decisively split and cut off enemies from support during teamfights, making Mars a valuable asset to his team, as well as a highly dangerous opponent.",
  "history": "Mars, first son of heaven, spent a long existence waging endless war, and saw countless more crusades waged beneath the banner of his old name. Wars of conquest and of vengeance. Just and unjust... Always cruel. So much like his father, Mars indulged his basest impulses--with inclinations much more monstrous than those of Zeus--and he inflicted suffering untold. But as the epochs vanished behind him, the selfish ways of his father--the ways of many amongst his godly kin, they who judged him despicable--eventually began to ring hollow. War for its own sake was no longer enough to satisfy his desires. For the first time in his ageless days, the god of war began to question to what ends he swung his glorious spear. As the Fates would have it, his solution came easily: he must wage war for a larger purpose, and inspire more than mere savagery and sorrow at the sight of his crest. He must at last lay claim to the mantle of leadership that is his birthright, for the time has come to burn down the pantheon of the old age and build a just new empire atop the ashes of his kin. Only then might he find satisfaction, and make the glory of Mars evident to all.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Arena Of Blood Grants Team +180 HP Regen",
      "talentRight": "God's Rebuke +65% Crit"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0.8s Spear of Mars Stun",
      "talentRight": "+10%\/5% Bulwark Front\/Side Damage Reduction"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 Spear of Mars Damage",
      "talentRight": "-4s God's Rebuke Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-10% Bulwark Movement Penalty",
      "talentRight": "+1.5s God's Rebuke Slow"
    }
  ]
}