{
  "abilities": [
    {
      "effects": [
        "Cast Range: 1000",
        "Radius: 600",
        "Magic Resistance Reduction: 25%",
        "Duration: 16"
      ],
      "notes": [
        "Places a debuff on enemy units in the area upon cast. Leaving or entering the area afterwards has no effect.",
        "Multiple casts on the same targets do not stack, but refresh the duration instead.",
        "Affects invisible units and units in the Fog of War, but not hidden or invulnerable units.",
        "Reduces most heroes' total magic resistance to 6.25%, assuming basic 25% magic resistance and no other sources of magic resistance. Reduces Visage's total magic resistance to -12.5%, assuming his basic 10% magic resistance and no other sources of magic resistance."
      ],
      "elements": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "name": "Magic Weakness",
      "description": "Cast a 600 radius blast that decreases enemy magic resistance by 25%."
    }
  ],
  "cost": "2050",
  "description": "The headwear of corrupt magi.",
  "further": [
    "Helm_of_Iron_Will",
    "Crown",
    "Recipe"
  ],
  "tips": [
    "Gallery",
    "[edit]"
  ],
  "attrs": [
    "Active Magic Weakness",
    "Bonus +6 Strength +6 Agility +15 Intelligence +6 Health regeneration +6 Armor",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "For strength heroes, it grants 135 health, 6.75 health regen, 0.6% magic resistance, 6.96 armor, 6 attack speed, 0.3% movement speed, 180 mana, 0.75 mana regen, 1.05% spell damage and 6 attack damage.",
    "For agility heroes, it grants 108 health, 6.6 health regen, 0.48% magic resistance, 7.2 armor, 7.5 attack speed, 0.38% movement speed, 180 mana, 0.75 mana regen, 1.05% spell damage and 6 attack damage.",
    "For intelligence heroes, it grants 108 health, 6.6 health regen, 0.48% magic resistance, 6.96 armor, 6 attack speed, 0.3% movement speed, 225 mana, 0.94 mana regen, 1.31% spell damage and 15 attack damage."
  ]
}