{"abilities":[{"effects":["Cast Range: 1000","Radius: 600","Spell Damage Amplification: 20%","Duration: 16"],"notes":["Places a debuff on enemy units in the area upon cast. Leaving or entering the area afterwards has no effect.","Multiple casts on the same targets do not stack, but refresh the duration instead.","Affects invisible units and units in the Fog of War, but not hidden or invulnerable units.","Affects magical, physical, and pure spell damage."],"elements":["Ability Target Area","Affects Enemies"],"description":"Cast a 600 radius blast that causes enemies to take 20% increased damage from spells."},{"effects":["Radius: 1200","Mana Regeneration Bonus: 1.25","Aura Linger Duration: 0.5"],"notes":["Can regenerate up to 75 mana in one minute.","The aura's buff lingers for 0.5 seconds.","Stacks with the Basilius Aura from Ring of Basilius."],"elements":["Ability Aura","Affects Allies"],"description":"Grants 1.25 mana regeneration to allies."}],"cost":"2050","description":"The headwear of corrupt magi.","further":["Ring_of_Basilius","Crown","Recipe"],"tips":["Consider how much magical damage your team produces when deciding whether or not to buy veil.","Veil can be a good purchase if your team overall outputs a good amount of magical damage, even if your own hero doesn't."],"attrs":["Active Magic Weakness","Passive Basilius Aura","Bonus +9 Strength +9 Agility +9 Intelligence","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 180 health, 0.9 health regen, 0.72% magic resistance, 1.44 armor, 9 attack speed, 0.45% movement speed, 108 mana, 0.45 mana regen, 0.63% spell damage and 9 attack damage.","For agility heroes, it grants 180 health, 0.9 health regen, 0.72% magic resistance, 1.44 armor, 9 attack speed, 0.45% movement speed, 108 mana, 0.45 mana regen, 0.63% spell damage and 9 attack damage.","For intelligence heroes, it grants 180 health, 0.9 health regen, 0.72% magic resistance, 1.44 armor, 9 attack speed, 0.45% movement speed, 108 mana, 0.45 mana regen, 0.63% spell damage and 9 attack damage."]}