{"abilities":[{"effects":["Дальность применения: 1000","Радиус: 600","Усиление урона от способностей: 20%","Длительность: 16"],"notes":["Применяет дебафф на вражеских юнитов в области. Покидание или вход в область после этого не даст никакого эффекта.","Несколько применений по тем же целям не сочетается, но вместо этого обновляется длительность.","Действует на невидимых существ и существ в тумане войны, но не на спрятанных или неуязвимых существ."],"elements":["Способность Направленная на область","Действует на Врагов"],"name":"Magic Weakness","description":"Ослабляет врагов в области радиусом 600, отчего они получают на 20% больше урона от способностей."},{"effects":["Радиус: 1200","Бонус к восстановлению маны: 1,25","Длительность задержки ауры: 0,5"],"notes":["Может восстановить до 75 маны в минуту.","Бафф ауры задерживается на 0,5 секунды.","Складывается с аурой Ошибка Lua в Модуль:Ability_icon на строке 32: attempt to call global 'cargoQuery' (a nil value). от Ring of Basilius."],"elements":["Способность Аура","Действует на Союзников"],"name":"Basilius Aura","description":"Увеличивает восстановление маны союзников на 1,25."}],"cost":"2050","description":"Головной убор испорченных магов.","further":["Ring_of_Basilius","Crown","Рецепт"],"attrs":["Активная Magic Weakness","Пассивная Basilius Aura","Бонус +9 к силе +9 к ловкости +9 к интеллекту","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 180 здоровья, 0,9 регенерации здоровья, 0,72% сопротивления магии, 1,44 брони, 9 скорости атаки, 0,45% скорости передвижения, 108 маны, 0,45 регенерации маны, 0,63% урона от способностей и 9 урона от атаки.","Для героев ловкости, даёт 180 здоровья, 0,9 регенерации здоровья, 0,72% сопротивления магии, 1,44 брони, 9 скорости атаки, 0,45% скорости передвижения, 108 маны, 0,45 регенерации маны, 0,63% урона от способностей и 9 урона от атаки.","Для героев интеллекта, даёт 180 здоровья, 0,9 регенерации здоровья, 0,72% сопротивления магии, 1,44 брони, 9 скорости атаки, 0,45% скорости передвижения, 108 маны, 0,45 регенерации маны, 0,63% урона от способностей и 9 урона от атаки."]}