{
  "abilities": [
    {
      "notes": [
        "The strength talent effectively grants Necrophos 160 health and 0.8 health regeneration.",
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Necrophos's magic resistance to 36.25%.",
        "Increases Necrophos's magic resistance to 36.25%."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-2.5s Death Pulse Cooldown",
          "talentRight": "+0.5 Heartstopper Aura"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+32 Heartstopper Regen Reduction",
          "talentRight": "+15% Magic Resistance"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+32 Death Pulse Heal",
          "talentRight": "+24% Ghost Shroud Slow"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8 Strength",
          "talentRight": "+100 Reaper's Scythe Cast Range"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Necrophos_Death_Pulse.mp3\/revision\/latest?cb=20191216020945",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "Death Pulse interrupts Necrophos' channeling abilities upon cast.",
        "The pulses travel at a speed of 400.",
        "Affects invisible units and units in Fog of War. Does not affect invulnerable and hidden units. Fully affects allied Couriers.",
        "Does not affect invulnerable and hidden units.",
        "Fully affects allied Couriers.",
        "Heals Necrophos for the following values during Ghost Shroud on each level: Level 1: 87\/123.25\/159.5\/195.75 (TagTalent 133.4\/169.65\/205.9\/242.15) Level 2: 93\/131.75\/170.5\/209.25 (TagTalent 142.6\/181.35\/220.1\/258.85) Level 3: 99\/140.25\/181.5\/222.75 (TagTalent 151.8\/193.05\/234.3\/275.55) Level 4: 105\/148.75\/192.5\/236.25 (TagTalent 161\/204.75\/248.5\/292.25)",
        "Level 1: 87\/123.25\/159.5\/195.75 (TagTalent 133.4\/169.65\/205.9\/242.15)",
        "Level 2: 93\/131.75\/170.5\/209.25 (TagTalent 142.6\/181.35\/220.1\/258.85)",
        "Level 3: 99\/140.25\/181.5\/222.75 (TagTalent 151.8\/193.05\/234.3\/275.55)",
        "Level 4: 105\/148.75\/192.5\/236.25 (TagTalent 161\/204.75\/248.5\/292.25)",
        ""
      ],
      "mana": "100\/130\/160\/190",
      "item_behaviour": [],
      "name": "Death Pulse",
      "cooldown": "8\/7\/6\/5 (TagTalent 5.5\/4.5\/3.5\/2.5)",
      "description": "Necrophos releases a wave of death around him, dealing damage to enemy units and healing allied units.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0.77",
        "Search Radius: 500",
        "Projectile Speed: 400",
        "Damage: 100\/160\/220\/280",
        "Heal: 60\/85\/110\/135 (TagTalent 92\/117\/142\/167)",
        "Grants a new ability: Death Seeker.",
        "Does not target spell immune enemies. Already launched projectiles attempt to damage. Fully affects spell immune allies."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Necrophos_Ghost_Shroud.mp3\/revision\/latest?cb=20191216020946",
      "effects": [
        "Ability No Target \/ Aura",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Ghost Shroud interrupts Necrophos' channeling abilities upon cast.",
        "Turns Necrophos ethereal, disarming him, rendering him attack immune, and granting 100% physical damage resistance.",
        "Reduces Necrophos' total magic resistance to -5%. With the bonus magic resistance talent, it reduces total magic resistance to 10.75% assuming no other sources of magic resistance.",
        "With the bonus magic resistance talent, it reduces total magic resistance to 10.75% assuming no other sources of magic resistance.",
        "Ghost Shroud's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.",
        "Applies heal amplification, health regen amplification, mana restore amplification, and mana regen amplification, but not lifesteal amplification or spell lifesteal amplification.",
        "The slow is provided by an aura. Its debuff lingers for 0.5 seconds."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Ghost Shroud",
      "cooldown": "28\/24\/20\/16 (TagTalent 10)",
      "description": "Necrophos slips into the realm that separates the living from the dead. Unable to attack or be attacked, he emits an aura that slows enemies around him. He takes additional magic damage in this form, but his restorative powers are amplified.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0",
        "Slow Radius: 750",
        "Enemy Move Speed Slow: 12%\/16%\/20%\/24% (TagTalent 36%\/40%\/44%\/48%)",
        "Self Restoration Amplification: 45%\/55%\/65%\/75%",
        "Self Magic Resistance Reduction: 40%",
        "Aura Linger Duration: 0.5",
        "Duration: 3\/3.5\/4\/4.5",
        "Reduces Ghost Shroud cooldown.",
        "Can be cast while spell immune. However, the buff gets immediately removed if spell immunity is detected. Slow persists if debuff was placed before spell immunity."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Enemies \/ Self",
        "Damage Magical (TagAghanimHP Removal)"
      ],
      "notes": [
        "The debuff from Heartstopper Aura lingers for 0.5 seconds.",
        "The health loss from Heartstopper Aura is direct HP Removal, so it does not trigger any on-damage effects. The damage can be increased by reducing the enemy magic resistance but is unaffected by spell damage amplification.",
        "The damage can be increased by reducing the enemy magic resistance but is unaffected by spell damage amplification.",
        "Deals 0.12%\/0.24%\/0.36%\/0.48% (TagTalent 0.22%\/0.34%\/0.46%\/0.58%) of the affected unit's max health as damage in 0.2-second intervals, starting 0.2 seconds after the ability was learnt. The max health lost per second increasing talent does not upgrade the damage for already affected units until they lose the debuff and then get affected again.",
        "The max health lost per second increasing talent does not upgrade the damage for already affected units until they lose the debuff and then get affected again.",
        "The status debuff icon on enemies only shows up when the affected unit has vision over Necrophos. However, the floating damage numbers are always visible.",
        "However, the floating damage numbers are always visible.",
        "Does not affect ancient creeps.",
        "Necrophos gains a regeneration stack on every kill he makes, including denying allied units, but excluding illusions and Tempest Doubles. All stacks work fully independently from each other. They do not refresh each other, but share a status buff. The number of current stacks is visible on the buff. Each stack can regenerate up to 32\/40\/48\/56 health and mana over their full durations. Hero kills grant 6 stacks at once, which can regenerate up to 192\/240\/288\/336 health and mana over their full duration.",
        "All stacks work fully independently from each other. They do not refresh each other, but share a status buff. The number of current stacks is visible on the buff.",
        "Each stack can regenerate up to 32\/40\/48\/56 health and mana over their full durations.",
        "Hero kills grant 6 stacks at once, which can regenerate up to 192\/240\/288\/336 health and mana over their full duration.",
        "Regenerates Necrophos for the following values during Ghost Shroud's duration on each level: Level 1: 5.8\/7.25\/8.7\/10.15 per stack, 17\/22\/26\/30 health and mana restored. Level 2: 6.2\/7.75\/9.3\/10.85 per stack, 22\/27\/33\/38 health and mana restored. Level 3: 6.6\/8.25\/9.9\/11.55 per stack, 26\/33\/40\/46 health and mana restored. Level 4: 7\/8.75\/10.5\/12.25 per stack, 32\/39\/47\/55 health and mana restored.",
        "Level 1: 5.8\/7.25\/8.7\/10.15 per stack, 17\/22\/26\/30 health and mana restored.",
        "Level 2: 6.2\/7.75\/9.3\/10.85 per stack, 22\/27\/33\/38 health and mana restored.",
        "Level 3: 6.6\/8.25\/9.9\/11.55 per stack, 26\/33\/40\/46 health and mana restored.",
        "Level 4: 7\/8.75\/10.5\/12.25 per stack, 32\/39\/47\/55 health and mana restored.",
        "",
        "The level 20 talent adds health regeneration reduction to Heartstopper Aura, but not heal reduction or lifesteal reduction.",
        "With Aghanim's Scepter, Heartstopper Aura deals 0.24%\/0.48%\/0.72%\/0.96% (TagTalent 0.44%\/0.68%\/0.92%\/1.16%) of the affected unit's max health as damage in 0.2-second intervals during Ghost Shroud. In total, it deals 1.2%\/2.4%\/3.6%\/4.8% (TagTalent 2.2%\/3.4%\/4.6%\/5.8%) of max health as damage per second, as long as Necrophos is affected by Ghost Shroud.",
        "In total, it deals 1.2%\/2.4%\/3.6%\/4.8% (TagTalent 2.2%\/3.4%\/4.6%\/5.8%) of max health as damage per second, as long as Necrophos is affected by Ghost Shroud."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Heartstopper Aura",
      "cooldown": null,
      "description": "Necrophos stills the hearts of his opponents, causing nearby enemy units to lose a percentage of their max health over time. Passively provides regen for 8 seconds for each unit Necrophos kills.",
      "hot_key": "E",
      "params": [
        "Radius: 800",
        "Max Health Lost per Second: 0.6%\/1.2%\/1.8%\/2.4% (TagTalent 1.1%\/1.7%\/2.3%\/2.9%)",
        "Ghost Shroud Damage Multiplier: 1 (TagAghanim 2)",
        "Stacks per Hero Kill: 6",
        "Stacks per Non-Hero Kill: 1",
        "Health Regen Bonus per Stack: 4\/5\/6\/7",
        "Mana Regen Bonus per Stack: 4\/5\/6\/7",
        "Stack Duration: 8",
        "Aura Linger Duration: 0.5",
        "Health Regen Reduction: 32%",
        "Increases Heartstopper Aura damage while Ghost Shroud is active.",
        "Prevents gaining new stacks. Already existing stacks still provide bonus health and mana regeneration. Also disables the aura.",
        "Illusions bestow the aura, and can gain regen stacks themselves."
      ],
      "legacy_key": "I",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Necrophos_Death_Seeker.mp3\/revision\/latest?cb=20210101213914",
      "effects": [
        "Ability Target Unit",
        "Affects Allies \/ Enemies"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Cannot be cast on self.",
        "The projectile travels at a speed of 900.",
        "Death Seeker first applies its debuff, then releases the Death Pulse.",
        "Turns the target ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance. The magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority. Reduces most enemy heroes' total magic resistance to 6.25%.",
        "The magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.",
        "Reduces most enemy heroes' total magic resistance to 6.25%.",
        "The released Death Pulse is based on its current level. Death Pulse's notes fully apply. If Death Pulse is not learned, no projectile is released on cast, wasting the mana and cooldown. If the target is invulnerable or hidden on impact, the Death Pulse is not released. The Death Pulse effectively deals 125\/200\/275\/350 damage against the targeted enemy.",
        "If Death Pulse is not learned, no projectile is released on cast, wasting the mana and cooldown.",
        "If the target is invulnerable or hidden on impact, the Death Pulse is not released.",
        "The Death Pulse effectively deals 125\/200\/275\/350 damage against the targeted enemy."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Death Seeker",
      "cooldown": "14",
      "description": "Spawns a fast moving large Death Pulse towards the target enemy or ally, causing the target to become ethereal for 2.5 seconds. Reduces enemy magic resistance by 25%. Spreads towards nearby enemies and allies after impact.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.67",
        "Cast Range: 900",
        "Enemy Magic Resistance Reduction: 25%",
        "Duration: 2.5",
        "Can be cast on spell immune allies, but cannot turn them ethereal. Cannot be cast on spell immune enemies. If the enemy turns spell immune before projectile impact, the Death Pulse is still released.",
        "Blocked upon impact."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a9\/Necrophos_Reaper%27s_Scythe.mp3\/revision\/latest?cb=20191216020948",
      "effects": [
        "Ability Target Unit",
        "Affects Enemy Heroes",
        "Damage Magical"
      ],
      "notes": [
        "Damage is calculated and dealt at the end of the stun duration.",
        "Deals enough damage (before reductions) to kill the enemy when it is at 41%\/44%\/47% of max health. With Death Seeker, Reaper's Scythe deals enough damage to kill the enemy when it is at 51%\/56%\/59% of max health.",
        "With Death Seeker, Reaper's Scythe deals enough damage to kill the enemy when it is at 51%\/56%\/59% of max health.",
        "If the target gets killed by an ally of Necrophos during Reaper's Scythe, Necrophos gets credit for the kill. When the targeted unit is killed by one of its allies, it does not count as a deny and Necrophos is still credited for the kill. Has a lower priority than Ice Blast, so if affected by both, Ice Blast takes priority. Has a higher priority than Winter's Curse, so if affected by both, Reaper's Scythe takes priority.",
        "When the targeted unit is killed by one of its allies, it does not count as a deny and Necrophos is still credited for the kill.",
        "Has a lower priority than Ice Blast, so if affected by both, Ice Blast takes priority.",
        "Has a higher priority than Winter's Curse, so if affected by both, Reaper's Scythe takes priority.",
        "Can be cast on illusions and creep-heroes.",
        "The stun duration is unaffected by status resistance."
      ],
      "mana": "200\/350\/500",
      "item_behaviour": [],
      "name": "Reaper's Scythe",
      "cooldown": "120",
      "description": "Stuns the target enemy hero, then deals damage based on how much life it is missing. Heroes killed by Reaper's Scythe will have 15\/25\/35 seconds added to their respawn timer. Any kill under this effect is credited to Necrophos.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.45+1.5",
        "Cast Range: 600 (TagTalent 700)",
        "Damage per Missing Health: 0.7\/0.8\/0.9",
        "Respawn Time Increase: 15\/25\/35",
        "Stun Duration: 1.5",
        "Still deals damage if debuff was placed before spell immunity."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Rotund'jere, the Necrophos, is a ranged intelligence hero. His abilities are most effective in team fights where he can damage enemies and heal allies simultaneously, while picking off key enemy heroes with his ultimate. Necrophos is most dangerous when his enemy is severely injured, instantly killing them with his ultimate while recovering over time after killing his foe. Necrophos is naturally fragile, but his mechanics require him to stay in the midst of encounters; it is for this reason that he depends on items to prevent his death. Ideally, by casting Death Pulse repeatedly, he and his team are able to stay alive, while regenerating his health and mana for each life he takes, while the enemy team's health is gradually decaying by those same pulses and his Heartstopper Aura, which reduces enemy health by a small percentage each second. Because his abilities are suited to prolonged encounters, he must build items which allow him to survive for as long as possible against his enemies, as well as utilizing his Ghost Shroud to dodge physical damage and crippling the movement of his enemies, allowing his team to catch up and surround them. When the time is right, his ultimate, Reaper's Scythe, has its damage increased by how much of their maximum health the target is missing; meaning that an enemy that is close to death will be killed outright by it. Necrophos is best understood as a hero who is weak at the beginning of a fight but becomes more dangerous with each passing second.",
  "history": "In a time of great plague, an obscure monk of dark inclinations, one Rotund'jere, found himself promoted to the rank of Cardinal by the swift death of all his superiors. While others of the order went out to succor the ill, the newly ordained cardinal secluded himself within the Cathedral of Rumusque, busily scheming to acquire the property of dying nobles, promising them spiritual rewards if they signed over their terrestrial domains. As the plague receded to a few stubborn pockets, his behavior came to the attention of the greater order, which found him guilty of heresy and sentenced him to serve in the plague ward, ensorcelled with spells that would ensure him a slow and lingering illness. But they had not counted on his natural immunity. Rotund'jere caught the pox, but instead of dying, found it feeding his power, transforming him into a veritable plague-mage, a Pope of Pestilence. Proclaiming himself the Necrophos, he travels the world, spreading plague wherever he goes, and growing in terrible power with every village his pestilential presence obliterates.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-2.5s Death Pulse Cooldown",
      "talentRight": "+0.5 Heartstopper Aura"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+32 Heartstopper Regen Reduction",
      "talentRight": "+15% Magic Resistance"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+32 Death Pulse Heal",
      "talentRight": "+24% Ghost Shroud Slow"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8 Strength",
      "talentRight": "+100 Reaper's Scythe Cast Range"
    }
  ]
}