{
  "abilities": [
    {
      "notes": [
        "Casting Summon Wolves replaces currently active wolves from a previous cast, even when they are invulnerable or hidden\n However, it does not replace wolves from a previous cast that are dominated by enemies",
        "The wolves gain  Invisibility on level 3 and  Cripple on level 4\n Both leveling up the ability and the health increasing  talent do not update the current summoned wolves' stats\n It also neither updates the current summoned wolves' ability values nor grants them new abilities\n TALENT NOTES However, the attack damage increasing  talent does immediately update all of Lycan's currently living wolves",
        "Lycan Wolves are summoned 200 range in front of Lycan, with 120 range distance between the wolves\n Lycan is always at the center of the line",
        "Has a cast backswing of 0.6 during  Wolf Form",
        "SHARD NOTES 1  Lane Wolf is now spawned together with each creep wave in one random lane\n The lane for the spawned wolf is selected at complete random each time\n If Summon Wolves is not learned, the Lane Wolf does not spawn\n The Lane Wolf has the lowest target priority than any other unit, so they are targeted by auto-attacks last\n The Lane Wolf spawns even while Lycan is dead",
        "SHARD NOTES Asides from the Lane Wolf being uncontrollable, it interacts with Lycan's abilities just like a regular  Lycan Wolf would: Lycan is considered its owner, last hits made by the Lane Wolf grant bounty and experience to Lycan\n  Howl upon cast is applied around it as well\n  Feral Impulse notes fully apply\n Grants  Shapeshift's critical strike proc chance, but not the haste speed\n The Lane Wolf has  Cripple and it can proc on buildings\n Does not have Invisibility\n SPELL STEAL After losing ability, re-acquiring and recasting the ability create new  Lycan Wolves without replacing the wolves from the previous cast"
      ],
      "item_behaviour": [],
      "description": "Summons two wolves to fight for Lycan. Level 3-4 wolves have Permanent Invisibility, and level 4 wolves have Cripple.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.73",
        "Number of Wolves: 2 ( 4)",
        "Duration: 50",
        "Number of Lane Wolves:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Lycan_Summon_Wolves.mp3\/revision\/latest?cb=20191216015828",
      "effects": [
        "Ability: No Target"
      ],
      "mana": "30",
      "aghanim": null,
      "name": "Summon Wolves",
      "cooldown": "125\/130\/135\/140",
      "legacy_key": "V",
      "story": "The very enchantment that twisted his being also summons canine familiars."
    },
    {
      "notes": [
        "Lycan and his wolves (both  Lycan Wolf and   Lane Wolf) apply the ability effects around them simultaneously, there is no delay\n Does not apply the ability effects when they are invulnerable or hidden",
        "The Howl debuff has the following mechanics: It does not stack\n Enemies can only be affected by the debuff once, despite being within range of multiple sources\n The debuff can only be applied by the caster, including the caster's Lycan Wolves and Lane Wolves\n Other player-controlled units do not apply the debuff around them",
        "Reduces the main attack damage of affected units\n Bonus attack damage is not reduced\n TALENT NOTES Howl now reduces total attack damage instead",
        "Successive casts update the ability values and refresh its duration",
        "Howl's sound effects are Global for allies"
      ],
      "item_behaviour": [],
      "description": "Strikes fear into enemies, reducing armor and attack damage to all enemies within 2000 range of Lycan and his wolves.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Day Radius: 2000",
        "Night Radius: Global",
        "Attack Damage Reduction: 25%\/30%\/35%\/40% ( 45%\/50%\/55%\/60%)",
        "Armor Reduction: 4\/5\/6\/7",
        "Duration: 8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b1\/Lycan_Howl_1.mp3\/revision\/latest?cb=20191216015832",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies"
      ],
      "mana": "22\/20\/18\/16",
      "aghanim": null,
      "name": "Howl",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "W",
      "story": "Blood-curdling wolf cries signal to opponents that Banehallow is among them."
    },
    {
      "notes": [
        "Grants flat bonus attack damage based on the affected units' main attack damage\n Does not further increase bonus attack damage",
        "Feral Impulse affects all Lycan's player-controlled units\n Does not affect wards and  Couriers",
        "Does not affect invulnerable units",
        "Can regenerate up to 60\/180\/300\/420 health in one minute",
        "The aura's buff lingers for 0.5 seconds",
        "Lycan illusions created by abilities (e.g\n  Disruption etc.) do provide their owner and units the bonuses\n However,  Enchanted illusions do not grant  Enchantress' units the bonuses, only the illusion itself keeps them"
      ],
      "item_behaviour": [],
      "description": "Increases the HP regeneration and damage of Lycan and all units under his control.",
      "hot_key": "E",
      "params": [
        "Radius: Global",
        "Attack Damage Bonus: 10%\/20%\/30%\/40% ( 35%\/45%\/55%\/65%)",
        "Health Regen Bonus: 1\/3\/5\/7",
        "Aura Linger Duration: 0.5"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Aura",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Feral Impulse",
      "cooldown": null,
      "legacy_key": "I",
      "story": "His animalistic symbiosis with canine kind gives Banehallow enhanced reflexes and hunting capabilities."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter to be unlocked",
        "The lifesteal component is granted immediately upon cast\n Grants regular lifesteal and shared lifesteal to both, the caster and the target\n This means both Lycan and the targeted ally always are healed within 1200 no matter who attacks\n However, the lifesteal aura only affects the targeted ally, other player-controlled units owned by the ally do not gain these bonuses\n Lifesteal amplification affects shared lifesteal as well, but only if the amplification source is the healed unit\n The regular lifesteal works regardless of distance and stacks additively with other sources of lifesteal",
        "The Wolf Form properties are granted upon finishing the transformation\n It relies on  Shapeshift to work since it directly uses its values\n This affects the following things: If Shapeshift is not learned, Wolf Bite will be at level 1\n Upon cast, the targeted ally is prevented from acting for 1.1 seconds and it cannot be interrupted\n Wolf Bite automatically levels up with Shapeshift and cannot be leveled up separately\n Applies all effects of Shapeshift based on its current level on the ally, including the transformation time, the base  nighttime vision bonus, the critical strike proc chance and the haste speed\n Other Shapeshift notes fully apply",
        "Has a cast backswing of 0.6 during  Wolf Form"
      ],
      "item_behaviour": [],
      "description": "Lycan bites an ally, granting them Shapeshift properties. Lycan and the bitten target gain 30% Lifesteal and share the healing effect of Lifesteal with each other as long as they are within 1200 range of each other.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.3+0.73",
        "Cast Range:  300",
        "Lifesteal Radius: 1200",
        "Lifesteal: 30%",
        "Shared Lifesteal: 30%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Lycan_Shapeshift.mp3\/revision\/latest?cb=20191216015834",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allied Heroes"
      ],
      "mana": "125\/110\/95 (TagTalent 110\/95\/80)",
      "aghanim": null,
      "name": "Wolf Bite",
      "cooldown": "150",
      "legacy_key": "T",
      "story": "Does this bite look infected?"
    },
    {
      "notes": [
        "During the transformation, Lycan is prevented from acting and it cannot be interrupted",
        "Increases Lycan's base  night vision to a total of 1800",
        "Turns the caster into a  melee unit with 150 attack range for its duration\n This causes items that use different values for melee and ranged heroes (e.g\n <span image=\"items\/manta_style\/full.webp\">[Manta Style]<\/span> Manta Style) treat the caster as a melee hero\n Attack range bonuses are fully overridden, including passive item bonuses",
        "The movement speed bonus and critical strike proc chance are provided by a Global aura which affects all player-controlled units owned by Lycan\n The aura's effects linger for 0.1 seconds",
        "Does not affect invulnerable units and wards",
        "Hastes affected units, meaning they cannot be slowed below 550 movement speed",
        "The critical strike increases the attack damage of Lycan and all his units by an average of 24%\/36%\/48%\n The proc chances of multiple crit sources stack\n If two sources of critical strike proc at the same time, the higher multiplier has priority\n The critical strike uses pseudo-random distribution",
        "Lycan gets his current and max health increased by the given value\n This counts as setting health\n Upon losing the buff, his current health stays the same and only the max health bonus gets reverted",
        "Shapeshift is fully canceled on death"
      ],
      "item_behaviour": [],
      "description": "Lycan assumes his lupine form, granting him and his units critical strikes and added vision at night. During Shapeshift, Lycan and all units under his control move at increased speed, cannot be slowed and have a 40% chance to deal a critical strike doing 160%\/190%\/220% damage.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Transformation Time: 1.1",
        "Radius: Global",
        "Base Night Vision Bonus: 1000",
        "Set Base Attack Range: 150",
        "Haste Speed: 550",
        "Health Bonus: 200\/300\/400",
        "Critical Chance: 40%",
        "Critical Damage: 160%\/190%\/220%",
        "Aura Linger Duration: 0.1",
        "Duration: 25 ( 31)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Lycan_Shapeshift.mp3\/revision\/latest?cb=20191216015834",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "125\/110\/95 (TagTalent 110\/95\/80)",
      "aghanim": null,
      "name": "Shapeshift",
      "cooldown": "100",
      "legacy_key": "F",
      "story": "Forever a slave to his lycanthropy, Banehallow has come to accept his curse, and embrace his own savagery."
    },
    {
      "notes": [
        "Requires level 3  Summon Wolves to be unlocked\n Available for level 3 and level 4 wolves",
        "The invisibility is broken upon landing an attack\n Missed attacks or attacking items do break it",
        "Does not provide phased movement"
      ],
      "item_behaviour": [],
      "description": "Permanently invisible when not attacking.",
      "hot_key": "?",
      "params": [
        "Fade Delay: 2"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Invisibility",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Requires level 4  Summon Wolves to be unlocked",
        "Deals damage in 1-second intervals, starting second after proccing, resulting in 4 instances",
        "Can deal up to 32 damage to the target (before reductions)",
        "Multiple debuff procs on the same target stack\n The proccing attack first applies the debuff, then its own damage\n Can proc on allied units as well\n Does not proc on wards or buildings"
      ],
      "item_behaviour": [],
      "description": "Gives 20% chance to cripple the target, causing 8 damage per second and lose 60 attack speed for 4 seconds.",
      "hot_key": "?",
      "params": [
        "Proc Chance: 20%",
        "Damage per Second: 8",
        "Move Speed Slow: 15%",
        "Attack Speed Slow: 60",
        "Duration: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Lycan_Wolf_Cripple.mp3\/revision\/latest?cb=20191216015830",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies \/ Allies",
        "Damage: Magical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Cripple",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 26.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.7,
    "attrAgility": 16.0
  },
  "description": "Shapeshifts into a ferocious beast. Part man and part wolf, Banehallow stands as the lone surviving heir to the noble House of Ambry. Not one to squander his curse, Banehallow Summon Wolves to scout ahead and aid him in the hunt. A blood-curdling Howl empowers his animal companions, sinking fang and claw to cripple his prey. But these abilities pale in comparison to the true manifestation of his lycanthropy. Under the full moon, he Shapeshifts and Bites his ally, transforming both of them into a lupine form, and takes on supernatural haste with Feral Impulse as they sprint unhindered across the battlefield to tear the throats from their enemies.  Carry Pusher Jungler Durable Escape ★★☆",
  "trivia": [
    "Lycanthropy refers to the ability of a human to transform into a wolf, or gain wolf-like characteristics. The term derives from the Greek word lykànthropos, which translates to \"wolf man\", or \"werewolf\" in English.",
    "The name Banehallow was derived from a Warcraft 3 hero unit called Dreadlord.",
    "The line Link▶️ \"Was I a wolf who dreamed he was a man?\" refers to a quote by Chinese philosopher Zhuangzi - \"Now I do not know whether I was then a man dreaming I was a butterfly, or whether I am now a butterfly, dreaming I am a man.\"",
    "The line Link▶️ \"Are you an air wolf?\", refers to the American famous television series \"Airwolf\", counting this response is said to Gyrocopter.",
    "The line Link▶️ \"Who fears the wolf should fear the forest.\" is a reference to Russian novelist Fyodor Mikhailovich Dostoyevsky quote from 'The Gambler' : 'Who fears the wolf should never enter the forest'",
    "The line Link▶️ \"I thought you were Team Yakov!\" is a reference (and pun) to Jacob Black from the Twilight series, who is a werewolf. Fans divide themselves into \"teams\" by who their most preferred main character is, one of such teams is \"Team Jacob\".",
    "The line Link▶️ \"One eye is better than none.\" indicates that Lycan was supposed to have only one functioning eye, with the other one probably covered by an eye patch, as seen in one of the concept arts below."
  ],
  "history": "Banehallow was noble-born to the house of Ambry, the greatest of the landed castes in the old kingdom of Slom. Before the Fall, as the King's wants grew strange, and his court grew crowded with sorcerers and charlatans, the house of Ambry was the first to rise against the avarice of the throne. No longer willing to pay homage and fealty, they instead sent six-thousand swords into the capital, where they were wiped out in the Massacre of the Apostates. And then came the teeth behind the old truth: When you strike a king's neck, you had better take his head. Enraged by the betrayal, the king exterminated the vast Ambry bloodline, sparing only the lord of the house and his youngest son, Banehallow. Before all the royal court, with the disgraced lord chained to the ornate marble floor, the King bade his magicians transform the boy into a wolf so that he might tear out his own father's throat. \"Do this,\" the king said, \"so that Lord Ambry will understand the bite of betrayal.\" Powerful magic was invoked, and the child was transformed. But though his body was changed, his spirit remained intact, and instead of biting the exposed neck of his father, he attacked his handlers, tearing them to pieces. A dozen of the King's knights perished under the wolf's teeth before they managed to drive it off into the night. Lord Ambry laughed from his chains even as the King ran him through with a sword. Now the heir to the lost house of Ambry, Banehallow wanders the trail as the Lycan, part warrior, part wolf, in search of justice for all that he lost.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Howl Reduces Total Attack Damage",
        "talent_left": "+2 Wolves Summoned"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+6s Shapeshift Duration",
        "talent_left": "+25% Feral Impulse Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+200 Summon Wolves Health",
        "talent_left": "-15s Shapeshift Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+20% Howl Attack Damage Reduction",
        "talent_left": "+10 Summon Wolves Damage"
      }
    ],
    "notes": [
      "The attack damage and health talents affect the regular Lycan Wolves and the Lane Wolves. Grants flat bonus attack damage.",
      "Grants flat bonus attack damage."
    ]
  }
}