{"abilities":[{"spell":"Creates a cone of ethereal energy that strikes multiple enemy units.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Can hit units up to 1000 range away (starting radius + distance + end radius).","The complete area is shaped like a cone in front of Shadow Shaman.","The area starts in front of Shadow Shaman, and not at the primary target's position.","Targets within the cone area are not chosen randomly. It chooses the closest valid targets to the primary target within the cone.","All strikes together can deal up to 140\/600\/1300\/2240 ( 540\/1800\/3300\/5040) damage (before reductions)."],"mana":"100\/120\/140\/160","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"14\/12\/10\/8","name":"Ether Shock","description":["Cast Animation: 0.3+1.23","Cast Range: 600 ( 725)","Starting Radius: 200","Max Distance: 500","End Radius: 300","Number of Targets: 1\/3\/5\/7","Damage: 140\/200\/260\/320 ( 540\/600\/660\/720)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Transforms an enemy unit into a harmless creature, disabling their attacks and abilities.","effects":["Ability Target Unit","Affects Enemies","Damage Instant Kill"],"notes":["Applies a hex on the target, setting its base movement speed to 100, silencing, muting, and disarming it. However the target's movement speed is still affected by movement speed bonuses from items and abilities.","Since hex changes base movement speed and does not actually apply a slow, all speed effects are calculated using the 100 base speed.","Hex instantly destroys illusions.","Shadow Shaman's hex transforms the target into a chicken."],"mana":"70\/110\/150\/190","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"13 ( 8)","name":"Hex","description":["Cast Animation: 0+1.13","Cast Range: 500 ( 625)","Set Movement Speed: 100","Duration: 1.25\/2\/2.75\/3.5"],"hot_key":"W","legacy_key":"D"},{"spell":"Magically binds an enemy unit so that it cannot move or attack, while dealing damage over time.","effects":["Ability Target Unit \/ Channeled","Affects Enemies","Damage Magical"],"notes":["Shackles stuns the target as long as it is channeled.","Provides True Sight over the target, but only when the target was not invisible or within a fade time upon cast.","If the target turns invulnerable or hidden, the channeling stops instantly.","Deals damage in 0.1 second intervals, starting immediately as the channeling begins, resulting in 28\/35\/43\/50 ( 53\/60\/68\/75) damage instances. The damage per tick is based on the total damage divided by its duration and then divided by 10. The talent bonus is ignored. This results in 2.182\/4.571\/6.118\/7.2 damage per tick (21.82\/45.71\/61.18\/72 damage per second). Therefore, the final damage dealt (before reductions) is 61.09\/160\/263.06\/360 ( 115.64\/274.29\/416\/540)."],"mana":"140\/150\/160\/170","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"16\/14\/12\/10","name":"Shackles","description":["Cast Animation: 0.3+0","Cast Range: 400 ( 525)","Max Channel Time: 2.75\/3.5\/4.25\/5 ( 5.25\/6\/6.75\/7.5)","Total Damage: 60\/160\/260\/360 ( 116\/274\/416\/540)"],"hot_key":"E","legacy_key":"E"},{"spell":"Summons 10 Serpent Wards to attack enemy units and structures. The Wards are immune to magic.","effects":["Ability Target Point","Damage Physical ( Instant Attack)"],"notes":["Places a Serpent Ward on every 36th degree of a 150 radius circle, resulting in 10 wards forming a ring The wards form a perfect barrier, so that enemies inside cannot move out, unless they have phased movement. Destroying one ward is enough to allow units to walk in and out of the ring of wards. The wards' facing angle is set equal to Shadow Shaman's facing angle upon cast.","Serpent Wards automatically attack enemies within their attack range, using default auto-attack rules. It is possible to manually give the wards an attack target by just right-clicking an enemy in range. It is also possible to stop the wards from attacking by ordering them to stop (only works when the auto-attack option is turned off).","Serpent Wards have a lower target priority than other units and heroes, so they are attacked by towers and creeps last.","The serpent wards attack damage is not reduced by Damage Block.","Aghanim's Scepter causes the wards to perform instant attacks on one enemy whenever they launch an attack projectile. This means the extra projectile is released at the same time together with the main attack. Therefore, it does not matter whether the primary attack misses or not, the extra projectile is still released. The extra projectile travels at the same speed as the primary projectile, and can be disjointed like regular attacks. Unlike most other instant attacks, the ones from the Serpent Wards do not proc any on-hit effects. However, they are affected by armor type and evasion. The extra attack does not target wards, invisible units, attack immune units, or units inside the Fog of War. They do target buildings. The secondary target is chosen randomly. There are no priorities."],"mana":"200\/350\/600","elements":["Pierces spell immunity."],"cooldown":"120","name":"Mass Serpent Ward","description":["Cast Animation: 0.3+0.97","Cast Range: 550 ( 675)","Spawn Radius: 150","Number of Wards: 10","Attacks to Destroy: 2 ( 3)","Split Shot Search Radius: 0 ( 875)","Bonus Attack Targets: 0 ( 1)","Duration: 45"],"hot_key":"R","legacy_key":"W"}],"bio":"Born in the Bleeding Hills, Rhasta was just a starving youngling when picked up by a travelling con-man. For two pins of copper, the old con-man would tell your fortune. For three, he’d castrate your pig, for five, he’d circumcise your sons. For a good meal, he’d don his shaman garb, read from his ancient books, and lay a curse upon your enemies. His strange new youngling, part hill troll, part…something else, worked as assistant and lent an air of the exotic to the con-man’s trade. Always one step ahead of cheated customers, one town ahead of a pursuing patronage, the two trekked across the blighted lands until one day the con-man realized that the little youngling could actually do what he only pretended at. His ward had a gift—a gift that customers valued. And so the youngling Rhasta was thrust before the crowds, and the trade-name Shadow Shaman was born. The two continued from town to town, conjuring for money as Shadow Shaman’s reputation grew. Eventually, the pair’s duplicitous past caught up with them, and they were ambushed by a mob of swindled ex-clients. The con-man was slain, and for the first time, Rhasta used his powers for darkness, massacring the attackers. He buried his beloved master, and now uses his powers to destroy any who would seek to do him harm.","talentsTips":["The cast range talent does not affect the max distance of Ether Shock.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["The name Rhasta is based on the Rastafarians, a follower of a religious movement in Jamaica known as Rastafari. In DotA, his hero model and dialogue had a strong Jamaican influence and style. But in Dota 2, his theme and style have undertaken a more Native American influence, mostly evident in his attire and accent.","Rhasta is also a Persian name and word that means \"truth\" or \"path\"."],"talents":["+50 Wards Attack Damage:+400 Ether Shock Damage","+1 Wards Max HP:+2.5s Shackles Duration","-5s Hex Cooldown:+125 Cast Range","+20% XP Gain:+200 Health"],"desc":"Rhasta, the Shadow Shaman, is a ranged intelligence hero mostly played as a pusher and disabler, wielding abilities that make pushing lanes more efficient. When his abilities are used in intelligent combos, he has one of the longest disables in game. He is also capable of disabling multiple enemy heroes, allowing him to initiate encounters as well. Though very supportive in nature, until the late game Rhasta is capable of killing lone enemy heroes with the use of his entire skill set; meaning he is more difficult to gank than most other supports. Playing Rhasta well requires good knowledge of target priority and timing; and some minor micromanagement. His peak is mid-game, but he can continue to wreak havoc on enemies all throughout the match."}