{"abilities":[{"spell":"Создаёт конус бесплотной энергии, который бьёт по нескольким вражеским существам.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Может поразить существ на расстоянии до 1000 единиц (складывается из начального радиуса, дальности применения и конечного радиуса).","Область поражения имеет форму конуса, который расходится от Shadow Shaman.","Начальный радиус начинается от самого Shadow Shaman, а не от позиции основной цели.","Способность выбирает цели не случайно, а исходя от близости к основной цели и их доступности в зоне конуса.","Все молнии наносят до 140\/600\/1300\/2240 ( 540\/1800\/3300\/5040) единиц урона (до уменьшений)."],"mana":"100\/120\/140\/160","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/12\/10\/8","name":"Ether Shock","description":["Анимация применения: 0,3+1,23","Дальность применения: 600 ( 725)","Начальный радиус: 200","Максимальная дистанция: 500","Конечный радиус: 300","Число целей: 1\/3\/5\/7","Урон: 140\/200\/260\/320 ( 540\/600\/660\/720)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Превращает врага в безобидную зверюшку, лишая его возможности атаковать или применять способности.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Мгновенное убийство"],"notes":["Применяет к цели проклятие, приравнивая её базовую скорость передвижения к 100, обезмолвивая, заглушая и обезоруживая её. При этом на скорость передвижения цели все еще влияют бонусы от предметов и способностей.","Поскольку проклятие меняет базовую скорость передвижения, а не применяет к цели замедление, то все эффекты, влияющие на скорость, рассчитывают бонус, исходя из начальной скорости в 100 единиц.","Мгновенно уничтожает иллюзии.","Проклятие Shadow Shaman превращает цель в курицу."],"mana":"70\/110\/150\/190","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"13 ( 8)","name":"Hex","description":["Анимация применения: 0+1,13","Дальность применения: 500 ( 625)","Скорость движения цели: 100","Длительность: 1.25\/2\/2.75\/3.5"],"hot_key":"W","legacy_key":"D"},{"spell":"Связывает врага магическими путами, не позволяющими передвигаться или атаковать, а также наносящими периодический урон.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов","Урон Магический"],"notes":["Оглушение действует до тех пор, пока способность применяется.","Дает эффект True Sight на цель, если на момент применения она не была невидима или не уходила в невидимость.","Если цель получила неуязвимость или её спрятали, то произнесение мгновенно завершает.","Наносит урон с интервалом в 0,1 секунды сразу после начала применения, срабатывая 28\/35\/43\/50 ( 53\/60\/68\/75) раз. Урон за тик рассчитывается как максимальный урон, поделенный на продолжительность способности, и делённый на 10. Бонус от таланта не учитывается. В результате получается 2,182\/4,571\/6,118\/7,2 урона за тик (21,82\/45,71\/61,18\/72 урона в секунду). В итоге, всего способность нанесет (до уменьшений): 61,09\/160\/263,06\/360 ( 115,64\/274,29\/416\/540).","В отличии от других направленных заклинаний длительность обзора для заклинателя равна длительность произнесения (даже если способность прервали), а не 2 секундам."],"mana":"140\/150\/160\/170","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/14\/12\/10","name":"Shackles","description":["Анимация применения: 0,3+0","Дальность применения: 400 ( 525)","Макс. длительность: 2.75\/3.5\/4.25\/5 ( 5,25\/6\/6,75\/7,5)","Общий урон: 60\/160\/260\/360 ( 116\/274\/416\/540)"],"hot_key":"E","legacy_key":"E"},{"spell":"Призывает 10 невосприимчивых к магии змеиных тотемов, атакующих врагов и постройки.","effects":["Способность Направленная на точку","Урон Физический ( Мгновенная атака)"],"notes":["Размещает Serpent Ward каждые 36 градусов круга радиусом в 150 единиц, вызывая 10 вардов. Варды создают непроходимый барьер, поэтому враги не могут из него выбраться без наличия сквозного прохождения. Для выхода или входа в круг достаточно разрушить один вард. Варды смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности.","Варды автоматически атакуют врагов в радиусе дальности атаки, используя стандартные правила автоатаки. Можно задать цель для атаки, используя принудительную атаку правой кнопкой мыши по цели в радиусе дальности атаки. Также можно отдать приказ вардам на прекращение атаки (работает лишь при выключенной опции автоатаки в настройках).","Приоритет атаки тотемов ниже, чем у других существ и героев, поэтому башни и крипы будут их бить в последнюю очередь.","Урон от Serpent Ward не снижается блокировкой урона.","Aghanim's Scepter позволяет вардам совершать мгновенные атаки по одному врагу при запуске снаряда. То есть дополнительный снаряд выпускается одновременно со снарядом основной атаки. При этом не важно, промахнулась ли атака по главной цели или нет, дополнительный снаряд все равно будет запущен. Снаряд от дополнительной атаки летит с той же скоростью, что и снаряд от основной атаки, и его можно избежать так же, как и обычную атаку. В отличии от других мгновенных атак, атаки Serpent Ward не активируют эффекты, срабатывающие при атаке. При этом на атаки влияют разные типы брони и уклонение. Не выбирает дополнительной целью варды, невидимых существ, существ с иммунитетом к атакам или в Тумане войны. Выбирает целью строения. Вторичная цель выбирается случайно без какого-либо приоритета."],"mana":"200\/350\/600","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"120","name":"Mass Serpent Ward","description":["Анимация применения: 0,3+0,97","Дальность применения: 550 ( 675)","Радиус появления: 150","Число вардов: 10","Атак для уничтожения: 2 ( 3)","Радиус разделенного урона: 0 ( 875)","Доп. целей для атаки: 0 ( 1)","Длительность действия: 45"],"hot_key":"R","legacy_key":"W"}],"bio":"Рождённый на Кровоточащих холмах, юный Раста жил впроголодь, пока его не подобрал странствующий шарлатан. За два медяка старый пройдоха мог предсказать судьбу. За три — кастрировать свинью. За пять — совершить обрезание. За хорошие харчи он мог облачиться в шкуру шамана и зачитать проклятия из древних книг, насылая их на ваших врагов. А чудной юнец, наполовину холмовой тролль, наполовину… что-то ещё, работал помощником и придавал налёт экзотики услугам старого ловкача. Всегда на шаг впереди облапошенных покупателей, на один город впереди взбешённых преследователей, эти двое путешествовали по гиблым землям до тех пор, пока шарлатан не понял, что его юный напарник на самом деле способен на то, чем сам старик только дурил зрителей. Его подопечный имел дар, который очень ценили клиенты. И вот юный Раста стал развлекать толпу, и прозвали его тогда шаманом теней. Напарники продолжили странствовать по городам, колдуя за деньги, а молва о кудеснике всё росла и росла. В конце концов странников настигло шарлатанское прошлое: их подкараулила толпа обманутых покупателей. Шарлатана убили, и впервые в жизни Раста использовал свою силу во зло, перебив всех нападавших. Он похоронил своего любимого учителя и теперь использует свою силу против любого, кто посягнёт на его жизнь.","talentsTips":["Талант на дальность применения не влияет на максимальную дальность Ether Shock.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Имя Раста основано на Растафари - последователе религиозного движения под названием Растафарианство в Ямайке. В DotA, модель Расты и его диалоги имели выраженную Ямайскую тематику и стиль. Но в Dota 2, его стилистика сменились на Ближневосточную, что в первую очередь отразилось на его одежде и акценте.","Имя Раста также является Персидским именем и носит значение \"Истина\" или \"Путь\"."],"talents":["+50 к урону Wards:+400 к урону от Ether Shock","+1 атака на уничтожение варда Serpent Ward:+2,5 сек. действия Shackles","-5 сек. к перезарядке Hex:+125 к дальности способностей","+10% к урону от способностей:+200 к здоровью"],"desc":"Shadow Shaman — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Благодаря своим способностям, герой может легко обездвиживать противников и наносить немалое количество урона. Способностью Ether Shock герой бьёт молнией по нескольким противникам, нанося им урон. Способностью Hex герой проклинает врага, превращая его в курицу, при этом у противника снижается скорость передвижения и он становится полностью недееспособным. Shackles дает возможность герою удерживать противника сетью, полностью его обездвиживая и нанося периодический урон. Способностью Mass Serpent Ward герой вызывает 10 змеек-стражей, которые атакуют противников и строения."}