{"abilities":[{"spell":"Создает конус бесплотной энергии, который бьет по нескольким вражеским юнитам.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Может ударить по существам в расстоянии до 1000 единиц (складывается из начального радиуса, дальности применения и конечного радиуса).","Область поражения имеет форму конуса, который расходится от Shadow Shaman.","Начальный радиус считается от самого Shadow Shaman, а не от позиции первичной цели.","Цели в области поражения поражаются не случайно, а выбираются ближайшие подходящие цели от первичной в зоне конуса.","Все молнии могут нанести до 140\/600\/1300\/2240 ( 540\/1800\/3300\/5040) единиц урона (до учета сопротивления)."],"mana":"100\/120\/140\/160","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/12\/10\/8","name":"Ether Shock","description":["Анимация применения: 0,3+1,23","Дальность применения: 600 ( 725)","Начальный радиус: 200","Максимальная дистанция: 500","Конечный радиус: 300","Количество целей: 1\/3\/5\/7","Урон: 140\/200\/260\/320 ( 540\/600\/660\/720)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Превращает врага в безобидную зверюшку, блокируя его атаки и способности.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Применение проклятия на цель делает значение её базовой скорости передвижения в 100 единиц, обезмолвивая, заглушая и обезоруживая её. При этом на цель продолжают действовать бонусы к передвижению от предметов и способностей.","Проклятие меняет базовую скорость передвижения, а не применяет к цели замедление, поэтому все эффекты, влияющие на скорость, рассчитывают бонус, исходя из начальной скорости в 100 единиц.","Мгновенно уничтожает иллюзии.","Проклятие от Shadow Shaman превращает цель в курицу."],"mana":"70\/110\/150\/190","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"13 ( 8)","name":"Hex","description":["Анимация применения: 0+1,13","Дальность применения: 500 ( 625)","Скорость движения цели: 100","Длительность: 1.25\/2\/2.75\/3.5"],"hot_key":"W","legacy_key":"D"},{"spell":"Связывает врага магическими путами, не позволяющими передвигаться или атаковать, а также наносящими периодический урон.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов","Урон Магический"],"notes":["Оглушение действует до тех пор, пока способность применяется.","Дает эффект True Sight на цель, пока способность не закончит своё действие.","Наносит урон с промежутком в 0,1 секунду с начала применения способности, нанося 28\/35\/43\/50 ( 53\/60\/68\/75) урона в секунду. Урон за тик рассчитывается как максимальный урон, поделенный на продолжительность способности, и делённый на 10. Увеличение длительности от таланта не учитывается при расчете. В результате получается 2,182\/4,571\/6,118\/7,2 урона за тик (21,82\/45,71\/61,18\/72 урона в секунду). В итоге, всего способность нанесет (до учета сопротивления): 61,09\/160\/263,06\/360 ( 115,64\/274,29\/416\/540)."],"mana":"140\/150\/160\/170","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/14\/12\/10","name":"Shackles","description":["Анимация применения: 0,3+0","Дальность применения: 400 ( 525)","Макс. длительность связывания: 2.75\/3.5\/4.25\/5 ( 5,25\/6\/6,75\/7,5)","Макс. урон: 60\/160\/260\/360 ( 116\/274\/416\/540)"],"hot_key":"E","legacy_key":"E"},{"spell":"Призывает 10 невосприимчивых к магии вардов, атакующих врагов и сооружения. Каждый вард уничтожается с двух ударов.","effects":["Способность Направленная на точку","Урон Физический"],"notes":["Размещает Serpent Ward каждые 36 градусов круга радиусом в 150 единиц, вызывая 10 вардов. Варды создают непроходимый барьер, поэтому враги не могут из него выбраться без наличия сквозного прохождения. Для выхода или входа в круг достаточно разрушить один вард. Варды смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности.","Serpent Wards автоматически атакуют врагов в радиусе дальности атаки, используя стандартные настройки для автоатаки. Можно дать цель для атаки вардам, используя принудительную атаку правой кнопкой мыши по цели в радиусе дальности атаки. Также можно отдать приказ вардам на прекращение атаки (работает лишь при выключенной опции автоатаки в настройках).","У Serpent Wards снижен приоритет в качестве цели для атаки для остальных существ и героев, поэтому башни и крипы будут их бить в последнюю очередь.","Урон от Serpent Wards не снижается блокировкой урона.","Aghanim's Scepter дает вардам дополнительную цель для атаки по одному из врагов при запуске снаряда от атаки. Дополнительный снаряд от атаки срабатывает в тот же момент, что и снаряд для основной цель. При этом не важно, промахнулась ли атака по первичной цели или нет, дополнительная атака все равно произойдет. Снаряд от дополнительной атаки летит с той же скоростью, что и снаряд от основной атаки, и от него можно увернутся так же, как и от обычной атаки. В отличии от других источников атак, атаки от Serpent Wards не дают никаких отрицательных эффектов. При этом на атаки работают разные типы брони и уклонение. В качестве дополнительных целей для атаки не считаются варды, невидимые существа или существа, находящиеся в Тумане войны, но строения за цели считаются. Вторичная цель выбирается случайно, для вардов нет приоритетов для атаки."],"mana":"200\/350\/600","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"120","name":"Mass Serpent Ward","description":["Анимация применения: 0,3+0,97","Дальность применения: 550 ( 675)","Радиус появления: 150","Количество Serpent Ward: 10","Ударов для уничтожения: 2 ( 3)","Радиус разделенного урона: 0 ( 875)","Дополнительных целей для атаки: 0 ( 1)","Длительность действия: 45"],"hot_key":"R","legacy_key":"W"}],"bio":"Рождённый на Кровоточащих холмах, юный Раста жил впроголодь, пока его не подобрал странствующий шарлатан. За два медяка старый пройдоха мог предсказать судьбу. За три — кастрировать свинью. За пять — совершить обрезание. За хорошие харчи он мог облачиться в шкуру шамана и зачитать проклятия из древних книг, насылая их на ваших врагов. А чудной юнец, наполовину холмовой тролль, наполовину… что-то ещё, работал помощником и придавал налёт экзотики услугам старого ловкача. Всегда на шаг впереди облапошенных покупателей, на один город впереди взбешённых преследователей, эти двое путешествовали по гиблым землям до тех пор, пока шарлатан не понял, что его юный напарник на самом деле способен на то, чем сам старик только дурил зрителей. Его подопечный имел дар, который очень ценили клиенты. И вот юный Раста стал развлекать толпу, и прозвали его тогда шаманом теней. Напарники продолжили странствовать по городам, колдуя за деньги, а молва о кудеснике всё росла и росла. В конце концов странников настигло шарлатанское прошлое: их подкараулила толпа обманутых покупателей. Шарлатана убили, и впервые в жизни Раста использовал свою силу во зло, перебив всех нападавших. Он похоронил своего любимого учителя и теперь использует свою силу против любого, кто посягнёт на его жизнь.","talentsTips":["Талант на дальность применения не влияет на максимальную дальность Ether Shock.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Имя Раста основано на Растафари - последователе религиозного движения под названием Растафарианство в Ямайке. В DotA, модель Расты и его диалоги имели выраженную Ямайскую тематику и стиль. Но в Dota 2, его стилистика сменились на Ближневосточную, что в первую очередь отразилось на его одежде и акценте.","Имя Раста также является Персидским именем и носит значение \"Истина\" или \"Путь\"."],"talents":["+50 к урону Wards:+400 к урону от Ether Shock","+1 атака на уничтожение варда Serpent Ward:+2,5 сек. действия Shackles","-5 сек. к перезарядке Hex:+125 к дальности способностей","+10% к урону от способностей:+200 к здоровью"],"desc":"Shadow Shaman — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Благодаря своим способностям, герой может легко обездвиживать противников и наносить немалое количество урона. Способностью Ether Shock герой бьёт молнией по нескольким противникам, нанося им урон. Способностью Hex герой проклинает врага, превращая его в курицу, при этом у противника снижается скорость передвижения и он становится полностью недееспособным. Shackles дает возможность герою удерживать противника сетью, полностью его обездвиживая и нанося периодический урон. Способностью Mass Serpent Ward герой вызывает 10 змеек-стражей, которые атакуют противников и строения."}