{"abilities":[{"spell":"Launch into a maddened rage, becoming Spell Immune, 100% resistant to magic damage, and gaining increased movement speed.","effects":["Ability No Target","Affects Self"],"notes":["Interrupts Lifestealer's channeling spells upon cast.","Applies spell immunity for the duration and a basic dispel upon cast.","During Rage, Lifestealer cannot be affected by Ghost Scepter. The buff gets removed immediately."],"mana":"75","elements":[],"cooldown":"18","name":"Rage","description":["Cast Animation: 0+0","Movement Speed Bonus: 15%","Duration: 3\/4\/5\/6 ( 5\/6\/7\/8)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Lifestealer's attacks heal himself for a percentage of his target's max health. Gains passive attack speed.","effects":["Ability Passive","Affects Enemies \/ Self"],"notes":["On top of the skill's own lifesteal, Lifestealer additionally can lifesteal the damage dealt by this ability with other sources of lifesteal. It also can crit or cleave.","Does not affect Roshan.","Affects Spell Immune units.","The heal is independent of the damage.","Stacks additively with other sources of Lifesteal."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Feast","description":["Enemy Max Health as Lifesteal: 1.5%\/2.%\/2.5%\/3% ( 3%\/3.5%\/4%\/4.5%)","Attack Speed: 15\/30\/45\/60"],"hot_key":"W","legacy_key":"F"},{"spell":"Lifestealer rends an enemy unit, slowing the victim's movement speed and allowing all allies to regain health for a percentage of the damage they deal to that unit. All damage dealt will steal life, including damage from spells. The victim recovers movement speed over the duration.","effects":["Ability Target Unit","Affects Enemies \/ Allies"],"notes":["Slows for 70%\/70%\/60%\/50%\/30%\/10%\/10%\/10%, decreasing one step per second.","Casting an instantly killing ability on a unit affected by Open Wounds heals the caster based on the target's remaining health.","Does not heal enemies damaging their affected ally, or the affected unit through self-inflicted damage.","Stacks additively with other sources of lifesteal.","Does not heal from damage flagged as HP Removal."],"mana":"140","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"24\/20\/16\/12","name":"Open Wounds","description":["Cast Animation: 0.2+0.4","Cast Range: 200\/300\/400\/500","Lifesteal: 35% ( 85%)","Max Move Speed Slow: 70%","Slow Duration: 8"],"hot_key":"E","legacy_key":"W"},{"spell":"Lifestealer infests the body of a target unit, becoming undetectable inside. He can then explode from the host body, dealing damage to nearby enemies. If the infested unit is an enemy creep or a neutral creep, he can take control of the unit's ability to move and attack, and when consumed the creep will heal Lifestealer's health equal to the creep's current health. Does not work on enemy heroes.","effects":["Ability Target Unit","Affects Self","Damage Magical"],"notes":["Applies a basic dispel on Lifestealer and disjoints projectiles upon cast. This basic dispel removes buffs as well, and not only debuffs.","If cast on a creep, Lifestealer instantly gains control of it. Can be cast on allied heroes, but does not gain control of them. Treats creep-heroes as heroes.","Lifestealer is invulnerable and hidden during Infest.","Lifestealer still gains experience and gold during Infest.","During Infest, all three basic abilities of Lifestealer are turned inactive, and Infest is replaced by Consume. If the target is a creep, it also gains Consume.","During Infest, Lifestealer is periodically moved to the host's current position. This affects multiple things such as: When Infest ends (be it via Consume, or if the host dies), Lifestealer appears at the host's location. Every aura Lifestealer has (including Gem of True Sight and Radiance) affects units around the host. Effects which react on heroes' presence, such as Smoke of Deceit, Marksmanship or Blur, react on the host's presence. Relocate forces Lifestealer out of the infested unit, dealing area damage. Holy Persuasion gets dispelled as soon as Lifestealer casts Infest.","When on level 2 or higher, can be cast on and take control over ancient creeps.","Cannot be cast on Roshan, couriers, wards, buildings, enemy heroes and enemy creep-heroes.","The infested unit receives the Infest Effect modifier, which creates the visual effect above it, visible to allies only.","If an enemy takes control of the Infested creep with another dominating spell, Lifestealer loses control of the creep and it loses the Consume sub-ability. However, Consume can still be cast from Lifestealer himself.","Contrary to what the tooltip states, Lifestealer also takes control of allied creeps, and no longer heals for the unit's remaining health upon using Consume.","Infest cooldown begins once you leave the infested unit."],"mana":"50","elements":["Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"100\/75\/50 ( 25)","name":"Infest","description":["Cast Animation: 0.2+0","Cast Range: 150 ( 600)","Movement Speed: 15%\/20%\/25%","Health Bonus: 400\/800\/1200","Self Hp Max Regen: 3%\/4%\/5%"],"hot_key":"R","legacy_key":"T"},{"spell":"Lifestealer eats the host body from the inside out, exploding from within.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical \/ Instant Kill"],"notes":["Appears when Infest is cast and stays until Lifestealer gets out of the host. If Infesting a creep, the creep also gains the ability.","If Lifestealer is Infesting a creep, Consume instantly kills it. This is counted as a deny. If Lifestealer is Infesting a hero or creep-hero, it is not harmed or killed.","The damage is applied instantly in the area.","Consume's hotkeys change depending on whether Lifestealer is Infesting a hero or creep."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Does not pierce spell immunity."],"cooldown":"0","name":"Consume","description":["Cast Animation: 0+0","Damage Radius: 700","Damage: 150\/275\/400"],"hot_key":"R\/D","legacy_key":"T\/?"}],"bio":"In the dungeons of Devarque, a vengeful wizard lay in shackles, plotting his escape. He shared his cell with a gibbering creature known as N'aix, a thief cursed by the Vile Council with longevity, so that its life-sentence for theft and cozening might be as punishing as possible. Over the years, its chains had corroded, along with its sanity; N'aix retained no memory of its former life and no longer dreamt of escape. Seeing a perfect vessel for his plans, the wizard wove a spell of Infestation and cast his life-force into N'aix's body, intending to compel N'aix to sacrifice itself in a frenzy of violence while the mage returned to his body and crept away unnoticed. Instead, the wizard found his mind caught in a vortex of madness so powerful that it swept away his plans and shattered his will. Jarred to consciousness by the sudden infusion of fresh life, N'aix woke from its nightmare of madness and obeyed the disembodied voice that filled its skull, which had only the one thought: To escape. In that moment Lifestealer was born. The creature cast its mind into dungeon guards and soldiers, compelling them to open locks and cut down their companions, opening an unobstructed path to freedom while feeding on their lives. Lifestealer still wears the broken shackles as a warning that none may hold him, but on the inside remains a prisoner. Two minds inhabit the single form--a nameless creature of malevolent cunning, and the Master whose voice he pretends to obey.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The evasion talent stacks multiplicatively with other sources of evasion."],"trivia":["Lifestealer's fun\/alternate name in DotA was Gollum, a significant character in the Lord of the Rings and Hobbit book series. The references to Gollum are kept up in Dota 2: Just like written in Lifestealer's lore, Lifestealer is no longer the former self he was, but rather a possessed body. Gollum has a similar story. Once being a Hobbit, his soul got corrupted by the ring, turning into the Gollum he is now. Both Lifestealer and Gollum sometimes speak from themselves in plural form (\"we\", instead of \"I\"). They also talk to or about a \"master\". His rivalry line towards Tidehunter \"Tidehunter…I love a bit of raw fish now and again.\" refers to Gollum's hate towards stewing - or the preparing in general - of fish. Gollum prefers his fish raw and \"wriggling\"."],"talents":["+2s Rage Duration:+1.5% Feast Lifesteal","+50% Open Wounds Lifesteal:20% Evasion","+25 Movement Speed:+30 Damage","+30 Attack Speed:+200 Health"],"desc":"N'aix, the Lifestealer, is a vicious melee strength hero whose abilities give him the power to bring down durable heroes quickly, while sustaining his health by leeching the very life of his enemies."}