{
  "abilities": [
    {
      "spell": "Погружаясь в безумную ярость, герой становится невосприимчивым к магии, получая полное сопротивление магическому урону, а его скорость атаки увеличивается.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании прерывает произносимые способности Lifestealer.",
        "Применяет иммунитет к заклинаниям на длительность способности и базовое развеивание при использовании.",
        "Во время действия Lifestealer не получает эффект от Ghost Scepter. Бафф мгновенно снимается."
      ],
      "mana": "75",
      "elements": [],
      "cooldown": "16",
      "name": "Rage",
      "description": [
        "Анимация применения: 0+0",
        "Доп. скорость атаки: 50\/60\/70\/80",
        "Длительность: 3\/4\/5\/6 ( 5\/6\/7\/8)"
      ],
      "hot_key": "Q",
      "legacy_key": "R"
    },
    {
      "spell": "Каждая атака лечит вас на долю от максимального здоровья противника и наносит равноценное количество урона.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Себя",
        "Урон Физический"
      ],
      "notes": [
        "Не наносит урон и не активирует вампиризм при атаке вардов, строений, Рошана и союзных юнитов.",
        "Урон напрямую добавляется к урону Lifestealer. Он может быть уменьшен с помощью Static Link и увеличен с помощью Empower.",
        "Помимо вампиризма способности Lifestealer также получает за счет урона способности лечение от других источников вампиризма. Также этот урон может критическим или прорубающим.",
        "Лечение не связано с дополнительно наносимым уроном, то есть способность всегда лечит героя на полное значение вне зависимости от того, сколько урона Feast фактически нанесла цели."
      ],
      "mana": "0",
      "elements": [
        "Не может использоваться иллюзиями.",
        "Отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Feast",
      "description": [
        "Урон\/вампиризм от макс. здоровья врага: 1.75%\/2.5%\/3.25%\/4% ( 2.75%\/3.5%\/4.25%\/5%)"
      ],
      "hot_key": "W",
      "legacy_key": "F"
    },
    {
      "spell": "Герой разрывает плоть вражеского существа, замедляя его и позволяя своим союзникам питаться его жизненной силой, получая в качестве здоровья часть нанесённого врагу урона. Вампиризм действует на любой вид урона, в том числе и от способностей. Скорость передвижения жертвы постепенно восстанавливается.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Замедляет цель на 70%\/70%\/60%\/50%\/30%\/10%\/10%\/10%, уменьшаясь на каждую фазу раз в секунду.",
        "Применение мгновенно убивающей способности на цель Open Wounds вылечит заклинателя на значение, равное оставшемуся здоровью цели.",
        "Не лечит врагов при атаке их союзной цели или юнита, если он наносит себе урон.",
        "Складывается с другими источниками вампиризма.",
        "Не лечит при нанесении урона, помеченного как отнимающий здоровье."
      ],
      "mana": "140",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "24\/20\/16\/12",
      "name": "Open Wounds",
      "description": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 200\/300\/400\/500",
        "Вампиризм: 50% ( 100%)",
        "Макс. замедление скорости передвижения: 70%",
        "Длительность замедления: 8"
      ],
      "hot_key": "E",
      "legacy_key": "W"
    },
    {
      "spell": "Герой забирается в тело выбранного существа, становясь незаметным для противников. После этого он может вырваться из носителя, нанеся урон окружающим врагам. Находясь внутри вражеского или нейтрального крипа, герой может полностью управлять им или сожрать крипа изнутри, излечившись на количество его текущего здоровья. Не действует на вражеских героев.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Себя",
        "Урон Магический"
      ],
      "notes": [
        "При использовании применяет базовое развеивание к Lifestealer и позволяет избегать снаряды. Базовое развеивание убирает как баффы, так и дебаффы.",
        "Во время действия Infest Lifestealer неуязвим, спрятан и невосприимчив к магии.",
        "Во время действия Infest Lifestealer продолжает получать опыт и золото.",
        "Во время действия Infest все три способности Lifestealer становятся неактивными, Infest заменяется на Consume и добавляется Control.",
        "Во время действия Infest Lifestealer периодически перемещается к текущему положению носителя. Это затрагивает несколько вариантов: При завершении Infest (использование Consume или смерть носителя) Lifestealer появляется на месте носителя. Любая аура, имеющаяся у Lifestealer (включая Gem of True Sight и Radiance), действует на юнитов вокруг носителя. Эффекты, реагирующие на наличие героев, как, например Smoke of Deceit, Marksmanship или Blur, срабатывают от присутсвия носителя. Relocate вытаскивают Lifestealer из носителя, нанося урон по области. При использовании Lifestealer Infest Holy Persuasion развеивается.",
        "Можно использовать на союзных героев и крипов-героев, но без получения над ними контроля.",
        "На 2-м уровне способность можно применять на древних крипов и брать их под контроль.",
        "Нельзя применить на Рошана, курьеров, варды, строения, вражеских героев и крипов-героев.",
        "Носитель получает модификатор Infest Effect, создающий над ним визуальный эффект, видимый только союзникам.",
        "Получив Aghanim's Scepter, Lifestealer больше не может его выбросить или продать."
      ],
      "mana": "50",
      "elements": [
        "Не блокируется Linken's Sphere.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "100\/75\/50",
      "name": "Infest",
      "description": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 150"
      ],
      "hot_key": "R",
      "legacy_key": "T"
    },
    {
      "spell": "Герой берёт под свой контроль нервную систему тела, в котором находится. Подчинённый носитель имеет ту же скорость передвижения, что и владелец способности. Нельзя применять на героев.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзных существ \/ Вражеских существ"
      ],
      "notes": [
        "Способность появляется после применения Infest и остается до покидания носителя Lifestealer.",
        "Не может получить контроль над героями, крипами-героями и юнитами, уже находящимися под контролем Lifestealer. Всеми остальными носителями управлять можно.",
        "Если носителем нельзя управлять, то заклинание неактивно.",
        "При использовании выбор юнита сменяется с Lifestealer на носителя.",
        "Юнит также получает способность Consume, позволяющую Lifestealer поглотить юнита через его собственный интерфейс.",
        "Крипы, которыми Lifestealer управляет способостью Control, имеют ту же скорость передвижения, что и он. Способность исчезает при повторной смене владельца юнита.",
        "В отличии от других подчиняющих заклинаний, Control не применяет какое-либо развеивание к цели.",
        "При применении полностью восстанавливает ману юнита. Не влияет на здоровье носителя.",
        "Постоянно приравнивает скорость передвижения юнита к текущей скорости Lifestealer.",
        "Если носитель был союзником противоположной команды, то после получения контроля он продолжает им считаться. При этом, поскольку владельцем стал Lifestealer, то команда может атаковать юнита с помощью приказа. Юнита не будут атаковать автоматически.",
        "Control позволяет получить контроль над юнитом лишь единожды. То есть, если враги получили контроль с помощью другого подчиняющего заклинания, то Control не сможет вернуть его заклинателю."
      ],
      "mana": "0",
      "elements": [
        "Не провоцирует эффекты своим применением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Control",
      "description": [
        "Анимация применения: 0+0"
      ],
      "hot_key": "D",
      "legacy_key": "W"
    },
    {
      "spell": "Герой пожирает тело носителя изнутри, выбираясь наружу и нанося урон всем вокруг.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Способность появляется после использования Infest и остается до покидания носителя Lifestealer.",
        "Если носитель умирает до поглощения, то Lifestealer не получит здоровья. При этом урон по области применяется всегда.",
        "Если не была использована Control, то способность не убивает и не наносит урон союзному юниту (за исключением линейных крипов).",
        "Урон по области наносится мгновенно.",
        "Если над крипом не получен контроль, то классическая клавиша - это T. При использовании Control она меняется в зависимости от подконтрольного крипа."
      ],
      "mana": "0",
      "elements": [
        "Не провоцирует эффекты своим применением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Consume",
      "description": [
        "Анимация применения: 0+0",
        "Радиус урона: 700",
        "Урон: 150\/275\/400"
      ],
      "hot_key": "R",
      "legacy_key": "T\/?"
    },
    {
      "spell": "Герой проглатывает союзника, пряча его внутри себя. Проглоченное существо излечивается наравне с самим героем и наносит урон ближайшим врагам, когда вырывается наружу.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Для активации требуется Aghanim's Scepter.",
        "Можно использовать только на союзных героев, включая клонов Meepo и Tempest Double, но исключая иллюзии.",
        "В отличии от Infest Assimilate при использовании применяет сильное развеивание к цели и позволяет избегать снаряды.",
        "Во время действия Assimilate союзный герой неуязвим, спрятан и невосприимчив к магии.",
        "Во время действия Assimilate союзный герой продолжает получать опыт и золото.",
        "Герой может самостоятельно вылезти из Lifestealer, также нанося урон по области, с помощью любого приказа спустя 2 секунды после поглощения.",
        "Во время действия Infest союзный герой периодически перемещается к текущему положению Lifestealer. Это затрагивает несколько вариантов: При завершении Assimilate (использование Eject или смерть Lifestealer) герой появляется на месте Lifestealer. Любая аура, имеющаяся у героя (включая Gem of True Sight и Radiance), действует на юнитов вокруг Lifestealer. Relocate и Holy Persuasion вытаскивают героя из Lifestealer, нанося урон по области.",
        "Lifestealer получает бафф Assimilate Effect, создающий визуальный эффект над героем, видимый только союзникам."
      ],
      "mana": "50",
      "elements": [
        "Не провоцирует эффекты своим применением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "50",
      "name": "Assimilate",
      "description": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: 150",
        "Передаваемое лечение: 100%",
        "Длительность запрета действий: 2"
      ],
      "hot_key": "D",
      "legacy_key": "C"
    },
    {
      "spell": "Выплевывает проглоченного героя, нанося урон ближайшим противникам.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Заменяет Assimilate до покидания союзником Lifestealer.",
        "При использовании прерывает произносимые способности Lifestealer.",
        "Если Lifestealer умирает до выплевывания союзника, то урон по области все равно наносится.",
        "Не убивает и не наносит урон Lifestealer при выплевывании союзника.",
        "Урон наносится по области мгновенно."
      ],
      "mana": "0",
      "elements": [
        "Не провоцирует эффекты своим применением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Eject",
      "description": [
        "Анимация применения: 0+0",
        "Радиус урона: 700",
        "Урон: 300"
      ],
      "hot_key": "D",
      "legacy_key": "C"
    }
  ],
  "bio": "В подземной темнице Деварка томился закованный в кандалы мстительный маг, замышляющий побег. Его кинули в одну камеру с бесконечно бормочущим существом по имени Н'эйкс - когда-то он был вором, которому Черствым Советом была назначена мера пресечения в форме вечной жизни и пожизненного заключения одновременно, дабы неповадно было воровать и обманывать. За долгие годы заключения цепи заключенного проржавели насквозь - как и его мозг; Н'эйкс уже не помнил, кем он был раньше, что он тут делает, кто эти люди и почему он заперт в камере, и даже потерял желание выбраться из тюрьмы. В нем волшебник увидел идеального исполнителя своих планов - и, применив заклинание Заражения, внедрился в тело Н'эйкса, надеясь расшевелить страшное существо, в которое превратился вор, и заставить его пройтись по подземельям кровавым ураганом ярости и разрушения, пока сам маг тихо и мирно затерялся бы в суете и сбежал. Только вот сила встреченного им в Н'эйксе безумия была так велика, что воля мага сломилась, и разум его улетел куда-то далеко-далеко в океан сумасшествия. А вот Н'эйкс, которого растолкала от тысячелетий безумного бездействия внезапная инъекция новой жизни, пробудился и подчинился бесплотному голосу у себя в черепной коробке, который повторял лишь одно слово: «Сбежать». В тот момент родилось то, что теперь называют Lifestealer. Волны безумия, исходившие от существа, разнесли сознания стражников на маленькие кусочки, и те сами разорвали друг друга, открыв двери темницы. Lifestealer же, сбежав из подземелья, оставил проржавевшие кандалы на себе как напоминание о том, что никто больше не посмеет ограничить его свободу - но до сих пор он остается узником. В расхристанном и извращенном существе живут две личности - безымянный, хитрый, злобный вор и Хозяин, чьему голосу вор подчиняется. Или он притворяется?",
  "talentsTips": [
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
    "Талант на уклонение мультипликативно сочетается с другими источниками уклонения."
  ],
  "trivia": [
    "Любительское\/альтернативное имя Lifestealer было Голлум, что является отсылкой к персонажу из кинофильма \"Властелин Колец\". Одна из анимаций ходьбы у героя похожа на ходьбу Голлума из фильма."
  ],
  "talents": [
    "+2 сек. действия Rage:+1% к урону\/вампиризму от Feast",
    "+50% к вампиризму от Open Wounds:+20% к уклонению",
    "+30 к скорости передвижения:+30 к урону",
    "+20 к скорости атаки:+200 к здоровью"
  ],
  "tips": [
    "Lifestealer один из тех героев, которые могут с 1 уровня качаться в лесу, получая быстрее опыт и больше золота. Для похода в лес вам нужно будет купить Quelling Blade, Stout Shield и Tango и прокачать способность Feast. Если вы идете в лес, то старайтесь с помощью Quelling Blade прорубать деревья так, чтобы при проходе в образовавшийся проем вас мог атаковать только один крип. Если все сделано правильно, то вам даже не придется покупать предметы на лечение (этот способ также работает с Wraith King из-за наличия у последнего вампиризма) это позволит вам не брать Tango и сразу же идти в лес не мешая вашему союзнику на линии.",
    "Дополнительная скорость атаки от способности Rage будет сочетается с активной способностью Mask of Madness.",
    "Open Wounds будет давать эффект вампиризма вашим союзникам, если те атакуют цель, на которую применили эту способность. Эффект лечения от вампиризма будет даваться независимо от типа атаки вас или союзника.",
    "Если вы попали в битву на линии с крипами и противник оказался сильнее вас, вы можете использовать Infest в крипа: если во вражеского, вы тут же можете вылезти вылеченным от здоровья крипа, если же в союзного - противник будет возможно знать об этом, и специально бить этого крипа. Если носитель будет убит, вы вылезете и не получите лечение. Если вражеских героев больше или вы уверены что погибните если вылезете из вражеского крипа, то дождитесь пока этот крип дойдет ближе к вашей башне или пока ваши союзники подойдут на помощь. Также можно использовать эту способность для неожиданных нападений на врагов. Например, можно использовать на союзниках, обладающих невидимостью ( Bounty Hunter, Nyx Assassin). Найдя одинокую жертву, скорее всего, вдвоем убить ее будет не сложно."
  ],
  "desc": "Lifestealer — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Rage, дает невосприимчивость к заклинаниям и увеличивает скорость атаки. Пассивная способность, Feast, лечит за каждую атаку на долю от максимального здоровья противника и наносит равноценное количество урона. Вторая способность, Open Wounds, разрывает плоть вражеского юнита, замедляя его и позволяя своим союзникам питаться его жизненной силой, получая в качестве здоровья часть нанесенного врагу урона. Любой вид урона будет высасывать жизнь, включая урон от заклинаний. Скорость передвижения жертвы постепенно восстанавливается. Ультимативная способность, Infest, позволяет вселяется в тело выбранного юнита, становясь незаметным для окружающих. Lifestealer может мгновенно выбраться из него подспособностью Consume, нанести урон окружающим врагам и при этом излечиться на количество здоровья, равное текущему здоровью юнита. Если целью является вражеский или нейтральный крип, то Lifestealer получит возможность полностью управлять им подспособностью Control. Улучшение с Aghanim's Scepter добавляет способность, Assimilate, позволяющую Lifestealer проглотить союзника, чтобы спрятать его внутри себя. Проглоченный юнит лечится наравне с Lifestealer, и наносит урон ближайшим врагам, когда вырывается наружу. Lifestealer может выплюнуть проглоченного героя подспособностью, Eject. Проглоченный герой также может использовать эту подспособность."
}