{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/89\/Force_Staff_Force.mp3\/revision\/latest?cb=20191227195419",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Толкает цель со скорость в 800 единиц.",
        "Цель не обезвреживается во время толчка, поэтому она может использовать заклинания или предметы, атаковать и разворачиваться. То есть толчок не отменяет произносимые целью заклинания. При этом способность прерывает произносимые заклинания владельца, поскольку является направленным на цель заклинанием.",
        "То есть толчок не отменяет произносимые целью заклинания.",
        "При этом способность прерывает произносимые заклинания владельца, поскольку является направленным на цель заклинанием.",
        "Не перемещает существ под действием Black Hole, Chronosphere, Duel или Flaming Lasso.",
        "Не может вытолкнуть существ сквозь Kinetic Field или Arena Of Blood.",
        "Если на цель действует Soulbind, то ее нельзя толкнуть дальше, чем позволяет максимальное расстояние связи.",
        "Если цель привязана Pounce, то при применении привязка мгновенно разрывается. Но если цель получила привязку после применения, то способность не сможет толкнуть существо дальше, чем позволяет максимальное расстояние Pounce.",
        "Но если цель получила привязку после применения, то способность не сможет толкнуть существо дальше, чем позволяет максимальное расстояние Pounce.",
        "Не применяется к вардам или строениям. Можно применить к Homing Missile, чтобы уничтожить снаряд.",
        "Может затолкать существ на непроходимую территорию. Во время толчка деревья в радиусе 100 единиц вокруг цели разрушаются.",
        "Можно использовать на Рошана, но без какого-либо эффекта, поскольку у него иммунитет к принудительному движению."
      ],
      "mana": null,
      "abilityName": "Psychic Push",
      "cooldown": "24",
      "description": "Отталкивает выбранного врага от владельца на расстояние в .",
      "params": [
        "Дальность применения: 750",
        "Расстояние толчка: 400",
        "Длительность толчка: 0,5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Увеличивает как основной интеллект, так и добавленный другими предметами и способностями."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "нейтральных крипов",
  "name": "Psychic Headband",
  "description": "Эксперимент в тонком управлении телекинезом не удался, но эту вещицу всё ещё можно использовать для других целей.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+12% к интеллекту",
    "+100 к дальности применения"
  ],
  "tips": null
}