{"abilities":[{"spell":"Sven использует всю мощь своей магической рукавицы, нанося урон и оглушая врагов.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Перекрестие указателя должно выделять вражеского юнита.","Storm Hammer летит со скоростью 1000.","Невидимость или исчезновение цели не предотвращает действие эффекта по области вокруг цели.","Storm Hammer сначала наносит урон, затем применяет дебафф.","Снаряд дает летающий обзор в радиусе 225 единиц в момент полета.","Меч Sven во время применения испускает немного частиц, видимых всем.","При выборе таланта способность применяет базовое развеивание к всем задетым врагам."],"mana":"110\/120\/130\/140","elements":["Можно избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"19\/17\/15\/13 ( 13\/11\/9\/7)","name":"Storm Hammer","description":["Анимация применения: 0,3+0","Дальность применения: 600","Радиус: 255","Урон: 80\/160\/240\/320","Длительность оглушения: 1,25\/1,5\/1,75\/2 ( )"],"hot_key":"Q","legacy_key":"T"},{"spell":"Герой наносит удары невероятной силы, поражая всех врагов вокруг своей жертвы.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Прорубающий урон не может быть увеличен с помощью усиления урона заклинаний и он не дает лечения от вампиризма заклинаний.","Прорубающий урон уменьшается блокировкой урона.","Урон вторичным целям распространяется по конической площади перед героем.","Способность полностью совместима с другими источниками прорубания. Каждый источник действует независимо от другого.","Прорубание не действует при атаке вардов, строений или союзных юнитов. На варды и строения прорубание не действует.","Несмотря на визуальные эффекты, прорубающий урон наносится мгновенно по области."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Great Cleave","description":["Радиус: 150","Дальность: 650","Конечный радиус: 360","Урон прорубания: 30%\/50%\/70%\/90%"],"hot_key":"W","legacy_key":"C"},{"spell":"Боевой клич рыцаря поднимает боевой дух союзных героев, увеличивая их скорость передвижения и даруя им щит, защищающий от атак. Эффект закончится, если разбить щит.","effects":["Способность Ненаправленная","Действует на Союзников"],"notes":["При использовании прерывает произносимые способности Sven.","Warcry отрицает урон от атак (после большинства снижений), не позволяя сработать определенным эффектам, реагирующим на урон. Защищает только от урона от атак, вне зависимости от типа урона. То есть способность блокирует магические атаки, но не физический урон заклинаний. Блокирует урон до его снижения\/блокировки Aphotic Shield, Living Armor, Ghostship и аурой Borrowed Time.","Применяется только к союзным героям, включая клонов, иллюзии и крипов-героев."],"mana":"60","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"36\/32\/28\/24","name":"Warcry","description":["Анимация применения: 0+0","Радиус: 700","Доп. скорость: 5%\/10%\/15%\/20%","Здоровье щита: 60\/80\/100\/120","Здоровье щита за единицу силы: 1\/1.5\/2.5","Длительность: 10"],"hot_key":"E","legacy_key":"W"},{"spell":"Sven концентрирует свою неконтролируемую силу, получая бонус к урону на 0.5 секунд.","effects":["Способность Ненаправленная ( Аура)","Действует на Себя ( Союзных героев)"],"notes":["Увеличивает только базовый урон и урон, даваемый основным атрибутом Sven. Бонусный урон не увеличивается.","Периодически проверяет основной урон Sven и мгновенно адаптирует дополнительный.","Дополнительная сила дает Sven 200\/400\/600 единиц здоровья, 1\/2\/3 регенерации здоровья, 1%\/2%\/2% сопротивления магии и 10\/20\/30 урона от атаки. Талант увеличивает эти значения до 1000\/1200\/1400 единиц здоровья, 5\/6\/7 регенерации здоровья, 4%\/4.8%\/5.6% сопротивления магии и 50\/60\/70 урона от атаки. Урон, даваемый силой, также увеличивается до 810\/2420\/78 ( 4050\/7260\/182) из-за бонуса God's Strength, поскольку он основан на атрибуте героя.","Эффект, добавляемый Aghanim's Scepter - аура, действующая только при активированной God's Strength. Аура применяет бафф Gods Strength Child на союзных героев, задерживающийся на 0.5 секунды. Дополнительный урон основан на основном уроне затронутых союзников, а не на уроне Sven. Как и для Sven, способность периодически проверяет текущий урон союзников и мгновенно адаптирует дополнительный. Аура считает крипов-героев за героев и также действует на них."],"mana":"100\/150\/200","elements":["Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"110","name":"God's Strength","description":["Анимация применения: 0,3+0","Радиус ауры доп. урона: 0 ( 1200)","Доп. урон себе: 80\/120\/160%","Доп. сила себе: 10\/20\/30 ( 50\/60\/70)","Доп. урон союзникам: 0 ( 75%\/100%\/125%)","Длительность задержки ауры: 0.5","Длительность: 25"],"hot_key":"R","legacy_key":"R"}],"bio":"Внебрачный сын вигильского рыцаря и девы из рода бледных мерансов рос в руинах Тенистого взморья. Его отца казнили за нарушение Вигильского кодекса, а от матери отвернулись все родичи, и поэтому бастард считает, что честь следует искать не в обществе, но в себе. Он заботился о матери до самой её нескорой смерти, а затем отправился на службу вигильским рыцарям, не раскрывая своего происхождения. Тринадцать лет он учился в школе своего отца, постигая суровый закон, что презирал само его существование. И вот, в день присяги, он завладел Клинком изгоя, разбил Священный шлем и сжёг кодекс в праведном вигильском пламени. Он покинул цитадель, навсегда одинокий, строго следующий своим личным законам до последней руны. Да, он рыцарь… но рыцарь мятежный. Рыцарь, верный только себе.","talentsTips":["Талант на силу в общем даёт Sven: 160 здоровья, 0,8 регенерации здоровья, 0,64% сопротивления магии и 8 урона от атаки.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"trivia":["Имя Sven является отсылкой на датского актера Sven-Ole Thorsen. В ранних версиях DotA, Sven имел шутливое имя - Arnold Schwarzenegger.","Фразы \"It was only a flesh wound!\" (Да это же просто ранение!) и \"It was but a scratch!\" (Пустяки, простая царапина!) принадлежат герою Чёрный Рыцарь из комедийного фильма Монти Пайтон и Священный Грааль.","Фразы \"Blame the host\" и \"Bad host\" являются отсылкой на Warcraft III DotA, когда стабильность игры зависела от качества интернет-соединения на хосте.","Storm Hammer в ранней бете назывался Storm Bolt, а потом был переименован в Storm Hammer. Это также было оригинальным названием в DotA и отражено в одной из реплик при использовании, в которой он называет эту способность как \"Storm Bolt\"."],"talents":["+1,25 сек. оглушения от Storm Hammer:+40 силы от God's Strength","-6 сек. перезарядки Storm Hammer:+25% к вампиризму","Storm Hammer развеивает положительные эффекты:+30 к скорости передвижения","+3 маны в секунду:+8 к силе"],"desc":"Sven — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность Storm Hammer, Sven использует всю мощь своей магической рукавицы, нанося урон и оглушая врагов. Пассивная способность Great Cleave добавляет к атакам героя эффект прорубающего удара. Третья способность Warcry, боевой клич Sven воодушевляет союзников в бою, увеличивая их скорость передвижения и броню. Его особая способность God's Strength, Sven концентрирует свою неконтролируемую силу, получая бонус к физическому урону. Улучшение с Aghanim's Scepter дает ближайшим союзникам дополнительный урон от God's Strength в виде ауры."}