{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The mana talent increases maximum mana capacity, and keeps the current mana percentage.",
        "The strength talent effectively grants Outworld Destroyer 400 health and 2 health regeneration.",
        "The spell lifesteal talent stacks additively with other sources of spell lifesteal. Heals for 6% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions.",
        "Heals for 6% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "30% Spell Lifesteal",
          "talentRight": "+2% Arcane Orb Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0.15 Sanity's Eclipse Mana Difference Multiplier",
          "talentRight": "+20 Strength"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 Movement Speed",
          "talentRight": "+250 Mana"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 Attack Speed",
          "talentRight": "+200 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Outworld_Destroyer_Arcane_Orb_1.mp3\/revision\/latest?cb=20191216021430",
      "effects": [
        "Ability Target Unit \/ Autocast",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "The cast range of Arcane Orb is based on the attack range of the caster. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses. Both Autocast and manually casting it uses Outworld Destroyer's current attack range.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "Both Autocast and manually casting it uses Outworld Destroyer's current attack range.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "Deals its damage before the attack damage is applied, but still depends on the attack hitting the target.",
        "Checks Outworld Destroyer's mana pool upon projectile hit, so increasing or decreasing his mana pool while the projectile flies does affect its damage."
      ],
      "mana": "20% of current mana",
      "hotKey": "Q",
      "cooldown": "6\/4\/2\/0",
      "description": "Adds extra pure damage to Outworld Destroyer's attacks, based on his remaining mana pool.",
      "spellName": "Arcane Orb",
      "params": [
        "Cast Range: 450",
        "Current Mana as Damage: 16% (TagTalent 18%)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Harbinger's outworldly knowledge allows it to tap into the ebb and flow of all spiritual energy, infusing it into his being."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Outworld_Destroyer_Astral_Imprisonment.mp3\/revision\/latest?cb=20191216021424",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "Astral Imprisonment fully disables the target and turns it invulnerable and hidden for its duration. Cannot be cast on allies who have ☐ Disabled Help from Outworld Destroyer. ↓↓ Double-tapping automatically targets self.",
        "Cannot be cast on allies who have ☐ Disabled Help from Outworld Destroyer.",
        "↓↓ Double-tapping automatically targets self.",
        "Targeted allies are only put in the prison, without any of the other effects being applied on them.",
        "If the target was an enemy, they get damaged at the end of the prison's duration.",
        "If the target was an enemy hero (including illusions and clones, excluding creep-heroes), they also get a portion of their maximum mana stolen. Only reduces the target's maximum mana value. Their current mana value stays unchanged. This also goes for when the target gains their mana back. Only their max mana value is increased, the current mana value stays unchanged. This also goes for Outworld Destroyer. Only his max mana gets changed, with current mana staying the same. Outworld Destroyer gains a status buff that shows how much mana he currently acquired with Astral Imprisonment.",
        "Only reduces the target's maximum mana value. Their current mana value stays unchanged.",
        "This also goes for when the target gains their mana back. Only their max mana value is increased, the current mana value stays unchanged.",
        "This also goes for Outworld Destroyer. Only his max mana gets changed, with current mana staying the same.",
        "Outworld Destroyer gains a status buff that shows how much mana he currently acquired with Astral Imprisonment.",
        "The red ring expanding at the center of the visual effects indicates a fixed 4-second duration. The red ring is visible to allies only.",
        "With Aghanim's Scepter, the area damage is applied regardless of the target's alliance.",
        "With Aghanim's Shard, allows allied heroes to move during Astral Imprisonment. They are visible, but untargettable and can't perform any other actions",
        "They are visible, but untargettable and can't perform any other actions"
      ],
      "mana": "150",
      "hotKey": "W",
      "cooldown": "24\/20\/16\/12 (TagTalent 0)",
      "description": "Places a target unit into an astral prison. The hidden unit is invulnerable and disabled. When the astral prison implodes, it deals damage to the target and steals a percentage of their max mana.",
      "spellName": "Astral Imprisonment",
      "params": [
        "Cast Animation: 0.3+0.4",
        "Cast Range: 650",
        "Damage: 120\/200\/280\/360 (TagAghanim 260\/340\/420\/500)",
        "Max Mana Steal: 16%\/18%\/20%\/22% (TagTalent 21%\/23%\/25%\/27%)",
        "Imprison Duration: 1.75\/2.5\/3.25\/4",
        "Mana Steal Duration: 30\/40\/50\/60",
        "Damage Radius: 400",
        "Number of Charges: 2",
        "Charge Replenish Time: 12",
        "Ally Move Speed: 40%",
        "Grants charges to Astral Imprisonment, increases damage by 140 and applies the damage in an area.",
        "Grants an additional +5% mana capacity steal to Astral Imprisonment. Also allows allies to move at 60% movement speed during Astral Imprisonment."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Locked away in the pocket between this world and the Outworld, victims realize their infantile knowledge and mortality."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Outworld_Destroyer_Essence_Flux_2.mp3\/revision\/latest?cb=20191216021427",
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Restores mana after the ability is cast.",
        "Essence Flux does not proc on any item abilities.",
        "Essence Flux uses pseudo-random distribution.",
        "On average, restores 6%\/9%\/12%\/15% of caster's maximum mana per cast. Keeps Outworld Devourer on average at 30%\/45%\/60%\/75% of max mana, assuming no other source of mana restoration.",
        "Keeps Outworld Devourer on average at 30%\/45%\/60%\/75% of max mana, assuming no other source of mana restoration."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Passively grants you a chance to restore a percentage of your max mana each time you cast an ability.",
      "spellName": "Essence Flux",
      "params": [
        "Proc Chance: 30%",
        "Passive Max Mana Restored: 20%\/30%\/40%\/50%"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "The Outworld is awash in arcane energy, inclined to diffuse through any of Harbinger's rifts."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Outworld_Destroyer_Sanity%27s_Eclipse.mp3\/revision\/latest?cb=20191216021429",
      "effects": [
        "Ability Target Area",
        "Affects Enemy Heroes",
        "Damage Magical"
      ],
      "notes": [
        "The damage is based on the maximum mana pool of Outworld Destroyer and the hit enemies, not the current mana.",
        "The damage only affects enemy heroes and illusions. All other units are completely unaffected.",
        "Affects units under the effect of Astral Imprisonment as well, but not other invulnerable or hidden units."
      ],
      "mana": "200\/325\/450",
      "hotKey": "R",
      "cooldown": "160\/145\/130",
      "description": "Unleashes a psychic blast that deals to enemies based on the difference between your mana and the target's mana. Sanity's Eclipse can hit units trapped by Astral Imprisonment.",
      "spellName": "Sanity's Eclipse",
      "params": [
        "Cast Animation: 0.25+0.4",
        "Cast Range: 700",
        "Effect Radius: 400\/500\/600",
        "Base Damage: 200\/300\/400",
        "Mana Difference Damage Multiplier: 0.4 (TagTalent 0.55)"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "When an Outworld crystal ruptures, cataclysmic energies are released, and the reverberations of this power are felt interdimensionally."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 21.0,
    "attrIntelligence": 30.0,
    "attrIntelligenceInc": 4.2,
    "attrAgilityInc": 1.6,
    "attrAgility": 22.0
  },
  "description": "Harbinger, the Outworld Destroyer, is a ranged intelligence hero who qualifies as a carry, though unlike traditional carries, he excels against high-armor targets whilst being crippled by spell immunity. With Arcane Orb, his damage output is reliant on his intelligence attribute and the size of his mana pool, so he must focus more or less exclusively on items which augment them. Though he lacks somewhat in range and has no innate mobility skills, Arcane Orb deals Pure damage, meaning that if he gains an advantage in a match he deals constant, colossal damage which cannot be decreased or resisted except with total spell immunity and gets stronger with each hit. He enjoys more-or-less unlimited mana because of his Essence Flux. With Astral Imprisonment, Harbinger can render himself or an ally invulnerable for a short period of time, or disable the target enemy. His ultimate, Sanity's Eclipse, can instantly deal colossal area-of-effect damage against his enemies based on how much greater his mana pool is than theirs.",
  "history": "One of a lordly and magisterial race, Harbinger prowls the edge of the Void, sole surviving sentry of an outpost on the world at the rim of the abyss. From this jagged crystalline Outworld, forever on guard, he has gazed for eternities into the heavens, alert for any stirring in the bottomless night beyond the stars. Imprinted deep in the shining lattices of his intellect lies a resonant pattern akin to prophecy, a dark music implying that eventually some evil will wake out there, beyond the edges of creation, and turn its attention to our world. With his whole being focused on his vigil, Outworld Destroyer paid little attention to events closer in to the sun. But at last the clamor of the Ancients, and a sense of growing threat from within as well as without, sent him winging sunward to visit the plains of war. Harbinger's place in our own prophecies is unambiguous: he must be considered an omen of worse things to come. But his arrival in itself is bad enough.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "30% Spell Lifesteal",
      "talentRight": "+2% Arcane Orb Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0.15 Sanity's Eclipse Mana Difference Multiplier",
      "talentRight": "+20 Strength"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 Movement Speed",
      "talentRight": "+250 Mana"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 Attack Speed",
      "talentRight": "+200 Health"
    }
  ]
}