{"abilities":[{"effects":["Доп. скорость атаки: 490","Количество атак: 1","Замедление скорости передвижения: 100%","Длительность замедления: 0,8"],"notes":["Данный предмет работает только для героев ближнего боя.","При срабатывании повышает скорость атаки на 490 до следующей атаки. То есть срабатывание не дает гарантированную скорость атаки, поэтому её можно уменьшить с помощью сильного замедления атаки. У полученной скорости атаки нет установленной длительности. Она действует до совершения второй атаки.","Так как это просто увеличение скорости атаки, вторую атаку можно отменить, тем самым \"сохранить\" скорость атаки для следующего удара.","Вторая атака не мгновенна. Она использует стандартную анимацию и перезарядку удара.","Замедление скорости атаки и передвижения срабатывает во время обоих атак. Это означает что возможно замедлить сразу двух противников, просто переключившись с одной цели на другую во время второго удара.","Атаки сначала применяют дебафф, затем наносят урон.","Echo Strike также срабатывает при мгновенных атаках, применяя замедление. При этом дополнительная скорость атаки будет потрачена.","Замедление не складывается, но при повторном использовании возобновляет длительность действия.","Срабатывает при атаке чего угодно, в том числе атаке строений, вардов и союзников, но замедление действует только на союзников."],"elements":["Способность Пассивная","Действует на Врагов"],"description":"Позволяет героям ближнего боя совершить двойную атаку, которая на 0,8 сек. уменьшает скорость передвижения жертвы на 100%."}],"cost":"2650","description":"Обманчиво быстрый клинок, полный магии звука.","further":["Ogre_Axe","Oblivion_Staff"],"attrs":["Пассивная Echo Strike","Бонус +12 к силе +10 к интеллекту +10 к скорости атаки +0,75 к регенерации маны +12 к урону","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 240 здоровья, 1,2 регенерации здоровья, 0,96% сопротивления магии, 10 скорости атаки, 120 маны, 1,25 регенерации маны, 0,7% урона от способностей и 24 урона от атаки.","Для героев ловкости, даёт 240 здоровья, 1,2 регенерации здоровья, 0,96% сопротивления магии, 10 скорости атаки, 120 маны, 1,25 регенерации маны и 0,7% урона от способностей.","Для героев интеллекта, даёт 240 здоровья, 1,2 регенерации здоровья, 0,96% сопротивления магии, 10 скорости атаки, 120 маны, 1,25 регенерации маны, 0,7% урона от способностей и 22 урона от атаки."]}