{
  "abilities": [
    {
      "notes": [
        "The Stifling Dagger travels at a speed of 1200",
        "Upon projectile hit, the dagger causes Phantom Assassin to perform an instant attack on the target\n These instant attacks can proc any attack modifiers and on-hit effects normally (except <span image=\"images\/tidebringer.webp\">[picture:tidebringer]<\/span> Tidebringer)\n They have True Strike, but completely ignore disarms\n Cleave effects are based on the target's position, damaging a trapezoid area the opposite direction where the dagger came from\n Although the dagger may make it look like a ranged attack, the attack still counts as a <span image=\"images\/melee.png\">[picture:melee]<\/span> melee attack when its coming from Phantom Assassin\n This causes all abilities (and items) that use different values for melee and ranged heroes (e.g\n <span image=\"items\/skull_basher\/full.webp\">[picture:skull_basher]<\/span> Skull Basher), to use their melee effects and values, not ranged\n If the caster is a <span image=\"images\/ranged.png\">[picture:ranged]<\/span> ranged hero, the instant attacks do not use attack projectiles and are instant, but still count as ranged attacks",
        "Stifling Dagger's instant attack first reduces Phantom Assassin's total attack damage, and then the bonus damage is added as attack damage bonus on top of that after the total main damage is calculated\n The total attack damage includes all already existing attack damage changes, including conditional bonus sources (e.g\n Bash and Quell)\n This can be defined as ΣAtk × 25%\/40%\/55%\/70% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 45%\/60%\/75%\/90%) + 65 Therefore, attack damage based attack modifiers (e.g\n critical strike, lifesteal, cleave) include the 65 instant attack damage bonus as well\n Since the damage comes from a regular attack, it counts as attack damage and not as spell damage\n This means it is affected by damage block, unaffected by spell damage amplification and cannot spell lifesteal",
        "The projectile first applies the attack, then its own debuff",
        "The projectile has 450 range flying vision\n This vision lingers for 3.34 seconds at the target's location upon successfully hitting it",
        "Cannot be cast on <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Courier",
        "TALENT NOTES Stifling Dagger now launches 2 additional projectiles towards random visible valid targets within the range\n The search range is based on the cast range and the buffer range, resulting in a search range of 850\/1050\/1250\/1450\n Cannot target the primary target with the additional projectiles, so when no other targets are nearby, nothing happens\n The secondary targets are chosen randomly within the area\n There are no priorities\n The projectiles cannot choose both the same target\n Since the additional projectiles use the ability's cast range, cast range increasing effects increase their range as well"
      ],
      "item_behaviour": [],
      "description": "Throws a dagger slowing the enemy unit's movement speed, dealing 65+25%\/40%\/55%\/70% of Phantom Assassin's attack damage as physical damage and applying attack effects from items and abilities.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.47",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 550\/750\/950\/1150",
        "Number of Targets: 1 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3)",
        "Instant Attack Damage Bonus: 65",
        "Instant Attack Damage: 25%\/40%\/55%\/70% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 45%\/60%\/75%\/90%)",
        "Move Speed Slow: 50%",
        "Slow Duration: 2.2\/2.8\/3.4\/4",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Secondary Target Range Buffer: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Phantom_Assassin_Stifling_Dagger_1.mp3\/revision\/latest?cb=20191216021615",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Instant Attack"
      ],
      "mana": "6 (TagTalent 4)",
      "aghanim": null,
      "name": "Stifling Dagger",
      "cooldown": "30",
      "legacy_key": "D",
      "story": "The first skill learned by the Sisters of the Veil often signals an incoming hit."
    },
    {
      "notes": [
        "Phantom Strike can be cast on allied units, without gaining the Phantom Strike Buff",
        "Moves Phantom Assassin next to the target, towards the position she was upon cast\n <span image=\"images\/counterspell.webp\">[picture:counterspell]<\/span> Counterspell does not reflect Phantom Strike\n However, it is still blocked",
        "Does not disjoint projectiles upon teleporting",
        "Phantom Assassin is ordered to attack the target if it is an enemy, automatically canceling the cast backswing",
        "Stacks additively with other sources of lifesteal",
        "Cannot be cast on invulnerable and hidden units, buildings, <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers and wards"
      ],
      "item_behaviour": [],
      "description": "Teleports to a unit, friendly or enemy, and grants bonus attack speed while attacking if it's an enemy unit.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.25+0.8",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1000 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 1250)",
        "Attack Speed Bonus: 80\/110\/140\/170 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 140\/170\/200\/230)",
        "Lifesteal: 10%\/15%\/20%\/25%",
        "Duration: 2 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2.5)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Phantom_Assassin_Phantom_Strike.mp3\/revision\/latest?cb=20191216021614",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self"
      ],
      "mana": "11\/9\/7\/5",
      "aghanim": null,
      "name": "Phantom Strike",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "B",
      "story": "Mortred's silken veil is the last thing her unfortunate target sees."
    },
    {
      "notes": [
        "Interrupts Phantom Assassin's channeling abilities on cast",
        "Turns Phantom Assassin invisible, with True Sight immunity\n Does not prevent being revealed by <span image=\"images\/chronosphere.webp\">[picture:chronosphere]<\/span> Chronosphere",
        "Attacking or casting abilities do not break the invisibility",
        "The effect is dispelled when getting within 600 range of an enemy hero, clones and\/or an enemy building\n This includes when the enemy hero is invulnerable and hidden\n Treat illusions and creep-heroes as creeps\n The effect is not dispelled instantly, but 0.5 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0.75) seconds after getting within range\n Getting out of range during that delay does not prevent it from dispelling\n The delay does not serve as a grace period\n The effect is also dispelled when attacking <span image=\"images\/roshan.png\">[picture:roshan]<\/span> Roshan, not instantly, but after the dispel delay",
        "The passive evasion and the active component are independent from each other\n Blur's evasion stacks diminishingly with other sources of evasion and uses pseudo-random distribution",
        "On average, Blur increases Phantom Assassin's survivability against physical attacks by 25%\/43%\/67%\/100% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 82%\/122%\/186%\/300%)",
        "SCEPTER NOTES Blur now has an instant cast time and applies a basic dispel on Phantom Assassin upon cast\n Resets the cooldowns of all her basic abilities regardless how the kill was made, including killing the hero with Reincarnation\n Ultimate abilities are not reset\n The cooldown resetting is bound to Blur as well\n If not learnt, kills do not reset her cooldowns"
      ],
      "item_behaviour": [],
      "description": "Phantom Assassin focuses inward, increasing her ability to evade enemy attacks. Can be activated to blur her body, causing her to be impossible to see until near enemy heroes.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.4+0.57 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0+0 )",
        "Passive Evasion: 20%\/30%\/40%\/50% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 45%\/55%\/65%\/75%)",
        "Vanish Dispel Radius: 600",
        "Vanish Fade Time: 0",
        "Vanish Dispel Delay: 0.5 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0.75)",
        "Vanish Duration: 25"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Phantom_Assassin_Blur_1.mp3\/revision\/latest?cb=20191216021620",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "60\/55\/50\/45 (TagTalent 10)",
      "aghanim": null,
      "name": "Blur",
      "cooldown": "50",
      "legacy_key": "R",
      "story": "Meditation allows a Veiled Sister to carefully anticipate her opponents in combat."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard to be unlocked",
        "Applies Break on hit enemies",
        "Despite the visual effect, Fan of Knives releases a single pulse that expands outwards, hitting all enemies as it reaches them\n The released daggers only have a visual purpose, the pulse affects all enemies it catches, regardless of the number of visible daggers",
        "The pulse spreads at a speed of 1000 and takes 0.55 seconds to reach max range\n The area of effect is centered around the cast location, it does not move along with the caster",
        "The pulse is not a ring\n It affects every enemy within its expanding area of effect\n This means it is not possible to avoid the effect by blinking over the daggers\/pulse towards the caster",
        "Fan of Knives first applies the debuff, then the damage"
      ],
      "item_behaviour": [],
      "description": "Phantom Assassin releases sharp blades around her, dealing a percentage of each victim's max health on impact and applying Break.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.15+0.9",
        "Radius: 550",
        "Max Health as Damage: 16%",
        "Debuff Duration: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Phantom_Assassin_Fan_of_Knives_1.mp3\/revision\/latest?cb=20210102190424",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Fan of Knives",
      "cooldown": "50",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "Increases attack damage by an average of 15%\/33.75%\/52.5% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 22%\/49.5%\/77%)",
        "A critical strike proc is decided upon attack begin, not upon landing an attack\n When a critical strike procs, Phantom Assassin uses a specific crit attack animation, and particle effects appear on her weapon",
        "The proc chances of multiple critical strike sources stack\n If two sources of critical strike proc at the same time, the higher crit multiplier has priority",
        "Coup de Grace uses pseudo-random distribution",
        "Coup de Grace does not work against allied units, buildings or wards"
      ],
      "item_behaviour": [],
      "description": "Phantom Assassin refines her combat abilities, gaining a chance of delivering a devastating critical strike to enemy units. Stifling Dagger shares the same critical strike chance.",
      "hot_key": "R",
      "params": [
        "Proc Chance: 15% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 22%)",
        "Critical Damage: 200%\/325%\/450%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/93\/Phantom_Assassin_Coup_de_Grace_1.mp3\/revision\/latest?cb=20191216021612",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Coup de Grace",
      "cooldown": null,
      "legacy_key": "C",
      "story": "A divine strike, Mortred honors her opponent by choosing them for death."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 19.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 3.2,
    "attrAgility": 23.0
  },
  "description": "Blinks onto her foes with critical strikes. Of all the assassins raised by the Sisters of the Veil, only one is known by name: Mortred. Through meditation and prophecy, the order identifies the next target to die at her hands. Attacks miss against the Phantom Assassin as she Blurs into her surroundings, traversing undetected across the land to catch her victims unaware. She opens the encounter with a Stifling Dagger, thrown from the shadows, then leaps upon the crippled target to deliver a flurry of Phantom Strikes, followed by a Fan of Knives hurled into all directions. Without warning, any one of her attacks could be the Coup de Grâce, leaving behind only the blood-splattered ground as testament to her efficiency.  Carry Escape ★☆☆",
  "trivia": [
    "Mortred's name is derived from Mordred, a character in the Arthurian legend who betrayed and fought King Arthur at the Battle of Camalann.",
    "\"Coup de grâce\" is a French term (pronounced \"koo duh gras\") which literally means \"blow of mercy\", and refers to the killing blow of a wounded person or animal, friendly or not, to end their suffering. The phrase originates from medieval times, specifically Knights (see above - Knights of the Round Table). When a combatant was gravely injured (in battle, duels, jousting, etc...) but not killed; a coup de grâce was often, although not always, performed. Traditionally a rondel dagger was used as this could make a small puncture in breastplate and was long enough to reach the heart.",
    "Mortred's level-up line Link▶️ \"I'm an immaterial girl!\" is probably a reference to the song Material Girl performed by Madonna.",
    "In DotA: Allstars, Blur caused Mortred to become transparent to the enemy, scaling with levels and making her nearly invisible and untargetable to inexperienced players, thus her title \"Phantom Assassin\". This aspect of the ability is replicated to a limited degree with Blur's active component in Dota 2.",
    "Mortred's idle animation is a typical fencing stance, with perpendicular feet, one arm extended forth and the other one folded and up in the air. However, her weapon is wielded not with the extended arm, but with the arm at rest. There are treatises, at least for the Italian school of fencing, which do show an extended arm but this is exclusively used when wielding a rapier or other single-handed thrusting swords.",
    "Mortred is featured in the Dota 2 comic, The Contract.",
    "Phantom Assassin's ability Fan of Knives is based on the Fan of Knives ability from the Warden from Warcraft 3, sharing its name and working in a similar way. In DotA, Phantom Assassin also uses the Warden's hero model.",
    "In DotA, Phantom Assassin also uses the Warden's hero model."
  ],
  "history": "Through a process of divination, children are selected for upbringing by the Sisters of the Veil, an order that considers assassination a sacred part of the natural order. The Veiled Sisters identify targets through meditation and oracular utterances. They accept no contracts, and never seem to pursue targets for political or mercenary reasons. Their killings bear no relation to any recognizable agenda, and can seem to be completely random: A figure of great power is no more likely to be eliminated than a peasant or a well digger. Whatever pattern the killings may contain, it is known only to them. They treat their victims as sacrifices, and death at their hand is considered an honor. Raised with no identity except that of their order, any Phantom Assassin can take the place of any other; their number is not known. Perhaps there are many, perhaps there are few. Nothing is known of what lies under the Phantom Veil. Except that this one, from time to time, when none are near enough to hear, is known to stir her veils with the forbidden whisper of her own name: Mortred.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+7% Coup de Grace chance",
        "talent_left": "Triple Strike Stifling Dagger"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+20% Stifling Dagger Damage",
        "talent_left": "+60 Phantom Strike Attack Speed Bonus"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+25% Blur Evasion",
        "talent_left": "+250 Phantom Strike Cast Range"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+0.5s Phantom Strike Duration",
        "talent_left": "-2s Stifling Dagger Cooldown"
      }
    ]
  }
}