{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в базовый урон от атаки. Даётся иллюзиям, и также попадает под действие всех эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Даётся иллюзиям, и также попадает под действие всех эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−60 сек. перезарядки Guardian Angel",
          "talentRight": "+160 к урону\/лечению от Purification"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−2 сек. перезарядки Heavenly Grace",
          "talentRight": "+15% к замедлению от Degen Aura"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к скорости передвижения",
          "talentRight": "−2 сек. перезарядки от Purification"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+50 к базовому урону",
          "talentRight": "+10 здоровья в секунду от Heavenly Grace"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Omniknight_Purification.mp3\/revision\/latest?cb=20191216021244",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Перекрестие указателя должно выделять союзное существо.",
        "Вопреки визуальным эффектам, урон наносится мгновенно всем врагам в радиусе вокруг цели."
      ],
      "mana": "80\/95\/110\/125",
      "hotKey": "Q",
      "cooldown": "18\/16\/14\/12 (TagTalent 16\/14\/12\/10)",
      "description": "Мгновенно исцеляет союзное существо и наносит урон врагам вокруг него.",
      "spellName": "Purification",
      "params": [
        "Анимация применения: 0,2+1,4",
        "Дальность применения: 550",
        "Радиус урона: 260",
        "Урон: 90\/160\/230\/300 (TagTalent 250\/320\/390\/460)",
        "Лечение: 90\/160\/230\/300 (TagTalent 250\/320\/390\/460)",
        "Можно применить на союзников с иммунитетом к заклинаниям. Не действует на врагов с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Omniknight_Heavenly_Grace.mp3\/revision\/latest?cb=20191216021242",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников"
      ],
      "notes": [
        "При использовании применяет сильное развеивание на цель.",
        "Heavenly Grace сначала применяет бафф, затем развеивание.",
        "Дополнительная сила дает цели 160\/320\/480\/640 здоровья, 0,8\/1,6\/2,4\/3,2 регенерации здоровья (и 8\/16\/24\/32 урона для героев силы).",
        "Восстанавливает до 80\/120\/160\/200 (TagTalent 180\/220\/260\/300) здоровья за всю длительность.",
        "Сопротивление эффектам складывается по закону убывающей полезности с другими источниками сопротивления."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "W",
      "cooldown": "26\/22\/18\/14 (TagTalent 24\/20\/16\/12)",
      "description": "Создаёт вокруг цели божественный щит, который увеличивает её сопротивление эффектам, силу и восстановление здоровья.",
      "spellName": "Heavenly Grace",
      "params": [
        "Анимация применения: 0,25+1,27",
        "Дальность применения: 500",
        "Доп. сила: 8\/16\/24\/32",
        "Сопротивление эффектам: 50%",
        "Восстановление здоровья: 8\/12\/16\/20 (TagTalent 18\/22\/26\/30)",
        "Длительность: 10"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Дебафф ауры задерживается на 1 сек."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Значительно снижает скорость передвижения врагов, осмелившихся подойти слишком близко.",
      "spellName": "Degen Aura",
      "params": [
        "Радиус: 375",
        "Замедление скорости передвижения: 10%\/18%\/26%\/34% (TagTalent 25%\/33%\/41%\/49%)",
        "Длительность задержки ауры: 1",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Omniknight_Hammer_of_Purity.mp3\/revision\/latest?cb=20210102003958",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов \/ Себя",
        "Урон Чистый"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Дальность применения Hammer of Purity основана на дальности атаки героя. Дальность применения может быть увеличена другими бонусами к дальности атаки. Однако, на него не влияют бонусы к дальности применения заклинаний.",
        "Дальность применения может быть увеличена другими бонусами к дальности атаки. Однако, на него не влияют бонусы к дальности применения заклинаний.",
        "Урон наносится отдельно.",
        "Урон основан на базовом уроне атаки и уроне, полученном от основного атрибута. Необработанный бонус к урону игнорируется.",
        "Урон не зависит от фактического урона, нанесенного ведущей атакой. Его значение рассчитывается отдельно. Учитывает минимальные и максимальные значения урона заклинателя, поэтому урон варьируется так же, как и обычные атаки.",
        "Учитывает минимальные и максимальные значения урона заклинателя, поэтому урон варьируется так же, как и обычные атаки.",
        "Hammer of Purity сначала наносит свой собственный урон, исцеление, а затем урон от атаки."
      ],
      "mana": "20",
      "hotKey": "D",
      "cooldown": "4",
      "description": "Следующая атака нанесёт дополнительный чистый урон, равный 60 + 115% от базового урона героя, и восстановит ему столько же здоровья. Перезарядка: 4 секунды.",
      "spellName": "Hammer of Purity",
      "params": [
        "Базовый урон: 60",
        "Урон от базового урона атаки: 115%",
        "Исцеление от урона: 100%",
        "Не может быть нацелен на врагов с иммунитетом к заклинаниям. Может исцелить Omniknight с иммунитетом.",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Omniknight_Guardian_Angel_1.mp3\/revision\/latest?cb=20191216021248",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Действует на всех союзных существ, за исключением вардов, курьеров, неуязвимых и спрятанных существ.",
        "Действует на постройки только после улучшения Aghanim's Scepter.",
        "При улучшении восстанавливает до 320\/360\/400 здоровья за всю длительность."
      ],
      "mana": "125\/175\/250",
      "hotKey": "R",
      "cooldown": "160\/150\/140 (TagTalent 100\/90\/80)",
      "description": "Призывает ангела-хранителя, который полностью защищает союзников от физического урона.",
      "spellName": "Guardian Angel",
      "params": [
        "Анимация применения: 0,4+0,9",
        "Радиус: 1200 (TagAghanim Глобальный)",
        "Доп. восстановление здоровья: 0 (TagAghanim 40)",
        "Длительность: 5\/6.5\/8 (TagAghanim 8\/9\/10)",
        "Увеличивает длительность, даёт восстановление здоровья, охватывает всю карту и действует на постройки.",
        "Дарует новую способность: Hammer of Purity"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 24.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 15.0
  },
  "description": "Omniknight – это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Purification, Мгновенно исцеляет дружеского юнита и наносит урон ближайшим вражеским юнитам. Вторая способность, Heavenly Grace, создает божественный щит вокруг цели, который увеличивает количество силы, регенерацию и сопротивление эффектам у союзного юнита. Пассивная способность, Degen Aura, снижает скорости передвижения и атаки врагов, находящихся рядом с Omniknight. Ультимативная способность, Guardian Angel, призывает ангела-хранителя, который делает всех ближайших союзных юнитов невосприимчивыми к физическому урону. Улучшение с Aghanim's Scepter увеличивает длительность, охватывает всю карту и действует на строения.",
  "history": "Ревнитель Громобой с раннего детства служил ордену, посвятившему себя подвигам во имя Всезнания. Прожив так много лет, он, будучи праведно верящим в свое дело, не раз отправлявшимся в далекие края рыцарем, никогда не ставил свою веру под вопрос — их дело было правым, а кто был не с ними — тот был против них. В самом начале его, и без того готового на подвиги, подстегивали юношеский кураж и молодость. Однако шли долгие годы крестовых походов, и вот сходили в могилы на краю дорог те, на службу к которым он когда-то поступал; вот один за одним пали в бою с жуткими, злыми сущностями, не признающими Всезнание, его братья по оружию, вместе с которыми он в детстве оказался в ордене; вот погибали его же собственные оруженосцы во многочисленных засадах, под натиском ужасных погодных условий далеких стран, от всевозможных болезней... Так, шаг за шагом, Громобой потерял былую уверенность в своих клятвах — и во всем их крестовом походе. Отколовшись от военных сил ордена, он отправился обратно в Эмарак, город на утесах, знаменитый своим пещерным храмом, где и находились жрецы Всезнания. Ревнитель нашел их и бросил вызов. Никто прежде не смел высказывать подобной наглости, и Громобоя поначалу пытались сбросить с утеса для жертвоприношений, но сколько бы человек на него не набрасывались и какие бы заклинания на него не обрушали — его так и не удавалось сдвинуть с места. И пролился на стойкую фигуру воина небесный свет — тогда служители храма поняли, что Всезнание избрало его, чтобы открыться. Отойдя прочь от избранного, они пропустили старейшину, чтобы тот открыл Ревнителю дверь в их святая святых, где хранились не свитки древней мудрости, не легендарные реликвии, в которые надо было для начала самому поверить, а туда, где находился тот, кто испокон веков жил внутри скалы — более того, тот, кто сам создал эту скалу бесчисленное множество лет назад, чтобы защититься от опасностей внешнего мира. По легенде, именно так мир был создан Всезнанием. Тогда рыцарь всё осознал. У него не было более никакой причины сомневаться в истинности веры. Быть может, Всезнание и не было никаким создателем мира, но оно было реально. Теперь поход паладина имел смысл. За его целительными способностями и воинской храбростью стоят реальные силы, а не какие-то выдумки.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−60 сек. перезарядки Guardian Angel",
      "talentRight": "+160 к урону\/лечению от Purification"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−2 сек. перезарядки Heavenly Grace",
      "talentRight": "+15% к замедлению от Degen Aura"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к скорости передвижения",
      "talentRight": "−2 сек. перезарядки от Purification"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+50 к базовому урону",
      "talentRight": "+10 здоровья в секунду от Heavenly Grace"
    }
  ]
}