{
  "abilities": [
    {
      "notes": [
        "The intelligence talent effectively grants Oracle 144 mana, 0.6 mana regeneration, and 12 attack damage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1.5s False Promise Duration",
          "talentRight": "Instant Fortune's End"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30% Purifying Flames Enemy Damage",
          "talentRight": "-20s False Promise Cooldown"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-1.25s Purifying Flames Cooldown",
          "talentRight": "+15 False Promise Armor"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+12 Intelligence",
          "talentRight": "+0.4s Fortune's End Duration"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Oracle_Fortune%27s_End_1.mp3\/revision\/latest?cb=20191216021406",
      "effects": [
        "Ability Target Unit \/ Channeled",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1000.",
        "When targeting allies, the area effect is still applied to surrounding enemies. The ally only gets dispelled. Enemies in the area always get dispelled, while allies only get dispelled when targeted, so only one ally can be dispelled per cast. ↓↓ Double-tapping automatically targets self.",
        "Enemies in the area always get dispelled, while allies only get dispelled when targeted, so only one ally can be dispelled per cast.",
        "↓↓ Double-tapping automatically targets self.",
        "Always dispell Fate's Edict on affected targets. With Aghanim's Scepter, it dispels Fate's Edict on affected enemies.",
        "With Aghanim's Scepter, it dispels Fate's Edict on affected enemies.",
        "Fortune's End first applies the dispel, the debuff, then the damage.",
        "Can directly be cast on invulnerable units, fully affecting them, though the damage gets negated by the invulnerability. Does not affect hidden targets. When the projectile connects with a spell immune, invulnerable, or hidden target, it still affects other units within the radius, but not the main target. Can neither target, nor affect wards and buildings. Applies a visual effect on the targeted unit upon cast, indicating that it is directly targeted. This visual effect is visible to everyone. The sound during the channeling is audible to everyone as well.",
        "When the projectile connects with a spell immune, invulnerable, or hidden target, it still affects other units within the radius, but not the main target.",
        "Can neither target, nor affect wards and buildings.",
        "Applies a visual effect on the targeted unit upon cast, indicating that it is directly targeted. This visual effect is visible to everyone.",
        "The sound during the channeling is audible to everyone as well.",
        "The channeling is not canceled when the target turns spell immune, invisible, invulnerable, hidden, or dies. When the channeling is interrupted through disables, the projectile is released prematurely.",
        "When the channeling is interrupted through disables, the projectile is released prematurely.",
        "The damage and dispel effect are static, only the root duration is based on the time spent channeling.",
        "The root duration starts at 0.5 (TagTalent 0.9) and increases by 0.08 for each 0.1 seconds channeled, reaching 2.5 (TagTalent 2.9) seconds of root duration in 2.5 seconds channeled. The instant Fortune's End talent suppresses the channeling time of Fortune's end, releasing immediately the bolt as it was channeled as max time duration.",
        "The instant Fortune's End talent suppresses the channeling time of Fortune's end, releasing immediately the bolt as it was channeled as max time duration.",
        "Fortune's End roots affected targets, preventing them from moving and casting certain mobility abilities. Provides True Sight over the targets, but only when the targets were not invisible or within a fade time upon hit.",
        "Provides True Sight over the targets, but only when the targets were not invisible or within a fade time upon hit."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "15\/12\/9\/6",
      "description": "Gathers Oracle's power into a bolt of scouring energy that, when released, damages, roots, and purges enemies of buffs in an area around the target. If target is an ally it will only purge debuffs. Can be channeled for up to 2.5 seconds. The root duration is equal to the time spent channeling.",
      "spellName": "Fortune's End",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 850",
        "Effect Radius: 300",
        "Max Channel Time: 2.5 (TagTalent 0)",
        "Damage: 100\/160\/220\/280",
        "Min Root Duration: 0.5 (TagTalent 0.9)",
        "Max Root Duration: 2.5 (TagTalent 2.9)",
        "Can target spell immune allies. Cannot target spell immune enemies. Applies area effect when connecting with spell immune enemy. Does not root, dispel, or attempt to damage spell immune enemies. Root persists if debuff was placed before spell immunity and when not dispelled.",
        "Blocked fully only when primary target. Blocked upon impact.",
        "The astral orb crackles with power while raw energy lances out, temporarily disrupting an enemy's connection to their own body."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The astral orb crackles with power while raw energy lances out, temporarily disrupting an enemy's connection to their own body."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3a\/Oracle_Fate%27s_Edict.mp3\/revision\/latest?cb=20191216021405",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "Applies a disarm on the target and sets its magic resistance to 100%. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Fate's Edict always places a debuff on the target, no matter it is an enemy or an ally. This means if cast on self or an ally, allies can dispel it, while enemies cannot. Vice versa, if cast on enemies, enemies can dispel it, while allies cannot.",
        "This means if cast on self or an ally, allies can dispel it, while enemies cannot.",
        "Vice versa, if cast on enemies, enemies can dispel it, while allies cannot.",
        "Fortune's End can always dispel the modifier, regardless of who the target is.",
        "With Aghanim's Scepter, applies disarm to enemy targets only, and the magic resistance bonus to allied targets only. Immediately updates all existing modifiers on affected units. Fate's Edict is now placed as a buff on allies. This means allies can no longer dispel it but enemies now can. Fortune’s End does not dispel the positive modifier on allies\/self anymore. Spell immunity will still dispel the upgraded modifier, despite being a buff.",
        "Immediately updates all existing modifiers on affected units.",
        "Fate's Edict is now placed as a buff on allies. This means allies can no longer dispel it but enemies now can.",
        "Fortune’s End does not dispel the positive modifier on allies\/self anymore.",
        "Spell immunity will still dispel the upgraded modifier, despite being a buff."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "16\/13\/10\/7",
      "description": "Oracle enraptures a target, disarming them and granting them 100% magic damage resistance. Can be cast on allies and enemies.",
      "spellName": "Fate's Edict",
      "params": [
        "Cast Animation: 0.3+1.1",
        "Cast Range: 500\/600\/700\/800",
        "Enemy Magic Resistance: 100% (TagTalent 0%)",
        "Ally Magic Resistance: 100%",
        "Duration: 3\/3.5\/4\/4.5",
        "Fate's Edict no longer causes allies to be disarmed or enemies immune to magic damage.",
        "Disarm and magic resistance persist if debuff was placed before spell immunity and when not dispelled.",
        "An unbreakable prophecy resounds: a chosen ally shall briefly suffer no magics. Other kinds of suffering however..."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "An unbreakable prophecy resounds: a chosen ally shall briefly suffer no magics. Other kinds of suffering however..."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0c\/Oracle_Purifying_Flames.mp3\/revision\/latest?cb=20191216021409",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "The damage is applied instantly upon cast, followed by the heal over time. The damage is lethal to enemies, but not to allies, so it cannot be used for denying. Cannot be cast on allies who have ☐ Disabled Help from Oracle. ↓↓ Double-tapping automatically targets self.",
        "The damage is lethal to enemies, but not to allies, so it cannot be used for denying.",
        "Cannot be cast on allies who have ☐ Disabled Help from Oracle.",
        "↓↓ Double-tapping automatically targets self.",
        "Multiple casts on the same target fully stack.",
        "Heals in 1-second intervals, starting 1 second after cast, resulting in 9 instances of heal.",
        "Can heal up to 99\/198\/297\/396 health per cast, 9\/18\/27\/36 health when considering the initial damage before reductions."
      ],
      "mana": "80\/85\/90\/95",
      "hotKey": "E",
      "cooldown": "2.25 (TagTalent 1)",
      "description": "Burns away impurities, dealing heavy magic damage to the target before causing them to regenerate health over time. The amount of health regenerated over its duration exceeds the amount of initial damage. Can be cast on enemies and allies.",
      "spellName": "Purifying Flames",
      "params": [
        "Cast Animation: 0.15+1.14",
        "Cast Range: 850",
        "Enemy Damage: 90\/180\/270\/360 (TagTalent 117\/234\/351\/468)",
        "Ally Damage: 90\/180\/270\/360",
        "Heal per Second: 11\/22\/33\/44",
        "Duration: 9",
        "Heal persists if buff was placed before spell immunity and when not dispelled.",
        "Like a hall of mirrors might amplify the light of a single candle, the shattered walls of the universe can transform the light of prophecy into a burning torch."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Like a hall of mirrors might amplify the light of a single candle, the shattered walls of the universe can transform the light of prophecy into a burning torch."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e9\/Oracle_False_Promise_1.mp3\/revision\/latest?cb=20191216021412",
      "effects": [
        "Ability Target Unit",
        "Affects Allied Heroes",
        "Damage Pure (TagAghanimHP Removal)"
      ],
      "notes": [
        "Applies a strong dispel on the target upon cast. Can be cast on illusions and creep-heroes. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "False Promise fully negates damage after all reductions, causing several on-damage effects to not trigger.",
        "False Promise has the second highest priority in the group of damage negating spells. It also negates healing effects. This means when combined with e.g. Aphotic Shield or Refraction, False Promise negates damage while the other sources do not. It has a lower priority than Borrowed Time, means Borrowed Time first turns damage into heal, and then it is blocked as heal by False Promise.",
        "This means when combined with e.g. Aphotic Shield or Refraction, False Promise negates damage while the other sources do not.",
        "It has a lower priority than Borrowed Time, means Borrowed Time first turns damage into heal, and then it is blocked as heal by False Promise.",
        "As with all damage manipulating effects, False Promise only negates and delays the 3 damage types. It fully ignores HP Removal (except for Heartstopper Aura and Static Field).",
        "Does not prevent instant killing effects like Culling Blade, or Ice Blast shatter.",
        "Just like damage, False Promise also prevents the hero's health from increasing, with a few exceptions. Unlike negated damage, negates healing effects before any amplifications or reductions (e.g. Ghost Shroud and Ice Blast). Only actual heals are counted by False Promise. Other means of health increase are not counted, although may still be prevented (e.g. health gained from strength). Does not prevent the following spells from increasing the hero's health: Supernova, Soul Catcher, Sunder, Whirling Death, Decay, Time Lapse, Armlet of Mordiggian, and Essence Ring.",
        "Unlike negated damage, negates healing effects before any amplifications or reductions (e.g. Ghost Shroud and Ice Blast).",
        "Only actual heals are counted by False Promise. Other means of health increase are not counted, although may still be prevented (e.g. health gained from strength).",
        "Does not prevent the following spells from increasing the hero's health: Supernova, Soul Catcher, Sunder, Whirling Death, Decay, Time Lapse, Armlet of Mordiggian, and Essence Ring.",
        "At the end of the duration, the target gets healed if the overall heal was higher, or damaged if the damage was higher. The first sound is played if the target gets healed and second sound if target is damaged. All healing received gets summed up into one instance and doubled. Then, the heal sum gets subtracted from each individual damage instance in order. This is repeated until either all damage instances are negated by the heal, or until the summed heal value depletes. If the heal sum depletes, then the remaining damage instances get applied in order. The damage is flagged as HP Removal. Therefore, if the target dies, the kill is credited to whoever's instance dealt the killing blow, which can be the first, last or any other instance in between. Non-lethal damage instances blocked during False Promise are still not lethal when re-applied at the end of the duration. If all damage instances get negated instead, the remaining heal sum gets applied as a single heal to the target. This heal is always credited to Oracle.",
        "The first sound is played if the target gets healed and second sound if target is damaged.",
        "All healing received gets summed up into one instance and doubled. Then, the heal sum gets subtracted from each individual damage instance in order.",
        "This is repeated until either all damage instances are negated by the heal, or until the summed heal value depletes.",
        "If the heal sum depletes, then the remaining damage instances get applied in order. The damage is flagged as HP Removal.",
        "Therefore, if the target dies, the kill is credited to whoever's instance dealt the killing blow, which can be the first, last or any other instance in between.",
        "Non-lethal damage instances blocked during False Promise are still not lethal when re-applied at the end of the duration.",
        "If all damage instances get negated instead, the remaining heal sum gets applied as a single heal to the target. This heal is always credited to Oracle.",
        "Despite being HP Removal, Shallow Grave can still save the target from it and Borrowed Time still turns it into heals.",
        "If the target is invulnerable as False Promise expires, the delayed heal and damage wait for it to become vulnerable again.",
        "Successive casts on the same target do not stack, but refresh the duration. The blocked heal and damage counters are not reset.",
        "If the accumulated damage exceeds the accumulated heal, the orb above the target glows red and emits fire, indicating it will receive damage.",
        "With Aghanim's Shard, grants the target invisibility with a 0.15-second fade delay. Attacking or casting spells or items breaks the invisibility and resets the fade delay.",
        "Attacking or casting spells or items breaks the invisibility and resets the fade delay."
      ],
      "mana": "100\/150\/200",
      "hotKey": "R",
      "cooldown": "120\/90\/60 (TagTalent 100\/70\/40)",
      "description": "Temporarily alters an ally's destiny, delaying any healing or damage taken until False Promise ends. Any healing that is delayed by False Promise is doubled. Removes most negative status effects and disables on initial cast.",
      "spellName": "False Promise",
      "params": [
        "Cast Animation: 0.3+0.97",
        "Cast Range: 700\/850\/1000",
        "Delayed Heal Amplification: 100%",
        "Duration: 8\/9\/10 (TagTalent 9.5\/10.5\/11.5)",
        "Bonus Armor: 15",
        "Fade Delay: 0.15",
        "Causes False Promise to have a 0.15-second fade delay invisibility.",
        "Foes and false prophets oft make lies of men's fates."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Foes and false prophets oft make lies of men's fates."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 20.0,
    "attrIntelligence": 26.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.7,
    "attrAgility": 15.0
  },
  "description": "Nerif, the Oracle, is a ranged intelligence hero who alters the fate of allies and enemies with his combination of multipurpose nukes and buffs. He possesses the ability to change his foes' fortunes with Fortune's End, which deals nuke damage and pins down any enemies in its radius, while dispelling buffs from them. His Fate's Edict can be cast on allies and enemies alike, disarming them but also granting them complete resistance against magical damage; used with skill, he can render his foes' weapons useless or shield his allies from unfriendly spells. Purifying Flames, like Fate's Edict, can be cast on friend or foe, dealing magical damage but also applying a healing buff to them. His signature ability and ultimate, False Promise, puts an ally's fate on hold, removes every dispellable disable and prevents them from being harmed by the enemy for a short time, and then fully returning them to reality at the end of the spell's duration. Knowledge of Oracle's skills is key to use him at his full potential; while he can defy destiny and snatch victory from the jaws of defeat, one mistake can potentially seal the fate of his allies.",
  "history": "Ascendants to the Great Seat of Cymurri had for ages imported their Oracles exclusively from the Ivory Incubarium, high in the hollow peaks of the Zealot's Range, with a downpayment made at the time of the embryo's conception and the balance surrendered on delivery of a mature, well-trained prophet to the Gate of the Graven King. Raised by same Pallid Sybils who bred and birthed them, all sanctioned Oracles were anchored by their physical form to the world we most of us share; meanwhile, their souls roamed far afield, barely bound by the airiest astral umbilicus. From such cosmic roamings the prophets would return, speaking words of fire with tongues of flesh. Their mystic utterances were analyzed by the Cymurri Advisors, who found in them visions of the future, diplomatic advice, all the supernatural ammunition the line of Graven Kings needed to secure victory in every campaign, whether in the court or on the battlefield. Thus it went for generations, the Graventome's pages filling with the names of triumphant kings and the new domains they had acquired. So it went, that is, until the particular Oracle named Nerif arrived to serve the very last of the stone-helmed kings. From the first, Nerif's prophecies were unusual. They seemed not merely to portend the future, but to shape it. The weird soothsayer croaked out advice no one had requested, and suddenly the Cymurri found themselves immersed in conflicts with newfound enemies. The Advisors, sensing a threat to their power, were quick to pin these unwelcome developments on the latest Oracle. They demanded his removal, petitioning the Sybils to reclaim their defective prophet and replace him with a worthy substitute. But Nerif described an ominous dream of the Incubarium's destruction, and within hours came news of the ancient school's destruction in a catastrophic avalanche. Fearing the same fate as the Pallid Sybils, the Advisors withdrew to their counsel chambers, suddenly anxious to avoid the Oracle's notice. The Graven King, however, was a creature of great practicality. He doubted the commitment of his overprudent Advisors. An Oracle of such rarity, he reasoned, ought be used as a weapon to enlarge his domain. He therefore demoted his timid counselors and stationed Nerif at his side. With only a blunt understanding of Nerif's talent, he boldly stated the outcomes he desired, and coaxed Nerif into uttering his wishes as prophecy. At first, all was well. The Last Graven King boasted that by adopting Fate's pet, he had made a plaything of Fate itself. He should have taken it as a warning then when, on the eve of his invasion of the Unsated Satrap's realm, he attempted to coerce a prediction of certain victory from his Oracle, only to hear Nerif quietly mutter, \"It could go either way.\" No firmer statement could he force from Nerif's lips. Still, the King was confident in his army. The Satrapy was landlocked, poorly armed, and shut off from all possible allies. He took \"It could go either way\" to indicate that with tactical might on his side, there was little risk in his plan. Of course, we now know that he should have taken the sayer's words more literally. Even with careful study of the Annotated Annals of If, what happened on the field before the Unsated Satrap's palace is almost impossible to visualize. It appears that in the midst of the carnage, the battle began to bifurcate. At each pivotal moment, reality calved and broke into bits. Soldiers who staggered and fell in battle also stood sure-footed, forging onward to fight. Their minds also split; the warriors found themselves both dead and alive, existent and non-existent. Victory and defeat were partitioned, so that each separate outcome was experienced in simultaneity by both armies. The universe became a hall of mirrors, with all the mirrors endlessly shattering. The immediate effect on both parties was insanity. Unable to comprehend the state of being both triumphant and defeated, the Graven King's mind dispersed into motes of madness. The naive Satrap fared no better. The opposing paired realities continued to split and split again, echoing into infinite histories, all of them populated by a bewildered populace that soon lost the ability to feed, clothe, defend, or reproduce itself in the traditional manner. Long before the repercussions had played out, however, Cymurri's wary Advisors had seized Nerif, bound and gagged him, and launched him out of their universe at high speed on a dimensional barque, in the hopes of depositing him where he could do them no harm forever. It was, of course, too late for them. And may well be for us.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1.5s False Promise Duration",
      "talentRight": "Instant Fortune's End"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30% Purifying Flames Enemy Damage",
      "talentRight": "-20s False Promise Cooldown"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-1.25s Purifying Flames Cooldown",
      "talentRight": "+15 False Promise Armor"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+12 Intelligence",
      "talentRight": "+0.4s Fortune's End Duration"
    }
  ]
}