{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Bloodstone_Bloodpact.mp3\/revision\/latest?cb=20191227195357",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Interrupts the caster's channeling spells upon cast.",
        "Checks the caster's mana once upon cast, and grants health regen accordingly. This means the health regeneration value does not update after cast, and stays the same throughout the entire duration. Recasting Bloodpact refreshes the duration, without updating health regen value.",
        "This means the health regeneration value does not update after cast, and stays the same throughout the entire duration.",
        "Recasting Bloodpact refreshes the duration, without updating health regen value.",
        "Heals in the form of health regeneration, so it restores 1.5% of max mana as health in 0.1 second intervals."
      ],
      "mana": "30% of max mana",
      "abilityName": "Bloodpact",
      "cooldown": "85",
      "description": "Converts 30% of your max mana to health regeneration over 2 seconds.",
      "params": [
        "Duration: 2"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "When having multiple Bloodstones, the one in the higher inventory slot gains charges. The top left inventory slot has the highest priority, the bottom right one the lowest.",
        "The top left inventory slot has the highest priority, the bottom right one the lowest.",
        "The effects of Bloodstone charges from all Bloodstones a hero owns fully stack.",
        "Gains a charge whenever an enemy hero dies (including Reincarnation) within the radius, or whenever the owner makes a kill from any distance.",
        "When multiple heroes in a team have Bloodstones, each hero can gain a charge from the same enemy death.",
        "Each charge can regenerate up to 12 mana in one minute.",
        "The Bloodstone loses 3 charges upon dying. Cannot go below 0 charges.",
        "Charges are not lost when the carrier dies with Reincarnation."
      ],
      "mana": null,
      "abilityName": "Mana Battery",
      "cooldown": null,
      "description": "Each charge provides 0.2 MP regen and 0.35% Spell Amp. Nearby kills provide 1 charges. Dying causes you to lose 3 charges. Starts with 14 charges.",
      "params": [
        "Charge Gain Radius: 1600",
        "Charge Gain per Enemy Hero Death: 1",
        "Charge Loss per Death: 3",
        "Mana Regen Bonus per Charge: 0.2",
        "Spell Damage Bonus per Charge: 0.35%",
        "Illusions copy the charges upon spawning, but cannot gain new charges."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 425 health, 617 mana, 0.8 mana regen and 8% spell damage.",
    "For agility heroes, it grants 425 health, 617 mana, 0.8 mana regen and 8% spell damage.",
    "For intelligence heroes, it grants 425 health, 617 mana, 0.8 mana regen, 8% spell damage and 16 attack damage.",
    "Bloodstone cannot be put into the backpack."
  ],
  "cost": "5950",
  "lore": null,
  "consistFrom": [
    "Voodoo Mask",
    "Kaya",
    "Soul Booster"
  ],
  "boughtFrom": "Armor",
  "name": "Bloodstone",
  "description": "The Bloodstone's bright ruby color is unmistakable on the battlefield, as the owner seems to have infinite vitality and spirit.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+16 Intelligence",
    "+425 Health",
    "+425 Mana",
    "+8% Spell Damage",
    "+15% Spell Lifesteal (Hero)",
    "+3% Spell Lifesteal (Creep)",
    "+100% Mana Regen Amplification",
    "+30% Spell Lifesteal Amplification"
  ],
  "tips": [
    "Most heroes who want to build Bloodstone can take advantage of the ability to Disassemble Arcane Boots to complete the Soul Booster.",
    "Use Bloodpact should enemies try finishing you off with their powerful abilities such as Maledict, Assassinate, or Thundergod's Wrath."
  ]
}