{"abilities":[{"spell":"Sprays high-pressure acid across a target area. Enemy units who step across the contaminated terrain take damage per second and have their armor reduced.","effects":["Ability Target Area","Affects Enemies","Damage Physical"],"notes":["The armor reduction is provided by an aura. Its debuff lingers for 0.5 seconds. The damage is independent from the aura.","Deals damage in 1-second intervals, starting 1 second after receiving the debuff, resulting in up to 16 instances.","Can deal up to 240\/320\/400\/480 damage to a single unit (before reductions).","When leveling up the ability while a cast is already active, the armor reduction value on already affected units does not update to the new value. However, if an enemy receives the debuff after leveling it up, that enemy receives the new armor reduction value. The damage value does not update and is always based on the level the ability was cast on.","The damage of multiple instances of Acid Spray fully stacks. The armor reduction, however, does not.","Does not affect couriers."],"mana":"130\/140\/150\/160","elements":["Does not pierce spell immunity."],"cooldown":"22","name":"Acid Spray","description":["Cast Animation: 0.2+0.7","Cast Range: 900","Radius: 400\/475\/550\/625","Damage per Second: 15\/20\/25\/30","Armor Reduction: 4\/5\/6\/7","Aura Linger Duration: 0.5","Duration: 16"],"hot_key":"Q","legacy_key":"D"},{"spell":"Alchemist brews up an unstable concoction that he can throw at an enemy hero, to stun and deal damage in an area around the explosion. The longer the concoction brews, the more damage it deals and the longer the stun. After 5 seconds, the brew reaches its maximum damage and stun time. However, after 5.5 seconds, the concoction will explode on Alchemist himself if not thrown.","effects":["Ability No Target","Affects Self","Damage Physical"],"notes":["Interrupts Alchemist's channeling spells upon cast.","A timer above Alchemist's head shows how much time is left before the Concoction blows up. This timer is visible to everyone.","The brewing animation and particles are visible to everyone. The Unstable Concoction buff is hidden.","The sound can be heard by enemies only when the spell was cast within their vision range.","The damage starts at 0 and increases by 3.2\/4.8\/6.4\/8 ( 11.2\/12.8\/14.4\/16) for each 0.1 seconds brewed, reaching the full damage in 5 seconds.","The stun starts at 0.3 and increases by 0.029\/0.044\/0.059\/0.074 for each 0.1 seconds brewed, reaching 1.75\/2.5\/3.25\/4 in 5 seconds.","The concoction first applies the damage, then the debuff.","Unstable Concoction always affects a 200 area around where it explodes, including when it explodes on Alchemist.","When Alchemist dies while brewing, it instantly blows up, hitting units around Alchemist based on how long it was brewed.","While brewing the concoction, Alchemist can still move around and act freely.","The stun and damage can hit creep-heroes within the radius as well.","Alchemist can deny himself with this ability.","Choosing the minimum damage upgrading talent immediately upgrades Alchemist's currently brewing concoction and all of his currently flying concoction projectiles."],"mana":"120","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"22\/20\/18\/16 ( 15\/13\/11\/9)","name":"Unstable Concoction","description":["Cast Animation: 0+0","Concoction Radius: 200","Maximum Brew Time: 5","Maximum Throw Time: 5.5","Minimum Damage: 0","Maximum Damage: 160\/240\/320\/400 ( 560\/640\/720\/800)","Maximum Stun Duration: 1.75\/2.5\/3.25\/4"],"hot_key":"W","legacy_key":"E"},{"spell":"Throw it before it blows up!","effects":["Ability Target Unit","Affects Enemy Heroes","Damage Physical"],"notes":["Replaces Unstable Concoction until the concoction is thrown or blows up.","The targeting reticule must be centered over an enemy unit.","The concoction travels at a speed of 900.","Once thrown, Unstable Concoction stops brewing.","Can only be thrown at heroes or illusions. The area damage does not hit creeps.","Cannot be cast on, but can stun and damage creep-heroes within the radius.","When connecting with an invulnerable or hidden target, it still applies its area effect, hitting nearby units."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Cannot be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"0","name":"Unstable Concoction Throw","description":["Cast Animation: 0.2+0.5","Cast Range: 775"],"hot_key":"W","legacy_key":"E"},{"spell":"Alchemist synthesizes additional gold from his enemies and bounty runes. With each kill, Alchemist earns base bonus gold and extra bonus gold. If Alchemist kills another unit which yields gold within the next 40 seconds, an additional instance of Extra Bonus Gold is added to the total. Additionally, causes bounty runes to yield more gold.","effects":["Ability Passive","Affects Self"],"notes":["Greevil's Greed triggers on every last hit Alchemist makes, excluding last hits on allies, buildings, illusions and Tempest Doubles.","All stacks work fully independently from each other. They last 40 seconds each and do not refresh each other.","Alchemist himself has to last hit to gain a stack, making last hits with other owned units does not add to his current stack.","The status buff icon shows how much extra gold Alchemist gains on his next last hit.","A second bounty number appears over Alchemist, showing the amount of extra gold earned. This number is only visible to Alchemist.","The minimum amount of last hits needed to reach the gold bonus cap is 4\/5\/6\/7 (within the 40-second stack duration).","Gold earned through Greevil's Greed is unreliable.","The Bounty Rune multiplier only affects the amount of gold Alchemist gains (regardless of whether he collects the rune himself). Allies still gain the default value."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break."],"cooldown":"0","name":"Greevil's Greed","description":["Base Gold Bonus: 4","Extra Gold Bonus per Stack: 4","Gold Bonus Cap: 20\/24\/28\/32","Stack Duration: 40","Bounty Rune Multiplier: 2\/2.5\/3\/3.5"],"hot_key":"E","legacy_key":"G"},{"spell":"Alchemist causes his Ogre to enter a chemically induced rage, reducing base attack cooldown and increasing movement speed and regeneration.","effects":["Ability No Target","Affects Self"],"notes":["Disjoints projectiles and applies a basic dispel on Alchemist upon cast.","Increases Alchemist's total movement speed to 345\/355\/365, and sets his base attack time to 1.2\/1.1\/1 ( 1\/0.9\/0.8).","Can regenerate up to 1250\/1875\/2500 ( 2000\/2625\/3250) health and 100\/250\/400 mana over its full duration.","Chemical Rage is fully canceled on death.","Recasting Chemical Rage before the previous cast finishes refreshes the duration and updates all values to the current level."],"mana":"50\/100\/150","elements":["Can be used by illusions.","Pierces spell immunity."],"cooldown":"55","name":"Chemical Rage","description":["Cast Animation: 0+0","Transformation Time: 0.35","Base Attack Time: 1.2\/1.1\/1 ( 1\/0.9\/0.8)","Health Regen Bonus: 50\/75\/100 ( 80\/105\/130)","Mana Regen Bonus: 4\/10\/16","Move Speed Bonus: 40\/50\/60","Rage Duration: 25"],"hot_key":"R","legacy_key":"R"},{"spell":"Alchemist melts down Aghanim's Scepter to grant an allied hero all Aghanim's Scepter upgrades.","effects":["Ability Target Unit","Affects Allied Heroes"],"notes":["Aghanim's Scepter has an active ability for Alchemist, allowing him to cast it on allied heroes (excluding hero clones and illusions). Once cast, the Scepter is destroyed and the targeted ally receives the Ultimate Scepter Consumed buff, which is permanent. This status buff grants the ally the same stats as an Aghanim's Scepter and fully applies any Scepter upgrades on the hero. Alchemist can cast Aghanim's Scepter on himself as well, gaining the stats only, since he has no upgrades. The net worth of the Scepter transfers from Alchemist to the target hero. Self-casting does not change the net worth. Doing so does neither change Alchemist's nor the target's GPM. A hero can only be targeted once by Aghanim's Scepter.","The ability to transfer Aghanim's Scepter is innate to the hero and not the ultimate ability. This means that Alchemist can share Aghanim's Scepters in Ability Draft, regardless of his skills."],"mana":"0","elements":["Partially usable by illusions.","Pierces spell immunity."],"cooldown":"0","name":"Aghanim's Scepter Synth","description":["Cast Range: 600"]},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","The complete area is shaped like an isosceles trapezoid in front of Alchemist.","Fully stacks with other sources of cleaves. Each source of cleave works completely independent.","Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.","Despite the visual effect, cleave damage is applied instantly in the whole area."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Cleave","description":["Starting Radius: 150","Distance: 650","End Radius: 360","Cleave Damage: 40%"]}],"bio":"The sacred science of Chymistry was a Darkbrew family tradition, but no Darkbrew had ever shown the kind of creativity, ambition, and recklessness of young Razzil. However, when adulthood came calling he pushed aside the family trade to try his hand at manufacturing gold through Alchemy. In an act of audacity befitting his reputation, Razzil announced he would transmute an entire mountain into gold. Following two decades of research and spending and preparation, he failed spectacularly, quickly finding himself imprisoned for the widespread destruction his experiment wrought. Yet Razzil was never one to take a setback lightly, and sought escape to continue his research. When his new cellmate turned out to be a fierce ogre, he found just the opportunity he needed. After convincing the ogre not to eat him, Razzil set about carefully concocting a tincture for it to drink, made from the moulds and mosses growing in the prison stone work. In a week's time, it seemed ready. When the ogre drank the potion, it flew into an unstoppable berserker rage, destroying the cell bars and exploding through walls and guards alike. They soon found themselves lost somewhere in the forest surrounding the city with a trail of wreckage in their wake and no signs of pursuit. In the tonic's afterglow, the ogre seemed serene, happy, and even eager. Resolving to work together, the pair set off to collect the materials needed to attempt Razzil's Alchemic transmutation once more.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["At one point during beta, Alchemist's bio consisted entirely of the following sentence: \"Alchemist is named Al and is a chemist.\"","Alchemist's third ability name remained unchanged from its DotA counterpart until after the Diretide event, when it was changed from \"Goblin's Greed\" into \"Greevil's Greed.\"","The Ogre's portion of the Caustic Steel cosmetic set may be a reference to Master Blaster from Mad Max: Beyond The Thunderdome, while the Alchemist's armor and hair are most likely a reference to Edward Elric, one of the two main protagonists of Fullmetal Alchemist.","Acid Spray's sound effect has the same reprocessed sound of Oil Platform building from game Warcraft 2: Tides of Darkness, created by Blizzard.","One of Alchemist's last hit lines \"Only ninety-eight percent pure?\" is a direct reference to AMC's TV series Breaking Bad.","Another of his last hit lines \"Greed is good.\" is a reference to Gordon Gekko's speech in the 1987 film, Wall Street.","Alchemist's line for picking up a Haste Rune \"Run, buddy, run!\" may be a reference to Forrest Gump, since sometime in the movie there is a line \"Run, Forrest, Run!\"","Alchemist's leveling line \" Better living through alchemy!\" is a reference to the phrase \"Better Living Through Chemistry\", a popular variant of a DuPont advertising slogan which later became a common phrase."],"talents":["+30 Chemical Rage Regeneration:-0.2 Chemical Rage Base Attack Time","+400 Unstable Concoction Damage:+40% Cleave","+50 Damage:+400 Health","-7s Unstable Concoction Cooldown:+25 Attack Speed"],"desc":"Razzil Darkbrew, the Alchemist, is a melee strength hero whose alchemical prowess makes him a strange but versatile fighter. He is an unusual carry based upon transmuting killed creeps into large amounts of bonus gold, with both an early game and late game presence due to the enormous health regeneration from his ultimate and the first strike nature of his other spells. His low but balanced attributes and the sure promise of gold for items means he can be one of the most disparately built heroes in the game."}