{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Tome_of_Knowledge_Enlighten.mp3\/revision\/latest?cb=20191227195541",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Прерывает произносимые заклинания при применении.",
        "Первые два Tome of Knowledge дают только 700 базового опыта. Каждый последующий Tome of Knowledge даёт на 135 опыта больше, чем предыдущий. Нет ограничения по росту доп. опыта, поэтому доп. опыт продолжает увеличиваться с каждым Tome of Knowledge, который использует команда.",
        "Нет ограничения по росту доп. опыта, поэтому доп. опыт продолжает увеличиваться с каждым Tome of Knowledge, который использует команда.",
        "Даёт опыт мгновенно.",
        "Нельзя использовать Spirit Bear и курьерами.",
        "Можно использовать, даже имея максимальный уровень, просто израсходовав предмет."
      ],
      "mana": null,
      "abilityName": "Enlighten",
      "cooldown": "0",
      "description": "Даёт 700 базового опыта + 135 опыта за каждое предыдущее применение этого предмета в вашей команде, не считая первых двух.",
      "params": [
        "Базовый опыт: 700",
        "Доп. опыт за предыдущее использование: 135"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Tome of Knowledge не складывается в инвентаре. Каждый Tome of Knowledge занимает отдельную ячейку.",
    "Tome of Knowledge полностью передаваемый предмет."
  ],
  "cost": "75",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Tome of Knowledge",
  "description": "Источник силы, превращающей зверя в человека, а человека — в бога.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Tome of Knowledge достаточно дешёвый предмет из-за количества опыта, которое он даёт, поэтому необходимо покупать и использовать его, как только он станет доступным в магазине.",
    "Так как для повышения уровня героя требуется всё больше и больше опыта, то использовать предмет лучше на героях с низким уровнем. Например, герой почти 5 уровня может использовать Tome of Knowledge, чтобы получить 6 уровень, в то время как герой 24 уровня может получить только около 1\/3 уровня.",
    "Tome of Knowledge лучше использовать союзнику, который не достиг 6 уровня. Герой, получивший 6-й уровень, сможет реализовать свою ультимативную способность, например, для убийства вражеского героя.",
    "Дальнейшее использование Tome of Knowledge спорно. Tome of Knowledge можно использовать для того, чтобы получить дальнейший уровень или помочь союзным героям с маленьким уровнем догнать высокоуровневых героев. В общем, Tome of Knowledge нужно использовать для получения ключевых уровней вам и вашим напарникам, а именно таких основных, как 6\/12\/18 (для ультимейтов) и 10\/15\/20\/25 (для талантов). Имейте в виду, что некоторые ультимейты\/таланты могут оказаться гораздо полезнее, чем другие."
  ]
}