{
  "abilities": [
    {
      "notes": [
        "Талант на ловкость в общем даёт Razor: 1,5 брони, 9 скорости атаки и 9 урона от атаки.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на силу в общем даёт Razor: 280 здоровья и 1,4 регенерации здоровья.",
        "Талант на броню не дается иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 к целям ударов Eye of the Storm",
          "talentRight": "+80 к скорости атаки"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-0,1 сек. интервала разрядов Eye of the Storm",
          "talentRight": "+8 к броне"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+14 к силе",
          "talentRight": "+5 к урону в секунду у Static Link"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+9 к ловкости",
          "talentRight": "+175 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Razor_Plasma_Field_1.mp3\/revision\/latest?cb=20191216022243",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Plasma Field прерывает произносимые способности Razor.",
        "Plasma Field закреплена за героем и перемещается вместе с ним. Круг расширяется и сужается со скоростью 636 единиц; требуется 1,1 секунды для максимального расширения.",
        "Дает летающий обзор в радиусе 700 единиц на 2,2 секунды, следующий за героем и оставляющий след обзора, длящийся 2 секунды.",
        "Область поражения Plasma Field представляет собой кольцо радиусом в 200 единиц, находящееся прямо перед видимым кольцом. То есть при использовании эффект мгновенно поражает существ в радиусе 200. При расширении задевает существ на расстоянии до 900. При возвращении эффект применяется после прохождения сквозь существ. Урон и замедление применяются при расширении и возвращении волны, поэтому способность может поразить каждого врага дважды. Дебафф замедления складывается.",
        "То есть при использовании эффект мгновенно поражает существ в радиусе 200.",
        "При расширении задевает существ на расстоянии до 900.",
        "При возвращении эффект применяется после прохождения сквозь существ.",
        "Урон и замедление применяются при расширении и возвращении волны, поэтому способность может поразить каждого врага дважды. Дебафф замедления складывается."
      ],
      "mana": "125",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10",
      "description": "Герой высвобождает волну энергетической плазмы, которая затем возвращается к нему. Волна замедляет врагов и наносит им урон: чем дальше она от владельца, тем замедление и урон сильнее. Волна наносит урон дважды, при движении в обе стороны.",
      "spellName": "Plasma Field",
      "params": [
        "Анимация применения: 0+0",
        "Макс. радиус: 700",
        "Ширина урона: 200",
        "Минимальный урон: 35\/40\/45\/50",
        "Максимальный урон: 80\/115\/150\/185",
        "Мин. замедление скорости передвижения: 5%",
        "Макс. замедление скорости передвижения: 25%\/30%\/35%\/40%",
        "Длительность замедления: 1,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Плазменная мощь держит загробный мир во власти призрака молний."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f2\/Razor_Static_Link.mp3\/revision\/latest?cb=20191216022229",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев \/ Себя"
      ],
      "notes": [
        "Static Link разрывается, если существо под действием способности умирает или расстояние от него до Razor превышает 800. Иные варианты не смогут разорвать связь. Расстояние между Razor и целью проверяется перед каждым интервалом кражи урона. Если расстояние превышено при проверке, связь разорвется. Поскольку связь использует дальность применения способности, то эффекты, увеличивающие дальности, влияют на её дальность.",
        "Расстояние между Razor и целью проверяется перед каждым интервалом кражи урона. Если расстояние превышено при проверке, связь разорвется.",
        "Поскольку связь использует дальность применения способности, то эффекты, увеличивающие дальности, влияют на её дальность.",
        "Static Link при похищении урона дает общий обзор на цель. Продолжит похищать урон, даже если урон цели достиг 0.",
        "Продолжит похищать урон, даже если урон цели достиг 0.",
        "Вытягивает 1,75\/3\/4,25\/5,5 (TagTalent 3\/4,25\/5,5\/6,75) урона с интервалом в 0,25 секунды спустя 0,25 секунды после применения, срабатывая 20\/24\/28\/32 раз. Крадет до 35\/72\/119\/176 (TagTalent 60\/102\/154\/216) урона, если его вытягивали всю длительность.",
        "Крадет до 35\/72\/119\/176 (TagTalent 60\/102\/154\/216) урона, если его вытягивали всю длительность.",
        "Static Link отдает Razor приказ на атаку цели при применении и с каждым приказом на передвижение. Способность позволяет Razor перемещаться при атаке цели. Для отмены атак при передвижении Razor нужно отдать приказ на выбор существа или точки на земле, не связанный с перемещением или атакой.",
        "Способность позволяет Razor перемещаться при атаке цели.",
        "Для отмены атак при передвижении Razor нужно отдать приказ на выбор существа или точки на земле, не связанный с перемещением или атакой.",
        "Можно применять на героев, иллюзии и крипов-героев.",
        "Несколько применений Static Link действуют отдельно друг от друга, размещая за каждое применение дебафф на цель и бафф на Razor. При этом модификатор обзора не складывается. Он исчезнет, как только закончится первая связь. При движении совершает атаки только по первой цели заклинания.",
        "При этом модификатор обзора не складывается. Он исчезнет, как только закончится первая связь.",
        "При движении совершает атаки только по первой цели заклинания."
      ],
      "mana": "65",
      "hotKey": "W",
      "cooldown": "40\/35\/30\/25",
      "description": "Создаёт электрическую связь с выбранным вражеским героем, передавая его урон от атак владельцу способности. Пока связь действует, атаки не прерывают передвижение.",
      "spellName": "Static Link",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 550",
        "Доп. дальность разрыва: 250",
        "Скорость похищения урона: 7\/12\/17\/22 (TagTalent 12\/17\/22\/27)",
        "Длительность связи: 5\/6\/7\/8",
        "Длительность эффекта: 15\/16\/17\/18"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Полярность призрака молний тянет к нему электричество, высасывая силы из противоположностей."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя (TagAghanim Врагов)",
        "Урон Магический"
      ],
      "notes": [
        "С Aghanim's Shard срабатывает только при попадании атаки вражеского существа в Razor независимо от расстояния. То есть способность не срабатывает от промахнувшихся атак. Не срабатывает от атак построек и вардов. Срабатывает от союзных атак. Срабатывание активируется союзником, но способность всё равно выбирает вторичными цели врагов. Также срабатывает от направленных на Razor заклинаний, включая направленные на точку с возможностью выбора существа. То есть способность не следует спискам механик «Отражение заклинаний» и «Блокировка заклинаний». Способности со снарядами активируют Storm Surge при запуске, а не при попадании.",
        "Не срабатывает от атак построек и вардов.",
        "Срабатывает от союзных атак. Срабатывание активируется союзником, но способность всё равно выбирает вторичными цели врагов.",
        "Также срабатывает от направленных на Razor заклинаний, включая направленные на точку с возможностью выбора существа.",
        "То есть способность не следует спискам механик «Отражение заклинаний» и «Блокировка заклинаний». Способности со снарядами активируют Storm Surge при запуске, а не при попадании.",
        "Эффект Storm Surge применяется после активировавшей его способности. То есть, если существо умрет от урона, то его способность всё равно сработает.",
        "То есть, если существо умрет от урона, то его способность всё равно сработает.",
        "Радиус поиска закреплен за существом, на которое сработал эффект, а не за Razor. Цели выбираются случайно без каких-либо приоритетов. Если эффект активирован атакой, то он не выбирает вторичными целями невидимых врагов и врагов в тумане войны. Если эффект активирован способностью, то он выбирает вторичными целями невидимых врагов и врагов в тумане войны.",
        "Цели выбираются случайно без каких-либо приоритетов.",
        "Если эффект активирован атакой, то он не выбирает вторичными целями невидимых врагов и врагов в тумане войны.",
        "Если эффект активирован способностью, то он выбирает вторичными целями невидимых врагов и врагов в тумане войны.",
        "Storm Surge сначала наносит урон, затем применяет дебафф.",
        "Storm Surge использует псевдослучайное распределение"
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Пассивно увеличивает скорость передвижения владельца.",
      "spellName": "Storm Surge",
      "params": [
        "Доп. скорость передвижения: 12%\/16%\/20%\/24%",
        "Шанс срабатывания молнии: 18%",
        "Радиус поиска: 900",
        "Число целей: 3",
        "Урон: 150",
        "Замедление скорости передвижения: 50%",
        "Длительность замедления: 1,5",
        "Бьёт молнией тех, кто нападает на владельца способности, и ещё до 2 врагов рядом. Этот эффект всегда срабатывает, когда героя выбирают целью заклинания, и с шансом в 18%, когда его атакуют. Молния наносит 150 урона и замедляет жертв на 50% на 1,5 секунды.",
        "Молнии не срабатывают, если источник невосприимчив к магии. Не выбирает невосприимчивых существ в качестве вторичных целей.",
        "Дополнительная скорость передвижения и молнии отключаются истощением.",
        "Дополнительная скорость передвижения действует на иллюзии. Иллюзии не выпускают молнии."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "Кто приблизится к призраку молний, в ответ получит шоковую терапию."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Razor_Eye_of_the_Storm_1.mp3\/revision\/latest?cb=20191216022238",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "При применении прерывает произносимые способности Razor.",
        "Eye of the Storm всегда выбирает первой целью существо с наименьшим текущим здоровьем в области действия. Если в области действия несколько существ с одинаково низким здоровьем, то Eye of the Storm выберет среди них цель случайно. Способность отдает приоритет врагам под действием модификатора обзора от Static Link, поражая их в первую очередь (даже при наличии других существ в радиусе действия), независимо от значения здоровья. При наличии в радиусе действия нескольких врагов под действием модификатора обзора способность будет случайно выбирать между ними при каждом ударе.",
        "Если в области действия несколько существ с одинаково низким здоровьем, то Eye of the Storm выберет среди них цель случайно.",
        "Способность отдает приоритет врагам под действием модификатора обзора от Static Link, поражая их в первую очередь (даже при наличии других существ в радиусе действия), независимо от значения здоровья.",
        "При наличии в радиусе действия нескольких врагов под действием модификатора обзора способность будет случайно выбирать между ними при каждом ударе.",
        "С Aghanim's Scepter только одна молния будет бить цель под модификатором обзора. Молнии не поражают одновременно одну и ту же цель. Если у двух врагов присутствует модификатор обзора, то каждая молния будет бить свою цель. При атаках отдает приоритет существам вместо построек и игнорирует постройки для статуй. Не снижает броню построек.",
        "Если у двух врагов присутствует модификатор обзора, то каждая молния будет бить свою цель.",
        "При атаках отдает приоритет существам вместо построек и игнорирует постройки для статуй.",
        "Не снижает броню построек.",
        "Разряды не являются ни обычными атаками, ни мгновенными, поэтому они игнорируют уклонение и блокировку урона. Также они не могут активировать эффекты, срабатывающие от удара — (TagTalent Counter Helix, Moment of Courage и Reactive Armor), и не сбрасывает перезарядку Tranquil Boots. Разряды сначала наносят урон, затем снижают броню.",
        "Также они не могут активировать эффекты, срабатывающие от удара — (TagTalent Counter Helix, Moment of Courage и Reactive Armor), и не сбрасывает перезарядку Tranquil Boots.",
        "Разряды сначала наносят урон, затем снижают броню.",
        "Дебафф снижения брони длится столько же, сколько и сама способность, либо до смерти Razor.",
        "Не действует на курьеров, Рошана, невидимых существ и существ в тумане войны.",
        "Eye of the Storm ударяет до 42\/50\/60 (TagTalent 50\/60\/75) раз и наносит до 2520\/3750\/5400 (TagTalent 3000\/4500\/6750) урона цели (до уменьшений).",
        "Когда Razor становится невидимым, туча и молнии от нее тоже становятся невидимыми, но продолжают бить по ближайшим врагам, не становясь видимыми или слышимыми для них.",
        "Eye of the Storm при смерти Razor мгновенно заканчивается."
      ],
      "mana": "100\/150\/200",
      "hotKey": "R",
      "cooldown": "80\/70\/60",
      "description": "Собирает над героем грозовую тучу, которая бьёт молнией врага с наименьшим здоровьем, нанося ему урон и снижая его броню.",
      "spellName": "Eye of the Storm",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 500",
        "Число целей: 1 (TagTalent 2) (TagTalent 2, 3)",
        "Интервал ударов: 0,7\/0,6\/0,5 (TagTalent 0,6\/0,5\/0,4)",
        "Урона за удар: 60\/75\/90",
        "Снижение брони за удар: 1",
        "Длительность: 30",
        "Позволяет способности наносить урон башням, казармам и Древним, а также атаковать сразу две цели."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Как гром среди ясного неба."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.6,
    "attrAgility": 22.0
  },
  "description": "Razor — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Он имеет четыре способности, три из которых активные и одна пассивная. Его первая способность, Plasma Field, высвобождает волну энергетической плазмы, которая через некоторое время возвращается к герою. При движении в обе стороны волна наносит урон и замедляет врагов: чем дальше она от владельца, тем урон с замедлением сильнее. Вторая способность, Static Link, создает электрическое соединение между героем и врагом, воруя урон от атак у цели и передавая его герою. Пассивная способность, Storm Surge, даёт герою дополнительную скорость передвижения. Ультимативной способностью, Eye of the Storm, герой вызывает разрушительную грозу, которая бьет врагов с наименьшим здоровьем, нанося им урон и уменьшая их броню.",
  "history": "Никто из легендарных обитателей загробного мира не внушает такой страх, как призрак молний. Держа наготове свою молниеносную плеть, он охраняет порядок в Узком лабиринте, коварные и cпутанные коридоры которого направляют мёртвые души к судьбе, достойной их ума, способностей и упорства. Надзиратель парит над лабиринтом, выискивает замешкавшихся и стегает их обжигающим электрическим хлыстом. Судьба душ вершится их же руками, а разряды молний лишь подгоняют их либо к свету в конце тоннеля, либо к тёмным пучинам вечности. Беспристрастный и почти безразличный в применении силы призрак молний — извечное воплощение господства. Однако по его высокомерным манерам можно догадаться, что он получает от работы сардоническое удовольствие.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 к целям ударов Eye of the Storm",
      "talentRight": "+80 к скорости атаки"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-0,1 сек. интервала разрядов Eye of the Storm",
      "talentRight": "+8 к броне"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+14 к силе",
      "talentRight": "+5 к урону в секунду у Static Link"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+9 к ловкости",
      "talentRight": "+175 к здоровью"
    }
  ]
}