{
  "abilities": [
    {
      "notes": [
        "The cooldown reduction talent stacks multiplicatively with other sources cooldown reduction."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "30% Cooldown Reduction",
          "talentRight": "-4 Presence Aura Armor"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+120 Shadowraze Damage",
          "talentRight": "+3 Damage Per Soul"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25 Movement Speed",
          "talentRight": "Presence Aura Affects Building"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Attack Speed",
          "talentRight": "+6% Spell Amplification"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Shadow_Fiend_Shadowraze.mp3\/revision\/latest?cb=20191216022921",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Leveling one of the Shadowraze abilities levels the others (Medium and Far) as well. This ability is not available in Ability Draft.",
        "This ability is not available in Ability Draft.",
        "Shadowraze (Near) blasts a 250 radius area 200 range in front of Nevermore upon cast. This means that it can hit units up to 50 range behind Shadow Fiend, and up to 450 range in front of him.",
        "This means that it can hit units up to 50 range behind Shadow Fiend, and up to 450 range in front of him.",
        "Places one hidden debuff on the enemy. This debuff counts how many Shadowrazes hit the target within its duration. Shadowraze first sets its damage based on current stacks, then applies the debuff or increases the stack count, and then deals the damage. This means the stack added by the raze does not affect the ability's damage. A number on the icon shows how many times the debuff was refreshed, including the first cast. The debuff has no stack limit and can be increased infinitely.",
        "Shadowraze first sets its damage based on current stacks, then applies the debuff or increases the stack count, and then deals the damage.",
        "This means the stack added by the raze does not affect the ability's damage.",
        "A number on the icon shows how many times the debuff was refreshed, including the first cast.",
        "The debuff has no stack limit and can be increased infinitely.",
        "Hitting all three razes consecutively can deal up to 420\/660\/900\/1140 (TagTalent 780\/1020\/1260\/1500) damage to a single unit (before reductions).",
        "A hidden debuff is placed on heroes is used to count successive Shadowraze hits. It lasts for 3 seconds. Although only the Demon Eater cosmetic item makes use of it, the counter is always placed.",
        "Although only the Demon Eater cosmetic item makes use of it, the counter is always placed."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "Q",
      "cooldown": "10 (TagTalent 7)",
      "description": "Shadow Fiend razes the ground directly in front of him, dealing damage to enemy units in the area. Adds a stacking damage amplifier on the target that causes the enemy to take bonus Shadow Raze damage per stack.",
      "spellName": "Shadowraze (Near)",
      "params": [
        "Cast Animation: 0.55+0",
        "Distance: 200",
        "Radius: 250",
        "Base Damage: 90\/160\/230\/300 (TagTalent 210\/280\/350\/420)",
        "Damage Increase per Stack: 50\/60\/70\/80",
        "Stack Duration: 8",
        "Debuff persists if placed before spell immunity and when not dispelled.",
        "Nevermore's trademark for harvesting souls."
      ],
      "itemBehaviour": [],
      "legacyKey": "Z",
      "story": "Nevermore's trademark for harvesting souls."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Shadow_Fiend_Shadowraze.mp3\/revision\/latest?cb=20191216022921",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Leveling one of the Shadowraze abilities levels the others (Near and Far) as well.",
        "In Ability Draft, Shadowraze (Medium) is a stand-alone ability that comes with 3 charges, and does not come with the other Shadowraze abilities.",
        "Shadowraze (Medium) blasts a 250 radius area 450 range in front of Nevermore upon cast. This means that it can hit units from 200 to 700 range in front of Shadow Fiend.",
        "This means that it can hit units from 200 to 700 range in front of Shadow Fiend.",
        "Other notes from Shadowraze (Near) fully apply."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "W",
      "cooldown": "10 (TagTalent 7)",
      "description": "Shadow Fiend razes the ground a short distance away from him, dealing damage to enemy units in the area. Adds a stacking damage amplifier on the target that causes the enemy to take bonus Shadow Raze damage per stack.",
      "spellName": "Shadowraze (Medium)",
      "params": [
        "Cast Animation: 0.55+0",
        "Distance: 450",
        "Radius: 250",
        "Base Damage: 90\/160\/230\/300 (TagTalent 210\/280\/350\/420)",
        "Damage Increase per Stack: 50\/60\/70\/80",
        "Stack Duration: 8",
        "Debuff persists if placed before spell immunity and when not dispelled.",
        "Nevermore's trademark for harvesting souls."
      ],
      "itemBehaviour": [],
      "legacyKey": "X",
      "story": "Nevermore's trademark for harvesting souls."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Shadow_Fiend_Shadowraze.mp3\/revision\/latest?cb=20191216022921",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Leveling one of the Shadowraze abilities levels the others (Near and Medium) as well. This ability is not available in Ability Draft.",
        "This ability is not available in Ability Draft.",
        "Shadowraze (Far) blasts a 250 radius area 700 range in front of Nevermore upon cast. This means that it can hit units from 450 to 950 range in front of Shadow Fiend.",
        "This means that it can hit units from 450 to 950 range in front of Shadow Fiend.",
        "Other notes from Shadowraze (Near) fully apply."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "E",
      "cooldown": "10 (TagTalent 7)",
      "description": "Shadow Fiend razes the ground a longer distance away from him, dealing damage to enemy units in the area. Adds a stacking damage amplifier on the target that causes the enemy to take bonus Shadow Raze damage per stack.",
      "spellName": "Shadowraze (Far)",
      "params": [
        "Cast Animation: 0.55+0",
        "Distance: 700",
        "Radius: 250",
        "Base Damage: 90\/160\/230\/300 (TagTalent 210\/280\/350\/420)",
        "Damage Increase per Stack: 50\/60\/70\/80",
        "Stack Duration: 8",
        "Debuff persists if placed before spell immunity and when not dispelled.",
        "Nevermore's trademark for harvesting souls."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Nevermore's trademark for harvesting souls."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Can get souls from every unit, including wards and allies, excluding allied Observer and Sentry Wards, illusions, Tempest Doubles and buildings. The number of current souls is visible on the status buff icon.",
        "The number of current souls is visible on the status buff icon.",
        "If Shadow Fiend has an odd number of souls upon death, the number of lost souls is rounded down. This means that he never can lose all his souls. He still keeps 1 soul, even when dying while only having 1 soul. No souls are lost while reincarnating.",
        "This means that he never can lose all his souls. He still keeps 1 soul, even when dying while only having 1 soul.",
        "No souls are lost while reincarnating.",
        "Despite the visual effects, Shadow Fiend instantly gains the soul and thus the damage of killed units. The more souls Shadow Fiend has, the more red particles fly around his chest area.",
        "The more souls Shadow Fiend has, the more red particles fly around his chest area.",
        "Can grant a total of 11\/28\/51\/80 (TagTalent 44\/70\/102\/140) attack damage with maximum amount of souls..",
        "With Aghanim's Scepter, grants a total of 25\/50\/75\/100 (TagTalent 100\/125\/150\/175) attack damage with maximum amount of souls. The extra souls from Aghanim's Scepter affect the number of lines created by Requiem of Souls. When dropping Aghanim's Scepter, Shadow Fiend keeps his souls even when having more than the default allowed amount. Requiem of Souls still releases more lines even when not holding Aghanim's Scepter in this case. However, the attack damage bonus adapts immediately and does not account the extra souls when not having the item equipped.",
        "The extra souls from Aghanim's Scepter affect the number of lines created by Requiem of Souls.",
        "When dropping Aghanim's Scepter, Shadow Fiend keeps his souls even when having more than the default allowed amount.",
        "Requiem of Souls still releases more lines even when not holding Aghanim's Scepter in this case.",
        "However, the attack damage bonus adapts immediately and does not account the extra souls when not having the item equipped."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Shadow Fiend steals the soul from units he kills, gaining bonus damage. On death, he releases half of them from bondage.",
      "spellName": "Necromastery",
      "params": [
        "Max Souls: 11\/14\/17\/20 (TagTalent 25)",
        "Soul Gain Kill: 1",
        "Attack Damage Bonus per Soul: 1\/2\/3\/4 (TagTalent 4\/5\/6\/7)",
        "Soul Loss on Death: 40%",
        "Increases Necromastery Max Souls.",
        "Prevents gaining new stacks. Already existing stacks still provide their bonuses.",
        "Illusions start with 0 souls. Illusions can gather souls for themselves, but cannot make use of the raw bonus damage.",
        "Harvested souls swirl in and out of the Abysm, empowering the Shadow Fiend to increase the size of his collection."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "Harvested souls swirl in and out of the Abysm, empowering the Shadow Fiend to increase the size of his collection."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Enemies"
      ],
      "notes": [
        "The armor and magic resistance reduction is provided by an aura. Its debuff lingers for 0.5 seconds.",
        "Does not affect enemies which have no vision over Shadow Fiend. With the level 15 talent, the aura affects buildings.",
        "With the level 15 talent, the aura affects buildings."
      ],
      "mana": null,
      "hotKey": "F",
      "cooldown": null,
      "description": "Shadow Fiend's presence reduces the armor of nearby enemies.",
      "spellName": "Presence of the Dark Lord",
      "params": [
        "Radius: 1200",
        "Armor Reduction: 4\/5\/6\/7 (TagTalent 8\/9\/10\/11)",
        "Aura Linger Duration: 0.5",
        "Magic Resistance Reduction: 14%",
        "Presence of the Dark Lord also reduces enemies' magic resistance by 14%.",
        "Even being near Nevermore eats away at one's soul."
      ],
      "itemBehaviour": [],
      "legacyKey": "P",
      "story": "Even being near Nevermore eats away at one's soul."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Shadow_Fiend_Requiem_of_Souls_1.mp3\/revision\/latest?cb=20191216022919",
      "effects": [
        "Ability No Target",
        "Affects Enemies (TagAghanim Self)",
        "Damage Magical"
      ],
      "notes": [
        "Shadow Fiend becomes phased while casting this ability.",
        "The damage is entirely based on the amount of souls gathered with Necromastery. In Ability Draft, Necromastery must be drafted as well for Requiem of Souls to work.",
        "In Ability Draft, Necromastery must be drafted as well for Requiem of Souls to work.",
        "The damaging lines have the following mechanics: The area of every single damaging line is shaped like a cone. The distance between the damaging lines is always even. One line is always released towards east and the others adapt accordingly. The damaging lines travel at a speed of 700, taking 1.43 seconds to reach the max distance. With the travel distance and end width, the damaging lines can hit units up to 1350 range away. Each damaging line cannot hit the same unit more than once per cast upon expanding and returning respectively.",
        "The area of every single damaging line is shaped like a cone.",
        "The distance between the damaging lines is always even. One line is always released towards east and the others adapt accordingly.",
        "The damaging lines travel at a speed of 700, taking 1.43 seconds to reach the max distance.",
        "With the travel distance and end width, the damaging lines can hit units up to 1350 range away.",
        "Each damaging line cannot hit the same unit more than once per cast upon expanding and returning respectively.",
        "Fears and reduces the movement speed of all enemy units hit by the damaging lines of Requiem of Souls. The duration increases by 0.8 per each line hit, but is capped at 2.4 seconds. Requiem of Souls's fear makes affected enemies run away from the caster, rather than make them run towards their team's fountain.",
        "The duration increases by 0.8 per each line hit, but is capped at 2.4 seconds.",
        "Requiem of Souls's fear makes affected enemies run away from the caster, rather than make them run towards their team's fountain.",
        "The expanding lines can deal up to 1600\/2400\/3200 damage to a single unit (before reductions), with max souls if all lines hit.",
        "The lines first apply the damage, then the debuff.",
        "Upon death, Requiem of Souls is cast automatically and instantly, regardless of mana and cooldown. Shadow Fiend first loses 40% of his souls before this happens. So this passive requiem can only have 4\/5\/6\/8\/10 lines at max. This on-death Requiem of Souls does not apply fear, but does apply the movement speed slow. Reincarnation does not trigger on-death Requiem of Souls this way. Also, Aghanim's Scepter does not upgrade the on-death Requiem of Souls.",
        "Shadow Fiend first loses 40% of his souls before this happens. So this passive requiem can only have 4\/5\/6\/8\/10 lines at max.",
        "This on-death Requiem of Souls does not apply fear, but does apply the movement speed slow.",
        "Reincarnation does not trigger on-death Requiem of Souls this way.",
        "Also, Aghanim's Scepter does not upgrade the on-death Requiem of Souls.",
        "With Aghanim's Scepter, after the lines reach their max distance, each line starts moving back to Shadow Fiend. Despite the visual effects, the lines do not \"respawn\" around Shadow Fiend. They start moving back exactly where they stopped. The lines return to Shadow Fiend's current location, not to the location he originally cast the spell from. The lines do not follow if Shadow Fiend moves. Once they started to return, their path cannot be further altered. The max travel distance applies to the lines also upon returning, meaning they travel a total distance of 2000. The width of the lines is reversed upon returning: They start with maximum width and get thinner towards the end. The returning lines deal 40% damage. They hit all units regularly like the expanding lines and also apply the movement speed slow and fear debuff.",
        "Despite the visual effects, the lines do not \"respawn\" around Shadow Fiend. They start moving back exactly where they stopped.",
        "The lines return to Shadow Fiend's current location, not to the location he originally cast the spell from.",
        "The lines do not follow if Shadow Fiend moves. Once they started to return, their path cannot be further altered.",
        "The max travel distance applies to the lines also upon returning, meaning they travel a total distance of 2000.",
        "The width of the lines is reversed upon returning: They start with maximum width and get thinner towards the end.",
        "The returning lines deal 40% damage. They hit all units regularly like the expanding lines and also apply the movement speed slow and fear debuff.",
        "The returning lines can deal up to 800\/1200\/1600 damage to a single unit (before reductions), if all lines hit. Together with the expanding lines, it can deal up to 2800\/4200\/5600 damage to a single unit (before reductions).",
        "Together with the expanding lines, it can deal up to 2800\/4200\/5600 damage to a single unit (before reductions).",
        "The heal is based on the damage dealt by the returning lines, not by the initial expanding lines. The heal is applied as soon as the lines stop moving. Only and will always heal for 32\/48\/64 per hero hit regardless of how much damage is actually dealt to heroes, including illusions.",
        "The heal is applied as soon as the lines stop moving.",
        "Only and will always heal for 32\/48\/64 per hero hit regardless of how much damage is actually dealt to heroes, including illusions."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "120\/110\/100 (TagTalent 84\/77\/70)",
      "description": "Shadow Fiend gathers his captured souls to release them as lines of demonic energy. Units near Shadow Fiend when the souls are released can be damaged by several lines of energy. Any unit damaged by Requiem of Souls will be feared and have its movement speed reduced for 0.8 seconds for each line hit. Lines of energy are created for every 1 souls captured through Necromastery. Requiem of Souls is automatically cast whenever Shadow Fiend dies, regardless of its cooldown.",
      "spellName": "Requiem of Souls",
      "params": [
        "Cast Animation: 1.67+0.77",
        "Damage Lines Travel Distance: 1000",
        "Damage Lines Starting Width: 125",
        "Damage Lines End Width: 350",
        "Necromastery Souls Required per Line: 1",
        "Damage per Line on Release: 80\/120\/160",
        "Move Speed Slow: 25%",
        "Debuff Duration per Line: 0.8",
        "Max Debuff Duration: 2.4",
        "Damage per Line on Return: 32\/48\/64",
        "Heal per Hit Hero on Return: 32\/48\/64",
        "Increases Necromastery Max Souls and causes Requiem of Souls to return back to Shadow Fiend. The wave back to Shadow Fiend deals less damage, but heals Shadow Fiend for all the damage it dealt.",
        "The passive cast upon death is not disabled by Break.",
        "The captured souls of those past slain are released to ravage their former allies."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "The captured souls of those past slain are released to ravage their former allies."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.7,
    "attrStrength": 19.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 3.5,
    "attrAgility": 20.0
  },
  "description": "Nevermore, the Shadow Fiend, is a ranged agility hero possessing abilities that inflict superb burst damage from varying distances. Whether near or far, Shadow Fiend is able to release incredible offensive power, both physical and magical. Shadow Fiend's true power comes from the souls he takes, making him more dangerous every time he kills. With enough souls, he can release all of the captured souls in a devastating burst, dealing more damage to enemies that are closer to him. Shadow Fiend is a carry who is powerful at all stages of the game, a trait most carries don't share. He can harass and conquer the early game, gank unsuspecting heroes during the mid-stages of the game, and has huge right-click potential in the late game thanks to his passives, although his active abilities scale off by the end-game.",
  "history": "It is said that Nevermore the Shadow Fiend has the soul of a poet, and in fact he has thousands of them. Over the ages he has claimed the souls of poets, priests, emperors, beggars, slaves, philosophers, criminals and (naturally) heroes; no sort of soul escapes him. What he does with them is unknown. No one has ever peered into the Abysm whence Nevermore reaches out like an eel from among astral rocks. Does he devour them one after another? Does he mount them along the halls of an eldritch temple, or pickle the souls in necromantic brine? Is he merely a puppet, pushed through the dimensional rift by a demonic puppeteer? Such is his evil, so intense his aura of darkness, that no rational mind may penetrate it. Of course, if you really want to know where the stolen souls go, there's one sure way to find out: Add your soul to his collection. Or just wait for Nevermore.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "30% Cooldown Reduction",
      "talentRight": "-4 Presence Aura Armor"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+120 Shadowraze Damage",
      "talentRight": "+3 Damage Per Soul"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25 Movement Speed",
      "talentRight": "Presence Aura Affects Building"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Attack Speed",
      "talentRight": "+6% Spell Amplification"
    }
  ]
}