{
  "abilities": [
    {
      "notes": [
        "Перекрестие указателя должно выделять вражеское существо",
        "Основная цель получает как базовый урон, так и урон по области, получая в итоге 120\/200\/280\/360 ( 270\/350\/430\/510) единиц урона (до уменьшений)",
        "Frost Blast сначала наносит урон по области, затем применяет дебафф, затем наносит урон по цели",
        "Во время применения   Sinister Gaze Frost Blast не имеет времени применения и не требует поворота к цели"
      ],
      "item_behaviour": [],
      "description": "Обдаёт указанного врага морозом, нанося урон в области действия и замедляя передвижение и атаку всех задетых противников на 4 сек. Основная цель получает как базовый урон, так и урон по площади, а её атаки замедляются ещё сильнее.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,93",
        "Дальность применения: 600",
        "Радиус: 200 ( 350)",
        "Урон по основной цели: 40\/80\/120\/160",
        "Урон по области: 80\/120\/160\/200 ( 230\/270\/310\/350)",
        "Замедление скорости передвижения: 30%",
        "Замедление скорости атаки: 30\/40\/50\/60",
        "Длительность замедления: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Lich_Frost_Blast.mp3\/revision\/latest?cb=20191216015318",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "7 (TagTalent 4)",
      "aghanim": null,
      "name": "Frost Blast",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "V",
      "story": "Маг льда Этриан не забыл даже простейших манипуляций со льдом."
    },
    {
      "notes": [
        "Можно применить на любое союзное существо, исключая неуязвимые варды\n Можно применить на любые другие варды (например,  Ice Spire), постройки и неуязвимых союзников\n ↓↓ Двойное нажатие автоматически выбирает себя",
        "Накладывает общее уменьшение входящего урона на цель\n Сочетается аддиктивно с другими источниками общего уменьшения входящего урона\n Уменьшение урона действует только на урон от атаки любого типа, но не взаимодействует с физическим уроном заклинаний Работает только против геройского урона (включая клонов и иллюзии, исключая крипов-героев)",
        "Щит не задевает невидимых врагов или врагов в тумане войны",
        "Срабатывает с интервалом в 1 сек\n спустя 0,1 сек\n после применения, испуская 6 ( 10) импульсов",
        "Все импульсы наносят до 120\/180\/240\/300 ( 200\/300\/400\/500) урона каждому врагу (до уменьшений)",
        "Импульс сначала наносит урон, затем применяет дебафф замедления",
        "Повторные применения на одну и ту же цель не складываются, но обновляют длительность и сбрасывают интервал импульсов",
        "Дающий восстановление здоровье  талант полностью работает на постройки\n Восстанавливает до 300 ( 500) здоровья за всю длительность\n Выбор таланта не обновляет уже применённые Frost Shields",
        "Во время применения   Sinister Gaze Frost Blast не имеет времени применения и не требует поворота к цели"
      ],
      "item_behaviour": [],
      "description": "Накладывает на цель магический ледяной щит, уменьшая урон от атак по ней. Пока щит действует, он раз в секунду наносит 20\/30\/40\/50 магического урона вражеским существам вокруг и замедляет их.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,93",
        "Дальность применения: 1000",
        "Уменьшение урона от атак: 30%\/40%\/50%\/60% ( 40%\/50%\/60%\/70%)",
        "Радиус: 600",
        "Интервал: 1",
        "Урон: 20\/30\/40\/50",
        "Замедление скорости передвижения: 20%\/25%\/30%\/35%",
        "Длительность замедления: 0,5",
        "Длительность щита: 6 ( 10)",
        "Доп\n регенерация здоровья:  50"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/59\/Lich_Frost_Shield_1.mp3\/revision\/latest?cb=20191216015320",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Врагов"
      ],
      "mana": "30\/25\/20\/15",
      "aghanim": null,
      "name": "Frost Shield",
      "cooldown": "100\/110\/120\/130",
      "legacy_key": "F",
      "story": "Магия, которая защищала Этриана ещё в смертной жизни, с годами стала лишь морознее."
    },
    {
      "notes": [
        "Гипнотизирует цель, заставляя двигаться к Lich, запрещая действия и раскрывая её невидимость",
        "Приравнивает скорость передвижения цели к 32%\/38%\/44%\/50% от расстояния между ней и Lich\n Скорость устанавливается при применении\n Если цель передвинули или телепортировали, то скорость не адаптируется\n При использовании на максимальной дальности применения скорость передвижения равна 137,14 ( 101,05)\n Позволяет цели перемещаться по непроходимой территории, поэтому она может двигаться через возвышенности, деревья и других существ",
        "Вытягивает 0,714%\/0,882%\/1%\/1,087% ( 0,526%\/0,682%\/0,8%\/0,893%) от текущей маны с интервалом в 0,1 секунды сразу после начала произнесения, срабатывая 15\/18\/21\/24 ( 20\/23\/26\/29) раз\n Вытягивает до 10,19%\/14,75%\/19,03%\/23,07% ( 10,02%\/14,56%\/18,85%\/22,9%) от текущей маны цели, если больше ничего с маной не происходило",
        "Не даёт никакого обзора, кроме раскрытия невидимости цели\n При этом уход в туман войны не отменяет Sinister Gaze",
        "В конце произнесения деревья в радиусе 200 от цели разрушаются",
        "<span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter превращает Sinister Gaze в заклинание, направленное на область, поэтому существ больше нельзя выбрать напрямую\n Захватывает невидимых существ или существ в тумане войны\n Улучшение от Aghanim's Scepter также позволяет Lich применять другие способности во время применения Sinister Gaze без его прерывания, пока цель заклинания находится в зоне досягаемости\n Это означает, что во время действия Sinister Gaze способности Lich не имеют анимации применения и остаточной анимации, их применение также не требует разворота к цели\n Применяется только к  Frost Blast,  Frost Shield,  Chain Frost и  Ice Spire\n Все другие способности не подвержены этому (например, при использовании с помощью  Spell Steal,  Morph или способности предметов)"
      ],
      "item_behaviour": [],
      "description": "Гипнотизирует вражеское существо, отчего оно идёт к определённой точке в направлении владельца способности и отдаёт ему долю от текущей маны.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 600",
        "Дальность передвижения: 32%\/38%\/44%\/50%",
        "Кража текущей маны: 10%\/15%\/20%\/25%",
        "Длительность: 1,4\/1,7\/2,0\/2,3 ( 1,9\/2,2\/2,5\/2,8)",
        "Радиус:  400"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Lich_Sinister_Gaze.mp3\/revision\/latest?cb=20191216015322",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "24\/22\/20\/18",
      "aghanim": null,
      "name": "Sinister Gaze",
      "cooldown": "80",
      "legacy_key": "R",
      "story": "Держи голову в холоде..."
    },
    {
      "notes": [
        "Для разблокировки требуется <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard",
        "Chain Frost может отскакивать, но не воспринимает сосульку, как полноценную цель\n Может отскакивать от сосульки только в случае, если рядом с целью нет других подходящих целей\n Отскоки от шпиля всё равно учитываются числом отскоков\n Отскакивает только от союзных сосулек\n Вражеские игнорируются\n Если несколько сосулек находятся в пределах досягаемости, снаряд выбирает одну наугад\n Может перескакивать между двумя сосульками, если поблизости нет других целей",
        "Frost Shield действует на  Ледяной шпиль, применяя все эффекты",
        "Ледяной шпиль получает иммунитет к заклинаниям от баффа, поэтому с помощью проверки иконки баффа можно вывести в чат оставшееся время жизни варда",
        "Во время применения   Sinister Gaze Frost Blast не имеет времени применения и не требует поворота к цели"
      ],
      "item_behaviour": [],
      "description": "Создаёт в указанной точке сосульку, которая замедляет всех врагов вокруг. У сосульки 800 здоровья. Шар от способности Chain Frost может отскакивать к сосульке, если поблизости нет врагов. На сосульку можно применить способность Frost Shield.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 750",
        "Радиус: 750",
        "Замедление передвижения: 30%",
        "Задержка перед эффектом: 0,5",
        "Длительность: 15"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Lich_Ice_Spire_1.mp3\/revision\/latest?cb=20201230173953",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов"
      ],
      "mana": "25",
      "aghanim": null,
      "name": "Ice Spire",
      "cooldown": "150",
      "legacy_key": "E",
      "story": null
    },
    {
      "notes": [
        "Скорость снаряда Chain Frost при запуске — 1050\n После попадания по первой цели скорость полёта составляет 850",
        "Снаряд отскакивает с задержкой в 0,2 сек",
        "Может отскочить от одного и того же существа несколько раз, но только в случае, если между отскоками была поражена другая цель\n Отскакивает от  Рошана, но не замедляет и не наносит ему урона\n Только начальное попадание по нему наносит урон и замедляет\n Не отскакивает от  нетленных зомби и существ, находящихся вне зоны обзора (т.е\n невидимых, неуязвимых или исчезнувших)",
        "Chain Frost сначала применяет дебафф, затем наносит урон",
        "Повышение уровня Chain Frost и выбор  таланта на увеличение урона мгновенно обновит значения уже летящего снаряда Chain Frost",
        "Чтобы узнать, сколько урона наносит каждый отскок на каждом уровне (до уменьшений) при выбранном  таланте на увеличение урона на каждом из 10 отскоков, смотрите таблицу ниже",
        "Потенциально может нанести до 3575\/5500\/7425 ( 4675\/6600\/8525) урона за все отскоки (до уменьшений)",
        "Снаряд дает летающий обзор в радиусе 800\n Обзор не дается в момент задержки отскока в 0,2 сек",
        "Chain Frost перестает давать обзор и проигрывать звук от попадания в существ не-героев при отпрыгивании между ними более 60 раз",
        "Во время применения   Sinister Gaze Frost Blast не имеет времени применения и не требует поворота к цели"
      ],
      "item_behaviour": [],
      "description": "Создаёт ледяной шар, который отскакивает от противников до 10 раз, замедляя их и нанося им урон, увеличивающийся с каждым скачком.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+1,03",
        "Дальность применения: 750",
        "Радиус отскока: 600",
        "Число отскоков: 10 ( Бесконечно)",
        "Задержка отскока: 0,2",
        "Начальный урон: 250\/400\/550 ( 350\/500\/650)",
        "Увеличение урона за отскок: 15\/20\/25",
        "Замедление скорости передвижения: 65%",
        "Замедление скорости атаки: 65",
        "Длительность замедления: 2,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Lich_Chain_Frost_1.mp3\/revision\/latest?cb=20191216015315",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "100\/80\/60",
      "aghanim": null,
      "name": "Chain Frost",
      "cooldown": "180\/300\/420",
      "legacy_key": "C",
      "story": "Ледяной шар Этриана повсеместно считается вершиной мастерства в магии льда, вгоняя страх в любого, кто осмелится встать на пути колдуна."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 20.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 2.0,
    "attrAgility": 17.0
  },
  "description": "Воскрешенный любопытным геомантом, Этриан околдовал своего спасителя при помощи Sinister Gaze, затем быстро сделал этого человека своей новой жертвой. Наконец выбравшись из глубин Черного бассейна, Лич возвращается, чтобы сеять ледяное разрушение в мире. Облачая своих последователей в Frost Shield, плывет по полю боя, уничтожая любого, кто встанет у него на пути при помощи Blast. Замороженный шар опускается на своих врагов, перемещаясь от одного тела к другому, пока Chain Frost не уничтожит их всех.  Поддержка Быстрый урон ★☆☆",
  "history": "Маг льда Этриан, тогда ещё живой, порабощал целые королевства, угрожая им разрушительной мощью льда. Однажды его подданные, заручившись помощью нескольких отчаявшихся магов, нашли в себе смелость устроить на него покушение. Они намертво связали колдуна зачарованными цепями, прикрепили к ним адамантовые гири и сбросили его в озеро, которое считали бездонным. Они ошибались. Целый год Этриан опускался глубже и глубже, пока не зацепился за скалистый выступ. Там он и остался висеть, мёртвый, но не разлагающийся. Спустя многие годы геомант Анхил решил проверить, действительно ли бездонно легендарное Чёрное озеро. Отвес, что Анхил опускал в воду, зацепил связанного Этриана, и геомант вытащил из озера нежданную добычу. Думая, что у воскрешённого мертвяка можно будет выведать что-нибудь об озере, Анхил снял с трупа оковы и провёл простой ритуал возрождения. Даже потомки врагов Этриана остались в веках, поэтому никто не мог предупредить Анхила о неблагоразумии такого поступка. Впрочем, он осознал свою ошибку в мгновение ока, когда воскрешённый маг отбросил цепи и поглотил его."
}