{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b6\/Lotus_Orb_Echo_Shell_1.mp3\/revision\/latest?cb=20191227195446",
      "effects": [
        "Cast Range: 900",
        "Duration: 6"
      ],
      "notes": [
        "Applies a basic dispel on the target upon cast. ↓↓ Double-tapping automatically target self.",
        "↓↓ Double-tapping automatically target self.",
        "Can be cast on creep-heroes, however, it does not reflect any abilities cast on them.",
        "Multiple casts on the same target do not stack but refresh the duration.",
        "When an ability is blocked by Linken's Sphere, it still gets reflected.",
        "Does not reflect abilities cast by allies onto the wielder.",
        "Echo Shell's Spell Reflection has the following priorities: Counterspell ➤ Echo Shell ➤ Echo Shield ➤ Planar Pocket Does not stack with Soulbind, preventing it from duplicating spells onto a chained ally.",
        "Counterspell ➤ Echo Shell ➤ Echo Shield ➤ Planar Pocket",
        "Does not stack with Soulbind, preventing it from duplicating spells onto a chained ally.",
        "Does not reflect Ion Shell, Morph, Shockwave, Spell Steal, Soulbind, Spectral Dagger, Valor, Shine, Soul Release and Soul Release.",
        "Abilities reflected are not subjected to other Spell Reflection sources. For a list of abilities reflected, see here.",
        "For a list of abilities reflected, see here."
      ],
      "mana": "175",
      "abilityName": "Echo Shell",
      "cooldown": "15",
      "description": "Applies a shield to the target unit for 6 seconds which re-casts most targeted spells back to their caster. The shielded unit will still take damage from the spell.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Abilities reflected receive its Aghanim's Scepter upgrades only if the reflecting hero has Aghanim's Scepter, regardless of whether the original caster has it or not. This applies to abilities upgraded by talents and Aghanim's Shard as well."
  ],
  "cost": "3850",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Platemail",
    "Energy Booster"
  ],
  "name": "Lotus Orb",
  "description": "The jewel at its center still reflects a pale image of its creator.",
  "trivia": [
    "The ability to reflect single-target abilities back to their casters is actually an old ability concept in Dota. It was first seen in version 6.00 as a chance-based passive ability, belonging to Linken's Mirror, the pre-rework version of Linken's Sphere. The ability was removed in 6.09 and replaced by Spell Block, as Linken's Sphere got reworked."
  ],
  "upgradeIn": null,
  "tips": [
    "Projectile-based abilities are always reflected upon impact. This makes them easier to reflect than spells with instant effect because the Echo Shell can be placed on the targeted unit before the projectile hits."
  ]
}