{
  "abilities": [
    {
      "notes": [
        "Длина эффекта Boundless Strike не увеличивает ни бонусами к дальности атаки, ни бонусами к дальности применения. Бонусы к дальности применения увеличивают только дальность применения",
        "Эффекты Boundless Strike применяются мгновенно по всей области",
        "Эффект начинается на расстоянии в 75 спереди Monkey King и имеет фактическую длину 1025, что в сумме даёт 1100 эффективной длины. Поражает существ на расстоянии до 1250 (складывается из начальной дистанции, длины и ширины). Также может ударить существ на расстоянии 75 позади Monkey King из-за радиуса и стартовой позиции",
        "Позволяет Monkey King мгновенно атаковать всех затронутых врагов. Оглушение не зависит от этих атак. Эти атаки имеют эффект True Strike и не могут промахнуться. Также они игнорируют обезоруживание. На все затронутые цели может сработать любой модификатор атаки, за исключением прорубающего удара. Также срабатывает  Jingu Mastery, применяя дебафф на всех затронутых врагов или добавляя к счётчику один удар, если дебафф уже имеется. Несмотря на звук,  Daedalus может не сработать. Boundless Strike не гарантирует срабатывание эффектов, зависящих от шанса. Так как Boundless Strike имеет гарантированный крит, то криты с меньшими множителями не дадут эффекта, если сработают (приоритет идет за наивысшим значением)",
        "Jingu Mastery теряет заряд при применении Boundless Strike, независимо от того попала ли способность по существам или нет. Дополнительный урон наносится всем затронутым целям, лечение от вампиризма дается также от каждого пораженного существа, несмотря на использование только 1 заряда",
        "Boundless Strike сначала применяет дебафф, затем наносит урон",
        "Звук во время анимации применения слышен всем",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Boundless Strike перемещает Monkey King 1100 от места применения к концу длины эффекта, если включено Автоприменение. Monkey King движется по дуге с высотой 100-150 со скоростью 5000 и достигает конечной цели за 0,2 секунды. ПРИМЕЧАНИЯ К SPELL STEAL Мгновенные атаки  Rubick используют снаряды для достижения цели. Их можно избежать. Использует нормальное время применения при краже"
      ],
      "item_behaviour": [],
      "description": "Герой увеличивает свой посох и бьет им по земле, оглушая всех попавшихся врагов. Такая атака наносит критический урон и не может промахнуться.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,5",
        "Дальность применения:  1100",
        "Длина эффекта: 1100",
        "Ширина эффекта: 150",
        "Критический урон: 135%\/165%\/195%\/225%",
        "Длительность оглушения: 1\/1,2\/1,4\/1,6 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1,3\/1,5\/1,7\/1,9)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Monkey_King_Boundless_Strike.mp3\/revision\/latest?cb=20191216020658",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов ",
        "Урон: Мгновенная атака"
      ],
      "mana": "28\/26\/24\/22 (TagTalent 21\/19\/17\/15)",
      "aghanim": null,
      "name": "Boundless Strike",
      "cooldown": "100",
      "legacy_key": "B",
      "story": "Легендарный посох Цзиньгубан растет по воле хозяина, не позволяя врагам избежать его хватки."
    },
    {
      "notes": [
        "Повышение уровня Tree Dance также повысит уровень  Primal Spring",
        "Monkey King прыгает к выбранному дереву со скоростью 800, достигая дерева в пределах 1,13 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1,69) сек",
        "Прыгает дугой высотой в 192. Во время прыжка другие существа могут проходить под Monkey King. Активный модификатор появляется только во время прыжка и отвечает за анимацию прыжка",
        "Хотя визуально Monkey King находится на дереве, но фактически он остается на земле. Нахождение на высоте — часть анимации",
        "Tree Dance имеет несколько разных перезарядок, которые активируются в разное время. При применении длительность прыжка добавляется к перезарядке, давая перезарядку от 1,55\/1,4\/1,25\/1,1 ‒ 2,58\/2,43\/2,28\/2,13 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 3,14\/2,99\/2,84\/2,69) сек. в зависимости от расстояния. При достижении дерева перезарядка длится 1,45\/1,3\/1,15\/1 секунды; она важна только для пропуска перезарядки при помощи фиксированного уменьшения перезарядок или при обнулении перезарядок. При спрыгивании с дерева командами передвижения ( Нажатие ПКМ) или атаки (A) способность уходит на перезарядку в 1,45\/1,3\/1,15\/1 секунды. Не уходит на перезарядку при спрыгивании с дерева любыми другими способами. Не уходит на перезарядку при любых других действиях. При получении урона от источников, принадлежащих игрокам или  Рошану и превышающего 0, исключая урон, помещенного как отнимающий здоровье, способность героя, находящегося на земле, уходит на перезарядку в 3 секунды. Все эти перезарядки не попадают под влияние процентных уменьшений перезарядок. Фиксированные уменьшения и сброс перезарядок всё еще работают (например, с помощью  Chakra Magic)",
        "Во время прыжка Monkey King обезврежен и не способен выполнять какие-либо действия. Последняя отданная команда будет исполнена как только он приземлится",
        "Во время прыжка и находясь на дереве, Monkey King получает летающий обзор, но его обзор уменьшен до 700\/500. Дополнительный ночной обзор от  Moon Shard всё еще действует, но  Nightmare и  Smoke Screen не влияют на обзор Monkey King, пока он на дереве",
        "Пока Monkey King на дереве, его не видно. Его можно обнаружить только с помощью летающего обзора. Его можно увидеть с помощь вардов, расположенных на возвышенностях 2-го уровня, которые выше дерева, на котором сидит Monkey King. Но его нельзя увидеть с помощью заклинаний, подбрасывающих в небо (например,  Toss). Обзор можно получить только с возвышенностей",
        "Monkey King может выполнять любые действия, пока находится на дереве; при выполнении одних он слезет с дерева, а при других нет. Применение  Boundless Strike,  Mischief и любой способности предметов не спустят его с дерева. Применение  Wukong's Command, передвижение и атака спустят его с дерева. Приказы «Идти в направлении» и «Патрулирование» не дадут результата, если отдать их с дерева, поэтому Monkey King не спустится. При перезарядке на дереве, Monkey King обезоружен и не может передвигаться, что не позволяет ему слезть с дерева командами передвижения и атаки. Принудительное движение также спустит героя с дерева. Сюда входят эффекты базированных на  Blink Dagger предметах, источники урагана,  Force Staff,  Hurricane Pike и  Psychic Headband",
        "Находясь на дереве, Tree Dance можно использовать еще раз, выбрав другое ближайшее дерево. Все деревья в дальности применения будут подсвечены белым цветом",
        "Monkey King будет оглушён, если дерево, на которое он прыгает или на котором сидит, будет уничтожено. Спуск другими способами (в том числе принудительным движением) не оглушает. ПРИМЕЧАНИЯ К SPELL STEAL  Primal Spring и  Spring Early даруются, если это была последняя украденная способность.  Rubick не скрывается из виду из-за размера столкновения. Он спрыгивает с дерева при потере способности. ПРИМЕЧАНИЯ К MORPH Не изменяет обзор  Morphling ни  днём, ни  ночью"
      ],
      "item_behaviour": [],
      "description": "Герой запрыгивает на верхушку выбранного дерева. Там он получает прерываемую способность Primal Spring — направленную атаку в прыжке. Если разрушить дерево, герой упадет и будет оглушён на 4 сек. Если получить на земле урон от игрока или Рошана, способность уходит на перезарядку.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения с земли:  900 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1350)",
        "Дальность применения с дерева:  1000 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1350)",
        "Перезарядка при получении урона: 3",
        "Обзор с дерева днём: 700",
        "Обзор с дерева ночью: 500",
        "Длительность оглушения при падении с дерева: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Monkey_King_Tree_Dance_1.mp3\/revision\/latest?cb=20191216020644",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Себя "
      ],
      "mana": "1,45\/1,3\/1,15\/1",
      "aghanim": null,
      "name": "Tree Dance",
      "cooldown": "0",
      "legacy_key": "T",
      "story": "Сунь Укун проворно скачет по древесной завесе, оставаясь вне досягаемости несмотря ни на что."
    },
    {
      "notes": [
        "Эта способность автоматически улучшается при повышении уровня  Tree Dance",
        "Эта способность активна только во время анимации применения Tree Dance, прыжка с земли на дерево и сидении на дереве. Она неактивна при прыжке с дерева на дерево и при нахождении на земле",
        "Так как Tree Dance обезвреживает Monkey King во время прыжка, то применение Primal Spring во время прыжка на дерево ставит заклинание в очередь и активирует его сразу же, как герой окажется на дереве. Во время прыжка Monkey King запоминает последний отданный приказ и начинает его выполнение после приземления. Модификатор активности Tree Dance появляется во время прыжка и отвечает за анимацию скачка",
        "Прыгает в выбранную область со скоростью 1300, достигая её за 0,77 сек. с учетом расстояния",
        "Урон и замедление зависят от времени, потраченного на произнесение; их значения увеличиваются с каждым тиком сервера, потраченным на произнесение, до 54 раз. Урон увеличивается на 2,642\/3,962\/5,283\/6,604 за каждый тик сервера сразу после начала произнесения, достигая 140\/210\/280\/350 урона за 1,6 сек. Замедление увеличивается на 0,4%\/0,8%\/1,1%\/1,5% за каждый тик сервера сразу после начала произнесения, достигая 20%\/40%\/60%\/80% замедления за 1,6 сек",
        "Попадание Primal Spring по одному и тому же врагу несколько раз обновит длительность замедления, но не значение замедления, зависящее от длительности произнесения",
        "Primal Spring сначала наносит урон, затем применяет дебафф",
        "Если Monkey King будет под действием принудительного движения во время скачка, все эффекты Primal Spring будут полностью отменены",
        "Визуальные эффекты в выбранной области во время произнесения видны только союзникам, но звук произнесения слышен врагам даже сквозь туман войны. ПРИМЕЧАНИЯ К SPELL STEAL Ничего не происходит, если была потеряна во время произнесения"
      ],
      "item_behaviour": [],
      "description": "Герой спрыгивает с дерева, нанося урон врагам в указанной области и замедляя их. Урон и замедление усиливаются в зависимости от времени подготовки способности.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: Глобальная",
        "Макс. дальность прыжка:  1000",
        "Радиус: 375",
        "Макс. время произнесения: 1,6",
        "Макс. урон: 140\/210\/280\/350",
        "Макс. замедление скорости передвижения: 20%\/40%\/60%\/80%",
        "Длительность замедления: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Monkey_King_Primal_Spring_1.mp3\/revision\/latest?cb=20191216020640",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "20\/18\/16\/14 (TagTalent 0)",
      "aghanim": null,
      "name": "Primal Spring",
      "cooldown": "100",
      "legacy_key": "G",
      "story": "Скакнув из укрытия в гущу врагов, Сунь Укун атакует без жалости."
    },
    {
      "notes": [
        "Заменяет  Primal Spring до завершения произнесения",
        "Мгновенно прерывает произнесение Primal Spring, позволяя Monkey King досрочно прыгнуть",
        "Нельзя поставить в ⇧ Shift-очередь"
      ],
      "item_behaviour": [],
      "description": "Для этой способности нет описания.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Spring Early",
      "cooldown": "0",
      "legacy_key": "G",
      "story": null
    },
    {
      "notes": [
        "Каждая успешная атака по вражескому герою применяет к нему дебафф, если на Monkey King не действует бафф на доп. урон и вампиризм, или же добавляет 1 эффект к его счётчику, если бафф уже действует. Применяет дебафф только к настоящим вражеским героям (включая клонов). Иллюзии и крипов-героев способность не учитывает, как и союзных героев",
        "Длительность дебаффа обновляется с каждым ударом. Необязательно совершать все 4 удара за 7\/8\/9\/10 сек",
        "Мгновенная атака от  Boundless Strike также учитывается; она применяет дебафф или добавляется к счётчику дебаффа",
        "При атаке одной и той же цели 4 раза, дебафф на цели исчезает, а Monkey King получает урон к атаке и эффект вампиризма. Даёт прямой бонусный урон от атаки. Складывается с другими источниками вампиризма. Вампиризм неактивен при атаке строений и союзных существ. Вампиризм действует на любых других существ, включая варды, которые имеют механику здоровья (например  Чумной тотем), а не количества атак для уничтожения",
        "Заряд используется при успешной атаке любого существа, включая постройки, варды и союзных существ, всегда применяя дополнительный урон",
        "Boundless Strike также использует эффекты Jingu Mastery, ударяя всех врагов с дополнительным уроном и вампиризмом, но за применение используется только 1 заряд, или увеличивая счётчик ударов. При активном баффе всегда теряет 1 заряд Jingu Mastery при ударе Boundless Strike, даже если способность никого не поразила. Бонусный урон применяется к атакам по всем задетым существам, Monkey King получает лечения от вампиризма от удара по всем задетым существам",
        "Jingu Mastery не работает у клонов. Они не добавляют заряды на врагах и не получают дополнительный урон, если у Monkey King был бафф при применении. ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER При улучшении это ограничение снимается: каждая успешная атака по вражескому герою увеличивает счётчик Jingu Mastery, если солдат не имеет активного эффекта Jingu Mastery. В отличие от применения Jingu Mastery героем, клоны накладывают эффект счётчика на себя, а не на противника. Это значит, что солдату требуется атаковать любых героев 4 раза, а не одного и того же. Наличие улучшения от Aghanim's Scepter, уровень способности и выбор <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантов фиксируется при появлении клона. Остальные примечания к Jingu Mastery полностью применимы. Если способность не изучена, то эффект не накладывается",
        "При поднятии уровня Jingu Mastery с активным баффом бонусы к урону и вампиризму обновляются при использовании заряда"
      ],
      "item_behaviour": [],
      "description": "Удары героя пробуждают мощь Цзиньгубана. Каждая четвертая атака по вражескому герою дарует четыре усиленные атаки с дополнительным уроном и вампиризмом.",
      "hot_key": "D",
      "params": [
        "Ударов нужно: 4",
        "Зарядов: 4 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 6)",
        "Дополнительный урон: 40\/70\/110\/130 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 170\/200\/240\/260)",
        "Вампиризм: 25%\/40%\/55%\/70%",
        "Длительность счётчика: 7\/8\/9\/10",
        "Длительность баффа: 35"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Monkey_King_Jingu_Mastery.mp3\/revision\/latest?cb=20191216020638",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов \/ Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Jingu Mastery",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Чувствительный к настрою своего повелителя, посох Цзиньгубан сияет от мощи, когда Сунь Укун показывает свой боевой пыл."
    },
    {
      "notes": [
        "Это врождённая способность, не требующая изучения. Она связана с Monkey King, а не с какой-либо его способностью",
        "При применении прерывает произносимые заклинания Monkey King, команды передвижения и атаки",
        "При применении Mischief устанавливает скорость передвижения героя в 200 и превращает Monkey King в предмет, дерево или руну. При превращении в другое существо устанавливает скорость передвижения Monkey King в соответствии с тем, в какое существо он был превращён. Установленная скорость передвижения является абсолютным значением. Ни одним бонус или отрицательный эффект не могут изменить его, кроме ускорения",
        "Область выбора Monkey King адаптируется к моделям маскировки. Его размер столкновения при этом не меняется",
        "При маскировке иконка Monkey King на мини-карте не видна врагам. При превращении в существо полоска здоровья над головой копирует внешний вид полоски здоровья существа, в которого было выполнено превращение, включая цвет его команды. При превращении в предмет, дерево или руну полоска здоровья Monkey King полностью скрыта",
        "Любые автоатаки игнорирует Monkey King, поэтому линейные и нейтральные крипы, башни и фонтаны не будут автоматически его атаковать. Существа игроков с включенной автоатакой также не будут атаковать его без отданного приказа на атаку. Атака через точку на земле также будет игнорировать его, но его можно принудительно атаковать (A). Monkey King всё еще можно задеть любым заклинанием. Его можно выбрать в качестве цели. Эффекты частиц заклинаний всё еще будут принадлежать ему",
        "В течение 0,2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,4) секунды Mischief отрицает урон, не позволяя срабатывать определенным эффектам, реагирующим на урон. Урон, превышающий 0 развеивает эффект. Не развеивается уроном, отмеченным как отнимающий здоровье. ПРИМЕЧАНИЯ К SPELL STEAL \/ ПРИМЕЧАНИЯ К MORPH Эту способность нельзя получить"
      ],
      "item_behaviour": [],
      "description": "Изменяет форму героя, чтобы обхитрить противников. Маскировка зависит от окружения и спадает при получении урона, попытке атаковать и применении предметов или способностей. Делает героя неуязвимым на 400 сек.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0,53",
        "Фикс. скорость передвижения (по умолчанию): 200",
        "Фикс. скорость передвижения (курьер): 380",
        "Радиус поиска крипа: 200",
        "Радиус поиска руны: 300",
        "Радиус поиска дерева: 350",
        "Радиус поиска курьера: 400",
        "Длительность иммунитета к урону: 0,2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,4)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c8\/Monkey_King_Mischief.mp3\/revision\/latest?cb=20200510123903",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Mischief",
      "cooldown": "0",
      "legacy_key": "F",
      "story": "Когда не знаешь, откуда ждать беды."
    },
    {
      "notes": [
        "Заменяет  Mischief до окончания маскировки",
        "При применении прерывает произносимые заклинания Monkey King, команды передвижения и атаки"
      ],
      "item_behaviour": [],
      "description": "Возвращает героя в изначальную форму.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0,53"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/99\/Revert_Form.mp3\/revision\/latest?cb=20161216024052",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "1",
      "aghanim": null,
      "name": "Revert Form",
      "cooldown": "0",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "При применении появляется 14 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 21) клонов Monkey King, которые мгновенно идут к своим определенным точкам в формации",
        "Клоны движутся со скоростью 700 и имеют беспрепятственное передвижение, проходя через возвышенности и деревья",
        "Строй, занимаемый солдатами, всегда одинаков, за исключением варианта, когда пространство ограничено краем карты. Солдаты в первом круге формируют пятиугольник с кругом радиусом в 300, с вершиной, всегда повернутой в сторону севера. Солдаты во втором круге формируют девятиугольник с кругом радиусом в 750, также с вершиной, всегда повернутой в сторону севера. Солдаты в третьем круге формируют семиугольник с кругом радиусом в 1100, также с вершиной, всегда повернутой в сторону севера",
        "Солдаты неуязвимы и считаются спрятанными (хотя их видно), давая им иммунитет практически ко всем заклинаниям. Их невозможно выбрать (и Monkey King, и врагам), неконтролируемы и они не могут подбирать или выкидывать предметы. Клоны также копируют большую часть предметов Monkey King, поэтому могут использовать все модификаторы атаки и распространять те же ауры, что и Monkey King",
        "Jingu Mastery не работает у клонов. Они не добавляют заряды на врагах и не получают дополнительный урон, если у Monkey King был бафф при применении. ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER При улучшении это ограничение снимается: каждая успешная атака по вражескому герою увеличивает счётчик Jingu Mastery, если солдат не имеет активного эффекта Jingu Mastery. В отличие от применения Jingu Mastery героем, клоны накладывают эффект счётчика на себя, а не на противника. Это значит, что солдату требуется атаковать любых героев 4 раза, а не одного и того же. Наличие улучшения от Aghanim's Scepter, уровень способности и выбор <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантов фиксируется при появлении клона. Остальные примечания к Jingu Mastery полностью применимы. Если способность не изучена, то эффект не накладывается",
        "Солдаты — это клоны Monkey King, копирующие  \/  \/  все атрибуты Monkey King с несколькими исключениями. Они не иллюзии. Их базовые характеристики адаптируются при каждом призыве (например, постоянная потеря атрибутов от  Glaives of Wisdom или  Essence Shift). Их скорость атаки фиксирована, поэтому они всегда совершают одну атаку каждые 1,2 сек. Эффекты, увеличивающие или замедляющие скорость атаки, на них не влияют. Промахнувшиеся атаки не учитываются. Клоны продолжают атаковать до успешного попадания и затем возвращаются к неактивному состоянию. Их дневной и ночной обзор уменьшен до 600. Они дают обзор при движении к своей точке и когда стоят на ней",
        "Солдаты атакуют только вражеских героев, клонов, крипов-героев и иллюзии внутри круга. Клоны способны атаковать только тех врагов, которых видят. Невидимые враги и враги внутри тумана войны не будут атакованы, даже если они внутри круга и в пределах дальности атаки. Иные существа внутри и любые существа вне круга игнорируются даже если они в пределах дальности атаки солдат. Так как солдаты совершают обычные атаки, их урон уменьшается блокировкой урона",
        "Баффы от  Aghanim's Scepter и  Aghanim's Shard успешно копируются. При этом другие постоянные баффы (например  Moon Shard,  Duel) не копируются",
        "Если Monkey King выйдет за радиус 780 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1130) от центра круга или умрет, то солдаты исчезнут, а заклинание завершится",
        "Повторное применение Wukong's Command с активным кругом солдат мгновенно завершит предыдущее",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Пассивное создание солдат использует время восстановления, а не интервал. То есть, если солдат готов появится, но Monkey King находится в состоянии, запрещающем появление, то способность призовет клона как только появится возможность. В отличии от призываемых солдат, клоны могут атаковать любое существо кроме  Рошана, но требуют присутствия Monkey King в радиусе 500 для атаки построек. Способность сразу готова к призыву солдата при получении скипетра. Примечания о Jingu Mastery к Wukong's Command полностью применимы. Если Monkey King умирает, то все солдаты мгновенно исчезают. Солдаты не появляются в следующих случаях: Если на героя действуют модификаторы прыжка и нахождения на дереве от  Tree Dance. Во время превращения  Mischief Когда герой полностью невидим, спрятан или мёртв"
      ],
      "item_behaviour": [],
      "description": "Герой создает круговую формацию солдат, которые расходятся из его местоположения. Если герой покидает область действия способности, его солдаты исчезают. Их атака идентична атаке героя, а своей целью они выбирают только других героев. На время действия способности герой получает дополнительную броню.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 1+0,37",
        "Дальность применения: 550",
        "Радиус первого круга: 300",
        "Радиус второго круга: 750",
        "Радиус командования: 780 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1130)",
        "Количество солдат первого круга: 5",
        "Количество солдат второго круга: 9",
        "Интервал между атаками солдат: 1,2",
        "Дополнительная броня: 14\/19\/24",
        "Макс. длительность: 13",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Радиус третьего круга:  1100",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Количество солдат третьего круга:  7",
        "Радиус пассивного появления:  300",
        "Интервал пассивного появления:  4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Monkey_King_Wukong%27s_Command_1.mp3\/revision\/latest?cb=20191216020648",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Вражеских героев",
        "Урон: Физический"
      ],
      "mana": "120\/100\/80",
      "aghanim": null,
      "name": "Wukong's Command",
      "cooldown": "100",
      "legacy_key": "W",
      "story": "Сунь Укун выдирает клок шерсти и дует им на противников, превращая каждый волосок в копию себя самого."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 18.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 3.7,
    "attrAgility": 22.0
  },
  "description": "Прыгает на жертв с верхушек деревьев Сунь Укун, Monkey King — это герой, очень известный своей скользкой натурой, а также своей способностью обманывать его врагов превращаясь в деревья и другие объекты. Вооружившись своим магическим увеличивающимся посохом, Monkey King пробуждает его внутреннюю мощь и ударяет им землю, чтобы обезвредить противников. В перерывах между битвами прыгает по вершинам деревьев, чтобы избегать противников. Находясь на дереве, он получает лучший взор на его окрестности, позволяя ему спрыгивать на ничего не ожидающих врагов, нанося существенный урон и замедляя их побег. В бою Monkey King посылает армию собственных клонов по всему полю битвы, не давая врагам шанса на выживание.  Керри Побег Контроль Инициация ★★☆",
  "history": "500 лет Сунь Укуна сдавливала гора, и лишь его голова не ощущала сокрушительного веса каменной тюрьмы, в которой древние боги заточили бесшабашного бунтаря. Черты его открытого всем ветрам лица покрыл мох, из ушей проросла трава; его взор обрамляли полевые цветы, пустившие корешки в почве вокруг его щёк. Многие думали, что он погиб, сгинул в мучениях за войну с небесами, но легенды о нём не забывались. И гласили они: Сунь Укун не способен умереть. И он ждал. Терпеливо ждал шанса искупить свою вину перед богами. И когда они решили назвать ему свою цену, Сунь Укун согласился: он пообещал сопроводить юного пилигрима в его тайном походе, защитить его от демонов и внешних напастей, привести путника домой вместе с желанной реликвией. «Сделай так, — сказали боги, — да покорно слушайся приказов своего господина, что служит нам своей святой миссией, и тогда избавишь себя от нашей немилости». Переменившийся Сунь Укун с честью исполнил свою клятву перед богами, искупив свои прошлые грехи. Пилигрим, укрепив свою веру в лишениях, вернулся в обитель вместе с реликвией; Сунь Укун же гордо вошёл в пантеон богов — и первое время пытался побороть старую страсть к приключениям и славе. Но жить он мог лишь хитростью... А что может быть лучше, чем обхитрить богов вновь?"
}