{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на ловкость в общем даёт Nyx Assassin: 13,33 брони, 80 скорости атаки и 80 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Проход через препятствия в Vendetta",
          "talentRight": "+80 к ловкости"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+140 к урону от Impale",
          "talentRight": "+60% к урону от Spiked Carapace"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+250 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0,25 сек. оглушения от Impale",
          "talentRight": "+6% к урону от заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Nyx_Assassin_Impale.mp3\/revision\/latest?cb=20191216021116",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Шипы движутся со скоростью в 1600 единиц.",
        "Пораженные существа подбрасываются вверх на 350 единиц для базового оглушения на 0,5 секунды.",
        "Пока задетые существа в воздухе, остальные могут под ними проходить.",
        "Урон наносится после приземления, а не при поражении.",
        "C действующей Burrow дальность применения и прохождения увеличивается до 1225 единиц, а перезарядка уменьшается до 7 секунд.",
        "Impale поражает существ на расстоянии до 825 (TagTalent 1350) единиц (складывается из дальности прохождения и радиуса).",
        "Когда Impale поражает невидимых существ, визуальные эффекты под ними остаются видимыми."
      ],
      "mana": "95\/115\/135\/155",
      "hotKey": "Q",
      "cooldown": "14",
      "description": "Из земли прорывается полоса каменных шипов. Они подбрасывают врагов в воздух, а по приземлении оглушают их и наносят урон.",
      "spellName": "Impale",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 700",
        "Дальность прохождения: 700",
        "Радиус: 125",
        "Урон: 80\/140\/200\/260 (TagTalent 220\/280\/340\/400)",
        "Длительность оглушения: 1,4\/1,8\/2,2\/2,6 (TagTalent 1,65\/2,05\/2,45\/2,85)",
        "Пытается нанести урон, если уже пораженные враги получили иммунитет к заклинаниям до приземления."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Все скарабеи-фанатики прекрасно знают подземные пути и умело используют их в бою."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Nyx_Assassin_Mana_Burn.mp3\/revision\/latest?cb=20191216021105",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Сначала наносит урон, затем сжигает ману.",
        "В среднем сжигает 29%\/33%\/38%\/42% от максимального запаса маны цели, если у неё нет фиксированных бонусов к мане.",
        "Несмотря на то, что первым наносится урон, он рассчитывается с учетом того, сколько маны потеряет цель из-за Mana Burn. Например, при использовании на врага с 5 единицами маны, способность нанесет лишь 5 единиц урона (до уменьшений).",
        "Например, при использовании на врага с 5 единицами маны, способность нанесет лишь 5 единиц урона (до уменьшений).",
        "Можно применять к крипам-героям, но это не даст никакого эффекта, (поскольку у них нет атрибута интеллект), способность потратит ману и уйдет на перезарядку.",
        "С действующей Burrow дальность применения увеличивается до 1050 единиц."
      ],
      "mana": "100",
      "hotKey": "W",
      "cooldown": "28\/20\/12\/4",
      "description": "Выжигает у выбранного героя ману, пропорциональную его интеллекту, и наносит урон, равный выжженной мане.",
      "spellName": "Mana Burn",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 600",
        "Множитель интеллекта: 350%\/400%\/450%\/500%",
        "Урона за сожженную ману: 100%"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Книга Ультимира описывает скарабея, который мог разъедать разум низших существ."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Nyx_Assassin_Spiked_Carapace_1.mp3\/revision\/latest?cb=20191216021107",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "При использовании Spiked Carapace прерывает произносимые способности Nyx Assassin.",
        "Можно использовать при действующей Vendetta без выхода из невидимости. Выводит из других источников невидимости.",
        "Отражает только урон от игроков, возвращая его источнику. Существо затрагивается способностью лишь раз за бафф.",
        "Бафф от нескольких применений не складывается, но обновляет длительность.",
        "Отражает тот же тип урона, что и получает.",
        "Отражает входящий урон до всех манипуляций. При этом манипуляция урона на врага влияет на урон по-прежнему.",
        "На отражаемый физический урон также действует блокировка урона.",
        "У отражаемого урона есть отметка неотражаемости, препятствующая отражению этого урона от других подобных источников.",
        "Игнорирует наносимый себе урон и урон, отмеченный как отнимающий здоровье.",
        "У Spiked Carapace глобальная дальность и она действует на невидимых существ и существ в тумане войны.",
        "Отраженный урон не может быть усилен с помощью усиления урона заклинаний и на него не действует вампиризм заклинаний.",
        "Spiked Carapace сначала применяет дебафф, затем отражает урон.",
        "Не действует на варды, постройки и союзных существ.",
        "Spiked Carapace отрицает и отражает урон после всех уменьшений, что предотвращает срабатывание эффектов, реагирующих на урон.",
        "У способности приоритет выше, чем у Aphotic Shield и Living Armor, но ниже, чем у False Promise. При этом в комбинации с False Promise способность продолжает отражать урон и оглушать цели.",
        "Несмотря на то, что урон, наносимый врагам, равен значению заблокированного урона, эффекты действуют отдельно друг от друга. То есть Spiked Carapace всегда блокирует один источник наносимого урон, даже если источник обладает иммунитетом к способностям или неуязвим.",
        "То есть Spiked Carapace всегда блокирует один источник наносимого урон, даже если источник обладает иммунитетом к способностям или неуязвим.",
        "С действующей Burrow способность мгновенно применяет оглушение по всем врагам в радиусе единиц. Поскольку Spiked Carapace не имеет базового урона, пораженные существа урона также не получат. У Nyx Assassin также остается стандартный бафф, который может отражать урон и оглушать врагов. При этом бафф не влияет на вражеских существ, ранее пораженных оглушением от способности. Они смогут нанести Nyx Assassin урон без каких-либо последствий.",
        "Поскольку Spiked Carapace не имеет базового урона, пораженные существа урона также не получат.",
        "У Nyx Assassin также остается стандартный бафф, который может отражать урон и оглушать врагов.",
        "При этом бафф не влияет на вражеских существ, ранее пораженных оглушением от способности. Они смогут нанести Nyx Assassin урон без каких-либо последствий."
      ],
      "mana": "40",
      "hotKey": "E",
      "cooldown": "25\/20\/15\/10",
      "description": "Полностью блокирует урон от атаки или способности, по одному разу отражая урон и оглушая каждого, кто пытался его нанести. Не прерывает невидимость от способности Vendetta. Если герой находится под действием Burrow, эта способность мгновенно оглушает всех врагов вокруг.",
      "spellName": "Spiked Carapace",
      "params": [
        "Анимация применения: 0+0",
        "Радиус с Burrow: 300",
        "Отражаемый урон: 100% (TagTalent 160%)",
        "Длительность: 2",
        "Длительность оглушения: 0,6\/1,2\/1,8\/2,4"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Несмотря на то что сам панцирь скарабея довольно тонкий, его надёжно защищают острые как бритва выдвижные шипы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Nyx_Assassin_Burrow.mp3\/revision\/latest?cb=20191216021114",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. В режиме Ability Draft Burrow может быть разблокирована при выборе игроком Vendetta.",
        "В режиме Ability Draft Burrow может быть разблокирована при выборе игроком Vendetta.",
        "Делает Nyx Assassin невидимым, обезоруживает его и применяет к нему оцепенение, предотвращая его передвижение, атаки и использование Blink Dagger.",
        "Восстанавливает до 90% от максимального здоровья и маны в минуту.",
        "Burrow длится до использования Unburrow или Vendetta.",
        "Nyx Assassin можно перемещать с помощью заклинаний без его выкапывания.",
        "Пока герой зарыт, Impale и Mana Burn применяются без поворота к цели или выбранной точке, но для остальных направленных заклинаний и предметов поворот нужен.",
        "Потеря Aghanim's Scepter мгновенно выкапывает Nyx Assassin."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Герой торопливо закапывается в землю. В таком виде Spiked Carapace действует на всех окружающих врагов, дальность Mana Burn и Impale увеличивается, а также уменьшается время перезарядки последней. Закопавшийся в землю герой невидим, получает уменьшенный урон, быстрее восстанавливает здоровье и ману, но не может двигаться или атаковать.",
      "spellName": "Burrow",
      "params": [
        "Анимация применения: 1,5+0,1",
        "Время до невидимости: 0",
        "Макс. здоровья\/маны в регенерацию за секунду: 1,5%",
        "Уменьшение получаемого урона: 40%",
        "Увеличение дальности применения\/расстояния Impale: 525",
        "Уменьшение перезарядки Impale: 7",
        "Увеличение дальности применения Mana Burn: 450",
        "Радиус Spiked Carapace: 300"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Некоторые скарабеи-фанатики залегают в землю и застают жертву врасплох."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7c\/Nyx_Assassin_Unburrow_1.mp3\/revision\/latest?cb=20191216021109",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Burrow до использования или смерти героя.",
        "При использовании прерывает произносимые способности Nyx Assassin.",
        "Мгновенно убирает все бонусы, даваемые Burrow.",
        "Использует другой звук, когда герой выкапывается из реки."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Выкопаться из-под земли.",
      "spellName": "Unburrow",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Некоторые скарабеи-фанатики залегают в землю и застают жертву врасплох."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Nyx_Assassin_Vendetta.mp3\/revision\/latest?cb=20191216021112",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "При использовании Vendetta не прерывает произносимые способности Nyx Assassin.",
        "Атака из Vendetta не может промахнуться.",
        "Дополнительный урон наносится отдельным источником урона и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Невидимость прерывается при завершении способностями или предметами анимации применения или попадании атаки в цель.",
        "Урон и дебафф не применяются при атаке вардов или строений.",
        "Vendetta позволяет Nyx Assassin проходить сквозь остальных существ, включая варды, но исключая строения.",
        "Nyx Assassin может поднимать, выкидывать или атаковать предметы и руны без выхода из невидимости.",
        "Талант на 25 уровне позволяет Nyx Assassin, помимо прохождения сквозь существ, свободно проходить по возвышенностям и деревьям."
      ],
      "mana": "180\/240\/300",
      "hotKey": "R",
      "cooldown": "90\/75\/60",
      "description": "Делает героя невидимым и увеличивает его скорость передвижения. Если герой совершит атаку из невидимости, то нанесёт огромный дополнительный урон.",
      "spellName": "Vendetta",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0",
        "Урон: 300\/450\/600",
        "Доп. скорость передвижения: 16%\/18%\/20% (TagTalent 41%\/43%\/45%)",
        "Доп. скорость анимации атаки: 50%",
        "Длительность Vendetta: 40\/50\/60",
        "Снижение сопротивления магии врага: 20%",
        "Длительность уменьшения сопротивления магии: 4",
        "Дарует новую способность: Burrow. Герой торопливо закапывается в землю."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Скарабей убивает во славу своей королевы."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 2.5,
    "attrAgility": 19.0
  },
  "description": "Nyx Assassin — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Первая способность, Impale, позволяет герою вызвать каменные шипы из под земли, которые подкидывают и оглушают врагов некоторое время, а затем получат урон от падения. Вторая способность, Mana Burn, выжигает у выбранного героя ману, пропорциональную его интеллекту, и наносит урон, равный выжженой мане. Третья способность, Spiked Carapace, отражает и сводит на нет следующую атаку по Nyx Assassin (по одной от каждого источника), оглушая того, кто ее совершил. Эффект способности схож с действием предмета Blade Mail, однако, эта способность еще и оглушает противника, в отличие от предмета. Ультимативная способность, Vendetta, делает Nyx Assassin невидимым и дает ему дополнительную скорость передвижения. Если Nyx Assassin атакует из невидимости, то он наносит огромный дополнительный урон. Улучшение с Aghanim's Scepter добавляет новую способность Burrow с помощью которой Nyx Assasssin закапывается в землю. После этого Spiked Carapace мгновенно оглушает врагов рядом при использовании, дальность применения Mana Burn и Impale увеличивается, а время перезарядки Impale уменьшается. Закопавшийся в землю Nyx Assassin невидим и не может двигаться или атаковать. Также повышается скорость восстановления здоровья и маны, а получаемый урон уменьшается. У этой способности есть подспособность Unburrow позволяющая выкопаться из-под земли.",
  "history": "Глубоко в архивах Ультимира, среди учёных трактатов о кладистике драконов и книгах непереводимых заклинаний, таится древний том с описаниями энтомологических диковин. Составленная учёными книга описывает телепатические способности скарабея-фанатика, странного вида общественных насекомых со способностями, которых нет больше ни у кого во всех семи мирах. В отличие от многих других личинок колонии, этот зародыш не превратился в жука с ограниченным мышлением и затупленными конечностями, положенными рабочей касте его вида. Для него было уготовано особое превращение — благодать самой Никс. Он был избран, один из множества, и помазан экстрактом самой королевы-богини. Мало кто выживал в полумраке королевских покоев, но он проявил проницательный ум. Его бритвенно острые жвалы секли воздух, пока разум проникал в мысли существ вокруг него. Из всех скарабеев-фанатиков только он был удостоен высшего звания. После нового превращения он переродился под благодатью Никс, со способностями, служащими одной лишь цели: убивать во имя богини.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Проход через препятствия в Vendetta",
      "talentRight": "+80 к ловкости"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+140 к урону от Impale",
      "talentRight": "+60% к урону от Spiked Carapace"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+250 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0,25 сек. оглушения от Impale",
      "talentRight": "+6% к урону от заклинаний"
    }
  ]
}