{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Hood_of_Defiance_Barrier.mp3\/revision\/latest?cb=20191227195438",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прервает произносимые заклинания владельца.",
        "Блокирует урон до любых уменьшений, за исключением действия иммунитета к заклинаниям, так как в этот момент барьер не блокирует магический урон.",
        "Повторное использование обновит бафф и сбросит счетчик поглощенного урона.",
        "Не сочетается с другими магическими барьерами. Если на существе будут активны несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно. При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Если на существе будут активны несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно.",
        "При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Блокирует только магический урон от заклинаний и атак. Не блокирует физический или чистый урон.",
        "Не делит перезарядку с Pipe of Insight."
      ],
      "mana": "50",
      "abilityName": "Shroud",
      "cooldown": "60",
      "description": "Создаёт щит, блокирующий до магического урона. Получаемый магический урон превращается в ману. Действует сек.",
      "params": [
        "Поглощает магического урона: 400",
        "Длительность: 12"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Вампиризм заклинаний от нескольких Bloodstone не складывается.",
        "Лечение идет от любого урона заклинаний, наносимого владельцем (с некоторыми исключениями) вражеским или союзным существам.",
        "Лечение не идет от урона, нанесённого строениям, вардам или самому себе.",
        "Лечение идет от всех трёх типов урона и от большинства мгновенно убивающих эффектов.",
        "Лечение от урона применяется после всех уменьшений.",
        "Для лечения источником урона должен быть владелец. Урон, нанесенный призываемыми существами (включая варды), не лечит."
      ],
      "mana": null,
      "abilityName": "Spell Lifesteal",
      "cooldown": null,
      "description": "Даёт магический вампиризм, который восстанавливает здоровье за наносимый способностями урон. Восстанавливает здоровье в размере 20% от урона по героям и 4% от урона по крипам.",
      "params": [
        "Вампиризм от героев: 20%",
        "Вампиризм от крипов: 4%"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Сочетается по закону убывающей полезности с другими источниками сопротивления магии."
  ],
  "cost": "3300",
  "lore": null,
  "consistFrom": [
    "Hood of Defiance",
    "Voodoo Mask",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Eternal Shroud",
  "description": "Этот безупречный капюшон поглощает раздор, чтобы наполнить владельца силами.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+8,5 к регенерации здоровья",
    "+20% к сопротивлению магии"
  ],
  "tips": null
}