{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Radiance_Burn.mp3\/revision\/latest?cb=20191227195519",
      "effects": [
        "Ability Toggle \/ Aura",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not interrupt the user's channeling spells upon toggling.",
        "The burn damage and blind effect are provided by an aura. Its debuff lingers for 0.5 seconds. This means during this linger period, enemies can still be damaged by up to one tick.",
        "This means during this linger period, enemies can still be damaged by up to one tick.",
        "Deals damage in 1 second intervals, starting 1 second after the debuff is placed.",
        "The burn damage and blind effect of multiple Radiance do not stack. Only the first applied debuff applies the effects.",
        "Burn's blind uses pseudo-random distribution.",
        "Places the on Roshan, but only applies the blind on him. Does not deal damage to Roshan.",
        "Does not affect buildings."
      ],
      "mana": null,
      "abilityName": "Burn",
      "cooldown": "0",
      "description": "When active, scorches enemies for 60 magical damage per second, and causes them to miss 17% of their attacks. Illusions deal 35 magical damage per second.",
      "params": [
        "Radius: 700",
        "Damage per Second (Hero): 60",
        "Damage per Second (Illusion): 35",
        "Miss Chance: 17%",
        "Aura Linger Duration: 0.5",
        "Blinds and attempts to damage if debuff was placed before spell immunity.",
        "Illusions deal less damage with Burn around them. The main hero's Burn always takes priority, if an enemy is within range of both the hero and its illusion."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "5150",
  "lore": null,
  "consistFrom": [
    "Sacred Relic",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Radiance",
  "description": "",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+60 Attack Damage"
  ],
  "tips": [
    "Radiance has one of the hardest build-ups in the game, as rushing the 3800 gold for a Sacred Relic forces you to save up a lot of gold at once rather than ramping up your strength with cheaper items. Early deaths can be especially problematic for a Radiance builder, and may force the player to give up on Radiance and build a different item. Inform your team if you are building a Radiance.",
    "It is recommended to avoid being visible on the map and avoid uncertain fights when close to the purchase of the Sacred Relic.",
    "With a Manta Style or an illusion ability, you can farm multiple lanes and wood camps at once and push the lanes safely.",
    "Radiance's constant area damage is great at disabling enemy Blink Daggers, preventing enemies from initiating or escaping with it. However, they can still initiate with it if they have enough vision, due to the blink's range being higher than the Burn Aura's reach.",
    "It can be combined with a Shiva's Guard to have an AoE magic damage ability, slow your enemies and protect your team further from physical damage.",
    "The damage from Radiance procs Spell Lifesteal. Illusions themselves can recover health while dealing damage to enemy creeps and heroes, allowing them to survive longer. Only the first illusion or hero that burns an enemy lifesteals from it.",
    "It is extremely discouraged to purchase more than one Radiance on the same team, as the auras do not stack."
  ]
}