{
  "abilities": [
    {
      "notes": [
        "Талант на интеллект в общем даёт Skywrath Mage: 120 маны, 0,5 восстановления маны и 10 урона от атаки.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+450 к урону от Mystic Flare",
          "talentRight": "Arcane Bolt сквозь невосприимчивость к магии"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−12% к сопротивлению магии Ancient Seal",
          "talentRight": "Неограниченная дальность применения Concussive Shot"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1 снаряд Arcane Bolt",
          "talentRight": "−8 сек. к перезарядке Ancient Seal"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 к интеллекту",
          "talentRight": "+175 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Skywrath_Mage_Arcane_Bolt_1.mp3\/revision\/latest?cb=20191216023606",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд летит со скоростью в 500 единиц. Снаряд во время полета даёт летающий обзор в радиусе 325. Этот обзор не задерживается. Также даёт летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания.",
        "Снаряд во время полета даёт летающий обзор в радиусе 325. Этот обзор не задерживается.",
        "Также даёт летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания.",
        "Проверяет интеллект Skywrath Mage при запуске снаряда. То есть урон снаряда устанавливается при запуске и не меняется при потере или получении интеллекта.",
        "То есть урон снаряда устанавливается при запуске и не меняется при потере или получении интеллекта.",
        "Здесь указано, сколько урона наносит Arcane Bolt с определенным количеством интеллекта, (до уменьшений): Уровень 1 (25 интеллекта): 95\/120\/145\/170 урона Уровень 5 (41 интеллекта): 118\/143\/168\/193 урона Уровень 10 (61 интеллекта): 147\/172\/197\/222 урона Уровень 15 (82 интеллекта): 175\/200\/225\/250 урона Уровень 20 (102 интеллекта): 204\/229\/254\/279 урона Уровень 25 (123 интеллекта): 233\/258\/283\/308 урона Уровень 30 (143 интеллекта): 261\/286\/311\/336 урона",
        "Уровень 1 (25 интеллекта): 95\/120\/145\/170 урона",
        "Уровень 5 (41 интеллекта): 118\/143\/168\/193 урона",
        "Уровень 10 (61 интеллекта): 147\/172\/197\/222 урона",
        "Уровень 15 (82 интеллекта): 175\/200\/225\/250 урона",
        "Уровень 20 (102 интеллекта): 204\/229\/254\/279 урона",
        "Уровень 25 (123 интеллекта): 233\/258\/283\/308 урона",
        "Уровень 30 (143 интеллекта): 261\/286\/311\/336 урона",
        "",
        "С Aghanim's Scepter при использовании способности выбирается другая случайная цель в радиусе поиска для второго снаряда Arcane Bolt. Радиус поиска закреплен за основной целью, а не за Skywrath Mage. Поскольку снаряд использует радиус поиска, а не дальность применения способности, то на него не влияет способности, меняющие дальность (к примеру, Aether Lens). У героев и иллюзий приоритет выше, чем у остальных существ. Считает крипов-героев за крипов. Если подходящих целей не найдено, второй снаряд не выпускается. Талант добавляет к способности третью цель, выбираемую по тем же правилам.",
        "Радиус поиска закреплен за основной целью, а не за Skywrath Mage.",
        "Поскольку снаряд использует радиус поиска, а не дальность применения способности, то на него не влияет способности, меняющие дальность (к примеру, Aether Lens).",
        "У героев и иллюзий приоритет выше, чем у остальных существ. Считает крипов-героев за крипов.",
        "Если подходящих целей не найдено, второй снаряд не выпускается.",
        "Талант добавляет к способности третью цель, выбираемую по тем же правилам."
      ],
      "mana": "90",
      "item_behaviour": [],
      "name": "Arcane Bolt",
      "cooldown": "5\/4\/3\/2",
      "description": "Герой выпускает во врага медленный заряд магической энергии, который наносит урон, зависящий от интеллекта.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,1+0,9",
        "Дальность применения: 875",
        "Количество целей: 1 (TagTalent 2) (TagTalent 2, 3)",
        "Базовый урон: 60\/85\/110\/135",
        "Бонусный урон за интеллект: 1,4",
        "Радиус поиска вторичных целей: 700 (TagTalent 700)",
        "Каждое применение срабатывает на ещё одну случайную цель в радиусе 700 — в первую очередь на героев.",
        "Не проходит сквозь иммунитет к заклинаниям. Полностью проходит сквозь иммунитет к заклинаниям.",
        "Блокируется при попадании как основной, так и вторичной цели."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Skywrath_Mage_Concussive_Shot_1.mp3\/revision\/latest?cb=20191216023609",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "При применении Concussive Shot прерывает произносимые заклинания Skywrath Mage.",
        "Concussive Shot летит со скоростью в 800 единиц. Снаряд во время полета даёт летающий обзор в радиусе 300 единиц. Этот обзор не задерживается. Также даёт летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания.",
        "Снаряд во время полета даёт летающий обзор в радиусе 300 единиц. Этот обзор не задерживается.",
        "Также даёт летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания.",
        "Concussive Shot выбирает в цель ближайшее вражеское существо не являющееся вардом, постройкой или крипом-героем. Приоритизирует героев (включая клонов) выше других существ. Считает иллюзии крипами. Не считает целью невидимых, неуязвимых или спрятанных существ или существ в тумане войны.",
        "Приоритизирует героев (включая клонов) выше других существ. Считает иллюзии крипами.",
        "Не считает целью невидимых, неуязвимых или спрятанных существ или существ в тумане войны.",
        "Урон по области и замедление действуют на ближайших крипов и призванных существ, нанося им 75\/120\/165\/210 урона.",
        "Снаряд сначала наносит урон, а затем применяет дебафф.",
        "С Aghanim's Scepter при использовании способности выбирается другая случайная цель в радиусе поиска для второго снаряда Concussive Shot. Радиус поиска закреплен за основной целью, а не Skywrath Mage. В отличии от первого снаряда, второй не выбирает неуязвимых существ или существ с иммунитетом к заклинаниям. Если подходящих целей не найдено, второй снаряд не выпускается.",
        "Радиус поиска закреплен за основной целью, а не Skywrath Mage.",
        "В отличии от первого снаряда, второй не выбирает неуязвимых существ или существ с иммунитетом к заклинаниям.",
        "Если подходящих целей не найдено, второй снаряд не выпускается."
      ],
      "mana": "80\/85\/90\/95",
      "item_behaviour": [],
      "name": "Concussive Shot",
      "cooldown": "18\/16\/14\/12",
      "description": "Делает выстрел по ближайшему вражескому герою в большой области. При попадании наносит урон врагам в области действия и замедляет их.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+1,03",
        "Радиус поиска: 1600 (TagTalent Глобальная)",
        "Радиус урона и замедления: 250",
        "Число целей: 1 (TagAghanim 2)",
        "Урон по героям: 100\/160\/220\/280",
        "Урон по крипам: 75%",
        "Замедление скорости передвижения: 30%\/35%\/40%\/45%",
        "Длительность замедления: 4",
        "Каждое применение срабатывает на ещё одну случайную цель — в первую очередь на героев.",
        "Может выбрать вражеские цели с иммунитетом к заклинаниям, но они не замедляются и не получают урона. Эффекты по области всё также применяются. Не может выбрать вторичной целью существ с иммунитетом.",
        "Избегание снаряда обезвреживает его."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e1\/Skywrath_Mage_Ancient_Seal.mp3\/revision\/latest?cb=20191216023604",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Снижает общее сопротивление магии героев до 2%\/-1%\/-5%\/-9% (TagTalent -7%\/-10%\/-14%\/-18%).",
        "Уменьшение сопротивления магии не действует на существ не-героев.",
        "Несколько применений на одну и ту же цель не складываются, но обновляют длительность.",
        "С Aghanim's Scepter при использовании способности также выбирается другая случайная цель в радиусе поиска. Радиус поиска закреплен за основной целью, а не Skywrath Mage. У героев и иллюзий приоритет выше, чем у остальных существ. Считает крипов-героев за крипов. Если подходящих целей не найдено, вторая печать не применяется.",
        "Радиус поиска закреплен за основной целью, а не Skywrath Mage.",
        "У героев и иллюзий приоритет выше, чем у остальных существ. Считает крипов-героев за крипов.",
        "Если подходящих целей не найдено, вторая печать не применяется."
      ],
      "mana": "80\/90\/100\/110",
      "item_behaviour": [],
      "name": "Ancient Seal",
      "cooldown": "14 (TagTalent 6)",
      "description": "Оставляет печать древней руны на выбранном существе, запрещая ему применять способности и увеличивая магический урон по нему.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0,97",
        "Дальность применения: 700\/750\/800\/850",
        "Число целей: 1 (TagAghanim 2)",
        "Уменьшение сопротивления магии: 30%\/35%\/40%\/45% (TagTalent 42%\/47%\/52%\/57%)",
        "Длительность: 3\/4\/5\/6",
        "Радиус поиска вторичной цели: 700",
        "Каждое применение срабатывает на ещё одну случайную цель в радиусе 700 — в первую очередь на героев.",
        "При улучшении блокируется только основной целью. Вторичная цель всеравно получает попадает под действие."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Skywrath_Mage_Mystic_Flare_1.mp3\/revision\/latest?cb=20191216023602",
      "effects": [
        "Способность Направленная на область",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "При наличии в радиусе вражеских героев (включая иллюзии, клонов и крипов-героев) только они получат урон.",
        "Игнорирует спрятанных, неуязвимых существ и существ с иммунитетом к заклинаниям, поэтому они не поглощают урон.",
        "Наносит урон с интервалом в 0,1 секунды спустя 0,1 секунды после применения, срабатывая 24 раз.",
        "Здесь указано, сколько урона нанесет Mystic Flare при поражении определенного числа героев за всю длительность (до уменьшений): 1 герой: 31,25\/48,96\/66,67 (TagTalent 50\/67,71\/85,42) за интервал и 750\/1175\/1600 (TagTalent 1200\/1625\/2050) итогового урона. 2 героя: 15,63\/24,48\/33,33 (TagTalent 25\/33,85\/42,71) за интервал и 375\/587,5\/800 (TagTalent 600\/812,5\/1025) итогового урона. 3 героя: 10,42\/16,32\/22,22 (TagTalent 16,67\/22,57\/28,47) за интервал и 250\/391,67\/533,33 (TagTalent 400\/541,67\/683,33) итогового урона. 4 героя: 7,81\/12,24\/16,67 (TagTalent 12,5\/16,93\/21,35) за интервал и 187,5\/293,75\/400 (TagTalent 300\/406,25\/512,5) итогового урона. 5 героев: 6,25\/9,79\/13,33 (TagTalent 10\/13,54\/17,08) за интервал и 150\/235\/320 (TagTalent 240\/325\/410) итогового урона.",
        "1 герой: 31,25\/48,96\/66,67 (TagTalent 50\/67,71\/85,42) за интервал и 750\/1175\/1600 (TagTalent 1200\/1625\/2050) итогового урона.",
        "2 героя: 15,63\/24,48\/33,33 (TagTalent 25\/33,85\/42,71) за интервал и 375\/587,5\/800 (TagTalent 600\/812,5\/1025) итогового урона.",
        "3 героя: 10,42\/16,32\/22,22 (TagTalent 16,67\/22,57\/28,47) за интервал и 250\/391,67\/533,33 (TagTalent 400\/541,67\/683,33) итогового урона.",
        "4 героя: 7,81\/12,24\/16,67 (TagTalent 12,5\/16,93\/21,35) за интервал и 187,5\/293,75\/400 (TagTalent 300\/406,25\/512,5) итогового урона.",
        "5 героев: 6,25\/9,79\/13,33 (TagTalent 10\/13,54\/17,08) за интервал и 150\/235\/320 (TagTalent 240\/325\/410) итогового урона.",
        "",
        "Дебафф скрытый дебафф отвечает за частицы эффектов на пораженных врагах. Его назначение — лишь визуальное. Дебафф размещается аурой и задерживается на 0,5 секунды.",
        "Дебафф размещается аурой и задерживается на 0,5 секунды.",
        "Улучшение Aghanim's Scepter для Skywrath Mage не требует изученного Mystic Flare, так как взаимодействует с каждой его способностью.",
        "С Aghanim's Scepter при использовании способности автоматически применяется вторая Mystic Flare на случайную цель в радиусе поиска, но вне радиуса поля в 170. Радиус поиска закреплен за выбранной областью, а не за Skywrath Mage. При выборе второй цели у героев и иллюзий приоритет выше, чем у остальных существ. Считает крипов-героев за крипов. Игнорирует неуязвимых существ или существ с иммунитетом к заклинаниям, находящихся в радиусе поиска. Если подходящих целей не найдено, второе поле не применяется (но два поля может применится на одного героя).",
        "Радиус поиска закреплен за выбранной областью, а не за Skywrath Mage.",
        "При выборе второй цели у героев и иллюзий приоритет выше, чем у остальных существ. Считает крипов-героев за крипов.",
        "Игнорирует неуязвимых существ или существ с иммунитетом к заклинаниям, находящихся в радиусе поиска.",
        "Если подходящих целей не найдено, второе поле не применяется (но два поля может применится на одного героя)."
      ],
      "mana": "350\/575\/800",
      "item_behaviour": [],
      "name": "Mystic Flare",
      "cooldown": "60\/40\/20",
      "description": "Герой создаёт направленное поле сверхъестественной силы, сокрушая врагов. Поле наносит огромный урон, который равномерно распределяется между героями в области действия в течение сек.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 1200",
        "Радиус поля: 170",
        "Количество полей: 1 (TagAghanim 2)",
        "Итоговый урон: 750\/1175\/1600 (TagTalent 1200\/1625\/2050)",
        "Длительность поля: 2,4",
        "Радиус поиска вторичной цели: 700",
        "Каждое применение срабатывает на ещё одну случайную цель в радиусе 700 — в первую очередь на героев."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки. Эта способность недоступна в режиме Ability Draft.",
        "Эта способность недоступна в режиме Ability Draft.",
        "Не срабатывает на способности предметов, способности с нулевой перезарядкой или на способности которые не провоцируют срабатывание от применения.",
        "Каждый стак имеет собственную длительность, последующие применения заклинаний не обновят длительность предыдущих стаков. Модификатор стака не отображается в интерфейсе. Вместо него отображается модификатор количества, показывая текущее значение стаков на иконке. Хотя модификатор количества развеивается при смерти, стаки на самом деле не развеиваются, так что смерть убирает лишь информацию о текущем количестве стаков.",
        "Модификатор стака не отображается в интерфейсе. Вместо него отображается модификатор количества, показывая текущее значение стаков на иконке.",
        "Хотя модификатор количества развеивается при смерти, стаки на самом деле не развеиваются, так что смерть убирает лишь информацию о текущем количестве стаков.",
        "Каждый стак в итоге даёт 60 маны, 0,25 восстановления маны и 5 урона от атаки."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Улучшение от Aghanim's Shard",
      "cooldown": null,
      "description": "При каждом применении способности даёт +5 к интеллекту и +1 к броне на 35 секунд. Эффекты складываются, но их время не зависит друг от друга.",
      "hot_key": null,
      "params": [
        "Бонусный интеллект за стак: 5",
        "Бонусная броня за стак: 1",
        "Длительность: 35",
        ""
      ],
      "legacy_key": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 4.1,
    "attrAgilityInc": 0.8,
    "attrAgility": 13.0
  },
  "description": "Skywrath Mage — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Данный герой обладает сильными магическими способностями, с помощью которых герой сможет расправиться как с одним, так и несколькими противниками. Способность Arcane Bolt позволяет герою выпускать медленно движущийся сгусток мистической энергии, который наносит урон врагам в зависимости от своего уровня интеллекта. Чем больше показатель интеллекта у Skywrath Mage, тем больше урона он сможет нанести способностью. Concussive Shot — данной способностью герой выстреливает магическим выстрелом в случайного ближайшего врага, замедляя его и нанося урон. Способность не сработает, если поблизости нет противников, или они невидимы. Способность Ancient Seal позволяет герою обезмолвить противника, а также увеличить наносимый ей магический урон на некоторый процент. С помощью Mystic Flare герой создаёт магическое поле, которое наносит немалый урон противникам. Урон от поля равномерно распределяется между противниками, попавших в поле.",
  "history": "Драгонас занимает высокий пост мага при дворе Жуткого гнезда, но дни его полны печали. По праву рождения он обязан защищать любого, кто займёт Терновое гнездо, но действующую королеву скайрасов он ненавидит всем сердцем. Будучи юношей знатного происхождения, он общался и дружил со старшей принцессой скайрасов, Шенделезарой, следующей в очереди на престол. Нежно и непоколебимо он любил её, но когда пришла пора приступить к учёбе, Драгонас с головой погрузился в тайны скайрасской магии. Одержимый неземными материями, он проглядел знаки вполне приземлённых интриг — заговора против Шенделезары — и уже не смог предотвратить его. Когда двор потряс стремительный и жестокий переворот, Драгонас бросил обучение и обнаружил, что потерял своего самого старого и дорогого друга. Терновое Гнездо теперь принадлежало беспощадной младшей сестре Шенделезары, и Драгонас был бессилен что-либо сделать. Магия его служит лишь верным защитникам племени скайрасов, поэтому любые действия против Жуткого гнезда были бы тщетны. Он остался верен своему положению, надеясь, что однажды придёт день, когда его любовь вернёт свое принадлежащее по праву место. Но его тайные помыслы известны лишь богине Скриок, чья магия превратила искалеченное тело Шенделезары в воплощение чистой мести. Драгонас грезит мыслями о возвращении своей возлюбленной королевы в Жуткое гнездо, но ещё более отчаянно мечтает вернуть Шенделезаре полностью исцеленное тело. Будучи благородным и добросердечным существом, он страдает от своего же двуличия, но самая жуткая пытка — представлять ту ненависть к нему, которую хранит в своем сердце Vengeful Spirit.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+450 к урону от Mystic Flare",
      "talentRight": "Arcane Bolt сквозь невосприимчивость к магии"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−12% к сопротивлению магии Ancient Seal",
      "talentRight": "Неограниченная дальность применения Concussive Shot"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1 снаряд Arcane Bolt",
      "talentRight": "−8 сек. к перезарядке Ancient Seal"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 к интеллекту",
      "talentRight": "+175 к здоровью"
    }
  ]
}