{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+150 к дальности атаки",
          "talentRight": "-25 сек. перезарядки Laguna Blade"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30\/2% ускорения за эффект Fiery Soul",
          "talentRight": "+11% к урону от заклинаний"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+130 к урону от Light Strike Array",
          "talentRight": "+350 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-2,5s сек. перезарядки Dragon Slave",
          "talentRight": "+30 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/66\/Lina_Dragon_Slave_1.mp3\/revision\/latest?cb=20191216015459",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Дыхание дракона распространяется со скоростью 1200; требуется 0.9 (TagTalent Ошибка выражения: не ожидаемый оператор <) сек., чтобы достигнуть максимальной дальности.",
        "Задевает существ на расстоянии до 1275 (TagTalent Ошибка выражения: не ожидаемый оператор <) единиц (складывается из дальности прохождения и конечного радиуса).",
        "Область поражения имеет форму конуса."
      ],
      "mana": "100\/115\/130\/145",
      "hotKey": "Q",
      "cooldown": "8 (TagTalent -17)",
      "description": "Герой высвобождает дыхание дракона, сжигающее всех на своём пути.",
      "spellName": "Dragon Slave",
      "params": [
        "Анимация применения: 0,45+0,38",
        "Дальность применения: 800 (TagTalent Ошибка выражения: неопознанный символ пунктуации «,»)",
        "Начальный радиус: 275",
        "Дальность прохождения: 1075 (TagTalent Ошибка выражения: неопознанный символ пунктуации «,»)",
        "Конечный радиус: 200",
        "Урон: 85\/160\/235\/310"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Борясь со скукой в выжженных пустошах Мизрула, волшебница научилась управлять пламенем пустынного дракона.."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Lina_Light_Strike_Array_1.mp3\/revision\/latest?cb=20191216015451",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Light Strike Array уничтожает деревья в затронутой области.",
        "Визуальный эффект и звук во время задержки длительностью 0,5 сек. видны и слышны только союзникам.",
        "У Lina есть две разные анимации для этой способности, поэтому длительность остаточной анимации варьируется."
      ],
      "mana": "100\/105\/110\/115",
      "hotKey": "W",
      "cooldown": "10\/9\/8\/7",
      "description": "Призывает столб пламени, который оглушает врагов и наносит им урон.",
      "spellName": "Light Strike Array",
      "params": [
        "Анимация применения: 0,45+0,67\/0,43",
        "Дальность применения: 625 (TagTalent Ошибка выражения: неопознанный символ пунктуации «,»)",
        "Радиус: 250",
        "Задержка: 0,5",
        "Урон: 80\/130\/180\/230 (TagTalent 210\/260\/310\/360)",
        "Длительность оглушения: 1,6\/1,9\/2,2\/2,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Сущность волшебницы позволяет ей управлять энергией солнца, воспламеняя воздух взмахом рук."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Использование предметов не активирует Fiery Soul.",
        "Применение любого заклинания обновляет длительность эффекта; теоритически, можно постоянно иметь максимальное число зарядов.",
        "2 заряда дают 10%\/12%\/14%\/16% (TagTalent 14%\/16%\/18%\/20%) к скорости передвижения и 80\/120\/160\/200 (TagTalent 140\/180\/220\/260) к скорости атаки.",
        "3 заряда дают 15%\/18%\/21%\/24% (TagTalent 21%\/24%\/27%\/30%) к скорости передвижения и 120\/180\/240\/300 (TagTalent 210\/270\/330\/390) к скорости атаки."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Увеличивает скорость атаки и передвижения всякий раз, когда герой применяет способность. Эффекты способности складываются друг с другом. Действует 12 секунд.",
      "spellName": "Fiery Soul",
      "params": [
        "Максимально эффектов: 3",
        "Доп. скорость передвижения за эффект: 5%\/6%\/7%\/8% (TagTalent 7%\/8%\/9%\/10%)",
        "Доп. скорость атаки за эффект: 40\/60\/80\/100 (TagTalent 70\/90\/110\/130)",
        "Длительность эффекта: 12",
        "Блокирует появление новых накоплений. Уже активные продолжают давать дополнительную скорость атаки и передвижения."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Пляшущие языки огня воплощают игривую натуру волшебницы, высвобождая её внутреннее пламя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f0\/Lina_Laguna_Blade_1.mp3\/revision\/latest?cb=20191216015450",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на точку)",
        "Действует на Врагов",
        "Урон Магический Чистый"
      ],
      "notes": [
        "Применяет к цели дебафф, наносящий урон при его завершении. Дебафф длится 0,25 сек. То есть способность можно избежать с помощью неуязвимости или исчезновения (или иммунитета к заклинаниям, если заклинание не улучшено), пока дебафф не нанес урон.",
        "То есть способность можно избежать с помощью неуязвимости или исчезновения (или иммунитета к заклинаниям, если заклинание не улучшено), пока дебафф не нанес урон.",
        "С Aghanim's Shard Laguna Blade всегда действует по прямой перед Lina, независимо от выбора точки или существа. При выборе существа при применении молния выпускается к его текущему местоположению и проходит всю длину. При применении накладывает бафф на Lina, применяющий после истечнения урон ко всем врагам в области. Бафф длится сек. То есть выбор существа напрямую не гарантирует попадание, поскольку способность не применяет дебафф к врагам. Поражает существ на расстоянии до 975 (TagTalent Ошибка выражения: не ожидаемый оператор <) единиц (складывается из дальности прохождения и длины области).",
        "При выборе существа при применении молния выпускается к его текущему местоположению и проходит всю длину.",
        "При применении накладывает бафф на Lina, применяющий после истечнения урон ко всем врагам в области. Бафф длится сек.",
        "То есть выбор существа напрямую не гарантирует попадание, поскольку способность не применяет дебафф к врагам.",
        "Поражает существ на расстоянии до 975 (TagTalent Ошибка выражения: не ожидаемый оператор <) единиц (складывается из дальности прохождения и длины области)."
      ],
      "mana": "280\/420\/680",
      "hotKey": "R",
      "cooldown": "70\/60\/50",
      "description": "Выпускает разряд молнии в одного врага, нанося сокрушительный урон.",
      "spellName": "Laguna Blade",
      "params": [
        "Анимация применения: 0,45+0,7",
        "Дальность применения: 600 (TagTalent Ошибка выражения: неопознанный символ пунктуации «,») (TagTalent 850, Ошибка выражения: не ожидаемый оператор <)",
        "Задержка: 0,25 (TagTalent 0)",
        "Урон: 500\/700\/900",
        "Длина области: 850 (TagTalent Ошибка выражения: не ожидаемый оператор <)",
        "Ширина области: 125",
        "Способность наносит чистый урон и проходит сквозь невосприимчивость к магии.",
        "Позволяет применять способность на точку и увеличивает её дальность на 250. Молния всегда имеет максимальную длину и срабатывает на всех существ на пути.",
        "Нельзя применить к врагам с иммунитетом к заклинаниям. Пытается нанести урон, если цель получила иммунитет во время задержки. С улучшением заклинание не блокируется иммунитетом.",
        "Блокируется при применении. Частицы всё равно появляются. Игнорирует блокировку заклинаний."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Воздух вокруг волшебницы становится таким горячим, что он обжигает молнией любого врага, подошедшего слишком близко."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 20.0,
    "attrIntelligence": 30.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Lina — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Данный герой отлично подходит для нанесения немалого урона противнику, так как благодаря своим способностям, - Lina может как оглушать противника, так и наносить сокрушительный урон. Способность Dragon Slave позволяет герою сжигать пламенем всё на своем пути, нанося урон. Light Strike Array - дает герою возможность вызывать огненный столб, который наносит урон и оглушает противника на некоторое время. Пассивная способность Fiery Soul дает герою бонусы к скорости боя и передвижения за каждое произнесенное заклинание. Способность Laguna Blade позволяет герою выпустить разряд молнии в противника, нанося огромный урон.",
  "history": "Соперничество огненной волшебницы и её младшей ледяной сестрицы стали поистину легендарными в тех тихих местах, где девочки провели своё буйное детство. И всё же старшая сестра всегда одерживала верх, ведь её горячность и пыл уравновешивались смекалкой и коварством, а вот младшая сестра была проста и наивна. Отчаявшиеся родители несовместимых отпрысков меняли дома один за другим, теряя их то в огне, то во льду. В конце концов они поняли: жить станет проще, если разлучить сестёр. Старшую отправили далеко на юг, к терпеливой тётушке в знойную пустыню Мизрула, погода которой пришлась любительнице огня по душе. Новая соседка тут же всполошила неторопливый местный народ и опалила пальцы и брови далеко не одного горе-ухажёра. Она горда и уверена в себе, и ничто не затушит её пламя.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+150 к дальности атаки",
      "talentRight": "-25 сек. перезарядки Laguna Blade"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30\/2% ускорения за эффект Fiery Soul",
      "talentRight": "+11% к урону от заклинаний"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+130 к урону от Light Strike Array",
      "talentRight": "+350 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-2,5s сек. перезарядки Dragon Slave",
      "talentRight": "+30 к урону"
    }
  ]
}