{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b0\/Ethereal_Blade.mp3\/revision\/latest?cb=20141214003248",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Двойной щелчок по предмету применяет его на владельца.",
        "Снаряд летит со скоростью 1275.",
        "Применяет к цели призрачную форму, давая обезоруживание, иммунитет к атакам и 100% сопротивление физическому урону.",
        "Наносит урон и применяет замедление только к вражеским существам.",
        "Проверяет основной атрибут заклинателя при попадании снаряда.",
        "Заряд сначала применяет дебафф призрачной формы, затем наносит урон, а затем применяет замедление. То есть он усиливает свой собственный урон.",
        "То есть он усиливает свой собственный урон.",
        "Снижает сопротивление магии большинства героев до -5%, учитывая базовое сопротивление в 25% и не учитывая другие его источники.",
        "Снижение сопротивления магии от Ether Blast не сочетается с другими эффектами призрачной формы; приоритет закреплен за источником с наибольшим значением.",
        "Делит перезарядку с Ghost Scepter."
      ],
      "mana": "100",
      "abilityName": "Ether Blast",
      "cooldown": null,
      "description": "Придаёт цели бесплотную форму, которая полностью защищает от физического урона, но не позволяет атаковать и увеличивает получаемый магический урон на 40%. Действует 4 сек. на союзников и 4 на врагов. Также замедляет вражескую цель на 80% и наносит ей магический урон в размере 1.5 * ваш основной атрибут + 125.",
      "params": [
        "Дальность применения: 800",
        "Базовый урон: 125",
        "Основного атрибута в урон: 150%",
        "Замедление скорости передвижения врага: 80%",
        "Снижение сопротивления магии: 40%",
        "Длительность: 4"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_symbol)^Блокируется иммунитетом к заклинаниям\nВсе эффекты остаются, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "(Disjointable_symbol)^Можно избежать\nМогут избежать как враги, так и союзники."
      ],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 200 здоровья, 1 регенерации здоровья, 6,67 брони, 40 скорости атаки, 120 маны, 0,5 регенерации маны и 10 урона от атаки.",
    "Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья, 6,67 брони, 40 скорости атаки, 120 маны, 0,5 регенерации маны и 40 урона от атаки.",
    "Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья, 6,67 брони, 40 скорости атаки, 120 маны, 0,5 регенерации маны и 10 урона от атаки."
  ],
  "cost": "4300",
  "lore": null,
  "consistFrom": [
    "Eaglesong",
    "Ghost Scepter"
  ],
  "boughtFrom": "Оружие",
  "name": "Ethereal Blade",
  "description": "Этот мерцающий призрачный меч бьёт и и по физическому, и по магическому слою реальности.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 к силе",
    "+40 к ловкости",
    "+10 к интеллекту"
  ],
  "tips": null
}