{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7a\/Force_Boots_Force.mp3\/revision\/latest?cb=20191227195705",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "Applies a basic dispel on the target upon cast.",
        "Pushes the target at a speed of 1500.",
        "The target is not disabled during the push, so they still can cast spells or items, attack and turn during the push. This means it does not cancel channeling spells of the target. However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "This means it does not cancel channeling spells of the target.",
        "However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "Does not push the target if they are affected by Black Hole, Chronosphere, Duel, or Flaming Lasso.",
        "Cannot push the target through Kinetic Fields or Arenas of Blood.",
        "If the target is affected by Soulbind, it cannot push them further than its max stretch distance allows.",
        "If the target is leashed by Pounce, the leash gets instantly broken upon cast. However, if the target gets leashed after cast, it cannot push them further than the max stretch distance of Pounce allows.",
        "However, if the target gets leashed after cast, it cannot push them further than the max stretch distance of Pounce allows.",
        "Cannot be cast on wards or buildings. Can be cast on Homing Missiles.",
        "Can move the target over impassable terrain. Trees within 100 radius around them get destroyed during the push.",
        "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement.",
        "Does not share cooldown with Force Staff or Hurricane Pike."
      ],
      "mana": "75",
      "abilityName": "Force",
      "cooldown": "8",
      "description": "Dispels the user and pushes them 750 units in the direction they are facing.",
      "params": [
        "Cast Range: 750",
        "Push Distance: 750",
        "Push Duration: 0.5",
        "Can be cast on self while spell immune. Cannot be cast on other spell immune units."
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "Speed Unlock",
      "cooldown": null,
      "description": "Completely removes the speed limit for the wearer",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Force Boots are fully sharable.",
    "Movement speed bonuses from multiple pairs of boots do not stack.",
    "Stacks with all other movement speed bonuses."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Force Boots",
  "description": "Elusive marvels never successfully studied for proper classification in the archives.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+115 Movement Speed"
  ],
  "tips": null
}