{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The evasion talent stacks multiplicatively with other sources of evasion."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Battle Trance Strong Dispels",
          "talentRight": "+2s Battle Trance Duration"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 Damage",
          "talentRight": "20% Evasion"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+90 Whirling Axes Damage",
          "talentRight": "+5 Fervor Attack Speed"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+25 Berserker's Rage Movement Speed",
          "talentRight": "+7 Berserker's Rage Armor"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Troll_Warlord_Berserker%27s_Rage_1.mp3\/revision\/latest?cb=20191216025527",
      "effects": [
        "Ability Toggle",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not interrupt Troll Warlord's channeling abilities upon toggling.",
        "Toggling On disables Whirling Axes (Ranged) and then enables Whirling Axes (Melee). Turns Troll Warlord into a melee unit with 150 attack range for its duration. This causes items that use different values for melee and ranged heroes (e.g. Manta Style) to now treat the caster as a melee hero. Attack range bonuses are not overridden and still work normally.",
        "Turns Troll Warlord into a melee unit with 150 attack range for its duration.",
        "This causes items that use different values for melee and ranged heroes (e.g. Manta Style) to now treat the caster as a melee hero.",
        "Attack range bonuses are not overridden and still work normally.",
        "When toggling On while a ranged projectile is airborne, the projectile is treated as a melee attack by items, but it does not proc Berserker's Rage's root chance. These attacks landed are also considered as melee attacks, and therefore using melee values (i.e. can cleave, bash etc.). However, Quelling Blade uses the ranged values if Troll Warlord is in ranged form at the start of the projectile.",
        "These attacks landed are also considered as melee attacks, and therefore using melee values (i.e. can cleave, bash etc.).",
        "However, Quelling Blade uses the ranged values if Troll Warlord is in ranged form at the start of the projectile.",
        "Berserker's Rage melee and ranged form persists through Troll Warlord's death. He respawns with the same form as he dies.",
        "The root proccing attack first applies the debuff, then its own damage. Provides True Sight over the target for its duration. Berserker's Rage's proc chance uses pseudo-random distribution.",
        "Provides True Sight over the target for its duration.",
        "Berserker's Rage's proc chance uses pseudo-random distribution.",
        "The root does not work against allied units, wards and buildings.",
        "When toggled Off, all changes are reverted and he becomes a ranged unit again."
      ],
      "mana": "0",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "While active, Troll Warlord swaps from using ranged to melee attacks. Melee attacks have a chance to ensnare, preventing the target from moving or using mobility spells. Berserker's Rage also grants additional movement speed, armor, and decreases base attack time. Whirling Axes has different functionality while Berserker's Rage is active.",
      "spellName": "Berserker's Rage",
      "params": [
        "Cast Animation: 0+0",
        "Armor Bonus: 4\/5\/6\/7 (TagTalent 11\/12\/13\/14)",
        "Move Speed Bonus: 15\/25\/35\/45 (TagTalent 40\/50\/60\/70)",
        "Attack Range Loss: 350",
        "Base Attack Time: 1.45",
        "Root Chance: 14%\/16%\/18%\/20%",
        "Root Duration: 0.8\/1.2\/1.6\/2",
        "The rooting is disabled, all other components are not.",
        "Melee illusions cannot root."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Troll_Warlord_Whirling_Axes_%28Ranged%29_1.mp3\/revision\/latest?cb=20191216025521",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Whirling Axes (Ranged) is only available when Berserker's Rage is toggled Off.",
        "The axes travel at a speed of 1500, taking 0.63 seconds to travel the full distance.",
        "Spawns 5 axes which spread up to 25° and affect units within 100 radius around them. Has no starting radius, the axes spawn at one point in front of Troll Warlord. So the total area is shaped like a cone.",
        "Has no starting radius, the axes spawn at one point in front of Troll Warlord. So the total area is shaped like a cone.",
        "With the travel distance and axes radius, it can hit units up to 1050 range away.",
        "The axes first apply a basic dispel, then the damage, then the debuff.",
        "Does not affect Roshan.",
        "While Battle Trance is active, Whirling Axes (Ranged) has an instant cast time and does not require Troll Warlord to face the targeted direction."
      ],
      "mana": "60 (TagTalent 30)",
      "hotKey": "W",
      "cooldown": "9 (TagTalent 4)",
      "description": "Troll hurls a fistful of five axes in a cone shape over 950 range, slowing and damaging enemy units.",
      "spellName": "Whirling Axes (Ranged)",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: 950",
        "Axes Travel Distance: 950",
        "Axes Radius: 100",
        "Axes Spread End Radius: 206.17",
        "Damage: 90 (TagTalent 180)",
        "Move Speed Slow: 40%",
        "Slow Duration: 2.5\/3\/3.5\/4",
        "Causes Ranged Axes to dispel enemies. Reduces cooldown and manacost.",
        "Slow persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Troll_Warlord_Whirling_Axes_%28Melee%29_1.mp3\/revision\/latest?cb=20191216025518",
      "effects": [
        "Ability No Target",
        "Affects Enemies (TagAghanim Self)",
        "Damage Magical"
      ],
      "notes": [
        "Whirling Axes (Melee) is only available when Berserker's Rage is toggled On.",
        "Interrupts Troll Warlord's channeling abilities upon cast.",
        "The axes travel out at a speed of 1250 and move out at a speed of 233.33 until reaching the max distance in 1.5 seconds, and then returning to Troll Warlord at the same speed. The axes always spawn towards east and west at Troll Warlord's position and rotate clockwise. With the max spin radius and axes radius, it can hit units up to 450 range away.",
        "The axes always spawn towards east and west at Troll Warlord's position and rotate clockwise.",
        "With the max spin radius and axes radius, it can hit units up to 450 range away.",
        "The axes first apply the damage, then the debuff.",
        "Only units within 100 range of an axe are damaged and blinded. The visual effects of this ability are offset and do not reflect the actual currently affected area. The full damage and debuff are dealt the first time when a unit comes in contact with an axe, being hit by the other axe does not deal extra damage or reapply the debuff.",
        "The visual effects of this ability are offset and do not reflect the actual currently affected area.",
        "The full damage and debuff are dealt the first time when a unit comes in contact with an axe, being hit by the other axe does not deal extra damage or reapply the debuff.",
        "Whirling Axes' blind uses pseudo-random distribution.",
        "Does not affect Roshan.",
        "If Troll Warlord dies, the ability ends and the axes disappear.",
        "With Aghanim's Scepter, applies a basic dispel on Troll Warlord upon cast."
      ],
      "mana": "50 (TagTalent 25)",
      "hotKey": "E",
      "cooldown": "9 (TagTalent 4)",
      "description": "Troll hurls two axes around him in a close range area of effect, damaging enemy units and causing them to miss some attacks.",
      "spellName": "Whirling Axes (Melee)",
      "params": [
        "Cast Animation: 0+0",
        "Spin Radius: 350",
        "Axes Radius: 100",
        "Damage: 50\/100\/150\/200 (TagTalent 140\/190\/240\/290)",
        "Miss Chance: 60%",
        "Blind Duration: 5",
        "Whirl Duration: 3",
        "Causes Melee Axes to dispel Troll Warlord. Reduces cooldown and manacost.",
        "Blind effect persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Troll Warlord gains or loses stacks as soon as his attacks land on the target. This means that missed or disjointed attacks do not count, and in ranged form, it reacts on projectile hit, not on launch.",
        "This means that missed or disjointed attacks do not count, and in ranged form, it reacts on projectile hit, not on launch.",
        "This is how much attack speed Fervor grants with a certain amount of stacks on each level. Level 1: 15\/30\/45\/60\/75\/90\/105\/120\/135\/150\/165\/180 Level 2: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240 Level 3: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300 Level 4: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360 At level 4 with the attack speed bonus increasing talent, Ferver grants 35\/70\/105\/140\/175\/210\/245\/280\/315\/350\/385\/420 attack speed bonus per stack.",
        "Level 1: 15\/30\/45\/60\/75\/90\/105\/120\/135\/150\/165\/180",
        "Level 2: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240",
        "Level 3: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300",
        "Level 4: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360",
        "",
        "At level 4 with the attack speed bonus increasing talent, Ferver grants 35\/70\/105\/140\/175\/210\/245\/280\/315\/350\/385\/420 attack speed bonus per stack.",
        "When already having stacks, the first attack against a new target removes the previous stacks, without granting a new stack.",
        "Fervor works against any unit, including allies, wards and buildings."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "With each continuous blow on the same target, Troll gains increased attack speed. If Troll changes targets, the stacks drop to zero.",
      "spellName": "Fervor",
      "params": [
        "Max Stacks: 12",
        "Attack Speed Bonus per Stack: 15\/20\/25\/30 (TagTalent 20\/25\/30\/35)",
        "Does not prevent gaining new stacks. Nullifies the bonus attack speed of all stacks."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target",
        "Affects Allies"
      ],
      "notes": [
        "Requires Aghanim's Shard upgrade to be unlocked.",
        "Rampage interrupts Troll Warlord's channeling abilities upon cast.",
        "Affects ally heroes, clones, illusions (even if they are invulnerable or hidden). Does not affect creep-heroes.",
        "Does not affect creep-heroes.",
        "Rampage works independently from Berserker's Rage. When cast, it checks for the caster's current range type. Creates red particles if the caster was melee on cast, and teal if they were ranged. Rampage checks for the caster's range type periodically and updates the buff immediately. However, the particle effects do not update. For example, when cast by Rubick during Wolf Form, Rampage grants status resistance bonus.",
        "When cast, it checks for the caster's current range type.",
        "Creates red particles if the caster was melee on cast, and teal if they were ranged.",
        "Rampage checks for the caster's range type periodically and updates the buff immediately. However, the particle effects do not update.",
        "For example, when cast by Rubick during Wolf Form, Rampage grants status resistance bonus.",
        "The status resistance stacks multiplicatively with other sources of status resistance.",
        "Despite the tooltip, the buff is dispellable by any dispel and it fully works on spell immune allies.",
        "Increases self attack speed bonus to 210\/240\/270 while Troll Warlord is in ranged form and Battle Trance is active."
      ],
      "mana": "75",
      "hotKey": "F",
      "cooldown": "80",
      "description": "Global active. Grants all allied heroes 70 Attack Speed or 25% Status Resistance for 5 seconds based on whichever stance Troll is currently in. Ranged provides attack speed and melee provides status resistance.",
      "spellName": "Rampage",
      "params": [
        "Cast Animation: 0+0",
        "Radius: Global",
        "Attack Speed Bonus (TagTalentRanged): 70",
        "Status Resistance Bonus (TagTalentMelee): 25%",
        "Duration: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Troll_Warlord_Battle_Trance_1.mp3\/revision\/latest?cb=20191216025526",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Battle Trance interrupts Troll Warlord's channeling abilities upon cast.",
        "Applies a basic dispel on Troll Warlord upon cast.",
        "Battle Trance first applies the buff, then the dispel.",
        "When cast while not attacking, Troll Warlord automatically chooses an attack target within the search radius. Prioritizes heroes over other units. Uses ◉ Standard auto-attack rules to decide for attack targets. Does not target Roshan, buildings, wards, allies, invulnerable or attack immune enemies.",
        "Prioritizes heroes over other units. Uses ◉ Standard auto-attack rules to decide for attack targets.",
        "Does not target Roshan, buildings, wards, allies, invulnerable or attack immune enemies.",
        "When cast while already attacking a target, Troll Warlord sticks to that target, even if it is Roshan, buildings, wards, or an ally. He only switches the current attack target when it becomes unattackable (turns invulnerable or attack immune, or dies).",
        "He only switches the current attack target when it becomes unattackable (turns invulnerable or attack immune, or dies).",
        "Grants shared vision over the current attack target as long as he stays within 900 range of the target, revealing it through the Fog of War. Does not provide True Sight.",
        "While attacking, Troll Warlord becomes almost fully uncontrollable. He is hasted, fully ignoring movement speed slows, and completely ignores taunts. He can only be ordered to toggle Berserker's Rage, or cast Whirling Axes and Rampage. Fear and Hypnosis can stop him from attacking and cause conflicting movement. When no enemies are nearby, he becomes controllable and can be affected by movement speed slows again, until another visible enemy enters the search radius.",
        "He can only be ordered to toggle Berserker's Rage, or cast Whirling Axes and Rampage.",
        "Fear and Hypnosis can stop him from attacking and cause conflicting movement.",
        "When no enemies are nearby, he becomes controllable and can be affected by movement speed slows again, until another visible enemy enters the search radius.",
        "Prevents Troll Warlord from dying by setting his minimum health to 1. This means he cannot die to damage, not even damage flagged as HP removal, so that it prevents him from dying to False Promise's delayed damage. Does not protect him against Culling Blade's kill threshold, or Wraith Delay expiring. Stops Ice Blast from shattering him when Battle Trance is active while below the shatter threshold.",
        "This means he cannot die to damage, not even damage flagged as HP removal, so that it prevents him from dying to False Promise's delayed damage.",
        "Does not protect him against Culling Blade's kill threshold, or Wraith Delay expiring.",
        "Stops Ice Blast from shattering him when Battle Trance is active while below the shatter threshold.",
        "Damage taken is technically not reduced, so any damage event still registers the full damage.",
        "The Battle Trance strong dispel talent turns the basic dispel into a strong dispel. Also allows Battle Trance to be cast while stunned, cycloned, taunted, slept, hidden, or during Forced Movement. Does not allow it from being cast while silenced, hexed or prevented from acting. Troll Warlord is unable to ⇧ Shift-queue this ability upon learning the talent.",
        "Also allows Battle Trance to be cast while stunned, cycloned, taunted, slept, hidden, or during Forced Movement.",
        "Does not allow it from being cast while silenced, hexed or prevented from acting.",
        "Troll Warlord is unable to ⇧ Shift-queue this ability upon learning the talent."
      ],
      "mana": "150",
      "hotKey": "R",
      "cooldown": "90\/80\/70",
      "description": "Troll unleashes a powerful battle trance, that forces you to continuously attack the closest enemy unit within 900 range, prioritizing heroes. Damage does not kill you during this mode. Grants you bonus lifesteal, attack speed and movement speed. Applies a Basic Dispel.",
      "spellName": "Battle Trance",
      "params": [
        "Cast Animation: 0+0.5",
        "Enemy Search Radius: 900",
        "Lifesteal: 40%\/60%\/80%",
        "Self Move Speed Bonus: 25%\/30%\/35%",
        "Self Attack Speed Bonus: 140\/170\/200",
        "Duration: 6.5 (TagTalent 8.5)",
        "Grants a new ability: Rampage."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 21.0,
    "attrIntelligence": 13.0,
    "attrIntelligenceInc": 1.0,
    "attrAgilityInc": 3.3,
    "attrAgility": 21.0
  },
  "description": "Jah'rakal, the Troll Warlord, is a ranged agility hero able to output mighty damage competitively at range and in melee. His Berserker's Rage gives him the unique ability to change his attack position from ranged to melee and back at will as the situation warrants. When in close combat, his stats are increased accordingly: he gains bonus armor, movement speed, reduced base attack time, and the ability to root. Not only does this greatly improve the Troll Warlord, but allows him to overpower most other carries, as well as permanently ensnare a target for extended amounts of time. The Troll Warlord is an axe specialist, using them in his unique Whirling Axes, which has two variations: the first is available to his ranged form wherein he throws axes in a cone formation to damage and slow enemies. The second is available to his melee form, whirling axes around himself in a small radius to damage and blind nearby enemies. In keeping with his savage nature, Fervor builds up the Warlord's momentum, granting him attack speed with each consecutive hit on the same target, though the momentum is lost upon switching targets. His Ultimate, Battle Trance, increases his attack speed further, boosts his movement speed, prevents death and grants lifesteal at the expense of almost complete loss of control when enemies are nearby, mindlessly attacking them. Notorious for his superbly fast attack speed that can be matched by few, Jah'rakal is truly a force to be reckoned with.",
  "history": "It's an easy thing to offend a troll. A prickly and contentious race, trolls thrive on argument and strife, missing no excuse to raise their voices in dispute. Males grow to maturity in subterranean chambers beneath their matriarch's domicile, feeding and amusing themselves while contributing nothing. Often they stay for years beyond the age of maturity, while the matriarch provides them with sustenance. When young trolls are finally pushed from their sub-chamber, they gather with others of their kind, forming roving gangs of malcontents who complain loudly about all manner of vexation. As much as trolls love to argue, imagine how rare it is for a troll to be driven from his own kind for being too difficult to get along with. Such was Jah'rakal's fate, a monger troll from deep in the Hoven. So deluded was he, so bitter and abrasive, that even other trolls found his company intolerable. After one particularly vitriolic outburst in which he claimed the lion's share of loot from their latest raid, his cohorts finally snapped. They turned on him, beat him with clubs, and drove him from the encampment. Enraged at his banishment, he returned the next day, armed with steel, and slew them all, one by one. He then swore a blood oath: he would ever after be a fighting force unto himself. Now he roams the world as the Troll Warlord, bitter and angry, the Imperial high commander of an army of one.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Battle Trance Strong Dispels",
      "talentRight": "+2s Battle Trance Duration"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 Damage",
      "talentRight": "20% Evasion"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+90 Whirling Axes Damage",
      "talentRight": "+5 Fervor Attack Speed"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+25 Berserker's Rage Movement Speed",
      "talentRight": "+7 Berserker's Rage Armor"
    }
  ]
}