{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-12 сек. восстановления заряда Fire Remnant",
          "talentRight": "2 заряда Sleight of Fist"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+65 к доп. урону героям от Sleight of Fist",
          "talentRight": "+8% к урону от заклинаний"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1 сек. действия Searing Chains",
          "talentRight": "+50 к урону в секунду от Flame Guard"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+280 к поглощению урона от Flame Guard",
          "talentRight": "+15 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ef\/Searing_Chains.mp3\/revision\/latest?cb=20141203191620",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Searing Chains прерывает произносимые способности Ember Spirit.",
        "Несмотря на визуальные эффекты, эффект от Searing Chains применяется мгновенно и его нельзя избежать.",
        "Способность применяется на случайных существ рядом с Зином, для неё нет приоритетных целей.",
        "Применяет оцепенение к целям, предотвращая их передвижение и использование способностей для перемещения. Дает эффект True Sight на цели. Не дает обзор, если способность была применена в момент ухода в невидимость у способностей, дающих невидимость.",
        "Дает эффект True Sight на цели. Не дает обзор, если способность была применена в момент ухода в невидимость у способностей, дающих невидимость.",
        "Не действует на невидимых существ или существ в тумане войны.",
        "Наносит урон с интервалом в 0,5 секунды спустя 0,5 секунды после применения, нанося урон 3\/4\/5\/6 (TagTalent 5\/6\/7\/8) раз.",
        "Может нанести до 75\/150\/225\/300 (TagTalent 125\/225\/315\/400) единиц урона каждому существу (до уменьшений)."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10",
      "description": "Герой выпускает горящие бола, которые удерживают врагов на месте и наносят каждые 0.5 секунд урон.",
      "spellName": "Searing Chains",
      "params": [
        "Анимация применения: 0+0,87",
        "Радиус: 400",
        "Максимум целей: 2",
        "Урон в секунду: 50\/75\/90\/100",
        "Длительность: 1.5\/2\/2.5\/3 (TagTalent 2,5\/3\/3,5\/4)",
        "Эффект оцепенения остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Самые суровые уроки Сина проходят с использованием раскалённых докрасна цепей."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Sleight_of_Fist.mp3\/revision\/latest?cb=20150223111555",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Ember Spirit неуязвим, пока действует Sleight of Fist. Способность не позволяет избегать снаряды.",
        "Пока действует Sleight of Fist, способность неактивна, поэтому её нельзя повторно использовать до завершения предущего применения.",
        "Во время Sleight of Fist Ember Spirit лишь обезоруживается, поэтому он может совершать любые действия.",
        "При использовании все цели в области помечаются. Над ними появляется горящий меч в виде индикатора, который остается до того момента, пока они не получат удар.",
        "Для Sleight of Fist нет лимита по дальности. Получив отметку, цель не может избежать Sleight of Fist, увеличив дистанцию.",
        "Не действует на невидимых существ или существ с иммунитетом к атакам. Если отмеченное существо получает любой из этих эффектов состояния, способность его пропускает.",
        "Действует на существ в тумане войны. Они также получают отметку и урон.",
        "Скачки происходят с интервалом в 0,2 секунды. Они происходят в случайном порядке между всеми отмеченными существами без какого-либо приоритета.",
        "С каждым скачком Ember Spirit находится в 50 единицах от его цели на линии между ней и местом применения Sleight of Fist.",
        "С каждым прыжком Ember Spirit совершает мгновенную атаку по целям. То есть на удары (как и на обычные атаки) может сработать любой модификатор атаки или эффект, срабатывающий при ударе. Если Ember Spirit ослеплен, то удары могут промахнутся, кроме случая, когда у него есть эффект точности. Также удары могут промахнутся из-за уклонения. Если Ember Spirit обезоружен, при скачках мгновенные атаки совершаться не будут. Мгновенные атаки не выводят из невидимости от Smoke of Deceit.",
        "То есть на удары (как и на обычные атаки) может сработать любой модификатор атаки или эффект, срабатывающий при ударе.",
        "Если Ember Spirit ослеплен, то удары могут промахнутся, кроме случая, когда у него есть эффект точности. Также удары могут промахнутся из-за уклонения.",
        "Если Ember Spirit обезоружен, при скачках мгновенные атаки совершаться не будут.",
        "Мгновенные атаки не выводят из невидимости от Smoke of Deceit.",
        "После совершения ударов по всем отмеченным целям, Ember Spirit возвращается к месту, где он использовал Sleight of Fist. Это место отмечается духом на всё время действия.",
        "Это место отмечается духом на всё время действия.",
        "Использование Activate Fire Remnant отменяет Sleight of Fist. Остальные источники принудительного движения этого не делают."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "18\/14\/10\/6 (TagTalent 0)",
      "description": "Герой стремительно атакует всех врагов в указанной области, а затем возвращается к своему исходному местонахождению. Крипам наносится только часть дополнительного урона.",
      "spellName": "Sleight of Fist",
      "params": [
        "Анимация применения: 0+0,7",
        "Дальность применения: 700",
        "Радиус: 250\/350\/450\/550",
        "Интервал между прыжками: 0,2",
        "Доп. урон по героям: 40\/80\/120\/160 (TagTalent 105\/145\/185\/225)",
        "Уменьшение урона по крипам: 40%",
        "Число зарядов: 0 (TagTalent 2)",
        "Время восстановления заряда: 0 (TagTalent 18\/14\/10\/6)"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Опытный воин должен маневрировать и пробиваться сквозь врагов, сжигая всех на своем пути."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Flame_Guard.mp3\/revision\/latest?cb=20141203191545",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Flame Guard прерывает произносимые способности Ember Spirit.",
        "Наносит 5\/7\/9\/11 (TagTalent 15\/17\/19\/21) единиц урона с интервалом в 0,2 секунды спустя 0,2 секунды после применения.",
        "Может нанести до 275\/490\/765\/1100 (TagTalent 825\/1190\/1615\/2100) урона одному существу (до уменьшений), учитывая максимальную длительность Flame Guard.",
        "Блокирует урон (до учета любых уменьшений), кроме момента, когда действует иммунитет к заклинаниям, когда способность не блокирует никакой магический урон.",
        "Повторное использование Flame Guard обновляет бафф и сбрасывает впитанный барьером урон.",
        "Не сочетается с другими источниками магического барьера. Если на существо действует несколько источников барьера, они все впитывают одинаковое количество урона одновременно.",
        "Если на существо действует несколько источников барьера, они все впитывают одинаковое количество урона одновременно.",
        "Блокирует только магический урон, исходящий от способностей и атак. Не блокирует физический или чистый урон."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "E",
      "cooldown": "35",
      "description": "Окружает героя огненным щитом, который полностью поглощает магический урон и наносит периодический урон всем противникам вокруг. Если щит разбить, то защита и урон по площади пропадут.",
      "spellName": "Flame Guard",
      "params": [
        "Анимация применения: 0+1,07",
        "Радиус: 400",
        "Урон в секунду: 25\/35\/45\/55 (TagTalent 75\/85\/95\/105)",
        "Поглощение маг. урона: 80\/220\/360\/500 (TagTalent 360\/500\/640\/780)",
        "Длительность: 11\/14\/17\/20"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Врагу нельзя давать легко приблизиться."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fd\/Activate_Fire_Remnant.mp3\/revision\/latest?cb=20141203191407",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Ember Spirit перемещается к Fire Remnant со скоростью в 1300 единиц или за 0,4 секунды, в зависимости от того, что произойдет быстрее.",
        "В момент полета к Fire Remnant Ember Spirit неуязвим.",
        "Расход маны для активации способности всегда одинаков, независимо от того, на какое количество копий герой летит.",
        "Fire Remnant не позволяет избегать снаряды, которые летят в героя, когда он использует способность.",
        "Во время применения способности Ember Spirit может атаковать, использовать способности и предметы (но герой все равно должен смотреть в сторону цели).",
        "Принудительное движение отменяет движение от Activate Fire Remnant и убирает неуязвимость. При этом копии остаются использованными и Ember Spirit мгновенно перемещается к месту расположения последнего, когда он врывается.",
        "При этом копии остаются использованными и Ember Spirit мгновенно перемещается к месту расположения последнего, когда он врывается.",
        "Всегда сначала перемещается к самому дальнему Fire Remnant от выбранной точки.",
        "Ember Spirit наносит урон врагам в радиусе 225 при движении и в радиусе 450 при достижении копии. Враги получают урон только один раз за копию: либо в момент движения, либо при достижении копии Ember Spirit.",
        "Враги получают урон только один раз за копию: либо в момент движения, либо при достижении копии Ember Spirit.",
        "Уничтожает деревья в радиусе 200 единиц вокруг Ember Spirit при перемещении к копии. Поскольку герой летит с высокой скоростью, часть деревьев может быть пропущена.",
        "Поскольку герой летит с высокой скоростью, часть деревьев может быть пропущена."
      ],
      "mana": "150 (TagTalent 75)",
      "hotKey": "D",
      "cooldown": "0",
      "description": "Выбрать, к какому Fire Remnant переместиться.",
      "spellName": "Activate Fire Remnant",
      "params": [
        "Анимация применения: 0+1,07",
        "Дальность применения: Глобальная",
        "Радиус урона копии: 450",
        "Урон: 100\/200\/300",
        "Способность Activate Fire Remnant расходует меньше маны."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Дух летит стремительно, словно голодное пламя пожара!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Fire_Remnant.mp3\/revision\/latest?cb=20150210233925",
      "effects": [
        "Способность Направленная на точку"
      ],
      "notes": [
        "При изучении Fire Remnant Ember Spirit сразу получает все 0 (TagTalent ) заряда. При первом получении Aghanim's Scepter у героя сразу активны 2 заряда. Повторное получение предмета зарядов не дает.",
        "При первом получении Aghanim's Scepter у героя сразу активны 2 заряда. Повторное получение предмета зарядов не дает.",
        "Копии движутся к выбранной области с увеличенной на 0 (TagTalent ) скоростью передвижения Ember Spirit. Скорость фиксируется при использовании и не адаптируется.",
        "Скорость фиксируется при использовании и не адаптируется.",
        "Поскольку копия Fire Remnants существует 45 секунд, а время восстановления заряда составляет 38 (TagTalent 26), то одновременно можно установить 4 (TagTalent 4) (TagTalent 6, 6)) копии.",
        "Каждый раз, устанавливая копию Fire Remnant, Ember Spirit получает значок баффа, отображающий время жизни копии. Значок баффа исчезает при истечении действия копии или при её использовании.",
        "Fire Remnants видны всем. Они не дают обзора и с их помощью нельзя разведать, что находится в тумане войны.",
        "При истечении времени жизни Fire Remnants не наносят урона.",
        "При улучшении с Aghanim's Shard, копии Fire Remnants наносят 22,5 урона каждые 0,5 секунд, начиная спустя 0,5 после получения негативного эффекта. Копии наносят урон с момента своего создания, то есть они начинают его наносить ещё только при полёте к точке, куда была применена способность. Урон от нескольких копий не сочетается. Источником урона считается Ember Spirit, а не копии. Урон наносится аурой, её задержка состаляет 0,5 секунд.",
        "Копии наносят урон с момента своего создания, то есть они начинают его наносить ещё только при полёте к точке, куда была применена способность.",
        "Урон от нескольких копий не сочетается.",
        "Источником урона считается Ember Spirit, а не копии.",
        "Урон наносится аурой, её задержка состаляет 0,5 секунд.",
        "При улучшении с Aghanim's Shard, убийство любого героя (включая клонов, исключая иллюзии) будет восстанавливать один заряд. Это также случится если вражеский герой умрёт в радиусе 400 от Ember Spirit. Добивание не считается. Заряд восстановится даже в том случае, если вражеский герой имел воскрешение.",
        "Это также случится если вражеский герой умрёт в радиусе 400 от Ember Spirit. Добивание не считается.",
        "Заряд восстановится даже в том случае, если вражеский герой имел воскрешение.",
        "При улучшении с Aghanim's Shard на месте смерти Ember Spirit будет оставаться копия Fire Remnant."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Герой создает свою огненную копию, которая бежит к указанному месту со скоростью в 2,5 раза большей скорости героя. На это расходуется один из 0 зарядов способности, которые восстанавливаются по 250% секунд. Используя способность Activate Fire Remnant, герой может быстро переместиться по всем копиям, отчего они взорвутся и нанесут урон противникам. Выбранная копия будет конечной целью полёта.",
      "spellName": "Fire Remnant",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 1400 (TagAghanim 3500)",
        "Радиус смерти врагов: 0 (TagTalent 400)",
        "Радиус урона: 0 (TagTalent 600)",
        "Урон в секунду: 0 (TagTalent 45)",
        "Скорость копии: 250% (TagAghanim 500%)",
        "Длительность копии: 45",
        "Задержка ауры урона: 0 (TagTalent 0,5)",
        "Число зарядов: 3 (TagAghanim 5)",
        "Время восстановления заряда: 38 (TagTalent 26)",
        "Увеличивает дальность применения, скорость передвижения копии и максимум зарядов.",
        "Огненные копии от способности Fire Remnant наносят 45 урона в секунду врагам в радиусе 600. Владелец способности оставит рядом огненную копию, если убьёт вражеского героя в радиусе 400 или умрёт. Урон от нескольких копий не складывается."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Сила духа не даёт учению Сина затухнуть."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 21.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.6,
    "attrAgility": 22.0
  },
  "description": "Ember Spirit — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Searing Chains, выпускает горящие болы, которые удерживают врагов на месте и наносят ежесекундный урон. Вторая способность, Sleight of Fist, позволяет герою стремительно атаковать всех врагов в указанной области, затем возвращая его к его исходному местонахождению. Третья способность, Flame Guard, окружает Ember Spirit огненным щитом, который поглощает магический урон. Когда способность активна, она наносит периодический урон по площади вокруг Ember Spirit. Ультимативной способностью, Fire Remnant, герой создает свою огненную копию, которая бежит к указанному месту. Используя Activate Fire Remnant, Ember Spirit может быстро переместиться по всем копиям, взрывая их и нанося урон по площади.",
  "history": "Крепость Непослушного пламени затеряна среди Скулящих гор, пусты её учебные залы, листвой и пылью застелены её дворы. На помосте в запечатанном храме стоит топазовый котёл, наполненный древним пеплом погребального костра воина-поэта Сина. Три поколения он обучал своих последователей технике Оков хранящего пламени — набору мантр для тренировки ума и тела, подготавливая их к суровой жизни за крепостной стеной. Преподавая путь воина, Син нажил себе воинов-врагов, и когда наступила осень его жизни, противники превзошли и убили его. Верные последователи разлетелись по миру, словно пепел. Года сменялись веками, последователи — потомками, но его учение передавалось тихим шёпотом из уст в уста. Тронутый многолетним наследием учителя, Горящий небожитель — пытливое проявление огня — бросился в крепость, и вновь воспламенил останки. Из раскалённых углей появился образ охваченного пламенем Сина. Он вновь готов невозмутимо обучать своей мудрости, и вновь готов дарить огонь познания всем, кто ищет наставления.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-12 сек. восстановления заряда Fire Remnant",
      "talentRight": "2 заряда Sleight of Fist"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+65 к доп. урону героям от Sleight of Fist",
      "talentRight": "+8% к урону от заклинаний"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1 сек. действия Searing Chains",
      "talentRight": "+50 к урону в секунду от Flame Guard"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+280 к поглощению урона от Flame Guard",
      "talentRight": "+15 к урону"
    }
  ]
}