{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Эффект от Corrosive Haze нельзя развеять",
          "talentRight": "−4 сек. перезарядки Slithereen Crush"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+4 к снижению брони от Corrosive Haze",
          "talentRight": "+25% к вампиризму"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+60 урона от Bash of the Deep",
          "talentRight": "+325 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к урону",
          "talentRight": "+7 здоровья в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Slardar_Guardian_Sprint.mp3\/revision\/latest?cb=20191216023816",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Guardian Sprint не прерывает произносимые заклинания Slardar.",
        "Применяет к Slardar сквозное передвижение, позволяя проходить сквозь других существ и варды, пока действует способность.",
        "Бонусы от реки активируются, пока Slardar непосредственно находится в воде. То есть, если герой перемещается вертикально, то бонусы прекращают действие до соприкосновения с водой. Бонусы от реки не задерживаются.",
        "То есть, если герой перемещается вертикально, то бонусы прекращают действие до соприкосновения с водой.",
        "Бонусы от реки не задерживаются.",
        "Несколько источников бонусов не сочетаются.",
        "Сопротивление эффектам от Aghanim's Scepter сочетаются по закону убывающей полезности с другими источниками сопротивления."
      ],
      "mana": "25",
      "hotKey": "Q",
      "cooldown": "17",
      "description": "Герой стремительно скользит, передвигаясь значительно быстрее и проходя сквозь других существ. Снимает ограничение на скорость передвижения и увеличивает её в реке.",
      "spellName": "Guardian Sprint",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость передвижения в реке: 25%",
        "Доп. скорость передвижения при активации: 16%\/24%\/32%\/40%",
        "Длительность: 10",
        "Восстановление здоровья в реке: 30",
        "Доп. броня в реке: 10",
        "Сопротивление эффектам в реке: 40%",
        "Даёт дополнительное восстановление здоровья, броню и сопротивление эффектам в пруду и в реке."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Мощный хвост змееногого стража, привыкший к морским глубинам, носит его и на суше."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Slardar_Slithereen_Crush.mp3\/revision\/latest?cb=20191216023820",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Оглушение и замедление применяются одновременно, поэтому в итоге замедление будет действовать 4\/5\/6\/7 сек.",
        "Способность сначала применяет дебаффы, затем наносит урон.",
        "С Aghanim's Scepter пруд создает ауру радиусом 600, дающую заклинателю те же бонусы, что и река. В отличии от реки пруд не дает бонусы ни другим существам, ни иллюзиям заклинателя. Также бонусы пруда, в отличии от реки, задерживаются на 0,5 сек. Бонусы от нескольких применений не складываются.",
        "В отличии от реки пруд не дает бонусы ни другим существам, ни иллюзиям заклинателя.",
        "Также бонусы пруда, в отличии от реки, задерживаются на 0,5 сек.",
        "Бонусы от нескольких применений не складываются.",
        "С Aghanim's Shard применяет ко всем врагам, затронутым Slithereen Crush, Corrosive Haze текущего уровня. Slithereen Crush сначала применяет дебафф, затем наносит урон. Поэтому урон способности увеличивается. Если Corrosive Haze не изучена, то дебафф не применяется.",
        "Slithereen Crush сначала применяет дебафф, затем наносит урон. Поэтому урон способности увеличивается.",
        "Если Corrosive Haze не изучена, то дебафф не применяется."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "8 (TagTalent 4)",
      "description": "Бьёт по земле, оглушая наземных врагов неподалёку и нанося им урон. После оглушения враги будут замедлены.",
      "spellName": "Slithereen Crush",
      "params": [
        "Анимация применения: 0,35+0,6",
        "Радиус: 350 (TagTalent 425)",
        "Урон: 80\/140\/200\/260",
        "Замедление скорости передвижения: 20%\/25%\/30%\/35%",
        "Замедление скорости атаки: 20\/25\/30\/35",
        "Длительность оглушения: 1",
        "Длительность замедления: 3\/4\/5\/6",
        "Радиус пруда: 600",
        "Длительность пруда: 25",
        "Длительность задержки ауры: 0,5",
        "Длительность Corrosive Haze: 5",
        "Применение создаёт пруд, который даёт те же бонусы, что и река.",
        "Способность накладывает на жертв эффект Corrosive Haze на 5 секунд. Увеличивает радиус на 75.",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Мощь воды вкупе с её быстротой пробьёт даже самую сильную защиту."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Slardar_Bash_of_the_Deep.mp3\/revision\/latest?cb=20191216023822",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Не сочетается с другими источниками оглушающего удара. Оглушение от Skull Basher и Abyssal Blade отключено для Slardar. В режиме Ability Draft эти эффекты оглушения не отключаются для игрока, выбравшего Bash of the Deep.",
        "В режиме Ability Draft эти эффекты оглушения не отключаются для игрока, выбравшего Bash of the Deep.",
        "Каждая успешная атака по вражескому герою или крипу добавляет один заряд к счётчику баффа. Бафф всегда активен, но его иконка скрывается, если у счётчика нет зарядов.",
        "Бафф всегда активен, но его иконка скрывается, если у счётчика нет зарядов.",
        "Не учитывает атаки по союзникам, вардам или строениям и не оглушает их.",
        "У зарядов нет установленной длительности действия.",
        "Когда счётчик достигает 4, то применяется оглушающий удар, а счётчик обнуляется.",
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Дополнительный урон наносится вместе с основной атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "После каждых 3 атак герой оглушит и нанесёт дополнительный урон своей следующей атакой.",
      "spellName": "Bash of the Deep",
      "params": [
        "Ударов для активации: 4",
        "Доп. урон: 50\/100\/150\/200 (TagTalent 110\/160\/210\/260)",
        "Урон по крипам: 200%",
        "Длительность оглушения: 1\/1,1\/1,2\/1,3"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Любой, кто посягнёт на сокровища глубин, встретится лицом к лицу с их беспощадным змееногим стражем."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/93\/Slardar_Corrosive_Haze.mp3\/revision\/latest?cb=20191216023814",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Дает общий обзор и эффект True Sight на цель."
      ],
      "mana": "25",
      "hotKey": "R",
      "cooldown": "5",
      "description": "Уменьшает сопротивление цели физическому урону, даёт по ней обзор и раскрывает её невидимость.",
      "spellName": "Corrosive Haze",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Дальность применения: 700\/800\/900",
        "Снижение брони: 10\/15\/20 (TagTalent 14\/19\/24)",
        "Длительность: 18"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Даже самая крепкая броня тает под натиском солёных вод океана."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.6,
    "attrStrength": 21.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 2.4,
    "attrAgility": 17.0
  },
  "description": "Slardar — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способностью, Guardian Sprint, увеличивает скорость передвижения. Вторая способность, Slithereen Crush, оглушает ближайших вражеских существ и наносит им урон. После оглушения существа замедляются. Пассивная способность, Bash of the Deep, позволяет герою каждый четвертый удар наносить дополнительный урон и оглушать врага. Ультимативная способность, Corrosive Haze, уменьшает броню врага и раскрывает его невидимость. Делает цель видимой для всех ваших союзников.",
  "history": "Слардар из рода змееногих, один из обитателей глубин, охраняет обширную сеть затонувших городов и скрытых ими древних ценностей. Он стоит на страже потайных сокровищниц, скрытых в бессветной пучине, и неусыпно охраняет их от подводных воров, посланных на морское дно алчными магами с поверхности. Страж верен своей службе как никто, а за его молчаливостью скрыто знание всех тайных морских проходов. Несмотря на жгучий свет, он поднимается на мелководье, чтобы разведать, не сговаривается ли кто против моря, — а иногда и чтобы расправиться с теми немногими, кто всё же обворовал затонувшую сокровищницу. Проведённое под огромным давлением морской толщи время сделало из змееногого стража существо невероятной мощи.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Эффект от Corrosive Haze нельзя развеять",
      "talentRight": "−4 сек. перезарядки Slithereen Crush"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+4 к снижению брони от Corrosive Haze",
      "talentRight": "+25% к вампиризму"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+60 урона от Bash of the Deep",
      "talentRight": "+325 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к урону",
      "talentRight": "+7 здоровья в секунду"
    }
  ]
}