{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/81\/Aegis_of_the_Immortal.mp3\/revision\/latest?cb=20170114192932",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Reincarnation не может быть прервана. Если герой умирает с предметом, она будет использована. Если носитель имеет способность Reincarnation, она сработает первее, если доступна.",
        "Если носитель имеет способность Reincarnation, она сработает первее, если доступна.",
        "Возрождает с полным запасом здоровья и маны. Заклинания и предметы не обновляются.",
        "Дает 1800\/800 наземного обзора в месте смерти во время задержки.",
        "После исчезновения, восстанавливает в виде регенерации, то есть восстанавливает 2% от максимального запаса здоровья и 2% от максимального запаса маны интервалами по 0.1 секунды.",
        "Максимальный запас маны и здоровья проверяется периодически и значения мгновенно подстраиваются.",
        "Так как способность лечит фиксированными процентами за фиксированную длительность, она не всегда может гарантировать полное восстановление.",
        "Урон свыше 0, от любого игрока (включая союзников и себя) или Рошана, развеет эффект. Не развеивается уроном с тегом отнимающий здоровье.",
        "Не развеивается уроном с тегом отнимающий здоровье.",
        "Сочетается с другими эффектами лечения и регенерации здоровья и маны."
      ],
      "mana": null,
      "abilityName": "Reincarnation",
      "cooldown": null,
      "description": "Через 5 сек. после смерти героя возвращает его к жизни на том же месте с полными здоровьем и маной. Исчезает через 5 минут после получения, полностью излечивая владельца за 5 секунд. Лечение прерывается уроном.",
      "params": [
        "Задержка эффекта: 5",
        "Восстановление здоровья в секунду после исчезновения: 20%",
        "Восстановление маны в секунду после исчезновения: 20%",
        "Длительность восстановления после исчезновения: 5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Aegis of the Immortal нельзя выбросить или продать.",
    "Aegis исчезает в двух случаях, будучи в инвентаре игрока или будучи на земле где выпал из Рошана: Рошан возрождается 8-11 минут после смерти. Носитель Aegis умирает и реинкарнирует, используя Aegis. Прошло 5 минут с момента поднятия героем Aegis.",
    "Рошан возрождается 8-11 минут после смерти.",
    "Носитель Aegis умирает и реинкарнирует, используя Aegis.",
    "Прошло 5 минут с момента поднятия героем Aegis.",
    "Всё это значит что в одном матче не может быть несколько Aegis of the Immortal одновременно."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Выпадает из Рошана",
  "name": "Aegis of the Immortal",
  "description": "Легенды гласят, что Бессмертный владел щитом, защищавшим его от самой смерти.",
  "trivia": [
    "Aegis раньше был обычным рецептом который состоял из 3 зарядов. После того как он был убран, его можно было получить как предмет выпадающий из Рошана.",
    "В Греческой мифологии Зевсу была представлена Эгида («Aegis»), которая была описана как «Вечная и бессмертная» («Ageless and immortal»)."
  ],
  "upgradeIn": null,
  "bonuses": null,
  "tips": null
}