{"abilities":[{"notes":null,"item_behaviour":[],"description":"Собирает мощь героя в заряд выжигающей энергии, который накладывает оцепенение на цель и врагов вокруг неё, наносит им урон и снимает с них положительные эффекты. Если целью является союзник, то способность только развеет отрицательные эффекты. Длительность оцепенения врагов равна времени применения способности — до 2,5 сек.","hot_key":"Q","params":["Анимация применения: 0+0","Дальность применения: 850","Радиус эффекта: 300","Макс\n длительность: 2,5 (<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/talent_tree_symbol.png\">[picture:talent_tree_symbol]<\/span> 0)","Урон: 100\/160\/220\/280","Мин\n длительность оцепенения: 0,5 (<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/talent_tree_symbol.png\">[picture:talent_tree_symbol]<\/span> 1)","Макс\n длительность оцепенения: 2,5 (<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/talent_tree_symbol.png\">[picture:talent_tree_symbol]<\/span> 3)"],"audioUrl":"https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Oracle_Fortune%27s_End_1.mp3\/revision\/latest?cb=20191216021406","effects":["Способность: Направленная на существо","Действует на: Врагов \/ Союзников","Урон: Магический"],"mana":"15\/12\/9\/6","aghanim":null,"name":"Fortune's End","cooldown":"100","legacy_key":"T","story":"Астральная сфера трещит от мощности, и из неё вырывается чистая энергия, временно разрывая связь врага с его собственным телом."},{"notes":null,"item_behaviour":[],"description":"Наполняет цель счастьем, обезоруживая ее и даруя сопротивление магии в 100%. Можно применять как на союзников, так и на врагов.","hot_key":"W","params":["Анимация применения: 0,3+1,1","Дальность применения: 500\/600\/700\/800","Сопротивление магии врагов: 100% (<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/aghanim's_scepter_symbol.png\">[picture:aghanim's_scepter_symbol]<\/span> 0%)","Сопротивление магии союзников: 100%","Длительность: 3\/3,5\/4\/4,5"],"audioUrl":"https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3a\/Oracle_Fate%27s_Edict.mp3\/revision\/latest?cb=20191216021405","effects":["Способность: Направленная на существо","Действует на: Врагов \/ Союзников"],"mana":"17\/14\/11\/8","aghanim":null,"name":"Fate's Edict","cooldown":"50","legacy_key":"F","story":"Нерушимое пророчество гласит: не страдать от магии избранному бойцу. Что же касается других страданий..."},{"notes":null,"item_behaviour":[],"description":"Выжигает скверну цели, нанося ей значительный магический урон, а затем постепенно восстанавливает ее жизненные силы. Количество восстанавливаемого здоровья больше нанесённого урона. Можно применять как на врагов, так и на союзников.","hot_key":"E","params":["Анимация применения: 0,15+1,14","Дальность применения: 850","Урон врагам: 90\/180\/270\/360 (<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/talent_tree_symbol.png\">[picture:talent_tree_symbol]<\/span> 117\/234\/351\/468)","Урон союзникам: 90\/180\/270\/360","Лечение в секунду: 11\/22\/33\/44","Длительность: 9"],"audioUrl":"https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0c\/Oracle_Purifying_Flames.mp3\/revision\/latest?cb=20191216021409","effects":["Способность: Направленная на существо","Действует на: Врагов \/ Союзников","Урон: Магический"],"mana":"2,5 (TagTalent 1,25)","aghanim":null,"name":"Purifying Flames","cooldown":"75","legacy_key":"E","story":"Как зеркальные залы умножают свет одной свечи, так и разбитые стены вселенной превращают огонёк пророчества в жгучий факел."},{"notes":null,"item_behaviour":[],"description":"Отсрочивает судьбу союзника, откладывая любое лечение и получение урона до конца действия этой способности. Любое лечение во время действия этой способности удваивается. Применение снимает с цели большинство отрицательных эффектов.","hot_key":"R","params":["Анимация применения: 0,3+0,97","Дальность применения: 700\/850\/1000","Отложенное усиление лечения: 100%","Длительность: 7\/8.5\/10 (<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/talent_tree_symbol.png\">[picture:talent_tree_symbol]<\/span> 8,5\/10\/11,5)","<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/talent_tree_symbol.png\">[picture:talent_tree_symbol]<\/span> Доп\n броня:  80","<span image=\"\/Users\/eugeneshuvagin\/StudioProjects\/AD2\/core\/database\/src\/main\/assets\/images\/aghanim's_shard_symbol.png\">[picture:aghanim's_shard_symbol]<\/span> Задержка до невидимости:  0,15"],"audioUrl":"https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e9\/Oracle_False_Promise_1.mp3\/revision\/latest?cb=20191216021412","effects":["Способность: Направленная на существо","Действует на: Союзных героев","Урон: Чистый"],"mana":"120\/90\/60 (TagTalent 100\/70\/40)","aghanim":null,"name":"False Promise","cooldown":"100\/150\/200","legacy_key":"R","story":"Предсказания лжепророков и неприятелей обманчивы."}],"mainAttributes":{"attrStrengthInc":2.4,"attrStrength":20.0,"attrIntelligence":26.0,"attrIntelligenceInc":3.8,"attrAgilityInc":1.7,"attrAgility":15.0},"description":"+1,5 сек. к длительности False Promise Fortune's End срабатывает мгновенно +30% к урону врагам от Purifying Flames −20 сек. к перезарядке False Promise −1,25 сек. перезарядки Purifying Flames +80 к урону от Fortune's End Fortune's End даёт 10 брони +0,5 сек. действия Fortune's End","history":"Веками наследники Великого трона Симурри импортировали оракулов исключительно из Белого инкубатория, что в полых вершинах Гребня фанатиков. Вступительный взнос давался при зачатии эмбриона, а остальное, по доставке к Вратам высеченного короля зрелого, хорошо-тренированного пророка. Бледные предсказательницы выводят всех разрешенных оракулов, рождая и воспитывая их, и своей физической формой оракулы закреплены в мире, общем для большинства из нас. Души же их бродят далеко, едва связанные легчайшими астральными пуповинами. Возращаясь из своих вселенских странствий, пророки вещают огненные слова языками плоти. Симуррийские советники анализируют мистические речи пророков и находят в них видения будущего, дипломатические советы и прочие сверхъестественные надобности, дающие династии Высеченных королей победы при дворе и в бою. И так продолжалось поколениями, заполняя страницы Хроники высеченных королей именами королей-победителей и покоренных ими земель. Так продолжалось до тех пор пока один оракул, по имени Нериф, не прибыл для служения последнему из владык в каменных шлемах. С самого начала пророчества Нерифа были необычны. Казалось, они не предсказывают будущее а вершат его. Странный предсказатель выкаркивал советы когда их никто не просил, и неожиданно симуррийцы оказывались ввязаны в конфликты с новыми врагами. Советники, ощущая угрозу своей власти, быстро осознали в последнем оракуле источник нежелательных свар. Они потребовали его устранения, запросив предсказательниц взять обратно неполноценного пророка и предоставив достойную замену. Но в зловещем сне Нериф описал гибель Инкубатория и через несколько часов пришли вести что страшный обвал погубил древную школу. Опасаясь разделить участь Бледных предсказательниц, советники удалились в свои палаты для совещаний, желая избежать внимания оракула. Но Высеченный король всегда отличался практичностью. Он не полностью доверял своим сверхосторожным Советникам. Оракул такой редкости, думал он, должен быть использован для расширения владений. Исходя из этого, он сместил своих излишне робких советников и приблизил Нерифа. Плохо понимая свойства Нерифа, он попросту заявлял о своих желаниях и вынуждал Нерифа высказать эти желания как предсказания. Сначала все шло хорошо. Последний из Высеченных королей хвалился что взяв себе баловня судьбы он овладел самой судьбой. Следовала бы принять за предупреждение, когда накануне вторжения в земли Неудовлетворимого сатрапа, он пытался выудить у своего оракула предсказание несомненной победы, но Нериф лишь негромко прошептал, «все может быть». Более твердых слов король не смог заставить слететь с его губ. Тем не менее, король был уверен в своем войске. Сатрапия не имела выходов к морю, была слабо вооружена и лишена всех потенциальных союзников. Слова «все может быть» Король понял как то, что с перевесом в военной мощи, его план не несет серьезного риска. Конечно, теперь мы знаем что он должен был понять слова предсказателя более буквально. Даже при тщательном изучении Аннотированных анналов возможного, то что произошло на поле брани у дворца Неудовлетворимого сатрапа почти невозможно представить. Было похоже, что среди резни битва начала раздваиваться. В каждый решающий момент реальность разделялась и распадалась на осколки. Отступающие и падающие бойцы в тоже время держались крепко и смело вступали в бой. Разделилось и сознание солдат, они чувствовали себя и живыми и мертвыми, существующими и несуществующими. Победа и поражение разделились, и то и другое ощущалась одновременно обоими сторонами. Вселенная обратилась в зал зеркал, каждое из них бесконечно разбивающееся. Непосредственным эффектом происходящего стало сумасшествие. Не в силах понять состояние победы и поражения одновременно, сознание Высеченного короля распалось на лоскуты безумства. Наивному сатрапу досталось не меньше. Противоположные реальности продолжали разделяться и разделяться, как эхо они заполняли бесконечные варианты случившегося, каждый населенный непонимающими жителями которые вскоре потеряли способность кормить себя, одеваться, защищаться или размножаться обычным образом. Тем не менее, задолго до того как последствия случившегося полностью проявились, цимуррийские советники схватили Нерифа, связали его, заткнули рот и вышвырнули из своей вселенной на барке способной пересекать измерения, в надежде навсегда оставить его где-то где он не сможет им навредить. Конечно, для них это было слишком поздно. Возможно, для нас тоже."}