{"abilities":[{"spell":"Forces an enemy unit to move slower and for allies to attack it more quickly.","effects":["Ability Target Unit","Affects Enemies"],"notes":["The projectile travels at a speed of 1400.","Any allied unit attacking the debuffed enemy gets the speed buff. The buff is granted upon starting an attack.","Once gained, the speed buff stays for its full duration, so it can be used against other targets.","The speed buff is granted to any allied unit, including buildings and wards."],"mana":"70\/80\/90\/100","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"14\/13\/12\/11","name":"Penitence","description":["Cast Animation: 0.3+0.77","Cast Range: 800 ( 1000)","Target Move Speed Slow: 18%\/24%\/30%\/36%","Allies Attack Speed Bonus: 30\/60\/90\/120","Debuff Duration: 5\/6\/7\/8","Buff Duration: 2"],"hot_key":"Q","legacy_key":"E"},{"spell":"Chen takes control of an enemy or neutral creep. If the persuaded creep's base health is naturally below the health minimum, its base health will be raised to the health minimum. Converted creeps will have increased movement speed and bonus damage.","effects":["Ability Target Unit","Affects Enemy Units"],"notes":["Applies a basic dispel on the target which removes buffs and debuffs.","When persuading a new creep while already having the maximum amount, the oldest persuaded creep (including ancient creeps) dies. When persuading an ancient creep while already having the maximum amount of them, the oldest persuaded ancient creep dies. The death is not credited to anyone so that no one gets experience from it.","Can persuade any creep below the given max level, including summons, but excluding Roshan, siege creeps and creep-heroes.","When the unit's maximum health is below the minimum health threshold, its maximum and current health are increased by the difference. This current health increase does not count as a heal. The unit has its health set to a value. The health of creeps that are currently persuaded does not increase further upon leveling up Holy Persuasion or upon choosing the minimum health upgrading talent.","Fully restores the creep's mana.","Aghanim's Scepter upgraded Holy Persuasion allows ancient creep to be persuaded per level of Hand of God. Ancient creeps are included in the maximum allowed units, so it does not allow Chen to have more creeps persuaded. Can be cast on ancient creeps without having Hand of God leveled for no result, wasting the mana and cooldown. The talent does not increase the amount of ancient creeps Chen can persuade."],"mana":"70\/90\/110\/130","elements":["Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"15","name":"Holy Persuasion","description":["Cast Animation: 0.3+0.77","Cast Range: 600 ( 800)","Max Units: 1\/2\/3\/4 ( 6\/7\/8\/9)","Minimum Base Health: 1000 ( 2000)","Movement Speed Bonus: 10\/15\/20\/25","Attack Damage Bonus: 8\/16\/24\/32 ( 28\/36\/44\/52)","Persuasion Creep Max Level: 4\/5\/6\/6"],"hot_key":"W","legacy_key":"T"},{"spell":"Passively provides an aura that grants increased health regeneration and amplifies all health restore by a percentage. Can be cast on allies to teleport them to Chen. If cast on Chen, all units controlled by Chen will be teleported to him. Taking damage will dispel the buff.","effects":["Ability Target Unit \/ Aura","Affects Allies"],"notes":["Disjoints projectiles upon teleporting.","Can only teleport allied units controlled by players. Cannot teleport lane creeps.","Cannot target invulnerable or hidden allies, but can teleport them if they turned invulnerable or hidden after cast.","The teleport locations are based on Chen's position upon teleporting, with the ally appearing 120 range to his north, east, south, or west. The very first ally teleported to Chen teleports randomly north, south, east, or west, and following allies continue counterclockwise.","If Chen is dead as the buff expires, the teleport does not happen.","Damage greater than 0 (before reductions) from any player (including allies, excluding self) or Roshan dispels the effect.","Gives the target a stop command after teleporting it, canceling channeling spells and stopping queued orders.","The disable help function prevents an allied Chen from casting this spell on you.","When targeting self, all units under the caster's control (excluding wards and illusions) get teleport to the caster. Unlike directly targeting an ally to teleport, self-casting does target invulnerable and hidden units.","The aura only affects allied heroes (including illusions and clones, excluding creep-heroes), and all units under Chen's control.","The aura's buff lingers for 6 seconds.","The aura's heal amplification applies to health regeneration as well.","The aura can regenerate up to 120\/180\/240\/300 health in one minute (129.6\/201.6\/278.4\/360 if Divine Favor's own amplification is taken into account)."],"mana":"130","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"60 ( 30)","name":"Divine Favor","description":["Teleport Cast Range: Global","Aura Radius: 1200","Health Regeneration Bonus: 2\/3\/4\/5","Heal Amplification: 8%\/12%\/16%\/20%","Aura Linger Duration: 0.5","Teleport Delay: 6"],"hot_key":"E","legacy_key":"F"},{"spell":"Heals all allied heroes on the map as well as all units under Chen's control.","effects":["Ability No Target","Affects Allied Heroes"],"notes":["All units owned by Chen are healed, including his illusions, summons and persuaded or dominated units.","Does not heal any allied non-hero units or illusions, except for hero clones.","Can heal allies while they are invulnerable and while hidden.","The voice line upon cast is global for allies and not audible for enemies."],"mana":"200\/300\/400","elements":["Pierces spell immunity."],"cooldown":"160\/140\/120","name":"Hand of God","description":["Cast Animation: 0.3+0.93","Radius: Global","Heal: 300\/450\/600 ( 650\/800\/950)","Max Ancient Creeps Count: 0 ( 1\/2\/3)"],"hot_key":"R","legacy_key":"D"}],"bio":"Born in the godless Hazhadal Barrens, Chen came of age among the outlaw tribes who eked out an existence in the shimmering heat of the desert. Using an ancient form of animal enthrallment, Chen’s people husbanded the hardy desert locuthi, a stunted species of burrowing dragon that melted desert sands into tubes of glass where twice-a-year rains collected. Always on the edge of starvation and thirst, fighting amongst their neighbors and each other, Chen’s clan made the mistake, one fateful day, of ambushing the wrong caravan. In the vicious battle that followed, Chen’s clan was outmatched. The armored Knights of the Fold made short work of the enthralled locuthi, who attacked and died in waves. With their dragons dead, the tribesmen followed. Chen struggled, and slashed, and clawed, and perished—or would have. Defeated, on his knees, he faced his execution with humility, offering his neck to the blade. Moved by Chen’s obvious courage, the executioner halted his sword. Instead of the blade, Chen was given a choice: death or conversion. Chen took to the faith with a ferocity. He joined the Fold and earned his armor one bloody conversion at a time. Now, with the fanaticism of a convert, and with his powers of animal enthrallment at their peak, he seeks out unbelievers and introduces them to their final reward.","talentsTips":["Gold granted from the talent is unreliable gold."],"trivia":["Chen's fun names in DotA were Chechen and Jackie Chen, a pun on the name of the famed actor Jackie Chan.","Chen's death quote \"My Leg\" refers to a Spongebob Squarepants running gag."],"talents":["+350 Hand of God Heal:+5 Holy Persuasion Max Units","+1000 Holy Persuasion Minimum Health:+180 Gold\/Min","+20 Holy Persuasion Damage:-30s Divine Favor Cooldown","+200 Cast Range:+30% XP Gain"],"desc":"Chen the Holy Knight is a ranged intelligence hero, whose signature ability, Holy Persuasion, allows him to take control of creeps. Commanding them well requires adept micromanagement and map awareness, but once mastered Chen becomes an effective ganker and one of the game's strongest early pushers. His ability to convert creeps makes it natural for him to spend the laning phase as a jungler, emerging to pick off enemies with his creep army's array of disables. Chen's ultimate Hand of God heals all his creeps and allied heroes wherever they are on the map, allowing him to sustain pushes and secure objectives. And that he must, building up a strong lead before his creeps lose their threat in the late game."}