{"abilities":[{"spell":"Заставляет вражеское существо передвигаться медленнее, а союзников — атаковать его быстрее.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Снаряд летит со скоростью 1400 единиц.","Любой союзный юнит, атакующий врага, получает бафф скорости. Бафф дается при начале атаки.","После получения бафф остается на всю длительность, поэтому его можно использовать при атаке других целей.","Бафф скорости дается всем союзным юнитом за исключением строений и вардов."],"mana":"70","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/13\/12\/11","name":"Penitence","description":["Анимация применения: 0,3+0,77","Дальность применения: 800 ( 925)","Замедление скорости передвижения цели: 18%\/24%\/30%\/36%","Доп. скорость атаки союзникам: 30\/60\/90\/120","Длительность дебаффа: 5\/6\/7\/8","Длительность баффа: 2"],"hot_key":"Q","legacy_key":"E"},{"spell":"Увеличивает восстановление здоровья, всё получаемое лечение и урон от атак. Цели, не являющиеся героями, получают утроенный бонус к урону.","effects":["Способность Направленная на юнита","Действует на Союзников"],"notes":["Восстанавливает здоровье в виде регенерации, восстанавливая 0.7\/1.3\/1.9\/2.5 здоровья с интервалом в 0,1 секунды.","Восстанавливает до 0.041666666666667\/0.077380952380952\/0.11309523809524\/0.14880952380952 здоровья, учитывая своё усиление лечения.","К регенерации здоровья также применяется усиление лечения.","Несколько применений Divine Favor на одну и ту же цель не складываются, но обновляют длительность."],"mana":"110","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/14\/12\/10 ( 9\/7\/5\/3)","name":"Divine Favor","description":["Анимация применения: 0,3+0,77","Дальность применения: 800 ( 1000)","Доп. восстановление здоровья: 7\/13\/19\/25","Усиление лечения: 25%","Доп. урон: 8\/16\/24\/32","Длительность: 8\/10\/12\/14"],"hot_key":"W","legacy_key":"T"},{"spell":"Подчиняет вражеского или нейтрального крипа. Если его максимальный запас здоровья ниже определённого порога, то здоровье существа увеличится до этого значения. Применив способность на союзника, владелец способности телепортирует его к себе. Применив способность на себя, он перенесёт к себе всех своих подконтрольных крипов. Если союзник получит урон от героя, телепортация прервётся.","effects":["Способность Направленная на юнита","Действует на Вражеских существ"],"notes":["При выборе врагов: Применяет на цель базовое развеивание, которое снимает положительные и отрицательные эффекты. Если новый приручаемый крип превысит максимальное количество подчиненных крипов, самый ранний из прирученных (включая древних крипов) умрет. Если при приручении древнего крипа превышено максимальное количество крипов, самый ранний из древних крипов умрет. Смерть крипов никому не засчитывается, поэтому опыт за них никто не получает. Может подчинить любого крипа в пределах доступного уровня, за исключением Рошана и крипов-героев. Если максимальный запас здоровья крипа ниже значения способности, текущее здоровье и показатель максимального увеличивается до значения способности. Увеличение здоровья не считается за лечение, оно просто меняет значение здоровья юнита. Здоровье у уже подчиненных крипов не увеличивается с поднятием уровня способности или выбором таланта на поднятие значения минимального здоровья. Полностью восстанавливает ману крипов. Улучшение от Aghanim's Scepter позволяет подчинять древнего крипа за каждый уровень Hand of God. Древние крипы учитываются в общее количество подчиняемых крипов, поэтому улучшение не позволит иметь больше крипов, чем позволяет способность. Можно применить на древних крипов без изученного Hand of God, но способность не сработает, потратит ману и уйдет на перезарядку. Талант не увеличивает количество древних крипов, которых Chen может приручить.","При выборе союзников: Имеет глобальную дальность применения. При телепортации позволяет избегать снарядов. Может телепортировать только союзных юниты, подконтрольных игрокам. Не может телепортировать линейных крипов Не может выбрать в качестве цели неуязвимых или спрятанных союзников, но может их телепортировать, если они станут неуязвимы или спрятаны после применения способности. Место появления основано на положении Chen при телепортации, союзник появляется в 120 единицах на севере, западе, юге или востоке от героя. Слоты не выбираются случайно, а следуют фиксированному расположению. Самый первый союзник всегда телепортируется к Chen на севере, остальные союзники появляются против часовой стрелки. Если Chen умер при завершении длительности дебаффа, то телепортация не произойдет. Урон, превышающий 0 (до учета снижений), от любого игрока (включая союзников, но исключая себя) или Рошана, развеивает эффект. Отдает цели команду \"стоп\" после телепортации, отменяя её произнесимые способности и текущие приказы действия. Вы можете отключить помощь, чтобы h не мог использовать эту способность на вас. При выборе целью себя все юниты, подконтрольные заклинателю (исключая варды и иллюзии), телепортируются к заклинателю. В отличии от необходимости выбора союзника напрямую для телепортации, применение на себя выбирает неуязвимых и спрятанных юнитов."],"mana":"70\/90\/110\/130","elements":["Не блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"15","name":"Holy Persuasion","description":["Анимация применения: 0,3+0,77","Дальность применения: 600 ( 725)","Дальность применения на союзников: Глобальная","Макс. юнитов: 1\/2\/3\/4 ( 6\/7\/8\/9)","Минимальное базовое здоровье: 1000 ( 2000)","Макс. уровень приручаемых крипов: 4\/5\/6\/6","Задержка телепортации: 6"],"hot_key":"E","legacy_key":"F"},{"spell":"Лечит всех союзных героев и подконтрольных крипов.","effects":["Способность Ненаправленная","Действует на Союзных героев"],"notes":["Все юниты под контролем Chen получают лечение, включая его иллюзии, призываемых существ и прирученных или подчиненных юнитов.","Не лечит любых союзных юнитов не-героев или иллюзий за исключением клонов героев.","Может вылечить союзников, если они неуязвимы или спрятаны.","Фраза героя, проигрываемая при использование, слышна всем союзникам, но не врагам."],"mana":"200\/300\/400","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"160\/140\/120","name":"Hand of God","description":["Анимация применения: 0,3+0,93","Дальность: Глобальная","Лечение: 300\/450\/600 ( 650\/800\/950)","Макс. древних крипов: 0 ( 1\/2\/3)"],"hot_key":"R","legacy_key":"D"}],"bio":"Рождённый в безбожных Хажадальских пустошах, Чен вырос среди разбойных племён, скрывающихся от остального мира в сияющих песках пустыни. Пользуясь древним знанием о приручении животных, его народ разводил локати — низкорослых подземных драконов, выжигающих в песке стеклянные туннели, дважды в год наполнявшиеся дождевой водой. Из-за постоянного голода и жажды племена постоянно враждовали между собой. И однажды Чен совершил непростительную ошибку, напав не на тот караван. В той жестокой схватке его клан был повержен. Облачённые в доспехи рыцари Покрова в два счёта расправились с порабощёнными локати, что нападали и умирали один за другим. Вслед за драконами пали и члены клана. Чен боролся, бился и дрался не на жизнь, а на смерть... Но ему была уготована иная участь. Поверженный, он стоял на коленях и смиренно ждал казни. Восхищённый храбростью юнца, палач убрал свой клинок. Ему пообещали даровать жизнь, если он примет веру. Чен со всей душой ухватился за эту возможность. Он присоединился к рыцарям и в кровавых проповедях заслужил себе доспехи. Теперь же с непоколебимой верой и превосходным умением приручать животных он выискивает неверных и вершит над ними последний суд.","talentsTips":["Талант на броню не дается иллюзиям.","Золото с таланта является ненадёжным."],"trivia":["Альтернативное имя героя было CheChen или Jackie Chen.","В одном обновлении игры, существовала ошибка, при которой Chen мог переманить Рошана, и управлять им. Рошан мог в одиночку пронести всю линию, так как ни крипы ни герои не могут бить Рошана за пределами его логова. На следующий день ошибка была исправлена."],"talents":["+350 лечения от Hand of God:+5 макс. существ у Holy Persuasion","+1000 к мин. здоровью крипов:+180 золота в минуту","-7 сек. перезарядки Divine Favor:+7 к броне","+125 к дальности способностей:+20% к получаемому опыту"],"tips":["Благодаря Holy Persuasion герой может переманивать любого крипа, находящего в лесу. Например, можно переманить Тролля-некроманта, получая под свой контроль такие способности как Ensnare, которая набрасывает на противника сеть, останавливая его на месте и Raise Dead - способность, которая позволяет воскресить из трупа два скелета, которые также будут сражаться на стороне героя. Переманив также Вожака волка, все рядом находящиеся союзники будут получать ауру дополнительного урона. Данная аура также будет распространяться на переманенных крипов. С помощью лесных крипов и их способностей, герой может быстро и эффективно уничтожать вражеские башни. Также, имея кентавра или тролля, можно сделать нападение на центральную линию и убить вражеского героя, используя способности крипов. С первого уровня, герой может спокойно прокачиваться в лесу. Эта способность позволяет переманить любого крипа любого уровня. Для первого уровня и старта прокачивания, рекомендуется переманить Сатира-мучителя. В его арсенале есть Unholy Aura - аура, которая восстанавливает здоровье союзников рядом. Также Shockwave, которая наносит небольшой урон врагам впереди крипа. Переманивать можно также и вражеских крипов, идущих по линиям, однако данные крипы не имеют уникальных способностей. Переманивать также можно и вызванных крипов у вражеских героев. Например, можно спокойно переманить энта у вражеского героя Nature's Prophet, эйдолона Enigma, волка Lycan, рукотворного духа Invoker и так далее. Однако, медведя у Lone Druid переманить не удастся, так как он считается героем, а не крипом (медведь, в отличии от крипов, может носить и использовать предметы).","Если враг переманил крипа с помощью предмета Helm of the Dominator, то Chen также сможет переманить данного крипа на свою сторону."],"desc":"Chen — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Игра за данного героя уникальна, требует внимания и взаимодействия с союзниками. Первая способность, Penitence, накладывает на противника заклинание, которое замедляет его скорость передвижения, а также увеличивает скорость атаки союзников по нему. Способностью Divine Favor увеличивает восстановление здоровья, всё получаемое лечение и урон от атак союзника. Holy Persuasion - способность, позволяющая переманить любого лесного или вражеского крипа на свою сторону и управлять им; это позволяет герою на первом уровне отправляться в лес и получать там опыт; при использовании на союзного героя или подчинённого крипа телепортирует его к себе, что позволяет спасти союзника или устроить засаду врагам. Ультимативной способностью, Hand of God, герой излечивает всех союзников на карте на определённое количество здоровья."}