{
  "abilities": [
    {
      "effects": [
        "Movement Speed Reduction: 4%",
        "Health Regen Reduction: 16"
      ],
      "notes": [
        "Reduces Tranquil Boots stats to +20% movement speed and 0 health regeneration.",
        "Breaks upon successfully landing an attack on an enemy hero, or when any enemy successfully lands an attack on you. This means when your or an enemy's attack misses or is disjointed, the boots do not break. The actual damage from the attack does not matter, even 0 damage attacks can break the boots. The secondary attacks of Flak Cannon and Split Shot count, too, but the bounces of Moon Glaives do not. Cleave, splash and Psi Blades cannot break the boots of secondary targets either.",
        "Does not break upon attacking non-hero units. Treats creep-heroes as creeps.",
        "The cooldown is affected by the Cooldown Reduction of Octarine Core, Arcane Rune or talents. However refreshing it with ( Refresher Orb or Rearm) does not skip the broken state. The cooldown timer vanishes, but the boots stay disabled for the remaining duration."
      ],
      "elements": [
        "Ability Passive",
        "Affects Self"
      ],
      "name": "Break",
      "description": "Whenever you attack a hero or are attacked by any unit, the bonus 16 HP regen is lost and the movement speed bonus is reduced to 20% for 13 seconds."
    }
  ],
  "cost": "1050",
  "description": "",
  "further": [
    "Boots_of_Speed",
    "Wind_Lace",
    "Ring_of_Regen"
  ],
  "tips": [
    "Remember that the Tranquil Boot regen doesn't stop or reset the cooldown if you are casting a spell. You can get a Soul Ring and spam long range abilities and keep the regen active.",
    "Right click attacks disable the regen, if you drop the boots you will keep it active or not reset their cooldown.",
    "If you have invisibility you can stay in XP range while you regen your health safely. Be careful that the enemy doesn't have a Sentry or Dust.",
    "It is good for roamers, rapidly restoring a hero's health while moving to another lane."
  ],
  "attrs": [
    "Passive Break",
    "Bonus +16 Health regeneration +24% Movement speed",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "Movement speed bonuses from multiple pairs of boots do not stack.",
    "Stacks with all other movement speed bonuses.",
    "The health regeneration of multiple Tranquil Boots fully stacks."
  ]
}