{"abilities":[{"effects":["Cast Range: Global","Min Targeting Distance to Building: 70","Max Targeting Distance to Building: 575","Channel Time: 3","Town Portal Scroll Cooldown Increase: 10"],"notes":["Double clicking the item while being at least 1500 range away from the team's fountain, automatically targets the fountain's location.","On level 1, can target allied non-hero units and buildings. On level 2, can additionally target allied heroes.","Can target any allied unit, except for wards, couriers, Beetles, Homing Missiles and Spin Webs (heroes and illusions on level 1). Can target invulnerable, but not hidden allies. When the target becomes hidden after channeling has begun, the teleport is interrupted.","When targeting the ground, automatically chooses the closest valid target to that point. Prioritizes buildings within 900 radius. If the next valid target is a building, it teleports 575 range (250 range if it is a shrine outside of the base) away from it.","Disjoints projectiles upon teleporting.","Units can be directly targeted. The effect then chases the unit. Buildings cannot be directly targeted, the ground is targeted instead.","The targeted unit's priority is lowered, meaning it is attacked as the last auto attack target by other units.","During the channeling, the teleport destination is marked with a visual effect in the same color as the player and a sound is played.","Both are visible and audible to everyone. The visual effect is also visible on teleporting invisible enemies.","Also marks the point on the minimap for allies. The mark is in the player's color and lasts as long as the channeling does.","Provides 200 radius flying vision at the destination point while channeling. The vision lingers for 1 second.","When the target unit dies or changes ownership during the channeling, the teleport gets cancelled, wasting the cooldown and mana cost. Since buildings are not directly targeted, the destruction of the building does not cancel the teleport.","Does not share cooldown with Town Portal Scroll. However, when teleporting with Boots of Travel, Town Portal Scroll gets 10 seconds added to its current cooldown (even when off cooldown)."],"elements":["Ability Target Point \/ Target Unit \/ Channeled","Affects Self"],"description":"Teleports you to any allied structure or unit, including heroes. Teleporting to a unit is interrupted if the target unit dies. Adds 10 seconds to the cooldown of Town Portal Scroll."}],"cost":"4500","description":"Winged boots that grant omnipresence.","further":["Boots_of_Travel_1","Recipe"],"attrs":["Active Teleport","Bonus +35% Movement speed","Disassemble? No","Alert allies? No"]}