{"abilities":[{"effects":["Дальность применения: Глобальная","Минимальное расстояние прицеливания на строение: 70","Максимальное расстояние прицеливания на строение: 575","Время первого произнесения: 3","Время второго произнесения: 5","Увеличение времени последующих произнесений: 0,5","Радиус проверки недавней телепортации: 1150","Длительность проверки недавней телепортации: 25"],"notes":["Двойной клик на предмете автоматически выберет ваш фонтан. На первом уровне может выбирать целью союзников, не героев и строения. На втором уровне может выбирать целью и героев.","Можно выбрать целью союзного юнита, кроме вардов, курьеров, жуков, Homing Missile и Spin Web (героев и иллюзий на первом уровне). Нельзя делать телепорт на Astral Spirit, также выбрать целью тех, кто прячется (например Phase Shift).","При нажатии на землю, автоматически выбирается ближайшая действительная цель. Приоритет — строение в радиусе 900. Если следующая действительная цель это строение, то перемещает на расстоянии 575 (250 дальности от святыни вне базы) от него.","Юниты непосредственно могут быть целью. Эффект будет следовать за ними. Строения не могут быть непосредственно нацелены, эффект будет исходить с земли.","Юнит, на которого может быть перемещён герой, имеет низкий приоритет атаки, что означает, что этот юнит будет последним атакованным другими юнитами.","Во время перемещения, звук слышен обоим сторонам. Визуальный эффект также появляется при перемещении невидимых героев.","Когда герой перемещается, отмечается метка на карте для союзников. Однако такие способности как Teleportation и Relocate показывают метку и врагам при их использовании. Метка длится столько же, сколько и время произнесения заклинания.","Обеспечивает летающий обзор в радиусе 200 во время произнесения. Он задерживается на 1 секунду.","Когда юнит, на которого вы перемещаетесь умирает, то перемещение отменяется, при этом предмет уходит на перезарядку и использует ману необходимую на его использование. Поскольку строение не является непосредственной целью, то при её разрушении перемещение не прервется.","Не делит перезарядку с Town Portal Scroll. Но при этом при телепортации с помощью Boots of Travel к текущей перезарядке Town Portal Scroll добавляются 10 секунд (даже если предмет не находится на перезарядке).","Переход в состояние невидимости не прерывает процесс телепортации."],"elements":["Способность Направленная на точку \/ Направленная на юнита \/ Произносимая","Действует на Себя"],"description":"Телепортирует к союзной постройке или существу, в том числе и к героям. Телепортация к существу прервётся, если оно умрёт. Применение добавляет 5 сек. к перезарядке Town Portal Scroll."}],"cost":"4500","description":"Крылатые сапоги, дающие вездесущность.","further":["Boots_of_Travel_1","Рецепт"],"attrs":["Активируемая Teleport","Бонус +35% к скорости передвижения","Можно разобрать? Нет","Можно сообщать? Нет"]}