{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4c\/Broodmother_Insatiable_Hunger.mp3\/revision\/latest?cb=20191216011847",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "Дополнительный урон считается за обычный бонусный урон от атаки.",
        "Складывается аддитивно с другими источниками вампиризма. Вампиризм не действует на постройки и союзных юнитов. Вампиризм может излечивать при атаке вардов, для уничтожения которых не требуется фиксированного количества ударов.",
        "Вампиризм не действует на постройки и союзных юнитов.",
        "Вампиризм может излечивать при атаке вардов, для уничтожения которых не требуется фиксированного количества ударов.",
        "Снижающий базовое время атаки талант не обновляет значения уже действующей способности. Снижает базовое время атаки Broodmother до значения 1,4 на время активации.",
        "Снижает базовое время атаки Broodmother до значения 1,4 на время активации.",
        "При улучшении с Aghanim's Shard Instiable Hunger даёт бонусного урона от атаки каждую 1 секунду. Приобретение Aghanim's Shard не улучшает уже активированную способность. Вместе с базовым бонусом к урону от атаки увеличивает урон Broodmother на 155\/189\/223\/257 при максимальной длительности.",
        "Приобретение Aghanim's Shard не улучшает уже активированную способность.",
        "Вместе с базовым бонусом к урону от атаки увеличивает урон Broodmother на 155\/189\/223\/257 при максимальной длительности."
      ],
      "mana": "40\/35\/30\/25",
      "item_behaviour": [],
      "name": "Insatiable Hunger",
      "cooldown": "50\/60\/70\/80",
      "description": "Неистовая жажда питательных соков увеличивает урон героя и наделяет его вампиризмом.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дополнительный урон: 35\/45\/55\/65",
        "Вампиризм: 40%\/60%\/80%\/100%",
        "Длительность: 8\/10\/12\/14 ( 10\/12\/14\/16)",
        "Увеличение бонусного урона в секунд: 12",
        "Базовое время атаки: 1,4"
      ],
      "legacy_key": "W",
      "story": "Несмотря на то, что большая часть добычи завёрнута в блестящие коконы и сохранена для выводка, сама Broodmother также имеет вкусы на блуждающих героев."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Spin_Web.mp3\/revision\/latest?cb=20141205111223",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Себя"
      ],
      "notes": [
        "Имеет глобальную дальность применения, если край новой паутины соприкасается с уже созданной паутиной.",
        "При первом изучении способности Broodmother сразу получает 4 заряда паутины. Последующее повышение уровня способности не дает готовых зарядов.",
        "Действует только на Broodmother и всех паучков и паучат. Не действует на других подконтрольных юнитов.",
        "Бонус к скорости передвижения уменьшается на 0,18%\/0,28%\/0,38%\/0,48% при потере 1% от здороьвя, достигая минимального значения в 9%\/14%\/19%\/24% при наличии 1% здоровья. Процент от максимального здоровья проверяет периодически, значение бонуса изменяется постоянно. Не действует на неуязвимых и спрятанных существ. Бонус подсчитывается для каждого существа по отдельности.",
        "Процент от максимального здоровья проверяет периодически, значение бонуса изменяется постоянно.",
        "Не действует на неуязвимых и спрятанных существ.",
        "Бонус подсчитывается для каждого существа по отдельности.",
        "Может восстановить до 300\/420\/540\/660 единиц здоровья в минуту.",
        "Паутины также увеличивают скорость поворота Broodmother и паучков (включая паучат) до значений в 0,8 и 0,7 соответственно.",
        "Эффекты даются в виде ауры. Её бафф задерживается на 0,2 секунды.",
        "Паутина видна на миникарте Broodmother и ее союзникам. Паутина не дает обзора, но может быть выделена в тумане войны. Выбранную паутину можно разрушить с помощью Destroy Spin Web.",
        "Выбранную паутину можно разрушить с помощью Destroy Spin Web.",
        "Паутина не блокирует лагери нейтральных крипов."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Spin Web",
      "cooldown": "50",
      "description": "Герой сплетает паутину, в которой он быстрее передвигается, поворачивается и восстанавливает здоровье, а также может проходить через препятствия. Заряд способности восстанавливается 30 секунд. Максимум зарядов: 4\/6\/8\/10. Если новая паутина будет касаться старой, то её можно создать из любой точки карты. Длительность существования паутин не ограничена по времени, и их можно уничтожить вручную. Если превысить максимальное число паутин, то самая старая из них исчезнет. Чем меньше текущее здоровье существа, тем меньше бонус к его скорости передвижения.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Дальность применения: 1000",
        "Радиус паутины: 900",
        "Макс. зарядов паутин: 3\/5\/7\/9 ( 6\/8\/10\/12)",
        "Доп. восстановление здоровья: 5\/7\/9\/11",
        "Бонус к скорости поворота: 0,2",
        "Порог здоровья для получения мин. бонуса к скорости передвижения: 1%",
        "Мин. бонус к скорости передвижения: 9%\/14%\/19%\/24%",
        "Макс. бонус к скорости передвижения: 18%\/28%\/38%\/48%",
        "Длительность задержки ауры: 0,2",
        "Макс. зарядов: 4\/6\/8\/10",
        "Время восстановления заряда: 30 ( 20)"
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4b\/Broodmother_Silken_Bola_1.mp3\/revision\/latest?cb=20201224014000",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Снаряд летит со скоростью 1200.",
        "Silken Bola сначала наносит урон, затем применяет дебафф.",
        "Бонусный урон считается бонусным условным уроном от атаки и наносит магический урон. Хотя значения от бонусного урона не отображаются в HUD, он всё равно учитывается и прибавляется напрямую к урону атакующего существа. Однако он учитывается при подсчете вампиризма, критического удара и прорубающего удара и уменьшается только числовыми снижениями урона (например, магический барьер). Так как это бонусный урон от атаки, на него не влияют процентные бонусы или снижения урона от атаки.",
        "Хотя значения от бонусного урона не отображаются в HUD, он всё равно учитывается и прибавляется напрямую к урону атакующего существа.",
        "Однако он учитывается при подсчете вампиризма, критического удара и прорубающего удара и уменьшается только числовыми снижениями урона (например, магический барьер).",
        "Так как это бонусный урон от атаки, на него не влияют процентные бонусы или снижения урона от атаки.",
        "Прибавление бонусного урона происходит только в том случает, если атака наносила союзным героев (включая иллюзии и клонов, исключая крипов-героев) или любым подконтрольным Broodmother существом.",
        "Сочетается аддитивно с любыми другими источниками ослепления. Ослепление использует псевдослучайное распределение.",
        "Ослепление использует псевдослучайное распределение.",
        "Дающий возможность применения способности по области талант превращает Silken Bola в способностью, направленную на область с радиусом 400, которая больше не может выбирать в качестве цели существ напрямую."
      ],
      "mana": "12",
      "item_behaviour": [],
      "name": "Silken Bola",
      "cooldown": "50",
      "description": "Опутывает выбранного врага паутиной, нанося ему урон. Жертва промахивается атаками и медленнее передвигается, а любые атаки по ней наносят дополнительный магический урон.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0,67",
        "Дальность применения: 750",
        "Урон: 100\/120\/140\/160",
        "Доп. урон от атак по цели: 6\/7\/8\/9",
        "Замедление: 25%\/35%\/45%\/55% ( 60%\/70%\/80%\/90%)",
        "Шанс промаха: 40% ( 75%)",
        "Длительность: 6",
        "Радиус: 400"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5a\/Broodmother_Spinner%27s_Snare_1.mp3\/revision\/latest?cb=20210823213143",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требуется Aghanim's Scepter для разблокировки.",
        "Может быть установлена в тумане войны.",
        "Имеет глобальную дальность применения, если на расстоянии в 900 от места применения существует Паутина от способности Spin Web. В этом Векторное направление Spinner's Snare не учитывается, расстояние учитывается только от выбранной точки применения.",
        "В этом",
        "Векторное направление Spinner's Snare не учитывается, расстояние учитывается только от выбранной точки применения.",
        "Не может быть применено на другой линии Spinner's Snare. Вектор не может пересекать другие линии от Spinner's Snare.",
        "Линия создаётся за 2. До истечения этого времени линия не активна.",
        "Линия полностью невидима для противников. Эту невидимость невозможно развеять.",
        "После активации линия срабатывает на любого проходящего по ней героя. Реагирует только на героев, включая клонов, но исключая иллюзии и крипов-героев.",
        "Реагирует только на героев, включая клонов, но исключая иллюзии и крипов-героев.",
        "При срабатывании накладывает на спровоцировавшего ловушку героя один дебафф, который применяет все остальные эффекты. Модификатор разоблачает цель, раскрывает её невидимость и замедляет её скорость передвижения. Спустя 0,25 сек. модификатор накладывает оцепенение на цель, запрещая ей двигаться и использовать способность, позволяющие изменить своё местоположение. Это значит, что оцепенение длится 2,75 сек. Нанесение урона начинается после прохождения задержки перед оцепенением и срабатывает каждую 1 секунду, в результате срабатывая 3 раз. Может нанести суммарно 300 урона цели (до учёта сопротивлений).",
        "Модификатор разоблачает цель, раскрывает её невидимость и замедляет её скорость передвижения.",
        "Спустя 0,25 сек. модификатор накладывает оцепенение на цель, запрещая ей двигаться и использовать способность, позволяющие изменить своё местоположение.",
        "Это значит, что оцепенение длится 2,75 сек.",
        "Нанесение урона начинается после прохождения задержки перед оцепенением и срабатывает каждую 1 секунду, в результате срабатывая 3 раз.",
        "Может нанести суммарно 300 урона цели (до учёта сопротивлений).",
        "При первом срабатывании линия паутины становится видимой для врагов и исчезает спустя 3 сек. Таймер не зависит от нахождения дебаффа на противнике, поэтому его развеивание не уничтожит линию раньше. В это время любой другой герой всё ещё может получить дебафф от линии. В этом случае дебафф будет длиться полное время, даже если линия исчезнет.",
        "Таймер не зависит от нахождения дебаффа на противнике, поэтому его развеивание не уничтожит линию раньше.",
        "В это время любой другой герой всё ещё может получить дебафф от линии. В этом случае дебафф будет длиться полное время, даже если линия исчезнет.",
        "Линии не имеют длительности существования, они существуют, пока не сработают. Превышение максимального количества существующих линий мгновенно уничтожит самую старую линию.",
        "Превышение максимального количества существующих линий мгновенно уничтожит самую старую линию.",
        "Линии не дают обзор и их не видно через туман войны кому-либо, включая Broodmother."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Spinner's Snare",
      "cooldown": "100",
      "description": "Герой может создать до 5 невидимых линий из паутины в любом месте, где есть паутина от способности Spin Web. Если линию пересечёт вражеский герой, то на него сработает оцепенение, он начнёт получать периодический урон, а вся вражеская команда получит оповещение о срабатывании линии и сможет видеть жертву в тумане войны. Когда этот эффект закончится, то линия пропадёт, но до этого в неё могут попасться и другие герои.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,56",
        "Дальность применения: 600",
        "Длина паутинки: 900",
        "Ширина паутинки: 50",
        "Задержка перед активацией: 2",
        "Лимит паутинок: 5",
        "Урон в секунду: 100",
        "Замедление скорости передвижения: 100%",
        "Длительность замедления: 0,25",
        "Длительность оцепенения: 3",
        "Число зарядов: 2",
        "Время восстановления заряда: 20"
      ],
      "legacy_key": "D",
      "story": "Даже по малейшему трепету паутины Арахния сможет отыскать свою жертву."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Broodmother_Spawn_Spiderlings_1.mp3\/revision\/latest?cb=20191216011849",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Снаряд Spawn Spiderlings летит со скоростью 1200.",
        "Spawn Spiderlings сначала применяет дебафф, затем наносит урон.",
        "Паучки появляются только в случае смерти выбранного юнита под действием дебаффа. Не имеет значения, кто убьет цель, паучки все равно появятся. Количество появившихся паучков зависит от уровня способности на момент их появления, а не применения.",
        "Не имеет значения, кто убьет цель, паучки все равно появятся.",
        "Количество появившихся паучков зависит от уровня способности на момент их появления, а не применения.",
        "Несколько применений Spawn Spiderlings на одну и ту же цель полностью сочетаются, каждое из них наложит отдельный дебафф. Имеет лимит в 7 дебаффов. Если противник уже находится под действием 7 дебаффов, то новое применение не нанесёт урон и не применит дебафф.",
        "Имеет лимит в 7 дебаффов. Если противник уже находится под действием 7 дебаффов, то новое применение не нанесёт урон и не применит дебафф.",
        "Паучки получают все бонусы от Spin Web.",
        "Выбор таланта, увеличивающего урон, мгновенно обновит все летящие снаряды Spawn Spiderling.",
        "Выбор таланта на дополнительное здоровье или урон не усилит уже призванных паучков и паучат Broodmother."
      ],
      "mana": "9\/8\/7",
      "item_behaviour": [],
      "name": "Spawn Spiderlings",
      "cooldown": "120",
      "description": "Герой впрыскивает во врага свои яйца и наносит ему урон. Если жертва умрёт, находясь под действием этой способности, из её трупа появятся несколько паучков.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: 900",
        "Урон: 240\/320\/400 ( 320\/400\/480)",
        "Количество пауков: 4\/5\/6",
        "Длительность дебаффа: 20",
        "Длительность паучков: 60"
      ],
      "legacy_key": "T",
      "story": "Паучиха продолжает взращивать своё потомство даже на поле битвы. Выводок быстро понимает, как поддержать мать."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "Это заклинание от самой паутины, что позволяет Broodmother уничтожать паутины индивидуально вместо уничтожения старой паутины.",
        "Паутины не оставляют трупов."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Destroy Spin Web",
      "cooldown": "0",
      "description": "Уничтожает выбранную паутину.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов"
      ],
      "notes": [
        "Удачные атаки с Poison Sting по одной и той же цели не складываются, но обновляют длительность дебаффа.",
        "Атаки сначала наносят собственный урон, затем накладывают дебафф.",
        "Действует на союзников и варды, но не на постройки.",
        "Считает крипов-героев за крипов.",
        "Паучата не получают эту способность."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Poison Sting",
      "cooldown": null,
      "description": "Отравляет и замедляет врагов каждым ударом.",
      "hot_key": "?",
      "params": [
        "Замедление передвижения: 6%\/8%\/10%",
        "Длительность на героях: 2",
        "Длительность на крипах: 6"
      ],
      "legacy_key": "",
      "story": null
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов"
      ],
      "notes": [
        "Успешные атаки с Spawn Spiderite по одной и той же цели не складываются, но обновляют длительность дебаффа.",
        "Атаки сначала наносят собственный урон, затем накладывают дебафф.",
        "Паучата появятся только когда атакованное существо умерло под действием дебаффа. Не важно, кто убил цель — паучата появятся в любом случае.",
        "Не важно, кто убил цель — паучата появятся в любом случае.",
        "Не действует на варды и постройки, но действует на союзников.",
        "Паучата полностью попадают под влияние Spin Web.",
        "Паучата не получают эту способность."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Spawn Spiderite",
      "cooldown": null,
      "description": "Заражает жертву атаками. Если она умрет, из трупа появятся несколько паучат.",
      "hot_key": "?",
      "params": [
        "Кол-во паучат: 1",
        "Длительность дебаффа: 2",
        "Длительность паучат: 60"
      ],
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.4,
    "attrAgility": 19.0
  },
  "description": "Охотится на врагов со своей паучьей армией Скользя по своей паутине, Broodmother взращивает армию пауков, которые вместе с её командой наступают на базу врага. Если на пути встречается жертва, паучиха присоединяется к своим отпрыскам и нападает, замедляя врагов ядовитыми укусами и утоляя свой животный голод.  Керри Осада Побег Быстрый урон ★★☆",
  "history": "Веками чёрная паучиха Арахния скрывалась в тёмных лавовых туннелях под тлеющими кратерами горы Пиротей, взращивая миллионы паучков и отправляя их охотиться на поверхности. Однажды визирь жадности Фолопталис воздвиг на склоне этого потухшего вулкана свой магнетитовый зиккурат, прекрасно зная: любым грабителям, что ищут его притягательные богатства, сначала придётся пройти через паучьи владения. Тысячелетию материнского спокойствия пришёл конец: гору непрерывно осаждали мохноноги и воришки, смелые рыцари и благородные юноши — несомненно, очень питательные, но всё же мешающие воспитывать невинное паучье потомство. Устав от вторжений, Арахния нанесла Фолопталису визит, а когда тот отказался уступить, паучиха затянула его в шёлковый кокон и отложила до особого пира в честь дня рождения. К несчастью, опустевший зиккурат лишь привлёк новых охотников за наживой. Когда один из паучков попал под ноги неуклюжего наглеца, материнскому терпению пришёл конец. Арахния направилась на поверхность и объявила: она избавит мир от каждого вредителя, вплоть до самого последнего героя — пока не убедится, что её драгоценные паучата растут в безопасности."
}