{
  "abilities": [
    {
      "notes": [
        "The projectile travels at a speed of 1400",
        "Any allied unit attacking the debuffed enemy gets the attack speed buff. The buff is granted upon the attack point (i.e. starting an attack). Therefore, the buff is granted even if the attacks missed or changing targets after the attack point. Does not apply to instant attacks. Once gained, the buff stays for its full duration, so it can be used against other targets. The buff is granted to any allied unit, including buildings and wards",
        "When leveling up the ability while a cast is already active, the ability values on already affected units do not update to the new values. Successive casts also do not update existing ability values but refresh the duration",
        "Penitence first applies the debuff, then the damage"
      ],
      "item_behaviour": [],
      "description": "Forces an enemy unit to move slower and for allies to attack it more quickly.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.77",
        "Cast Range:  800",
        "Target Move Speed Slow: 12%\/20%\/28%\/36% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 24%\/32%\/40%\/48%)",
        "Allies Attack Speed Bonus: 25\/50\/75\/100",
        "Debuff Duration: 5\/6\/7\/8",
        "Buff Duration: 2",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Damage:  225"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Chen_Penitence_1.mp3\/revision\/latest?cb=20191216012058",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: "
      ],
      "mana": "14\/13\/12\/11",
      "aghanim": null,
      "name": "Penitence",
      "cooldown": "70\/75\/80\/85",
      "legacy_key": "E",
      "story": "Although Chen's brand of animal enthrallment isn't quite strong enough to control the minds of enemy heroes, it still tests their resolve in combat."
    },
    {
      "notes": [
        "Applies a basic dispel on the target which removes buffs and debuffs",
        "Persuading a new creep while already having the maximum amount of creeps instantly kills the oldest persuaded creep. The death is not credited to anyone so that no one gets experience from it",
        "Cannot persuade  Roshan,  Siege Creeps,  Couriers,  Necronomicon Warriors,  Necronomicon Archers, creep-heroes and ancient creeps. SHARD NOTES Ancient creeps can now be persuaded, with a maximum of 1\/2\/3 ancient creeps per level of  Hand of God. Ancient creeps are included in the max units count as well, so it does not allow Chen to have more creeps persuaded. When persuading an ancient creep while already having the maximum amount of ancient creeps, the oldest persuaded ancient creep dies. If Hand of God is not learned, Holy Persuasion can still be cast on ancient creeps, but it does nothing, wasting the mana and cooldown",
        "With Level 4 Holy Persuasion, Chen can persuade the following number of creeps (and ancient creeps) on each level of   Hand of God: Level 1: Max 3 creeps with 1 ancient creep. Level 2: Max 2 creeps with 2 ancient creeps. Level 3: Max 1 creeps with 3 ancient creeps.",
        "The following neutral creeps cannot be persuaded due to the level restriction: Level 4: Can persuade all neutral creeps Level 3 cannot persuade:  Ancient Black Dragon,  Ancient Granite Golem,  Ancient Ice Shaman,  Ancient Thunderhide,  Dark Troll Summoner,  Satyr Tormenter, Level 2, additionally unpersuadable:  Alpha Wolf,  Ancient Frostbitten Golem,  Ancient Rock Golem,  Ancient Rumblehide,  Centaur Conqueror,  Hellbear Smasher,  Warpine Raider,  Wildwing Ripper, Level 1, additionally unpersuadable:  Hellbear,  Mud Golem,  Satyr Mindstealer,  Shard Golem,",
        "When the creep's max health is below the minimum health threshold, its maximum and current health are increased by the difference. This counts as setting health and does not count as a heal. Leveling the ability or the min health increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent does not update the health of already persuaded creeps",
        "Fully restores the creep's mana upon persuading by setting mana",
        "Grants regular flat bonus attack damage to the persuaded creeps",
        "Can only be cast on units persuaded with Holy Persuasion to teleport them. Cannot target any other unit under Chen's control. Cannot target invulnerable or hidden persuaded creeps, but can teleport them if they turned invulnerable or hidden after cast. The teleport locations are based on Chen's position upon teleporting, with the units appearing 120 range to his north, east, south, or west. The very first persuaded unit teleported to Chen teleports randomly north, south, east, or west, and the following persuaded units continue counterclockwise. Gives the target a stop command after teleporting it, canceling channeling abilities, and stopping queued orders. Disjoints projectiles upon teleporting. Damage greater than 0 (before reductions) from player-based damage (including  Roshan), but excluding from self, dispels the teleport buff. If Chen is dead as the buff expires, the teleport does not happen",
        "↓↓ Double-tapping or  Portrait-casting automatically targets all units under Chen's control, excluding wards, illusions, clones and non-ancient creep-heroes. This is not limited to persuaded creeps, units acquired via other means (e.g.  Helm of the Dominator, or other summons) are targeted as well. Targets invulnerable and hidden units as well",
        "SCEPTER NOTES Acquiring  Aghanim's Scepter retroactively grants the  Martyrdom ability to the persuaded creeps"
      ],
      "item_behaviour": [],
      "description": "Chen takes control of an enemy or neutral creep. If the persuaded creep's base health is naturally below the health minimum, its base health will be raised to the health minimum. Converted creeps will have increased movement speed and bonus damage. Can be cast on converted creeps to teleport them to Chen. If cast on Chen, all units controlled by Chen will be teleported to him. Taking damage dispels the buff.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.77",
        "Cast Range:  600",
        "Teleport Cast Range: Global",
        "Max Units: 1\/2\/3\/4",
        "Creep Min Base Health: 700\/800\/900\/1000 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1900\/2000\/2100\/2200)",
        "Creep Move Speed Bonus: 10\/20\/30\/40",
        "Attack Damage Bonus: 4\/10\/16\/22 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 16\/22\/28\/34)",
        "Persuasion Creep Max Level: 3\/4\/5\/6",
        "Teleport Delay: 6 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 4)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Chen_Holy_Persuasion.mp3\/revision\/latest?cb=20191216012102",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Units",
        "Damage: Instant Kill"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Holy Persuasion",
      "cooldown": "90\/110\/130\/150",
      "legacy_key": "T",
      "story": "Although they may not be knights, Chen incorporates beasts into the Fold in the same way he himself was converted."
    },
    {
      "notes": [
        "The aura affects all Chen's player-controlled units, allied heroes, including illusions and clones. Does not affect creep-heroes",
        "Can regenerate up to 60\/120\/180\/240 health in one minute",
        "The aura's buff lingers for 0.5 seconds",
        "Does not affect invulnerable units"
      ],
      "item_behaviour": [],
      "description": "Passively provides an aura that grants increased health regeneration and armor.",
      "hot_key": "E",
      "params": [
        "Radius: 1200",
        "Health Regen Bonus: 1\/2\/3\/4",
        "Armor Bonus: 1\/2\/3\/4",
        "Aura Linger Duration: 0.5"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Aura",
        "Affects: Allies"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Divine Favor",
      "cooldown": null,
      "legacy_key": "F",
      "story": "Chen's zeal is infectious, blessing his allies with vitality and compelling them to his side."
    },
    {
      "notes": [
        "All units controlled by Chen are healed, including his illusions, summons (except for non-ancient creep-heroes) and persuaded or dominated units",
        "Does not heal any allied non-hero units or illusions, except for clones",
        "Can heal allies while they are invulnerable and while hidden",
        "Heals in 1-second intervals, 1 second after cast, the initial heal is applied together with the first heal per second instance, resulting in 8 heal instances. Can heal up to 360\/540\/720 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 640\/820\/1000) health over its duration",
        "Hand of God first applies the buff, then the heal, then the strong dispel. Heal per second from successive casts do not stack but refresh its duration",
        "The voice line upon cast is global for allies and not audible for enemies",
        "SHARD NOTES  Holy Persuasion now allows 1\/2\/3 ancient creeps to be persuaded per level of Hand of God"
      ],
      "item_behaviour": [],
      "description": "Heals all allied heroes on the map as well as all units under Chen's control. A large heal is applied at first and a slow heal over time is applied for afterwards.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.93",
        "Radius: Global",
        "Initial Heal: 200\/300\/400 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 400\/500\/600)",
        "Heal per Second: 20\/30\/40 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 30\/40\/50)",
        "Duration: 8",
        "Max Ancient Creeps Count:  1\/2\/3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9c\/Chen_Hand_of_God.mp3\/revision\/latest?cb=20191216012101",
      "effects": [
        "Ability: No Target",
        "Affects: Allied Heroes"
      ],
      "mana": "150\/130\/110 (TagTalent 120\/100\/80)",
      "aghanim": null,
      "name": "Hand of God",
      "cooldown": "200\/300\/400",
      "legacy_key": "D",
      "story": "Using the mental link with his thralls, Chen calls down restoration and well-being to those who share his fanaticism."
    },
    {
      "notes": [
        "Requires  Aghanim's Scepter and  Hand of God to be leveled to be unlocked. This ability is granted to the  Persuaded Creeps once Aghanim's Scepter is acquired. When losing Aghanim's Scepter, the ability disappears immediately from the persuaded creeps",
        "Martyrdom's cooldown is shared among all persuaded units. It is possible to have different cooldown values if another unit is persuaded after Martyrdom is cast",
        "Cannot be cast on invulnerable units and  Couriers",
        "↓↓ Double-tapping instantly kills the persuaded unit. The death is not credited to anyone so that no one gets experience from it",
        "The cooldown is shared between all persuaded units",
        "Does not affect  Couriers",
        "Hand of God notes fully apply"
      ],
      "item_behaviour": [],
      "description": "Sacrifice the life of this unit to heal any ally with the current level of Hand of God.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.93",
        "Cast Range: Global"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies",
        "Damage: Instant Kill"
      ],
      "mana": "8",
      "aghanim": null,
      "name": "Martyrdom",
      "cooldown": "0",
      "legacy_key": "?",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 25.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 3.2,
    "attrAgilityInc": 2.1,
    "attrAgility": 15.0
  },
  "description": "Converts creeps to his cause, building an army. Converted at sword-point after a disastrous battle, Chen quickly became one of the Fold's most zealous knights. Raised among the clans of the Hazhadal Barrens, Chen adapts his skills of animal enthrallment to perform Holy Persuasions and Martyrdoms, compelling packs of creatures of the forest to fight and sacrifice for his cause. His allies are graced with Divine Favor, while foes are forced to atone through the magnified pains of Penitence. Chen's devotion does not go unrewarded. The Hand of God aids his companions in their quests, intervening at critical moments to heal their injuries and save them from fatal blows.  Support Jungler Pusher ★★★",
  "trivia": [
    "Chen's fun names in DotA were Chechen and Jackie Chen, a pun on the name of the famed actor Jackie Chan.",
    "Chen's death quote Link▶️ \"My Leg\" refers to a Spongebob Squarepants running gag."
  ],
  "history": "Born in the godless Hazhadal Barrens, Chen came of age among the outlaw tribes who eked out an existence in the shimmering heat of the desert. Using an ancient form of animal enthrallment, Chen's people husbanded the hardy desert locuthi, a stunted species of burrowing dragon that melted desert sands into tubes of glass where twice-a-year rains collected. Always on the edge of starvation and thirst, fighting amongst their neighbors and each other, Chen's clan made the mistake, one fateful day, of ambushing the wrong caravan. In the vicious battle that followed, Chen's clan was outmatched. The armored Knights of the Fold made short work of the enthralled locuthi, who attacked and died in waves. With their dragons dead, the tribesmen followed. Chen struggled, and slashed, and clawed, and perished—or would have. Defeated, on his knees, he faced his execution with humility, offering his neck to the blade. Moved by Chen's obvious courage, the executioner halted his sword. Instead of the blade, Chen was given a choice: death or conversion. Chen took to the faith with a ferocity. He joined the Fold and earned his armor one bloody conversion at a time. Now, with the fanaticism of a convert, and with his powers of animal enthrallment at their peak, he seeks out unbelievers and introduces them to their final reward.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Hand of God applies a Strong Dispel",
        "talent_left": "+200\/+10 Hand of God Heal\/Heal Over Time"
      },
      {
        "talent_lvl": "20",
        "talent_right": "-30s Hand of God Cooldown",
        "talent_left": "+1200 Holy Persuasion Minimum Health"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+12 Holy Persuasion Damage",
        "talent_left": "+12% Penitence Slow"
      },
      {
        "talent_lvl": "10",
        "talent_right": "Penitence Deals 225 Damage",
        "talent_left": "-2s Holy Persuasion Teleport Delay"
      }
    ]
  }
}