{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Desolator_Corruption.mp3\/revision\/latest?cb=20191227195408",
      "effects": [
        "Снижение брони: 6",
        "Длительность: 7"
      ],
      "notes": [
        "Успешные атаки с Desolator не стакают дебафф, но обновляют длительность дебаффа.",
        "Атаки сначала применяют дебафф, затем наносят урон.",
        "Работает против вардов, построек и союзных существ.",
        "Заменяет частицы снарядов героев дальнего боя на красные снаряды.",
        "Не сочетается с Lesser Corruption. Если присутствуют оба дебаффа, то дебафф от Blight Stone не снижает броню.",
        "Если присутствуют оба дебаффа, то дебафф от Blight Stone не снижает броню."
      ],
      "mana": null,
      "abilityName": "Corruption",
      "cooldown": null,
      "description": "Атаки уменьшают броню цели на 6. Эффект длится 7 сек.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Макс. зарядов: 20",
        "Зарядов за убийство: 2",
        "Урона от атаки за заряд: 1"
      ],
      "notes": [
        "Получает 2 заряда когда вражеский герой умирает любым способом под действием дебаффа Corruption. Не получает заряды от крипов-героев, иллюзий или от Tempest Double.",
        "Не получает заряды от крипов-героев, иллюзий или от Tempest Double.",
        "При наличии нескольких Desolator в активном инвентаре, заряды получает тот, который был первым полученным.",
        "Если несколько игроков имеют Desolator и атакуют одну и ту же цель, то заряды получит тот, кто последним обновит дебафф.",
        "Предмет не нуждается в нахождении в инвентаре для получения зарядов, он получает их где угодно.",
        "Количество зарядов привязано к предмету, а не игроку. Продажа и повторная покупка предмета не переносит заряды.",
        "Количество текущих зарядов отображается на иконке предмета."
      ],
      "mana": null,
      "abilityName": "Soul Stealer",
      "cooldown": null,
      "description": "Когда умирает герой, броня которого была уменьшена этим предметом, бонус к урону увеличивается на 2. Максимум: 20 урона.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3500",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Mithril Hammer",
    "Blight Stone"
  ],
  "name": "Desolator",
  "description": "Это проклятое оружие использовалось при пытках особо опасных преступников.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}