{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Pipe_of_Insight_Barrier.mp3\/revision\/latest?cb=20191227195518",
      "effects": [
        "Радиус: 1200",
        "Поглощение магического урона: 400",
        "Длительность: 12"
      ],
      "notes": [
        "При использовании прерывает произносимые способности заклинателя.",
        "Действует на всех союзных существ, включая постройки, но исключая варды. Действует на неуязвимых, но не спрятанных союзников.",
        "Блокирует урон до любых уменьшений, за исключением Mana Shield.",
        "Блокирует только магический урон от способностей и атак. Не блокирует физический или чистый урон.",
        "Повторное использование обновит бафф и сбросит счётчик поглощённого урона.",
        "Не сочетается с другими магическими барьерами. Если на существо будет активировано несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно. При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Если на существо будет активировано несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно.",
        "При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Не делит перезарядку с Hood of Defiance или Eternal Shroud."
      ],
      "mana": "100",
      "abilityName": "Barrier",
      "cooldown": "60",
      "description": "Создаёт на владельце и окружающих его союзниках барьер, блокирующий 400 магического урона. Действует 12 сек.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Доп. восстановление здоровья: 2,5",
        "Доп. сопротивление магии: 15%",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Эффект от нескольких Insight Aura не складывается. Полностью складывается с другими источниками ауры восстановления здоровья, основанной на Headdress.",
        "Полностью складывается с другими источниками ауры восстановления здоровья, основанной на Headdress.",
        "Сочетается по закону убывающей полезности с другими источниками сопротивления магии. Insight Aura увеличивает итоговое сопротивление магии большинства героев до 36,25%.",
        "Insight Aura увеличивает итоговое сопротивление магии большинства героев до 36,25%.",
        "Восстанавливает до 150 здоровья в минуту.",
        "Не действует на варды, постройки и неуязвимых существ.",
        "Бафф ауры задерживается на 0,5 сек."
      ],
      "mana": null,
      "abilityName": "Insight Aura",
      "cooldown": null,
      "description": "Действует на союзников вокруг. Увеличивает их восстановление здоровья на 2,5 и сопротивление магии на 15%.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3475",
  "lore": null,
  "consistFrom": [
    "Hood of Defiance",
    "Headdress",
    "Recipe"
  ],
  "name": "Pipe of Insight",
  "description": "Могущественный артефакт таинственного происхождения. Он создаёт барьеры, защищающие от магических сил.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}