{
  "abilities": [
    {
      "notes": [
        "Талант на дальность применения не влияет на дальность отскоков Arc Lightning.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+100 к урону от Arc Lightning",
          "talentRight": "+275 к дальности заклинаний"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0.4 сек. оглушения от Lightning Bolt",
          "talentRight": "+100 к урону от Thundergod's Wrath"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1.2% к урону от Static Field",
          "talentRight": "+25 к скорости передвижения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+200 к здоровью",
          "talentRight": "+1,25 маны в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1f\/Zeus_Arc_Lightning_1.mp3\/revision\/latest?cb=20191216030834",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скачки происходят с интервалом в 0.25 секунды; требуется 1\/1,5\/2\/3,5 сек. для поражения всех целей.",
        "Не перескакивает на невидимых существ или существ в тумане войны.",
        "За одно применение никогда не поражает существо дважды.",
        "Все отскоки наносят до 375\/700\/1125\/2250 (TagTalent 875\/1400\/2025\/3750) единиц урона (до уменьшений).",
        "У способности есть скрытый бафф - Arc Lightning, необходимый для скачка молнии."
      ],
      "mana": "80",
      "hotKey": "Q",
      "cooldown": "1,6",
      "description": "Выпускает молнию, которая перескакивает с одного врага на другого.",
      "spellName": "Arc Lightning",
      "params": [
        "Анимация применения: 0,2+0,63",
        "Дальность применения: 850 (TagTalent 1125)",
        "Дальность скачка: 500",
        "Число скачков: 5\/7\/9\/15",
        "Интервал скачка: 0.25",
        "Урон: 75\/100\/125\/150 (TagTalent 175\/200\/225\/250)",
        "Блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Любимый приём бога грома против жалких смертных."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/91\/Zeus_Lightning_Bolt.mp3\/revision\/latest?cb=20191216030837",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Если Lightning Bolt применяется на землю, но в радиусе 375 нет героев, то она всё равно дает летающий обзор в радиусе 750 и эффект True Sight.",
        "Молния сначала наносит урон, затем применяет дебафф.",
        "Если целью является существо, при использовании обзор и True Sight появляются в месте его нахождения. Летающий обзор зафиксирован и не перемещается вместе с существом. Но при изначальном выборе точки на земле и попадании в героя обзор будет закреплен за выбранной точкой, а не за обнаруженным героем.",
        "Но при изначальном выборе точки на земле и попадании в героя обзор будет закреплен за выбранной точкой, а не за обнаруженным героем.",
        "При выборе точки на земле для поражения невидимого или находящегося в тумане врага не нужны обзор или True Sight.",
        "Летающий обзор и True Sight длятся 4,5 сек. True Sight предоставляется аурой, а его дебафф задерживается на 0,5 сек.",
        "При выборе точки на земле способность ищет вражеских героев, иллюзии и крипов-героев; ближайшее существо получит урон.",
        "При выборе точки на земле способность поражает вражеского героя на расстоянии до 1075\/1125\/1175\/1225 (TagTalent 1350\/1400\/1450\/1500) единиц (складывается из дальности применения и радиуса поиска).",
        "Для поражения существа не-героя нужно его напрямую выбрать.",
        "При применении появляются частицы молний и воспроизводятся звуковые эффекты, которые видны и слышны для всех."
      ],
      "mana": "125\/130\/135\/140",
      "hotKey": "W",
      "cooldown": "6",
      "description": "Ударом молнии наносит врагу урон и ненадолго его оглушает. В радиусе 750 вокруг цели на время раскрываются туман войны и невидимость. Способность можно применить на землю — тогда она подействует на ближайшего вражеского героя в радиусе 375.",
      "spellName": "Lightning Bolt",
      "params": [
        "Анимация применения: 0,4+0,43",
        "Дальность применения: 700\/750\/800\/850 (TagTalent 975\/1025\/1075\/1125)",
        "Радиус поиска цели: 375",
        "Радиус обзора и True Sight: 750",
        "Урон: 125\/200\/275\/350",
        "Длительность оглушения: 0,2 (TagTalent 0,6)",
        "Длительность обзора и True Sight: 4,5",
        "Длительность задержки ауры True Sight: 0,5",
        "Существа с иммунитетом к заклинаниям все равно раскрываются эффектом True Sight.",
        "При попадании блокируются мини-оглушение и урон, независимо от того, была ли использована способность непосредственно на цель или нет. Обзор блокируется только при использовании непосредственно на цель. Молнии от Nimbus не блокируются."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Ошеломляющее наказание для мятежных язычников."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная (TagAghanim Ненаправленная)",
        "Действует на Врагов (TagAghanim Себя)",
        "Урон Магический Отнимающий здоровье"
      ],
      "notes": [
        "Урон Static Field отмечен как отнимающий здоровье, поэтому на него не реагируют эффекты, реагирующие на урон.",
        "Static Field взаимодействует только со способностями Zeus. Эффект не реагирует ни на предметы, ни на способности других существ (например, в Ability Draft). Arc Lightning наносит урон Static Field каждому задетому врагу до собственного. Lightning Bolt наносит урон Static Field задетому (до применения собственных эффектов) независимо от того, напрямую было выбрано существо или нет. Thundergod's Wrath наносит урон Static Field всем пораженным врагам (до применения собственных эффектов). Если враг находился в невидимости, то урона он не получит.",
        "Arc Lightning наносит урон Static Field каждому задетому врагу до собственного.",
        "Lightning Bolt наносит урон Static Field задетому (до применения собственных эффектов) независимо от того, напрямую было выбрано существо или нет.",
        "Thundergod's Wrath наносит урон Static Field всем пораженным врагам (до применения собственных эффектов). Если враг находился в невидимости, то урона он не получит.",
        "Если Arc Lightning или Lightning Bolt были заблокированы блокировкой заклинаний, то урон от Static Field не наносится.",
        "Не действует на Рошана.",
        "С Aghanim's Shard Static Field можно использовать для прыжка, мгновенного нанесения урона и применения дебаффа ближайшему врагу в радиусе поиска. При применении прерывает произносимые заклинания Zeus. При применении герой подскочит вверх на 250 единиц. При применении во время движения (обычного или принудительного) герой переместится по дуге вперед на 450. Во время прыжка Zeus не обезвреживается; он может поворачиваться, атаковать и применять способности и предметы. Может выбрать любое существо, но приоритет закреплен за героями. Считает крипов-героев за героев. Может выбрать Рошана, но применяет к нему только замедление. Сначала наносит урон, затем применяет замедление.",
        "При применении прерывает произносимые заклинания Zeus.",
        "При применении герой подскочит вверх на 250 единиц.",
        "При применении во время движения (обычного или принудительного) герой переместится по дуге вперед на 450.",
        "Во время прыжка Zeus не обезвреживается; он может поворачиваться, атаковать и применять способности и предметы.",
        "Может выбрать любое существо, но приоритет закреплен за героями. Считает крипов-героев за героев.",
        "Может выбрать Рошана, но применяет к нему только замедление.",
        "Сначала наносит урон, затем применяет замедление."
      ],
      "mana": "100",
      "hotKey": "E",
      "cooldown": "14",
      "description": "Все враги, задетые способностями героя, получат дополнительный урон, пропорциональный их текущему здоровью.",
      "spellName": "Static Field",
      "params": [
        "Анимация применения: 0+0",
        "Урон от текущего здоровья: 4%\/6%\/8%\/10% (TagTalent 5,2%\/7,2%\/9,2%\/11,2%)",
        "Радиус поиска: 0 (TagTalent 2000)",
        "Дальность прыжка: 0 (TagTalent 450)",
        "Замедление скорости передвижения: 0 (TagTalent 100%)",
        "Длительность замедления: 0 (TagTalent 2,5)",
        "Длительность прыжка: 0 (TagTalent 0,5)",
        "Позволяет активировать эту способность, чтобы герой совершил прыжок, во время которого он ударит током ближайшего видимого врага в радиусе 2000 (TagTalentв первую очередь героев), нанеся тому урон от Static Field и уменьшив его скорость передвижения на 100% на 2,5 секунды. Если герой передвигался, он прыгнет вперёд. Перезарядка: 14 секунд. Расход маны: 100."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Когда владыка грома ступает по земле, даже воздух вокруг него искрится от напряжения."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Zeus_Nimbus_1.mp3\/revision\/latest?cb=20191216030841",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Для разблокировки требуется Aghanim's Scepter. В Ability Draft Nimbus может быть разблокирована при выборе игроком Thundergod's Wrath.",
        "В Ability Draft Nimbus может быть разблокирована при выборе игроком Thundergod's Wrath.",
        "Использует Lightning Bolt текущего уровня на ближайшую подходящую вражескую цель. То есть способность также применяет мини-оглушение и дает обзор и эффект True Sight вокруг цели. Также Nimbus не будет ничего применять, если Lightning Bolt не изучена. В Ability Draft для работы Nimbus нужна выбранная Lightning Bolt.",
        "То есть способность также применяет мини-оглушение и дает обзор и эффект True Sight вокруг цели.",
        "Также Nimbus не будет ничего применять, если Lightning Bolt не изучена.",
        "В Ability Draft для работы Nimbus нужна выбранная Lightning Bolt.",
        "Источником урона считается само облако, поэтому эффекты, реагирующие на урон, будут срабатывать на Nimbus, а не на Zeus (например, Blade Mail). Также на урон Nimbus не влияют никакие внешние усиления или уменьшения урона. Несмотря на это, молнии применяют Static Field к целями; этот урон исходит от Zeus и к нему применяется манипуляция наносимого урона.",
        "Также на урон Nimbus не влияют никакие внешние усиления или уменьшения урона.",
        "Несмотря на это, молнии применяют Static Field к целями; этот урон исходит от Zeus и к нему применяется манипуляция наносимого урона.",
        "После применения срабатывает сразу, если противник находится в радиусе действия.",
        "Также бьёт мгновенно, если последний удар был длиннее интервала, т.е если противник зайдёт в радиус, то получит урон.",
        "Наносит до 16 ударов в течении всего времени действия, учитывая базовый интервал ударов.",
        "Не требует обзора на цели. Nimbus может поражать невидимых существ и существ в тумане войны.",
        "Всегда атакует ближайшую подходящую цель без каких-либо приоритетов. Не выбирает варды и строения.",
        "Визуальные эффекты на земле, отмечающие область действия, видны каждому."
      ],
      "mana": "325",
      "hotKey": "D",
      "cooldown": "45",
      "description": "Создает в любом месте карты грозовое облако, которое автоматически применяет способность Lightning Bolt на врагов неподалеку.",
      "spellName": "Nimbus",
      "params": [
        "Анимация применения: 0,2+0,64",
        "Дальность применения: Глобальная",
        "Радиус облака: 450",
        "Атак героев ближнего боя для разрушения: 4",
        "Атак героев дальнего боя для разрушения: 8",
        "Атак не-героев для разрушения: 16",
        "Интервал Lightning Bolt: 2,25",
        "Длительность: 35",
        "Существа с иммунитетом к заклинаниям всё так же раскрываются True Sight."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Где гневается бог грома, вскоре собираются тучи."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Zeus_Thundergod%27s_Wrath_1.mp3\/revision\/latest?cb=20191216030845",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Дает летающий обзор в радиусе 500 и True Sight в радиусе 900 единиц вокруг каждого пораженного героя.",
        "Не дает обзор вокруг неуязвимых и спрятанных героев, но дает вокруг невидимых.",
        "Летающий обзор и True Sight длятся 3 сек. True Sight является аурой, а её дебафф задерживается на 0,5 сек.",
        "Thundergod's Wrath сначала наносит урон всем вражеским героям (если это возможно), а затем дает вокруг них обзор. То есть способность не наносит урон невидимым героям, если они не были обнаружены другим источником True Sight.",
        "То есть способность не наносит урон невидимым героям, если они не были обнаружены другим источником True Sight.",
        "При поражении 5 героев Thundergod's Wrath"
      ],
      "mana": "300\/400\/500",
      "hotKey": "R",
      "cooldown": "130\/125\/120",
      "description": "Поражает всех вражеских героев молнией вне зависимости от их местоположения. Способность также раскрывает невидимость вражеских существ вокруг каждого ударенного противника. Если герой врага невидим, то он не получит урона, но невидимость всё равно раскроется.",
      "spellName": "Thundergod's Wrath",
      "params": [
        "Анимация применения: 0,4+0,43",
        "Радиус действия: Глобальный",
        "Радиус обзора: 500",
        "Радиус True Sight: 900",
        "Урон: 300\/400\/500 (TagTalent 400\/500\/600)",
        "Длительность обзора и True Sight: 3",
        "Длительность задержки ауры True Sight: 0,5",
        "Дарует новую способность: Nimbus.",
        "Дает обзор и эффект True Sight на врагов с иммунитетом к заклинаниям. Не наносит урон врагам с иммунитетом. Существа с иммунитетом все равно раскрываются эффектом True Sight."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Повелитель небес сокрушает всех, кто противостоит ему, независимо от того, близко или далеко они находятся."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 19.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.2,
    "attrAgility": 11.0
  },
  "description": "Zeus — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, три из которых активные, а одна пассивная. Его первая способность Arc Lightning, бросает молнию, которая перескакивает с одного врага на другого, при этом нанося урон каждому задетому врагу. Вторая способность Lightning Bolt, ударяет врага молнией, нанося урон и кратковременно оглушая. В радиусе вокруг цели способность ненадолго раскрывает туман войны и невидимых юнитов. Может быть применена на землю. Третья, пассивная способность Static Field, ошеломляет врагов поблизости каждый раз, когда Zeus произносит заклинание, при этом нанося урон, пропорциональный уровню их текущего здоровья. Ультимативная способность Thundergod's Wrath, ударяет каждого врага молнией вне зависимости от его местоположения. Thundergod's Wrath также дает True Sight вокруг каждого ударенного героя в радиусе. Улучшение с Aghanim's Scepter добавляет новую способность Nimbus, которая создает грозовое облако в любой точке карты, в котором на всех врагов попавших под его действие применяется способность Lightning Bolt. Урон зависит от текущего уровня прокачки этой способности.",
  "history": "Повелитель небес и отец богов видит во всех героях своих буйных, мятежных детей. Неисчислимы свидания со смертными женщинами, где заставала его супруга. Поставила богиня бессмертного перед выбором: «Если нравятся смертные, иди и сам стань среди них. Докажи свою верность, и приму тебя своим мужем бессмертным. Если же нет — иди и умри средь созданий своих». Согласился с ней бог: неоспоримы были её слова (да и магия тоже). С тех пор он вёл себя примерно, проявляя к бессмертию чуть больше любви, чем к смертным. Но чтобы умолить вечную свою супругу, он должен стремиться к победам на поле боя.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+100 к урону от Arc Lightning",
      "talentRight": "+275 к дальности заклинаний"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0.4 сек. оглушения от Lightning Bolt",
      "talentRight": "+100 к урону от Thundergod's Wrath"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1.2% к урону от Static Field",
      "talentRight": "+25 к скорости передвижения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+200 к здоровью",
      "talentRight": "+1,25 маны в секунду"
    }
  ]
}