{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Дальность применения: 500"
      ],
      "notes": [
        "Применяет базовое развеивание на цель при применении. Следует стандартным правилам развеивания, развеивая дебаффы с союзников и баффы с врагов.",
        "Следует стандартным правилам развеивания, развеивая дебаффы с союзников и баффы с врагов.",
        "Нельзя применить на неуязвимых существ."
      ],
      "mana": "75",
      "abilityName": "Cleanse",
      "cooldown": "20",
      "description": "Применяет развеивание на выбранного врага или союзника.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Макс. маны в бонусный урон от атаки: 4%"
      ],
      "notes": [
        "Бонусный урон считается бонусным условным уроном от атаки и является магическим уроном. Хоть значения бонусного урона от атаки не отображаются в интерфейсе, он все равно учитывается и напрямую добавляется к урону от атаки существа. Не учитывается вампиризмом, критическим ударом или прорубанием. Может быть уменьшен только прямыми снижениями (например, барьером магического урона). Так как он считается бонусным уроном от атаки, на него не действуют процентные бонусы или снижения урона от атаки.",
        "Хоть значения бонусного урона от атаки не отображаются в интерфейсе, он все равно учитывается и напрямую добавляется к урону от атаки существа.",
        "Не учитывается вампиризмом, критическим ударом или прорубанием.",
        "Может быть уменьшен только прямыми снижениями (например, барьером магического урона).",
        "Так как он считается бонусным уроном от атаки, на него не действуют процентные бонусы или снижения урона от атаки.",
        "Проверяет ману цели при завершении атаки. Для героев дальнего боя — при столкновении снаряда."
      ],
      "mana": null,
      "abilityName": "Subjugate",
      "cooldown": null,
      "description": "Каждая атака владельца наносит жертве урон, равный 4% от её максимальной маны.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Witchbane",
  "description": "Поместье Тайлер не испытывает недостатка в подопытных — и потому изощряется в неописуемых жестокостях, которые затем являет миру.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}