{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Projectiles launched with True Strike cannot miss due to evasion or blindness, but can still be disjointed.",
        "Also prevents ranged attacks from missing due to the 25% uphill miss chance.",
        "Also prevents melee attacks from missing due to the target moving more than 350 range away before the attack.",
        "Does not work against buildings, works against any other unit, including wards and allied units.",
        "Does not prevent attacks from getting canceled when the target gets too far away during the attack animation (motion buffer range)."
      ],
      "mana": null,
      "abilityName": "True Strike",
      "cooldown": null,
      "description": "Your attacks cannot miss.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "This item drops when its wielder dies, unless it has Reincarnation.",
    "Divine Rapier cannot be destroyed or sold.",
    "Divine Rapier cannot be put into the backpack.",
    "Unlike other combined items, Divine Rapier cannot be disassembled within 10 seconds after assembling it.",
    "Couriers can be used to buy a Divine Rapier, but they cannot pick rapiers up from the ground.",
    "Divine Rapier has two states: Original Rapier: initial state upon buying the item Free Rapier: state after being picked up by an enemy once",
    "Original Rapier: initial state upon buying the item",
    "Free Rapier: state after being picked up by an enemy once"
  ],
  "cost": "6000",
  "lore": null,
  "consistFrom": [
    "Sacred Relic",
    "Demon Edge"
  ],
  "boughtFrom": "Weapons",
  "name": "Divine Rapier",
  "description": "So powerful, it cannot have a single owner.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+300 Attack damage"
  ],
  "tips": [
    "The components of Divine Rapier can be stored separately by locking one of the components to prevent disassembly. This can be used to purchase both parts with the courier without risking the loss of the item before delivery or to save the item until the owner judges the time is right.",
    "Although it is a very expensive item, it is the most cost-effective damage item. Keep it in mind when your team is losing, Divine Rapier is a great last-stand item under such conditions.",
    "No matter what, Divine Rapier should always be considered a purely situational item and never a core item since it can result in throwing the game. Avoid purchasing it in games with poor team coordination, as even the strongest carry will need the support of the rest of their team to survive being the highest-priority target.",
    "Some heroes can utilize Divine Rapier much better than others by dealing splash damage or having better output environment. Even if enemy carry manages to get the Rapier, depending on their hero, they may not be able to use it just as effectively.",
    "Rapier-holders should consider buying a second Rapier (when possible) to keep in their stash as a backup so that after a possible death they still have another Rapier to use.",
    "If a Rapier is picked up from the ground by a hero that can't use it effectively, it is possible to transfer it to an ally by having them pick it up after the carrier denies themselves.",
    "Because Divine Rapier gives 254 more extra damage than Daedalus, and Daedalus' Critical strike gives 40.5% extra DPS, Divine Rapier gives more damage than Daedalus when the hero deals less than 627 damage without crits."
  ]
}