{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Arcane_Blink_Arcane_Blink_1.mp3\/revision\/latest?cb=20210120233519",
      "effects": [
        "Ability Target Point",
        "Affects Self"
      ],
      "notes": [
        "Disjoints projectiles upon cast.",
        "Does not blink for the full distance when targeting closer than the max distance.",
        "When targeting beyond the max blink distance, it blinks for 960 range, using the penalty distance, towards the targeted direction instead of 1200. ↓↓ Double-tapping automatically casts it on the team's fountain, blinking towards its direction using the penalty distance.",
        "↓↓ Double-tapping automatically casts it on the team's fountain, blinking towards its direction using the penalty distance.",
        "The second sound only plays when the blinked distance is greater than 960. It is audible to everyone.",
        "The buff reduces the cast time and cooldown of unit abilities. Item abilities are unaffected. Stacks multiplicatively with other sources cooldown reduction.",
        "Stacks multiplicatively with other sources cooldown reduction.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan puts Blink on a 3 second cooldown. Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm. However, this cooldown is not affected by percentage-based cooldown reductions. Does not get disabled by damage flagged as HP Removal.",
        "Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm.",
        "However, this cooldown is not affected by percentage-based cooldown reductions.",
        "Does not get disabled by damage flagged as HP Removal.",
        "Shares cooldown with Blink Dagger, Overwhelming Blink, and Swift Blink. Does not share cooldown with Fallen Sky.",
        "Does not share cooldown with Fallen Sky."
      ],
      "mana": "0",
      "abilityName": "Arcane Blink",
      "cooldown": "15",
      "description": "Teleport to a target point up to 1200 units away. After teleportation, you gain 25% Ability Cooldown Reduction and 50% Cast Point reduction for 6 seconds. Arcane Blink cannot be used for 3 seconds after taking damage from an enemy hero or Roshan.",
      "params": [
        "Cast Range: Global",
        "Max Blink Distance: 1200",
        "Penalty Blink Distance: 960",
        "Radius: 800",
        "Cast Time Reduction: 50%",
        "Cooldown Reduction: 25%",
        "Slow Duration: 6",
        "Damage Cooldown: 3"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 300 mana and 1.25 mana regen.",
    "For agility heroes, it grants 300 mana and 1.25 mana regen.",
    "For intelligence heroes, it grants 300 mana, 1.25 mana regen and 25 attack damage."
  ],
  "cost": "6800",
  "lore": null,
  "consistFrom": [
    "Blink Dagger",
    "Mystic Staff",
    "Recipe"
  ],
  "boughtFrom": "Artifacts",
  "name": "Arcane Blink",
  "description": "A revitalizing tool to help bear the weight of arcane expenditure.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+25 Intelligence"
  ],
  "tips": [
    "Blink requires heroes to face the direction in which they are blinking. This means that heroes facing away from their blink destination will have to turn first, causing a slight delay depending on their turn rate.",
    "Hood of Defiance's barrier blocks damage over time, meaning that it will prevent items like Radiance from resetting Blink Dagger's cooldown.",
    "Use Blink to dodge incoming projectile-based spells such as Storm Hammer or Spirit Lance, and from items like Rod of Atos.",
    "When Blink dagger go into cooldown upon taking damage on an escape, a quick self-cast with Eul's Scepter of Divinity will allow you to wait the short cooldown relatively safely and blink out the moment you land on the ground.",
    "Blink Dagger can turn into a very strong escape tool if you are affected by False Promise."
  ]
}