{"abilities":[{"spell":"Mars throws his legendary Spear with deadly precision, damaging each enemy unit it strikes. The first enemy hero it hits is skewered on the spear, pushing it back. If a skewered hero hits a tree, building, or cliff, they will be impaled to it and stunned.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The spear travels at a speed of 1400.","The spear starts traveling exactly on Mars' location, and travels forward up to 900\/1000\/1100\/1200 range. Although within the spear's search radius, it does not hit enemies behind Mars upon cast. Can hit units up to 1025\/1125\/1225\/1325 range away (travel distance + radius).","The first hero the spear strikes gets damaged and dragged along with the spear. The hero is stunned during the drag. When not hitting a building, tree, or cliff, the enemy is dragged so that they are 900\/1000\/1100\/1200 range away from the original cast location. When hitting a building, tree, or cliff, the hero is moved closely to the pinned object and stunned. Buildings include every building, enemy and allied ones alike, but excludes the shops. Trees include the trees from Sprout, and Iron Branch, although Iron Branch trees may be hard to hit due to their tiny collision size. Cliffs include all natural cliffs onto elevated areas, as well as Fissure, Ice Shards, Power Cogs, and Arena Of Blood.","A spear may only drag one hero along with it. If that hero dies or gets freed from the spear, it still cannot impale a new hero.","Provides true sight over the impaled enemy. No true sight is applied while dragging the enemy along with the spear.","Upon losing the impale stun debuff, trees within a 100 radius around the hero get destroyed.","Hit non-hero units (including creep-heroes), as well as secondary heroes are damaged and knocked back instead. The knockback direction is based on the angle between the hit unit and the spear. The knockback does not disable units. They can still turn, attack and use items. Channeling abilities or items are not interrupted by it. The knockback destroys every tree the units collide with.","The spear cannot collide with invulnerable or hidden units, it simply flies through them.","The spear provides 300 radius flying vision as it travels. When not impaling a hero to an object, the vision lingers at the final location for 1 second. When impaling a hero to an object, the vision lingers based on the default stun duration."],"mana":"100","elements":["Does not pierce spell immunity."],"cooldown":"14","name":"Spear of Mars","description":["Cast Animation: 0.25+1.03","Cast Range: Global","Max Travel Distance: 900\/1000\/1100\/1200","Spear Collision Size: 125","Damage: 100\/175\/250\/325 ( 300\/375\/450\/525)","Knockback Distance: 75","Knockback Duration: 0.25","Impale Stun Duration: 1.6\/2\/2.4\/2.8 ( 2.6\/3\/3.4\/3.8)"],"hot_key":"Q","legacy_key":"E"},{"spell":"Mars smashes enemies in front of him with his shield, knocking them back and damaging them with a critical hit based on his attack. Bonus damage is added when hitting heroes. Has True Strike.","effects":["Ability Target Point","Affects Enemies","Damage Physical"],"notes":["God's Rebuke's effects are instantly applied within its whole area. There is no travel time.","The area is shaped like a circular sector, with a radius of 500 and an angle of 140°.","Causes Mars to perform an instant attack on all hit enemies. These attacks have True Strike, and can therefore never miss. They also ignore disarms. Can proc any attack modifier on all of the hit targets normally, with cleave being the only exception. Since God's Rebuke has an ensured critical strike, crits with a lower value have no effect if they proc (higher crit value takes priority).","If not killed, hit enemies are knocked back. The direction is based on the angle between the hit unit and the caster. Units are not disabled during the knockback. They can still turn, attack, cast spells and use items. Channeling spells are not interrupted. Does not push heroes affected by the impale stun of Spear of Mars. The knockback destroys every tree the units collide with.","When having Aghanim's Scepter, Mars does not need to be within the arena for the reduced cooldown. As long as the arena is up, it uses the lower cooldown. Starts using the lower cooldown immediately as the arena is cast. It does not rely on the arena's effect delay. The cooldown reset happens immediately as well, and not only after the arena's effect delay."],"mana":"65\/70\/75\/80","elements":["Partially pierces spell immunity."],"cooldown":"16\/14\/12\/10 ( 1.4)","name":"God's Rebuke","description":["Cast Animation: 0.2+1.07","Cast Range: 500","Radius: 500","Circle Sector Angle: 140°","Critical Damage: 160%\/200%\/240%\/280% ( 240%\/280%\/320%\/360%)","Hero Attack Damage Bonus: 25","Knockback Distance: 150","Knockback Duration: 0.3"],"hot_key":"W","legacy_key":"R"},{"spell":"Mars wields his massive shield to block a portion of each physical attack when hit from the front or sides.","effects":["Ability Passive","Affects Self"],"notes":["Reduces damage from attacks only (after other reductions), regardless of damage type. This means it does reduce magical and pure attack damage as well, but does not affect physical spell damage. Although not being attacks, Bulwark does work against The Swarm, Moon Glaives bounces, and Death Ward bounces. On the other side, it does not work against Swashbuckle, despite it using regular attacks. When taking front damage, Mars' effective health increases by 33%\/67%\/122%\/233%. When taking side damage, Mars' effective health increases by 14%\/25%\/37%\/54%.","Checks the damage source's current position and Mars' facing angle when the attack connects, not when the attack is released.","Bulwark damage reduction occurs after the Damage Block step.","Bulwark and Damage Block use the same visuals when showing how much damage was blocked, but do not otherwise interfere with each other.","Plays a visual effect and a sound whenever damage is blocked. The default hit sound does not play. When blocking hero damage from the front, a bigger visual effect and the default sound are played. When blocking hero damage from the sides, or creep damage from the front, a smaller visual effect and the small sound are played. When blocking creep damage from the sides, no effect and sound are played."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break."],"cooldown":"0","name":"Bulwark","description":["Front Angle: 140°","Side Angle: 240°","Front Damage Reduction: 25%\/40%\/55%\/70%","Side Damage Reduction: 12%\/20%\/27%\/35%"],"hot_key":"E","legacy_key":"W"},{"spell":"After a short formation time, Mars summons an arena lined with the undead warriors of the Ash Legion, who block enemy attacks and movement. Enemy heroes near the inside edge of the arena will be attacked by spears, dealing damage and knocking them back.","effects":["Ability Target Area","Affects Enemies ( Allies)","Damage Magical"],"notes":["The effect delay is not included in the field's duration. The actual duration starts right after the delay.","Inside the arena, any non-flying enemy coming within 160 range of the wall gets damaged. If not killed by the damage, the enemy is knocked back towards the arena center. Units are not disabled during the knockback. They can still turn, attack, cast spells and use items. Channeling spells are not interrupted. Does not push heroes affected by the impale stun of Spear of Mars. The knockback destroys every tree the units collide with.","A unit may only be damaged and knocked back once every 1 second.","Stops non-flying enemies by slowing them with a slow aura. The aura has a radius of 750 and is centered on the field. The slow gets exponentially stronger towards the walls, which has a 550 radius. This effectively causes enemy units touching the walls to come to halt. The slow is only present when facing towards the walls. Units at the walls facing away from it are not slowed. The aura's effect lingers for 0.5 seconds, resulting in an effective duration of 5.5\/6.5\/7.5 seconds. Since the slow is fluctuating a lot, it is not displayed in the HUD.","Besides preventing enemies from walking in or out of the area, the following movement spells are unable to pass the walls either: Skewer, Sun Ray, God's Rebuke, Force Staff, and Hurricane Pike. All other sources of horizontal movement can move units through the walls freely. However, the knockback from inside the arena still triggers and can cancel movement spells.","Flying units, and units affected by vertical movement can enter and leave the arena at any time. This means units thrown in the air by spells may be pushed in or out of the arena freely.","Any ranged attack projectile coming from an enemy gets blocked upon coming within 100 range of the walls. This means ranged enemies outside the arena cannot attack units inside of it and vice versa. Melee units can attack freely, if they can reach. Spell projectiles are completely unaffected as well. The projectiles count as completely negated, so that no on-attack effects can trigger (e.g. Retaliate).","Provides 550 range flying vision at the center of the area for 5\/6\/7 seconds upon cast.","After the effect delay, any tree touching the wall gets destroyed.","The level 25 talent adds health regeneration to the arena. The regen is provided by an aura, which lingers for 0.5 seconds. Can regenerate up to 550\/650\/750 health over its full duration (+ linger aura duration)."],"mana":"200","elements":["Partially pierces spell immunity."],"cooldown":"90\/75\/60","name":"Arena Of Blood","description":["Cast Animation: 0.2+0.97","Cast Range: 400","Arena Radius: 550","Wall Width: 100","Effect Delay: 0.6","Allied Health Regen Bonus: 0 ( 100)","Spear Trigger Distance: 160","Spear Damage: 120\/185\/250","Spear Attack Interval: 1","Spear Knockback Distance: 160","Spear Knockback Duration: 0.2","Arena Duration: 5\/6\/7","Aura Linger Duration: 0.5"],"hot_key":"R","legacy_key":"B"}],"bio":"Mars, first son of heaven, spent a long existence waging endless war, and saw countless more crusades waged beneath the banner of his old name. Wars of conquest and of vengeance. Just and unjust... Always cruel. So much like his father, Mars indulged his basest impulses--with inclinations much more monstrous than those of Zeus--and he inflicted suffering untold. But as the epochs vanished behind him, the selfish ways of his father--the ways of many amongst his godly kin, they who judged him despicable--eventually began to ring hollow. War for its own sake was no longer enough to satisfy his desires. For the first time in his ageless days, the god of war began to question to what ends he swung his glorious spear. As the Fates would have it, his solution came easily: he must wage war for a larger purpose, and inspire more than mere savagery and sorrow at the sight of his crest. He must at last lay claim to the mantle of leadership that is his birthright, for the time has come to burn down the pantheon of the old age and build a just new empire atop the ashes of his kin. Only then might he find satisfaction, and make the glory of Mars evident to all.","talentsTips":["The strength talent effectively grants Mars 160 health, 0.8 health regen, 0.64% magic resistance and 8 attack damage.","The armor talent does not benefit illusions.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Despite being Zeus' son, Mars is named after the Roman god of war, while the Greek equivalent is Ares. However, lines from Mars ( \"I don't answer to that name anymore, you old fool.\") and Zeus themselves ( \"Change your name all you want, you can't fool me.\") hint that Mars has changed his name, possibly to avoid association with his father.","Mars carries a Greek-style Boeotian shield, but its decorative thunderbolts are more common on Roman shields.","Arena Of Blood's casting sound comes from the Mars movement of Gustav Holst's musical suite, The Planets. Mars also hums the music when ordered to move or after killing an enemy in the Arena of Blood.","Mars' response on pinning an enemy against the walls of Arena of Blood ( \"Are you not entertained?!\") is a reference to a scene from the film Gladiator.","Mars' death response ( \"What is this madness?!\") and Dota Plus chat wheel line ( \"THIS IS DOOOOTAAAAA!\") are references to the famous \"THIS IS SPARTA!\" scene from the film 300","Files related to Mars were leaked on January 03, 2018, but were deleted later that day. The leaked abilities were called Spear Wall\/Spear and Phalanx\/Phalanx Cancel."],"talents":["Arena Of Blood Grants Team +100 HP Regen:+80% God's Rebuke Crit","+1s Spear Stun:Spear of Mars +200 Damage","+8 Armor:+30 Damage","+20 Movement Speed:+8 Strength"],"desc":"Mars the First Son of Heaven is an aggressive melee strength hero who controls the battlefield with numerous knockbacks and impassable terrain. Equipped with a large shield, his Bulwark passively blocks attacks from the front and sides, making him a very durable fighter in most situations. The same shield allows him to smash enemies and knock them back, dealing critical damage that ignores all evasion. The Spear of Mars can be thrown at long range, piercing enemies to push them back, and stunning them upon contact with trees or terrain. Mars' most potent ability creates an Arena Of Blood, a circular zone where no enemy can exit or enter, as well as blocking enemy attacks from the outside. Used correctly, the Arena Of Blood can decisively split and cut off enemies from support during teamfights, making Mars a valuable asset to his team, as well as a highly dangerous opponent."}