{"abilities":[{"spell":"Герой бросает своё могучее копьё, нанося урон противникам. Копьё пронзает первого задетого вражеского героя и отталкивает его. Если после этого на пути попадётся дерево, постройка или возвышенность, жертву пригвоздит к препятствию и оглушит.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Копьё летит со скоростью 1400.","Копьё начинает движение от места нахождения Mars и движется по прямой на расстояние 900\/1000\/1100\/1200. Несмотря на радиус поиска копья, оно не поражает врагов, находящихся при применении позади Mars. Может поражать юнитов на расстоянии до 1025\/1125\/1225\/1325 единиц (складывается из макс. дальности и размера столкновения).","Первый оказавшийся на пути копья герой получает урон и зацепляется за него. Если копьё не поразило строение, дерево или возвышеннность, то враг протаскивается на расстояние в 900\/1000\/1100\/1200 единиц от места применения. При поражении строения, дерева или возвышенности герой перемещается как можно ближе к объекту и оглушается. Строениями считаются как вражеские, так и союзные постройки, за исключением магазинов. К деревьям относятся деревья, созданные Sprout и Iron Branch, но в последнее сложнее попасть, так как его размер столкновения крошечный. К возвышенностям относятся как все естественные возвышенности в областях подъема, так и препятствия от Fissure, Ice Shards, Power Cogs и Arena Of Blood.","Копьё может зацепить только одного врага. Если герой умер или освободился от копья, то оно не может пронзить нового героя.","Дает эффект True Sight на пронзенного врага. Эффект не применяется при протаскивании.","При потере дебаффа оглушения от пронзания деревья в радиусе 100 от героя разрушаются.","Задевает юнитов не-героев (включая крипов-героев) и, как и вторичным героям, наносит им урон и отталкивает. Направление отталкивания зависит от угла между пораженным юнитом и копьем.","Копьё не сталкивается с неуязвимыми или спрятанными юнитам, а просто пролетает сквозь них.","Копьё даёт летающий обзор во время полёта в радиусе 500. Если копьё не прибило героя к объекту, то обзор задерживается в конечной точке на 1 секунду. Если копьё прибило героя к объекту, то обзор задерживается на столько же, сколько стандартно длится оглушение."],"mana":"100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14","name":"Spear of Mars","description":["Анимация применения: 0,25+1,03","Дальность применения: Глобальная","Максимальная дальность: 900\/1000\/1100\/1200","Размер столкновения копья: 125","Урон: 100\/175\/250\/325 ( 300\/375\/450\/525)","Дальность отталкивания: 75","Длительность отталкивания: 0.25","Длительность оглушения: 1.6\/2.0\/2.4\/2.8"],"hot_key":"Q","legacy_key":"E"},{"spell":"Герой ударяет щитом по врагам перед собой, отталкивая их и нанося им критический урон от своей атаки. Способность наносит увеличенный урон по героям, и ей нельзя промахнуться.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Физический"],"notes":["При атаках God's Rebuke могут сработать модификаторы атаки.","Атакованные юниты отбрасываются от Mars. Во время отбрасывания юниты не обезвреживаются, поэтому они могут использования заклинания и предметы, атаковать и поворачиваться. Не отбрасывает героев под действием оглушения от пронзания Spear of Mars."],"mana":"55\/60\/65\/70","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/14\/12\/10","name":"God's Rebuke","description":["Анимация применения: 0,2+1,07","Дальность применения: 500","Критический урон: 160%\/200%\/240%\/280% ( 240%\/280%\/320%\/360%)","Радиус: 500","Угол атаки: 140°","Длительность отталкивания: 0.3","Дальность отталкивания: 150","Доп. урон по героям: 25"],"hot_key":"W","legacy_key":"R"},{"spell":"Герой блокирует своим щитом часть физического урона от атак, наносимых спереди и по бокам.","effects":["Способность Пассивная","Действует на Себя","Урон Магический (Отнимающий здоровье)"],"notes":["Снижает урон только от атак. Физический урон от заклинаний не снижается (например, Quill Spray)"],"mana":"0","elements":["Отключается истощением."],"cooldown":"0","name":"Bulwark","description":["Угол блокирования спереди: 140°","Угол блокирования с боков: 240°","Снижение урона спереди: 25%\/40%\/55%\/70%","Снижение урона сбоку: 12%\/20%\/27%\/35%"],"hot_key":"E","legacy_key":"W"},{"spell":"После небольшой подготовки герой призывает арену с мертвецами из Легиона пепла, блокирующими атаки и передвижение противника. Вражеских героев внутри и около арены бьют копьями, отталкивая и нанося урон.","effects":["Способность Направленная на точку","Действует на Вражеских существ","Урон Магический"],"notes":["Arena Of Blood блокирует любые вражеские снаряды от атак, коснувшихся границ арены — как в её пределах, так и извне. Также блокирует снаряды от фонтана, башен и вардов.","Летающие юниты могут пересекать стену (например, Firefly, Dark Ascension, Summon Familiars, Arctic Burn). Сюда входят способности, принудительно передвигающие и поднимающие юнита (например, Enchant Totem, Leap, Tree Dance, Shield Crash, Pounce, Blast Off!, Toss, Walrus Kick). Сам Force Staff не может вытолкнуть вражеского юнита через стену. Но, в сочетании с другими способностями, поднимающими юнита над стеной ( Torrent, Toss or Walrus PUNCH!), его можно вытолнуть при нахождении на максимальном расстоянии до земли."],"mana":"200","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"90\/75\/60","name":"Arena Of Blood","description":["Анимация применения: 0,1+0,97","Длительность: 5\/6\/7","Радиус: 550","Ширина: 100","Урон от копий: 150 \/ 200 \/ 250","Время подготовки: 0.6","Расстояние от стены: 160","Интервал атак копий: 1","Количество солдат: 14","Доп. регенерация здоровья союзникам: 0 ( 100)"],"hot_key":"R","legacy_key":"B"}],"bio":"Марс, первый сын небес, всю свою долгую жизнь провёл в нескончаемой войне и видел, как под стягами его древнего имени ведутся бесчисленные боевые кампании. Войны ради завоеваний и ради мести. Справедливые и беспричинные... Всегда жестокие. Подобно своему отцу, Марс подчинялся низменным инстинктам — с куда более варварскими намерениями, чем у Зевса, — и приносил другим неописуемые страдания. Но как эпохи пролетали перед глазами Марса, так и всё очевиднее становился эгоизм отца, присущий, впрочем, многим презирающим его божествам. Но пришёл день, когда войны ради войны стало недостаточно. Тогда, впервые за свою вечную жизнь, бог войны начал задаваться вопросом: в нужную ли сторону он направляет своё копьё? Богини судьбы подсказали решение: сражаться ради высшей цели, чтоб его герб пробуждал в людях не только скорбь и дикость. Теперь бог войны стремится к тому, на что имеет право с рождения — сжечь пантеон прежней эпохи и построить новую империю на пепле своего народа. Лишь тогда Марс будет удовлетворён, и лишь тогда молва о его величии облетит весь мир.","talentsTips":["Талант на силу в общем даёт Mars: 160","Талант на броню не дается иллюзиям.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"talents":["Arena Of Blood даёт +100 к восст. здоровья союзников:+80% к критическому урону от God's Rebuke","+1,5 сек. к оглушению от Spear of Mars:+200 к урону от Spear of Mars","+8 к броне:+35 к урону","+20 к скорости передвижения:+8 к силе"],"desc":""}