{"abilities":[{"spell":"Герой бросает своё могучее копьё, нанося урон противникам. Копьё пронзает первого задетого вражеского героя и отталкивает его. Если после этого на пути попадётся дерево, постройка или возвышенность, жертву пригвоздит к препятствию и оглушит.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Копьё летит со скоростью 1400.","Копьё начинает движение от места нахождения Mars и движется по прямой на расстояние 900\/1000\/1100\/1200. Несмотря на радиус поиска копья, оно не поражает врагов, находящихся при применении позади Mars. Может поражать юнитов на расстоянии до 1025\/1125\/1225\/1325 единиц (складывается из макс. дальности и размера столкновения).","Первый оказавшийся на пути копья герой получает урон и зацепляется за него. Во время протаскивания герой оглушен. Если копьё не поразило строение, дерево или возвышеннность, то враг протаскивается на расстояние в 900\/1000\/1100\/1200 единиц от места применения. При поражении строения, дерева или возвышенности герой перемещается как можно ближе к объекту и оглушается. Строениями считаются как вражеские, так и союзные постройки, за исключением магазинов. К деревьям относятся деревья, созданные Sprout и Iron Branch, но в последнее сложнее попасть, так как его размер столкновения крошечный. К возвышенностям относятся как все естественные возвышенности в областях подъема, так и препятствия от Fissure, Ice Shards, Power Cogs и Arena Of Blood.","Копьё может зацепить только одного врага. Если герой умер или освободился от копья, то оно не может пронзить нового героя.","Дает эффект True Sight на пронзенного врага. Эффект не применяется при протаскивании.","При потере дебаффа оглушения от пронзания деревья в радиусе 100 от героя разрушаются.","Задевает юнитов не-героев (включая крипов-героев) и, как и вторичным героям, наносит им урон и отталкивает. Направление отталкивания зависит от угла между пораженным юнитом и копьем. Отталкивание не обезвреживает юнитов. Они могут поворачиваться, атаковать и использовать предметы. Применяемые способности и предметы не прерываются. Также разрушается каждое дерево, с которым столкнулись оттолкнутые юниты.","Копьё не сталкивается с неуязвимыми или спрятанными юнитам, а просто пролетает сквозь них.","Копьё даёт летающий обзор во время полёта в радиусе 300. Если копьё не прибило героя к объекту, то обзор задерживается в конечной точке на 1 секунду. Если копьё прибило героя к объекту, то обзор задерживается на столько же, сколько стандартно длится оглушение."],"mana":"100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14","name":"Spear of Mars","description":["Анимация применения: 0,25+1,03","Дальность применения: Глобальная","Максимальная дальность: 900\/1000\/1100\/1200","Размер столкновения копья: 125","Урон: 100\/175\/250\/325 ( 300\/375\/450\/525)","Дальность отталкивания: 75","Длительность отталкивания: 0.25","Длительность оглушения: 1.6\/2\/2.4\/2.8 ( 2.6\/3\/3.4\/3.8)"],"hot_key":"Q","legacy_key":"E"},{"spell":"Герой ударяет щитом по врагам перед собой, отталкивая их и нанося им критический урон от своей атаки. Способность наносит увеличенный урон по героям, и ей нельзя промахнуться.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Физический"],"notes":["Эффекты God's Rebuke мгновенно применяются по всей области без задержки.","Область представляет собой сектор круга с радиусом в 500 и углом в 140°.","Позволяет Mars совершить мгновенные атаки по всем задетым врагам. У этих атак эффект True Strike и они не могут промахнутся. Также атаки игнорируют обезоруживание. При атаках на врагов могут сработать модификаторы атаки за исключением прорубания. Поскольку у God's Rebuke есть гарантированный критический удар, то криты с меньшим модификатором при срабатывании не применяются (приоритет за большим значением).","Если враги не умирают, то их отбрасывает. Направление зависит от угла между заклинателем и пораженным юнитом. Во время отбрасывания юниты не обезвреживаются, поэтому они могут использования заклинания и предметы, атаковать и поворачиваться. Произносимые заклинания не прерываются. Не отбрасывает героев под действием оглушения от пронзания Spear of Mars. Также разрушает каждое дерево, с которым столкнулись отброшенные юниты.","С Aghanim's Scepter Mars не нужно быть на арене для уменьшенной перезарядки. Пока арена активна, способность использует уменьшенное значение. Уменьшенное значение применяется сразу после использования Arena of Blood. Оно не учитывает задержку эффекта. Сброс перезарядки также происходит мгновенно, а не после задержки эффекта."],"mana":"65\/70\/75\/80","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/14\/12\/10 ( 1.4)","name":"God's Rebuke","description":["Анимация применения: 0,2+1,07","Дальность применения: 500","Радиус: 500","Угол атаки: 140°","Критический урон: 160%\/200%\/240%\/280% ( 240%\/280%\/320%\/360%)","Доп. урон по героям: 25","Дальность отталкивания: 150","Длительность отталкивания: 0.3"],"hot_key":"W","legacy_key":"R"},{"spell":"Герой блокирует своим щитом часть физического урона от атак, наносимых спереди и по бокам.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Снижает урон только от атак (после остальных уменьшений) независимо от типа урона. То есть способность также уменьшает магический и чистый урон от атаки, но не влияет на физический урон заклинаний. Хоть следующие способности не являются атаками, Bulwark реагирует на The Swarm, отскоки Moon Glaives и Death Ward. Не реагирует на Swashbuckle, хотя способность использует обычные атаки. При получении урона спереди эффективное здоровье Mars увеличивается на 33%\/67%\/122%\/233%. При получении урона сбоку эффективное здоровье Mars увеличивается на 14%\/25%\/37%\/54%.","Проверяет текущую позицию источника урона и угол разворота Mars при попадании атаки, а не при её запуске.","Уменьшение урона Bulwark происходит после блокировки урона.","Bulwark и механика блокировки урона используют одинаковые визуальные эффекты для отображения количества заблокированного урона, но не перекрывают друг друга.","Проигрывает визуальный эффект и звук при блокировании урона. Стандартный звук удара не проигрывается. При блокировании урона от героя спереди проигрывается большой визуальный эффект и стандартный звук. При блокировании урона от героя сбоку или получении урона от крипа спереди проигрывается малый визуальный эффект и краткий звук. При блокировании урона от крипа сбоку эффект и звук не проигрываются."],"mana":"0","elements":["Отключается истощением."],"cooldown":"0","name":"Bulwark","description":["Угол блокирования спереди: 140°","Угол блокирования с боков: 240°","Снижение урона спереди: 25%\/40%\/55%\/70%","Снижение урона сбоку: 12%\/20%\/27%\/35%"],"hot_key":"E","legacy_key":"W"},{"spell":"После небольшой подготовки герой призывает арену с мертвецами из Легиона пепла, блокирующими атаки и передвижение противника. Вражеских героев внутри и около арены бьют копьями, отталкивая и нанося урон.","effects":["Способность Направленная на область","Действует на Врагов ( Союзников)","Урон Магический"],"notes":["Время подготовки не входит в длительность арены. Отсчёт начинается сразу после задержки.","Внутри арены любой нелетающий враг, оказавшийся в 160 единицах от стены, получает урон. Если враг не умирает от урона, то его толкает к центру арены. Во время отталкивания юниты не обезвреживаются. Они могут поворачиваться, атаковать, использовать заклинания и предметы. Произносимые заклинания не прерываются. Не отталкивает героев под действием оглушения от пронзания Spear of Mars. Также разрушает каждое дерево, с которым столкнулись отброшенные юниты.","Арена вновь отталкивает юнита и наносит ему урон лишь через 1 секунду.","Останавливает нелетающий врагов с помощью замедления аурой. Радиус ауры — 750 и он связан с ареной. Замедление усиливается экспоненциально к стенам, чей радиус равен 550. Это заставляет останавливаться вражеских юнитов, коснувшихся стен. Замедление действует только на юнитов, смотрящих в сторону стен. Отвернувшиеся юниты не замедляются. Эффект ауры задерживается на 0.5 секунды, замедляя до 5.5\/6.5\/7.5 секунд. Поскольку значение замедления колеблется, то оно не отображено в интерфейсе.","Помимо запрета на проход из или в арену, также не действует следующие способности передвижения: Skewer, Sun Ray, God's Rebuke, Force Staff и Hurricane Pike. Все прочие источники горизонтального передвижения могут свободно перемещать юнитов через стены. При этом отталкивание внутри арены продолжает срабатывать и может отменить заклинания передвижения.","Летающие юниты и юниты под действием вертикального передвижения могут заходить и покидать арену в любой момент. То есть юнитов, находящихся в воздухе, можно свободно втолкнуть или вытолкнуть из области.","Любой снаряд дальней атаки, нанесенной врагом, блокируется в 100 от стен. То есть враги, находящиеся снаружи, не могут атаковать юнитов внутри арены и наоборот. Юниты ближнего боя атакуют свободно, если могут достать цель. Снаряды заклинаний также не блокируются. Снаряды отменяются, поэтому ни один эффект, реагирующий на атаки, не срабатывает (например, Retaliate).","При применении дает летающий обзор радиусом 550 в центре арены на 5\/6\/7 секунд.","После подготовки любое дерево, соприкоснувшееся со стеной, разрушается.","Талант 25-го уровня добавляет арене регенерацию здоровья. Регенерация представлена в виде ауры, чей эффект задерживается на 0.5 секунды. Может восстановить до 550\/650\/750 здоровья за всю длительность (и длительность задержки ауры)."],"mana":"200","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"90\/75\/60","name":"Arena Of Blood","description":["Анимация применения: 0,1+0,97","Дальность применения: 400","Радиус: 550","Ширина стены: 100","Время подготовки: 0.6","Доп. регенерация здоровья союзникам: 0 ( 100)","Расстояние от стены: 160","Урон от копий: 120\/185\/250","Интервал атак копий: 1","Дальность отталкивания: 160","Длительность отталкивания копьём: 0.2","Длительность арены: 5\/6\/7","Длительность задержки ауры: 0.5"],"hot_key":"R","legacy_key":"B"}],"bio":"Марс, первый сын небес, всю свою долгую жизнь провёл в нескончаемой войне и видел, как под стягами его древнего имени ведутся бесчисленные боевые кампании. Войны ради завоеваний и ради мести. Справедливые и беспричинные... Всегда жестокие. Подобно своему отцу, Марс подчинялся низменным инстинктам — с куда более варварскими намерениями, чем у Зевса, — и приносил другим неописуемые страдания. Но как эпохи пролетали перед глазами Марса, так и всё очевиднее становился эгоизм отца, присущий, впрочем, многим презирающим его божествам. Но пришёл день, когда войны ради войны стало недостаточно. Тогда, впервые за свою вечную жизнь, бог войны начал задаваться вопросом: в нужную ли сторону он направляет своё копьё? Богини судьбы подсказали решение: сражаться ради высшей цели, чтоб его герб пробуждал в людях не только скорбь и дикость. Теперь бог войны стремится к тому, на что имеет право с рождения — сжечь пантеон прежней эпохи и построить новую империю на пепле своего народа. Лишь тогда Марс будет удовлетворён, и лишь тогда молва о его величии облетит весь мир.","talentsTips":["Талант на силу в общем даёт Mars: 160 здоровья, 0.8 регенерации здоровья, 0.64% сопротивления магии и 8 урона от атаки.","Талант на броню не дается иллюзиям.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"talents":["Arena Of Blood даёт +100 к восст. здоровья союзников:+80% к критическому урону от God's Rebuke","+1 сек. к оглушению от Spear of Mars:+200 к урону от Spear of Mars","+8 к броне:+35 к урону","+20 к скорости передвижения:+8 к силе"],"desc":"Mars — это новый герой с ближним типом атаки, основной характеристикой которого является сила."}