{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Успешные атаки с Eye of Skadi не складываются, вместо этого возобновляется длительность.",
        "Не работает против вардов и строений, но работает против курьеров и союзных юнитов."
      ],
      "mana": null,
      "abilityName": "Cold Attack",
      "cooldown": null,
      "description": "Атаки замедляют скорость передвижения и скорость атаки врагов, а также уменьшают их восстановление здоровья, лечение и вампиризм на 40% на 3 сек. Скорость передвижения снижается на 25% врагам ближнего боя и на 50% врагам дальнего боя. Скорость атаки снижается на 25 врагам ближнего боя и на 50 врагам дальнего боя.",
      "params": [
        "Замедление передвижения (против ближнего боя): 25%",
        "Замедление передвижения (против дальнего боя): 50%",
        "Замедление скорости атаки (против ближнего боя): 25",
        "Замедление скорости атаки (против дальнего боя): 50",
        "Уменьшение лечения: 40%",
        "Длительность: 3"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 700 здоровья, 2,5 регенерации здоровья, 4,17 брони, 25 скорости атаки, 500 маны, 1,25 регенерации маны и 25 урона от атаки.",
    "Для героев ловкости, даёт 700 здоровья, 2,5 регенерации здоровья, 4,17 брони, 25 скорости атаки, 500 маны, 1,25 регенерации маны и 25 урона от атаки.",
    "Для героев интеллекта, даёт 700 здоровья, 2,5 регенерации здоровья, 4,17 брони, 25 скорости атаки, 500 маны, 1,25 регенерации маны и 25 урона от атаки."
  ],
  "cost": "5300",
  "lore": null,
  "consistFrom": [
    "Ultimate Orb",
    "Ultimate Orb",
    "Point Booster"
  ],
  "boughtFrom": "Артефакты",
  "name": "Eye of Skadi",
  "description": "Невероятно редкий артефакт, охраняемый лазурными драконами.",
  "trivia": [
    "Название Skaði (Skadi) - взято из скандинавской мифологии.[1] Это представительница Инеистых великанш, покровительница охоты. Первоначально она, вероятно, была богиней плодородия в её зимней ипостаси. Скади у скандинавов представляет зиму и лёд."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+25 к силе",
    "+25 к ловкости",
    "+25 к интеллекту",
    "+200 к здоровью",
    "+200 к мане"
  ],
  "tips": null
}