{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Nullifier_cast.mp3\/revision\/latest?cb=20171112025714",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1000.",
        "Применяет базовое развеивание с интервалом в 0,2 секунды сразу после применения, срабатывая 25 раз.",
        "Nullifier сначала применяет развеивание, затем дебафф.",
        "Замедление немедленно применяется на цель после попадания снаряда. Если цель уже находится под дебаффом Nullify, то его обновление не активирует замедление.",
        "Если цель уже находится под дебаффом Nullify, то его обновление не активирует замедление.",
        "После применения замедление активируется с каждой успешной атакой по цели. То есть промахнувшиеся атаки эффект не активируют. Замедление не срабатывает, если цель получила призрачную форму до попадания снаряда атаки.",
        "Замедление не срабатывает, если цель получила призрачную форму до попадания снаряда атаки.",
        "У срабатывания замедления нет перезарядки, поэтому цель может быть замедлена всю длительность, если её атакуют как минимум раз в 0,5 секунды.",
        "Можно применить на неуязвимых существ, применяя к ним развеивание и дебафф, если неуязвимость можно развеять. При этом, если неуязвимость неразвеиваемая, то дебафф не применяется, но обновляется, если был применен ранее.",
        "При этом, если неуязвимость неразвеиваемая, то дебафф не применяется, но обновляется, если был применен ранее."
      ],
      "mana": "75",
      "abilityName": "Nullify",
      "cooldown": null,
      "description": "Развеивает положительные эффекты с цели в момент применения и следующие 5 сек. Любая атака замедлит цель на 80%. Длительность замедления: 0,5 сек.",
      "params": [
        "Дальность применения: 900",
        "Замедление скорости передвижения: 80%",
        "Длительность замедления: 0,5",
        "Длительность: 5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4725",
  "lore": null,
  "consistFrom": [
    "Sacred Relic",
    "Helm of Iron Will"
  ],
  "boughtFrom": "Магия",
  "name": "Nullifier",
  "description": "Опасное оружие, выкраденное из обратного измерения.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+6 к регенерации здоровья",
    "+8 к броне",
    "+80 к урону"
  ],
  "tips": []
}