{
  "abilities": [
    {
      "notes": [
        "Снаряд Poison Touch летит со скоростью 1300",
        "Может задеть существ на расстоянии до 1000 (складывается из начального радиуса, расстояния и конечного радиуса). Конечная область по форме напоминает конус, исходящий от Dazzle. Область начинается перед Dazzle, а не перед первой жертвой",
        "Цели в области действия выбираются не случайно: способность выбирает ближайшие подходящие цели от первичной в области конуса",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 5\/6\/7\/8 раз",
        "Может нанести до 64\/140\/240\/364 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 280\/408\/560\/736) единиц урона каждой цели, если действие способности не обновлялось (до уменьшения)",
        "Длительность обновляется каждый раз, когда атака Dazzle достигает противника под действием эффекта. Промахи не продлевают длительность. Обновление длительности эффекта также каждый раз будет усиливать замедление на 2%\/2,5%\/3%\/3,5%. Это усиление не имеет лимита",
        "Чтобы узнать, как сильно замедлится противник при разном количестве обновлений Poison Touch с усилением от <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта и без него, смотрите таблицу ниже",
        "Несколько применений Poison Touch полностью складываются",
        "С улучшением от  Aghanim's Shard враги проклинаются при попадании в них снаряда, их базовая скорость передвижения устанавливается на уровне 100, получают безмолвие, заглушение, бессилие. Проклятие накладывается только один раз при попадании снаряда. Оно не накладывается повторно при обновлении эффекта атакой. Основной дебафф и проклятие накладываются в одно и то же время, поэтому после проклятия цель остаётся замедленной еще на 2\/3\/4\/5 сек. Poison Touch сначала накладывает основной дебафф, затем проклятие"
      ],
      "item_behaviour": [],
      "description": "Выпускает конус яда, поражающий нескольких врагов. Наносит жертвам периодический урон и замедляет их, а атаки владельца способности обновляют время действия эффекта и усиливают замедление.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,57",
        "Дальность применения: 500\/600\/700\/800",
        "Начальный радиус: 200",
        "Максимальное расстояние: 500",
        "Конечный радиус: 300",
        "Количество целей: 2\/4\/6\/8",
        "Урон в секунду: 16\/28\/40\/52 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 56\/68\/80\/92)",
        "Замедление скорости передвижения: 16%\/18%\/20%\/22% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 56%\/58%\/60%\/62%)",
        "Увеличение замедления за атаку: 2%\/2,5%\/3%\/3,5%",
        "Длительность: 4\/5\/6\/7",
        "Скорость зверушки:  100",
        "Длительность превращения:  2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/47\/Dazzle_Poison_Touch_1.mp3\/revision\/latest?cb=20191216012353",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": "27\/23\/19\/15",
      "aghanim": null,
      "name": "Poison Touch",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "T",
      "story": "Этот весьма полезный паралитический яд — один из немногих обрядов культа Дезун, направленных во вред врагу."
    },
    {
      "notes": [
        "Предотвращает смерть цели путем приравнивания её минимального здоровья к 1. То есть цель не может умереть от урона (даже отмеченного как отнимающий здоровье), поэтому способность предотвращает смерть от отложенного  False Promise урона. Не защищает от смертельного урона  Culling Blade или завершения действия задержки от  Reincarnation. Не дает  Ice Blast расколоть цель, если способность применена до преодоления порога здоровья",
        "Технически получаемый урон не уменьшается, поэтому любой источник урона учитывается полностью",
        "Можно применить на иллюзии и крипов-героев. ↓↓ Двойное нажатие автоматически применит заклинание на владельца способности",
        "Усиливает только лечение. Не усиливает восстановление здоровья"
      ],
      "item_behaviour": [],
      "description": "Накладывает на союзника священную защиту, не позволяющую ему умереть. Также увеличивает его лечение в зависимости от отсутствующего у него здоровья.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 700\/800\/900\/1000",
        "Усиление лечения за каждые 10% недостающего здоровья: 2%\/4%\/6%\/8%",
        "Длительность: 4\/4,5\/5\/5,5",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Лечение:  200"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9d\/Dazzle_Shallow_Grave.mp3\/revision\/latest?cb=20191216012356",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзных героев"
      ],
      "mana": "36\/30\/24\/18",
      "aghanim": null,
      "name": "Shallow Grave",
      "cooldown": "120\/130\/140\/150",
      "legacy_key": "G",
      "story": "Только могущественный послушник культа Теней способен обмануть саму смерть."
    },
    {
      "notes": [
        "У Shadow Wave нет задержки для отскоков, поэтому все цели вылечатся одновременно",
        "Порядок приоритета: раненые союзные герои ➤ раненые союзные существа не-герои (включая иллюзии) ➤ союзные герои ➤ существа не-герои. Чем ниже здоровье ближайших союзников, тем выше приоритет их лечения. То есть самое раненное существо получит лечение первым. Если у нескольких существ одинаковые критерии выбора (например, поблизости только существа не-герои с полным здоровьем), то цели будут выбраны случайно",
        "Независимо от цели, сам Dazzle всегда получает лечении без расчета количества целей отскока, исцеляя 4\/5\/6\/7 существ. ↓↓ Двойное нажатие автоматически применит заклинание на владельца способности",
        "Может вылечить и нанести урон на 320\/500\/720\/980 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1720\/2250\/2820\/3430) единиц здоровья за все отскоки. Радиус урона считает за центр каждое излеченное существо. Вражеское существо может получить урон от всех излеченных существ за раз"
      ],
      "item_behaviour": [],
      "description": "Выпускает мощный заряд, который передаётся от союзника к союзнику, излечивая их и нанося урон противникам неподалёку. Способность всегда лечит своего владельца.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,57",
        "Дальность применения: 800",
        "Радиус урона: 185",
        "Радиус отскока: 475",
        "Количество отскоков: 3\/4\/5\/6",
        "Лечение\/Урон: 80\/100\/120\/140 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 430\/450\/470\/490)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Dazzle_Shadow_Wave.mp3\/revision\/latest?cb=20191216012355",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Врагов",
        "Урон: Физический"
      ],
      "mana": "12\/11\/10\/9",
      "aghanim": null,
      "name": "Shadow Wave",
      "cooldown": "90",
      "legacy_key": "D",
      "story": "Одно из самых простых заклинаний, известных жрецу теней. Оно же — одно из самых эффективных."
    },
    {
      "notes": [
        "Не провоцируется от применения активных способностей предметов, способностей без перезарядок и заклинаний, которые не провоцируют срабатывание от применения",
        "Уменьшает перезарядку всех способностей героя (но не предметов), включая ультимейты и пассивные способности",
        "При улучшении с  Aghanim's Scepter Good Juju становится способностью, направленной на существо. Пассивный компонент при этом сохраняется. ↓↓ Двойное нажатие автоматически применит заклинание на владельца способности. Обнулят перезарядку всех предметов существа в его инвентаре и рюкзаке. Перезарядка предметов в тайнике, инвентарях других существ и выброшенных предметов не обнуляется. Обнуляет только предметы, владельцем которых является выбранное существо. Перезарядки предметов других героев не обнуляются. Визуально обнуляет перезарядку  Tranquil Boots, но на самом деле не пропускает время его отключения. Не обнуляет перезарядку следующих предметов:  Refresher Orb,  Refresher Shard и  Ex Machina. Также не разделяет перезарядку с вышеуказанными предметами. Пассивное уменьшение перезарядки для предметов сочетается мультипликативно с другими основанными на процентах источниками снижения перезарядки"
      ],
      "item_behaviour": [],
      "description": "Когда герой применяет одну способность, оставшиеся перезарядки всех остальных уменьшаются.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0,2+0,76",
        "Снижение перезарядки: 1\/1,5\/2",
        "Дальность применения:  250",
        "Снижение перезарядки для предметов:  50%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Dazzle_Good_Juju.mp3\/revision\/latest?cb=20220412211207",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя "
      ],
      "mana": "180",
      "aghanim": null,
      "name": "Good Juju",
      "cooldown": "250",
      "legacy_key": "E",
      "story": "С каждым зовом мир Нотл всё сильнее проникает в нашу реальность."
    },
    {
      "notes": [
        "Пассивный компонент Bad Juju работает только со способностями Dazzle. Не взаимодействует с предметами или другими способностями. Bad Juju всегда накладывает свой эффект до того, как способность воздействует на цель:  Poison Touch: даёт эффект врагу при попадании снаряда.  Shallow Grave: даёт эффект союзнику-цели.  Shadow Wave: даёт один эффект каждому вылеченному союзнику и по эффекту всем противникам за каждую волну, которая нанесла им урон.   Good Juju: не даёт эффект цели",
        "При применении Bad Juju сначала даёт один эффект всем существам в радиусе действия, затем наносит урон\/лечит, основываюсь на числе эффектов. Действует на невидимых существ и существ в тумане войны. Не действует на неуязвимых или спрятанных",
        "Урон от способности может быть снижен блокировкой урона",
        "Все эффекты имеют независимую друг от друга длительность. Добавление новых эффектов не обновит длительность старых. Текущее число эффектов отображается на иконке эффекта, снижение\/увеличение брони указано в описании",
        "Не действует на  Рошана"
      ],
      "item_behaviour": [],
      "description": "Способности героя временно увеличивают\/уменьшают броню союзников\/врагов, на которых они подействовали. Эту способность можно активировать, чтобы за каждый эффект излечить союзников неподалёку или нанести урон врагам вокруг.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0,76",
        "Изменение брони за эффект: 1\/2\/3 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1,5\/2,5\/3,5)",
        "Длительность: 8\/10\/12",
        "Радиус поражения: 1200",
        "Лечение\/урон за эффект: 40\/50\/60"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Dazzle_Bad_Juju_1.mp3\/revision\/latest?cb=20191216012358",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Союзников \/ Врагов",
        "Урон: Физический"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Bad Juju",
      "cooldown": "50\/75\/100",
      "legacy_key": "W",
      "story": "С каждым зовом мир Нотл всё сильнее проникает в нашу реальность."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 1.7,
    "attrAgility": 20.0
  },
  "description": "Могучий лекарь, способный ненадолго отложить смерть. Рождённый поддерживать своих сторонников, Dazzle не даёт соратникам умереть, пока те уничтожают врагов. Его необычные заклинания вплетаются в броню, ослабляя противников и усиливая союзников.  Поддержка Быстрый урон Контроль ★☆☆",
  "history": "Прежде чем назваться жрецом теней, каждый юный послушник ордена Дезун должен пройти несколько ритуалов. Последний из них, ритуал теней, представляет собой опасное путешествие в мир Нотл, непредсказуемую реальность, откуда возвращается далеко не каждый. Часть тех, что возвращались, теряли рассудок. У других проявлялись странные способности. Но так или иначе, всякий, кто попадал в мир Нотл, бесповоротно изменялся. Одного послушника — самого юного среди тех, кто когда-либо стремился пройти ритуал, — орден поначалу отвергал, называя слишком молодым. Но юнца было не отговорить. Всё же увидев что-то особенное в упрямом послушнике, старейшины уступили ему. Он выпил священное зелье и сел у ночного огня, пока племя исполняло ритуальный танец. В отражении мира Нотл, куда попал юнец, признаки света и тени поменялись местами. Поэтому на самом деле приятно мерцающий целительный свет — воплощение зла, и в его завораживающих отблесках происходят самые кошмарные события. Провидение старейшин оказалась пророческим: послушник вернулся жрецом теней невиданной силы, способный как исцелять, так и убивать. И теперь его дар сокрушает врагов и спасает союзников."
}