{
  "abilities": [
    {
      "notes": [
        "Скачки происходят с интервалом в 0,25 сек.; требуется 1\/1,5\/2\/3,5 сек\n для поражения всех целей",
        "Не перескакивает на невидимых существ или существ в тумане войны",
        "За одно применение никогда не поражает существо дважды",
        "Все отскоки наносят до 450\/840\/1350\/2700 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 950\/1540\/2250\/4200) единиц урона (до уменьшений)",
        "Скрытый бафф необходим для скачков молнии"
      ],
      "item_behaviour": [],
      "description": "Выпускает молнию, которая перескакивает с одного врага на другого.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,63",
        "Дальность применения: 850",
        "Дальность скачка: 500",
        "Число скачков: 5\/7\/9\/15",
        "Интервал скачка: 0,25",
        "Урон: 90\/120\/150\/180 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 190\/220\/250\/280)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1f\/Zeus_Arc_Lightning_1.mp3\/revision\/latest?cb=20191216030834",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "1,6",
      "aghanim": null,
      "name": "Arc Lightning",
      "cooldown": "80\/85\/90\/95",
      "legacy_key": "C",
      "story": "Любимый приём бога грома против жалких смертных."
    },
    {
      "notes": [
        "Молния сначала наносит урон, затем применяет дебафф",
        "При выборе существа летающий обзор и раскрытие невидимости в радиусе 750 появляются в месте нахождения цели\n Обзор зафиксирован и не перемещается вместе с существом",
        "При выборе точки на земле Lightning Bolt ищет любое вражеское существо в области действия; приоритет отдается героям (включая иллюзии, клонов и крипов-героев)\n Выбирает ближайшую к центру цель\n Для попадания по невидимым или находящимся в тумане войны врагам не требуется обзор или раскрытие невидимости\n С учетом дальности применения и радиусом поиска поражает врага на расстоянии до 1025\/1075\/1125\/1175\n При подобном применении обзор закреплятся за выбранной точкой, а не за обнаруженным существом",
        "Летающий обзор и раскрытие невидимости длятся 5 сек\n Раскрытие невидимости предоставляется аурой, а его дебафф задерживается на 0,5 сек",
        "При применении появляются частицы молний и воспроизводятся звуковые эффекты, которые видны и слышны для всех\n <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Талант 25-го уровня превращает Lightning Bolt в способность, направленную на область, поэтому ей больше нельзя напрямую выбрать существ\n Теперь Lightning Bolt поражает всех существ в радиусе 325\n Не улучшает молнии от <span image=\"images\/nimbus.webp\">[picture:nimbus]<\/span> Nimbus"
      ],
      "item_behaviour": [],
      "description": "Ударом молнии наносит врагу урон и ненадолго его оглушает. В радиусе 750 вокруг цели на время раскрываются туман войны и невидимость. Способность можно применить на землю — тогда она подействует на ближайшего вражеского героя в радиусе 325.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Дальность применения: 700\/750\/800\/850",
        "Радиус поиска цели: 325",
        "Радиус обзора и раскрытия невидимости: 750",
        "Урон: 125\/200\/275\/350",
        "Длительность оглушения: 0,3 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 0,7)",
        "Длительность обзора и раскрытия невидимости: 5",
        "Длительность задержки ауры раскрытия невидимости: 0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/91\/Zeus_Lightning_Bolt.mp3\/revision\/latest?cb=20191216030837",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "6",
      "aghanim": null,
      "name": "Lightning Bolt",
      "cooldown": "120\/125\/130\/135",
      "legacy_key": "G",
      "story": "Ошеломляющее наказание для мятежных язычников."
    },
    {
      "notes": [
        "При применении прерывает произносимые заклинания Zeus",
        "При применении в статичном состоянии Zeus только прыгает вверх на высоту в 250 за 0,5 сек\n При применении в движении герой прыгает по дуге с высотой в 250 на расстоянии в 500 за 0,5 сек\n Скорость передвижения Zeus не влияет на дальность прыжка, она всегда остаётся неизменной\n Прыжок совершается вперёд также при той ситуации, когда Zeus подвержен другим источникам принудительного передвижения\n Прыгает всегда в сторону движения Zeus, поэтому при передвижении назад и вбок, прыжок осуществляется назад и вбок",
        "Во время прыжка Zeus может атаковать, использовать предметы и применять способности\n Однако он не может поворачиваться, поэтому применение предметов и способностей возможно только в том случае, если герой прыгает в сторону применения\n Применение Heavenly Jump во время прыжка не даст никакого эффекта, а способность потратит ману и уйдёт на перезарядку",
        "При применении дает летающий обзор в радиусе 900 на 3 сек\n в месте применения заклинания\n Обзор статичен и не следует за Zeus",
        "Спустя 0,13 сек\n после применения Heavenly Jump применяет дебаффы замедления скорости передвижения и атаки к (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2) ближайшему врагу в радиусе 700\/800\/900\/1000\n Может выбрать любое вражеское существо, в приоритете герои, включая иллюзии, клоны, крипы-герои\n Не может выбрать неуязвимых, невидимых и спрятанных существ\n Увеличивающий скорость передвижения <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Талант увеличивает общую скорость передвижения Zeus до 345 после применения\n Повторное наложение дебаффа и баффа не сочетается, но обновляет длительность",
        "Heavenly Jump сначала применяет дебафф, затем наносит урон, затем даёт бонус к скорости передвижения"
      ],
      "item_behaviour": [],
      "description": "Герой совершает божественный прыжок, во время которого он ударит током ближайшего видимого врага (в первую очередь героев), нанеся ему урон и замедлив его передвижение, атаку и применение заклинаний. Если герой передвигался, он прыгнет вперёд. Способность на 3 секунды даёт беспрепятственный обзор в радиусе 900 вокруг владельца.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус поиска: 700\/800\/900\/1000",
        "Дальность прыжка: 500",
        "Число целей: 1 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2)",
        "Урон: 20\/50\/75\/100",
        "Замедление скорости передвижения: 80%",
        "Замедление скорости атаки: 100",
        "Замедление применения заклинаний: 50%",
        "Длительность баффа\/дебаффа: 1,6",
        "Длительность прыжка: 0,5",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Бонус к скорости передвижения:  30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/83\/Zeus_Heavenly_Jump_1.mp3\/revision\/latest?cb=20220618223447",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "26\/22\/18\/14 (TagTalent 22\/18\/14\/10)",
      "aghanim": null,
      "name": "Heavenly Jump",
      "cooldown": "50\/60\/70\/80",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "Для разблокировки требуется <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter",
        "Применяет <span image=\"images\/lightning_bolt.webp\">[picture:lightning_bolt]<\/span> Lightning Bolt текущего уровня на ближайшую подходящую вражескую цель\n То есть способность также применяет мини-оглушение и дает обзор и эффект раскрытия невидимости вокруг цели\n Также Nimbus не будет ничего применять, если Lightning Bolt не изучена\n <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Талант на применение Lightning Bolt по области не распространяется на Nimbus",
        "Источником урона считается само облако, поэтому эффекты, реагирующие на урон, будут срабатывать на Nimbus, а не на Zeus (например, <span image=\"items\/blade_mail\/full.webp\">[picture:blade_mail]<\/span> Blade Mail)\n Также на урон Nimbus не влияют никакие внешние усиления или уменьшения урона\n Несмотря на это, молнии применяют Static Field к целями; этот урон исходит от Zeus и к нему применяется манипуляция наносимого урона",
        "После применения срабатывает сразу, если противник находится в радиусе действия\n Также бьёт мгновенно, если последний удар был длиннее интервала, т.е если противник зайдёт в радиус, то получит урон\n Всегда атакует ближайшую подходящую цель без каких-либо приоритетов\n Не выбирает варды и постройки\n Может поражать невидимых существ и существ в тумане войны\n Наносит до 12 ударов в течении всего времени действия, учитывая базовый интервал в 2,5 сек.\n На интервал не действуют источники уменьшения и сброса перезарядки",
        "Визуальные эффекты на земле, отмечающие область действия, видны всем"
      ],
      "item_behaviour": [],
      "description": "Создает в любом месте карты грозовое облако, которое автоматически применяет способность Lightning Bolt на врагов неподалеку.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,64",
        "Дальность применения: Глобальная",
        "Радиус облака: 450",
        "Атак героев ближнего боя для разрушения: 4",
        "Атак героев дальнего боя для разрушения: 8",
        "Атак не-героев для разрушения: 16",
        "Интервал Lightning Bolt: 2,5",
        "Длительность: 30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Zeus_Nimbus_1.mp3\/revision\/latest?cb=20191216030841",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "45",
      "aghanim": null,
      "name": "Nimbus",
      "cooldown": "325",
      "legacy_key": "T",
      "story": "Где гневается бог грома, вскоре собираются тучи."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard для разблокировки",
        "Static Field взаимодействует только со способностями Zeus\n Эффект не реагирует ни на предметы, ни на способности других\n Всегда наносит свой урон до применения эффекта активировавшей способности\n <span image=\"images\/arc_lightning.webp\">[picture:arc_lightning]<\/span> Arc Lightning наносит урон Static Field каждому задетому врагу до собственного\n Использование <span image=\"images\/lightning_bolt.webp\">[picture:lightning_bolt]<\/span> Lightning Bolt (и молния от <span image=\"images\/nimbus.webp\">[picture:nimbus]<\/span> Nimbus) наносит урон Static Field задетому независимо от того, напрямую было выбрано существо или нет\n <span image=\"images\/thundergod's_wrath.webp\">[picture:thundergod's_wrath]<\/span> Thundergod's Wrath наносит урон Static Field всем пораженным врагам (до применения собственных эффектов)\n Если враг находился в невидимости, то урона он не получит",
        "Не действует на <span image=\"images\/roshan.png\">[picture:roshan]<\/span> Рошана и не наносит урон, если способность заблокирована источниками блокировки урона"
      ],
      "item_behaviour": [],
      "description": "Все враги, задетые атаками или способностями героя, получат дополнительный урон, пропорциональный их текущему здоровью.",
      "hot_key": "D",
      "params": [
        "Урон от текущего здоровья: 8%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/70\/Zeus_Static_Field_1.mp3\/revision\/latest?cb=20210103161946",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Static Field",
      "cooldown": null,
      "legacy_key": "F",
      "story": "Когда владыка грома ступает по земле, даже воздух вокруг него искрится от напряжения."
    },
    {
      "notes": [
        "Поражает только вражеских героев, включая <span image=\"images\/arc_warden_tempest_double_minimap.png\">[picture:arc_warden_tempest_double_minimap]<\/span> Tempest Double, но исключая <span image=\"images\/divided_we_stand.webp\">[picture:divided_we_stand]<\/span> клонов Meepo, иллюзии и крипов-героев\n Не поражает неуязвимых и спрятанных врагов",
        "Thundergod's Wrath сначала наносит урон всем вражеским героям (если это возможно), а затем дает вокруг них обзор\n То есть способность не наносит урон невидимым героям, если они не были обнаружены другим источником раскрытия невидимости",
        "Дает летающий обзор в радиусе 500 и раскрытие невидимости в радиусе 900 единиц вокруг каждого пораженного героя\n Летающий обзор и раскрытие невидимости длятся 3 сек\n Раскрытие невидимости является аурой, а её дебафф задерживается на 0,5 сек",
        "При поражении 5 героев Thundergod's Wrath Zeus наносит суммарно 1500\/2125\/2750 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2000\/2625\/3250) урона (до уменьшений)",
        "Во время анимации применения проигрываются звуковые и визуальные эффекты, которые слышны и видны каждому\n Звук способности глобален\n Враги его услышат, если у них есть обзор на Zeus; иначе прозвучит другой звуковой эффект\n Переключает освещение всей карты на долю секунды в качестве еще одного индикатора применения"
      ],
      "item_behaviour": [],
      "description": "Поражает всех вражеских героев молнией вне зависимости от их местоположения. Способность также раскрывает невидимость вражеских существ вокруг каждого ударенного противника. Если герой врага невидим, то он не получит урона, но невидимость всё равно раскроется.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,4+0,43",
        "Радиус действия: Глобальный",
        "Радиус обзора: 500",
        "Радиус раскрытия невидимости: 900",
        "Урон: 300\/425\/550 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 400\/525\/650)",
        "Длительность обзора и раскрытия невидимости: 3",
        "Длительность задержки ауры раскрытия невидимости: 0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Zeus_Thundergod%27s_Wrath_1.mp3\/revision\/latest?cb=20191216030845",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "mana": "130\/125\/120",
      "aghanim": null,
      "name": "Thundergod's Wrath",
      "cooldown": "300\/400\/500",
      "legacy_key": "W",
      "story": "Повелитель небес сокрушает всех, кто противостоит ему, независимо от того, близко или далеко они находятся."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 19.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.2,
    "attrAgility": 11.0
  },
  "description": "Бьёт молниями врагов как вблизи, так и вдали Никому не спастись от ярости Zeus. Он использует молнию, чтобы разведывать ближайшие территории, пускает заряд электричества, скачущий по нескольким врагам, или призывает вселяющий ужас шквал молний на всех противников сразу. Zeus найдет врагов, где бы те ни были.  Быстрый урон ★☆☆",
  "history": "Повелитель небес и отец богов видит во всех героях своих буйных, мятежных детей. Неисчислимы свидания со смертными женщинами, где заставала его супруга. Поставила богиня бессмертного перед выбором: «Если нравятся смертные, иди и сам стань среди них. Докажи свою верность, и приму тебя своим мужем бессмертным. Если же нет — иди и умри средь созданий своих». Согласился с ней бог: неоспоримы были её слова (да и магия тоже). С тех пор он вёл себя примерно, проявляя к бессмертию чуть больше любви, чем к смертным. Но чтобы умолить вечную свою супругу, он должен стремиться к победам на поле боя."
}