{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Primal_Beast_Onslaught_1.mp3\/revision\/latest?cb=20220412221020",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "notes": [
        "Бежит вперёд со скоростью в 1200 единиц.",
        "Максимальное расстояние бега не может быть увеличено бонусами к дальности применения.",
        "Для лучшей читаемости, скорости поворота даны в градусах за секунду, вместо радианов за 0,03 секунды. Во время разгона, 70° градусов за секунду равняется 1,22 радиана, что даёт скорость поворота в 0,037. Во время бега, 50° градусов за секунду равняется 0,87 радиана, что даёт скорость поворота в 0,026.",
        "Во время разгона, 70° градусов за секунду равняется 1,22 радиана, что даёт скорость поворота в 0,037.",
        "Во время бега, 50° градусов за секунду равняется 0,87 радиана, что даёт скорость поворота в 0,026.",
        "Во время разгона и бега, направление может быть изменено командой движения (TagTalent Нажатие ПКМ или M). Primal Beast обессилен во время Onslaught. Во время бессилия команды атаки действуют как команды движения, что также меняет направление.",
        "Primal Beast обессилен во время Onslaught. Во время бессилия команды атаки действуют как команды движения, что также меняет направление.",
        "Во время разгона, для Primal Beast спереди появляется индикатор линии шириной в 190 единиц, показывающий путь, который пробежит Primal Beast. Длина линии увеличивается с продолжительностью разгона Onslaught, показывая дальность бега, основывающуюся на времени разгона. Индикатор виден только игроку. Ни союзники ни враги не могут его видеть.",
        "Длина линии увеличивается с продолжительностью разгона Onslaught, показывая дальность бега, основывающуюся на времени разгона.",
        "Индикатор виден только игроку. Ни союзники ни враги не могут его видеть.",
        "Если во время разгона отдать Primal Beast любую команду, которая отменяет произносимые способности, то разгон завершится и начнётся бег. Это значит, что ненаправленные способности, которые не перерывают произнесение (например, Shadow Walk) не завершат разгон. Если разгон завершился направленной командой, эта команда может быть выполнена во время бега, если цель будет в досягаемости, учитывая что при беге не было отдано других команд.",
        "Это значит, что ненаправленные способности, которые не перерывают произнесение (например, Shadow Walk) не завершат разгон.",
        "Если разгон завершился направленной командой, эта команда может быть выполнена во время бега, если цель будет в досягаемости, учитывая что при беге не было отдано других команд.",
        "Если во время бега отдать Primal Beast любую направленную команду, то бег отменится.",
        "Если во время разгона Primal Beast получит оглушение, проклятие, сон, страх, провокацию или принудительное движение, то Onslaught полностью отменится. Безмолвие не отменит способность, но не даст использовать Begin Onslaught, для преждевременного начала бега. Тем не менее, бег всё ещё может начаться преждевременно ранее упомянутыми командами.",
        "Безмолвие не отменит способность, но не даст использовать Begin Onslaught, для преждевременного начала бега.",
        "Тем не менее, бег всё ещё может начаться преждевременно ранее упомянутыми командами.",
        "Если во время бега Primal Beast получит сон, страх или принудительное движение, то Onslaught отменится. Оглушение и провокация не отменят бег, но не дадут Primal Beast менять направление. Проклятие также не отменит бег. Произнесение Town Portal Scroll также мгновенно отменит бег.",
        "Оглушение и провокация не отменят бег, но не дадут Primal Beast менять направление. Проклятие также не отменит бег.",
        "Произнесение Town Portal Scroll также мгновенно отменит бег.",
        "Каждый враг (кроме Рошана) на расстоянии в 190 единиц от бегущего Primal Beast получает урон, отталкивается назад и оглушается. Союзники просто отталкиваются назад. Не прерывает произносимые способности союзников. Существа отталкиваются на расстояние в 200 единиц от Primal Beast за 0,2 сек. Может толкать существ через непроходимый ландшафт.",
        "Союзники просто отталкиваются назад. Не прерывает произносимые способности союзников.",
        "Существа отталкиваются на расстояние в 200 единиц от Primal Beast за 0,2 сек. Может толкать существ через непроходимый ландшафт.",
        "Onslaught сперва применяет урон, затем отталкивает, а затем оглушает.",
        "Может пробегать сквозь непроходимый ландшафт.",
        "Уничтожает деревья вокруг Primal Beast во время бега и вокруг существ во время отталкивания."
      ],
      "mana": "25\/22\/19\/16",
      "item_behaviour": [],
      "name": "Onslaught",
      "cooldown": "120",
      "description": "Герой разгоняется и бежит в выбранном направлении, отталкивая как врагов, так и союзников. При столкновении с противниками наносит им урон и оглушает их. Чем дольше подготавливался разгон, тем дальше пробежит герой. Можно остановить в любой момент командой отмены.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,15+0",
        "Дальность применения: Глобальная",
        "Макс. дальность разгона: 2000",
        "Радиус эффекта: 190",
        "Макс. время разгона: 2",
        "Скорость поворота в градусах за секунду во время разгона: 70°",
        "Скорость поворота в градусах за секунду во время бега: 50°",
        "Урон: 110\/200\/290\/380 ( 200\/290\/380\/470)",
        "Дальность отталкивания: 200",
        "Длительность отталкивания: 0,2",
        "Длительность оглушения: 1\/1,2\/1,4\/1,6",
        "Макс. длительность бега: 1,5"
      ],
      "legacy_key": "G",
      "story": "Завидев жертву, зверь отбрасывает в сторону всё — и всех — на своём пути, оставляя позади лишь погибель."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "notes": [
        "Заменяет Onslaught пока не будет использована подспособность или не закончится разгон.",
        "Можно использовать в оглушении, урагане, сне, провокации, изгнании или во время принудительного движения.",
        "Нельзя использовать в безмолвии, проклятии или невозможности выполнять команды. Primal Beast не может поставить эту способность в ⇧ Shift-очередь.",
        "Primal Beast не может поставить эту способность в ⇧ Shift-очередь.",
        "Уходит на перезарядку в 0,3 секунды сразу после применения Onslaught. Это сделано чтобы предотвратить случайное двойное применение, которое слишком рано завершало бы разгон."
      ],
      "mana": "0,3",
      "item_behaviour": [],
      "name": "Begin Onslaught",
      "cooldown": "0",
      "description": "Герой прекращает набирать силы и бежит в выбранном направлении.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0"
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Primal_Beast_Trample.mp3\/revision\/latest?cb=20220412221042",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Trample не прерывает произносимые способности Primal Beast при применении.",
        "Primal Beast обессилен на время длительности.",
        "Мгновенно топает единожды при применении, без необходимости в движении. Это случается только при получении баффа, обновление баффа не спровоцирует ещё один мгновенный топот.",
        "Это случается только при получении баффа, обновление баффа не спровоцирует ещё один мгновенный топот.",
        "Trample испускает одну пульсацию только когда Primal Beast в целом преодолеет расстояние в 140 единиц. Движение включает горизонтальное принудительное движение, а также эффекты телепортации (включая способности блинка). Эффекты телепортации могут добавить лишь 140 единиц расстояния к счётчику дистанции, не важно какой на самом деле была дистанция телепортации. Это значит, что телепортация на расстояние в 280 всё ещё спровоцирует лишь один топот, а не несколько, основанных на всей дистанции. Когда Primal Beast двигается на дистанцию свыше 500 единиц в течении 0,1 сек., он не издаёт топот. Это значит, что топот не происходит при телепортации на дистанцию свыше 500.",
        "Движение включает горизонтальное принудительное движение, а также эффекты телепортации (включая способности блинка).",
        "Эффекты телепортации могут добавить лишь 140 единиц расстояния к счётчику дистанции, не важно какой на самом деле была дистанция телепортации.",
        "Это значит, что телепортация на расстояние в 280 всё ещё спровоцирует лишь один топот, а не несколько, основанных на всей дистанции.",
        "Когда Primal Beast двигается на дистанцию свыше 500 единиц в течении 0,1 сек., он не издаёт топот.",
        "Это значит, что топот не происходит при телепортации на дистанцию свыше 500.",
        "Учитывая стандартную скорость передвижения в 305 единиц, Trample может издавать топот 2,18 раз в секунду. Для количества топотов в секунду, которые сможет сделать Primal Beast при разных значениях скорости передвижения, смотрите таблицу ниже.",
        "Для количества топотов в секунду, которые сможет сделать Primal Beast при разных значениях скорости передвижения, смотрите таблицу ниже.",
        "Trample наносит обычный урон от заклинаний в области, основывающийся на среднем уроне от атаки Primal Beast, плюс бонусы к урону от атаки. Это значит, что она не применяет модификаторы атаки, и работает с усилением урона от заклинаний и вампиризмом заклинаний.",
        "Это значит, что она не применяет модификаторы атаки, и работает с усилением урона от заклинаний и вампиризмом заклинаний.",
        "Уничтожает деревья вокруг Primal Beast, пока активна."
      ],
      "mana": "30\/27\/24\/21",
      "item_behaviour": [],
      "name": "Trample",
      "cooldown": "90\/85\/80\/75",
      "description": "Герой тяжёлой поступью проходит через всё и вся. За каждые 140 пройденных единиц враги в области вокруг героя получают базовый урон, а также умноженный урон героя от атак. Во время действия этой способности её владелец не может атаковать.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 230",
        "Необходимое расстояние для топота: 140",
        "Ограничение расстояния: 500",
        "Базовый урон: 12\/28\/44\/60",
        "Урона от атаки в урон: 35% ( 60%)",
        "Длительность: 5,5"
      ],
      "legacy_key": "T",
      "story": "Первобытный зверь — единственный представитель своего вида в этой вселенной, поэтому её обитатели могут лишь догадываться о размерах его сородичей. Определить это было бы проще, если бы объект наблюдений не съедал всё что видит и не разрушал почти всё остальное."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e8\/Primal_Beast_Uproar_1.mp3\/revision\/latest?cb=20220412221045",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов"
      ],
      "notes": [
        "Пассивно даёт прямой бонусный урон от атаки.",
        "Uproar пассивно получает стак, когда Primal Beast в целом получает 50 урона (после всех уменьшений). Учитывает значения урона от всех 3 типов урона между 20 – 2000, которые наносятся по Primal Beast от подконтрольных игроку существ и Рошана. Счётчик урона не учитывает урон с отметкой «отнимающий здоровье» (например, Dispersion). Счётчик урона и все стаки обнулятся, если за последние 20 секунд не было получено урона. Любой чрезмерный урон полностью игнорируется, это значит, что если враг нанесёт 100 урона, то герой получит лишь один стак. Получение нового стака обновляет длительность уже существующих стаков. Не получает стаков находясь на перезарядке.",
        "Учитывает значения урона от всех 3 типов урона между 20 – 2000, которые наносятся по Primal Beast от подконтрольных игроку существ и Рошана.",
        "Счётчик урона не учитывает урон с отметкой «отнимающий здоровье» (например, Dispersion).",
        "Счётчик урона и все стаки обнулятся, если за последние 20 секунд не было получено урона.",
        "Любой чрезмерный урон полностью игнорируется, это значит, что если враг нанесёт 100 урона, то герой получит лишь один стак.",
        "Получение нового стака обновляет длительность уже существующих стаков.",
        "Не получает стаков находясь на перезарядке.",
        "Пассивный бафф всегда присутствует, но скрыт, когда нет стаков. Иконка способности изменяется на 0 стаков, 1 – 4 стаках и на 5 стаках. Также, при достижении 5 стаков проигрывается звуковой эффект, который слышен лишь игроку. Число на иконке отображает текущее количество стаков у Primal Beast.",
        "Иконка способности изменяется на 0 стаков, 1 – 4 стаках и на 5 стаках.",
        "Также, при достижении 5 стаков проигрывается звуковой эффект, который слышен лишь игроку.",
        "Число на иконке отображает текущее количество стаков у Primal Beast.",
        "Uproar нельзя применить без стаков. При применении, Uproar прерывает произносимые способности Primal Beast. При применении, уходит на 7-секундную перезарядку. Таймер перезарядки на иконке способности отображается красным. Эта перезарядка не подвержена любым источникам уменьшения и сброса перезарядки, однако, она подвергается способности Time Dilation. Хоть бафф при применении можно развеять, это не влияет на перезарядку.",
        "При применении, Uproar прерывает произносимые способности Primal Beast.",
        "При применении, уходит на 7-секундную перезарядку. Таймер перезарядки на иконке способности отображается красным.",
        "Эта перезарядка не подвержена любым источникам уменьшения и сброса перезарядки, однако, она подвергается способности Time Dilation.",
        "Хоть бафф при применении можно развеять, это не влияет на перезарядку.",
        "Бафф при применении даёт Primal Beast прямой бонусный урон от атаки и бонусную броню. Даёт Primal Beast 50\/100\/150\/200 урона от атаки и 5\/10\/15\/20 (TagTalent 25\/30\/35\/40) брони на максимальном количестве стаков. Замедляет скорость передвижения врагов на 40% на максимальном количестве стаков. Для количества урона от атаки и брони, которые получает Primal Beast, и замедления врагов за стак, смотрите таблицу ниже.",
        "Даёт Primal Beast 50\/100\/150\/200 урона от атаки и 5\/10\/15\/20 (TagTalent 25\/30\/35\/40) брони на максимальном количестве стаков.",
        "Замедляет скорость передвижения врагов на 40% на максимальном количестве стаков.",
        "Для количества урона от атаки и брони, которые получает Primal Beast, и замедления врагов за стак, смотрите таблицу ниже.",
        "Дебафф замедления на врагах имеет число на нём, которое показывает им сколько стаков имел Primal Beast при применении. Бафф на Primal Beast не имеет числа на нём.",
        "Бафф на Primal Beast не имеет числа на нём.",
        "Талант на развеивание от Uproar применяет базовое развеивание на Primal Beast при применении."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Uproar",
      "cooldown": "0",
      "description": "Скверный нрав героя пассивно увеличивает его урон. Помимо этого владельцу способности даётся один её заряд, когда он получает хотя бы 50 урона от вражеских героев. При активации герой издаёт рёв, увеличивая себе броню и урон от атак, а также замедляя окружающих врагов. Каждый из этих эффектов усиливается с количеством зарядов способности. Действует 7 сек.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0,53",
        "Пассивный бонус к урону от атаки: 10\/15\/20\/25",
        "Макс. стаков: 5",
        "Порог урона для получения стака: 50",
        "Радиус рёва: 900",
        "Бонусный урон от атаки от рёва: 10\/20\/30\/40",
        "Бонусная броня за стак от рёва: 1\/2\/3\/4 ( 5\/6\/7\/8)",
        "Замедление скорости передвижения за стак от рёва: 8%",
        "Длительность замедления от рёва: 3",
        "Длительность баффа от рёва: 7",
        "Длительность стаков: 20"
      ],
      "legacy_key": "R",
      "story": "В туманную рощу зверь пришёл уже в обрывках верёвок и цепей, и дальнейших попыток его подчинить он не потерпит."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Primal_Beast_Rock_Throw_1.mp3\/revision\/latest?cb=20220412221031",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Минимальное и максимальное время полёта снаряда равно 0,45 – 1,7 секунды соответственно, и не имеет установленной скорости снаряда. Это значит, что на минимальной дистанции и стандартной максимальной дальности применения, он имеет скорость полёта в 1222,22 – 1058,82 единиц соответственно.",
        "Это значит, что на минимальной дистанции и стандартной максимальной дальности применения, он имеет скорость полёта в 1222,22 – 1058,82 единиц соответственно.",
        "При выборе способности, вокруг Primal Beast появляется красный круг, показывающий минимальную дистанцию.",
        "Rock Throw сперва применяет урон, а потом дебафф."
      ],
      "mana": "25",
      "item_behaviour": [],
      "name": "Rock Throw",
      "cooldown": "85",
      "description": "Герой бросает в указанную точку камень, который оглушает врагов и наносит им урон. У броска есть минимальная дальность.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,5+0,5",
        "Дальность применения: 1800",
        "Минимальная дистанция: 550",
        "Радиус: 225",
        "Урон: 300",
        "Длительность оглушения: 1,75"
      ],
      "legacy_key": "W",
      "story": "ОПЯТЬ ЭТИ КАМНИ!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2c\/Primal_Beast_Pulverize_1.mp3\/revision\/latest?cb=20220412221025",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Перекрестье прицела должно быть центрировано на вражеском существе.",
        "Пока произносится, полностью обезвреживает цель.",
        "Раскрывает цель, показывая её модель через туман войны. Не раскрывает невидимость.",
        "При применении телепортирует цель перед Primal Beast. Не телепортирует Рошана при применении, но телепортирует его по окончании произнесения любым способом.",
        "Не телепортирует Рошана при применении, но телепортирует его по окончании произнесения любым способом.",
        "Ударяет врага в 0,75-секундных интервалах, начиная с 0,75 сек. после применения, нанося до 3 (TagTalent 6) ударов. Может нанести до 450\/630\/810 (TagTalent 900\/1260\/1620) урона по цели и ближайшим врагам.",
        "Может нанести до 450\/630\/810 (TagTalent 900\/1260\/1620) урона по цели и ближайшим врагам.",
        "Pulverize сперва применяет урон, а потом оглушение.",
        "Во время действия Pulverize, цель не может быть подвержена никакому принудительному движению.",
        "Pulverize мгновенно закончится, если цель будет телепортирована или попадёт под действие страха. Она также закончится, если во время её действия на цели закончат своё действие Pounce или Soulbind.",
        "Она также закончится, если во время её действия на цели закончат своё действие Pounce или Soulbind.",
        "При применении на Рошана, Primal Beast не ударяет его о землю, но вместо этого наносит ему удары кулаком. Эта разница в анимации имеет лишь косметический характер, в остальном способность действует как обычно.",
        "Эта разница в анимации имеет лишь косметический характер, в остальном способность действует как обычно.",
        "Использует другой, более громкий звуковой эффект при применении на героев."
      ],
      "mana": "32\/28\/24",
      "item_behaviour": [],
      "name": "Pulverize",
      "cooldown": "100\/115\/130",
      "description": "ПРЕРЫВАЕМАЯ — герой хватает выбранного противника и несколько раз ударяет его об землю, нанося урон всем врагам в области действия и ненадолго оглушая их. Длительность: 2,3.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,25+0",
        "Дальность применения: 200",
        "Радиус удара: 600",
        "Макс. время произнесения: 2,3 ( 4,6)",
        "Интервал между ударами: 0,75",
        "Урон от удара: 150\/210\/270",
        "Длительность оглушения от удара: 0,25"
      ],
      "legacy_key": "V",
      "story": "Никто не уверен наверняка, значат ли что-нибудь эти возгласы, но, чтобы понять намерения зверя, многим вполне достаточно его крепкой хватки и стремления оставить от врага лишь мокрое место."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.3,
    "attrStrength": 26.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 1.0,
    "attrAgility": 15.0
  },
  "description": "Расталкивает всех вокруг и разбивает врагов в кровавое месиво. Primal Beast свирепо расталкивает врагов и союзников, чтобы вклиниться в битву и устроить переполох. Этот зверь являет неминуемую угрозу для любого противника, наказывая своих обидчиков и упиваясь возможностью схватить добычу и вбить её в землю, пока от неё не останется лишь кровавое месиво.  Инициация Стойкость Контроль ★☆☆",
  "history": "Большинство исследователей соглашается: хоть угасание туманной рощи и её превращение из идиллических просторов в смертоносные заросли было медленным процессом, подгоняемым волшебниками, настоящим началом конца стало прибытие Первобытного зверя из другого измерения. С самого рождения Первобытный зверь чужд любым чувствам, кроме боли и голода. Вечность кровавых побоищ превратила его в высшего хищника планеты, полной жестоких чудищ. Те, кто не смогли обуздать Первобытного зверя, в отчаяньи изгнали его в новый мир — мир, в котором ничто не могло помешать ему преобразиться из простого голодного хищника в неукротимую машину для убийств. Тысячелетиями туманная роща служила территорией разрушительных игр Первобытного зверя, для которого даже грозные дюраны были не более чем вкусной закуской. Все, кто пытались посягнуть на владения Первобытного зверя, были лишь мелкими помехами. Но так было до тех пор, пока одна такая помеха не применила подлый трюк и не пленила неукротимого хищника Глейпниром. Зверь мог бы провести в заключении оставшуюся вечность, если бы не непредсказуемые силы Механизма Континуума. Теперь же, освободившись от пут Глейпнира и покинув Хранилище, Зверь оказался далеко от туманной рощи и гораздо ближе к населённым землям. Он снова идёт тропой убийств и разрушений — и ничтожные зачатки цивилизации едва ли удержат векового монстра в узде."
}