{"abilities":[{"spell":"Fires a magic missile at an enemy unit, stunning and dealing damage.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The projectile travels at a speed of 900.","The missile first applies the debuff, then the damage."],"mana":"100\/110\/120\/130","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"9 ( 3)","name":"Magic Missile","description":["Cast Animation: 0.3+0.5","Cast Range: 500","Damage: 100\/175\/250\/325 ( 500\/575\/650\/725)","Stun Duration: 1.5\/1.6\/1.7\/1.8"],"hot_key":"Q","legacy_key":"C"},{"spell":"Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the path ahead.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The wave travels at a speed of 2000, taking 0.7 seconds to travel the full distance.","Can hit units up to 1700 range away (travel distance + radius).","The wave provides 300 radius flying vision as it travels, which lasts for 3 seconds. This vision starts 100 range away from Vengeful Spirit and reaches for up to 2000 range away (starting distance + travel distance + vision radius).","The debuff from successive casts does not stack, only the duration gets refreshed.","The wave first applies the debuff, then the damage.","Does not affect couriers."],"mana":"25\/30\/35\/40","elements":["Does not pierce spell immunity."],"cooldown":"16\/14\/12\/10 ( 10\/8\/6\/4)","name":"Wave of Terror","description":["Cast Animation: 0.3+0.5","Cast Range: 1400","Wave Travel Distance: 1400","Effect Radius: 300","Damage: 60\/80\/100\/120","Armor Reduction: 3\/4\/5\/6 ( 4\/5\/6\/7)","Duration: 8"],"hot_key":"W","legacy_key":"E"},{"spell":"Vengeful Spirit's presence increases the physical damage of nearby friendly units. Spawns a Vengeance Illusion when you die that lasts until you revive.","effects":["Ability Aura","Affects Allies"],"notes":["Only increases base damage and that given by the primary attribute of affected units. Raw bonus damage is not increased.","The aura's buff lingers for 0.5 seconds.","The illusion spawns 108 range away from Vengeful Spirit's death location. It appears either north, east, south or west from that spot.","The illusion always spawns with full mana and health and all abilities off cooldown, regardless of their status on Vengeful Spirit.","The illusion does not get a set duration upon spawning. It disappears once Vengeful Spirit respawns.","The illusion spawns on every death, including on the short deaths with reincarnation.","The created illusion is visually distinguishable from the real Vengeful Spirit for the enemies.","The Aghanim's Scepter upgrade allows the illusion to cast its spells, but not items. The upgrade also causes the illusion to not have a gold bounty anymore. Additionally, the upgraded illusion cannot be converted by Enchant anymore.","The aura affects invulnerable allies."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Vengeance Aura","description":["Radius: 1200","Attack Damage Bonus: 12%\/18%\/24%\/30% ( 27%\/33%\/39%\/45%)","Number of Illusions on Death: 1","Illusion Damage Dealt: 100%","Illusion Damage Taken: 150%","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"D"},{"spell":"Instantaneously swaps positions with a target Hero, friend or enemy. Nether Swap interrupts channeling abilities on the target.","effects":["Ability Target Unit ( Passive)","Affects Heroes ( Units)"],"notes":["Interrupts channeling spells on the target, enemies and allies alike.","Does not disjoint projectiles upon teleporting, neither for the caster, nor for the target.","Destroys trees within 300 radius around Vengeful Spirit and the Nether Swap target.","Can be cast on illusions and Spirit Bear.","Aghanim's Scepter upgraded Nether Swap cannot be cast on ancient creeps."],"mana":"100\/150\/200","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"0.25","name":"Nether Swap","description":["Cast Animation: 0.3+0.5","Cast Range: 700\/850\/1000","Number of Charges: 2","Charge Replenish Time: 90\/80\/70 ( 10)"],"hot_key":"R","legacy_key":"W"}],"bio":"Even the most contented Skywrath is an ill-tempered creature, naturally inclined to seek revenge for the slightest insult. But Vengeful Spirit is the essence of vengeance. Once a proud and savage Skywrath scion, Shendelzare was first in succession for the Ghastly Eyrie until a sister's treachery robbed her of her birthright. Snared in an assassin's net, Shendelzare tore free only at the cost of her wings, limping away in the ultimate humiliation: On foot. With her wings broken, she knew the Skywrath would never accept her as ruler; and in the highest roost of the Eyrie, inaccessible except by winged flight, her sister was untouchable. Unwilling to live as a flightless cripple, and desiring revenge far more than earthly power, the fallen princess drove a bargain with the goddess Scree'auk: She surrendered her broken body for an imperishable form of spirit energy, driven by vengeance, capable of doing great damage in the material plane. She may spend eternity flightless, but she will have her revenge.","talentsTips":["The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Vengeful Spirit's magic resistance to 36.25%.","The agility talent effectively grants Vengeful Spirit 2.4 armor, 15 attack speed, 0.75% movement speed and 15 attack damage."],"trivia":["Magic Missile is one of the first and most iconic offensive spells available for arcane spellcaster classes in the famed pen-and-paper RPG series, Dungeons & Dragons.","Previous designs of Vengeful Spirit showed her with a mask that looked similar to her Vengeance Aura ability icon.","Vengeful Spirit's fun name, \"820\", is a tribute to former professional DotA player 820.","In DotA1, she was the sister of Mortred, the Phantom Assassin, and her name was Shendelzare Silkwood. In Dota 2, her lore was changed so that she became affiliated with the Skywrath, thus switching her affiliations to Dragonus, the Skywrath Mage.","In the transition to Dota 2, her aura's name was changed from Command Aura to Vengeance Aura."],"talents":["Magic Missile Pierces Spell Immunity:+400 Magic Missile Damage","+15% Vengeance Aura Damage:-6s Magic Missile Cooldown","-6s Wave of Terror Cooldown:+15 Agility","-1 Wave of Terror Armor:+15% Magic Resistance"],"desc":"Shendelzare, the Vengeful Spirit, is a ranged agility hero who excels at ganking, disabling, and kill hunts. She is one of the most well-rounded supports in the game, possessing a skill set that allows her to set up kills for her team during ganks and teamfights, strengthening her team and weakening the enemy in large-scale engagements, and saving allies from certain death if they are caught by the enemy."}