{
  "abilities": [
    {
      "spell": "Выпускает во врага магический снаряд, который оглушает и наносит урон.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета снаряда - 900."
      ],
      "mana": "110\/120\/130\/140",
      "elements": [
        "Можно избежать.",
        "Блокируется Linken's Sphere.",
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "10 ( 5)",
      "name": "Magic Missile",
      "description": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 500",
        "Урон: 100\/175\/250\/325 ( 500\/575\/650\/725)",
        "Длительность оглушения: 1,5\/1,6\/1,7\/1,8"
      ],
      "hot_key": "Q",
      "legacy_key": "C"
    },
    {
      "spell": "Vengeful Spirit издает дьявольский клич, который ослабляет броню врагов и раскрывает туман войны.",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Волна распространяется со скоростью в 2000 единиц; ей требуется 0.7 секунды, чтобы преодолеть все расстояние.",
        "Может поражать юнитов на расстоянии до 1700 единиц (складывается из дистанции прохождения и радиуса).",
        "Волна дает летающий обзор в радиусе 300 единиц в момент полета, который остается на 3 секунды. Обзор начинается в 100 единицах от Vengeful Spirit и охватывает расстояние до 2000 единиц (складывается из начального расстояния, дистанции прохождения и радиуса обзора).",
        "Не действует на курьеров.",
        "Дебаффы от нескольких применений не складываются, но их время действия обновляется."
      ],
      "mana": "25\/30\/35\/40",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "16\/14\/12\/10 ( -5.9904761904762)",
      "name": "Wave of Terror",
      "description": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 1400",
        "Дистанция прохождения волны: 1400",
        "Радиус: 300",
        "Урон: 60\/80\/100\/120",
        "Снижение брони: 3\/4\/5\/6 ( 4\/5\/6\/7)",
        "Длительность: 8"
      ],
      "hot_key": "W",
      "legacy_key": "E"
    },
    {
      "spell": "Герой одним своим присутствием увеличивает урон ближайших союзников. Если владелец способности погибнет, после него останется иллюзия, которая существует, пока герой не воскреснет.",
      "effects": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "Увеличивает только базовый урон и получаемый от основной характеристики юнитов, на которых действует аура. Бонусный урон не увеличивается.",
        "Бафф от ауры задерживается на 150% секунды.",
        "Иллюзия появляется в 108 единицах от места смерти Vengeful Spirit. Она появляется на севере, востоке, юге или западе от этой точки.",
        "Иллюзия всегда появляется с полным запасом маны и здоровья и готовыми к применению способностями вне зависимости от их статуса у самой Vengeful Spirit.",
        "При появлении у иллюзии нет отсчета времени жизни. Она сразу исчезнет, когда возродится Vengeful Spirit.",
        "Иллюзия появляется с каждой смертью, включая смерть при наличии возрождения.",
        "Для врагов созданная иллюзия визуально отличается от настоящей Vengeful Spirit.",
        "Улучшение Aghanim's Scepter позволяет иллюзии использовать заклинания, но не предметы. Благодаря улучшению за смерть иллюзии не дают золота. Также улучшенную иллюзию больше нельзя переманить с помощью Enchant.",
        "Аура действует на неуязвимых союзников."
      ],
      "mana": "0",
      "elements": [
        "Частично используется иллюзиями.",
        "Отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Vengeance Aura",
      "description": [
        "Радиус: 1200",
        "Дополнительный урон: 12%\/18%\/24%\/30% ( 27%\/33%\/39%\/45%)",
        "Число посмертных иллюзий: 1",
        "Урон, наносимый иллюзией: 100%",
        "Урон, получаемый иллюзией: 150%",
        "Длительность задержки ауры: 0.5"
      ],
      "hot_key": "E",
      "legacy_key": "D"
    },
    {
      "spell": "Мгновенно меняется местами с союзным или вражеским героем. Останавливает прерываемые способности.",
      "effects": [
        "Способность Направленная на юнита ( Пассивная)",
        "Действует на Героев ( Существ)"
      ],
      "notes": [
        "Прерывает произносимые заклинания как врагам, так и союзникам.",
        "Разрушает деревья в радиусе 300 единиц вокруг Vengeful Spirit и целью Nether Swap.",
        "Можно применять на иллюзии и Spirit Bear.",
        "Nether Swap, улучшенный Aghanim's Scepter, нельзя применять на древних крипов."
      ],
      "mana": "100\/150\/200",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Nether Swap",
      "description": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 700\/850\/1000",
        "Число зарядов: 2",
        "Время восстановления заряда: 90\/80\/70 ( 10)"
      ],
      "hot_key": "R",
      "legacy_key": "W"
    }
  ],
  "bio": "Даже самые спокойные cкайрасы — это раздражительные создания, с рождения склонные к мести за самые мелкие оскорбления. Но Vengeful Spirit — это месть во плоти. Некогда гордая и невоспитанная дочь одного из cкайрасов, Шендельзар была бы первой наследницей на трон в Ужаснейшем гнезде, но предательство сестры свело ее планы на нет. Попавшись в сети ассасина, Шендельзар смогла выбраться только ценой своих крыльев, прихрамывая, ужасно унизившись перед остальными: на ногах. Она знала, что cкайрасы никогда не примут ее в качестве правителя; знала, что в самом высоком насесте Ужаснейшего гнезда, до которого было не добраться без крыльев, ее сестра была в безопасности. Не желая жить в роли неспособной летать калеки и жаждущая мести больше всего на свете, павшая принцесса заключила сделку с богиней Скриок: она пожертвовала свое искалеченное тело ради вечной формы энергии духов, питающейся местью и способной нанести огромный урон материи. Она может прожить вечность без крыльев, но она добьется отмщения.",
  "talentsTips": [
    "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
    "Талант на сопротивление магии увеличивает сопротивление магии Vengeful Spirit до 36.25%.",
    "Талант на ловкость в общем даёт Vengeful Spirit: 3 брони, 18,75 скорости атаки, 0,94% скорости передвижения и 15 урона от атаки."
  ],
  "trivia": [
    "Skywrath Mage влюблен в Vengeful Spirit. И они оба родом из одного и того же места.",
    "Vengeful Spirit иногда называют \"820\", это дань уважения легендарному DotA игроку 820.",
    "Vengeful Spirit - название боевого корабля Хоруса во вселенной Warhammer."
  ],
  "talents": [
    "Magic Missile проходит сквозь иммунитет к магии:+400 к урону от Magic Missile",
    "+15% к урону от Vengeance Aura:-5 сек. перезарядки Magic Missile",
    "-6 сек. перезарядки Wave of Terror:+15 к ловкости",
    "+1 к снижению брони от Wave of Terror:+15% к сопротивлению магии"
  ],
  "tips": [
    "Помимо того, что Vengeful Spirit эффективный Disabler, она является мощным прерывателем заклинаний благодаря Magic Missile и Nether Swap.",
    "Vengeance Aura хорошо увеличивает урон, так что не стоит недооценивать авто-атаку. Уменьшение урона врагам зависит от уровня Vengeance Aura и действует на вражеских героев в радиусе 900 вокруг убийцы Vengeful Spirit",
    "Используя Nether Swap, можно переместить врага в радиус атаки союзной башни, а затем оглушить его с помощью Magic Missile. С помощью башни, вы должны легко убить врага.",
    "Героя лучше всего выбирать, когда у вас в команде есть очень зависимые от авто-атаки герои, такие как Ursa и Drow Ranger.",
    "Для использования Wave of Terror требуется очень мало маны, что позволит часто ею пользоваться. Также данная способность используется для просвета местности.",
    "Nether Swap полезен чтобы перемещать легкоубиваемых врагов ближе к союзным героям.",
    "Vengeful Spirit независима от артефактов, она может быть эффективна даже с минимумом вещей.",
    "Несмотря на простую механику, Nether Swap имеет множество применений. Можно принести себя в жертву, ради убийства ключевого вражеского героя, или ради спасения важного союзника от смерти. Не нужно стесняться жертвовать собой в бою, если это позволит вашей команде делать важные убийства; так как Vengeful Spirit не зависит от артефактов, лучше умереть ей, чем союзному Carry-герою. При желании можно уменьшить время возрождения с помощью Bloodstone.",
    "При хорошей коммуникации в команде, Nether Swap позволяет избежать смерти, меняя вас местами с союзником у которого больше шансов убежать.",
    "Если Kunkka использует X Marks the Spot на Vengeful Spirit, то она может использовать Nether Swap на противнике и сама будет возвращена на место, фактически спасаясь от смерти. Если цель окажется в непроходимой местности, он получит свободу передвижения на 5 секунд."
  ],
  "desc": "Vengeful Spirit — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Magic Missile, выпускает во врага магический снаряд, который оглушает и наносит урон. Второй способностью, Wave of Terror, Vengeful Spirit издает дьявольский клич, который ослабляет броню врагов и раскрывает туман войны. Пассивная способность, Vengeance Aura, увеличивает урон ближайших союзников. Так же при смерти союзных героев в радиусе области действия способности на их месте появляются их же неуязвимые копии, атакующие убийцу героя некоторое время. Ультимативная способность, Nether Swap, меняется местами с союзным или вражеским героем. Улучшение с Aghanim's Scepter уменьшает время перезарядки и позволяет использовать способность не только на героях. После смерти появляется дух отмщения. Эта иллюзия наносит 100% урона оригинала, получает на 50% больше урона, но может применять все способности героя (не предметы). Дух существует, пока Vengeful Spirit не воскреснет."
}