{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Fallen_Sky_Fallen_Sky_1.mp3\/revision\/latest?cb=20211002124631",
      "effects": [
        "Cast Range: 1200",
        "Impact Radius: 315",
        "Effect Delay: 1",
        "Impact Damage (TagAghanimUnits): 150",
        "Impact Damage (TagAghanimBuildings): 75",
        "Damage per Second: 60",
        "Burn Duration: 6",
        "Stun Duration: 2",
        "Damage Cooldown: 3"
      ],
      "notes": [
        "Disjoints projectiles and teleports the caster upon cast.",
        "The meteor takes 1 seconds to land. During this period, the caster is invulnerable and hidden.",
        "Upon landing, all enemies within the area, including buildings but excluding wards, get damaged, stunned, and receive a damaging debuff.",
        "The meteor first applies the debuffs, then the impact damage.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 7 total instances, including the impact damage. Can deal a total of 510 (TagTalent 435) damage (before reductions).",
        "Can deal a total of 510 (TagTalent 435) damage (before reductions).",
        "Multiple casts on the same targets do not stack but refresh the duration instead. Stacks with the debuff of Meteor Hammer.",
        "Stacks with the debuff of Meteor Hammer.",
        "Destroys trees within the radius upon impact.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan puts Fallen Sky on a 3 second cooldown. The damage cooldown only triggers when Fallen Sky is in its active state in the neutral item slot. In any other case, the damage cooldown does not trigger it. Since it is a cooldown and not actually disabled, it can be refreshed with cooldown resetting sources. However, this cooldown is not affected by cooldown reduction sources. It is also not disabled by damage flagged as HP Removal.",
        "The damage cooldown only triggers when Fallen Sky is in its active state in the neutral item slot. In any other case, the damage cooldown does not trigger it.",
        "Since it is a cooldown and not actually disabled, it can be refreshed with cooldown resetting sources.",
        "However, this cooldown is not affected by cooldown reduction sources.",
        "It is also not disabled by damage flagged as HP Removal.",
        "Neither shares with any Blink Dagger-based items or Meteor Hammer."
      ],
      "mana": "0",
      "abilityName": "Fallen Sky",
      "cooldown": "15",
      "description": "Transforms into a meteor that strikes down at the target area after 1 seconds in a 315 AoE, stunning enemies for 2 seconds and dealing impact damage. Continues to deal damage every 1 seconds to enemy units and buildings for 6 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "300 health and 1.5 health regeneration.",
    "180 mana and 0.75 mana regeneration.",
    "15 main attack damage to \/ heroes."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Fallen Sky",
  "description": "One of the few surviving creations of the acolytes of the Wyrmforge.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Fallen Sky is best used as both initiation and escape tool, as it works like a combination of Meteor Hammer and Blink Dagger."
  ]
}