{"abilities":[{"effects":["Radius: 900","Aura Linger Duration: 0.5"],"notes":["The True Sight is provided within the whole area, regardless of the carrier's actual vision. It is fully unobstructed.","The True Sight is provided by an aura which affects enemies. Its debuff lingers for 0.5 seconds.","Cannot detect units under the effect of Shadow Dance, Smoke of Deceit and Techies' mines under the effect of an Aghanim's Scepter upgraded Minefield Sign.","True Sight does not work when the Gem is in the inventory of a courier or Spirit Bear.","When the Gem gets dropped on the ground, it continues to provide True Sight around it, for the team that dropped it. This True Sight lasts until the gem gets picked up again. While on the ground, the gem also provides 300 radius ground vision around itself, for the team that dropped it."],"elements":["Ability Aura","Affects Enemies"],"name":"True Sight","description":"Grants the ability to see invisible units and wards to any allied vision within 900 range of its carrier."}],"cost":"900","description":"Not one thrall creature of the depths, Nor spirit bound in drowning's keep, Nor Maelrawn the Tentacular, Shall rest till seas, gem comes to sleep.","tips":["Gem of True Sight is a risky investment, due to it dropping on death and potentially giving the enemy a free Gem. Therefore, this item should only be bought when having enough survivability and when other True Sight items are not enough.","Although often purchased by supports, Gem of True Sight is better carried by more resilient tanks and initiators, who are less likely to die and lose it.","In the early game, when heroes are more stationary farming the lanes, Sentries are a far more efficient way to avoid being ganked by invisible heroes.","Due to the True Sight being a passive aura, it constantly reveals nearby invisible enemies, making it the most cost effective revealing item, hence the heavy drawback.","Gem of True Sight can still sometime be a worthwhile investment when the enemy has no invisible heroes. It is ideal to reliably remove enemy wards over a long term, as the only alternative item to do this are Sentry Wards, but they can be easily wasted if the enemy ward locations are unknown."],"attrs":["Passive True Sight","Disassemble? No","Alert allies? No"],"info":["Gem of True Sight is partially shareable.","The stock takes 10 minutes to replenish.","This item drops when its wielder dies, unless it has Reincarnation.","Gem of True Sight cannot be destroyed or sold.","Gem of True Sight cannot be put into the backpack."]}