{
  "abilities": [
    {
      "notes": [
        "Талант на увеличение урона и здоровья пауков влияет как на паучков, так и на паучат.",
        "Талант на ловкость в общем даёт Broodmother: 1,67 брони, 10 скорости атаки и 10 урона от атаки.",
        "Несколько источников процентного уменьшения перезарядки не складываются. Приоритет имеет высшее значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+350 к здоровью пауков",
          "talentRight": "+50 к урону\/вампиризму от Insatiable Hunger"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+400 к здоровью",
          "talentRight": "−15 сек восстановления заряда паутины"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к скорости атаки",
          "talentRight": "−15% перезарядки заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 к ловкости",
          "talentRight": "+80 к урону от Spawn Spiderlings"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/52\/Spawn_Spiderlings.mp3\/revision\/latest?cb=20141205111152",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд Spawn Spiderlings летит со скоростью 1200.",
        "Spawn Spiderlings сначала применяет дебафф, затем наносит урон.",
        "Паучки появляются только в случае смерти выбранного юнита под действием дебаффа.",
        "Не имеет значения, кто убьет цель, паучки все равно появятся.",
        "Количество появившихся паучков зависит от уровня способности на момент их появления, а не применения.",
        "Паучки получают все бонусы от Spin Web.",
        "Выбор таланта, увеличивающего урон, мгновенно обновит все летящие снаряды Spawn Spiderling.",
        "Выбор таланта на дополнительное здоровье или урон не усилит уже призванных паучков Broodmother."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "11\/10\/9\/8 (TagTalent 9,35\/8,5\/7,65\/6,8)",
      "description": "Герой впрыскивает во врага свои яйца и наносит ему урон. Если жертва умрёт, находясь под действием этой способности, из её трупа появятся несколько паучков.",
      "spellName": "Spawn Spiderlings",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: 700",
        "Урон: 70\/140\/210\/280 (TagTalent 150\/220\/290\/360)",
        "Количество пауков: 1\/2\/3\/4",
        "Длительность эффекта: 2",
        "Длительность паучков: 60",
        "Дебафф остается если был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Паучиха продолжает взращивать своё потомство даже на поле битвы. Выводок быстро понимает, как поддержать мать."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Spin_Web.mp3\/revision\/latest?cb=20141205111223",
      "effects": [
        "Способность Направленная на область",
        "Действует на Себя"
      ],
      "notes": [
        "Имеет глобальную дальность применения, если край новой паутины соприкасается с уже созданной паутиной.",
        "При первом изучении способности Broodmother сразу получает 2 заряда паутины. Последующее повышение уровня способности не дает готовых зарядов. При первом получении Aghanim's Scepter у героя сразу активны 10 зарядов. Повторное получение предмета зарядов не дает.",
        "При первом получении Aghanim's Scepter у героя сразу активны 10 зарядов. Повторное получение предмета зарядов не дает.",
        "Действует только на Broodmother и её паучков и паучонков. Не действует на других подконтрольных юнитов.",
        "Восстанавливает здоровье в виде регенерации, восстанавливая 0,2\/0,4\/0,6\/0,8 здоровья с интервалом в 0,1 секунды, что в сумме дает 2\/4\/6\/8 в секунду.",
        "Может восстановить до 120\/240\/360\/480 единиц здоровья в минуту.",
        "Эффекты даются в виде ауры. Её бафф задерживается на 0,2 секунды.",
        "Паутина видна на миникарте Broodmother и ее союзникам. Паутина не дает обзора, но может быть выделена в тумане войны.",
        "Не действует на неуязвимых или спрятанных юнитов.",
        "Выбранную паутину можно разрушить с помощью Destroy Spin Web.",
        "Паутина не блокирует лагери нейтральных крипов."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Герой сплетает паутину, в которой он быстрее передвигается и восстанавливает здоровье, а также может проходить через препятствия. Заряды способности восстанавливаются 45 секунд. Новую паутину можно сплести из любой точки карты, если она будет касаться старой. Длительность существования паутин не ограничена по времени, и их можно уничтожить вручную. Если превысить максимальное число паутин, то самая старая из них исчезнет.",
      "spellName": "Spin Web",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Дальность применения: 1000",
        "Радиус паутины: 900",
        "Макс. зарядов паутин: 2\/4\/6\/8 (TagAghanim 6\/10\/14\/18)",
        "Доп. восстановление здоровья: 2\/4\/6\/8",
        "Доп. скорость передвижения: 25%\/35%\/45%\/55% (TagAghanim 35%\/50%\/65%\/80%)",
        "Длительность задержки ауры: 0,2",
        "Число зарядов: 2\/4\/6\/8 (TagAghanim 6\/10\/14\/18)",
        "Время восстановления заряда: 45 (TagTalent 38.25)",
        "Даёт дополнительную скорость передвижения, увеличивает максимум паутин и позволяет превысить в них максимум скорости."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Сплетенное из блестящих нитей ложе оберегает паучиху и её потомство, а также служит дурным знаком для наступающих противников."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Успешные атаки с Incapacitating Bite по одной и той же цели не складываются, но обновляют время действия дебаффа.",
        "Атаки сначала применяют дебафф, затем наносят свой урон.",
        "Не действует на постройки, варды и союзных юнитов, атакованных Broodmother."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Яд героя ослабляет врагов, замедляя их и заставляя промахиваться при атаках.",
      "spellName": "Incapacitating Bite",
      "params": [
        "Замедление скорости передвижения: 20%\/30%\/40%\/50%",
        "Шанс промаха: 30%\/40%\/50%\/60%",
        "Длительность: 2",
        "Замедление и ослепление остаются, если дебафф был размещен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "P",
      "story": "Клыки паучихи выделяют парализующие токсины, вызывая медленную и мучительную смерть у тех, кто угодил в её паутину."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4b\/Broodmother_Silken_Bola_1.mp3\/revision\/latest?cb=20201224014000",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Для действия способности нужны заряды Spin Web. Если способность применить без зарядов, то она ничего не сделает, потратит ману и уйдёт на перезарядку.",
        "Снаряд летит со скоростью 1200.",
        "Накладывает на цель оцепенение, запрещая ей передвигаться и применять некоторые способности. Даёт на цель эффект True Sight.",
        "Даёт на цель эффект True Sight.",
        "Наносит 37,5 урона с интервалом в полсекунды, первое срабатывание происходит через полсекунды после размещения дебаффа, следовательно, способность срабатывает 5 раза. Может нанести цели до 187,5 урона (без учёта уменьшений).",
        "Может нанести цели до 187,5 урона (без учёта уменьшений)."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "12",
      "description": "Расходует один заряд паутины Spin Web, чтобы применить на выбранного врага оцепенение длительностью 2,5 секунды и нанести 75 урона в секунду.",
      "spellName": "Silken Bola",
      "params": [
        "Анимация применения: 0,1+0,67",
        "Дальность применения: 900",
        "Урон в секунду: 75",
        "Длительность: 2,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Insatiable_Hunger.mp3\/revision\/latest?cb=20141205111123",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Дополнительный урон считается за обычный бонус к атаке.",
        "Складывается аддитивно с другими источниками вампиризма.",
        "Вампиризм не действует на постройки, но лечит при атаке вардов и союзных юнитов."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "45 (TagTalent 38.25)",
      "description": "Неистовая жажда питательных соков увеличивает урон героя и наделяет его вампиризмом.",
      "spellName": "Insatiable Hunger",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дополнительный урон: 60\/100\/140 (TagTalent 110\/150\/190)",
        "Вампиризм: 40%\/60%\/80%\/100% (TagTalent 90%\/110%\/130%\/150%)",
        "Длительность: 14"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Несмотря на то, что большая часть добычи завёрнута в блестящие коконы и сохранена для выводка, сама Broodmother также имеет вкусы на блуждающих героев."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Это заклинание от самой паутины, что позволяет Broodmother уничтожать паутины индивидуально вместо уничтожения старой паутины.",
        "Паутины не оставляют трупов."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Уничтожает выбранную паутину.",
      "spellName": "Destroy Spin Web",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Удачные атаки с Poison Sting по одной и той же цели не складываются, но обновляют длительность дебаффа.",
        "Атаки сначала наносят урон, затем применяют дебафф.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 2 (6) раз.",
        "Может нанести до 16 (48) единиц урона (до учета снижений).",
        "Действует на союзников и варды, но не на постройки.",
        "Считает крипов-героев за крипов.",
        "Паучата не получают эту способность."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Отравляет и замедляет врагов каждым ударом.",
      "spellName": "Poison Sting",
      "params": [
        "Урон в секунду: 8",
        "Замедление передвижения: 8%",
        "Длительность на героях: 2",
        "Длительность на крипах: 6"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Успешные атаки с Spawn Spiderite по одной и той же цели не складываются, но обновляют длительность дебаффа.",
        "Атаки сначала наносят урон, затем применяют дебафф.",
        "Паучата появятся только когда атакованый юнит умер под действием дебаффа.",
        "Не важно, кто убил цель — паучата появятся в любом случае.",
        "Не действует на варды и постройки, но действует на союзников.",
        "Паучата полностью попадают под влияние Spin Web",
        "Паучата не получают эту способность."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Заражает жертву атаками. Если она умрет, из трупа появятся несколько паучат.",
      "spellName": "Spawn Spiderite",
      "params": [
        "Кол-во паучат: 1",
        "Длительность эффекта: 2",
        "Длительность паучат: 60",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.0,
    "attrAgility": 15.0
  },
  "description": "Broodmother — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Первая способность, Spawn Spiderlings, инфицирует врага, нанося урон. Если цель умрет, находясь под действием этого заклинания, из ее трупа появится несколько паучков. Вторая способность, Spin Web, плетет паутину, в которой Broodmother, быстрее передвигается, проходит через препятствия и быстрее восстанавливает здоровье. Пассивная способность, Incapacitating Bite, замедляет врагов и увеличивая шанс, что жертва промахнется при атаке. Ультимативная способность, Insatiable Hunger, увеличивает урон Broodmother и наделяет ее вампиризмом.",
  "history": "Веками чёрная паучиха Арахния скрывалась в тёмных лавовых туннелях под тлеющими кратерами горы Пиротей, взращивая миллионы паучков и отправляя их охотиться на поверхности. Однажды визирь жадности Фолопталис воздвиг на склоне этого потухшего вулкана свой магнетитовый зиккурат, прекрасно зная: любым грабителям, что ищут его притягательные богатства, сначала придётся пройти через паучьи владения. Тысячелетию материнского спокойствия пришёл конец: гору непрерывно осаждали мохноноги и воришки, смелые рыцари и благородные юноши — несомненно, очень питательные, но всё же мешающие воспитывать невинное паучье потомство. Устав от вторжений, Арахния нанесла Фолопталису визит, а когда тот отказался уступить, паучиха затянула его в шёлковый кокон и отложила до особого пира в честь дня рождения. К несчастью, опустевший зиккурат лишь привлёк новых охотников за наживой. Когда один из паучков попал под ноги неуклюжего наглеца, материнскому терпению пришёл конец. Арахния направилась на поверхность и объявила: она избавит мир от каждого вредителя, вплоть до самого последнего героя — пока не убедится, что её драгоценные паучата растут в безопасности.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+350 к здоровью пауков",
      "talentRight": "+50 к урону\/вампиризму от Insatiable Hunger"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+400 к здоровью",
      "talentRight": "−15 сек восстановления заряда паутины"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к скорости атаки",
      "talentRight": "−15% перезарядки заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 к ловкости",
      "talentRight": "+80 к урону от Spawn Spiderlings"
    }
  ]
}