{
  "abilities": [
    {
      "notes": [
        "Талант на вампиризм аддитивно складывается с другими источниками вампиризма.",
        "Снижение брони от талантов не отключается истощением. Снижение брони длится 10 секунд и складывается с талантами на снижение брони от других героев.",
        "Снижение брони длится 10 секунд и складывается с талантами на снижение брони от других героев."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Stifling Dagger по трём целям",
          "talentRight": "+7% к шансу критической атаки у Coup de Grace"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+35% к уклонению Blur",
          "talentRight": "Атаки снижают броню на 3"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+250 к дальности применения Phantom Strike",
          "talentRight": "+12% к вампиризму"
        },
        {
          "talentLvl": "10",
          "talentLeft": "–2 сек. перезарядки Stifling Dagger",
          "talentRight": "+1 сек. действия Phantom Strike"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Phantom_Assassin_Stifling_Dagger_1.mp3\/revision\/latest?cb=20191216021615",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Скорость полета кинжала — 1200.",
        "При попадании в цель кинжал заставляет Phantom Assassin совершить мгновенную атаку по ней. Поскольку это обычная атака, то кинжал может сработать любой модификатор атаки и эффекты, срабатывающие при ударе, за исключением Jinada и Tidebringer. Урон от Tidebringer будет учтен, но рассекающий удар от него не сработает. При этом у мгновенной атаки нет анимации атаки, поэтому способности, которые срабатывают из-за замаха атаки (например, Untouchable), не активируются. Эффекты рассечения зависят от местоположения цели, нанося урон по трапецевидной области в противоположном направлении от места, откуда был отправлен кинжал. Может показаться, что кинжал считается за дальнюю атаку, но она продолжает считаться ближней атакой, если исходит от Phantom Assassin. То есть, все способности, у которых есть различия между дальним и ближним типом атаки, использую эффекты или значения ближней атаки. Совершенная мгновенная атака имеет эффект True Strike, поэтому она не может промахнуться. При избежании кинжала атака не совершается. Мгновенная атака игнорирует обезоруживание.",
        "Поскольку это обычная атака, то кинжал может сработать любой модификатор атаки и эффекты, срабатывающие при ударе, за исключением Jinada и Tidebringer.",
        "Урон от Tidebringer будет учтен, но рассекающий удар от него не сработает.",
        "При этом у мгновенной атаки нет анимации атаки, поэтому способности, которые срабатывают из-за замаха атаки (например, Untouchable), не активируются.",
        "Эффекты рассечения зависят от местоположения цели, нанося урон по трапецевидной области в противоположном направлении от места, откуда был отправлен кинжал.",
        "Может показаться, что кинжал считается за дальнюю атаку, но она продолжает считаться ближней атакой, если исходит от Phantom Assassin.",
        "То есть, все способности, у которых есть различия между дальним и ближним типом атаки, использую эффекты или значения ближней атаки.",
        "Совершенная мгновенная атака имеет эффект True Strike, поэтому она не может промахнуться. При избежании кинжала атака не совершается.",
        "Мгновенная атака игнорирует обезоруживание.",
        "Сначала кинжал берет процент от общего урона Phantom Assassin, затем добавляет 25%\/40%\/55%\/70% единиц дополнительного урона. Урон можно выразить в формуле: 25%\/40%\/55%\/70% + 50% * (базовый урон от атаки + бонусы\/уменьшения урона от атаки) \"Бонусы\/уменьшения урона от атаки\" включают в себя все возможные шансы нанести дополнительный урон, включая временные (оглушающий удар) и условные (Quell). Урон в 25%\/40%\/55%\/70% единиц также считается дополнительным уроном, но он добавляется уже после расчета основного урона от способности. Модификаторы атаки, которые рассчитываются от урона (критический удар, вампиризм, рассекающий удар) также учитывают 25%\/40%\/55%\/70% единиц дополнительного урона. Урон добавляется к урону Phantom Assassin с помощью баффа, который длится 0,03 сек. Поскольку урон от способности наносится обычной атакой, то он не относится к урону от заклинаний, но считается за урон от атаки. То есть на способность распространяется блокировка урона, но не действует усиление урона от способности и вампиризм заклинаний.",
        "Урон можно выразить в формуле: 25%\/40%\/55%\/70% + 50% * (базовый урон от атаки + бонусы\/уменьшения урона от атаки)",
        "\"Бонусы\/уменьшения урона от атаки\" включают в себя все возможные шансы нанести дополнительный урон, включая временные (оглушающий удар) и условные (Quell).",
        "Урон в 25%\/40%\/55%\/70% единиц также считается дополнительным уроном, но он добавляется уже после расчета основного урона от способности.",
        "Модификаторы атаки, которые рассчитываются от урона (критический удар, вампиризм, рассекающий удар) также учитывают 25%\/40%\/55%\/70% единиц дополнительного урона.",
        "Урон добавляется к урону Phantom Assassin с помощью баффа, который длится 0,03 сек.",
        "Поскольку урон от способности наносится обычной атакой, то он не относится к урону от заклинаний, но считается за урон от атаки.",
        "То есть на способность распространяется блокировка урона, но не действует усиление урона от способности и вампиризм заклинаний.",
        "Кинжал сначала наносит урон, затем применяет дебафф.",
        "Снаряд имеет летающий обзор в радиусе 450 единиц. При успешном попадании обзор задерживается на 3,34 сек. в месте пребывания цели.",
        "Нельзя применить на курьеров.",
        "При выборе таланта 25 уровня способность запускает 2 дополнительных снаряда в случайные видимые подходящие цели в радиусе применения. Радиус поиска зависит от дальности применения плюс дополнительное расстояние, в итоге выбирая цели на расстоянии до 850\/1050\/1250\/1450 единиц. Не может отметить основную цель дополнительными кинжалами, поэтому, если поблизости нет других целей, ничего не произойдет. Вторичные цели выбираются случайно в области без каких-либо приоритетов. Снаряды не могут выбрать одну и ту же цель. Поскольку дополнительные кинжалы используют дальность применения заклинания, то эффекты увеличения дальности действия также увеличивают их дальность.",
        "Радиус поиска зависит от дальности применения плюс дополнительное расстояние, в итоге выбирая цели на расстоянии до 850\/1050\/1250\/1450 единиц.",
        "Не может отметить основную цель дополнительными кинжалами, поэтому, если поблизости нет других целей, ничего не произойдет.",
        "Вторичные цели выбираются случайно в области без каких-либо приоритетов. Снаряды не могут выбрать одну и ту же цель.",
        "Поскольку дополнительные кинжалы используют дальность применения заклинания, то эффекты увеличения дальности действия также увеличивают их дальность."
      ],
      "mana": "30",
      "hotKey": "Q",
      "cooldown": "6 (TagTalent 4)",
      "description": "Бросает кинжал, который замедляет скорость передвижения врага, наносит ему физический урон в размере 25%\/40%\/55%\/70% + 50% урона от атаки героя, а также накладывает эффекты предметов и способностей.",
      "spellName": "Stifling Dagger",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: 550\/750\/950\/1150",
        "Число целей: 1 (TagTalent 3)",
        "Базовый урон: 65",
        "Урон от атаки: 25%\/40%\/55%\/70%",
        "Замедление передвижения: 50%",
        "Длительность замедления: 2,2\/2,8\/3,4\/4",
        "Доп. расстояние для поиска вторичной цели: 300",
        "Можно применить на существ с иммунитетом к заклинаниям. Мгновенная атака проходит сквозь иммунитет, замедление — нет. Замедление остается, если дебафф был применен до иммунитета и не был развеян.",
        "Блокируется при попадании как основной, так и вторичной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Phantom_Assassin_Phantom_Strike.mp3\/revision\/latest?cb=20191216021614",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя"
      ],
      "notes": [
        "Phantom Strike можно применить на союзных существ, при этом не получая дополнительную скорость атаки.",
        "Перемещает Phantom Assassin к цели по направлению к месту, в котором цель была при использовании заклинания.",
        "Не позволяет избежать снаряды при телепортации.",
        "Phantom Assassin получает приказ атаковать цель, автоматически отменяя остаточную анимацию.",
        "Нельзя использовать на курьеров."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "W",
      "cooldown": "11\/9\/7\/5",
      "description": "Герой телепортируется к выбранному существу и, если это противник, получает дополнительную скорость атаки.",
      "spellName": "Phantom Strike",
      "params": [
        "Анимация применения: 0,25+0,8",
        "Дальность применения: 1000 (TagTalent 1250)",
        "Доп. скорость атаки: 75\/100\/125\/150",
        "Длительность: 2 (TagTalent 3)"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Phantom_Assassin_Blur_1.mp3\/revision\/latest?cb=20191216021620",
      "effects": [
        "Способность Ненаправленная \/ Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Phantom Assassin.",
        "Применяет к Phantom Assassin невидимость с иммунитетом к эффекту раскрытия невидимости. Только Chronosphere может выявить героя.",
        "Атаки или применение заклинаний не выводят из невидимости.",
        "Эффект развеивается, если заклинатель оказался на расстоянии 600 от вражеского героя (включая клонов, но исключая иллюзии) или вражеского постройки. Эффект не развеивается мгновенно, а спадает спустя 0,5 сек. после обнаружения. Покидание области во время задержки не отменит развеивание эффекта.",
        "Эффект не развеивается мгновенно, а спадает спустя 0,5 сек. после обнаружения.",
        "Покидание области во время задержки не отменит развеивание эффекта.",
        "Эффект также развеивается при атаке Рошана, но не мгновеннно, а после задержки.",
        "Уклонение и активная часть способности не связаны друг с другом. Уклонение всегда будет активно.",
        "В среднем, Blur увеличивает выживаемость против физических атак на 25%\/43%\/67%\/100% (TagTalent 122%\/186%\/300%\/567%).",
        "При улучшении при использовании применяет к Phantom Assassin базовое развеивание. Сброс перезарядки происходит независимо от того, чем именно был убит герой. Он сбрасывает перезарядку всех основных способностей героя. Сброс связан с Blur. Если способность не изучена, то убийства не сбросят перезарядку. В режиме Ability Draft сброс перезарядки действует на все способности, кроме ультимативных.",
        "Сброс перезарядки происходит независимо от того, чем именно был убит герой. Он сбрасывает перезарядку всех основных способностей героя.",
        "Сброс связан с Blur. Если способность не изучена, то убийства не сбросят перезарядку.",
        "В режиме Ability Draft сброс перезарядки действует на все способности, кроме ультимативных."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "60\/55\/50\/45 (TagTalent 10)",
      "description": "Герой сосредотачивается на себе, что позволяет ему уклоняться от атак. Применение способности размоет очертания владельца, делая его невидимым, если рядом нет вражеских героев.",
      "spellName": "Blur",
      "params": [
        "Анимация применения: 0,4+0,57 (TagAghanim 0+0)",
        "Пассивное уклонение: 20%\/30%\/40%\/50% (TagTalent 55%\/65%\/75%\/85%)",
        "Радиус развеивания невидимости: 600",
        "Задержка перед исчезновением: 0",
        "Задержка перед появлением: 0,5 (TagAghanim 0,75)",
        "Длительность: 25",
        "Уменьшает перезарядку до 10, а задержку перед снятием невидимости до 0,75. Способность развеивает отрицательные эффекты и применяется без задержки. Каждое убийство героя сбрасывает перезарядку способностей.",
        "Пассивное уклонение отключается истощением."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Phantom_Assassin_Fan_of_Knives_1.mp3\/revision\/latest?cb=20210102190424",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Применяет истощение при нанесении урона противникам, сперва применяется истощение — затем наносится урон.",
        "Выпущенные кинжалы имеют только визуальное назначение. Эффект способности поражает всех врагов, находящихся в зоне действия способности вне зависимости от количества кинжалов.",
        "Кинжалы летят со скоростью 1000, им потребуется 0,55 секунды, чтобы долететь до максимальной дистанции. Центром способности является место, где она была применена. Зона действия не передвигается вместе с персонажем.",
        "Центром способности является место, где она была применена. Зона действия не передвигается вместе с персонажем.",
        "Зона поражения — не кольцо, а увеличивающаяся в размере окружность. Все враги, попавшие в неё, будут задеты эффектом способности. Это означает, что невозможно увернуться от способности при помощи телепортации к центру её действия, попытавшись увернуться от летящих кинжалов.",
        "Это означает, что невозможно увернуться от способности при помощи телепортации к центру её действия, попытавшись увернуться от летящих кинжалов."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "15",
      "description": "Выпускает острые кинжалы в радиусе 550. Они наносят врагам урон в размере 16% от их максимального здоровья и накладывают истощение на 3 секунды.",
      "spellName": "Fan of Knives",
      "params": [
        "Анимация применения: 0,15+0,9",
        "Радиус: 550",
        "Максимального здоровья цели в урон: 16%",
        "Длительность дебаффа: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/93\/Phantom_Assassin_Coup_de_Grace_1.mp3\/revision\/latest?cb=20191216021612",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "В среднем увеличивает урон от атак на 15%\/33,75%\/52,5% (TagTalent 22%\/49,5%\/77%).",
        "Шанс срабатывания сочетается с другими источниками критического урона. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.",
        "Если одновременно срабатывают два источника критического удара, используется более высокий множитель.",
        "Coup de Grace использует псевдослучайное распределение.",
        "Часть визуальных эффектов (белое свечение на её оружии) воспроизводится во время начала атаки, показывая, что она будет критической."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Герой оттачивает свои боевые способности, получая шанс совершить сокрушительную критическую атаку по врагу. Способность Stifling Dagger получает такой же шанс.",
      "spellName": "Coup de Grace",
      "params": [
        "Шанс срабатывания: 15% (TagTalent 22%)",
        "Критический урон: 200%\/325%\/450%",
        "Дарует новую способность: Fan of Knives.",
        "Красные цифры критического урона отображаются до учета уменьшения урона от иллюзий и брони."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 21.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 3.4,
    "attrAgility": 23.0
  },
  "description": "Phantom Assassin — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Первая способность, Stifling Dagger, бросает кинжал, наносит зависящий от урона героя физический урон и замедляет врага. Вторая способность, Phantom Strike, телепортирует к вражескому или союзному юниту и дает бонус к скорости атаки, если это противник. Третья способность, Blur, даёт Мортред возможность войти в состояние невидимости, из которого её может вывести только близкое нахождение вражеского героя или строения, а также даёт постоянный шанс уклонения от физической атаки. Пассивная ультимативная способность, Coup de Grace, дает шанс нанести критический удар по врагу. Способность Stifling Dagger получает такой же шанс крита.",
  "history": "Сёстры Вуали, считающие убийство священной частью естественного цикла жизни, находят новых воспитанников в гаданиях. О своих жертвах сёстры узнают в медитации и пророческих изречениях. Они не принимают контрактов, и, похоже, не преследуют жертв из-за политики или корысти. Их убийства не выглядят частью какого-то замысла, и могут показаться не связанными между собой: сегодня жертвой станет человек с великой властью, завтра — крестьянин или копатель колодцев. Какой бы между убийствами ни было связи, её знают лишь сёстры. Они считают убитых жертвенным даром, а смерть от рук ордена — большой честью. Не ведающие своей личности, взращённые лишь на устоях ордена, убийцы легко заменяют друг друга, и число их неведомо. Возможно, их много; возможно, их единицы. Что лежит под вуалью — тайна без ответа. И лишь изредка эта сестра, когда никто не слышит, поднимает свою вуаль, чтобы нарушить запрет, прошептав своё имя: Мортред.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Stifling Dagger по трём целям",
      "talentRight": "+7% к шансу критической атаки у Coup de Grace"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+35% к уклонению Blur",
      "talentRight": "Атаки снижают броню на 3"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+250 к дальности применения Phantom Strike",
      "talentRight": "+12% к вампиризму"
    },
    {
      "talentLvl": "10",
      "talentLeft": "–2 сек. перезарядки Stifling Dagger",
      "talentRight": "+1 сек. действия Phantom Strike"
    }
  ]
}