{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 сек. оглушения от Hoof Stomp",
          "talentRight": "Retaliate становится аурой"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−20 сек. перезарядки Stampede",
          "talentRight": "+50 к урону от Retaliate"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+40% к урону от силы у Double Edge",
          "talentRight": "+5 к броне"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+5 здоровья в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Hoof_Stomp.mp3\/revision\/latest?cb=20141125181056",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Способность сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "100\/110\/120\/130",
      "item_behaviour": [],
      "name": "Hoof Stomp",
      "cooldown": "18\/16\/14\/12",
      "description": "Герой бьёт о землю, оглушая противников неподалёку и нанося им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,5+0,3",
        "Радиус: 330",
        "Урон: 100\/150\/200\/250",
        "Длительность оглушения: 1,7\/2\/2,3\/2,6 (TagTalent 2,7\/3\/3,3\/3,6)"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/79\/Double_Edge.mp3\/revision\/latest?cb=20141125181049",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Double Edge наносит магический урон как цели, так и самому заклинателю.",
        "Центром радиуса урона является сама цель, а не Centaur Warrunner.",
        "Урон, наносимый себе, не может быть смертельным, поэтому его нельзя использовать для добивания себя.",
        "Double Edge сначала наносит урон всем противникам (в случайном порядке), а потом заклинателю. При улучшении с Aghanim's Shard способность применяет негативный эффект перед нанесением урона каждому противнику.",
        "При улучшении с Aghanim's Shard способность применяет негативный эффект перед нанесением урона каждому противнику.",
        "Aghanim's Shard: Повышение силы происходит после того, как все враги получили урон и замедление. Это значит, что применение способности, давшее эффект повышения силы, не будет получать от него бонусы. Повышение силы даётся только в том случае, если задетый враг — герой (включая клонов, исключая иллюзии и крипов героев). Применение способности по герою увеличит накопленное число эффектов и обновит их длительность. Может увеличить силу на 15%\/30%\/45%\/60%\/75% за каждое число эффектов. Увеличивает как базовую силу, так и полученную от предметов.",
        "Повышение силы происходит после того, как все враги получили урон и замедление. Это значит, что применение способности, давшее эффект повышения силы, не будет получать от него бонусы.",
        "Это значит, что применение способности, давшее эффект повышения силы, не будет получать от него бонусы.",
        "Повышение силы даётся только в том случае, если задетый враг — герой (включая клонов, исключая иллюзии и крипов героев). Применение способности по герою увеличит накопленное число эффектов и обновит их длительность. Может увеличить силу на 15%\/30%\/45%\/60%\/75% за каждое число эффектов. Увеличивает как базовую силу, так и полученную от предметов.",
        "Применение способности по герою увеличит накопленное число эффектов и обновит их длительность.",
        "Может увеличить силу на 15%\/30%\/45%\/60%\/75% за каждое число эффектов.",
        "Увеличивает как базовую силу, так и полученную от предметов."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Double Edge",
      "cooldown": null,
      "description": "Герой совершает сокрушительный удар, нанося урон себе, цели и всем врагам неподалёку от неё. Урон этой способности частично зависит от силы владельца, и он не может погибнуть от её применения.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,43",
        "Дальность применения: 150",
        "Радиус урона: 190",
        "Базовый урон: 120\/180\/240\/300",
        "Дополнительный урон от силы: 60%\/80%\/100%\/120% (TagTalent 100%\/120%\/140%\/160%)",
        "Бонус к силе за эффект: 0% (TagTalent 15%)",
        "Максимальное число эффектов: 0 (TagTalent 5)",
        "Замедление скорости передвижения: 0% (TagTalent 25%)",
        "Длительность замедления: 0 (TagTalent 2)",
        "Длительность эффекта: 0 (TagTalent 15)",
        "Применение Double Edge увеличивает силу владельца способности на 15% за каждого задетого героя на 15 секунд. Получение нового эффекта возобновляет длительность, а всего их может быть не больше 5. Также замедляет жертв на 25% на 2 секунды.",
        "Блокируется только основной целью. Если способность была блокирована, Centaur Warrunner не получит урон по себе."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная (TagAghanim Аура)",
        "Действует на Врагов \/ Себя",
        "Урон Физический"
      ],
      "notes": [
        "Retaliate срабатывает только при попадании атаки по Centaur Warrunner вне зависимости от расстояния. То есть способность не срабатывает на промахнувшиеся атаки.",
        "Сначала возвращаемый урон наносится атакующему, и только после этого - самому Centaur Warrunner.",
        "Вторичные атаки от Moon Glaives, Split Shot до выбора героем таланта и Flak Cannon не активируют Retaliate . При этом вторичные атаки от других источников мгновенных атак способность активируют.",
        "При этом вторичные атаки от других источников мгновенных атак способность активируют.",
        "Не срабатывает от атак вардов и Undying Zombie. Срабатывает от атак строений.",
        "Действует на союзных юнитов: если союзник умрет от возвращаемого урона - это будет засчитано за добивание.",
        "Изначально Retaliate - это аура, но она распространяется только на владельца до выбора соответствующего таланта. Бафф не отображается на владельце. При выборе таланта аура начинает распространятся только на героев и крипов-героев. Влияет на неуязвимых союзников, но не на спрятанных союзников. Бафф от ауры задерживается на секунды.",
        "При выборе таланта аура начинает распространятся только на героев и крипов-героев.",
        "Влияет на неуязвимых союзников, но не на спрятанных союзников.",
        "Бафф от ауры задерживается на секунды."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Retaliate",
      "cooldown": null,
      "description": "Каждый удар по герою наносит урон и атакующему. Помимо базового урона наносится дополнительный, зависящий от силы владельца способности. Наносит башням половину урона.",
      "hot_key": "E",
      "params": [
        "Радиус ауры: 0 (TagTalent 1200)",
        "Ответный урон: 15\/30\/45\/60 (TagTalent 65\/80\/95\/110)",
        "Силы в виде урона: 20%\/26%\/32%\/38%",
        "Длительность задержки ауры: 0,5",
        "Способность Retaliate не работает у иллюзий. Иллюзии распространяют ауру Retaliate."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/06\/Stampede.mp3\/revision\/latest?cb=20141125181117",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания Centaur Warrunner.",
        "Действует на каждого подконтрольного игрокам союзного юнита, исключая курьеров, варды, постройки и иллюзии Haunt.",
        "Затронутые союзники получают эффект сквозного движения и ускорение, поэтому их нельзя замедлить ниже установленного значения.",
        "Урон от силы рассчитывается при каждом отдельном прохождении через врага, поэтому он мгновенно адаптируется при изменении силы Centaur Warrunner. Тем не менее, множитель урона фиксируется до окончания действия и не изменится, если увеличить уровень Stampede.",
        "Тем не менее, множитель урона фиксируется до окончания действия и не изменится, если увеличить уровень Stampede.",
        "Stampede сначала наносит урон, затем применяет дебафф.",
        "Звуковой эффект является глобальным и может быть услышан врагами даже сквозь туман войны.",
        "При улучшении Aghanim's Scepter позволяет союзникам проходить по возвышенностям и разрушать деревья, пока действует способность. Не разрушает деревья вокруг союзников, на которых действует модификатор от Tree Dance.",
        "Не разрушает деревья вокруг союзников, на которых действует модификатор от Tree Dance.",
        "Уменьшение урона действует на все 3 типа урона."
      ],
      "mana": "150\/200\/250",
      "item_behaviour": [],
      "name": "Stampede",
      "cooldown": "90 (TagTalent 70)",
      "description": "Герой ведёт союзников в яростное наступление. Они проходят сквозь существ на максимальной скорости и втаптывают в землю всех врагов на пути, останавливая их и нанося им урон, зависящий от силы владельца способности. Каждого врага можно втоптать в землю лишь один раз.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Радиус урона\/замедления: 105",
        "Множитель урона за силу: 150%\/225%\/300%",
        "Уменьшение получаемого союзниками урона: 0 (TagAghanim 40%)",
        "Скорость ускорения: 550",
        "Замедление скорости передвижения: 100%",
        "Длительность замедления: 2,3",
        "Длительность: 3,5\/4\/4,5 (TagAghanim 4,5\/5\/5,5)",
        "Способность уменьшает получаемый урон, а также позволяет проходить сквозь препятствия, в том числе деревья и уступы.",
        "Действует на союзников с иммунитетом к заклинаниям. Не действует на врагов с иммунитетом. Замедление остается, если дебафф был применен до иммунитета и не был развеян."
      ],
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.6,
    "attrStrength": 27.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.0,
    "attrAgility": 15.0
  },
  "description": "Centaur Warrunner, или Брэдводен — это герой с ближним типом атаки, основным атрибутом которого является сила. Естественное место героя в бою - прямо в центре битвы. Способности Centaur Warrunner останавливают врагов вокруг него и наносят огромный урон, что делает героя отличным инициатором. Он также является мощным представителем Стойкости с самым большим приростом силы в игре. Брэдводен обладает огромным естественным здоровьем, а область действия его способностей означает, что герой может вступать в бой и выводить из строя группы врагов одновременно. Hoof Stomp и Double Edge составляют отличную комбинацию оглушения и взрывного урона с быстрой перезарядкой, а Retaliate означает мгновенное возмездие противникам, которые пытаются атаковать героя, а также его ближайших союзников (с надлежащим талантом в поздней стадии игры). Его ультимативная способность, Stampede, эффективно превращает всю команду в инициаторов, даруя им высокую скорость и способность втаптывать врагов, когда они проходят над ними.",
  "history": "Говорят, что жизненный путь кентавра вымощен телами павших. И для кентавра по имени Warrunner этот путь был действительно длинным. Многие чужестранцы ошибочно принимают четырёхногих воинов из кланов Друуда за простоватых громил. У их языка нет письменной формы, культура бедна на графические символы; в музыке нет четкой структуры, а в религии — строгих правил и догм. Для кентавров лучшее выражение их мыслей и чувств — это битва. И если убийство среди кентавров считается искусством, то самый талантливый из их творцов — Брэдводен. Свою несокрушимую мощь он взрастил на землях Омекса, на древней арене, где тысячелетиями кланы кентавров собирались, чтобы провести гладиаторские церемонии. И чем дальше распространялась слава о нём, тем больше зрителей со всего света прибывало, чтобы увидеть великого кентавра в действии. Всегда выходя на арену первым и уходя последним, он создавал шедевры каждым брызгом крови, каждым взмахом окровавленного лезвия. Такова поэзия крови и стали, сложный узор на бледных песках бойни. Warrunner побеждал одного воина за другим до тех пор, пока арена не взрывалась выкриками его имени, и он не становился единственным, несравненным чемпионом. Ему был вручен великий пояс Омекса, но в победе ощущалась лишь пустота. Каков же воин без постоянного вызова? Великий кентавр ускакал из Омекса в тот же день с новой целью. Для своего народа Warrunner — это величайший воин, который ступал на арену. Теперь Warrunner стремится доказать, что он — величайший воин во всей истории.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 сек. оглушения от Hoof Stomp",
      "talentRight": "Retaliate становится аурой"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−20 сек. перезарядки Stampede",
      "talentRight": "+50 к урону от Retaliate"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+40% к урону от силы у Double Edge",
      "talentRight": "+5 к броне"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+5 здоровья в секунду"
    }
  ]
}