{"abilities":[{"effects":["Дальность применения: 500","Радиус обзора: 1600","Атак для разрушения героем: 2","Атак для разрушения не-героем: 8","Прирост золота в минуту: 2","Прирост опыта в минуту: 4","Длительность: 360"],"notes":["Дает наземный обзор в радиусе 1600 вокруг себя.","Нельзя поставить внутри области фонтана (включая маленьку область спереди подьема на базу), или в логове Рошана.","Зажатая клавиша Control позволяет владельцу передать союзнику один вард, вместо всей связки.","Observer Ward нельзя отдать курьеру или Spirit Bear с зажатой клавишей Control.","Observer Ward можно выбирать в цель с помощью вражеских Tango и Quelling Blade (включая его улучшения) для того чтобы мгновенно его уничтожить.","Перед установкой варда отображаются боксы области появления нейтральных крипов, что позволяет блокировать лагеря.","При выборе варда, на карте и мини-карте появляется множество индикаторов. Курсор выбора отображает вард, с зеленым кругов вокруг него. Круг показывает дальность обзора. Мини-карта показывает желтую область, отображая сколько вард раскроет, при установке в выбранную точку. Желтая маркировка учитывает деревья и высоту ландшафта вокруг области."],"elements":["Способность Направленная на область"],"description":"Устанавливает невидимого дозорного — вард, который даёт наземный обзор в радиусе 1600. Действует 6 мин. Можно передать один вард союзному герою, зажав клавишу Ctrl."},{"effects":[],"elements":["Способность Н\/Д"],"description":"Для этой способности нет описания."}],"cost":"75","description":"Вард","further":["Варды"],"attrs":["Уровень 0","Длительность 360","Здоровье 8","Регенерация здоровья 0","Броня 0","Сопротивление магии 0%","Сопротивление эффектам 0%","Размер столкновения 8","Дальность обзора 1600","Тип обзора Наземный","Награда 100","Опыт 25","Размер модели 1","Примечания Сквозной 100% точность при атаке"],"info":["В лавке изначально можно купить 2 Observer Ward с лимитом в 4 штуки. Необходимо 135 секунд для восстановления 1 варда в лавке.","Складывается с такими же и с Sentry Ward в инвентаре. Цена продажи основывается на их количестве. Варды от разных игроков не складываются вместе.","Observer Ward можно передавать.","Observer Ward не дают True Sight."]}