{
  "abilities": [
    {
      "notes": [
        "The lift duration consists of 0.9\/1.2\/1.5\/1.8 seconds static air time and 0.3 seconds landing time",
        "The lifted unit is stunned while in the air and is not affected by the area stun upon landing\n The stun modifier is always placed as a debuff, while the main modifier is based on the alliance of the target\n SHARD NOTES This means the stun can be dispelled with strong dispels when casting on allies or self, while the lift itself cannot\n Since the lift itself does not disable the target, allies can attack, turn, and cast abilities and items during the lift if the stun gets dispelled",
        "While in the air, other units may pass below the lifted unit",
        "When the lift ends prematurely, the lifted unit instantly lands and applies the area stun and damage\n Telekinesis first applies the stun, then the damage",
        "Cannot lift  Roshan, he will be stunned for the lift duration instead",
        "Casting Telekinesis on units affected by  Black Hole,  Chronosphere or  Duel does nothing, wasting the mana and cooldown",
        "With  Arcane Supremacy, Telekinesis has the following cast ranges with  Arcane Supremacy on each level: Level 1: 650\/700\/750\/800 cast range\n Level 2: 675\/725\/775\/825 cast range\n Level 3: 700\/750\/800\/850 cast range\n Level 4: 725\/775\/825\/875 cast range\n  TALENT NOTES The landing damage is also further increased to 199.5\/206.5\/213.5\/220.5",
        "SHARD NOTES Telekinesis uses the reduced cooldown when targeting self or allies, and the regular cooldown when targeting enemies\n ↓↓ Double-tapping automatically targets self\n Can be cast on ally  Couriers\n SPELL STEAL This ability is not acquirable\n MORPH NOTES Can be reflected but not castable on  Rubick"
      ],
      "item_behaviour": [],
      "description": "Rubick uses his telekinetic powers to lift the enemy into the air briefly and then hurls them back at the ground. The unit lands on the ground with such force that it stuns nearby enemies.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.1+0.97",
        "Cast Range:  550\/575\/600\/625",
        "Stun Radius: 325",
        "Lift Duration: 1.2\/1.5\/1.8\/2.1 ( 1.8\/2.1\/2.4\/2.7)",
        "Landing Time: 0.3",
        "Stun Duration: 1.2\/1.4\/1.6\/1.8",
        "Ally Cooldown:  19.6\/18.2\/16.8\/15.4 ( 11.2\/9.8\/8.4\/7)",
        "Landing Damage:  175"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a2\/Rubick_Telekinesis_1.mp3\/revision\/latest?cb=20191216022735",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies ",
        "Damage: "
      ],
      "mana": "28\/26\/24\/22 (TagTalent 16\/14\/12\/10)",
      "aghanim": null,
      "name": "Telekinesis",
      "cooldown": "110",
      "legacy_key": "Z",
      "story": "Even the Grandest Magus may use his powers for enjoyment."
    },
    {
      "notes": [
        "Replaces  Telekinesis when it is cast on an enemy, and stays until the lifted unit lands",
        "Allows Rubick to determine where the lifted enemy will land after the lift duration\n Does not prematurely end the lift",
        "Targeting further than the maximum allowed throw distance throws the enemy 375 ( 615) distance towards the targeted point\n The enemy moves towards the targeted point during the last 0.3 seconds of the lift duration\n Therefore, the speed varies between 0 ‒ 1250 ( 2050), depending on the chosen distance",
        "Can be cast multiple times during the lift\n The enemy lands on the last chosen location\n When cast while the target is already being moved to a previously targeted point, it continues moving to that previous point\n However, upon reaching it, the target is instantly teleported to the last targeted location",
        "The center of the targeted area is marked with green particles, which are visible to allies only",
        "Destroys trees within 325 radius of the lifted target upon landing",
        "Rubick is unable to level Telekinesis up while this sub-ability is active"
      ],
      "item_behaviour": [],
      "description": "Chooses the location the target will land when Telekinesis finishes.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.1+1.07",
        "Cast Range: Global",
        "Max Throw Distance: 375 ( 615)",
        "Stun Radius: 325",
        "Landing Time: 0.3",
        "Stun Duration: 1.2\/1.4\/1.6\/1.8"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Telekinesis Land",
      "cooldown": "0",
      "legacy_key": "Z",
      "story": null
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Replaces  Telekinesis when it is cast on an ally or on self, and stays until the lifted unit lands",
        "Allows Rubick to determine where the lifted ally or himself will land\n Reduces the remaining lift duration to 0.5 when used\n Cannot be cast on allies who have ☐ Disabled Help from Rubick",
        "Targeting further than the maximum allowed throw distance throws the ally 693.75 ( 1137.75) distance towards the targeted point\n The ally moves towards the targeted point during the last 0.3 seconds of the lift duration\n Therefore, the speed varies between 0 ‒ 2312.5 ( 3792.5), depending on the chosen distance",
        "When cast, the ability turns inactive, so it can be only cast once",
        "Can be used while stunned, cycloned, slept, taunted, hidden, or during Forced Movement",
        "Cannot be used only while silenced, hexed, prevented from acting or upon death\n Rubick cannot ⇧ Shift-queue this ability",
        "The center of the targeted area is marked with green particles, which are visible to allies only",
        "Destroys trees within 325 radius of the lifted target upon landing",
        "Rubick is unable to level Telekinesis up while this sub-ability is active"
      ],
      "item_behaviour": [],
      "description": "Chooses the location you will land when Telekinesis finishes.",
      "hot_key": "Q",
      "params": [
        "Cast Animation:  0+0",
        "Cast Range: Global",
        "Max Throw Distance: 693.75 ( 1137.75)",
        "Stun Radius: 325",
        "Throw Delay: 0.5",
        "Landing Time: 0.3",
        "Stun Duration: 1.2\/1.4\/1.6\/1.8"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies \/ Allies"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Telekinesis Land (Aghanim's Shard)",
      "cooldown": "0",
      "legacy_key": "Z",
      "story": null
    },
    {
      "notes": [
        "Fade Bolt has no bounce limit\n Bounces in 0.25-second intervals\n Each bounce decreases the bolt's current damage by 6%\n Does not bounce on invisible units or units in the Fog of War\n Can never hit the same unit twice per cast",
        "Reduces the main attack damage of affected units\n Bonus attack damage is not reduced",
        "The total damage up to the first 5 bounces deal on each level are 443.5\/776.1\/1108.7\/1441.4\n Fade Bolt will take 75\/84\/90\/94 bounces to reach 1 damage",
        "The bolt first applies the damage, then the debuff",
        "With  Arcane Supremacy, Fade Bolt has a total cast range of 900\/950\/1000\/1050\n At Level 4, it also increases the base damage to 126\/220.5\/315\/409.5\n SPELL STEAL This ability is not acquirable"
      ],
      "item_behaviour": [],
      "description": "Rubick creates a powerful stream of arcane energy that travels between enemy units, dealing damage and reducing their attack damage. Each jump deals less damage.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0.93",
        "Cast Range:  800",
        "Bounce Distance: 440",
        "Number of Bounces: Infinite",
        "Base Damage: 100\/175\/250\/325",
        "Bounce Damage Reduction: 6%",
        "Attack Damage Reduction: 14%\/21%\/28%\/35% ( 26%\/33%\/40%\/47%)",
        "Duration: 10"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Rubick_Fade_Bolt_1.mp3\/revision\/latest?cb=20191216022739",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "16\/14\/12\/10 (TagTalent 11\/9\/7\/5)",
      "aghanim": null,
      "name": "Fade Bolt",
      "cooldown": "120\/130\/140\/150",
      "legacy_key": "X",
      "story": "Rubick's favorite spell for dispatching would-be assassins is a rather simple conjuration."
    },
    {
      "notes": [
        "Applies generic outgoing damage amplification on Rubick\n Stacks additively with other sources of generic outgoing damage manipulation\n The amplification affects only spell damage Rubick deals that are not flagged as HP removal\n Arcane Supremacy further increases the spell amplification for abilities stolen by  Spell Steal  talent up to a total of 54%\/58%\/62%\/66%"
      ],
      "item_behaviour": [],
      "description": "Rubick's mastery of the arcane allows him to have a larger cast range and increased potency.",
      "hot_key": "E",
      "params": [
        "Cast Range Bonus: 100\/150\/200\/250",
        "Outgoing Spell Damage Amp: 14%\/18%\/22%\/26%"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Arcane Supremacy",
      "cooldown": null,
      "legacy_key": "N",
      "story": "Not every magus can be a Grand Magus..."
    },
    {
      "notes": [
        "The cooldown and charges of stolen abilities are saved\n Re-acquiring an ability does not reset its previous cooldown or charges, with some exceptions listed here\n Rubick gets the same initial charges when the ability is learned for charge-based abilities\n Cooldown reseting effects have no effect on the cooldowns of abilities Rubick currently does not have",
        "Sets the cast point to for stolen abilities if the stolen ability's original cast point is higher than the set value\n However, this does not affect abilities with 0 cast point\n The following abilities tagged with DOTA_ABILITY_BEHAVIOR_NORMAL_WHEN_STOLEN do not get their cast point modified upon acquired:  Terrorize,  God's Rebuke,  Poof,  Boundless Strike,  Teleportation,  Requiem of Souls,  Assassinate and  Blast Off!\n For   Assassinate, once the item is equipped, it no longer uses the cast point for acquired abilities since the upgrade changes the cast point",
        "The stolen ability's cast backswing is equal to the original ability's",
        "The stolen ability's channeling notes fully apply",
        "Abilities granted by <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter and <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard are considered stand-alone abilities, and can be acquired without having the respective item equipped",
        "Any illusion creating abilities create illusions of Rubick based on the intended visual appearance, and not of the original hero",
        "For ability interactions with summoned and  Dominated units, the following rules generally apply: Units with limited duration (e.g\n  Holy Persuasion and  Chaotic Offering etc.) are not killed upon losing the ability\n Units with permanent duration (e.g\n  Summon Familiars are killed upon losing the ability unless stated otherwise",
        "Stolen channeling abilities usually end prematurely when he loses them during channeling, which has the same effect as being interrupted during channeling\n However, there are a few exceptions as listed here",
        "Since  Spell Steal can only be cast on heroes, non-hero abilities from neutral creeps (i.e\n  Ensnare) cannot be directly acquired, unless with the following conditions:  Doom casts the gained ability from  Devour\n  Clinkz casts the gained ability from   Death Pact\n The acquired neutral abilities use the original cast point of the neutral creeps they come from\n However, the cast backswing differs depending on the ability acquired (see chart)\n EXPR Cast point: Original Cast Point of Acquired Ability Cast backswing: 1.37 - OriginalCastPoint, 0 when OriginalCastPoint ≥ 1.37"
      ],
      "item_behaviour": [],
      "description": "Spells acquired by Spell Steal will replace this slot.",
      "hot_key": "D",
      "params": [
        "Set Cast Point: 0.15",
        "Neutral Abilities Cast Backswing Penalty: 1.37"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Stolen Spell 1",
      "cooldown": null,
      "legacy_key": "?",
      "story": null
    },
    {
      "notes": [
        "Sub-abilities from abilities are automatically acquired (e.g\n  Ethereal Jaunt), take up this slot, and cannot be manually stolen\n Linked abilities are not acquired",
        "For transformation abilities (e.g\n  Shapeshift), Rubick uses the transformation time of the ability and is not transformed instantly\n Multiple transformation abilities can be stolen, and their bonuses and\/or reductions fully stack with each other\n Attack range definitions from their ability notes fully apply\n Items that use different values for  melee and  ranged heroes (e.g\n <span image=\"items\/manta_style\/full.webp\">[Manta Style]<\/span> Manta Style) to now treat Rubick's ranged type based on the ability notes\n If a stolen transformation ability benefits illusions, they will do so when illusions of Rubick are created, no matter how many transformation abilities are stacked\n Visually, Rubick is transformed into a smaller version of the original, and into the form of the last cast transformation ability\n Except for  Metamorphosis, which has priority over every other transformational ability\n This also applies to attack projectiles\n If the ability expires, the previous cast's attack projectiles will be used"
      ],
      "item_behaviour": [],
      "description": "Spells acquired by Spell Steal will replace this slot.",
      "hot_key": "F",
      "params": [
        "Set Cast Point: 0.15"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Stolen Spell 2",
      "cooldown": null,
      "legacy_key": "?",
      "story": null
    },
    {
      "notes": [
        "A full list of unique interactions with Spell Steal can be found here",
        "The stolen ability travels as a projectile toward Rubick at a speed of 1200\n Rubick gains the new ability and loses the previously stolen ability as the projectile reaches him",
        "Cannot have more than 1 ( 2) stolen ability at a time\n When already having two abilities stolen, stealing a new ability replaces the older ability\n New stolen abilities are always placed in the fourth ability slot\n The previously stolen ability is moved to the fifth slot in the process, while the previous ability in the fifth slot is lost\n All stolen abilities are lost upon death",
        "Cannot steal passive abilities, item abilities, or active attack modifiers (except  Walrus PUNCH!)\n Cannot steal the following abilities:  Primal Companion,  Stone Remnant,  Quas,  Wex,  Exort,  Invoke,   Divided We Stand,  Mischief,  Morph,  Rearm,  Minefield Sign and  Stone Form\n Can only acquire abilities from heroes and clones\n Cannot acquire abilities from any illusions, despite being able to cast Spell Steal on the   Vengeance Illusion,   Fiend's Grip Illusions or  Decoy illusion\n When cast on the aforementioned illusions above, Spell Steal consumes mana and goes on a cooldown\n If a passive ability gains an active component through an   ability upgrade, Rubick may steal the ability\n Neither acquires innate abilities (e.g\n  Aghanim's Scepter Synth) nor ability traits (e.g\n being able to attack  Nightmared units)",
        "Cannot steal toggleable abilities while the ability is being toggled Off\n Grants the previous cast ability if the toggled-off ability is the last cast ability",
        "The stolen ability's level is based on its level on the enemy as it was stolen\n The level only updates upon stealing it again\n The target's <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter and <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard are not considered, Rubick always steals the non-upgraded form\n However, if Rubick has Aghanim's Scepter or Aghanim's Shard, the stolen abilities do get upgraded\n  Talent upgrades are not copied and cannot be acquired in any way",
        "The debuff duration amplification only affects the duration of debuffs of stolen abilities placed on enemies\n A debuff is identified by the red border on the status icon\n It follows the same rules as status resistance, and stacks multiplicatively with other sources",
        "Has a cast range of 1100\/1150\/1200\/1250 ( 1500\/1550\/1600\/1650) with  Arcane Supremacy on each level",
        "TALENT NOTES The spell damage amplification  talent only amplifies the outgoing spell damage of stolen abilities\n The cooldown reduction  talent only affects the cooldown of stolen abilities\n SOULBIND Only can acquire abilities from the primary target"
      ],
      "item_behaviour": [],
      "description": "Rubick studies the trace magical essence of one enemy hero, learning the secrets of the last spell the hero cast. Rubick can use this spell as his own for several minutes or until he dies.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.1+0.93",
        "Cast Range:  1000 ( 1400)",
        "Max Stolen Spells: 1 ( 2)",
        "Stolen Spell Cast Time: 0.15",
        "Stolen Spell Debuff Duration Amp: 10%\/20%\/30%",
        "Spell Duration: 180\/240\/300",
        "Stolen Spell Cooldown Reduction:  25%",
        "Stolen Spell Damage Amp:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Rubick_Spell_Steal_1.mp3\/revision\/latest?cb=20191216022733",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Heroes"
      ],
      "mana": "20\/12\/4",
      "aghanim": null,
      "name": "Spell Steal",
      "cooldown": "25",
      "legacy_key": "Q",
      "story": "...but even their lesser magics can be a source of much utility."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 2.5,
    "attrAgility": 23.0
  },
  "description": "Steals the spells of his enemies to use against them. A renowned duelist among sorcerers, Rubick ascended to the title of Grand Magus through the careful elimination of his rivals. Accustomed to assassins, Rubick reacts by lifting attackers off the ground with his mind using Telekinesis to fling them where he will. Arcane Supremacy amplifies his every spell, while enemy arms falter being struck with Fade Bolt. No magic is beyond the reach of the Grand Magus. Rubick replicates enemy specialties and their most unique advantage against them, Stealing and deciphering their secrets, while improving and making it his own, before turning them back towards their owners.  Support Disabler Nuker ★★★",
  "trivia": [
    "In both DotA and Dota 2, he is the son of Aghanim. He also possesses an imitation of Aghanim's Scepter as one of his cosmetic items.",
    "Upon using Walrus PUNCH!, Rubick launches a projectile of himself, spinning and with head ahead, towards the target. When his target is Tusk, the overhead text on the target reads \"Sucker Punch!\" in green colors. The text reads \"Stolen Punch! on other targets.",
    "Rubick is named after Ernő Rubik, the Hungarian inventor who designed the \"Magic Cube\" (now more commonly called as the \"Rubik's Cube\"), a popular combination puzzle. His response, Link▶️ \"Now, where's my cube?\", and his cosmetic item, Staff of Perplex, are also references to the Rubik's Cube.",
    "In DotA, Rubick couldn't steal several spells due to several reasons: Transformation spells caused various issues, so they all could not be stolen. The following abilities are transformation spells and thus unstealable in DotA: Chemical Rage, God's Strength, Elder Dragon Form, Shapeshift, Flesh Golem, Flak Cannon, True Form, Berserker's Rage, Split Shot, Metamorphosis, Spirit Form, Firefly and Arctic Burn Besides transformation spells, several other spells could also not be stolen due to either engine errors or other coding conflicts: Morph, Summon Spirit Bear, Spin Web, Soul Assumption, Refraction, Borrowed Time, Overcharge, Spirits, Insatiable Hunger, Devour, Fire Remnant, Activate Fire Remnant, Rolling Boulder and Tempest Double Since DotA only uses legacy hotkeys, he could not steal any spell which uses the hotkey X, Z and Q. The following abilities could not be stolen due to hotkey conflicts: X: X Marks the Spot, Shadowraze (Medium), Tornado, Exorcism Z: Shadowraze (Near), Alacrity Q: None",
    "Transformation spells caused various issues, so they all could not be stolen. The following abilities are transformation spells and thus unstealable in DotA: Chemical Rage, God's Strength, Elder Dragon Form, Shapeshift, Flesh Golem, Flak Cannon, True Form, Berserker's Rage, Split Shot, Metamorphosis, Spirit Form, Firefly and Arctic Burn",
    "Chemical Rage, God's Strength, Elder Dragon Form, Shapeshift, Flesh Golem, Flak Cannon, True Form, Berserker's Rage, Split Shot, Metamorphosis, Spirit Form, Firefly and Arctic Burn",
    "Besides transformation spells, several other spells could also not be stolen due to either engine errors or other coding conflicts: Morph, Summon Spirit Bear, Spin Web, Soul Assumption, Refraction, Borrowed Time, Overcharge, Spirits, Insatiable Hunger, Devour, Fire Remnant, Activate Fire Remnant, Rolling Boulder and Tempest Double",
    "Morph, Summon Spirit Bear, Spin Web, Soul Assumption, Refraction, Borrowed Time, Overcharge, Spirits, Insatiable Hunger, Devour, Fire Remnant, Activate Fire Remnant, Rolling Boulder and Tempest Double",
    "Since DotA only uses legacy hotkeys, he could not steal any spell which uses the hotkey X, Z and Q. The following abilities could not be stolen due to hotkey conflicts: X: X Marks the Spot, Shadowraze (Medium), Tornado, Exorcism Z: Shadowraze (Near), Alacrity Q: None",
    "X: X Marks the Spot, Shadowraze (Medium), Tornado, Exorcism",
    "Z: Shadowraze (Near), Alacrity",
    "Q: None",
    "Due to Rubick's nature of using spells of other heroes, he has many custom animations for a lot of spells. He has custom animations for all spells of the following heroes, and for the following individual spells: Anti-Mage, Crystal Maiden, Dark Willow, Earthshaker, Lina, Monkey King, Nature's Prophet, Omniknight, Queen of Pain, Shadow Fiend, Sniper, Storm Spirit, Sven, Ursa and Venomancer. Culling Blade, Brain Sap, Fiend's Grip, Firefly, Wild Axes, Primal Roar, Wall of Replica, Black Hole, Blade Fury, Omnislash, Earth Spike, Mana Drain, Finger of Death, Leap, Void, Crippling Fear, Dark Ascension, Shield Crash, Rolling Thunder, Meat Hook, Dismember, Life Drain, Burrowstrike, Charge of Darkness, Nether Strike, Ravage, Tree Grab, Tree Throw, Viper Strike, Shackleshot, Powershot, Windrun, Arctic Burn and Death Ward. All other spells share 2 generic animations and 1 generic channel animation.",
    "Anti-Mage, Crystal Maiden, Dark Willow, Earthshaker, Lina, Monkey King, Nature's Prophet, Omniknight, Queen of Pain, Shadow Fiend, Sniper, Storm Spirit, Sven, Ursa and Venomancer.",
    "Culling Blade, Brain Sap, Fiend's Grip, Firefly, Wild Axes, Primal Roar, Wall of Replica, Black Hole, Blade Fury, Omnislash, Earth Spike, Mana Drain, Finger of Death, Leap, Void, Crippling Fear, Dark Ascension, Shield Crash, Rolling Thunder, Meat Hook, Dismember, Life Drain, Burrowstrike, Charge of Darkness, Nether Strike, Ravage, Tree Grab, Tree Throw, Viper Strike, Shackleshot, Powershot, Windrun, Arctic Burn and Death Ward.",
    "All other spells share 2 generic animations and 1 generic channel animation."
  ],
  "history": "Any mage can cast a spell or two, and a few may even study long enough to become a wizard, but only the most talented are allowed to be recognized as a Magus. Yet as with any sorcerer's circle, a sense of community has never guaranteed competitive courtesy. Already a renowned duelist and scholar of the grander world of sorcery, it had never occurred to Rubick that he might perhaps be Magus material until he was in the midst of his seventh assassination attempt. As he casually tossed the twelfth of a string of would-be killers from a high balcony, it dawned on him how utterly unimaginative the attempts on his life had become. Where once the interruption of a fingersnap or firehand might have put a cheerful spring in his step, it had all become so very predictable. He craved greater competition. Therefore, donning his combat mask, he did what any wizard seeking to ascend the ranks would do: he announced his intention to kill a Magus. Rubick quickly discovered that to threaten one Magus is to threaten them all, and they fell upon him in force. Each antagonist's spell was an unstoppable torrent of energy, and every attack a calculated killing blow. But very soon something occurred that Rubick's foes found unexpected: their arts appeared to turn against them. Inside the magic maelstrom, Rubick chuckled, subtly reading and replicating the powers of one in order to cast it against another, sowing chaos among those who had allied against him. Accusations of betrayal began to fly, and soon the sorcerers turned one upon another without suspecting who was behind their undoing. When the battle finally drew to a close, all were singed and frozen, soaked and cut and pierced. More than one lay dead by an ally's craft. Rubick stood apart, sore but delighted in the week's festivities. None had the strength to argue when he presented his petition of assumption to the Hidden Council, and the Insubstantial Eleven agreed as one to grant him the title of Grand Magus.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-12s Telekinesis Cooldown",
        "talent_left": "+40% Spell Amp For Stolen Spells"
      },
      {
        "talent_lvl": "20",
        "talent_right": "-5s Fade Bolt Cooldown",
        "talent_left": "+240 Telekinesis Land Distance"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-25% Stolen Spells Cooldown",
        "talent_left": "+0.6s Telekinesis Lift Duration"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+175 Telekinesis Landing Damage",
        "talent_left": "-12% Fade Bolt Damage Reduction"
      }
    ]
  }
}