{
  "abilities": [
    {
      "notes": [
        "Spirit Lance travels at a speed of 1000",
        "The lance first applies the debuff, then the damage",
        "The illusion only spawns when the projectile successfully hits and damages or slows the target",
        "The illusion spawns at different distances, at a random spot around the affected target, depending on the caster and target's collision size as follows: The illusion spawns 58 range away from the target if both the caster and target have a collision size of 8. The illusion spawns 87 range away from the target if either the caster or the target has a collision size of 24",
        "All illusions owned by Phantom Lancer within 675 range of Phantom Lancer also cast a fake Spirit Lance. They play the whole cast animation and release their fake lances at the same time the real lance is released. When illusions currently are not having any order and are standing still, they turn to face the target and cast the fake lances. When illusions are moving or attacking, they continue to do so and do not turn to face the target. They still play the cast animation, overriding their move or attack animations. When canceling the cast, the illusions still play the full cast animation, but do not release the fake lances. The fake lances do not interact with anything and do nothing on impact",
        "Illusions created by Spirit Lance have a static 5  and 5XP bounty which does not scale with levels",
        "SHARD NOTES The projectile bounces on another unit, prioritizing heroes, within a 750 radius. Treat illusions and creep-heroes as heroes. Does not bounce on invisible units or units in the Fog of War. Can never hit the same unit twice per cast. If the current target turns invulnerable or hidden, it does not bounce upon the projectile reaching them. All bounces together can deal up to 200\/320\/440\/560 damage (before reductions)"
      ],
      "item_behaviour": [],
      "description": "Sends a magical spirit lance to a target enemy unit that damages and slows, while summoning an illusory phantom to attack the unit.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.73",
        "Cast Range:  600\/650\/700\/750",
        "Number of Targets: 1 ( 2)",
        "Damage: 100\/160\/220\/280 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 150\/210\/270\/330)",
        "Move Speed Slow: 14%\/21%\/28%\/35%",
        "Illusion Damage Dealt: 20% ( 60%)",
        "Illusion Damage Taken: 400%",
        "Illusion Duration: 2\/4\/6\/8",
        "Slow Duration: 3.75",
        "Bounce Distance:  750"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/25\/Phantom_Lancer_Spirit_Lance_1.mp3\/revision\/latest?cb=20191216021801",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "7 (TagTalent 5)",
      "aghanim": null,
      "name": "Spirit Lance",
      "cooldown": "120",
      "legacy_key": "T",
      "story": "Azwraith's proficiency at spearing his family's meal of fish is proving quite useful in the battlefield."
    },
    {
      "notes": [
        "Doppelganger disjoints projectiles and applies a basic dispel on Phantom Lancer and his affected illusions upon cast",
        "Phantom Lancer and his affected illusions are invulnerable and hidden during the reappear delay. They are prevented from acting and it cannot be interrupted during the reappear delay. Any order given during it is queued as the next order. It cannot be interrupted by anything except death. When getting teleported (e.g. with  Glimpse), Phantom Lancer still appears at the targeted area",
        "Phantom Lancer and the 2 created illusions face the direction Phantom Lancer was facing upon cast. Other illusions which got gathered keep their previous facing angle. Phantom Lancer and his illusions reappear in a formation shaped like a plus, with a bit of variation. Illusions that were moving or attacking a target continue to move or attack their target after reappearing. Destroys trees within 150 radius of Phantom Lancer and every affected illusion upon reappearing",
        "All illusions gathered with Doppelganger get their duration increased. The 2 illusions created with this cast are not affected by this. The duration extension happens upon cast, so they effectively gain 1 second extra duration, since it takes 1 second for the illusions and Phantom Lancer to reappear. However, illusions that are invulnerable and hidden while Doppelganger is cast are not gathered, and their duration are not extended",
        "The normal-damage-taking and no-damage-dealing illusion is brighter and can be distinguished by Phantom Lancer and his allies from other illusions",
        "The 600% damage-taking and 20% damage-dealing illusion looks like any other illusion Phantom Lancer can create to enemies",
        "Illusions created by Doppelganger have a static 5  and 5XP bounty which does not scale with levels"
      ],
      "item_behaviour": [],
      "description": "Phantom Lancer briefly vanishes from the battlefield. After 1 second, Phantom Lancer and any of his nearby illusions reappear at a random position within the targeted location, along with two additional doppelgangers. Extends duration of all illusions. The two added doppelgangers have different properties: one takes normal damage and deals none, while the other takes 500% bonus damage and deals 80% less damage.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range:  575",
        "Reappear Radius: 325",
        "Illusion Gather Radius: 900",
        "Reappear Delay: 1",
        "Number of Illusions: 2",
        "First Illusion Damage Dealt: 0%",
        "First Illusion Damage Taken: 100%",
        "Second Illusion Damage Dealt: 20%",
        "Second Illusion Damage Taken: 600%",
        "Gathered Illusion Duration Extension: 2",
        "Doppelganger Illusion Duration: 8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/57\/Phantom_Lancer_Doppelganger.mp3\/revision\/latest?cb=20191216021754",
      "effects": [
        "Ability: Target Area",
        "Affects: Self"
      ],
      "mana": "19\/16\/13\/10 (TagTalent 15\/12\/9\/6)",
      "aghanim": null,
      "name": "Doppelganger",
      "cooldown": "50",
      "legacy_key": "D",
      "story": "Dread Magus Vorn's death imbued the Phantom Lancer with the ability to blend with all spectrums of light."
    },
    {
      "notes": [
        "Can be toggled On to not activate",
        "Requires a direct attack order (A or  Right Click) to trigger. Auto-attacks or ground-targeted orders do not trigger Phantom Rush",
        "Phantom Rush can trigger on any target, including wards and buildings, except allied units",
        "Disarm or ethereal effects on Phantom Lancer do not prevent him from rushing. However, attack immune units (e.g. invulnerable, ethereal) cannot be targeted",
        "Upon triggering, Phantom Lancer receives the rush buff, which grants haste and phased movement. This buff lasts for up to 5 seconds, until Phantom Lancer successfully hits the rush target, or until he receives another order. Non-targeted items do not cancel the rush. ↓↓ Double-tapping item abilities count as self-targeting and therefore cancel the rush. The rush buff is also lost when Phantom Lancer gets stunned, cycloned, slept, hexed or hidden. Roots do not cause Phantom Lancer to lose the buff, and he continues rushing once the effect expires. Taunts cause Phantom Lancer to rush towards the taunting unit instead, without making him lose the buff. Forced attacks caused by taunts do not make him lose it either. Fear does not make him lose the buff either so he flees with the rush speed. When the target turns hidden, invisible, or moves into the Fog of War, Phantom Lancer rushes towards the unit's last known location",
        "Phantom Lancer gains the  agility buff as soon as he loses the rush buff. It does not matter how he loses the rush buff, the agility buff is always gained. Therefore, if the distance between Phantom Lancer and his target is less than the min proc distance, Phantom Lancer will neither receive the rush buff nor rushes to the target. The agility buff is directly granted in this case. Effectively grants Phantom Lancer 1.67\/3.33\/5\/6.67 main armor, 10\/20\/30\/40 attack speed and main attack damage bonus"
      ],
      "item_behaviour": [],
      "description": "When targeting an enemy for an attack, Phantom Lancer quickly charges into range, gaining a temporary agility boost. Phantom Lancer's illusions also have this ability.",
      "hot_key": "E",
      "params": [
        "Min Proc Distance: 200",
        "Max Proc Distance: 600\/675\/750\/825 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 900\/975\/1050\/1125)",
        "Haste Speed: 800",
        "Agility Bonus: 10\/20\/30\/40",
        "Max Haste Duration: 5",
        "Agility Duration: 1.5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 4)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Phantom_Lancer_Phantom_Rush.mp3\/revision\/latest?cb=20191216021800",
      "effects": [
        "Ability: Toggle",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Phantom Rush",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Azwraith knows that on the field of battle, speed can mean everything."
    },
    {
      "notes": [
        "The chance to spawn illusions only triggers upon attacking, including instant attacks",
        "The proc chance neither requires mana nor has a cooldown despite visually having one. The mana cost and cooldown are for the  Ability Upgrade",
        "Works against attacking wards, but not buildings",
        "Juxtapose uses pseudo-random distribution",
        "Illusions created by Juxtapose attack the target that the ability was triggered upon. This means that illusions created by Juxtapose use  Phantom Rush when their target is in the correct range",
        "Illusions created by Juxtapose have a static 5  and 5XP bounty which does not scale with levels",
        "The illusion spawns 72 range away from Phantom Lancer, appearing either north, east, south, or west from him",
        "Juxtapose works for all illusions that have this passive ability, no matter the owner or illusion creator, it is not exclusive only to Phantom Lancer's abilities. This includes illusions created with items (e.g.  Manta Style) or with other abilities (e.g.  Reflection). This means that even enemy illusions of Phantom Lancer have a chance to spawn new ones for the owner of the illusion",
        "SCEPTER NOTES Adds an active component to Juxtapose with the passive effects still present. Still does not interrupt Phantom Lancer's channeling abilities upon proc. Upon cast, all currently existing Juxtapose illusions, including invulnerable and hidden ones, are instantly destroyed. Spawns the illusions in 0.05-second intervals, starting immediately upon cast, resulting in a total spawn duration of 0.35\/0.45\/0.55 seconds. The illusions spawn in a random location within the spawn radius. Does not destroy illusions not owned by Phantom Lancer (e.g.  Enchanted illusion) this way"
      ],
      "item_behaviour": [],
      "description": "Phantom Lancer has a chance to fracture his presence, creating an illusion of himself. Illusions also have a chance to fracture further. Illusions created from Phantom Lancer last for 8 seconds, while illusions created from other illusions last 4 seconds.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0.54",
        "Hero Proc Chance: 40%\/45%\/50%",
        "Illusion Proc Chance: 8%",
        "Max Illusions: 6\/8\/10 ( 8\/10\/12)",
        "Illusion Damage Dealt: 22% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 32%)",
        "Illusion Damage Taken: 650%",
        "Illusion Duration (from Hero): 8",
        "Illusion Duration (from Illusion): 4",
        "Active Spawn Radius:  550",
        "Active Illusion Duration:  18"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": "40",
      "aghanim": null,
      "name": "Juxtapose",
      "cooldown": "75",
      "legacy_key": "X",
      "story": "Each of Azwraith's lance attacks feels like two from a normal warrior; or three; or four..."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 19.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.2,
    "attrAgility": 26.0
  },
  "description": "Creates illusions of himself to trick or attack foes. As Azwraith drove his pike through Vorn, the Dread Magus shattered into innumerable shards of light, saturating his killer with a strange new power. Once a humble fisherman, the Phantom Lancer Spears targets from afar, spawning a fragment of the Phantom Lancer himself as they Dash ahead while cutting foes apart in a breathtaking flurry of attacks. When cornered, he vanishes briefly from the battlefield, reappearing at a nearby spot while leaving behind Doppelgangers to mislead and elude pursuers. The sheer number of his army are often Juxtaposed with his foes, overwhelming them before their eyes can scarcely distinguish the Phantom Lancer from his army of clones.  Carry Escape Pusher Nuker ★★☆",
  "trivia": [
    "In DotA, Phantom Lancer's in-game model was a fan interpretation of Kimahri Ronso, a playable character in the RPG game Final Fantasy X. As such, the Phantom Lancer of Dota 2 gained many similarities with Kimahri, namely the blue skin, humanoid feline appearance, and halberd weapon.",
    "Phantom Lancer's model shares design similarities with, and may have been based on earlier concepts of Monkey King."
  ],
  "history": "The remote village of Pole had no knowledge of the wars raging in the heart of the kingdom. For them, the quiet of spear fishing, and a family meal were all that a full life required. Yet war came for them nonetheless. Joining the able-bodied conscripts as they filed passed their homes, the humble lancer Azwraith vowed to bring peace to his kingdom, and in so doing, his people. Placed with his kin in the vanguard of the final assault against the Dread Magus Vorn, the cost to his fellows was absolute. As the charging force battled toward the fortress, Azwraith alone among his kind remained standing, and he alone was able to infiltrate the keep. Focused and infuriated by the slaughter of his brothers, Azwraith bested each of the wizard's deadly traps and conjured guardians. Soon the simple fisherman arrived at Vorn's tower sanctum. The pair dueled through the night, pike to staff, as chaos raged below, and with a deafening cry Azwraith pierced his enemy. But the wizard did not simply expire; he exploded into uncountable shards of light, penetrating his killer with power. As the dust settled and the smoke of combat began to clear, Azwraith found himself standing among a throng of his kin. Each seemed to be dressed as he was, each seemed armed as he was, and he could sense that each thought as he did. Aware that his allies were approaching, he willed these phantoms to hide themselves, and one by one they began to vanish into nothingness. As the soldiers came upon the sanctum, they found the warrior that had bested the wizard. When they approached their champion, the lancer vanished. The pikeman who had stood before them was no more than another phantom.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-4s Doppelganger CD",
        "talent_left": "+24% Critical Strike (200%)"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+300 Phantom Rush Range",
        "talent_left": "+10% Juxtapose Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+15 Strength",
        "talent_left": "-2s Spirit Lance CD"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+50 Spirit Lance Damage",
        "talent_left": "+2.5s Phantom Rush Bonus Agi Duration"
      }
    ],
    "notes": [
      "The strength talent effectively grants Phantom Lancer 300 health and 1.5 health regeneration bonus.",
      "Critical Strike from talents is not disabled by Break. The critical strike increases attack damage by an average of 24%. The proc chances of multiple critical sources stack. If two sources of critical strike proc at the same time, the higher crit multiplier has priority.",
      "The critical strike increases attack damage by an average of 24%.",
      "The proc chances of multiple critical sources stack. If two sources of critical strike proc at the same time, the higher crit multiplier has priority."
    ]
  }
}