{
  "abilities": [
    {
      "notes": [
        "Несколько источников процентного уменьшения перезарядки не складываются. Приоритет имеет высшее значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+2 к числу вызываемых волков",
          "talentRight": "+32% к шансу крита от Shapeshift"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+25% к урону от Feral Impulse",
          "talentRight": "+6 сек. действия Shapeshift"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−15% перезарядки заклинаний",
          "talentRight": "+200 к здоровью волков"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+13 к урону волков",
          "talentRight": "+10 здоровья в секунду от Feral Impulse"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Lycan_Summon_Wolves.mp3\/revision\/latest?cb=20191216015828",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Использование этого заклинания заменит уже существующих волков на новых.",
        "Волки призываются в 200 единицах от Lycan, расстояние между ними составляет 120 единиц. Lycan считается за центр расположения.",
        "Волки получают Cripple на 3-ем уровне и Invisibility - на 4-ом.",
        "Уже призванные волки не усилятся c новым уровнем способности. Существа получат обновленные характеристики только после перепризыва.",
        "В форме Shapeshift остаточная анимация равна 0,6."
      ],
      "mana": "145",
      "hotKey": "Q",
      "cooldown": "30 (TagTalent 25.5)",
      "description": "Призывает двух волков, которые будут сражаться на стороне героя. Волки 3-4 уровней обладают Cripple, а волки 4 уровня обладают постоянной невидимостью.",
      "spellName": "Summon Wolves",
      "params": [
        "Анимация применения: 0,3+0,73",
        "Число волков: 2 (TagTalent 4)",
        "Длительность: 55"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b1\/Lycan_Howl_1.mp3\/revision\/latest?cb=20191216015832",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Дебафф не складывается сам с собой, поэтому враг, попавший под действие двух источников, получает только один дебафф.",
        "Lycan и волки применяют эффект одновременно.",
        "Снижение урона от атак действует только на базовый урон и урон, даваемый основным атрибутом существ. Дополнительный урон не снижается."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "18 (TagTalent 15,3)",
      "description": "Нагоняет ужас в радиусе 2000 от владельца способности и его волков, уменьшая врагам броню и урон от атак.",
      "spellName": "Howl",
      "params": [
        "Анимация применения: 0,3+0",
        "Радиус: 2000",
        "Снижение урона от атак: 25%\/30%\/35%\/40%",
        "Снижение брони: 4\/5\/6\/7",
        "Длительность: 5\/6\/7\/8"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Себя"
      ],
      "notes": [
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом существ. Дополнительный урон не увеличивается.",
        "Действует на всех подконтрольных существ, а не только на самого героя и его волков.",
        "Восстанавливает до 120\/240\/360\/480 (TagTalent 12120\/12240\/12360\/12480) здоровья за минуту.",
        "Бафф ауры задерживается на 0,5 сек.",
        "Иллюзии Lycan, прирученные с помощью Enchant, не дают бонусов Enchantress и ее подконтрольным существам; сама же иллюзия бонус сохраняет.",
        "Но в то же время иллюзии Lycan, созданные другими заклинаниями (TagTalent Disruption, Wall of Replica, Reflection) дают баффы своим создателям и их существам."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Увеличивает урон и восстановление здоровья у героя и всех подконтрольных ему существ.",
      "spellName": "Feral Impulse",
      "params": [
        "Радиус: 1200",
        "Доп. урон: 14%\/26%\/38%\/50% (TagTalent 39%\/51%\/63%\/75%)",
        "Доп. регенерация здоровья: 2\/4\/6\/8 (TagTalent 202\/204\/206\/208)",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "I",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Lycan_Shapeshift.mp3\/revision\/latest?cb=20191216015834",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Во время трансформации герой не может ничего делать. Прервать трансформацию нельзя.",
        "Увеличивает ночной обзор Lycan до 1800.",
        "Превращает заклинателя в существо ближнего боя на всю длительность (важно для Wolf Bite и режима Ability Draft).",
        "Скорость передвижения и критический удар предоставлены глобальной аурой, которая действует на всех подконтрольных Lycan существ. Эффект ауры задерживается на 0,1 сек.",
        "Увеличение скорости передвижения — это ускорение, поэтому затронутых существ нельзя замедлить ниже установленного способностью значения.",
        "В среднем критическая атака увеличивает урон героя и всех подконтрольных существ на 20%\/30%\/40% (TagTalent 36%\/54%\/72%).",
        "Шансы срабатывания от нескольких источников критического удара сочетаются. Если одновременно срабатывают два источника, то приоритет будет у большего модификатора.",
        "Если одновременно срабатывают два источника, то приоритет будет у большего модификатора.",
        "Критическая атака использует псевдослучайное распределение.",
        "Shapeshift отменяется при смерти."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "125\/110\/95 (TagTalent 106,25\/93,5\/80,75)",
      "description": "Герой принимает волчью форму. Во время действия этой способности её владелец и все существа под его контролем двигаются с увеличенной скоростью, не могут быть замедлены, получают увеличенный обзор ночью и шанс в 40% совершить критическую атаку, наносящую 150%\/175%\/200% урона.",
      "spellName": "Shapeshift",
      "params": [
        "Анимация применения: 0+0",
        "Время трансформации: 1,25",
        "Доп. обзор ночью: 1000",
        "Скорость ускорения: 650",
        "Шанс критического удара: 40% (TagTalent 72%)",
        "Критический урон: 150%\/175%\/200%",
        "Длительность задержки ауры: 0,1",
        "Длительность: 22 (TagTalent 28)",
        "Дарует новую способность: Wolf Bite. Герой кусает союзника, наделяя его бонусами от способности Shapeshift.",
        "Иллюзии получают собственный бафф Shapeshift, длящийся столько же, сколько и его обычная длительность. Они получают бонусы от эффектов ауры (TagTalentскорость передвижения и критический удар), но не распространяют их. Красные цифры критического урона отображаются до учета уменьшения урона от иллюзий и брони. Также они получают доп. ночной обзор."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Lycan_Shapeshift.mp3\/revision\/latest?cb=20191216015834",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. В режиме Ability Draft Wolf Bite может быть разблокирована игроком, выбравшим Shapeshift.",
        "В режиме Ability Draft Wolf Bite может быть разблокирована игроком, выбравшим Shapeshift.",
        "Применяет к союзнику все эффекты Shapeshift, включая время трансформации, ночной обзор, критический удар и скорость. Также дает ауру скорости, то есть все существа, принадлежащие укушенной цели, получают такие же бонусы, что и существа Lycan. Но при этом вампиризм делится только между заклинателем и укушенным. Существа его не получают.",
        "Также дает ауру скорости, то есть все существа, принадлежащие укушенной цели, получают такие же бонусы, что и существа Lycan.",
        "Но при этом вампиризм делится только между заклинателем и укушенным. Существа его не получают.",
        "Дает обычный и общий вампиризм заклинателю и укушенному союзнику. То есть кто бы из них не атаковал, лечение всегда получают оба. Усиление вампиризма так же влияет на общий вампиризм, но только если владелец усиления — излечиваемое существо.",
        "То есть кто бы из них не атаковал, лечение всегда получают оба.",
        "Усиление вампиризма так же влияет на общий вампиризм, но только если владелец усиления — излечиваемое существо.",
        "Вампиризм дается сразу при применении и для него не нужно завершение трансформации.",
        "Для общего вампиризма заклинатель и цель должны находится на расстоянии 1200 друг от друга. Обычный вампиризм действует независимо от расстояния.",
        "Если Shapeshift не изучена, то союзная цель потратит время на трансформацию, но не превратится. То есть способность просто оглушает союзника и дает как ему, так и заклинателю вампиризм на 1,25 секунды. С изученным талантом 20-го уровня на длительность Shapeshift союзник трансформируется на 6 секунд, получая вампиризм, но не скорость, ночной обзор или критический удар.",
        "То есть способность просто оглушает союзника и дает как ему, так и заклинателю вампиризм на 1,25 секунды.",
        "С изученным талантом 20-го уровня на длительность Shapeshift союзник трансформируется на 6 секунд, получая вампиризм, но не скорость, ночной обзор или критический удар."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "80 (TagTalent 68)",
      "description": "Герой кусает союзника, наделяя его бонусами от способности Shapeshift. Они с целью получают 30% вампиризма и восстанавливают друг другу здоровье от нанесённого урона, если находятся на расстоянии не более 1200.",
      "spellName": "Wolf Bite",
      "params": [
        "Анимация применения: 0,3+0,73",
        "Радиус вампиризма: 1200",
        "Вампиризм: 30%",
        "Общий вампиризм: 30%",
        "Иллюзии получают собственный бафф Shapeshift, длящийся столько же, сколько и его обычная длительность. Они получают бонусы от эффектов ауры (TagTalentскорость передвижения и критический удар), но не распространяют их. Красные цифры критического урона отображаются до учета уменьшения урона от иллюзий и брони. Также они получают доп. ночной обзор."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Lycan_Wolf_Cripple.mp3\/revision\/latest?cb=20191216015830",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Требует Summon Wolves 4-го уровня для разблокировки. Доступная для волков 4-го уровней.",
        "Доступная для волков 4-го уровней.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после срабатывания, срабатывая 4 раза.",
        "Может нанести до 32 урона цели (до учета сопротивления).",
        "Несколько срабатываний на ту же цель не складываются, но их длительность обновляется.",
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Может сработать на союзных существ. Не работает на постройки и варды."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Каждая атака имеет шанс покалечить цель в 20%, уменьшая ее скорость атаки на 15% и каждую секунду нанося 8 урона в течение 60 сек.",
      "spellName": "Cripple",
      "params": [
        "Шанс: 20%",
        "Урон в секунду: 8",
        "Замедление скорости передвижения: 15%",
        "Замедление скорости атаки: 60",
        "Длительность: 4",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Требует Summon Wolves 3-го уровня для разблокировки. Доступная для волков 3-го и 4-го уровней.",
        "Доступная для волков 3-го и 4-го уровней.",
        "Невидимость исчезает при нанесении атаки. Промахнувшиеся атаки или атака по предметам не отменят её.",
        "Нельзя проходить сквозь других существ."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Пока волк не атакует, он невидим.",
      "spellName": "Invisibility",
      "params": [
        "Задержка до невидимости: 1,7",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 26.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 1.0,
    "attrAgility": 16.0
  },
  "description": "Lycan — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Summon Wolves, призывает двух волков, которые будут сражаться на стороне Lycan. Вторая способность, Howl, уменьшает броню и урон врагов в радиусе 2000 от Lycan и его волков. Пассивная способность, Feral Impulse, увеличивает урон и регенерацию здоровья Lycan и также дает этот эффект всем подконтрольным ему юнитам. Ультимативной способностью, Shapeshift, Lycan принимает свою истинную форму, в которой он может наносить критические удары и обладает ночным зрением. Во время действия этой способности Lycan и все существа под его контролем двигаются с увеличенной скоростью и не могут быть замедлены.",
  "history": "Бейнхаллоу был одним из наследников благородного дома Эмбри, величайшего землевладельческого рода королевства Слом. До Падения дом Эмбри первым восстал против ненасытного короля, чьи желания становились всё страннее и страннее, в то время как двор заполоняли колдуны и шарлатаны. Не желая больше платить вассальскую дань, Эмбри послали в столицу шеститысячную армию, но её перерезали в сражении, названном позже «Бойней отступников». Тогда старое выражение показало свою настоящую шкуру: когда метишь в шею королю, лучше рубить сразу всю голову. Разъярённый предательством король истребил всякого живущего Эмбри, оставив жизнь лишь лорду и его младшему сыну, Бейнхаллоу. Опозоренный лорд был прикован к узорчатому мраморному полу королевской залы, и монарх приказал своим волшебникам превратить мальчика в волка, чтобы тот разодрал глотку своему же отцу. «Сделайте это, — сказал король, — чтобы Лорд Эмбри осознал, как остры зубы предательства». Были призваны сильнейшие магические силы, и тело ребенка исказилось. Однако, хоть тело Бейнхаллоу больше и не было человеческим, его душа никак не изменилась — и вместо того, чтобы разодрать шею беззащитного отца, он набросился на прислугу монарха. Прежде чем волка наконец-то смогли выгнать в тишь ночи, он разорвал на клочки дюжину королевских рыцарей. Лорд Эмбри, всё ещё в кандалах, смеялся, даже когда его тело пронзил королевский меч. Ныне Бейнхаллоу — наследник потерянного дома Эмбри, бродящий по миру под именем Lycan. Наполовину воин, наполовину волк, он ищет возмездия за всё то, что потерял.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+2 к числу вызываемых волков",
      "talentRight": "+32% к шансу крита от Shapeshift"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+25% к урону от Feral Impulse",
      "talentRight": "+6 сек. действия Shapeshift"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−15% перезарядки заклинаний",
      "talentRight": "+200 к здоровью волков"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+13 к урону волков",
      "talentRight": "+10 здоровья в секунду от Feral Impulse"
    }
  ]
}