{
  "abilities": [
    {
      "notes": [
        "Талант на дальность применения не влияет на дальность отскоков Chain Frost.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Неограниченное количество отскоков у Chain Frost",
          "talentRight": "Frost Shield восстанавливает 50 здоровья в секунду"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+4 сек. действия Frost Shield",
          "talentRight": "+100 к урону от Chain Frost"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-3 сек. перезарядки Frost Blast",
          "talentRight": "+100 к урону"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+90 к урону по области от Frost Blast",
          "talentRight": "+100 к дальности заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Lich_Frost_Blast.mp3\/revision\/latest?cb=20191216015318",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Перекрестие указателя должно выделять вражеское существо.",
        "Урон по области наносится до урона по цели.",
        "Основная цель получает как базовый урон, так и урон по области, получая в итоге 125\/200\/275\/350 (TagTalent 215\/290\/365\/440) единиц урона (до уменьшений).",
        "Frost Blast сначала наносит урон, затем применяет дебафф."
      ],
      "mana": "105\/130\/155\/180",
      "hotKey": "Q",
      "cooldown": "7 (TagTalent 4)",
      "description": "Обдаёт указанного врага морозом, нанося урон в области действия и замедляя передвижение и атаку всех задетых противников на 4 секунды. Основная цель получает как базовый урон, так и урон по площади.",
      "spellName": "Frost Blast",
      "params": [
        "Анимация применения: 0,4+0,93",
        "Дальность применения: 600 (TagTalent 700)",
        "Радиус: 200",
        "Урон по основной цели: 50\/100\/150\/200",
        "Урон по области: 75\/100\/125\/150 (TagTalent 165\/190\/215\/240)",
        "Замедление скорости передвижения: 30%",
        "Замедление скорости атаки: 30",
        "Длительность замедления: 4",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется только основной целью. Частицы всё равно отображаются."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Маг льда Этриан не забыл даже простейших манипуляций со льдом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/59\/Lich_Frost_Shield_1.mp3\/revision\/latest?cb=20191216015320",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов"
      ],
      "notes": [
        "Можно применить на любое союзное существо, включая строения и неуязвимых, но исключая варды.",
        "Существа под баффом получают сопротивление к урону от атак. Способность не дает сопротивление к физическому урону. То есть щит снижает получаемый урон от атаки любого типа, но не взаимодействует с физическим уроном заклинаний.",
        "То есть щит снижает получаемый урон от атаки любого типа, но не взаимодействует с физическим уроном заклинаний.",
        "Срабатывает с интервалом в 1 сек. спустя 1 сек. после применения, испуская 6 (TagTalent 10) импульсов.",
        "Все импульсы наносят до 120\/180\/240\/300 (TagTalent 200\/300\/400\/500) урона врагу (до уменьшений).",
        "Импульс сначала наносит урон, затем применяет дебафф замедления.",
        "Повторные применения на одну и ту же цель не складываются, но обновляют длительность и сбрасывают интервал импульсов.",
        "Талант 25-го уровня добавляет к Frost Shield регенерацию здоровья. Восстановление так же действует на строения. Восстанавливает до 300 (TagTalent 500) здоровья за всю длительность.",
        "Восстанавливает до 300 (TagTalent 500) здоровья за всю длительность."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "W",
      "cooldown": "30\/25\/20\/15",
      "description": "Накладывает на цель магический ледяной щит, уменьшая урон от атак по ней. Пока щит действует, он раз в 1 сек. наносит немного магического урона вражеским существам вокруг и замедляет их.",
      "spellName": "Frost Shield",
      "params": [
        "Анимация применения: 0,2+0,93",
        "Дальность применения: 1000 (TagTalent 1100)",
        "Радиус: 600",
        "Уменьшение урона от атак: 30%\/40%\/50%\/60%",
        "Доп. регенерация здоровья: 0 (TagTalent 50)",
        "Интервал: 1",
        "Урон: 20\/30\/40\/50",
        "Замедление скорости передвижения: 20%\/25%\/30%\/35%",
        "Длительность замедления: 0,5",
        "Длительность щита: 6 (TagTalent 10)",
        "Можно применить к союзникам с иммунитетом к заклинаниям. Не действует на врагов с иммунитетом. Замедление остается, если дебафф был применен до иммунитета и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Магия, которая защищала Этриана ещё в смертной жизни, с годами стала лишь морознее."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Lich_Sinister_Gaze.mp3\/revision\/latest?cb=20191216015322",
      "effects": [
        "Способность Направленная на существо \/ Произносимая",
        "Действует на Врагов"
      ],
      "notes": [
        "Гипнотизирует цель, заставляя двигаться к Lich и запрещая действия.",
        "Приравнивает скорость передвижения цели к 32%\/38%\/44%\/50% от расстояния между ней и Lich. При использовании на максимальной дальности применения скорость передвижения равна 100\/105\/110\/115 (TagTalent 120\/125\/130\/135).",
        "При использовании на максимальной дальности применения скорость передвижения равна 100\/105\/110\/115 (TagTalent 120\/125\/130\/135).",
        "Скорость устанавливается при применении. Если цель передвинули или телепортировали, то скорость не адаптируется.",
        "Вытягивает 0,625%\/0,789%\/0,909%\/1% от текущей маны с интервалом в 0,1 секунды сразу после начала произнесения, срабатывая 17\/20\/23\/26 раз. Вытягивает до 10,11%\/14,66%\/18,95%\/23% от текущей маны цели, если больше ничего с маной не происходило.",
        "Вытягивает до 10,11%\/14,66%\/18,95%\/23% от текущей маны цели, если больше ничего с маной не происходило.",
        "Не дает никакого обзора на цель. При этом уход в невидимость или туман войны не отменяет Sinister Gaze.",
        "Позволяет цели перемещаться по непроходимой территории, поэтому она может двигаться через возвышенности, деревья и других существ.",
        "Aghanim's Scepter превращает Sinister Gaze в заклинание, направленное на область, поэтому существ больше нельзя выбрать напрямую. Не захватывает невидимых существ или существ в тумане войны.",
        "Не захватывает невидимых существ или существ в тумане войны."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "E",
      "cooldown": "24\/22\/20\/18",
      "description": "Гипнотизирует вражеское существо, отчего оно идёт к определённой точке в направлении владельца способности и отдаёт ему долю от текущей маны.",
      "spellName": "Sinister Gaze",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 500\/525\/550\/575 (TagTalent 600\/625\/650\/675)",
        "Радиус: 0 (TagAghanim 400)",
        "Дальность передвижения: 32%\/38%\/44%\/50%",
        "Кража текущей маны: 10%\/15%\/20%\/25%",
        "Длительность: 1,6\/1,9\/2,2\/2,5",
        "Позволяет применять эту способность по площади."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Держи голову в холоде..."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Lich_Ice_Spire_1.mp3\/revision\/latest?cb=20201230173953",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов"
      ],
      "notes": [
        "Для разблокировки требуется Aghanim's Shard.",
        "Chain Frost может отскакивать, но не воспринимает сосульку, как полноценную цель. Может отскакивать от сосульки только в случае, если рядом с целью нет других допустимых целей. Отскоки по-прежнему полностью засчитываются в число отскоков. Отскакивает только от союзных сосулек. Вражеские игнорируются. Если несколько сосулек находятся в пределах досягаемости, он выбирает один наугад. Может перескакивать меж двумя сосульками, если поблизости нет других целей.",
        "Может отскакивать от сосульки только в случае, если рядом с целью нет других допустимых целей.",
        "Отскоки по-прежнему полностью засчитываются в число отскоков.",
        "Отскакивает только от союзных сосулек. Вражеские игнорируются.",
        "Если несколько сосулек находятся в пределах досягаемости, он выбирает один наугад.",
        "Может перескакивать меж двумя сосульками, если поблизости нет других целей.",
        "Frost Shield полностью работает на Ледяной шпиль, применяя все эффекты."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "25",
      "description": "Создаёт в указанной точке сосульку, которая замедляет всех врагов в радиусе 600 на 20%. У сосульки 600 здоровья, и она существует 15 секунд. Шар от способности Chain Frost может отскакивать к сосульке, если поблизости нет врагов. На сосульку можно применить способность Frost Shield.",
      "spellName": "Ice Spire",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 750",
        "Радиус: 600",
        "Замедление передвижения: 20%",
        "Задержка перед эффектом: 0,5",
        "Длительность: 15",
        "Замедление сохраняется, если было наложено до получения иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Lich_Chain_Frost_1.mp3\/revision\/latest?cb=20191216015315",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета Chain Frost - 850.",
        "Снаряд отскакивает с задержкой в 0,2 сек.",
        "Может отскочить от одного и того же существа несколько раз, но только в случае, если между отскоками была поражена другая цель.",
        "Не отскакивает от Undying Zombie и существ, находящихся вне зоны обзора (т.е. невидимых, неуязвимых или исчезнувших).",
        "Отскакивает от Рошана, но не замедляет и не наносит ему урона. Только начальное попадение по нему наносит урон и замедляет.",
        "Chain Frost сначала применяет дебафф, затем наносит урон.",
        "Ниже указано, сколько урона наносит каждый отскок на каждом уровне (до уменьшений): Уровень 1: 250 \/ 265 \/ 280 \/ 295 \/ 310 \/ 325 \/ 340 \/ 355 \/ 370 \/ 385 \/ 400 Уровень 2: 400 \/ 420 \/ 440 \/ 460 \/ 480 \/ 500 \/ 520 \/ 540 \/ 560 \/ 580 \/ 600 Уровень 3: 550 \/ 575 \/ 600 \/ 625 \/ 650 \/ 675 \/ 700 \/ 725 \/ 750 \/ 775 \/ 800",
        "Уровень 1: 250 \/ 265 \/ 280 \/ 295 \/ 310 \/ 325 \/ 340 \/ 355 \/ 370 \/ 385 \/ 400",
        "Уровень 2: 400 \/ 420 \/ 440 \/ 460 \/ 480 \/ 500 \/ 520 \/ 540 \/ 560 \/ 580 \/ 600",
        "Уровень 3: 550 \/ 575 \/ 600 \/ 625 \/ 650 \/ 675 \/ 700 \/ 725 \/ 750 \/ 775 \/ 800",
        "Ниже указано, сколько урона наносит каждый отскок на каждом уровне с талантом на дополнительный урон (до уменьшений): Уровень 1: 350 \/ 365 \/ 380 \/ 395 \/ 410 \/ 425 \/ 440 \/ 455 \/ 470 \/ 485 \/ 500 Уровень 2: 500 \/ 520 \/ 540 \/ 560 \/ 580 \/ 600 \/ 620 \/ 640 \/ 660 \/ 680 \/ 700 Уровень 3: 650 \/ 675 \/ 700 \/ 725 \/ 750 \/ 775 \/ 800 \/ 825 \/ 850 \/ 875 \/ 900",
        "Уровень 1: 350 \/ 365 \/ 380 \/ 395 \/ 410 \/ 425 \/ 440 \/ 455 \/ 470 \/ 485 \/ 500",
        "Уровень 2: 500 \/ 520 \/ 540 \/ 560 \/ 580 \/ 600 \/ 620 \/ 640 \/ 660 \/ 680 \/ 700",
        "Уровень 3: 650 \/ 675 \/ 700 \/ 725 \/ 750 \/ 775 \/ 800 \/ 825 \/ 850 \/ 875 \/ 900",
        "Снаряд дает летающий обзор в радиусе 800. Обзор не дается в момент задержки отскока в 0,2 сек.",
        "Chain Frost перестает давать обзор и проигрывать звук от попадания в существ не-героев при отпрыгивании между ними более 60 раз."
      ],
      "mana": "200\/325\/500",
      "hotKey": "R",
      "cooldown": "100\/80\/60",
      "description": "Создаёт ледяной шар, который отскакивает от противников до 10 раз, замедляя их и нанося им урон, увеличивающийся с каждым скачком.",
      "spellName": "Chain Frost",
      "params": [
        "Анимация применения: 0,3+1,03",
        "Дальность применения: 750 (TagTalent 850)",
        "Радиус отскока: 600",
        "Число отскоков: 10 (TagTalent Бесконечно)",
        "Задержка отскока: 0,2",
        "Начальный урон: 250\/400\/550 (TagTalent 350\/500\/650)",
        "Увеличение урона за отскок: 15\/20\/25",
        "Замедление скорости передвижения: 65%",
        "Замедление скорости атаки: 65",
        "Длительность замедления: 2,5",
        "Считает целью и отскакивает от врагов с иммунитетом к заклинаниям. Не замедляет и не пытается нанести урон врагам с иммунитетом. Замедление остается, если дебафф был применен до иммунитета и не был развеян.",
        "Блокируется при применении или попадании только основной целью. При блокировке при применении способность действует на основной цель и продолжает отскакивать. При блокировке попадания способность продолжит отскакивать без влияния на основную цель."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Ледяной шар Этриана повсеместно считается вершиной мастерства в магии льда, вгоняя страх в любого, кто осмелится встать на пути колдуна."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 20.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 4.1,
    "attrAgilityInc": 2.0,
    "attrAgility": 15.0
  },
  "description": "Lich — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Frost Blast, вызывает вокруг указанного врага ледяной взрыв, который наносит урон и замедляет всех врагов в области. Первичная цель получает наибольший урон. Вторая способность, Frost Shield укрепляет оборону своей команды поглощающим урон щитом, одновременно выпуская замедляющие импульсы льда, чтобы либо отпугнуть врагов, либо догнать их в погоне. Третья способность, Sinister Gaze, заставляет вражеского героя двигаться к Lich в течении короткого промежутка времени. Ультимативная способность, Chain Frost, бросает ледяной шар в противника, который отскакивает от противников до 10 раз, замедляя их и нанося им урон. Первая цель кратковременно оглушается. Улучшение с Aghanim's Scepter превращает Sinister Gaze в заклинание, направленное на область, поэтому существ больше нельзя выбрать напрямую.",
  "history": "Маг льда Этриан, тогда ещё живой, порабощал целые королевства, угрожая им разрушительной мощью льда. Однажды его подданные, заручившись помощью нескольких отчаявшихся магов, нашли в себе смелость устроить на него покушение. Они намертво связали колдуна зачарованными цепями, прикрепили к ним адамантовые гири и сбросили его в озеро, которое считали бездонным. Они ошибались. Целый год Этриан опускался глубже и глубже, пока не зацепился за скалистый выступ. Там он и остался висеть, мёртвый, но не разлагающийся. Спустя многие годы геомант Анхил решил проверить, действительно ли бездонно легендарное Чёрное озеро. Отвес, что Анхил опускал в воду, зацепил связанного Этриана, и геомант вытащил из озера нежданную добычу. Думая, что у воскрешённого мертвяка можно будет выведать что-нибудь об озере, Анхил снял с трупа оковы и провёл простой ритуал возрождения. Даже потомки врагов Этриана остались в веках, поэтому никто не мог предупредить Анхила о неблагоразумии такого поступка. Впрочем, он осознал свою ошибку в мгновение ока, когда воскрешённый маг отбросил цепи и поглотил его.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Неограниченное количество отскоков у Chain Frost",
      "talentRight": "Frost Shield восстанавливает 50 здоровья в секунду"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+4 сек. действия Frost Shield",
      "talentRight": "+100 к урону от Chain Frost"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-3 сек. перезарядки Frost Blast",
      "talentRight": "+100 к урону"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+90 к урону по области от Frost Blast",
      "talentRight": "+100 к дальности заклинаний"
    }
  ]
}