{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1500.",
        "Применяет к цели оцепенение, препятствуя её движению и использованию определенных заклинаний для передвижения. Дает эффект True Sight на цель, если она не была в невидимости или не уходила в нее при попадании.",
        "Дает эффект True Sight на цель, если она не была в невидимости или не уходила в нее при попадании.",
        "Действует на существ в тумане войны, но не дает на них обзор.",
        "Повторные применения на цель не складываются, но обновляют длительность."
      ],
      "mana": "200",
      "abilityName": "Ethernal Chains",
      "cooldown": "18",
      "description": "Накладывает оцепенение на всех врагов в радиусе 450 и наносит им 220 урона.",
      "params": [
        "Дальность применения: 1100",
        "Длительность оцепенения: 2",
        "Радиус: 450",
        "Урон: 220",
        "Оцепенение остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Mjollnir_Chain_Lightning.mp3\/revision\/latest?cb=20191227195502",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Не сочетается с Chain Lightning от Maelstrom, Mjollnir или других Gleipnir.",
        "При наличии нескольких предметов со способностью Chain Lightning, работать будет тот, который был первым в инвентаре.",
        "Молнии отскакивают с интервалом в 0,25 сек., поэтому попадание по всем целям займет 2,75 сек.",
        "Срабатывает на невидимых существ или существ в тумане войны, но не перескакивает на них.",
        "Никогда не поражает дважды одно и то же существо за срабатывание.",
        "Все отскоки наносят до 2040 урона (до уменьшений).",
        "Может сработать, даже если активны молнии от предыдущего срабатывания.",
        "Не срабатывает, если владелец мертв. При этом может сработать, если мертва цель.",
        "При этом может сработать, если мертва цель.",
        "Chain Lightning использует псевдослучайное распределение.",
        "Атаки, активировавшие Chain Lightning, не могут промахнуться.",
        "Бафф «Gleipnir» — скрытый и необходим для скачков молний.",
        "Chain Lightning не использует обычную перезарядку. Она не отображается на иконке предмета при срабатывании и на нее не действует эффекты, манипулирующие перезарядкой."
      ],
      "mana": null,
      "abilityName": "Chain Lightning",
      "cooldown": "0,2",
      "description": "Каждая атака с вероятностью в 30% может создать разряд цепной молнии, которая 12 раз перескочит между случайными врагами в радиусе 650, нанося каждому по 170 магического урона. От атаки с цепной молнией нельзя уклониться.",
      "params": [
        "Шанс срабатывания: 30%",
        "Дальность отскоков: 650",
        "Число отскоков: 12",
        "Интервал отскока: 0,25",
        "Урон: 170"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6150",
  "lore": null,
  "consistFrom": [
    "Maelstrom",
    "Rod of Atos",
    "Recipe"
  ],
  "boughtFrom": "Магия",
  "name": "Gleipnir",
  "description": "Оковы, созданные невозможным способом, чтобы сдержать древнее зло.",
  "trivia": [
    "В скандинавской мифологии Глейпнир — цепь, которой сковали волка Фенрира, сына Локи и Ангрбоды."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+12 к силе",
    "+12 к ловкости",
    "+20 к интеллекту",
    "+30 к урону"
  ],
  "tips": null
}