{
  "abilities": [
    {
      "notes": [
        "Талант на ловкость в общем даёт Weaver: 1 брони, 6 скорости атаки и 6 урона от атаки.",
        "Талант на силу в общем даёт Weaver: 220 здоровья и 1,1 регенерации здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 атака от Geminate Attack",
          "talentRight": "+160 к скорости передвижения от Shukuchi"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+2 атаки для убийства жука от The Swarm",
          "talentRight": "-0,4 снижения брони от The Swarm"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+11 к силе",
          "talentRight": "+15 к сожжению маны"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+6 к ловкости",
          "talentRight": "+60 урона от Shukuchi"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Weaver_The_Swarm_1.mp3\/revision\/latest?cb=20191216030509",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "The Swarm движется со скоростью в 600 единиц, достигая за 5 секунд максимальной дистанции.",
        "Жуков нельзя атаковать в рое, пока они не зацепятся за цели.",
        "У жуков наивысший приоритет для цели автоатаки — как и у фантома Grimstroke.",
        "Жуки появляются в радиусе 300 единиц от Weaver (в случайном месте) и движутся вперед роем.",
        "Если вражеское существо находится в радиусе 100 единиц от жуков, один из них цепляется за цель, если на ней его ещё нет. То есть несколько применений не могут действовать на одно и то же существо одновременно. Жуки могут цепляться за неуязвимых существ, но не за невидимых или спрятанных. Если цель жука спряталась после его зацепления, то жук все равно останется. Если цель жука стала невидимой после его зацепления, то жук мгновенно умрет (смерть никому не зачтется), если только существо не находится под действием True Sight. Если жуки находятся под действием Chronosphere, то они мгновенно умирают, а их смерть никому не засчитывается.",
        "То есть несколько применений не могут действовать на одно и то же существо одновременно.",
        "Жуки могут цепляться за неуязвимых существ, но не за невидимых или спрятанных.",
        "Если цель жука спряталась после его зацепления, то жук все равно останется.",
        "Если цель жука стала невидимой после его зацепления, то жук мгновенно умрет (смерть никому не зачтется), если только существо не находится под действием True Sight.",
        "Если жуки находятся под действием Chronosphere, то они мгновенно умирают, а их смерть никому не засчитывается.",
        "Жуки цепляются за существ на расстоянии до 3400 единиц (складывается из радиуса появления, дистанции прохождения и радиуса цепляния).",
        "В зацепленном состоянии жуки всегда находятся в 64 единицах перед существом.",
        "Фактически жуки не атакуют цели, а применяют к ним заклинание, наносящее урон с установленным интервалом. То есть источником урона является сам Weaver, поэтому на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть источником урона является сам Weaver, поэтому на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "Снижение брони не связано с уроном. Жуки продолжают снижать урон существам в призрачной форме, но не неуязвимым целям. Снижение брони применяется непосредственно жуками, поэтому оно исчезает с их смертью.",
        "Снижение брони применяется непосредственно жуками, поэтому оно исчезает с их смертью.",
        "Жук атакует цель каждые 1.15\/1\/0.85\/0.7 секунды сразу после зацепления за существа, атакуя 14\/17\/19\/23 раз.",
        "Снижение брони срабатывает с тем же интервалом, что и урон, но применяется до нанесения урона.",
        "The Swarm наносит до 252\/340\/418\/552 урона каждому задетому врагу (до уменьшений).",
        "Снижает броню до 14\/17\/19\/23 (TagTalent 19,6\/23,8\/26,6\/32,2) единиц каждому существу.",
        "Урон от The Swarm может быть снижен блокировкой урона, но способность игнорирует уклонение.",
        "Жуки дают летающий обзор, пока движутся по прямой или прикреплены к существам."
      ],
      "mana": "110",
      "hotKey": "Q",
      "cooldown": "44\/36\/28\/20",
      "description": "Герой выпускает рой из 12 жуков, которые цепляются за врагов на своём пути. Жуки наносят урон и снижают броню цели до тех пор, пока не умрут.",
      "spellName": "The Swarm",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 3000",
        "Макс. дистанция прохождения: 3000",
        "Радиус появления жуков: 300",
        "Радиус зацепления жуков: 100",
        "Число жуков: 12",
        "Атак героев для убийства: 4 (TagTalent 6)",
        "Атак не-героев для убийства: 8 (TagTalent 12)",
        "Интервал урона: 1.15\/1\/0.85\/0.7",
        "Урона за интервал: 18\/20\/22\/24",
        "Снижение брони за срабатывание: 1 (TagTalent 1.4)",
        "Длительность: 16",
        "Получение иммунитета к заклинаниям не уничтожает уже прицепившихся жуков."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Скитскур разрывает материю пространства и времени, пропуская через прореху молодых жуков, что помогут в битве."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Weaver_Shukuchi.mp3\/revision\/latest?cb=20191216030508",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Shukuchi не прерывает произносимые заклинания Weaver.",
        "При применении невидимость позволяет избегать снаряды, если враги не обладают эффектом True Sight.",
        "За применение наносит урон каждому существу лишь один раз.",
        "Применяет к Weaver ускорение, поэтому его нельзя замедлить.",
        "Также на время дает Weaver сквозное передвижение и убирает ограничение максимума скорости.",
        "В отличии от других заклинаний невидимости, позволяющих проходить сквозь существ, Shukuchi дает возможность Weaver мгновенно проходить через них без ожидания полной невидимости.",
        "Во время ухода в невидимость Weaver может использовать способности и предметы и совершать атаки без выхода из невидимости.",
        "Невидимость прерывается при достижении анимации применения заклинаниями или предметами или атаке цели.",
        "Weaver может поднимать или выкидывать предметы без выхода из невидимости.",
        "Если талант 25-го уровня был выбран пока действует Shukuchi, то дополнительная скорость передвижение применится мгновенно."
      ],
      "mana": "70",
      "hotKey": "W",
      "cooldown": "12\/10\/8\/6",
      "description": "Герой уходит из зоны видимости, что позволяет ему проходить через существ с увеличенной скоростью, игнорируя ограничение на её максимум. Врагам, через которых он проходит, наносится урон.",
      "spellName": "Shukuchi",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0,25",
        "Радиус урона: 175",
        "Урон: 100\/125\/150\/175 (TagTalent 160\/185\/210\/235)",
        "Доп. скорость передвижения: 200\/220\/240\/260 (TagTalent 360\/380\/400\/420)",
        "Длительность: 4"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Когда ткачи плели материю мироздания, маленькие пространственно-временные туннели позволяли им скользить сквозь время, чтобы лучше выполнять свою работу."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Weaver_Geminate_Attack.mp3\/revision\/latest?cb=20191216030516",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Позволяет Weaver совершить мгновенную атаку по цели спустя 0,25 секунды после основной. То есть дополнительная атака - это обычная атака, использующая скорость полета снаряда Weaver в 900 единиц. Также на неё могут сработать, как и на обычную атаку, любые модификаторы атаки или любые эффекты, срабатывающие при атаке. Если Weaver ослеплен, дополнительная атака может промахнутся, кроме случая, когда у него есть эффект True Strike. Также удары могут промахнутся из-за уклонения. Мгновенные атаки Geminate Attack не выводят из невидимости от Smoke of Deceit. Дополнительный урон применяется только к дополнительным атакам.",
        "То есть дополнительная атака - это обычная атака, использующая скорость полета снаряда Weaver в 900 единиц.",
        "Также на неё могут сработать, как и на обычную атаку, любые модификаторы атаки или любые эффекты, срабатывающие при атаке.",
        "Если Weaver ослеплен, дополнительная атака может промахнутся, кроме случая, когда у него есть эффект True Strike. Также удары могут промахнутся из-за уклонения.",
        "Мгновенные атаки Geminate Attack не выводят из невидимости от Smoke of Deceit.",
        "Дополнительный урон применяется только к дополнительным атакам.",
        "Дополнительная атака автоматически запускается спустя 0,25 секунды после запуска основной. Не имеет значения, промахнулась ли основная атака или нет. Для второй атаки нет лимита по дальности. Если цель переместилась достаточно далеко до запуска дополнительной атаки, то она все равно запустится. Даже если основная атака убила цель до срабатывания дополнительной, вторая атака выберет в качестве цели мертвое существо. Для атаки Weaver должен быть жив.",
        "Не имеет значения, промахнулась ли основная атака или нет.",
        "Для второй атаки нет лимита по дальности. Если цель переместилась достаточно далеко до запуска дополнительной атаки, то она все равно запустится.",
        "Даже если основная атака убила цель до срабатывания дополнительной, вторая атака выберет в качестве цели мертвое существо.",
        "Для атаки Weaver должен быть жив.",
        "Действует на вражеские строения, курьера и варды, за исключением Варды."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Позволяет герою наносить несколько ударов одной атакой.",
      "spellName": "Geminate Attack",
      "params": [
        "Задержка: 0,25",
        "Число доп. атак: 1 (TagTalent 2)",
        "Доп. урон: 10\/25\/40\/55"
      ],
      "itemBehaviour": [],
      "legacyKey": "K",
      "story": "В какой-то мере Скитскур существует вне понятия времени, отчего его действия видят - и чувствуют - совсем не единожды."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Weaver_Time_Lapse.mp3\/revision\/latest?cb=20191216030512",
      "effects": [
        "Способность Ненаправленная (TagAghanim Направленная на существо)",
        "Действует на Себя (TagAghanim Союзных героев)"
      ],
      "notes": [
        "При применении Time Lapse позволяет избегать снаряды и применяет сильное развеивание.",
        "Weaver получает приказ на отмену действий после возвращения. При этом очередь команд не отменяется.",
        "Влияет только на местоположение, здоровье, ману и дебаффы Weaver. Баффы не снимаются.",
        "Не важно, как долго на Weaver действовали дебаффы, они развеиваются, если их можно убрать.",
        "Time Lapse не наносит урон Weaver, а совершает манипуляции с его здоровье, поэтому способность не взаимодействует с любыми эффектами, реагирующими на урон.",
        "При использовании сразу после возрождения здоровье, мана и местоположение героя устанавливаются на те значения, которое были до его смерти. То есть Time Lapse не убивает применившего, если способность использовали сразу после возрождения.",
        "То есть Time Lapse не убивает применившего, если способность использовали сразу после возрождения.",
        "С Aghanim's Scepter Time Lapse превращается в направляемое на существо заклинание, которым можно выбирать союзных героев. Двойное нажатие на способность с Aghanim's Scepter автоматически применит её к Weaver. Применяет к союзной цели сильное развеивание и позволяет избегать снаряды. Не отдает приказ на отмену действий, поэтому произносимые способности не прерываются. Именно поэтому у улучшенной способности есть остаточная анимация. При использовании на недавно возрожденного союзника его здоровье, мана и местоположение не возвращается к тем, что были до смерти. То есть союзника после возрождения нельзя отправить обратно к месту смерти, в отличии от Weaver.",
        "Двойное нажатие на способность с Aghanim's Scepter автоматически применит её к Weaver.",
        "Применяет к союзной цели сильное развеивание и позволяет избегать снаряды.",
        "Не отдает приказ на отмену действий, поэтому произносимые способности не прерываются. Именно поэтому у улучшенной способности есть остаточная анимация.",
        "При использовании на недавно возрожденного союзника его здоровье, мана и местоположение не возвращается к тем, что были до смерти.",
        "То есть союзника после возрождения нельзя отправить обратно к месту смерти, в отличии от Weaver."
      ],
      "mana": "150\/75\/0",
      "hotKey": "R",
      "cooldown": "70\/55\/40 (TagTalent 20)",
      "description": "Герой перемещается в положение, где он был пять секунд назад, возвращая уровень здоровья и маны на прежний уровень. Не действует на перезарядку способностей и предметов, а также на золото и опыт.",
      "spellName": "Time Lapse",
      "params": [
        "Анимация применения: 0,3+0 (TagAghanim 0,3+0,53)",
        "Дальность применения: 0 (TagAghanim 600)",
        "Возвращаемое время: 5",
        "Уменьшает перезарядку и позволяет применять эту способность на союзников."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Если Скитскур считает, что текущая реальность не удовлетворяет его желаниям, он просто уползает назад во времени, чтобы исправить огрехи."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Добавляет к атакам Weaver эффект сжигания маны, позволяя ему выжигать ману цели и наносить урон, основанный на сожженой мане.",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "В среднем увеличивает урон Weaver на 12, если у существа достаточно маны для выжигания. В среднем увеличивает урон иллюзий Weaver на 8, если у существа достаточно маны для выжигания.",
        "В среднем увеличивает урон иллюзий Weaver на 8, если у существа достаточно маны для выжигания.",
        "Сначала выжигает ману, затем наносит урон.",
        "Не действует при атаке союзных существ.",
        "Сочетается с другими источниками сжигания маны."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Сжигает маны за удар: 15",
      "spellName": "Сожжение маны",
      "params": [
        "Сжигает маны за удар: 15",
        "Иллюзии сжигают ману за удар: 10",
        "Урон от сожженной маны: 80%",
        "Значение сжигаемой маны снижено для иллюзий."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 16.0,
    "attrIntelligence": 13.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.1,
    "attrAgility": 14.0
  },
  "description": "Weaver — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Первой способностью, The Swarm, Weaver выпускает рой из жуков, которые цепляются за любого врага на своем пути, атакуя и снижая его броню до тех пор, пока не будут убиты. Вторая способность, Shukuchi, делает героя невидимым, что позволяет ему проходить через юнитов на максимальной скорости. Врагам, через которых он проходит, наносится урон. Пассивная способность, Geminate Attack, позволяет Weaver атаковать цель дважды. Ультимативная способность, Time Lapse, возвращается в положение, в котором он был пять секунд назад, восстанавливая уровень здоровья и маны на былой уровень. Не действует на перезарядку, золото и опыт. Улучшение с Aghanim's Scepter уменьшает время перезарядки и позволяет использовать Time Lapse на союзников.",
  "history": "Ткани мироздания требуется постоянный уход, дабы она не износилась; ибо стоит ей порваться, разойдутся по швам целые миры. Для того и существуют ткачи: они укрепляют материю и зашивают прорехи в узоре реальности — а ещё защищают её от существ, что разгрызают ткань и откладывают в ней яйца, дабы молодняк поглотил вселенную, коли наблюдатели отвлекутся хоть ненадолго. Ткач по имени Скитскурр, мастер своего дела, следил за небольшим участком мироздания и не давал ему растянуться и износиться. Но такой труд не приносил радости. Ему не давало покоя, что вселенная уже давно сплетена; долг ткачей был исполнен, и они двинулись дальше. Скитскурр хотел не поддерживать миры, а плести их в своё удовольствие, и потому стал аккуратно изменять свои владения. Но процесс создания оказался слишком захватывающим, и действия Скитскурра стали слишком смелыми: он стал тянуть нити против узора, что выстроили другие ткачи. Тут же явились стражи и отсекли неугодный мир от космического гобелена, а прореху зашили. Скитскурр оказался совсем один, вдали от своего рода, и такое наказание стало бы страшной пыткой для любого ткача. Но он возрадовался, ведь наконец обрёл свободу. Теперь он мог творить лишь для себя, мог начать что-то новое. В его лапках было всё, что нужно для создания собственного бытия, и ему осталось лишь разорвать наш мир по швам.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 атака от Geminate Attack",
      "talentRight": "+160 к скорости передвижения от Shukuchi"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+2 атаки для убийства жука от The Swarm",
      "talentRight": "-0,4 снижения брони от The Swarm"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+11 к силе",
      "talentRight": "+15 к сожжению маны"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+6 к ловкости",
      "talentRight": "+60 урона от Shukuchi"
    }
  ]
}