{
  "abilities": [
    {
      "notes": [
        "Both Spiders talents affect Spiderlings and Spiderites.",
        "The agility talent effectively grants Broodmother 1.67 armor, 10 attack speed, and 10 main attack damage.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+350 Spiders Health",
          "talentRight": "+50 Insatiable Hunger Damage\/Lifesteal"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+400 Health",
          "talentRight": "+50% Spiders Damage to Buildings"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 Attack Speed",
          "talentRight": "-10s Spin Web Recharge Time"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 Agility",
          "talentRight": "+80 Spawn Spiderlings Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4c\/Broodmother_Insatiable_Hunger.mp3\/revision\/latest?cb=20191216011847",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Grants regular flat bonus attack damage.",
        "Stacks additively with other sources of lifesteal. Cannot lifesteal off of buildings or allied units. Can lifesteal off of wards that do not require a fixed amount of attacks to be destroyed.",
        "Cannot lifesteal off of buildings or allied units.",
        "Can lifesteal off of wards that do not require a fixed amount of attacks to be destroyed."
      ],
      "mana": "50\/60\/70\/80",
      "item_behaviour": [],
      "name": "Insatiable Hunger",
      "cooldown": "40\/35\/30\/25",
      "description": "A violent lust for vital fluids increases Broodmother's attack damage and gives her a vampiric attack.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.5",
        "Attack Damage Bonus: 35\/45\/55\/65 (TagTalent 85\/95\/105\/115)",
        "Lifesteal: 40%\/60%\/80%\/100% (TagTalent 90%\/110%\/130%\/150%)",
        "Duration: 8\/10\/12\/14"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/72\/Broodmother_Spin_Web.mp3\/revision\/latest?cb=20191216011845",
      "effects": [
        "Ability Target Area",
        "Affects Self"
      ],
      "notes": [
        "Has a global cast range when a part of another web is within the targeted area.",
        "Upon learning, Broodmother instantly gains 4 charges. However, leveling it up further does not instantly grant the other charges.",
        "The buff only affects the caster, and all Spiderlings and Spiderites under the player's control. Other player-controlled units are unaffected. The movement speed bonus gets lower by 0.18%\/0.3%\/0.42%\/0.54% for every 1% of health missing, reaching 0% when below 1% health. The health percentage is check periodically and the effects adapted instantly. Does not affect invulnerable or hidden units.",
        "The movement speed bonus gets lower by 0.18%\/0.3%\/0.42%\/0.54% for every 1% of health missing, reaching 0% when below 1% health.",
        "The health percentage is check periodically and the effects adapted instantly.",
        "Does not affect invulnerable or hidden units.",
        "Can regenerate up to 180\/300\/420\/540 health in one minute.",
        "The effects are provided by an aura. Its buff lingers for 0.2 seconds.",
        "Spin Webs are visible on the minimap for Broodmother and her team. They do not provide vision but are selectable through the Fog of War.",
        "The webs possess the Destroy Spin Web sub-ability.",
        "The webs do not block neutral creep camps."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Spin Web",
      "cooldown": "0",
      "description": "Spins a large web that grants Broodmother a passive movement speed increase, and boosts regeneration while in its vicinity, as well as giving free movement. Spin Web charges restore every 30 seconds. Spin Web can be cast from anywhere as long as the new web touches an existing web. Webs never expire, and can be manually destroyed. When the maximum limit of webs is exceeded, the oldest web disappears. The movement bonus is proportional to the unit's HP",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.4+0.4",
        "Cast Range: 1000",
        "Web Radius: 900",
        "Max Amount of Webs: 3\/5\/7\/9",
        "Health Regen Bonus: 3\/5\/7\/9",
        "Max Move Speed Bonus: 18%\/30%\/42%\/54%",
        "Min Bonus Health Threshold: 1%",
        "Aura Linger Duration: 0.2",
        "Number of Charges: 4\/6\/8\/10",
        "Charge Replenish Time: 30 (TagTalent 20)"
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4b\/Broodmother_Silken_Bola_1.mp3\/revision\/latest?cb=20201224014000",
      "effects": [
        "Ability Target Unit (TagAghanim Target Area)",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1200.",
        "Silken Bola first applies the damage, then the debuff.",
        "The bonus damage only triggers on allied hero attacks (including illusions and clones, excluding creep-heroes), and on any attacks done by units owned by Broodmother. The damage is magical, and is dealt in one instance together with the attack damage, and counts as attack damage as well. However, it is not considered by lifesteal, crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "The damage is magical, and is dealt in one instance together with the attack damage, and counts as attack damage as well.",
        "However, it is not considered by lifesteal, crit or cleave.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "The miss chance uses pseudo-random distribution.",
        "With Aghanim's Shard, Silken Bola turns into an area-targeted ability, so that it cannot directly target units anymore."
      ],
      "mana": "70\/75\/80\/85",
      "item_behaviour": [],
      "name": "Silken Bola",
      "cooldown": "24\/20\/16\/12",
      "description": "Slows the target enemy, causes them to miss and deals impact damage. Units that attack the target deal bonus magic damage.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.1+0.67",
        "Cast Range: 750",
        "Damage: 100\/120\/140\/160",
        "Attack Damage Bonus Against Target: 6\/7\/8\/9",
        "Move Speed Slow: 25%\/35%\/45%\/55%",
        "Miss Chance: 40% (TagTalent 80%)",
        "Duration: 6",
        "Radius: 550",
        "Causes Silken Bola to be a 550 AoE spell and increases the miss chance to 80%.",
        "Blocked upon impact, not blocked when upgraded.",
        ""
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5a\/Broodmother_Spinner%27s_Snare_1.mp3\/revision\/latest?cb=20210823213143",
      "effects": [
        "Ability Target Point \/ Vector Targeting",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Cannot be cast within the vicinity of another web line. The vector must not overlap with another line to cast.",
        "The web line forms over a 2-second duration, during which the line is completely inactive.",
        "The web lines are completely invisible to the enemy and cannot be revealed.",
        "Once formed, the line can trigger on any enemy hero coming within its area of effect. Only reacts on heroes, including clones, but excluding illusions and creep-heroes.",
        "Only reacts on heroes, including clones, but excluding illusions and creep-heroes.",
        "When triggered, the triggering hero reveives a single debuff that applies all effects. The modifier exposes the target, provides True Sight over them, and slows their movement speed. After 0.25 seconds, the modifier roots the target, preventing them from moving and casting certain mobility spells. This means the root effectively lasts 3.75 seconds. The damage over time starts after this delay as well, and ticks in 1-second intervals, resulting in 4 instances. Can deal a total of 400 damage to the target (before reductions).",
        "The modifier exposes the target, provides True Sight over them, and slows their movement speed.",
        "After 0.25 seconds, the modifier roots the target, preventing them from moving and casting certain mobility spells.",
        "This means the root effectively lasts 3.75 seconds.",
        "The damage over time starts after this delay as well, and ticks in 1-second intervals, resulting in 4 instances.",
        "Can deal a total of 400 damage to the target (before reductions).",
        "Once triggered, the web line becomes visible to enemies, and disappears after 4 seconds. This timer is independent from the debuff on the enemy, so removing the debuff does not cause the line to disappear earlier. During this time, other enemy heroes still may get debuffed by the line.",
        "This timer is independent from the debuff on the enemy, so removing the debuff does not cause the line to disappear earlier.",
        "During this time, other enemy heroes still may get debuffed by the line.",
        "The web lines have no set duration, they last until triggered. Exceeding the max allowed number of lines instantly destroys the oldest line.",
        "Exceeding the max allowed number of lines instantly destroys the oldest line.",
        "The lines have no form of vision, and are not visible through the Fog of War for anyone."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Spinner's Snare",
      "cooldown": "0",
      "description": "Broodmother creates a 900 width invisible web line. Enemy Heroes that cross the web line will make it visible and become rooted, visible in fog and receive 100dps for 4 seconds, after which the line is destroyed. Broodmother's team is notified in the Minimap whenever someone trips in a Web line. Multiple Heroes can trip on the same line until it's destroyed. Can only have 5 Snares Active. Formation Delay: 2, Cast Range: 600, Slow Duration: 0.25, Slow: 100%, Root Duration: 4, DPS: 100",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.56",
        "Cast Range: 600",
        "Line Length: 900",
        "Line Width: 50",
        "Line Formation Time: 2",
        "Max Amount of Lines: 5",
        "Damage per Second: 100",
        "Move Speed Slow: 100%",
        "Root Delay: 0.25",
        "Debuff Duration: 4",
        "Number of Charges: 2",
        "Charge Replenish Time: 20"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Broodmother_Spawn_Spiderlings_1.mp3\/revision\/latest?cb=20191216011849",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1200.",
        "Spawn Spiderling first applies the debuff, then the damage.",
        "Spiderlings only spawn when the targeted unit dies while having the debuff on. It does not matter who kills the target, if it dies in any way, the Spiderlings spawn. The amount of spiders spawned is based on the level of the ability as the spawn happens, and not on what level it was upon cast.",
        "It does not matter who kills the target, if it dies in any way, the Spiderlings spawn.",
        "The amount of spiders spawned is based on the level of the ability as the spawn happens, and not on what level it was upon cast.",
        "Multiple instances of Spawn Spiderlings on the same target fully stack, with each cast placing a separate debuff. Has a stack limit of 7. If an enemy has already 7 instances of the debuff, a new cast does not affect them at all.",
        "Has a stack limit of 7. If an enemy has already 7 instances of the debuff, a new cast does not affect them at all.",
        "Spiderlings are fully affected by Spin Web.",
        "The damage increasing talent immediately upgrades all of Broodmother's currently flying Spawn Spiderling projectiles.",
        "Both building damage increasing and health increasing talents do not upgrade any of Broodmother's currently living Spiderlings or Spiderites."
      ],
      "mana": "120",
      "item_behaviour": [],
      "name": "Spawn Spiderlings",
      "cooldown": "9\/8\/7",
      "description": "Broodmother injects her young into an enemy unit, dealing damage. The spiderlings will hatch if the target is killed while under this influence.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.2+0.5",
        "Cast Range: 900",
        "Damage: 260\/340\/420 (TagTalent 340\/420\/500)",
        "Number of Spiderlings: 4\/5\/6",
        "Debuff Duration: 20",
        "Spiderling Duration: 60",
        "Spiders Building Damage Bonus: 50%",
        "Grants a new ability: Spinner's Snare.",
        "Debuff persists if debuff was placed before spell immunity and when not dispelled.",
        "Blocked upon impact."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "This is cast from the web itself, allowing Broodmother to destroy webs individually instead of having the oldest one destroyed.",
        "The webs do not leave corpses."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Destroy Spin Web",
      "cooldown": null,
      "description": "Destroys the selected Spin Web.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0",
        ""
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Successive hits with Poison Sting on the same target do not stack, only the debuff gets refreshed.",
        "The attacks first apply their damage, then the debuff.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 2 damage ticks (or 6 damage ticks against creeps). Can deal up to 16 damage (or 48 damage against creeps) before reductions.",
        "Can deal up to 16 damage (or 48 damage against creeps) before reductions.",
        "Affects allies and wards, but not buildings.",
        "Treats creep-heroes as creeps.",
        "Spiderites do not have this ability."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Poison Sting",
      "cooldown": null,
      "description": "Poisons and slows enemies with each attack.",
      "hot_key": null,
      "params": [
        "Damage per Second: 8",
        "Move Speed Slow: 8%",
        "Hero Duration: 2",
        "Non-Hero Duration: 6",
        ""
      ],
      "legacy_key": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Successive hits with Spawn Spiderite on the same target do not stack, only the debuff gets refreshed.",
        "The attacks first apply their damage, then the debuff.",
        "The Spiderite only spawns when the attacked unit dies while having the debuff on. It does not matter who kills the target, if it dies in any way, the Spiderite spawns.",
        "It does not matter who kills the target, if it dies in any way, the Spiderite spawns.",
        "Does not affect wards and buildings, but affects allies.",
        "Spiderites are fully affected by Spin Web.",
        "Spiderites do not possess this ability."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Spawn Spiderite",
      "cooldown": null,
      "description": "Applies debuff on attack. If debuffed unit dies, a spiderite will spawn.",
      "hot_key": null,
      "params": [
        "Number of Spiderites: 1",
        "Debuff Duration: 2",
        "Spiderite Duration: 60",
        "Debuff persists if debuff was placed before spell immunity and when not dispelled.",
        ""
      ],
      "legacy_key": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.4,
    "attrAgility": 19.0
  },
  "description": "Black Arachnia, the Broodmother, is a melee agility hero who is a notably powerful pusher. Her trademark spiderlings, as both an asset and a liability, define her play style. While a possible additional source of income, experience and lane pushes, spiderlings can easily feed opponents when not handled with deft micro and great awareness. Broodmother's abilities allow her to summon those spiderlings to do her bidding and to slow and kill heroes with relative ease if caught off guard, all while staying as elusive as possible with her webs and passives. She spends most of the early game pressuring a lane with little concern, due to her spiderlings and her added health regeneration, but she can also transition into a difficult to kill melee carry, which can dive in on and rapidly kill lone enemies with the right items later on.",
  "history": "For centuries, Black Arachnia the Broodmother lurked in the dark lava tubes beneath the smoldering caldera of Mount Pyrotheos, raising millions of spiderlings in safety before sending them to find prey in the wide world above. In a later age, the Vizier of Greed, Ptholopthales, erected his lodestone ziggurat on the slopes of the dead volcano, knowing that any looters who sought his magnetic wealth must survive the spider-haunted passages. After millennia of maternal peace, Black Arachnia found herself beset by a steady trickle of furfeet and cutpurses, bold knights and noble youths--all of them delicious, certainly, and yet tending to create a less than nurturing environment for her innocent offspring. Tiring of the intrusions, she paid a visit to Ptholopthales; and when he proved unwilling to discuss a compromise, she wrapped the Vizier in silk and set him aside to be the centerpiece of a special birthday feast. Unfortunately, the absence of the Magnetic Ziggurat's master merely emboldened a new generation of intruders. When one of her newborns was trodden underfoot by a clumsy adventurer, she reached the end of her silken rope. Broodmother headed for the surface, declaring her intent to rid the world of each and every possible invader, down to the last Hero if necessary, until she could ensure her nursery might once more be a safe and wholesome environment for her precious spiderspawn.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+350 Spiders Health",
      "talentRight": "+50 Insatiable Hunger Damage\/Lifesteal"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+400 Health",
      "talentRight": "+50% Spiders Damage to Buildings"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 Attack Speed",
      "talentRight": "-10s Spin Web Recharge Time"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 Agility",
      "talentRight": "+80 Spawn Spiderlings Damage"
    }
  ]
}