{
  "abilities": [
    {
      "effects": [
        "Attack Range Bonus: 140"
      ],
      "elements": [
        "Ability Passive",
        "Affects Self"
      ],
      "name": "Dragon's Reach",
      "description": "Increases attack range of ranged heroes by 140."
    }
  ],
  "contains": [
    "Ogre_Axe",
    "Band_of_Elvenskin",
    "Band_of_Elvenskin"
  ],
  "cost": "1900",
  "description": "The forward charge of the wyvern host grants no quarter.",
  "further": [
    "Hurricane_Pike"
  ],
  "tips": [
    "Dragon Lance is great for ranged heroes that suffer from low attack range, like Luna or Templar Assassin. Those heroes' powerful attacks are mainly limited by their attack range, which Dragon Lance can fix.",
    "Enchantress can throw out very painful Impetus attacks when combined with Aghanim's Scepter, reaching more than 800 attack range. The strength and attack speed bonus are great for her as well, as she is lacking all of that. It can also be built into Hurricane Pike, which is a very useful and complementary item for her.",
    "Disassemble to build Sange and Yasha, leaving a Band of Elvenskin spare."
  ],
  "attrs": [
    "Passive Dragon's Reach",
    "Bonus +12 Strength +12 Agility +140 Attack range",
    "Disassemble? Yes",
    "Alert allies? No"
  ],
  "info": [
    "For strength heroes, it grants 270 health, 1.5 health regen, 1.2% magic resistance, 1.92 armor, 12 attack speed, 0.6% movement speed and 12 attack damage.",
    "For agility heroes, it grants 216 health, 1.2 health regen, 0.96% magic resistance, 2.4 armor, 15 attack speed, 0.75% movement speed and 12 attack damage.",
    "For intelligence heroes, it grants 216 health, 1.2 health regen, 0.96% magic resistance, 1.92 armor, 12 attack speed and 0.6% movement speed.",
    "The attack range bonus works for ranged heroes only.",
    "Attack range bonuses from multiple Dragon Lance based items do not stack.",
    "Stacks with all other attack range bonuses.",
    "Affects the cast range of active attack modifiers as well."
  ]
}