{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e3\/Ui_hud_equip_shard.mp3\/revision\/latest?cb=20201219110042",
      "effects": [],
      "notes": [
        "When a hero has an upgrade available, the item's and the upgraded ability's tooltip state what exactly is upgraded.",
        "A hero may only consume Aghanim's Shard once. The item is instantly consumed when there is an item slot available in the main inventory or in the backpack, if the hero does not have Aghanim's Shard previously.",
        "The item is instantly consumed when there is an item slot available in the main inventory or in the backpack, if the hero does not have Aghanim's Shard previously.",
        "Single target abilities with Aghanim's Shard upgrades that are reflected by Spell Reflection depend on whether the reflecting hero has Aghanim's Shard, not the original caster of the reflected ability."
      ],
      "mana": null,
      "abilityName": "Ability Upgrade",
      "cooldown": null,
      "description": "Upgrades an existing ability or adds a new ability to your hero.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Ability Upgrade has a unique interface on the HUD, with its icon lighting up once the item is consumed.",
    "The item grants each hero unique enhancements to their abilities, sometimes granting a new ability.",
    "The item can be automatically consumed, regardless of purchasing it in the Base Shop or having it delivered via the Courier's Transfer Items, despite having a full inventory on the hero."
  ],
  "cost": "1400",
  "lore": null,
  "consistFrom": null,
  "name": "Aghanim's Shard",
  "description": "With origins known only to a single wizard, fragments of this impossible crystal are nearly as coveted as the renowned scepter itself.",
  "trivia": [
    "Aghanim's Shard first made its debut in Aghanim's Labyrinth, where they served as upgrades rewarded at the end of each room.",
    "Aghanim's Shard is named after Agahnim, one of the main villains in The Legend of Zelda: A Link to the Past.",
    "Rubick is the son of Aghanim."
  ],
  "upgradeIn": null,
  "tips": null
}