{
  "abilities": [
    {
      "notes": [
        "Талант на вампиризм аддитивно сочетается с другими источниками вампиризма.",
        "Талант на силу в общем даёт Night Stalker: 240 здоровья, 1,2 регенерации здоровья и 12 урона от атаки.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-60 сек. перезарядки Dark Ascension",
          "talentRight": "+80 к скорости атаки от Hunter in the Night"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+35 к урону",
          "talentRight": "+30 к скорости передвижения"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20% к вампиризму",
          "talentRight": "+12 к силе"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+7% к скорости передвижения от Hunter in the Night",
          "talentRight": "+45 к урону от Void"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Night_Stalker_Void.mp3\/revision\/latest?cb=20191216021028",
      "effects": [
        "Способность Направленная на существо (TagAghanim Ненаправленная)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Также использует увеличенные значения во время ночи от Eclipse.",
        "Void сначала применяет замедление, затем наносит урон, потом - оглушает.",
        "Во время действия Hunter in the Night остаточная анимация равна 0,57.",
        "Версия, улучшенная Aghanim's Scepter, использует ту же длительность анимации применения. Не выбирает невидимых существ и существ в тумане войны.",
        "Не выбирает невидимых существ и существ в тумане войны."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "11\/10\/9\/8",
      "description": "Создаёт губительную пустоту, которая замедляет врага и наносит ему урон. Ночью замедление длится дольше. Также ненадолго оглушает жертву, останавливая прерываемые способности.",
      "spellName": "Void",
      "params": [
        "Анимация применения: 0,3+0,33",
        "Дальность применения: 525 (TagAghanim 0)",
        "Радиус: 0 (TagAghanim 900)",
        "Урон: 80\/160\/240\/320 (TagTalent 125\/205\/285\/365)",
        "Замедление скорости передвижения: 50%",
        "Замедление скорости атаки: 50",
        "Длительность замедления днём: 1,25",
        "Длительность замедления ночью: 2,5\/3\/3,5\/4",
        "Длительность оглушения днём: 0",
        "Длительность оглушения ночью: 0,1 (TagAghanim 0,5)",
        "Способность применяется на всех врагов вокруг владельца. Увеличивает время оглушения.",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Не блокируется при улучшении Aghanim's Scepter."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Баланар яростно погружает врагов в воронку когда-то вечной тьмы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ee\/Night_Stalker_Crippling_Fear_1.mp3\/revision\/latest?cb=20191216021032",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "Безмолвие предоставлено аурой, чей дебафф задерживается на 0,5 сек.",
        "Длительность активированной ауры не обновляется при смене времени суток.",
        "Также использует увеличенное значение во время ночи от Eclipse.",
        "Во время действия Hunter in the Night остаточная анимация равна 0,67."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "30\/25\/20\/15",
      "description": "Герой вселяет ужас во врагов рядом с собой, отчего на них действует безмолвие. Ночью эффект длится дольше.",
      "spellName": "Crippling Fear",
      "params": [
        "Анимация применения: 0,2+0,43",
        "Радиус: 375",
        "Длительность днём: 3",
        "Длительность ночью: 4\/5\/6\/7",
        "Длительность задержки ауры: 0,5",
        "Дебафф остается, если был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Искажённая пасть Баланара навсегда останется в памяти тех несчастных, кто попался ему на пути."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Night_Stalker_Hunter_in_the_Night_move.mp3\/revision\/latest?cb=20191216021026",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Также действует во время ночи от Eclipse."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Ночью герой оказывается в своей стихии: он атакует и передвигается увеличенной скоростью.",
      "spellName": "Hunter in the Night",
      "params": [
        "Доп. скорость передвижения: 22%\/28%\/34%\/40% (TagTalent 29%\/35%\/41%\/47%)",
        "Доп. скорость атаки: 20\/40\/60\/80 (TagTalent 100\/120\/140\/160)"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Охотничье мастерство Баланара возрастает с наступлением ночи."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Night_Stalker_Dark_Ascension.mp3\/revision\/latest?cb=20191216021025",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "У ночи от Dark Ascension ниже приоритет, чем у дня, вызванного Supernova. Пока на карте светло от Supernova, Night Stalker всё также летает, обладает дополнительным уроном и беспрепятственным обзором, но обзор ограничивается его базовым дневным значением.",
        "Пока на карте светло от Supernova, Night Stalker всё также летает, обладает дополнительным уроном и беспрепятственным обзором, но обзор ограничивается его базовым дневным значением.",
        "При использовании ночью остаточная анимация равна 0,5."
      ],
      "mana": "125\/175\/225",
      "hotKey": "R",
      "cooldown": "140\/130\/120 (TagTalent 80\/70\/60)",
      "description": "Подавляет солнечный свет, создавая непроглядную тьму и раскрывая силы героя в полной мере. Он получает беспрепятственный обзор, свободное передвижение и дополнительный урон.",
      "spellName": "Dark Ascension",
      "params": [
        "Анимация применения: 0,3+0",
        "Дополнительный урон: 50\/100\/150",
        "Длительность: 30"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Жалкое зрелище: даже сильнейшие из воинов начинают бояться темноты."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.3,
    "attrAgility": 18.0
  },
  "description": "Night Stalker — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Void, создает разрушительный вакуум, который замедляет вражеского юнита, кратковременно оглушает и наносит урон. Ночью замедление длится дольше. Вторая способность, Crippling Fear, создает ауру в небольшом радиусе от героя которая запрещает использовать способности. Ночью эффект длится дольше. Пассивная способность, Hunter in the Night увеличивает ночью его скорость атаки и передвижения. Ультимативная способность, Dark Ascension, подавляет солнечный свет, превращая Night Stalker в летающего монстра; герой получает беспрепятственный обзор вокруг себя, возможность проходить через любые препятствия, а также имеет дополнительный урон.",
  "history": "О том, откуда появился Баланар, никто не знает доподлинно; ходят лишь слухи. Древние сказания каждой расы и культуры повествуют о невообразимом времени, когда не было ещё дня и солнца, когда миром правила одна только ночь — и населяли её создания тьмы, подобные Баланару. Говорят, что на рассвете Первого дня все ночные твари сгинули. Все, кроме одной. Баланар — воплощение зла, и он упивается своей жестокостью. Именно он стал прообразом разнообразных бабаек и кощеев, и с незапамятных времён именно его тенью пугали непослушных детей. Баланар наслаждается такой ролью и играет её в самой полной мере. Под покровом ночи он ищет опрометчивых и беспомощных — тех, кто отбился от света и позабыл древние истории. Баланар — живое доказательство того, что самый кошмарный сон ребёнка... это совсем не сон.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-60 сек. перезарядки Dark Ascension",
      "talentRight": "+80 к скорости атаки от Hunter in the Night"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+35 к урону",
      "talentRight": "+30 к скорости передвижения"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20% к вампиризму",
      "talentRight": "+12 к силе"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+7% к скорости передвижения от Hunter in the Night",
      "talentRight": "+45 к урону от Void"
    }
  ]
}