{
  "abilities": [
    {
      "notes": [
        "Avalanche's projectile travels at a speed of 1200",
        "Deals 15\/30\/45\/60 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 31\/46\/61\/76) damage in 0.3-second intervals, starting once the projectile reaches the targeted point, resulting in 5 instances\n This results in a total duration of 1.2 seconds, counting after projectile arrival\n The in-game tooltip includes the stun duration as well, showing a total duration of 1.5 seconds",
        "If a unit is affected by <span image=\"images\/toss.webp\">[picture:toss]<\/span> Toss, it takes 2 times the damage from Avalanche, which is 30\/60\/90\/120 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 62\/92\/122\/152) per instance\n When perfectly combined with Toss, it can deal up to 150\/300\/450\/600 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 310\/460\/610\/760) damage (before reductions)\n The damage multiplier is applied as long as the unit is affected by Toss, regardless of its source",
        "On each instance, Avalanche first applies the damage, then the debuff"
      ],
      "item_behaviour": [],
      "description": "Bombards an area with rocks, continuously doing small intervals of damage and stun to enemy units. Avalanche does 2x damage to units being tossed.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0.53",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 600",
        "Effect Radius: 325\/340\/355\/370",
        "Number of Instances: 5",
        "Instances Interval: 0.3",
        "Total Damage: 75\/150\/225\/300 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 155\/230\/305\/380)",
        "Toss Damage Multiplier: 2",
        "Stun Duration: 0.3",
        "Avalanche Duration: 1.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Tiny_Avalanche.mp3\/revision\/latest?cb=20191216025433",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "26\/22\/18\/14 (TagTalent 18\/14\/10\/6)",
      "aghanim": null,
      "name": "Avalanche",
      "cooldown": "120",
      "legacy_key": "V",
      "story": "Inanimate rock becomes animate when called by the Stone Giant."
    },
    {
      "notes": [
        "The tossed unit travels at a speed based on the distance between it and the target, capped at 2308\n The speed does not instantly adapt if the distance changes, but rather accelerates or decelerates at a slow rate",
        "Can toss any unit, except for <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers, ancient creeps, buildings, and wards\n Invisible enemy units cannot be tossed, but they can still take damage from a unit being tossed onto or near them\n Units in the Fog of War can be tossed if they are within the 300 grab radius of Tiny, but cannot be selected as a target\n Cannot target buildings, but they take 25\/50\/75\/100 damage if within the damage radius\n Can directly target and toss the target towards runes, but cannot toss runes\n Cannot toss allies who have ☐ Disabled Help from Tiny if they are the only valid target",
        "Toss deals a total of damage (before reductions) at the following <span image=\"images\/grow.webp\">[picture:grow]<\/span> Grow levels to units and buildings respectively: Level 1: 175\/250\/325\/400 (<span image=\"images\/glyph_of_fortification.png\">[picture:glyph_of_fortification]<\/span> 58.33\/83.33\/108.32\/133.32) Level 2: 275\/350\/425\/500 (<span image=\"images\/glyph_of_fortification.png\">[picture:glyph_of_fortification]<\/span> 91.66\/116.66\/141.65\/166.65) Level 3: 375\/450\/525\/600 (<span image=\"images\/glyph_of_fortification.png\">[picture:glyph_of_fortification]<\/span> 124.99\/149.99\/174.98\/199.98)",
        "The tossed unit can be avoided by blinking or moving rapidly, but cannot technically be disjointed\n This means the tossed unit can fly up to 3000 range away when the target teleports far enough away",
        "Toss' modifier is hidden and not visible in the HUD\n It persists through the target's death, so it continues flying and still applies the area damage upon landing",
        "The affected target is disabled and prevented from acting\n While tossed upwards and other units may pass below the airborne unit",
        "Destroys trees within a 100 radius around the tossed unit upon landing",
        "TALENT NOTES The Toss requires no target <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent turns Toss into an area-targeted ability, so that it can target the ground, as well as units\n When ground-targeted, its tosses the unit towards the targeted point\n Only runes can no longer be directly targeted when this talent is learned\n Acquiring the Toss charges <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent instantly grants 1 extra charge"
      ],
      "item_behaviour": [],
      "description": "Grabs the nearest unit in a 300 radius around Tiny, ally or enemy, and launches it at the target unit or rune to deal damage where they land.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0.53",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 800\/900\/1000\/1100",
        "Grab Radius: 300",
        "Damage Radius: 275",
        "Damage: 75\/150\/225\/300",
        "Building Damage Percentage: 33.33%",
        "Toss Duration: 1.4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/76\/Tiny_Toss_1.mp3\/revision\/latest?cb=20191216025438",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Allies",
        "Damage: Magical"
      ],
      "mana": "17\/15\/13\/11 (TagTalent 0)",
      "aghanim": null,
      "name": "Toss",
      "cooldown": "17\/15\/13\/11",
      "legacy_key": "T",
      "story": "Tiny's gargantuan stature allows him to catapult even the sturdiest of warriors."
    },
    {
      "notes": [
        "The Tree Grab buff lasts until the charges are used up, the <span image=\"images\/tree_throw.webp\">[picture:tree_throw]<\/span> Tree Throw sub-ability is used, or until death\n The number of remaining attacks is visible on the buff icon\n The buff is visible to everyone\n With <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard, remaining charges on the HUD are not reduced until Tiny loses the tree\n Grabbing a new tree grants a new permanent status buff",
        "Upon cast, the mana is expended, but it does not go on cooldown\n Losing the grabbed tree in any way starts the ability's cooldown",
        "Turns the caster into a <span image=\"images\/melee.png\">[picture:melee]<\/span> melee unit with 350 attack range until the Tree is lost\n This causes items that use different values for melee and ranged heroes (e.g\n <span image=\"items\/manta_style\/full.webp\">[picture:manta_style]<\/span> Manta Style) to now treat the caster as a melee hero\n Attack range bonuses are not overridden and still work normally",
        "Grants flat bonus attack damage\n The bonus damage is applied when denying allied units",
        "Tree Grab is a unique attack-based area damage that has the following properties: The area has the following flags: No-spell-lifesteal flag, preventing its damage from utilizing spell lifesteal\n No-spell-amplification flag, preventing its damage from being amplified with spell damage amplification\n The damage is affected by damage block\n It fully stacks with other sources of cleaves, with multiple sources and working independently\n Applies its area damage upon attacking wards, or buildings, but not on allies and items\n Wards and buildings are unaffected by the area damage\n Despite the visual effect, the area damage is applied instantly in the whole area",
        "The area is shaped like a rectangle with a semi-circle on top, and always starts in front of the attacking unit\n The rectangle has a length of 400 and a width of 400\n The semi-circle has a radius of 200\n With the area damage length and width, the area damage can reach up to 600 range away from Tiny",
        "The building bonus attack damage is considered as a conditional attack damage bonus\n Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Tiny's attack damage\n It can be reduced only by flat reductions (e.g\n damage block)\n Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions\n SPELL STEAL Reduces attack range, ability effects persist if Rubick loses the ability while still wielding a tree"
      ],
      "item_behaviour": [],
      "description": "Grabs a tree to whack enemies on the head for a limited number of attacks. Grants bonus attack range. Attacks deal more damage and fully splash on units along the way. The tree can be thrown, to deal your attack to a unit at a distance.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.2+1.24",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 165",
        "Area Damage Length: 400",
        "Area Damage Radius: 200",
        "Number of Attacks: 5 (<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Infinite)",
        "Set Base Attack Range: 350",
        "Unit Attack Damage Bonus: 20",
        "Building Attack Damage Bonus: 40%\/55%\/70%\/85%",
        "Attack Damage as Area Damage: 40%\/60%\/80%\/100%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/00\/Tiny_Tree_Grab.mp3\/revision\/latest?cb=20191216025446",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies ",
        "Damage: Physical"
      ],
      "mana": "19\/16\/13\/10",
      "aghanim": null,
      "name": "Tree Grab",
      "cooldown": "40",
      "legacy_key": "C",
      "story": "Sticks and stones break all the bones, with structures sure to follow."
    },
    {
      "notes": [
        "Replaces <span image=\"images\/tree_grab.webp\">[picture:tree_grab]<\/span> Tree Grab until Tiny loses the tree",
        "The tree travels at a speed of 900",
        "When unit-targeted, the projectile homes in on the target, and hits the target upon fully reaching it\n The tree thrown this way does not provide vision while homing to the target",
        "When ground-targeted, the tree travels in a straight line up to 1200 range before it disappears\n The tree thrown provides 200 radius flying vision around itself while traveling\n The tree thrown has a 300 radius collision size\n This means this way, the tree may hit the intended target before reaching the target point\n With the travel distance and collision radius, the tree thrown can hit units up to 1500\n The splash damage is centered around the first unit it hits, and not around where the tree was as it hit",
        "When the tree hits a unit, no matter if unit-targeted or ground-targeted, it provides 200 radius flying vision at its location for 2 seconds",
        "Cannot be directly cast on <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers\n However, the splash damage from ground-targeted throw does affect the Courier",
        "Cause Tiny to perform an instant attack on the targeted unit, or the first enemy it finds\n These instant attacks deal 20 bonus damage, they do not use Tree Grab's bonus damage values\n It also applies splash damage around the target\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They have True Strike and ignore disarms\n The splash effects are based on the target's position, damaging a trapezoid area in the opposite direction where the tree came from\n If the caster is a <span image=\"images\/ranged.png\">[picture:ranged]<\/span> ranged hero, the instant attacks do not use attack projectiles and are instant, but still count as ranged attacks",
        "Enemies around the primary target are hit by splash damage, instead of instant attacks\n The splash damage has the no-spell-lifesteal flag, preventing its damage from utilising spell lifesteal\n The splash damage has the no-spell-amplification flag, preventing its damage from being amplified with spell damage amplification\n Splash damage is affected by damage block",
        "Tree Throw first applies the slow debuff, then the instant attack and splash damage",
        "Although the tree thrown is a projectile and it may look like a ranged attack, the attack still counts as a <span image=\"images\/melee.png\">[picture:melee]<\/span> melee attack when coming from Tiny\n This means all abilities that use different values for melee and ranged heroes (e.g\n <span image=\"items\/skull_basher\/full.webp\">[picture:skull_basher]<\/span> Skull Basher) treat the caster as a <span image=\"images\/melee.png\">[picture:melee]<\/span> melee hero\n SPELL STEAL No longer can throw the wielded tree upon losing ability\n SOULBIND Only affects the primary target"
      ],
      "item_behaviour": [],
      "description": "Throws the tree at the target unit, proccing your attack on it and splashing damage around the target.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.2+1.13",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1200",
        "Tree Collision Radius: 300",
        "Splash Radius: 275",
        "Splash Damage: 40%\/60%\/80%\/100%",
        "Unit Attack Damage Bonus: 20",
        "Move Speed Slow: 25%",
        "Attack Speed Slow: 25",
        "Slow Duration: 2.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Tiny_Tree_Throw_1.mp3\/revision\/latest?cb=20200521124741",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Instant Attack"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Tree Throw",
      "cooldown": "0",
      "legacy_key": "C",
      "story": "Even enemies can share in Tiny's arbor ardor."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter to be unlocked",
        "Does not require <span image=\"images\/tree_grab.webp\">[picture:tree_grab]<\/span> Tree Grab to be leveled to be unlocked, nor relies on <span image=\"images\/tree_throw.webp\">[picture:tree_throw]<\/span> Tree Throw to work, once Aghanim's Scepter is acquired",
        "Throws trees in 0.4-second intervals, starting immediately upon cast begin, resulting in up to 6 trees being thrown\n The trees travel at a speed of 1000\n Checks for trees in the same intervals\n If no tree is found within the area, the channeling ends prematurely",
        "The trees within the tree grab radius are chosen randomly",
        "Causes Tiny to perform instant attacks on all enemies within the damage radius\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They have True Strike and ignore disarms\n Cleave effects are based on the target's position, damaging a trapezoid area in the opposite direction where the tree came from",
        "The tree thrown provides 200 radius flying vision around itself while traveling\n When the tree hits a unit, it also provides 200 radius flying vision at its location for 2 seconds",
        "Tree Volley first applies the slow debuffs, then the instant attacks",
        "Fully affects enemy <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers"
      ],
      "item_behaviour": [],
      "description": "Tiny channels to throw random trees within range towards the targeted area. Deals Tiny's attack damage to enemies in that area with each tree thrown.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+2.4",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1200",
        "Tree Grab Radius: 700",
        "Damage Radius: 400",
        "Max Channel Time: 2.4",
        "Move Speed Slow: 25%",
        "Attack Speed Slow: 25",
        "Slow Duration: 2.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Tiny_Tree_Volley_1.mp3\/revision\/latest?cb=20191216025449",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies ",
        "Damage: Instant Attack"
      ],
      "mana": "17",
      "aghanim": null,
      "name": "Tree Volley",
      "cooldown": "200",
      "legacy_key": "R",
      "story": "Sticks thrown from stones are like to shatter many bones."
    },
    {
      "notes": [
        "Each level changes Tiny's appearance, making him bigger and making his voice deeper",
        "The attack damage bonus is added as base attack damage, and not bonus attack damage\n It benefits illusions, and is affected by every percentage-based damage increasing or reducing effects\n This attack damage bonus increases to 60\/130\/210 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 80\/170\/270) while Tiny is holding a tree with <span image=\"images\/tree_grab.webp\">[picture:tree_grab]<\/span> Tree Grab",
        "Grants flat bonus armor",
        "Percentage-based attack speed loss is calculated after all flat attack speed bonuses and reductions"
      ],
      "item_behaviour": [],
      "description": "Tiny gains craggy mass, increasing his attack damage, and armor, and toss power while slowing his attack speed.",
      "hot_key": "R",
      "params": [
        "Attack Damage Bonus: 50\/100\/150",
        "Armor Bonus: 10\/15\/20",
        "Toss Damage Bonus: 100\/200\/300",
        "Tree Grab Grow Damage Bonus: 20%\/30%\/40% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 60%\/70%\/80%)",
        "Attack Speed Loss: 30%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Tiny_Grow.mp3\/revision\/latest?cb=20200521124743",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Grow",
      "cooldown": null,
      "legacy_key": "W",
      "story": "Watching a hill become a mountain is awe-inspiring - especially if the mountain begins laying waste to adversaries."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.0,
    "attrStrength": 30.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 0.0,
    "attrAgility": 0.0
  },
  "description": "Grows in size and strength as battle ensues. A curious being of animated stone, Tiny roams the world in search of his origins. Seemingly mild-mannered, the Stone Giant is nonetheless a force to behold as he brings down a multitude of Avalanches. He Tosses friends and foes alike across the battlefield, landing them on top of enemies and into the fray. Growing to tremendous size and strength as the battle progresses, Tiny's power can quickly become terrifying. Some have even claimed to witness the Stone Giant Wielding a Massive Tree, bludgeoning and Volleying Trees at a fortress until only rubble remained.  Carry Nuker Pusher Initiator Durable Disabler ★★☆",
  "trivia": [
    "Tiny's quote \" Link▶️ Tiny Smash!\" is a reference to Hulk, a well-known superhero from the Marvel Universe.",
    "Tree Grab is still called Craggy Exterior after his old passive ability in the game files."
  ],
  "history": "Coming to life as a chunk of stone, Tiny's origins are a mystery on which he continually speculates. He is a Stone Giant now, but what did he used to be? A splinter broken from a Golem's heel? A shard swept from a gargoyle-sculptor's workshop? A fragment of the Oracular Visage of Garthos? A deep curiosity drives him, and he travels the world tirelessly seeking his origins, his parentage, his people. As he roams, he gathers weight and size; the forces that weather lesser rocks, instead cause Tiny to grow and ever grow.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-8s Avalanche Cooldown",
        "talent_left": "2 Toss Charges"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+40% Grow Bonus Damage With Tree",
        "talent_left": "Toss Requires No Target"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+10% Status Resistance",
        "talent_left": "+80 Avalanche Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+20 Movement Speed",
        "talent_left": "+10 Strength"
      }
    ],
    "notes": [
      "The strength talent effectively grants Tiny 200 health, 1 health regeneration, and 10 main attack damage bonus.",
      "The status resistance talent stacks multiplicatively with other sources of status resistance."
    ]
  }
}