{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/00\/Eul%27s_Scepter_of_Divinity.mp3\/revision\/latest?cb=20141214200300",
      "effects": [
        "Дальность применения: 550",
        "Радиус урагана: 24",
        "Урон: 50",
        "Длительность: 2,5"
      ],
      "notes": [
        "↓↓ Двойное нажатие по предмету применит его на владельца.",
        "Применяет к цели эффект урагана, делая её неуязвимой и полностью обезвреживая.",
        "Как и большинство других эффектов урагана, сопротивление эффектам не влияет на длительность торнадо от Eul's Scepter of Divinity.",
        "При использовании применяет к цели базовое развеивание.",
        "Cyclone сначала применяет неуязвимость, а потом развеивание.",
        "Может выбрать только врагов, владельца или клонов Meepo и Tempest Double. Не может выбрать других союзников, варды или постройки.",
        "Когда существо в воздухе, остальные существа не могут проходить под ним в радиусе 24.",
        "Урон наносится по окончанию действия. Если ураган развеяли, то он все равно нанесет урон при приземлении цели.",
        "Урон наносится только вражеским целям.",
        "Можно применить на Рошана, но без какого-либо эффекта, поскольку у Рошана иммунитет к принудительному движению. При этом урон все равно нанесётся.",
        "Делит перезарядку с Wind Waker."
      ],
      "mana": "175",
      "abilityName": "Cyclone",
      "cooldown": "23",
      "description": "Поднимает выбранную цель в воздух, делая её неуязвимой на 2,5 сек. Можно использовать только на себя или противника. Если применить на врага, то по приземлении он получит 50 магического урона.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2725",
  "lore": null,
  "consistFrom": [
    "Staff of Wizardry",
    "Void Stone",
    "Wind Lace",
    "Recipe"
  ],
  "name": "Eul's Scepter of Divinity",
  "description": "Мистический скипетр, прошедший сквозь века, позволяет призывать на помощь силу ветра, которая может быть использована как с добрыми, так и плохими намерениями.",
  "trivia": null,
  "upgradeIn": [
    "Wind Waker"
  ],
  "tips": null
}