{
  "abilities": [
    {
      "notes": [
        "The mine always reaches the targeted area within 1.2 seconds, no matter how far the targeted area is. If the bomb enters a  Chronosphere before reaching the targeted point, it instantly disappears. The bomb destroys trees within 100 radius upon landing",
        "Once Sticky Bomb reaches the area, it searches for enemy heroes, including illusions, clones and creep-heroes. This search happens only once upon landing, it does not continuously search for enemies. Can detect invisible heroes and heroes inside the Fog of War, but not invulnerable or hidden heroes. If a valid target is found, the bomb starts moving towards the target after a 0.1-second delay. Sticky Bomb moves at an initial speed of 500, and accelerates at a rate of 2000 distance per second until reaching the target. There is no maximum acceleration speed for Sticky Mine. Once it starts moving, the latching cannot be prevented in any way except death",
        "The bomb latches when it comes within 100 range of the target and keeps that distance throughout. Once latched, it cannot be removed in any way, not even by death. Although the latch slow debuff is dispellable, doing so does not remove the bomb. The bomb explodes 2 seconds after latching onto the target",
        "Multiple bombs may latch onto the same target, with each having independent explosion delays. However, multiple instances of the movement speed slow debuff does not stack. The status buff icon just shows how many bombs are currently latched",
        "If the bomb could not find any hero, it stays at the targeted location. The bomb does not move around, the circling animation has no influence on the bomb's actual position. The bomb will also explode in 2 seconds after landing, if it could not find a hero to latch on",
        "The damage is sourced to Techies, and not to the  Sticky Bomb. Therefore, the damage is affected by outgoing damage manipulation and spell lifesteal",
        "The explosion first applies the damage, then the slow debuff",
        "The ability does not provide any vision or True Sight. However, the bomb itself has 700 radius ground vision at all times",
        "The bombs can be selected by with Tab ↹. Although the bombs have  Pinpoint Detonate, it cannot be used"
      ],
      "item_behaviour": [],
      "description": "Lobs a Sticky Bomb towards the target area. If it lands next to an enemy hero, the bomb will stick to it, slowing its movement speed. After a few seconds the bomb will explode, dealing damage in an area around the detonation and applying a secondary slow for 3 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.1+0.7",
        "Cast Range:  1000",
        "Latch Radius: 250 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 375)",
        "Latch Move Speed Slow: 25%\/35%\/45%\/55%",
        "Explosion Radius: 300 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 425)",
        "Explosion Delay: 2",
        "Explosion Damage: 90\/180\/270\/360",
        "Explosion Move Speed Slow: 15%\/25%\/35%\/45%",
        "Explosion Slow Duration: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Techies_Sticky_Bomb_1.mp3\/revision\/latest?cb=20220412212710",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "12\/10\/8\/6",
      "aghanim": null,
      "name": "Sticky Bomb",
      "cooldown": "100\/115\/130\/145",
      "legacy_key": "E",
      "story": "Such revolutionary brilliance was meant to be shared."
    },
    {
      "notes": [
        "Reactive Tazer only triggers when a unit lands an attack, regardless of distance. This means it cannot trigger on missed attacks. Does not trigger on instant attacks that cannot proc attack modifiers (e.g.  Split Shot before learning the <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent and  Flak Cannon). Does not trigger on the attacks from buildings, wards, and allies. If the attacking unit turns invisible, the particle beam draw towards their current location. However, the particle impact effects appear at their last known location",
        "Losing the buff in any way first applies a basic dispel, the disarm debuff, and then the damage",
        "SCEPTER NOTES ↓↓ Double-tapping automatically targets self. Cannot be cast on  Couriers. Reactive Tazer can now trigger on attacks or damage sourced from enemies, including buildings and wards. Acquiring  Aghanim's Scepter immediately updates already existing Reactive Tazer buffs, causing them to deal damage upon expiring"
      ],
      "item_behaviour": [],
      "description": "Techies trigger an electric charge giving them bonus movement speed for a short period of time. Enemies attacking Techies are temporarily disarmed and get a Basic Dispel. At the end of the effect, the charge explodes, disarming all enemies within the radius.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0.5",
        "Explosion Radius: 400",
        "Move Speed Bonus: 18%\/22%\/26%\/30%",
        "Disarm Duration: 2.4\/2.7\/3\/3.3",
        "Buff Duration: 6",
        "Cast Range:  500",
        "Damage:  300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Techies_Reactive_Tazer.mp3\/revision\/latest?cb=20220412212708",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self",
        "Damage: "
      ],
      "mana": "28\/24\/20\/16",
      "aghanim": null,
      "name": "Reactive Tazer",
      "cooldown": "60",
      "legacy_key": "T",
      "story": "A steady bomb hand prefers an abundance of personal space."
    },
    {
      "notes": [
        "The leap always takes 0.75 seconds, so the horizontal speed varies between 0 ‒ 1333.33",
        "Leaps in an arc up to 281.108 range high, so that other units can pass below them",
        "The self-damage is never lethal, so it cannot be used to deny oneself. This damage has a flag set so that most forms of generic damage manipulation are ignored. However, it is not considered HP Removal and can be mitigated by other sources of manipulation such as <span image=\"images\/Aphotic_Shield.webp\">Aphotic_Shield<\/span> Aphotic Shield",
        "The explosion first applies the debuff, then the area damage, then the self damage and then the stun. The self-damage and area damage is dealt upon landing",
        "Destroys trees within 400 radius around Techies upon landing",
        "Can be interrupted by forced movement sources during the leap, but is not interrupted by any other disables. SPELL STEAL This ability's cast point is not modified when acquired"
      ],
      "item_behaviour": [],
      "description": "Techies hurtle themselves into the enemy's midst, detonating charges upon impact which deal massive area of effect damage and silence enemies. Upon landing, the assault deals Techies non-lethal damage equal to a percentage of their current health.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 1+0.9",
        "Cast Range:  1000 ( 1300)",
        "Damage\/Silence Radius: 400",
        "Current Health as Self Damage: 35%\/30%\/25%\/20%",
        "Area Damage: 200\/300\/400\/500 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 400\/500\/600\/700)",
        "Leap Duration: 0.75",
        "Silence Duration: 4\/5\/6\/7",
        "Stun Duration:  1.75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/74\/Techies_Blast_Off%21_1.mp3\/revision\/latest?cb=20191216024800",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": "39\/36\/33\/30 (TagTalent 24\/21\/18\/15)",
      "aghanim": null,
      "name": "Blast Off!",
      "cooldown": "100\/125\/150\/175",
      "legacy_key": "C",
      "story": "Where we going?"
    },
    {
      "notes": [
        "This is innate to Techies does not need to be learned",
        "Cannot be placed inside the fountain area",
        "Only 1 sign can exist on the map at a time. Planting a second sign causes the previous one to immediately disappear. The Minefield Sign has no death animation, it visually linger for a few seconds and then sink into the ground",
        "The invulnerability is granted by an aura and lingers for 0.5 seconds. The aura only affects  Proximity Mines. Other ward-type units are not affected",
        "The sign is permanently phased and it can be seen by everyone",
        "It neither blocks unit pathing, nor blocks neutral creep camps. SPELL STEAL This ability is not acquirable"
      ],
      "item_behaviour": [],
      "description": "Plant a warning sign to remind enemies to step lightly. Only one sign can exist at a time. Lasts 1 seconds.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 1+0.53",
        "Cast Range:  10",
        "Mines Invulnerability Radius: 500",
        "Max Signs: 1",
        "Duration: 60",
        "Aura Linger Duration: 0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Techies_Minefield_Sign.mp3\/revision\/latest?cb=20191216024803",
      "effects": [
        "Ability: Target Area",
        "Affects: Proximity Mine"
      ],
      "mana": "60",
      "aghanim": null,
      "name": "Minefield Sign",
      "cooldown": "0",
      "legacy_key": "G",
      "story": "Watch your step!"
    },
    {
      "notes": [
        "Techies gets all 3 charges immediately upon learning Proximity Mines",
        "Proximity Mines cannot be placed within 350 radius of other allied Proximity Mines. When selecting the ability, all own Proximity Mines display a red circle, indicating their trigger radius. The area targeting indicator upon selecting the ability shows this placement radius, and not the trigger radius",
        "The mines cannot be triggered during the 1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0.2)-second activation delay. During this delay, Proximity Mines are visible to the enemies. Once active, they turn invisible",
        "It takes a total of 2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1.2) seconds for a Proximity Mine to detonate when placed right next to an enemy unit or building",
        "The mines only detonate when an enemy stands within its trigger radius for 1 second. This means quickly entering and leaving the area does not cause them to trigger. Upon entering its trigger radius, the mine emits a sound, warning the enemy that they are within the trigger radius. Both the warning and mine explosion sound is audible to everyone through the Fog of War. Can be triggered by invisible, but not by invulnerable or hidden units. Proximity Mines cannot be triggered by or affect wards and units with flying movement. If the enemy leaves the area or turns invulnerable, the mine turns invisible again and the detonation delay resets",
        "Despite the ability description, Proximity Mines does not have True Sight immunity against the following abilities:  Chronosphere and   Waning Rift. Although being able to see Proximity Mines with  Reveal, it is not attackable",
        "Proximity Mines only damage and debuff enemies when they are triggered, not when they are destroyed by attacks. The damage source is the mine itself, meaning certain on-damage effects (e.g.  Damage Return) react on the mine rather than on Techies. The damage is based on the current level as it detonates, and not as it was placed. The mines deal 200\/287.5\/375 ‒ 400\/575\/750 ( 60\/86.25\/112.5 ‒ 120\/172.5\/225) damage (before reductions) based on the distance and dealing full damage within a 150 radius. Provides 300 radius flying vision at its location for 1 second after detonating",
        "Proximity Mines first apply the magic resistance reduction, then the damage. Reduces most heroes' magic resistance to 14%\/10%\/6%. Stacks multiplicatively with other sources of magic resistance. Multiple instances of the debuff do not stack, but refresh the debuff instead. However, it does not reduce the buildings' magic resistance",
        "Proximity Mines do not block neutral creep camps",
        "Leveling up ability immedaitely update Proximity Mines' ability values"
      ],
      "item_behaviour": [],
      "description": "Plant an invisible mine that cannot be detected by True Sight, but is visible if an enemy is within the active 500 AoE of the mine. Mines detonate if an enemy is standing within the active AoE for 1 seconds dealing damage and temporarily reducing the enemy's magic resistance. The explosion deals full damage if the target is within 150 radius and decreases up to 50% on the edge. Deals 30% damage to buildings.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0.47",
        "Cast Range:  400",
        "Min Plant Distance: 350",
        "Max Damage Radius: 150",
        "Trigger\/Min Damage Radius: 500",
        "Activation Delay: 1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0.2)",
        "Detonation Delay: 1",
        "Damage: 400\/575\/750",
        "Min Damage Percentage: 50%",
        "Building Damage Percentage: 30%",
        "Magic Resistance Reduction: 15%\/20%\/25%",
        "Debuff Duration: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Techies_Proximity_Mines_1.mp3\/revision\/latest?cb=20191216024807",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Proximity Mines",
      "cooldown": "19\/17\/15 ( 16\/14\/12)",
      "legacy_key": "R",
      "story": "The bane of Toterin!"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 19.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.0,
    "attrAgilityInc": 1.3,
    "attrAgility": 14.0
  },
  "description": "Surprises enemies with invisible landmines and explosive attacks. Techies Demolitions was not so much a business as it was an excuse for Squee, Spleen, and Spoon to practice their favorite hobby: Blowin' stuff up. For them, battle is a matter of mischief. Giggling while they place misleading Minefield Signs, lob Sticky Bombs around the battlefield, hiding their renowned Proximity Mines they buried beneath Toterin that collapsed the town into a heap of rubble, testing their latest invention — a disarming zaps firing Reactive Tazer, and much more. Techies Demolitions handles dissatisfied customers with unexpected cheer. Their last words \"Blast Off!\" can be heard just before an epic and reckless explosion delivers enough to leave most enemies dead. Or at least enraged. Often both.  Nuker Disabler ★★☆",
  "trivia": [
    "Before their release, Techies were showcased at the All-Star match of The International 2014, used by Artour \"Arteezy\" Babaev. He originally picked Sniper, but right before the picking phase ended, his pick got replaced by Techies, fireworks were launched in the arena, Techies' portrait was shown on all screens and this Link▶️ sound effect played.",
    "According to Techies' in-game lip syncing, Squee is the one sitting on the cart with the rocket launcher, the cigar, and the deeper voice, Spleen is the big one pushing the cart, with the high voice, and Spoon is the one inside the barrel, who rarely ever talks, but has the deepest sounding voice.",
    "Spoon's design --long nose, revealed half of his fingers-- was largely resembles of Kilroy, the symbol which used by US serviceman during World War II.",
    "Techies' lines Link▶️ \"They're going to have to glue you back together! Yeah, in Hell!\" and Link▶️ \"We're a sorry buncha losers. You said it\" are references to similar lines lines spoken by the Demoman from Team Fortress 2 (as heard here and here).",
    "The flavor text of Pinpoint Detonate \"Kablooey!\" is a direct reference to the line \"Kabloeey!\" spoken by the Demoman from Team Fortress 2.",
    "Many of their lines also reference Counter-Strike, such as Link▶️ \"Counter-Techies Win\", Link▶️ \"Bomb has been planted\" or Link▶️ \"Bomb has been defused. Darn!\".",
    "Techies' attack line Link▶️ \"See! Fore!\" is a pun on the plastic explosive C-4.",
    "The line Link▶️ \"Who said we couldn't count to three, huh?\" is a reference to a joke about the fact that Valve has not released a single game with the number three in the title (Half-Life 3, Left 4 Dead 3, Portal 3 etc.).",
    "The line Link▶️ \"Continue testing.\" is a reference to GLaDOS, a character of Valve's Portal series.",
    "The line Link▶️ \"Claymore! But not that kind of claymore.\" is a reference to the M18 Claymore mine.",
    "The gag about Spoon being hidden in a barrel without the other two knowing is a reference to DotA, where only some time after Techies were released did people realize that there were actually three of them instead of two; the third one's feet could barely be seen under the barrel behind the other two (Techies used to be named \"Squee and Spleen\" and eventually became \"Squee, Spleen and Spoon\"). The name \"Spoon\" may be a reference to a scene from the movie Matrix where a boy bends a spoon with his mind and then says to Neo \"Do not try and bend the spoon. That's impossible. Instead, only try to realise the truth\", followed by Neo asking: \"What truth?\" and the boy answering it with \"There is no spoon. Then you'll see, that it is not the spoon that bends, it is only yourself.\"[1] Squee and Spleen think that Spoon died to the explosion in their workshop, so they thought \"there is no Spoon\" anymore and the voice is only in their heads Link▶️.",
    "The name \"Spoon\" may be a reference to a scene from the movie Matrix where a boy bends a spoon with his mind and then says to Neo \"Do not try and bend the spoon. That's impossible. Instead, only try to realise the truth\", followed by Neo asking: \"What truth?\" and the boy answering it with \"There is no spoon. Then you'll see, that it is not the spoon that bends, it is only yourself.\"[1]",
    "Squee and Spleen think that Spoon died to the explosion in their workshop, so they thought \"there is no Spoon\" anymore and the voice is only in their heads Link▶️.",
    "The names of the original two Techies most likely came from Magic the Gathering. Squee is a legendary goblin from Magic the Gathering lore, while Spleen was probably named after the flavor text on the Goblin Soothsayer card (\"I see a great victory and rivers of blood. And . . . hmm, looks like a spleen.\")",
    "There is a hidden trollface in Remote Mines' ability icon.",
    "Squee's design resembles that of the Soldier from Team Fortress 2, as his eyes are covered by a helmet, and he wields what appears to be a rocket launcher.",
    "The line Link▶️ \"Loud noises!\" is a reference to Brick Tamland, a character from Anchorman: The Legend of Ron Burgundy."
  ],
  "history": "In the storied saga of Dredger's Bight, no business has ever been more reviled than Techies Demolitions. Then again, Dredger's Bight no longer exists. Nor does Toterin. Or even Trapper Town. In fact, if one were to track the history of Techies Demolitions they might notice that shortly after Techies appear, towns tend to disappear. Like every inevitable disaster surrounding Techies, the obliteration of Dredger's Bight began with an invention. Tasked with designing a safer way of detonating explosives in the mines beneath the city, pyrotechnic prodigies Squee, Spleen, and Spoon developed their most outlandish creation yet: a button which, when pressed, would trigger a distant device to spark a fuse. Overeager to test their invention, the trio stuffed barrel after barrel with flamesalt explosives, piling every corner of their tiny workshop high with the newly developed remote bombs. From this stockpile they plucked a single payload, burying it in a far away field. As they cowered in a ditch, Spleen pressed the detonator button. Yet after a moment, nothing happened. Confused, he stood up, pressing his button again and again until, finally, an explosion tore a hole in the field. Elated, Squee and Spleen turned toward home just as a massive wave of sound and force arrived to knock them over. Bewildered, their ears ringing from the unexpected blast, they gathered in the dingy miasma to see a smoking ruin where their workshop once stood. Chunks of wood and stone continued to fall as the yawning crater before them slowly deepened into an expanding pit. The whole of Dredger's Bight shuddered, and then gradually started to slide into the mines below as its panicked residents fled. Sitting at the edge of their sinking home they grinned and giggled, as giddy at the possibilities as they were oblivious to the scorn of their former neighbors. They wondered only one thing: how could they trigger an even bigger blast?",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+252 Damage",
        "talent_left": "-0.8s Proximity Mines Activation Delay"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+125 Sticky Bomb Latch\/Explosion Radius",
        "talent_left": "-15s Blast Off! Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+200 Blast Off! Damage",
        "talent_left": "+3 Mana Regen"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+20% Magic Resistance",
        "talent_left": "-3s Proximity Mines Cooldown"
      }
    ],
    "notes": [
      "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Techies's magic resistance to 40%.",
      "Increases Techies's magic resistance to 40%.",
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
    ]
  }
}