{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Warlock_Fatal_Bonds_1.mp3\/revision\/latest?cb=20191216030434",
      "effects": [
        "Ability: Target Unit",
        "Affects: Units",
        "Damage: Source Type"
      ],
      "notes": [
        "Fatal Bonds have no bounce delay, so all targets are bonded and damaged at the same time.",
        "When cast multiple times, it searches and prioritizes enemies which were not debuffed by the previous cast, and then it searches for the next closest units. The debuff can still stack on the same units if no other previously bonded units are nearby. Can bond units inside the Fog of War, but cannot bond invisible units. Does not affect Roshan at all. Successive casts of Fatal Bonds fully stack and work independently from each other.",
        "The debuff can still stack on the same units if no other previously bonded units are nearby.",
        "Can bond units inside the Fog of War, but cannot bond invisible units.",
        "Does not affect Roshan at all.",
        "Successive casts of Fatal Bonds fully stack and work independently from each other.",
        "Damage shared is the same type as the source damage. Shares all 3 damage types, but not from HP Removal effects (e.g. Sunder). Therefore, the shared damage interacts with every on-damage effects (i.e. disabling Blink Dagger). Shared physical damage and magical damage is still affected by damage block and magic resistance respectively. It is also fully affected by outgoing damage manipulation, if the amplification is sourced to Warlock. Instant kill effects in the form of HP Removal (e.g. Sacred Arrow on creeps) shares an instance of 0 damage to all affected targets. Fully procs on-damage effects such as Corrosive Skin, except those which have a minimum damage threshold (e.g. Gravekeeper's Cloak).",
        "Shares all 3 damage types, but not from HP Removal effects (e.g. Sunder).",
        "Therefore, the shared damage interacts with every on-damage effects (i.e. disabling Blink Dagger).",
        "Shared physical damage and magical damage is still affected by damage block and magic resistance respectively.",
        "It is also fully affected by outgoing damage manipulation, if the amplification is sourced to Warlock.",
        "Instant kill effects in the form of HP Removal (e.g. Sacred Arrow on creeps) shares an instance of 0 damage to all affected targets. Fully procs on-damage effects such as Corrosive Skin, except those which have a minimum damage threshold (e.g. Gravekeeper's Cloak).",
        "Fully procs on-damage effects such as Corrosive Skin, except those which have a minimum damage threshold (e.g. Gravekeeper's Cloak).",
        "Fatal Bonds' damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.",
        "Spreads the full damage value before the affected enemy targets actually take the damage. This means that the damage spreads before all manipulations, so that it may only be affected by incoming damage manipulation the affected targets have. This also means it shares damage instances that exceeded the targets' current health and killed them. The shared damage is always sourced to Warlock. Therefore, if a unit dies to the damage done by Fatal Bonds, Warlock gets credited for the kill.",
        "This means that the damage spreads before all manipulations, so that it may only be affected by incoming damage manipulation the affected targets have.",
        "This also means it shares damage instances that exceeded the targets' current health and killed them.",
        "The shared damage is always sourced to Warlock. Therefore, if a unit dies to the damage done by Fatal Bonds, Warlock gets credited for the kill.",
        "The distance between the bonded units does not matter. Once bonded, they always spread and\/or receive the spread damage.",
        "Non-player-controlled units are not aggro'd by the damage. Neutral creeps do not react to the damage.",
        "Neutral creeps do not react to the damage.",
        "Increases the total damage output of every damage by 60%\/80%\/100%\/120% (TagTalent 75%\/95%\/115%\/135%) when the maximum amount of units is bonded."
      ],
      "mana": "36\/30\/24\/18",
      "item_behaviour": [],
      "name": "Fatal Bonds",
      "cooldown": "110\/120\/130\/140",
      "description": "Binds several enemy units together, causing a percentage of the damage dealt to one of them to be felt by the others.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range:  1000",
        "Bounce Distance: 700",
        "Number of Bounces: 6",
        "Damage Shared: 12%\/16%\/20%\/24% ( 15%\/19%\/23%\/27%)",
        "Bonds Duration: 25"
      ],
      "legacy_key": "F",
      "story": "An ancient incantation that links the vital energies of multiple lifeforms into one collective body."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5e\/Warlock_Shadow_Word_1.mp3\/revision\/latest?cb=20191216030441",
      "effects": [
        "Ability: Target Unit",
        "Affects: Units",
        "Damage: Magical"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self.",
        "Can be cast on allied Couriers.",
        "Deals damage or heals in 1-second intervals, starting 1 second after cast, resulting in 10 instances.",
        "Can deal up to 150\/250\/350\/450 (TagTalent 400\/500\/600\/700) damage to the target (before reductions), or heal for the same amount of health if cast on an ally. TALENT NOTES Learning the damage and heal increasing talent does not update already existing modifiers.",
        "TALENT NOTES Learning the damage and heal increasing talent does not update already existing modifiers.",
        "Successive casts of Shadow Word fully stack and work independently from each other.",
        "The first sound is played when the target is an ally, and the second sound when it is an enemy.",
        "SHARD NOTES Shadow Word now turns into a 450 radius area-targeted ability, so that it cannot directly target units anymore. ↓↓ Double-tapping centers the radius around Warlock. Can target invisible units and units inside the Fog of War.",
        "↓↓ Double-tapping centers the radius around Warlock.",
        "Can target invisible units and units inside the Fog of War."
      ],
      "mana": "14 (TagTalent 10)",
      "item_behaviour": [],
      "name": "Shadow Word",
      "cooldown": "120\/130\/140\/150",
      "description": "Warlock whispers an incantation, healing a friendly unit or damaging an enemy unit over time.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.4+0.6",
        "Cast Range:  600\/700\/800\/900",
        "Damage\/Heal per Second: 15\/25\/35\/45 ( 40\/50\/60\/70)",
        "Duration: 10",
        "Radius: 450"
      ],
      "legacy_key": "W",
      "story": "Warlock arcane arts have a myriad of uses, allowing them to be powerful friendly enchantments or damaging curses."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Warlock_Upheaval.mp3\/revision\/latest?cb=20191216030444",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies ",
        "Damage: Magical"
      ],
      "notes": [
        "The strength of the Upheaval is based on Warlock's channel duration, not on how long a unit stands in the affected area. Both the debuff and buff values are applied and\/or refreshed in the same intervals.",
        "Both the debuff and buff values are applied and\/or refreshed in the same intervals.",
        "Upheaval's ability values increases as follows on each server tick, starting 1 tick after cast: The movement speed slow increases by 0.33%\/0.5%\/0.67%\/0.83% per tick, taking 5.5\/4.67\/4.25\/4 seconds to reach max values. The damage per second increases by 1.17\/2\/2.83\/3.67 damage per tick, taking 3.5\/6\/8.5\/11 seconds to reach max values. TALENT NOTES The ally attack speed bonus talent increases by 0.4 attack speed bonus per tick, taking 5.83 seconds to reach max values. Learning the talent immediately updates the current instance.",
        "The movement speed slow increases by 0.33%\/0.5%\/0.67%\/0.83% per tick, taking 5.5\/4.67\/4.25\/4 seconds to reach max values.",
        "The damage per second increases by 1.17\/2\/2.83\/3.67 damage per tick, taking 3.5\/6\/8.5\/11 seconds to reach max values.",
        "TALENT NOTES The ally attack speed bonus talent increases by 0.4 attack speed bonus per tick, taking 5.83 seconds to reach max values. Learning the talent immediately updates the current instance.",
        "Learning the talent immediately updates the current instance.",
        "With the max channel time and the debuff duration, it can deal up to a total 358.75\/660\/998.75\/1375 damage (before reductions) within the area for the entire duration. For how much damage Upheaval deals per increased second, please refer to the chart below.",
        "For how much damage Upheaval deals per increased second, please refer to the chart below.",
        "Successive damage per second debuffs of Upheaval fully stack and work independently from each other. However, successive debuffs applied update its movement speed slow values and refreshes its duration.",
        "However, successive debuffs applied update its movement speed slow values and refreshes its duration."
      ],
      "mana": "35",
      "item_behaviour": [],
      "name": "Upheaval",
      "cooldown": "70\/80\/90\/100",
      "description": "A powerful slowing current that grows stronger as it's channelled. Lasts up to 10\/12\/14\/16 seconds. Enemies are slowed for 3 seconds after leaving the area or the spell ends.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.4+0",
        "Cast Range:  900",
        "Radius: 500\/550\/600\/650 ( 575\/625\/675\/725)",
        "Max Channel Time: 10\/12\/14\/16",
        "Damage Increase per Second: 10",
        "Max Damage per Second: 35\/60\/85\/110",
        "Move Speed Slow Increase per Second: 10%\/15%\/20%\/25%",
        "Max Move Speed Slow: 55%\/70%\/85%\/100%",
        "Buff\/Debuff Duration: 3",
        "<span image=\"images\\Talent\"><\/span> Ally Attack Speed Bonus Increase per Second: 12",
        "<span image=\"images\\Talent\"><\/span> Ally Max Attack Speed Bonus: 70"
      ],
      "legacy_key": "E",
      "story": "Demnok manipulates space-time, impairing entire armies."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/ff\/Warlock_Chaotic_Offering_1.mp3\/revision\/latest?cb=20191216030434",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies"
      ],
      "notes": [
        "Warlock Golems are always summoned at the center of the targeted area. They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "Successive casts of Chaotic Offering do not replace any of the currently active Warlock Golems from a previous cast. Leveling up the ability, learning the magic resistance or armor increasing talents does not update already existing golems.",
        "Leveling up the ability, learning the magic resistance or armor increasing talents does not update already existing golems.",
        "Upon spawning, Warlock Golems destroy all trees within 600 radius around them.",
        "The visual effects and sounds during the effect delay are visible and audible to everyone. It also plays a sound effect during the cast time, which is audible to everyone as well.",
        "It also plays a sound effect during the cast time, which is audible to everyone as well.",
        "Does not affect enemy Couriers.",
        "SCEPTER NOTES Chaotic Offering now summons a second golem 0.2 seconds after the first golem. The second golem applies the area stun and destroys all trees within the radius as well, effectively extending the total stun duration to 1.2 seconds.",
        "The second golem applies the area stun and destroys all trees within the radius as well, effectively extending the total stun duration to 1.2 seconds.",
        "TALENT NOTES The Golem on Death talent automatically and passively casts Chaotic Offering centered on Warlock's death location whenever he dies. Does not trigger when Warlock has Reincarnation. Applies the area stun like a manual cast and summons 1 Warlock Golem. The Golem lasts its full duration, it is not bound to Warlock's death timer and does not disappear when he respawns. Chaotic Offering notes and all of Warlock Golem's talents fully apply. The Aghanim's Scepter upgrades are not applied to this on-death passive cast.",
        "Does not trigger when Warlock has Reincarnation.",
        "Applies the area stun like a manual cast and summons 1 Warlock Golem.",
        "The Golem lasts its full duration, it is not bound to Warlock's death timer and does not disappear when he respawns.",
        "Chaotic Offering notes and all of Warlock Golem's talents fully apply.",
        "The Aghanim's Scepter upgrades are not applied to this on-death passive cast."
      ],
      "mana": "160",
      "item_behaviour": [],
      "name": "Chaotic Offering",
      "cooldown": "250\/375\/500",
      "description": "Summons a Golem from the depths, stunning enemies for one second. The Golem lives 60 seconds, takes reduced damage from spells, has Permanent Immolation and Flaming Fists on attack.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.5+0.7",
        "Cast Range:  1000",
        "Stun Radius: 600",
        "Effect Delay: 0.5",
        "Number of Golems: 1 ( 2)",
        "Stun Duration: 1",
        "Golem Duration: 60",
        "Golem Spawn Interval: 0.2",
        "<span image=\"images\\Talent\"><\/span> Number of Golems on Death: 1"
      ],
      "legacy_key": "R",
      "story": "Demnok unleashes the captive spirit in his Dreadwood staff, causing destruction in enemy ranks."
    },
    {
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "notes": [
        "Neither affects buildings and wards, nor damages ethereal or attack immune units.",
        "The radius is centered around the attacked target. The bonus damage hits the attack target as well.",
        "The bonus damage hits the attack target as well."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Flaming Fists",
      "cooldown": null,
      "description": "Deals extra damage to nearby units when attacking.",
      "hot_key": "?",
      "params": [
        "Radius: 300",
        "Damage: 40\/50\/60"
      ],
      "legacy_key": "",
      "story": null
    },
    {
      "audioUrl": "",
      "effects": [
        "Ability: Aura",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Permanent Immolation of multiple Warlock Golems fully stacks with each other.",
        "Permanent Immolation is an aura and its debuff lingers for 0.5 seconds. Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 59 possible instances. Can deal up to 1770\/2950\/4130 damage (before reductions) within the area per golem over the entire duration.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 59 possible instances.",
        "Can deal up to 1770\/2950\/4130 damage (before reductions) within the area per golem over the entire duration."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Permanent Immolation",
      "cooldown": null,
      "description": "Burns the Golem's nearby enemy units, with damage per second.",
      "hot_key": "?",
      "params": [
        "Radius: 300",
        "Damage per Second: 30\/50\/70",
        "Aura Linger Duration: 0.5"
      ],
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 24.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 1.0,
    "attrAgility": 10.0
  },
  "description": "Summons powerful demons to fight at his side. In the endless pursuit of rare texts, Demnok Lannik found it necessary to learn the magics that would help him reach the most inaccessible tomes. In short time, his obsessive study made him the most powerful Warlock in the academy. As he whispers a versatile Shadow Word to heal fellow adventurers, or damage hostile creatures. Binding his foes together with Fatal Bonds forcing them to share their agony. Demnok Lannik brings a Chaotic Offering to every fight. Mired in a dimensional Upheaval, not even an army can hold long against his dark spells, especially his Permanently Immolated Golems.  Support Initiator Disabler ★☆☆",
  "trivia": [
    "In DotA, Warlock's ultimate is named Rain of Chaos and the summoned unit was called an Infernal, a hulking golem with green-colored flames. Both names were changed in the transition to Dota 2 to avoid copyright conflicts.",
    "Warlock is related to Disruptor and Axe, as he comes from the Oglodi race.",
    "Warlock's response Link▶️ \"Just for that, I'm unfiending you.\" when killed is probably a play on \"Unfriending you\" an action in the popular social network Facebook where a person removes another from their friend list.",
    "The response Link▶️ \"Bloodied but unbowed\" when respawning is a reference to William Ernest Henley's poem \"Invictus\".[1]",
    "Fatal Bonds' sound effect is based on this Link▶️ otherwise unused voice line.",
    "One of Warlock's respawn lines is Link▶️ \"Dark interval'\", which is likely a reference to the song of the same name featured in the credits of Half-Life 2: Episode 2, another game by Valve. It is also a reference to the metaphor \"interval of darkness\" that the Vortigaunts of the Half-Life series use for death, which is implied to be temporary for them, hence the word \"interval\" to describe the period of death that comes after their reincarnation.[2]"
  ],
  "history": "As Chief Curator and Head of Acquisitions for the Arcane Archives of the Ultimyr Academy, Demnok Lannik was tireless in his pursuit of lost, rare and forbidden tomes. No cursed temple was so foreboding, no cavern path so treacherous, that any concern for his own survival could dissuade him from entering if rumors hinted that some pamphlet of primordial lore might still survive in its depths. However, so often did his investigations trigger the wrath of protector entities, that he finally found it necessary to master the arts of magic. He bent himself to learning sorcery with the same thorough obsessiveness that marked his quest for incunabula, becoming the most powerful Warlock of the Academy in less time than most practitioners required to complete a course of undergraduate work. Almost as an afterthought, he carved a staff of Dreadwood and summoned into it a captive spirit from the Outer Hells. And anticipating the day when he will have recovered every last lost spellbook, he has commenced writing his own Black Grimoire. It will undoubtedly be instructive.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+20 Chaotic Offering Golems Armor",
        "talent_left": "80% Magic Resistance for Chaotic Offering Golems"
      },
      {
        "talent_lvl": "20",
        "talent_right": "Summons a Golem on Death",
        "talent_left": "+25 Shadow Word Damage\/Heal"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+12s Upheaval Attack Speed per second on Allies",
        "talent_left": "-4s Shadow Word Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+3% Fatal Bonds Damage",
        "talent_left": "+75 Upheaval Radius"
      }
    ]
  }
}