{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/62\/Pudge_Meat_Hook_1.mp3\/revision\/latest?cb=20191216022014",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ Союзников",
        "Урон: Чистый"
      ],
      "notes": [
        "Крюк летит со скоростью 1450, достигая максимального расстояния за 0,9 сек.",
        "При применении Pudge получает скрытый модификатор, обезвреживающий героя. Длительность модификатора равна времени, необходимому для преодоления крюком 66% максимального расстояния. То есть при стандартном максимальном расстоянии в 1300 модификатор самообезвреживания длится 0,59 сек. Длительность рассчитывается от максимального расстояния (включая бонусы к дальности) и не учитывает фактически преодаленное расстояние. То есть при захвате существа перед Pudge самообезвреживание будет действовать на свое полное значение.",
        "Длительность модификатора равна времени, необходимому для преодоления крюком 66% максимального расстояния.",
        "То есть при стандартном максимальном расстоянии в 1300 модификатор самообезвреживания длится 0,59 сек.",
        "Длительность рассчитывается от максимального расстояния (включая бонусы к дальности) и не учитывает фактически преодаленное расстояние.",
        "То есть при захвате существа перед Pudge самообезвреживание будет действовать на свое полное значение.",
        "Крюк цепляет существ на расстоянии до 1400 единиц (складывается из максимального расстояния и радиуса захвата). Центром радиуса захвата является верхушка крюка. Приближение к остальным частям крюка никакого эффекта не даст.",
        "Центром радиуса захвата является верхушка крюка. Приближение к остальным частям крюка никакого эффекта не даст.",
        "Действует на существ только при запуске, но не при втягивании. Действует на невидимых существ. Не может зацепить древних крипов, спрятанных или неуязвимых существ. Крюк проходит сквозь непроходимую территорию и деревья и может протаскивать через них существ.",
        "Не может зацепить древних крипов, спрятанных или неуязвимых существ.",
        "Крюк проходит сквозь непроходимую территорию и деревья и может протаскивать через них существ.",
        "Зацепленные враги обезвреживаются на всю длительность притягивания. Союзники не обезвреживаются. Во время притягивания они могут свободно действовать.",
        "Союзники не обезвреживаются. Во время притягивания они могут свободно действовать.",
        "При захвате существа крюк в этой области дает летающий обзор в радиусе 500 единиц на 4 секунды.",
        "Если крюк цепляет за враждебное существо, которое не является героем, древним крипом или крипом-героем, то мгновенно убивает его. Здоровье крипа наносится ему в виде отнимающего здоровье урона.",
        "Здоровье крипа наносится ему в виде отнимающего здоровье урона.",
        "Может притягивать руны. При попадании затраченная маны восполняется."
      ],
      "mana": "21\/18\/15\/12 (TagTalent 17\/14\/11\/8)",
      "item_behaviour": [],
      "name": "Meat Hook",
      "cooldown": "110",
      "description": "Бросает окровавленный крюк в указанную цель или в выбранном направлении. Крюк зацепится за первое существо, в которое попадёт, и притащит его к владельцу способности. Вражеские герои получают от крюка урон, а крипы, не являющиеся древними, сразу погибают.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,59",
        "Дальность применения: 1300",
        "Макс. расстояние: 1300",
        "Радиус захвата: 100",
        "Урон: 150\/220\/290\/360 ( 270\/340\/410\/480)"
      ],
      "legacy_key": "T",
      "story": "Крюк мясника — это воплощение кошмара: его изогнутое лезвие всем своим видом требует крови."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Pudge_Rot.mp3\/revision\/latest?cb=20191216022017",
      "effects": [
        "Способность: Переключаемая",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "При переключении Rot не прерывает произносимые заклинания Pudge.",
        "Урон по себе не смертелен, поэтому им нельзя добить себя.",
        "Урон по области и урон по себе не связаны друг с другом, поэтому при блокировке урона по себе урон по области все равно применяется.",
        "Замедление и урон представлены в виде ауры. Дебафф ауры задерживается на 0,5 сек. Если враги покидают область, то оставшийся дебафф продолжает замедлять и наносить урон до завершения. Если Rot отключается, то дебафф продолжает замедлять, но больше не наносит урон.",
        "Если враги покидают область, то оставшийся дебафф продолжает замедлять и наносить урон до завершения.",
        "Если Rot отключается, то дебафф продолжает замедлять, но больше не наносит урон.",
        "Наносит 6\/12\/18\/24 (26\/32\/38\/44) урона с интервалом в 0,2 секунды. Временной интервал устанавливается при первой активиции Rot. Если герой обезмолвлен, оглушен или спрятан, то нельзя.",
        "Временной интервал устанавливается при первой активиции Rot.",
        "Если герой обезмолвлен, оглушен или спрятан, то нельзя.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Дебафф также применяет уменьшение лечения, восстановления здоровья, вампиризма и вампиризма заклинаний. Мгновенно увеличивает урон при получении Aghanim's Scepter, если способность включена, но не радиус.",
        "Мгновенно увеличивает урон при получении Aghanim's Scepter, если способность включена, но не радиус."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Rot",
      "cooldown": "0",
      "description": "Ядовитое облако, которое замедляет врагов и наносит значительный урон как им, так и владельцу способности.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 250 ( 450)",
        "Урон в секунду: 30\/60\/90\/120 ( 130\/160\/190\/220)",
        "Замедление скорости передвижения: 14%\/20%\/26%\/32% ( 30%\/36%\/42%\/48%)",
        "Длительность задержки ауры: 0,5",
        "Уменьшение восстановления здоровья: 25%"
      ],
      "legacy_key": "R",
      "story": "Чувствуете удушающий запах гнили? Это ядовитый газ, что источает прелая пухнущая плоть мясника."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "При применении не прерывает произносимые способности Pudge.",
        "Flesh Heap отрицает часть полученного урона (после всех снижений) вплоть до 0, из-за чего некоторые срабатывающие от получения эффекты не применяются. Не отрицает урон, если герой находится под действием Aphotic Shield, Defense Matrix, Resonant Pulse или Refraction.",
        "Не отрицает урон, если герой находится под действием Aphotic Shield, Defense Matrix, Resonant Pulse или Refraction.",
        "Несколько успешных применений не сочетаются, но обновляются длительность.",
        "После получения заряда над головой героя появляется надпись +1, информирующая о увеличении значения. Число эффектов указано на иконке эффекта способности, а количество полученной силы отражается в описании эффекта. Любой герой может увидеть это.",
        "Число эффектов указано на иконке эффекта способности, а количество полученной силы отражается в описании эффекта. Любой герой может увидеть это.",
        "Добитый вражеский герой так же дает заряд, если он был в пределах 450 от Pudge. Для получения силы вне стандартного радиуса Pudge должен сам добить врага. Убийство подконтрольными существами или иллюзиями не засчитывается. Дает только один заряд за клонов Meepo независимо от их числа.",
        "Для получения силы вне стандартного радиуса Pudge должен сам добить врага. Убийство подконтрольными существами или иллюзиями не засчитывается.",
        "Дает только один заряд за клонов Meepo независимо от их числа.",
        "Не получает силу при следующих условиях: Если у погибшего было воскрешение. От иллюзии или Tempest Double. Если Pudge в момент убийства мертв.",
        "Если у погибшего было воскрешение.",
        "От иллюзии или Tempest Double.",
        "Если Pudge в момент убийства мертв.",
        "Каждый заряд дает 160\/280\/400\/520 здоровья, 0,8\/1,4\/2\/2,6 восстановления здоровья и 8\/14\/20\/26 урона.",
        "Каждый эффект даёт 22\/28\/34\/40 (TagTalent 33\/42\/51\/60) здоровья, 0,11\/0,14\/0,17\/0,2 (TagTalent 0,17\/0,21\/0,26\/0,3) восстановления здоровья и 1,1\/1,4\/1,7\/2 (TagTalent 1,65\/2,1\/2,55\/3) урона.",
        "При поднятии уровня Flesh Heap все заряды адаптируются к новым значениям.",
        "ПРИМЕЧАНИЯ К SPELL STEAL \/ ПРИМЕЧАНИЯ К MORPH Бонусная сила за смерти врагов даётся, пока способность активна, и теряется вместе с потерей способностью."
      ],
      "mana": "20\/19\/18\/17",
      "item_behaviour": [],
      "name": "Flesh Heap",
      "cooldown": "35\/50\/65\/80",
      "description": "Способность гарантированно блокирует часть урона от любых типов атак, а также даёт дополнительную силу за каждого убитого или погибшего поблизости вражеского героя. Эффекты накапливаются с начала игры, но герой получит силу только после изучения способности.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус от умершего врага: 450",
        "Радиус учета убийства: 1600",
        "Доп. сила за заряд: 1,1\/1,4\/1,7\/2 ( 1,65\/2,1\/2,55\/3)",
        "Блок урона: 8\/14\/20\/26 ( 12\/21\/30\/39)",
        "Длительность: 5\/6\/7\/8"
      ],
      "legacy_key": "F",
      "story": "Мясник не понаслышке знает, каково это — быть толстокожим."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Pudge_Eject.mp3\/revision\/latest?cb=20200827134123",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Союзных героев"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "При применении прерывает произносимые заклинания Pudge.",
        "В начале эта способность неактивна. Становится активной после использования Dismember на союзника. Способность появляется в 4-й ячейке. При применении извергает союзного героя вне зависимости от оставшейся длительности запрета действий. После применения подспособность полностью пропадает из интерфейса и снова становится неактивной до того момента, пока Dismember снова не будет применена на союзника.",
        "Способность появляется в 4-й ячейке.",
        "При применении извергает союзного героя вне зависимости от оставшейся длительности запрета действий.",
        "После применения подспособность полностью пропадает из интерфейса и снова становится неактивной до того момента, пока Dismember снова не будет применена на союзника.",
        "Герой может сам выбраться из Pudge, отдав любой приказ через 3 сек. после поглощения.",
        "Если Pudge умирает, то союзник автоматически выплевывается."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Eject",
      "cooldown": null,
      "description": "Извергнуть проглоченного героя.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Длительность запрета действий союзника: 3"
      ],
      "legacy_key": "E",
      "story": "Жизнь союзника никогда не будет прежней."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/50\/Pudge_Dismember_1.mp3\/revision\/latest?cb=20200419184839",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "Обезвреживает цель на всю длительность произнесения.",
        "Тащит цель к Pudge со скоростью 60\/90\/120. Дебафф притягивания исчезает как только цель оказывается в 125 единицах от Pudge. Раскрывает невидимость цели, но только в случае, если она не была невидима или не уходила в невидимость при применении. Если цель исчезла или стала неуязвимой, то произнесение прерывается.",
        "Раскрывает невидимость цели, но только в случае, если она не была невидима или не уходила в невидимость при применении.",
        "Если цель исчезла или стала неуязвимой, то произнесение прерывается.",
        "Крипы-герои считаются героями.",
        "Урон начинает наноситься сразу после применения способности, затем с интервалом в зависимости от типа существа.",
        "Урон и лечение не связаны друг с другом: способность всегда излечивает на полное значение за интервал независимо от количества полученного целью урона.",
        "Реплики Pudge при использовании Dismember слышны всем даже сквозь туман войны.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Dismember можно использовать на союзных героев, включая клонов и иллюзий, но исключая крипов-героев. При использовании применяет к цели сильное развеивание и позволяет избежать снаряды. Пока союзный герой поглощен, он неуязвим, спрятан и невосприимчив к магии. Герой может сам выбраться из Pudge, отдав любой приказ через сек. после поглощения. Поглощение союзника дает Pudge способность Eject, позволяя выплюнуть его в любой момент. Способность игнорирует длительность запрета. Заклинатель может проглотить только одного героя. Проглатывание нового автоматически выплевывает старого. Во время Dismember союзный герой периодически перемещается к текущему положению носителя. То есть ауры союзника распространяются вокруг Pudge до выплевывания. Периодическое перемещение прерывается эффектами телепортации без извлечения союзника. Они остаются проглоченными в той точке, куда их телепортировало. Восстанавливает всё здоровье союзника за 20 сек. Восстанавливает до 300% от максимального здоровья проглоченного союзника в минуту. Pudge при применении получает скрытый модификатор, создающий над ним визуальный эффект, видимый только союзникам.",
        "При использовании применяет к цели сильное развеивание и позволяет избежать снаряды.",
        "Пока союзный герой поглощен, он неуязвим, спрятан и невосприимчив к магии.",
        "Герой может сам выбраться из Pudge, отдав любой приказ через сек. после поглощения.",
        "Поглощение союзника дает Pudge способность Eject, позволяя выплюнуть его в любой момент. Способность игнорирует длительность запрета.",
        "Заклинатель может проглотить только одного героя. Проглатывание нового автоматически выплевывает старого.",
        "Во время Dismember союзный герой периодически перемещается к текущему положению носителя. То есть ауры союзника распространяются вокруг Pudge до выплевывания.",
        "Периодическое перемещение прерывается эффектами телепортации без извлечения союзника. Они остаются проглоченными в той точке, куда их телепортировало.",
        "Восстанавливает всё здоровье союзника за 20 сек.",
        "Восстанавливает до 300% от максимального здоровья проглоченного союзника в минуту.",
        "Pudge при применении получает скрытый модификатор, создающий над ним визуальный эффект, видимый только союзникам.",
        "ПРИМЕЧАНИЯ К SPELL STEAL Реплики Rubick не глобальны и слышны только ему, а сам Dismember не издаёт звуки лезвий.",
        "ПРИМЕЧАНИЯ К SOULBIND Преждевременное прекращение произнесения заклинания отменяет Dismember только для изначально выбранного врага и не влияет на заклинание для другой цели, даже если эффект привязки уже спал."
      ],
      "mana": "30\/25\/20 (TagTalent 20\/15\/10)",
      "item_behaviour": [],
      "name": "Dismember",
      "cooldown": "100\/130\/170",
      "description": "Герой заживо пожирает врага, оглушая его и нанося периодический урон, который зависит от силы владельца способности и излечивает его. На крипов действует дольше.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 160",
        "Макс. длительность на героях: 3 ( 3,8)",
        "Макс. длительность на крипах: 6 ( 6,8)",
        "Число срабатываний на героях: 6 ( 8)",
        "Число срабатываний на крипах: 9 ( 11)",
        "Начальные урон\/лечение в секунду: 60\/90\/120 ( 108\/162\/216)",
        "Силы в урон\/лечение в секунду: 30%\/60%\/90% ( 54%\/108%\/162%)",
        "Скорость притягивания: 75",
        "Дальность применения на союзников: 400",
        "Лечение союзника от его макс. здоровья: 5%",
        "Длительность запрета действий союзника: 3"
      ],
      "legacy_key": "D",
      "story": "«Есть с падалью одна загвоздка: час как поел — и опять голодный!»"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 25.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.4,
    "attrAgility": 14.0
  },
  "description": "Притягивает врагов своим крюком Каждый точный бросок знаменитого крюка вселяет страх во врагов Pudge, ведь, притянув жертву, он душит её ядовитым газом и расчленяет её своим тесаком. С каждым убийством его здоровье и урон увеличиваются, и вскоре погибель от его рук становится неизбежной.  Контроль Инициация Стойкость Быстрый урон ★★☆",
  "history": "На полях Вечной бойни, далеко на юге от Квойджа, тучная фигура упорно трудится под покровом ночи — убирает, а затем расчленяет, потрошит, сгружает в кучи конечности и внутренние органы павших. И все это лишь для того, чтобы на следующее утро бойня могла повториться. В том проклятом мире ничто не разлагается само по себе — мертвецам никогда не суждено вернуться обратно в землю, и не важно, насколько глубока могила. Окруженный стаями птиц-падальщиков, которым нужны порезанные кусочки трупов, мясник Pudge упражняется с лезвиями, которые затачиваются от резки трупов. Вжик-вжик-тух. Плоть отсекается от костей, связки и сухожилия отрываются как кусочки мокрой бумаги. И хоть у Pudge всегда было пристрастие к мясницкому ремеслу, со временем тучный здоровяк полюбил и то, что получается, когда он заканчивает работу над трупом. Сначала кусочек мускула там, глоточек крови... Вскоре Pudge уже вгрызался в тела самых крепких существ подобно грызущей кость собаке. Даже те, кто не питает страха перед жнецом Смерти, предпочитают не связываться с мясником."
}