{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6a\/Magic_Stick.mp3\/revision\/latest?cb=20141214194053",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Прерывает произносимые заклинания владельца при применении.",
        "Дает 1 заряд когда видимый вражеский юнит, включая нейтральных крипов, использует способность в радиусе.",
        "Не дает заряды от переключаемых способностей, активных модификаторов атаки и способностей срабатывающих от других способностей.",
        "Пассивно срабатывающие способности (например Quill Spray, Borrowed Time, Multicast, Reincarnation) не дают заряды.",
        "Когда враг применяет заклинание в невидимости с Руна невидимости, Shadow Walk, Sand Storm, Moonlight Shadow, Nature's Guise или Spin Web, оно не даст заряд.",
        "Может восстановить до 300 здоровья и маны при максимальном количестве зарядов.",
        "Делит перезарядку с Magic Stick.",
        "При наличии нескольких Magic Wand или Magic Stick в инвентаре, первым заряды получит тот, который был раньше. Если он полон, второй по давности начнёт получать заряды.",
        "При улучшении Magic Stick в Magic Wand, все его текущие заряды будут сохранены."
      ],
      "mana": null,
      "abilityName": "Energy Charge",
      "cooldown": "13",
      "description": "Мгновенно восстанавливает 15 здоровья и маны за каждый имеющийся заряд. Может иметь до 20 зарядов. Получает один заряд каждый раз, когда видимый враг в радиусе 1200 использует способность.",
      "params": [
        "Радиус: 1200",
        "Зарядов за исп. способностей: 1",
        "Максимум зарядов: 20",
        "Восст. здоровья и маны за заряд: 15"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 60 здоровья, 0,3 регенерации здоровья, 0,5 брони, 3 скорости атаки, 36 маны, 0,15 регенерации маны и 3 урона от атаки.",
    "Для героев ловкости, даёт 60 здоровья, 0,3 регенерации здоровья, 0,5 брони, 3 скорости атаки, 36 маны, 0,15 регенерации маны и 3 урона от атаки.",
    "Для героев интеллекта, даёт 60 здоровья, 0,3 регенерации здоровья, 0,5 брони, 3 скорости атаки, 36 маны, 0,15 регенерации маны и 3 урона от атаки."
  ],
  "cost": "450",
  "lore": null,
  "consistFrom": [
    "Magic Stick",
    "Iron Branch",
    "Iron Branch",
    "Recipe"
  ],
  "boughtFrom": "Аксессуары",
  "name": "Magic Wand",
  "description": "Простая волшебная палочка, в которой концентрируют магическую энергию начинающие волшебники и великие колдуны.",
  "trivia": null,
  "upgradeIn": [
    "Holy Locket"
  ],
  "bonuses": [
    "+3 к силе",
    "+3 к ловкости",
    "+3 к интеллекту"
  ],
  "tips": null
}