{"abilities":[{"spell":"Throws a mysterious bolt of energy at the target unit. It stuns for a random duration and deals random damage.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Chaos Bolt travels at a speed of 700.","Stun duration and damage values are shown above the target's head upon hit (visible to allies and enemies), with the duration being shown as a rounded integer. However, the actual stun duration is not by exact seconds, it ranges between the given values (e.g. at level 1, it could stun for 1.74 seconds).","Damage and stun values are inversely related, meaning the longer the stun is, the less damage it deals and vice versa. This means the damage decreases by 12\/6\/4\/6 per each additional 0.1 seconds of stun. Level 1: 1s – 180, 1.25s – 150, 1.5s – 120, 1.75s – 90, 2s – 60 (stun duration – damage) Level 2: 1s – 210, 1.5s – 180, 2s – 150, 2.5s – 120, 3s – 90 (stun duration – damage) Level 3: 1s – 240, 1.75s – 210, 2.5s – 180, 3.25s – 150, 4s – 120 (stun duration – damage) Level 4: 2s – 270, 2.5s – 240, 3s – 210, 3.5s – 180, 4s – 150 (stun duration – damage)","The bolt first applies the debuff, then the damage."],"mana":"140","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"10 ( 8.8)","name":"Chaos Bolt","description":["Cast Animation: 0.4+0.73","Cast Range: 500","Min Damage: 60\/90\/120\/150","Max Damage: 180\/210\/240\/270","Min Stun Duration: 1\/1\/1\/2","Max Stun Duration: 2\/3\/4\/4 ( 4\/5\/6\/6)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Teleports you, any images you have and the target unit to a point along the line between the two of you. Slows the target's movement and attack speed.","effects":["Ability Target Unit","Affects Enemies \/ Self"],"notes":["Reality Rift does not disjoint projectiles.","Teleports Chaos Knight to a point 250\/300\/350\/400 range away from the target's original position, towards Chaos Knight's original cast location. The target is teleported 62 range in front of that location, so they effectively get pulled by 188\/238\/288\/338 range. Chaos Knight's illusions are located around the target from random angles, with same distance to it as Chaos Knight. The location is determined at the beginning of the cast. The visual effects also play at the beginning, revealing the point at which Chaos Knight and his target are about to land. Chaos Knight and his illusions are made to face his target and are issued an attack order against the target.","When cast on Roshan, Chaos Knight and his illusions still get moved, but Roshan does not.","The slow debuff is applied to the target upon cast. Chaos Knight does not need to attack it in order to place the debuff.","The slow from successive casts does not stack, only the duration gets refreshed.","Does not interrupt the target's channeling spells."],"mana":"50","elements":["Cannot be cast while rooted or leashed.","Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"20\/15\/10\/5 ( 17.6\/13.2\/8.8\/4.4)","name":"Reality Rift","description":["Cast Animation: 0.3+0.5","Cast Range: 475\/550\/625\/700","Illusion Search Radius: 1375","Target Pull Distance: 250\/300\/350\/400","Movement Speed Slow: 15%\/25%\/35%\/45%","Attack Speed Slow: 30\/50\/70\/90","Slow Duration: 2"],"hot_key":"W","legacy_key":"E"},{"spell":"Chaos Knight's attacks deal a critical strike of varying strength, in addition to a lifesteal for 50%\/55%\/60%\/65% of the damage.","effects":["Ability Passive","Affects Enemies \/ Self"],"notes":["If two sources of critical strike trigger at the same time, the higher multiplier has priority.","Stacks additively with other sources of lifesteal.","Does not trigger upon attacking wards, buildings, and allies.","The sound and particles play upon start of the attack, not when the attack lands.","Evaded or missed attacks do not cause the ability to go on cooldown.","Only the cooldown reduction from the level 25 talent is displayed. The level 15 talent can further reduce this to 4.4\/3.52\/2.64\/1.76 (6.16\/5.28\/4.4\/3.52 without the level 25 talent)."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"7\/6\/5\/4 ( 5\/4\/3\/2)","name":"Chaos Strike","description":["Minimum Critical Damage: 120%","Maximum Critical Damage: 160%\/190%\/220%\/250%","Lifesteal: 50%\/55%\/60%\/65%"],"hot_key":"E","legacy_key":"R"},{"spell":"Summons several phantasmal copies of the Chaos Knight from alternate dimensions. The phantasms deal 50%\/75%\/100% damage, but take 260% damage.","effects":["Ability No Target ( Target Unit)","Affects Self ( Allied Heroes)"],"notes":["Disjoints projectiles upon cast.","Chaos Knight is invulnerable, hidden and spell immune during the split time.","Applies a basic dispel on Chaos Knight upon cast.","Resets current attack and spell targeting priorities on Chaos Knight.","After the split time, Chaos Knight reappears with his illusions. The reappear locations are based on Chaos Knight's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point. This means when spawning 3 illusions, the formation is T-shaped. The distance in between each is 135 range. Though the formation is always the same, Chaos Knight and his illusions take a random position in the formation and have all the same facing angle.","Orders the caster ( or target) to stop after the split time, canceling all queued orders, and orders given during the split time.","Recasting Phantasm replaces the illusions from the previous cast, no matter under whose control they are.","When upgraded, Phantasm can target allies, creating illusions of them, which then are under Chaos Knight's control. Applies all the effects (disjoint, basic dispel) to the target as well. It also turns invulnerable and hidden shortly, and has a chance to spawn an extra illusion. Double-tapping the ability automatically targets self. Can also be cast on illusions and clones. Cannot be cast on creep-heroes."],"mana":"125\/200\/275","elements":["Pierces spell immunity."],"cooldown":"145 ( 127.6) ( 110, 96.8)","name":"Phantasm","description":["Cast Animation: 0.4+0","Cast Range: 0 ( 1200)","Split Time: 0.5","Number of Illusions: 3","Illusion Damage Dealt: 50%\/75%\/100%","Illusion Damage Taken: 260%","Duration: 30"],"hot_key":"R","legacy_key":"T"}],"bio":"The veteran of countless battles on a thousand worlds, Chaos Knight hails from a far upstream plane where the fundamental laws of the universe have found sentient expression. Of all the ancient Fundamentals, he is the oldest and most tireless, endlessly searching out a being he knows only as \"The Light.\" Long ago the Light ventured out from the progenitor realm, in defiance of the first covenant. Now Chaos Knight shifts from plane to plane, always on the hunt to extinguish the Light wherever he finds it. A thousand times he has snuffed out the source, and always he slides into another plane to continue his search anew. Upon his steed Armageddon he rides, wading into battle with maniacal frenzy, drawing strength from the disorder of the universe. A physical manifestation of chaos itself, in times of need he calls upon other versions of himself from other planes, and together these dark horsemen ride into battle, as unstoppable as any force of nature. Only when the last Light of the world is scoured from existence will the search be ended. Where rides the Chaos Knight, death soon follows.","talentsTips":["The all stats talent effectively grants Chaos Knight 112.5 health, 0.63 health regen, 0.5% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction.","The strength talent effectively grants Chaos Knight 337.5 health, 1.88 health regen, 1.5% magic resistance and 15 attack damage.","Gold granted from the talent is unreliable gold."],"trivia":["Chaos Strike's ability icon bears a similar appearance to a D20 dice, commonly used in table-top RPG games, where a full 20 usually results in a critical.","Chaos Knight's lore and responses draw many references to the Four Horsemen of the Apocalypse, and his ultimate is a literalisation of it.","The line \"Ah, Tidehunter, can I offer you a seabiscuit?\" is a reference to Seabiscuit, a famous American racehorse.","Fitting his theme, Chaos Knight has the most varying attack damage in the game. His actual damage on attack can be up to 15 more or 15 less than his displayed damage.","Chaos Knight's actual name in DotA was \"Nessaj\". This was removed in his transition to Dota 2, likely due to the change in his background story.","Enigma, Chaos Knight, Keeper of the Light, and Io together represent the four fundamental forces of the universe with Chaos Knight representing the weak nuclear force, the force behind radioactive decay, fitting his theme of bringing death and destruction wherever he treads. Io's lore mentions \"the great twin riders Dark and Light,\" referring to Chaos Knight (weak interaction) and Keeper of the Light (electromagnetism) uniting under the electroweak interaction.","Chaos Knight's mount's name is Armageddon.","Chaos Knight's one of the death responses, \"Armageddon…out of here.\" may be a reference drawn from the film \"Bruce Almighty\" where, towards the end of the film the doomsayer (homeless man with handwritten signboard, often with typos) holds a sign \"ARMAGEDON OUTA HERE\". It works as a cheeky wordplay on \"I'mma gettin' out of here\"; reflecting on something that doesn't quite cease to be amazing, even while calling for a closure.","Chaos Knight's response upon killing Dragon Knight, \"You did need a steed, didn't you?\", answers to one of his lines when he moves: \"I need no steed\"."],"talents":["+2 Max Chaos Bolt Duration:-2s Chaos Strike Cooldown","Reality Rift Pierces Spell Immune:+150 Gold\/Min","12% Cooldown Reduction:+15 Strength","+20 Movement Speed:+5 All Stats"],"desc":"Chaos Knight is a melee strength hero with one of the highest physical damage output ceilings of all heroes. He is mostly played as a carry and ganker. As his name implies, he has a theme based on randomness and uncertainty. His regular attack has an incredibly wide thirty damage spread, making his last hitting ability somewhat unreliable. Chaos Bolt is his most notorious luck-based ability which, at max level, can stun a target anywhere between a mediocre 2 seconds to an effective 4 seconds that will almost certainly assure the target's death; it will also deal a variable amount of damage ranging from minuscule to moderate. Reality Rift pulls Chaos Knight and his target to a randomly chosen point along the line between the two and reduces the foe's armor. Chaos Strike is a crit-based ability with one of the lowest proc chances, yet also one of the highest multipliers. The illusions produced by his ultimate Phantasm, up to four at max level, retain his full attack damage, benefit from his Chaos Strike and can teleport alongside him to attack the target whenever he uses Reality Rift. This allows Chaos Knight's physical damage output to be multiplied by up to five during teamfights later in the game, and it is not uncommon to see enemy heroes being killed instantly after being Reality Rifted by the apocalyptic horsemen. Thus, Chaos Knight is played as a carry who excels in both the mid and late game, if the game drags on long enough and he is able to acquire enough strength-based and survivability items to ensure that his illusions can stay alive, he will be able to overpower most hard carries and potentially wipe out an entire team by himself."}