{"abilities":[{"spell":"Выпускает таинственный заряд энергии в указанного врага, оглушая его на случайное время и нанося случайный урон.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Снаряд летит со скоростью в 700 единиц.","Длительность оглушения и количество урона отображаются над головой цели при поражении (видно как союзникам, так и противникам), при этом длительность указывается с округленным значением. При этом настоящая длительность не всегда равна целому значению, а варьируется между заданными (например, на 1 уровне способность может оглушить на 1,74 секунды).","Урон и длительность оглушения обратно связаны между собой, что означает, чем дольше длится оглушение, тем меньший урон нанесет способность, и наоборот. Это означает, что урон уменьшается на 12\/6\/4\/6 за каждые дополнительные 0,1 секунды оглушения. Уровень 1: 1 сек. – 180, 1.25 сек. – 150, 1.5 сек. – 120, 1.75 сек. – 90, 2 сек. – 60 (длительность оглушения – урон) Уровень 2: 1 сек. – 210, 1.5 сек. – 180, 2 сек. – 150, 2.5 сек. – 120, 3 сек. – 90 (длительность оглушения – урон) Уровень 3: 1 сек. – 240, 1.75 сек. – 210, 2.5 сек. – 180, 3.25 сек. – 150, 4 сек. – 120 (длительность оглушения – урон) Уровень 4: 2 сек. – 270, 2.5 сек. – 240, 3 сек. – 210, 3.5 сек. – 180, 4 сек. – 150 (длительность оглушения – урон)","Способность сначала применяет дебафф, затем наносит урон."],"mana":"140","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"10 ( 8.8)","name":"Chaos Bolt","description":["Анимация применения: 0,4+0,73","Дальность применения: 500","Минимальный урон: 60\/90\/120\/150","Максимальный урон: 180\/210\/240\/270","Мин. длительность оглушения: 1\/1\/1\/2","Макс. длительность оглушения: 2\/3\/4\/4 ( 4\/5\/6\/6)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Переносит героя, все его иллюзии и выбранного врага в точку между владельцем способности и жертвой. Замедляет передвижение и атаку цели на 2 сек.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя"],"notes":["С помощью Reality Rift нельзя избегать снаряды.","Телепортирует Chaos Knight в точку на линии между героем и целью на расстоянии 250\/300\/350\/400 от начальной позиции цели. Цель телепортируется в 62 единицах перед точкой, поэтому по факту она притягивается на расстояние 188\/238\/288\/338. Иллюзии развернуты под случайными углами вокруг цели на том же расстоянии, что и Chaos Knight. Позиция определяется при начале применения. Визуальные эффекты также проигрываются в начале применения, показывая точку для перемещения Chaos Knight и его цели. Иллюзии и Chaos Knight смотрят в сторону цели и получают приказ на её атаку.","При применении на Рошана Chaos Knight (и его иллюзии) перемещается к Рошану, но он сам позиции не меняет.","Дебафф замедления действует на цель при применение. Chaos Knight не нужно атаковать цель для применения дебаффа.","Замедление от нескольких применений не складывается, но обновляет длительность.","Не прерывает произносимые заклинания цели."],"mana":"50","elements":["Нельзя применять в оцепенении.","Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/15\/10\/5 ( 17.6\/13.2\/8.8\/4.4)","name":"Reality Rift","description":["Анимация применения: 0,3+0,5","Дальность применения: 475\/550\/625\/700","Радиус для телепортации иллюзий: 1375","Дистанция притягивания цели: 250\/300\/350\/400","Замедление скорости передвижения: 10%\/20%\/30%\/40%","Замедление скорости атаки: 30\/50\/70\/90","Длительность замедления: 3"],"hot_key":"W","legacy_key":"E"},{"spell":"Герой наносит критический удар случайной силы и восстанавливает себе здоровье на 25%\/40%\/55%\/70% от нанесённого урона.","effects":["Способность Пассивная","Действует на Врагов \/ Себя"],"notes":["Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","Вампиризм от способности сочетается с другими источниками вампиризма.","Не срабатывает при атаке вардов, строений и союзников.","Звук и частицы критического удара воспроизводится при замахе, а не при попадании атаки.","Промахнувшиеся атаки или атаки, которых избежали, не активируют перезарядку способности.","Отображается уменьшение перезарядки только от таланта 25-го уровня. Талант 15-го уровня может уменьшить перезарядку до 1.76 (3.52 без таланта 25-го уровня)."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"4 ( 2)","name":"Chaos Strike","description":["Мин. критический урон: 120%","Макс. критический урон: 160%\/195%\/230%\/265%","Вампиризм: 25%\/40%\/55%\/70%"],"hot_key":"E","legacy_key":"R"},{"spell":"Призывает несколько копий героя из параллельных измерений. Иллюзии наносят 50%\/75%\/100% урона, а получают 260% урона.","effects":["Способность Ненаправленная ( Направленная на юнита)","Действует на Себя ( Союзных героев)"],"notes":["При применении позволяет избегать снаряды.","Во время разделения Chaos Knight неуязвим, спрятан и на него действует иммунитет к заклинаниям.","При использовании применяет базовое развеивание.","Сбрасывает текущий приоритет по выбору целью атак и заклинаний Chaos Knight.","После завершения разделения Chaos Knight появляется со своими иллюзиями. Место появления зависит от позиции Chaos Knight при применении способности: один из юнитов появляется на месте применения, остальные - на севере, западе, юге или востоке от этой точки. То есть при появлении 3 иллюзий расположение выглядит как буква Т. Расстояние между юнитами составляет 135 единиц. Поскольку порядок расположения всегда один и тот же, то Chaos Knight и иллюзии занимают случайное положение, но все юниты смотрят в одну и ту же сторону.","Способность отдает команду \"стоп\" заклинателю ( или цели) после разделения, отменяя все приказы, отданные до или во время разделения.","Повторное применение Phantasm заменяет иллюзии от предыдущего применения независимо от того, под чьим контролем они находятся.","При улучшении Phantasm может выбрать целью союзников, создавая их иллюзии под контролем Chaos Knight. Применяет все эффекты к цели (избегание и базовое развеивание). Также способность делает цель неуязвимой, прячет её на небольшой промежуток времени. Двойной щелчок автоматически применит способность на владельца. Можно применять на иллюзии и клонов. Нельзя применить на крипов-героев."],"mana":"125\/200\/275","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"145 ( 127.6) ( 110, 96.8)","name":"Phantasm","description":["Анимация применения: 0,4+0","Дальность применения: 0 ( 1200)","Время разделения: 0.5","Количество иллюзий: 3","Иллюзии наносят урона: 50%\/75%\/100%","Иллюзии получают урона: 260%","Длительность иллюзий: 30"],"hot_key":"R","legacy_key":"T"}],"bio":"Сей рыцарь — ветеран бесчисленных сражений в мириадах миров, и появился он в далёком первичном измерении, где фундаментальные законы вселенной обрели разумное воплощение. Из древних Предвечных он самый старший и неутомимый, и он неизменно ищет сущность, что знает лишь под именем Свет. Давным-давно Свет нарушил первое соглашение, покинув прародительский мир. И теперь старший собрат путешествует из мира в мир в бесконечной охоте на Свет, стремясь затушить его везде, где он объявится. Тысячу раз источник сияния гас, и всякий раз рыцарь уходит в другое измерение, дабы продолжить поиски. Он скачет на Армаггедоне, яростно вступает в битвы, черпая силу из хаоса вселенной. Он — физическое воплощение самого хаоса. При нужде он призывает образы самого себя из других миров, и тогда тёмные наездники вместе мчатся в битву, непреодолимые, словно сила стихии. Поиск окончится, только когда последний Свет во вселенной погаснет. За хаосом последует смерть.","talentsTips":["Талант на все атрибуты в общем даёт Chaos Knight: 100 здоровья, 0.5 регенерации здоровья, 0.4% сопротивления магии, 0.8 брони, 5 скорости атаки, 0.25% скорости передвижения, 60 маны, 0.25 регенерации маны, 0.35% урона заклинаний и 5 урона от атаки.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки.","Талант на силу в общем даёт Chaos Knight: 300 здоровья, 1.5 регенерации здоровья, 1.2% сопротивления магии и 15 урона от атаки.","Золото с таланта является ненадёжным."],"trivia":["Имя героя в оригинальной DotA было \"Nessaj\". В Dota 2 этот факт не упоминается.","Изображение Chaos Strike является изображением игральной кости D20, которая используется в настольных RPG игр, где полная двадцатка дает крит.","Биография героя, ссылаясь на \"Армагеддон\" и способность Phantasm подразумевают, что Рыцарь Хаоса и его три иллюзии базировались на Четырех Всадников Апокалипсиса.","Enigma, Io, Keeper of the Light и Chaos Knight вместе представляют фундаментальные силы Вселенной, среди которых Chaos Knight является олицетворением вселенского хаоса. В своих репликах к этим персонажам Enigma много об этом говорит.","Фраза Играть \"Ah, Tidehunter, can I offer you a seabiscuit?\" (\"Ах, Tidehunter, могу ли я предложить тебе сухарик?\") является отсылкой к Сухарю(Seabiscuit), знаменитому Американскому беговому скакуну.","Убивая Dragon Knight, Chaos Knight может сказать \"You did need a steed, didn't you?\" (\"Тебе всё-таки не управиться без коня, верно?\") что является ответом на фразу \"I need no steed\" (\"И без коня управлюсь!\").","Его коня зовут \"Armageddon\" (Армагеддон), и большинство его реплик относится именно к скакуну, а не к событию. К тому-же, большинство его посмертных фраз указывает на то, что он больше беспокоится о своём скакуне, чем о себе, что подтверждает его привязанность к своему верному спутнику.","Поддерживая свою хаотичную натуру, Chaos Knight имеет самый вариативный урон от атаки, который может быть как на 15 ед. больше, так и на 15 ед. меньше чем указанное значение.","Фраза \"Now you exist on one less plane\" возможно является аллегорией на идею существования человека не только в том мире, где он живёт, но и в остальных мирах - так называемых Альтернативных Вселенных"],"talents":["+2 сек. к макс. длительности Chaos Bolt:-2 сек. перезарядки Chaos Strike","Reality Rift проходит сквозь иммунитет к магии:+150 золота в минуту","-12% перезарядки способностей:+15 к силе","+20 к скорости передвижения:+5 ко всем атрибутам"],"tips":["Атакуя противника, сначала применяйте Reality Rift — с помощью критических ударов, вы должны справиться с противником. В случае, если противнику удается убежать от вас, применяйте Chaos Bolt чтобы оглушить противника и дать вам время чтобы догнать его.","В некоторых случаях, лучше всего прокачивать Chaos Bolt и Reality Rift, чем Chaos Strike, однако нужно помнить о расходе маны.","Chaos Strike повышает общий урон в секунду героя на 5%\/10%\/15%\/20%, то есть он бесполезен в начале.","Всегда активируйте Armlet of Mordiggian перед тем, как использовать Phantasm. Это даст бонусы от предмета всем вашим иллюзиям.","Если вы купили Sange and Yasha, то потом при необходимости его можно разобрать для Heaven's Halberd или Manta Style.","Assault Cuirass - отличный предмет для поздней игры, повышающий потенциал героя одновременно как танка и керри. В поздней игре он должен быть либо у вас, либо у кого-то из ваших союзников.","Heart of Tarrasque - также оправданная покупка, так как значительно увеличит количество здоровья у вас и у ваших иллюзий. Так же вы и ваши иллюзии будут наносить противникам дополнительный урон.","Вам может подойти любой модификатор атаки. Например Desolator снизит вражескую броню, из-за чего иллюзии станут больнее бить врага."],"desc":"Chaos Knight — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Chaos Bolt, выпускает таинственный заряд энергии в указанного врага. Заряд оглушает цель на случайное время и наносит случайный урон. Вторая способность, Reality Rift, телепортирует героя, все его иллюзии и цель в случайную точку между Chaos Knight и врагом. Дает вам дополнительный урон на одну атаку. Пассивная способность, Chaos Strike, дает шанс нанести критический урон и понизить броню врага при атаке. Ультимативная способность, Phantasm, призывает несколько копий Chaos Knight из параллельных измерений. Есть шанс в 50%, что появится одна дополнительная копия. Иллюзии наносят полный урон, но получают удвоенный."}