{
  "abilities": [
    {
      "notes": [
        "The goo travels at a speed of 1000",
        "Places one debuff on the enemy\n This debuff gets stronger when it gets refreshed with successive casts\n A number on the icon shows how many times the debuff was refreshed, including the first cast",
        "For how much bonus armor and movement speed Viscous Nasal Goo reduces up to 4 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 7) stacks on each level, please refer to the chart below\n Reduces affected targets' armor by 8\/10\/12\/14 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 12.5\/16\/19.5\/23) at max stack\n Reduces affected targets' movement speed by 27%\/39%\/51%\/63% (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 36%\/57%\/78%\/99%) at max stack",
        "Treats creep-heroes as heroes",
        "SCEPTER NOTES Viscous Nasal Goo loses its cast time and backswing\n It still interrupts channeling abilities upon cast\n The radius can be further increased to 800 by the Viscous Nasal Goo cast range increasing <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent, but not other cast range bonuses\n Viscous Nasal Goo still uses the same disjointable projectiles\n Does not target invisible, invulnerable and hidden units, or units inside the Fog of War within the radius"
      ],
      "item_behaviour": [],
      "description": "Covers a target in snot, causing it to have reduced armor and movement speed. Multiple casts stack and refresh the duration.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0+0 )",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 650 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 800) (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0)",
        "Max Stacks: 4 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 7)",
        "Base Armor Reduction: 2",
        "Armor Reduction per Stack: 1.5\/2\/2.5\/3",
        "Base Move Speed Slow: 15%",
        "Move Speed Slow per Stack: 3%\/6%\/9%\/12%",
        "Hero Duration: 5",
        "Non-Hero Duration: 10",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Radius:  650 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 800)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0a\/Bristleback_Viscous_Nasal_Goo_1.mp3\/revision\/latest?cb=20191216011435",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies"
      ],
      "mana": "1.75",
      "aghanim": null,
      "name": "Viscous Nasal Goo",
      "cooldown": "12\/16\/20\/24",
      "legacy_key": "G",
      "story": "Having caught a cold while stuck in the snow, Bristleback turns it to his advantage."
    },
    {
      "notes": [
        "Interrupts Bristleback's channeling abilities upon cast",
        "The quills spread at a speed of 2400 and take 0.29 seconds to reach maximum range",
        "The quills do not form a ring\n They affect every enemy within the expanding area of effect, so it cannot be avoided by blinking towards Bristleback",
        "The effect is centered at the cast location, it does not follow Bristleback",
        "Places one debuff on each hit enemy and a stack debuff on each cast on each hit enemy\n The first debuff shows the number of stack debuffs on the status icon\n The stack debuffs are hidden\n The stacks' durations are independent from each other\n Successive casts do not refresh previous stacks' durations\n With the current cooldown and stack duration, it can be stacked up to 5 times\n To reach the damage cap, additional passive procs from <span image=\"images\/bristleback_ability.png\">[picture:bristleback_ability]<\/span> Bristleback are required\n The damage cap is reached with 20\/18\/17\/15 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 12\/12\/11\/10) stacks\n So to reach it, 15\/13\/12\/10 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 7\/7\/6\/5) passive casts are required (not considering cooldown reductions)",
        "Checks how many stacks units have first and deal damage based on that, and then increases the number of stacks\n This means the first hit only deals the base damage",
        "For how much damage Quill Spray deals with a certain amount of stack on each level (before reductions), please refer to the chart below",
        "Fully affect <span image=\"images\/animal_courier_radiant_minimap.webp\">[picture:animal_courier_radiant_minimap]<\/span> Couriers"
      ],
      "item_behaviour": [],
      "description": "Sprays enemy units with quills dealing damage in an area of effect around Bristleback. Deals bonus damage for every time a unit was hit by Quill Spray in the last 14 seconds.",
      "hot_key": "W",
      "params": [
        "Cast Animation: <span image=\"images\/instant_cast_time.png\">[picture:instant_cast_time]<\/span> 0+0",
        "Radius: 700",
        "Base Damage: 25\/45\/65\/85",
        "Stack Damage: 28\/30\/32\/34 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 48\/50\/52\/54)",
        "Damage Cap: 550",
        "Stack Duration: 14"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d5\/Bristleback_Quill_Spray_1.mp3\/revision\/latest?cb=20191216011432",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "mana": "3",
      "aghanim": null,
      "name": "Quill Spray",
      "cooldown": "35",
      "legacy_key": "R",
      "story": "An enforcer's honor can be a prickly thing. So can his quills."
    },
    {
      "notes": [
        "A visual effect and sound plays whenever his back receives damage if Bristleback has learned <span image=\"images\/quill_spray.webp\">[picture:quill_spray]<\/span> Quill Spray\n Taking damage from the sides shows no effect",
        "Applies generic incoming damage reduction on Bristleback\n Stacks additively with other sources of generic incoming damage manipulation\n The reduction affects all damage Bristleback takes that is not flagged as HP removal\n When taking rear damage, his effective health increases by 19%\/32%\/47%\/67% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 32%\/47%\/67%\/92%)\n When taking side damage, his effective health increases by 9%\/14%\/19%\/25% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 14%\/19%\/25%\/32%",
        "Checks the damage source's current position and compares it to Bristleback's facing angle on each damage instance\n This means on damage over time effects (i.e\n <span image=\"images\/liquid_fire.webp\">[picture:liquid_fire]<\/span> Liquid Fire), damage of an instance is only reduced when within the right angle\n Damage from <span image=\"images\/death_ward.webp\">[picture:death_ward]<\/span> Death Ward, <span image=\"images\/proximity_mines.webp\">[picture:proximity_mines]<\/span> Proximity Mines is reduced when facing away from them, since they are their own source",
        "Passive <span image=\"images\/quill_spray.webp\">[picture:quill_spray]<\/span> Quill Sprays based on its current level proc when Bristleback's back (not sides) collectively takes 200 damage (after all reductions)\n Does not interrupt Bristleback's channeling abilities upon passive procs\n If Quill Spray is not learned, no quills are procced\n The damage counter considers the 3 damage types, but not HP Removal (e.g\n <span image=\"items\/soul_ring\/full.webp\">[picture:soul_ring]<\/span> Soul Ring) or the no-reflection flag (e.g\n <span image=\"items\/blade_mail\/full.webp\">[picture:blade_mail]<\/span> Blade Mail)\n The damage counter has no time limit and only resets once a passive spray occurs\n Any exceeding damage is completely ignored, this means if an enemy deals an instance of 400 damage, the passive triggers only once\n These sprays are independent from the cooldown, they neither trigger the ability's cooldown, nor trigger <span image=\"images\/warpath.webp\">[picture:warpath]<\/span> Warpath, and work while on cooldown\n They do not cost mana or proc on-cast effects either"
      ],
      "item_behaviour": [],
      "description": "Bristleback takes less damage if hit on the sides or rear. If Bristleback takes 200 damage from the rear, he releases a Quill Spray of the current level.",
      "hot_key": "E",
      "params": [
        "Rear Angle: 70°",
        "Side Angle: 110°",
        "Rear Damage Reduction: 16%\/24%\/32%\/40% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 24%\/32%\/40%\/48%)",
        "Side Damage Reduction: 8%\/12%\/16%\/20% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 12%\/16%\/20%\/24%)",
        "Damage Threshold: 200"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Bristleback_Bristleback.mp3\/revision\/latest?cb=20191216011429",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Bristleback",
      "cooldown": null,
      "legacy_key": "K",
      "story": "Turning his back to a fight might be just the thing."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard to be unlocked",
        "The hairball travels at a speed of 1200",
        "The <span image=\"images\/viscous_nasal_goo.webp\">[picture:viscous_nasal_goo]<\/span> Viscous Nasal Goo and <span image=\"images\/quill_spray.webp\">[picture:quill_spray]<\/span> Quill Spray released are based on the current level respectively\n If neither are leveled, the ball does nothing upon reaching the targeted area\n Checks for their level upon projectile impact",
        "Once the hairball reaches the center of the area, every enemy within 700 radius gets targeted by Viscsous Nasal Goo\n Viscous Nasal Goo does not target invisible units or units inside the Fog of War\n At the same time, a Quill Spray is released\n The second Quill Spray is released 0.1 seconds later\n Both Viscous Nasal Goo and Quill Spray notes fully apply",
        "Since Quill Spray travels faster than Viscous Nasal Goo, the quills always hit enemies before the goo does, so the quills do not benefit from the armor reduction"
      ],
      "item_behaviour": [],
      "description": "Coughs a quill-packed hairball towards the target location. Erupts at the location, hitting enemies in with Viscous Nasal Goo and stacks of Quill Spray.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.1+0.64",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1500",
        "Radius: 700",
        "Number of Viscous Nasal Goo: 1",
        "Number of Quill Sprays: 2",
        "Quill Spray Interval: 0.1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Bristleback_Hairball.mp3\/revision\/latest?cb=20201224013124",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Hairball",
      "cooldown": "100",
      "legacy_key": "B",
      "story": null
    },
    {
      "notes": [
        "Does not trigger on active item abilities, on abilities with 0 cooldown, or on abilities which do not trigger on-cast effects\n The passive <span image=\"images\/quill_spray.webp\">[picture:quill_spray]<\/span> Quill Spray procs of <span image=\"images\/bristleback_ability.png\">[picture:bristleback_ability]<\/span> Bristleback do not trigger Warpath either",
        "Bristleback's model size increases and more particles fly around him the more stacks he has\n This has no impact on his collision size",
        "Grants regular flat bonus attack damage",
        "Warpath can give at most 120\/200\/300 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 228\/344\/480) attack damage and 18%\/32%\/50% movement speed bonus",
        "Each stack places a new buff on Bristleback\n This means their durations are independent from each other\n The number of stacks can be seen on the status buff icon"
      ],
      "item_behaviour": [],
      "description": "Bristleback works himself up into a fury every time he casts a spell, increasing his movement speed and damage.",
      "hot_key": "R",
      "params": [
        "Max Stacks: 6\/8\/10",
        "Attack Damage Bonus per Stack: 20\/25\/30 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 38\/43\/48)",
        "Move Speed Bonus per Stack: 3%\/4%\/5%",
        "Stack Duration: 16\/18\/20"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Warpath",
      "cooldown": null,
      "legacy_key": "W",
      "story": "'Temper, temper,' his mum always chided. But in a fight, a temper can come in handy."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 22.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 2.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 17.0
  },
  "description": "Takes reduced damage when facing away from enemies. The enforcer at a local pub, Rigwarl's never failed to collect a tab. That is, until he met one tough customer from the north. For the first time in his life, Rigwarl felt the need to train. His Thorny Back deters attack while peppering foes with constant baarrage of Quill Sprays. From his nose he blows Thick Gobs of Snot, slowing and covering opponents in goo. When it comes to a fight, he really puts his back into it. With every volley and every Sneeze, Rigwarl works himself into a fury, adding rage to each blow as he goes on the Warpath in search of a rematch.  Carry Durable Initiator Nuker ★☆☆",
  "trivia": [
    "In DotA, Bristleback's hero model was a quillboar, having a much more boar-like appearance. His loss of boar-like features in Dota 2 was likely made to distinguish him from the quillboar race in the Warcraft universe. [1] As well, his hero title shares the name of a large quillboar tribe in World of Warcraft. [2] Beta information revealed that Bristleback's original name was supposedly to be \"Bristlebog\", probably to avoid conflict with the aforementioned Bristleback tribe in World of Warcraft. According to an unused voice response, Bristleback was originally designed with tusks.[1] According to Lycan's response ( Link▶️ A boar is a wolf's natural prey), one of Bristleback's early designs resembled a boar.",
    "Beta information revealed that Bristleback's original name was supposedly to be \"Bristlebog\", probably to avoid conflict with the aforementioned Bristleback tribe in World of Warcraft.",
    "According to an unused voice response, Bristleback was originally designed with tusks.[1]",
    "According to Lycan's response ( Link▶️ A boar is a wolf's natural prey), one of Bristleback's early designs resembled a boar.",
    "A silhouette of what appears to be Skywrath Mage can be seen in Bristleback's splash artwork, seemingly still having a beta model\/texture."
  ],
  "history": "Never one to turn his back on a fight, Rigwarl was known for battling the biggest, meanest scrappers he could get his hands on. Christened Bristleback by the drunken crowds, he waded into backroom brawls in every road tavern between Slom and Elze, until his exploits finally caught the eye of a barkeep in need of an enforcer. For a bit of brew, Bristleback was hired to collect tabs, keep the peace, and break the occasional leg or two (or five, in the case of one unfortunate web-hund). After indulging in a night of merriment during which bodily harm was meted out in equal parts upon both delinquent patrons and his own liver, Bristleback finally met his match. \"Your tusks offend me, sir,\" he was heard to drunkenly slur to one particularly large fellow from the northern wastes whose bill had come due. What followed was a fight for the ages. A dozen fighters jumped in. No stool was left unbroken, and in the end, the impossible happened: the tab went unpaid. Over the weeks that followed, Bristleback's wounds healed, and his quills grew back; but an enforcer's honor can be a prickly thing. He paid the tab from his own coin, vowing to track down this northerner and extract redemption. And then he did something he'd never done before: he actually trained, and in so doing made a startling discovery about himself. A smile peeled back from his teeth as he flexed his quills. Turning his back to a fight might be just the thing.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "12% Spell Lifesteal",
        "talent_left": "+18 Warpath Damage Per Stack"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+20 Health Regen",
        "talent_left": "+20 Quill Stack Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+8%\/4% Bristleback Back\/Side Damage Reduction",
        "talent_left": "+150 Viscous Nasal Goo Cast Range"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+15 Damage",
        "talent_left": "+1.5 Mana Regen"
      }
    ],
    "notes": [
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "The spell lifesteal talent stacks additively with other sources of spell lifesteal. Heals for 2.4% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions.",
      "Heals for 2.4% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions."
    ]
  }
}