{"abilities":[{"spell":"Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Все три способности Shadowraze связаны и имеют один и тот же уровень. Улучшение одной из них автоматически повысит уровень двух других.","При использовании Shadowraze (Близко) бьет по области с радиусом в 250 единиц в 200 единицах от Невермора. То есть способность может поразить существ на расстоянии до 50 единиц позади Shadow Fiend и до 450 единицах перед ним.","Накладывает один дебафф на врага. Этот дебафф высчитывает, сколько раз цель была задета способностью за его длительность. Shadowraze сначала устанавливает значение урона, учитывая текущее число зарядов, затем применяет дебафф\/добавляет заряд, а затем наносит урон. То есть заряд, добавляемый применением, не влияет непосредственно на урон. Число в иконке показывает, сколько раз дебафф был обновлен с учетом первого применения. У дебаффа нет ограничения по количеству зарядов и он может увеличиваться бесконечно.","Поражение всеми тремя способностями наносит до 420\/660\/900\/1140 ( 870\/1110\/1350\/1590) единиц урона одному существу (до уменьшений) при условии их попадания.","Дебафф Shadowraze Counter, размещенный на героях, используется для подсчета успешных попаданий Shadowraze и длится 3 секунды. Несмотря на то, что дебафф используется только косметическим предметом Demon Eater, счетчик при этом размещается всегда."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"10 ( 6)","name":"Shadowraze (Близко)","description":["Анимация применения: 0,55+0","Дистанция: 200","Радиус: 250","Базовый урон: 90\/160\/230\/300 ( 240\/310\/380\/450)","Увеличение урона за заряд: 50\/60\/70\/80","Длительность заряда: 8"],"hot_key":"Q","legacy_key":"Z"},{"spell":"Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Shadowraze (Средне) бьет по области с радиусом в 250 единиц в 450 единицах от Невермора. То есть способность может поразить существ на расстоянии от 200 до 700 единиц перед Shadow Fiend."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"10 ( 6)","name":"Shadowraze (Средне)","description":["Анимация применения: 0,55+0","Дистанция: 450","Радиус: 250","Базовый урон: 90\/160\/230\/300 ( 240\/310\/380\/450)","Увеличение урона за заряд: 50\/60\/70\/80","Длительность заряда: 8"],"hot_key":"W","legacy_key":"X"},{"spell":"Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Shadowraze (Далеко) бьет по области с радиусом в 250 единиц в 700 единицах от Невермора. То есть способность может поразить существ на расстоянии от 450 до 950 единиц перед Shadow Fiend."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"10 ( 6)","name":"Shadowraze (Далеко)","description":["Анимация применения: 0,55+0","Дистанция: 700","Радиус: 250","Базовый урон: 90\/160\/230\/300 ( 240\/310\/380\/450)","Увеличение урона за заряд: 50\/60\/70\/80","Длительность заряда: 8"],"hot_key":"E","legacy_key":"C"},{"spell":"Герой крадет душу каждого убитого врага, получая бонус к атаке. При убийстве героя он получает сразу 11 душ. После смерти выпускает половину из них.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Может получать души за каждое существо, включая варды и союзников, но исключая иллюзии, Tempest Double и строения.","Вопреки визуальным эффектам Shadow Fiend мгновенно получает душу и урон от убитых существ.","Текущее число душ видно в иконке баффа.","Если у Shadow Fiend нечетное число душ на момент смерти, то число теряемых округляется в меньшую сторону. То есть он никогда не сможет потерять все свои души. У Shadow Fiend всегда будет оставаться 1 душа, даже если он умрет, имея всего 1.","Чем больше душ у Shadow Fiend, тем больше красных частиц летает около его груди.","Максимальное количество душ на каждом уровне Necromastery дает 24\/40\/56\/72 ( 44\/60\/76\/92) дополнительного урона. С изученным талантом на дополнительный урон с душ он усиливается до 48\/80\/112\/144 ( 88\/120\/152\/184).","Души не теряются при смерти при наличии Aegis of the Immortal.","Дополнительные души от Aghanim's Scepter влияют на число волн, создаваемых Requiem of Souls. В среднем увеличивает количество возможных волн с 6\/10\/14\/18 до 11\/15\/19\/23 При потере Aghanim's Scepter Shadow Fiend сохраняет накопленные души, даже если их количество больше, чем текущее допустимое. То есть Requiem of Souls выпустит большее количество волн даже без Aghanim's Scepter. При этом дополнительный урон мгновенно адаптируется и не учитывает дополнительные души без наличия Aghanim's Scepter."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Necromastery","description":["Максимум душ: 12\/20\/28\/36 ( 22\/30\/38\/46)","Душ за убийство героя: 12","Душ за убийство не-героя: 1","Доп. урон за душу: 2 ( 4)","Потеря при смерти: 50%"],"hot_key":"D","legacy_key":"N"},{"spell":"Присутствие героя снижает броню ближайших врагов.","effects":["Способность Аура","Действует на Врагов"],"notes":["Снижение брони предоставлено аурой. Дебафф задерживается на 0.5 секунды.","Не действует на врагов, не имеющих обзора на Shadow Fiend.","Если выбран талант, то способность действует на строения."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Presence of the Dark Lord","description":["Радиус: 1200","Снижение брони: 4\/5\/6\/7 ( 9\/10\/11\/12)","Длительность задержки ауры: 0.5"],"hot_key":"F","legacy_key":"P"},{"spell":"Герой выпускает собранные души в волнах демонической энергии. Существа возле него могут получить урон от нескольких волн. Замедляет передвижение врагов и накладывает на них страх на 0,8 сек. за каждую задетую волну. Создаёт одну волну энергии за каждые 2 души, захваченные с помощью Necromastery. Если герой погибнет, то эта способность сработает автоматически вне зависимости от её готовности.","effects":["Способность Ненаправленная","Действует на Врагов ( Себя)","Урон Магический"],"notes":["При произнесении этой способности к Shadow Fiend применяется сквозное передвижение, позволяя другим существам проходить сквозь него.","Урон зависит от числа душ, полученных от Necromastery. Каждые 2 души создают одну волну. Если число полученных душ нечетное, то оно округляется до меньшего четного числа.","Волны действуют согласно следующей механике: Область каждой волны имеет форму конуса. Расстояние между волнами всегда одинаковое. Одна волна всегда выпускается на востоке, а остальные подстраиваются под неё. Волны движутся со скоростью в 700 единиц, преодолевая максимальную дистанцию за 1.43 секунды. Волны поражают существ на расстоянии до 1350 единиц (складывается из дальности прохождения и конечной ширины). Любая волна не может поразить одно и то же существо больше одного раза за применение ( соответственно при выпускании и возвращении).","Применяет страх и снижает скорость передвижения всех задетых волнами от Requiem of Souls вражеских существ. Длительность увеличивается на 0,8 за каждую попавшую волну, но максимальная длительность ограничена 2,4 секундами.","В отличии от других источников страха пораженный враг бежит от заклинателя, а не направляется к фонтану своей команды.","Выпущенные волны наносят до 1440\/2160\/2880 ( 1840\/2760\/3680) единиц урона одному существу (до снижений), в случае, если его задели все волны.","Волны сначала наносят урон, а затем применяют дебафф.","При смерти героя Requiem of Souls автоматически и мгновенно применяется вне зависимости от количества маны и статуса перезарядки. До этого Shadow Fiend сначала теряет 50% от запаса душ. Поэтому пассивная Requiem of Souls может выпустить лишь до 9 ( 11) волн от максимального значения. Если на момент смерти у Shadow Fiend осталась лишь 1 душа, то способность выпустит 1 волну вопреки требуемым 2 душам для использования. Пассивная Requiem of Souls не применяет страх, но замедляет скорость передвижения. Пассивная Requiem of Souls не выпускается в момент смерти при наличии Aegis of the Immortal.","С Aghanim's Scepter каждая выпущенная волна при достижении максимального расстояния начинает возвращаться к Shadow Fiend. Вопреки визуальным эффектам волны не \"появляются\" вокруг Shadow Fiend. Они движутся обратно точно с того места, где остановились. Волны возвращаются к текущему расположению Shadow Fiend, а не к месту произнесения заклинания. Волны не будут подстраиваться к новому расположению, если Shadow Fiend передвинется. Начав свое возвращение, их путь уже не меняется. Максимальная дальность прохождения применяется и к возвращению волн; то есть всего они проходят путь в 2000 единиц. При возвращении волн значения максимальной и минимальной ширины меняются между собой: волны начинают с максимальной ширины и заканчивают минимальной. Возвращающиеся волны наносят 40% от урона. Они, как и расширяющиеся волны, поражают всех существа и так же применяют дебафф. Возвращающиеся волны так же применяют страх и замедление скорости передвижения. Эффекты Aghanim's Scepter не распространяются на пассивное срабатывание способности.","Возвращающиеся волны наносят до 736\/1104\/1472 единиц урона одному существу (до уменьшений), в случае, если его задели все волны. Вместе с выпускаемыми волнами Requiem of Souls наносит до 2576\/3864\/5152 единиц урона одному существу (до уменьшений).","Лечение зависит от урона, нанесенного возвращающимся волнами, а не базовыми выпускаемыми. Лечение применяется в момент завершения движения волн. В учет лечения идет только тот урон, который был нанесен героям (включая иллюзий). Всегда лечит на 32\/48\/64 за пораженного независимо от фактически нанесенного волнами урона."],"mana":"150\/175\/200","elements":["Не отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"120\/110\/100 ( 72\/66\/60)","name":"Requiem of Souls","description":["Анимация применения: 1,67+0,77","Дальность прохождения волн: 1000","Начальная ширина волны: 125","Конечная ширина волны: 350","Число душ для волны (Necromastery): 2","Урон за выпущенную волну: 80\/120\/160","Урон за вернувшуюся волну: 0 ( 32\/48\/64)","Лечение за героя: 0 ( 32\/48\/64)","Замедление скорости передвижения: 25%","Длительность дебаффа за волну: 0,8","Макс длительность дебаффа: 2,4"],"hot_key":"R","legacy_key":"R"}],"bio":"Говорят, у Невермора душа поэта, но на самом деле у него их тысячи. Веками он поглощал души стихотворцев, священников, императоров, нищих, рабов, философов, преступников и, естественно, героев. Не скрыться от него ни душе. Никто не знает, что он с ними делает. Никто не вглядывался в Бездну, где среди астральных скал Невермор таится, словно змея. Пожирает ли он души одну за другой? Выставляет ли он их трофеями в коридорах зловещего храма? Маринует ли в чернокнижном рассоле? А может, он — лишь марионетка, которой кукловодит зловещий разум извне пространства? Таково его зло, настолько силен его тёмный дух, что разумом его не понять. А если вам всё же очень хочется разузнать, что он делает с душами, то всё просто: присоединяйтесь к его коллекции. Или просто подождите: Невермор уже идёт к вам.","talentsTips":["Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."],"trivia":["В DotA, Shadow Fiend был единственным героем, при применении на которого эффекта проклятия, становился черной курицей, вместо стандартной белой.","Альтернативное имя героя в DotA было \"YaphetS, одного из лучших игроков на данном герое.","Реплики между Shadow Fiend, Shadow Demon и Doom говорят о том, что Shadow Fiend когда-то был рабом или животным.","Имя \"Nevermore\" , скорее всего, является отсылкой к поэме Эдгара Аллена По \"Ворон(The Raven)\".","Фраза \"Never say Nevermore...\" является отсылкой к фильму о Джеймсе Бонде \"Никогда не говори никогда\".","Отчасти, модель Shadow Fiend была изменена не только по просьбам фанатов, но и для того, чтобы обойти законы о цензуре в некоторых странах, одной из которых является Китай.","Джошуа Каспаров Вива, вместе с \"Steve the Man\", разработали прототип Shadow Fiend. Usahay rani."],"talents":["-40% перезарядки способностей:+5 к снижению брони от Presence of the Dark Lord","+150 к урону от Shadowraze:+2 урона за душу","+30 к скорости передвижения:Аура Presence of the Dark Lord действует на строения","+20 к скорости атаки:+8% к урону от способностей"],"desc":"Shadow Fiend — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Первые три способности, Shadowraze, разрывают участок земли перед Shadow Fiend, нанося урон всем врагам в зоне действия. Разница между этими способностями заключается в дальности применения. Первая пассивная способность, Necromastery, крадет душу каждого убитого врага, давая бонус к атаке. При убийстве героя способность накапливает сразу 12 душ. После смерти половина из них выпускается. Вторая пассивная способность, Presence of the Dark Lord, снижает броню ближайших врагов. Ультимативная способность, Requiem of Souls, выпускает собранные души, нанося урон, снижая урон каждого юнита в радиусе. Если Shadow Fiend погибает, то способность автоматически срабатывает вне зависимости от ее готовности."}