{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Arcane_Boots_Replenish_Mana.mp3\/revision\/latest?cb=20191227195348",
      "effects": [
        "Ability No Target",
        "Affects Allies"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "Affects every allied unit, including illusions, invulnerable units and hidden units, excluding wards and buildings.",
        "Meepo Clones cannot cast Replenish Mana.",
        "Does not share cooldown with Arcane Ring."
      ],
      "mana": "0",
      "abilityName": "Replenish Mana",
      "cooldown": "55",
      "description": "Restores 160 mana to all nearby allies.",
      "params": [
        "Radius: 1200",
        "Mana Restored: 160"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Movement speed bonuses from multiple pairs of boots do not stack.",
    "Stacks with all other movement speed bonuses."
  ],
  "cost": "1400",
  "lore": null,
  "consistFrom": [
    "Boots of Speed",
    "Energy Booster"
  ],
  "boughtFrom": "Support",
  "name": "Arcane Boots",
  "description": "Magi equipped with these boots are valued in battle.",
  "trivia": [
    "Arcane Boots was originally created as Arcane Ring, being built out of Ring of Protection, Energy Booster, and a recipe. Its recipe got changed and its theme reworked into Arcane Boots in the 6.68 gameplay patch. Arcane Ring's appearance is designed after this as well, sharing aesthetics with Arcane Boots.",
    "Arcane Ring's appearance is designed after this as well, sharing aesthetics with Arcane Boots."
  ],
  "upgradeIn": [
    "Guardian Greaves"
  ],
  "bonuses": [
    "+250 Mana",
    "+45 Movement Speed"
  ],
  "tips": [
    "If the player drops items which provides a large amount of mana (e.g. Bloodstone or Eye of Skadi), then uses Arcane Boots, and then picks up the dropped items again, the player will overall gain far more than 160 mana. This is because upon dropping the mana granting items, the player's maximum mana drops while the current mana percentage stays the same, but Arcane Boots still gives the full amount. After picking up the items again, its maximum mana raises, and its current mana percentage stays the same.",
    "Using Replenish Mana every time it is off cooldown is equivalent to 2.91 mana per second, which regenerates the bonus mana in 55 seconds.",
    "Because Arcane Boots can be disassembled, they make a good intermediate boot choice for heroes building Aether Lens, Bloodstone, or Octarine Core."
  ]
}