{"abilities":[{"spell":"Puck launches a magic orb that floats in a straight path, damaging enemy units along the way. At any point, Puck may teleport to the orb's location using Ethereal Jaunt.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The Illusory Orb travels at a speed of 651 ( 911.4).","The orb takes 3 seconds to reach max distance and can hit units up to 2175 range away (travel distance + damage radius). It takes up to 3.19 seconds and can hit units up to 2300 range away when the general cast range increasing talent is chosen. It takes up to 3 seconds and can hit units up to 2955 range away when Illusory Orb's own range and speed increasing talent is chosen. It takes up to 3.13 seconds and can hit units up to 3080 range away when both talents are chosen.","Only the distance increase from the level 20 talent is displayed. The level 10 talent can further increase the distance to 2855. The level 10 talent alone increases the distance to 2075.","The orb starts emitting red pulses after having traveled for 2.5 seconds, indicating that it is about to reach its maximum travel range.","The orb leaves behind a trail of flying vision, with a radius of 450. The vision lingers for 5 seconds."],"mana":"80\/100\/120\/140","elements":["Does not pierce spell immunity."],"cooldown":"13\/12\/11\/10","name":"Illusory Orb","description":["Cast Animation: 0.1+0.27","Cast Range: 3000 ( 3125)","Travel Distance: 1950 ( 2730)","Damage Radius: 225","Damage: 70\/140\/210\/280"],"hot_key":"Q","legacy_key":"R"},{"spell":"Teleports Puck to a flying Illusory Orb.","effects":["Ability No Target","Affects Self"],"notes":["This ability is automatically learned whenever Illusory Orb is learned.","This ability stays inactive until Illusory Orb is cast and turns inactive again once the orb of that cast is gone.","Ethereal Jaunt disjoints projectiles upon cast.","When two orbs are cast in succession, this ability only stays active for the duration of the first cast orb.","However, it always teleports the caster to their last created orb."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Ethereal Jaunt","description":["Cast Animation: 0+0.53"],"hot_key":"D","legacy_key":"E"},{"spell":"Puck releases a burst of faerie dust that deals damage and silences enemy units nearby.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Despite the visual effects, the silence and damage are applied instantly in the entire radius.","Waning Rift first applies the damage, then the debuff."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"16\/15\/14\/13 ( 8\/7\/6\/5)","name":"Waning Rift","description":["Cast Animation: 0.1+0.27","Radius: 400","Damage: 100\/160\/220\/280","Duration: 2\/2.5\/3\/3.5"],"hot_key":"W","legacy_key":"W"},{"spell":"Puck briefly shifts into another dimension where it is immune from harm.","effects":["Ability No Target \/ Channeled","Affects Self"],"notes":["Phase Shift disjoints projectiles upon cast.","Certain items which do not cancel channeling spells (e.g. Shadow Blade or Shiva's Guard) do cancel Phase Shift.","Turns the caster invulnerable and hidden for its duration.","Does not provide phased movement, so the caster can still block other units during Phase Shift.","The buff lingers for one server tick once the channeling ends or is interrupted, which allows using items while still invulnerable and hidden."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"6","name":"Phase Shift","description":["Cast Animation: 0+0","Max Channel Time: 0.75\/1.5\/2.25\/3.25"],"hot_key":"E","legacy_key":"F"},{"spell":"Creates a coil of volatile magic that latches onto enemy Heroes, stunning them for 0.5 seconds and damaging them. If the enemy hero stretches the coil by moving too far away, it snaps, stunning and dealing additional damage.","effects":["Ability Target Area","Affects Enemy Heroes","Damage Magical"],"notes":["Every enemy hero (including illusions, clones, and creep-heroes) within 375 range of the coil gets leashed upon cast, preventing them from casting certain mobility spells. Entering the area after cast has no effect. The coil does not leash enemies after cast.","If a leashed enemy moves 600 range away from the coil, the leash snaps, stunning and damaging the enemy. It does not matter how far or how fast the enemy moves away, the stun and damage always hit it if possible. The leash snap first applies the damage, then the debuff.","Dream Coil leashes invisible units and on units in the Fog of War as well, but it does not provide vision over them. The link visually draws to their last known location.","Multiple instances of Dream Coil fully stack, with each cast placing its own separate leash.","When the level 25 talent is chosen, the caster performs instant attacks on all leashed enemies within the caster's attack range. These attacks can proc any attack modifier and on hit effects normally. The attacks are performed even while the caster is disabled, hidden or even while dead. This means the attacks happen even during Phase Shift. Since the rapid fire is bound to the leash, snapping it, or dispelling it with spell immunity causes the attacks to stop. Multiple instances of Dream Coil on enemies causes the caster to attack multiple times, for each instance, with the interval based on when the debuffs were received."],"mana":"100\/150\/200","elements":["Partially pierces spell immunity."],"cooldown":"70\/65\/60","name":"Dream Coil","description":["Cast Animation: 0.1+0.27","Cast Range: 750 ( 875)","Coil Latch Radius: 375","Link Break Radius: 600","Link Break Damage: 300\/400\/500 ( 400\/550\/700)","Rapid Fire Attack Interval: 0 ( 0.6)","Initial Stun Duration: 0.5","Link Break Stun Duration: 1.8\/2.4\/3 ( 1.5\/3\/4.5)","Coil Duration: 6 ( 8)"],"hot_key":"R","legacy_key":"C"}],"bio":"While Puck seems at first glance a mischievous, childish character, this quality masks an alien personality. The juvenile form of a Faerie Dragon, a creature that lives for eons, Puck spends countless millennia in its childish form. So while it is technically true that Puck is juvenile, it will continue to be so when the cities of the present age have sloughed away into dust. Its motives are therefore inscrutable, and what appears to be play may in fact indicate a darker purpose or just its endless fondness for mischief.","talentsTips":["The all stats talent effectively grants Puck 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","Gold granted from the talent is unreliable gold."],"trivia":["Puck's alternate name was Kupu-Kupu, which means \"moth\" or \"butterfly\" in the Malay and Indonesian languages.","Puck was introduced in Version 6.48 as a result of a hero creation contest held on the DotA-Allstars forum, in which players designed a new hero to suit the faerie dragon model from Warcraft III. This makes Puck the first and only hero created by the community.","Puck pays homage to a character of the same name from Shakespeare's A Midsummer Night's Dream. Aside from Puck's playful attitude, its line \"A midsummer nightmare\" is also an allusion to the play.","Since Puck pays homage to a Shakespeare character, most of its lines are delivered in phrasing similar to iambic pentameter.","The Version 6.87 Illusory Orb speed change was a developer's joke based on this reddit thread.","This line \"One Puck, two Puck, three Puck more!\" is a reference to Eminem's final rap battle in 8 Mile movie (2002).","This line \"One and one and one is three!\" is a reference to The Beatles' song \"Come Together\" (1969)."],"talents":["Dream Coil Rapid Fire:+420 Gold\/Min","+40% Illusory Orb Distance\/Speed:-8s Waning Rift Cooldown","+90 Damage:+15% Spell Amplification","+125 Cast Range:+5 All Stats"],"desc":"Puck, the Faerie Dragon, is a highly mobile ranged intelligence hero best known for being an extremely unpredictable and slippery target. Puck is commonly played as an initiator and ganker, with spells that are equally useful for super-aggressive maneuvers as well as daring escapes. Expert use of Puck's abilities will let you appear out of nowhere, suddenly leave your enemies crippled and disadvantaged, and get away in the blink of an eye - but mess up your timing or misjudge the situation, and there is little left to save this fragile Hero from death."}