{"abilities":[{"spell":"Puck запускает волшебный шар, летящий по прямой и поражающий всех противников на своем пути. Puck может в любой момент телепортироваться к шару с помощью Ethereal Jaunt.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Illusory Orb движется со скоростью 651 ( 1139.25).","Для достижения максимальной дистанции шару нужно 3 секунды; он может поразить юнитов на расстоянии до 2175 единиц (складывается из расстояния полёта и радиуса урона). При выборе таланта, увеличивающего дальность применения, шар преодолевает расстояние за 3.23 секунды и поражает юнитов на расстоянии до 2325 единиц. При выборе таланта, увеличивающего скорость шара, он преодолевает расстояние за 3 секунды и поражает юнитов на расстоянии до 3150 единиц. При выборе двух талантов шар преодолевает расстояние за 3.15 секунды и поражает юнитов на расстоянии до 3300 единиц.","В описании способности отображается увеличение расстояния полета только от таланта 20-го уровня. Оба таланта увеличивают расстояние до 3075 единиц. Сам талант 10-го уровня увеличивает расстояние до 2100.","Illusory Orb излучает красный импульс спустя 2,5 секунды полета, предупреждая, что он вот-вот достигнет максимальной дальности полёта.","Illusory Orb наносит урон по местности, пройденной шаром, в размере 2175 ( 3150) единиц (складывается из дальности полета + радиуса).","Illusory Orb оставляет за собой летающий обзор радиусом 450. Обзор задерживается на 5 секунд."],"mana":"80\/100\/120\/140","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"13\/12\/11\/10","name":"Illusory Orb","description":["Анимация применения: 0,1+0,27","Дальность применения: 3000 ( 3150)","Расстояние полета: 1950 ( 2925)","Радиус урона: 225","Урон: 70\/140\/210\/280"],"hot_key":"Q","legacy_key":"R"},{"spell":"Телепортирует Puck к летящему шару.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Эта способность дается сразу при изучении Illusory Orb.","Эта способность не активна, пока Illusory Orb не будет использована куда-либо.","При активации способности можно использовать любую способность из неё или предмет.","С помощью Ethereal Jaunt можно избегать снарядов от способностей.","Если использовать два Illusory Orb, то способность Ethereal Jaunt остается активной до окончания действия первого Illusory Orb.","При этом Puck телепортируется к последнему созданному Illusory Orb."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Ethereal Jaunt","description":["Анимация применения: 0+0,53"],"hot_key":"D","legacy_key":"E"},{"spell":"Puck распыляет волшебный порошок, наносящий урон и запрещающий использовать магию всем врагам поблизости.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Несмотря на визуальные эффекты, безмолвие и урон наносится мгновенно на весь радиус.","Waning Rift сначала наносит урон, затем применяет дебафф."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/15\/14\/13 ( 7\/6\/5\/4)","name":"Waning Rift","description":["Анимация применения: 0,1+0,27","Радиус: 400","Урон: 100\/160\/220\/280","Длительность безмолвия: 2\/2,5\/3\/3,5"],"hot_key":"W","legacy_key":"W"},{"spell":"Puck ненадолго смещается в другое измерение, защищающее от любых атак.","effects":["Способность Ненаправленная \/ Произносимая","Действует на Себя"],"notes":["С помощью Phase Shift можно избегать снарядов от способностей.","Предметы, которые не прерывают прерываемые способности (например Shadow Blade или Shiva's Guard), отменяют Phase Shift.","Puck неуязвим и отсутствует на карте, пока действует Phase Shift.","Не применяет к заклинателю сквозное состояние, поэтому во время действия Phase Shift герой продолжает блокировать путь для других юнитов."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Нельзя применять в оцепенении.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"6","name":"Phase Shift","description":["Анимация применения: 0+0","Макс. время применения: 0,75\/1,5\/2,25\/3,25"],"hot_key":"E","legacy_key":"F"},{"spell":"Создает нестабильную магическую спираль, цепляющуюся за вражеских героев, оглушающую их на 0,5 секунды и наносящую урон. Если противник растягивает спираль, отойдя слишком далеко, то она рвется, оглушая его и нанося ему дополнительный урон.","effects":["Способность Направленная на область","Действует на Вражеских героев","Урон Магический"],"notes":["Каждый вражеский герой (включая иллюзии, клонов и крипов-героев) в радиусе 375 единиц использования Dream Coil получает привязку, запрещающую использование определенных заклинаний для перемещения. Вход в область действия после применения не даст никакого эффекта. Способность не привязывает врагов после применения.","Если связанные герои передвинутся более, чем на 600 от места связки, они разорвут связку и получат оглушение и урон. Неважно, насколько далеко или быстро переместился герой, оглушение и урон всегда сработают, кроме случая действия неуязвимости на героя. Разрыв привязки сначала наносит урон, затем применяет дебафф.","Dream Coil связывает невидимых юнитов или юнитов в тумане войны, но видимая линия обрыва отображает лишь их последнее местоположение.","Несколько применений Dream Coil полностью складываются, поскольку каждое применение накладывает отдельный дебафф.","При выборе таланта на 25-ом уровне Puck совершает мгновенные атаки по всем врагам, попавшим под связку, пока остается в радиусе 775 единиц от выбранной области. На эти атаки могут сработать любые модификаторы атаки и эффекты, срабатывающие при атаке. Атаки наносятся даже если Puck обезврежен, спрятан или мертв. То есть Puck атакует даже в состоянии Phase Shift. Поскольку быстрые атаки связаны с эффектом связки, то её разрыв или развеивание с помощью иммунитета к заклинанием останавливает атаки. Несколько применений Dream Coil позволяет заклинателю атаковать несколько раз с интервалом, установленным при получении дебаффа."],"mana":"100\/150\/200","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"70\/65\/60","name":"Dream Coil","description":["Анимация применения: 0,1+0,27","Дальность применения: 750 ( 900)","Радиус спирали: 375","Радиус разрыва: 600","Радиус быстрых атак: 0 ( 775)","Урон при разрыве: 300\/400\/500 ( 400\/550\/700)","Интервал быстрых атак: 0 ( 0,7)","Длительность первоначального оглушения: 0,5","Длительность оглушения при разрыве: 1,8\/2,4\/3 ( 1,5\/3\/4,5)","Длительность связки: 6 ( 8)"],"hot_key":"R","legacy_key":"C"}],"bio":"На первый взгляд это существо обладает озорным, ребяческим характером, но за ним скрывается чужеродная личность. Волшебные дракончики живут целую вечность, и пусть эта особь провела в юном облике несчётные тысячелетия, она всё равно будет считаться молодой, даже когда города нашего времени обратятся в пыль. Посему побуждения этого создания непостижимы, а игривость может скрывать его тёмное начало. Истинная природа дракончика — в его бесконечных проказах.","talentsTips":["Талант на все атрибуты в общем даёт Puck: 120 здоровья, 0,6 регенерации здоровья, 0,48% сопротивления магии, 0,96 брони, 6 скорости атаки, 0,3% скорости передвижения, 72 маны, 0,3 регенерации маны, 0,42% урона заклинаний и 6 урона от атаки.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Золото с таланта является ненадёжным."],"trivia":["Альтернативное имя Puck — Kupu-Kupu, что означает \"бабочка\" на Малайском и Индонезийском языках.","Данный герой был добавлен в DotA в версии 6.48 в результате конкурса, проходившего на форуме DotA-Allstars, в котором игроки создавали героя, подходящего для модельки сказочного дракончика из Warcraft III. Это делает Puck первым и единственным героем, разработанным сообществом.","Puck является отсылкой к одноимённому персонажу из A Midsummer Night's Dream Шекспира. Кроме поведения Puck, фраза \"A midsummer nightmare\" является отсылкой к произведению.","Так как Puck является отсылкой к Шекспиру, многие его фразы созданы в ямбическом метре.","Изменение скорости Illusory Orb в версии 6.87 было шуткой разработчиков, основанной на этом посте на Reddit.","Фраза \"One Puck, two Puck, three Puck more!\" является отсылкой к последней рэп-битве Eminem из фильма 8 Миля (2002)."],"talents":["Быстрые атаки по жертвам Dream Coil:+420 золота в минуту","+50% к скорости и дальности Illusory Orb:-9 сек. перезарядки Waning Rift","+90 к урону:+15% к урону от способностей","+150 к дальности способностей:+6 ко всем атрибутам"],"desc":"Puck — это герой с дальним типом атаки, основной характеристикой которого является Интеллект. Первой способностью, Illusory Orb, Puck запускает волшебный шар, летящий по прямой и поражающий всех противников на своем пути. Puck может в любой момент телепортироваться к шару с помощью Ethereal Jaunt. Вторая способность, Waning Rift, распыляет волшебный порошок, наносящий урон и запрещающий использовать магию всем врагам поблизости. Третья способность, Phase Shift, позволяет герою уйти в другое измерение, что делает героя неуязвимым для противников. Ультимативная способность, Dream Coil, создает магическую спираль, цепляющуюся за вражеских героев, оглушающую их на 0,5 секунды. Если противник растягивает спираль, отойдя слишком далеко, то она рвется, оглушая его и нанося ему урон. Улучшение с Aghanim's Scepter увеличивает урон от разрыва спирали, увеличивает время ее действия, а оглушение от разрыва спирали проходит сквозь невосприимчивость к заклинаниям."}