{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d6\/Witch_Doctor_Paralyzing_Cask_1.mp3\/revision\/latest?cb=20191216030754",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Бочонок летит в первую цель со скоростью 1200, а отскакивает с интервалом в 0,3 секунды и скоростью 1000.",
        "Не отскакивает на невидимых, неуязвимых или спрятанных существ, но отскакивает на существ в тумане войны.",
        "Изначальная цель не учитывается в числе отскоков: способность срабатывает до 3\/5\/7\/9 (TagTalent 5\/7\/9\/11) раз. Все отскоки наносят до 150\/350\/700\/1260 (TagTalent 300\/595\/1080\/1815) урона героям (до уменьшений). Все отскоки наносят до 300\/700\/1400\/2520 (TagTalent 600\/1190\/2160\/3630) крипам. Чтобы узнать о том, сколько урона наносит каждый отскок Paralyzing Cask на каждом уровне и при выборе увеличивающего количество отскоков таланта, смотрите таблицу.",
        "Все отскоки наносят до 150\/350\/700\/1260 (TagTalent 300\/595\/1080\/1815) урона героям (до уменьшений).",
        "Все отскоки наносят до 300\/700\/1400\/2520 (TagTalent 600\/1190\/2160\/3630) крипам.",
        "Чтобы узнать о том, сколько урона наносит каждый отскок Paralyzing Cask на каждом уровне и при выборе увеличивающего количество отскоков таланта, смотрите таблицу.",
        "Бочонок может отскочить на одно и то же существо несколько раз, но только при условии попадания в другое соседнее существо То есть цель будет задета до 2\/3\/4\/5 (TagTalent 3\/4\/5\/6) раз. Наносит до 100\/210\/400\/700 (TagTalent 180\/340\/600\/990) урона героям. Наносит до 200\/420\/800\/1400 (TagTalent 360\/680\/1200\/1980) урона крипам.",
        "То есть цель будет задета до 2\/3\/4\/5 (TagTalent 3\/4\/5\/6) раз.",
        "Наносит до 100\/210\/400\/700 (TagTalent 180\/340\/600\/990) урона героям.",
        "Наносит до 200\/420\/800\/1400 (TagTalent 360\/680\/1200\/1980) урона крипам.",
        "Считает иллюзии, клонов и крипов-героев за героев.",
        "Бочонок сначала применяет дебафф, затем наносит урон.",
        "При повторном применении счетчик отскоков сбрасывается. Все бочонки, отлетевшие от одного и того же героя, используют единый счетчик отскоков.",
        "Все бочонки, отлетевшие от одного и того же героя, используют единый счетчик отскоков."
      ],
      "mana": "20\/18\/16\/14",
      "item_behaviour": [],
      "name": "Paralyzing Cask",
      "cooldown": "80\/100\/120\/140",
      "description": "Бросает бочонок с парализующим порошком, который отскакивает от противников, оглушая их и нанося им увеличивающийся с каждым отскоком урон. Крипы получают 1 от урона.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,35+0,37",
        "Дальность применения: 600",
        "Радиус отскока: 575",
        "Число отскоков: 2\/4\/6\/8 ( 4\/6\/8\/10)",
        "Урон героям: 40",
        "Доп. урон за отскок: 10\/15\/20\/25",
        "Множитель урона по крипам: 200%",
        "Длительность оглушения: 1"
      ],
      "legacy_key": "C",
      "story": "Жарвакко перемалывает кости павших союзников и противников, пополняя порошком свой арсенал чар и алхимии."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Witch_Doctor_Voodoo_Restoration_1.mp3\/revision\/latest?cb=20191216030758",
      "effects": [
        "Способность: Переключаемая",
        "Действует на: Союзников \/ Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "При переключении Voodoo Restoration не прерывает произносимые заклинания Witch Doctor.",
        "Обезвреживание Witch Doctor не отключает Voodoo Restoration, но оглушенный герой переключать способность не может.",
        "Лечит и наносит урон 2,64\/3,96\/5,28\/6,6 (TagTalent +0,495% от максимального здоровья) единиц здоровья и расходует 3,3\/6,6\/9,9\/13,2 единиц маны с интервалом в 0,33 секунды до учёта сопротивлений спустя 0,33 секунды после активации. Расходует 2,64\/3,96\/5,28\/6,6 (TagTalent 1,98\/2,97\/3,96\/4,95) маны в тех же интервалах.",
        "Расходует 2,64\/3,96\/5,28\/6,6 (TagTalent 1,98\/2,97\/3,96\/4,95) маны в тех же интервалах.",
        "Лечение и урон предоставляются одной и той же аурой аурой. Эффект задерживается на 0,5 сек. Расход маны так же связан с аурой. То есть после деактивации заклинание лечит и расходует ману еще в течение 0,5 секунды. Если у Witch Doctor недостаточно маны для следующих срабатываний, то заклинание деактивируется. При этом задержавшийся бафф продолжит лечение даже без маны, срабатывая еще 2 раза. Не действует на неуязвимых или спрятанных существ.",
        "Расход маны так же связан с аурой.",
        "То есть после деактивации заклинание лечит и расходует ману еще в течение 0,5 секунды.",
        "Если у Witch Doctor недостаточно маны для следующих срабатываний, то заклинание деактивируется.",
        "При этом задержавшийся бафф продолжит лечение даже без маны, срабатывая еще 2 раза.",
        "Не действует на неуязвимых или спрятанных существ."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Voodoo Restoration",
      "cooldown": "35\/40\/45\/50",
      "description": "Герой направляет свои чары на лечение ближайших союзников, расходуя ману каждую секунду действия этой способности. Наносит врагам урон в размере 100% от лечения.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 500\/550\/600\/650",
        "Базовое лечение\/урон в секунду: 10\/20\/30\/40",
        "Маны в секунду: 8\/12\/16\/20 ( 6\/9\/12\/15)",
        "Длительность задержки ауры: 0,5",
        "Макс. здоровья в качестве лечения\/урона в секунду: 1,5%"
      ],
      "legacy_key": "V",
      "story": "Фокусы Жарвакко могут не только околдовать врагов, но и исцелить от различных болезней."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Witch_Doctor_Maledict_1.mp3\/revision\/latest?cb=20191216030750",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "notes": [
        "Проверяет значение текущего здоровья задетых существ 4 раза, первый - когда проклятье применяется, а остальные - каждые 4 сек. в течение длительности способности.",
        "Урон основан на разнице между текущим здоровьем героя и его здоровье на момент применения проклятья. То есть, чем больше разница между текущим здоровьем и здоровьем после получения дебаффа, тем больше урона проклятье нанесет. И наоборот, чем больше здоровья стало, после применения заклинания, тем меньше урона нанесёт способность. Любое лечение уменьшает урон. Также не имеет значения, как именно существо потеряло здоровье, так как способность учитывает значение здоровья, а не количество полученного урона. Здесь указано, сколько урона повторно наносится проклятьем из-за потери здоровья в зависимости от того, сколько здоровья было сожжено на каждом уровне способности (до уменьшений): 0–3,9 секунды: 48%\/72%\/97%\/121% (TagTalent 109%\/133%\/157%\/181%) 3,9–7,9 секунды: 32%\/48%\/64%\/80% (TagTalent 72%\/88%\/105%\/121%) 7,9–11,9 секунды: 16%\/24%\/32%\/40% (TagTalent 36%\/44%\/52%\/60%)",
        "То есть, чем больше разница между текущим здоровьем и здоровьем после получения дебаффа, тем больше урона проклятье нанесет.",
        "И наоборот, чем больше здоровья стало, после применения заклинания, тем меньше урона нанесёт способность. Любое лечение уменьшает урон.",
        "Также не имеет значения, как именно существо потеряло здоровье, так как способность учитывает значение здоровья, а не количество полученного урона.",
        "Здесь указано, сколько урона повторно наносится проклятьем из-за потери здоровья в зависимости от того, сколько здоровья было сожжено на каждом уровне способности (до уменьшений): 0–3,9 секунды: 48%\/72%\/97%\/121% (TagTalent 109%\/133%\/157%\/181%) 3,9–7,9 секунды: 32%\/48%\/64%\/80% (TagTalent 72%\/88%\/105%\/121%) 7,9–11,9 секунды: 16%\/24%\/32%\/40% (TagTalent 36%\/44%\/52%\/60%)",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 12 раз. Вместе с сжиганием здоровья способность срабатывает 15 раз. Сжигание здоровья происходит за 0,1 секунды до каждого 4-го тика, поэтому здоровье сжигается после 3-го, 7-го и 11-го тика.",
        "Вместе с сжиганием здоровья способность срабатывает 15 раз.",
        "Сжигание здоровья происходит за 0,1 секунды до каждого 4-го тика, поэтому здоровье сжигается после 3-го, 7-го и 11-го тика.",
        "Без остальных источников урона Maledict наносит до 188,5\/320,9\/483,6\/680,2 (TagTalent 256,6\/432,2\/644,6\/897,8) урона существу (до уменьшений).",
        "Дебафф можно наложить на иллюзии и крипов-героев.",
        "Не действует на неуязвимых и спрятанных существ. Действует на невидимых существ."
      ],
      "mana": "30\/26\/22\/18",
      "item_behaviour": [],
      "name": "Maledict",
      "cooldown": "105\/110\/115\/120",
      "description": "Накладывает сглаз на всех вражеских героев в небольшой области, после чего они получают урон каждую секунду. Помимо этого, каждые 4 секунды им наносится периодический урон, зависящий от количества здоровья, потерянного с наложения сглаза.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,35+0",
        "Дальность применения: 575",
        "Радиус: 180 ( 255)",
        "Урон в секунду: 12\/18\/24\/30",
        "Урон от потерянного здоровья: 16%\/24%\/32%\/40% ( 36%\/44%\/52%\/60%)",
        "Интервал нанесения урона: 4",
        "Длительность: 12"
      ],
      "legacy_key": "E",
      "story": "Некоторые заклятия вуду способны заставить врага жалеть о том, что он повстречался с Жарвакко."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Witch_Doctor_Voodoo_Switcheroo.mp3\/revision\/latest?cb=20210103153444",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ "
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Превращает Witch Doctor в неуязвимое и спрятанное существо и запрещает герою действовать всю длительность.",
        "Тотем смерти призывается на местоположение Witch Doctor; характеристики варда равны текущему уровню Death Ward. Если Death Ward не изучена, то при применении Voodoo Switcheroo ничего не сделает. На тотем распространяются все примечания, относящиеся к тотему смерти. Также на Voodoo Switcheroo действует улучшение от Aghanim's Scepter.",
        "Если Death Ward не изучена, то при применении Voodoo Switcheroo ничего не сделает.",
        "На тотем распространяются все примечания, относящиеся к тотему смерти.",
        "Также на Voodoo Switcheroo действует улучшение от Aghanim's Scepter.",
        "Voodoo Switcheroo нельзя досрочно прервать и она всегда работает свою полную длительность, если только Witch Doctor не умрёт во время неё.",
        "Скорость атаки тотема смерти уменьшается на 30.",
        "С базовой скоростью атаки в 0,22 и замедлением в 30 вард атакует до 10 раз. Наносит до 286,36\/477,27\/668,18 (TagTalent 477,27\/668,18\/859,09) урона в секунду одному герою. Наносит до 900\/1500\/2100 (TagTalent 1500\/2100\/2700) урона одному герою (до уменьшений).",
        "Наносит до 286,36\/477,27\/668,18 (TagTalent 477,27\/668,18\/859,09) урона в секунду одному герою.",
        "Наносит до 900\/1500\/2100 (TagTalent 1500\/2100\/2700) урона одному герою (до уменьшений)."
      ],
      "mana": "40",
      "item_behaviour": [],
      "name": "Voodoo Switcheroo",
      "cooldown": "150",
      "description": "Ненадолго превращает владельца в тотем от способности Death Ward, атакующий медленнее. Скрывает героя на время действия.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,1+0,73",
        "Снижение скорости атаки тотема смерти: 30",
        "Длительность: 3"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Witch_Doctor_Death_Ward.mp3\/revision\/latest?cb=20191216030749",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Вражеских героев"
      ],
      "notes": [
        "Тотем смерти автоматически атакует врагов в пределах своей дальности атаки, используя ◉ Стандартно правила автоатаки. Можно вручную выбрать цель для атаки варда через A или Нажатие ПКМ на врага в пределах дальности атаки. С активной опцией «Приказ всем юнитам клавишей Ctrl» Ctrl+ Нажатие ПКМ на врага отдаст варду команду на атаку. Также можно остановить атаку варда через S (работает только при опции ◎ Никогда).",
        "Можно вручную выбрать цель для атаки варда через A или Нажатие ПКМ на врага в пределах дальности атаки.",
        "С активной опцией «Приказ всем юнитам клавишей Ctrl» Ctrl+ Нажатие ПКМ на врага отдаст варду команду на атаку.",
        "Также можно остановить атаку варда через S (работает только при опции ◎ Никогда).",
        "Атакует только героев, включая клонов и иллюзии, но исключая крипов-героев.",
        "Источником урона является сам вард; эффекты, реагирующие на урон, срабатывают на вард, а не на Witch Doctor (например, Blade Mail).",
        "С базовым временем атаки, равным 0,22, вард атакует до 37 раз.",
        "Наносит до 409,09\/681,82\/954,55 (TagTalent 681,82\/954,55\/1227,27) урона в секунду одному герою.",
        "Наносит до 3330\/5550\/7770 (TagTalent 5550\/7770\/9990) урона одному герою (до уменьшений).",
        "Урон тотема смерти не снижается блокировкой урона.",
        "Дает наземный обзор в радиусе 1200\/800 в месте размещения в течение 5 секунд после завершения произнесения.",
        "С Aghanim's Scepter атаки тотема смерти не могут промахнуться и перескакивают между ближайшими вражескими героями в пределах 100%. Не совершает мгновенные атаки. Отскочившие снаряды — часть заклинания. Они не активируют модификаторы атаки или эффекты, срабатывающие при атаке, игнорируют уклонение и считаются уроном от заклинаний. При этом на отскоки все равно действует блокировка урона. Урон оскоков рассчитывается от значения урона основной атаки. Не отскакивают от невидимых существ и существ в тумане войны. Один снаряд никогда не сможет отскочить дважды от одного и того же существа.",
        "Не совершает мгновенные атаки. Отскочившие снаряды — часть заклинания.",
        "Они не активируют модификаторы атаки или эффекты, срабатывающие при атаке, игнорируют уклонение и считаются уроном от заклинаний.",
        "При этом на отскоки все равно действует блокировка урона.",
        "Урон оскоков рассчитывается от значения урона основной атаки.",
        "Не отскакивают от невидимых существ и существ в тумане войны. Один снаряд никогда не сможет отскочить дважды от одного и того же существа."
      ],
      "mana": "60",
      "item_behaviour": [],
      "name": "Death Ward",
      "cooldown": "200",
      "description": "Призывает смертоносный тотем, атакующий вражеских героев. Действует до 8 секунд. Тотем имеет бонус к точности в 50%.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,35+0",
        "Дальность применения: 600",
        "Максимальная длительность произнесения: 8",
        "Точность варда: 50% ( 100%)",
        "Радиус отскока: 650"
      ],
      "legacy_key": "D",
      "story": "Жарвакко исполняет ритуальный танец, приходящий к пережившим его в страшных снах."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.4,
    "attrAgility": 13.0
  },
  "description": "Призывает тотем смерти, наносящий значительный урон Witch Doctor идеально дополняет любую команду. Мало кто сравнится с ним по универсальности: он может постепенно излечивать товарищей, оглушать и насмерть проклинать врагов, а также уничтожать их своим мощным ультом.  Поддержка Быстрый урон Контроль ★☆☆",
  "history": "Вдали ковыляет тонкий силуэт — конечности его свисают, а походка виляет: это колдун неустанно ищет на поле боя слабину, где его умения принесут больше всего пользы и вреда. Неясно, уродилось ли это существо таким или его что-то обезобразило, но никто не усомнится в силах, что держит в себе такой неопрятный каркас. Громко стуча посохом оземь, Жарвакко вышагивает по полю боя, пользуясь внушительным арсеналом амулетов, проклятий, заговоров и заклинаний. В его теле — магические знания, добытые за несколько жизненных циклов на взгорье острова Арктура, и теперь колдун мастерски разит этими знаниями противников. Жарвакко может стать и лучшим другом, и злейшим врагом: он исцеляет союзников, но сеет смерть для тех, кто встаёт у него на пути."
}