{"abilities":[{"effects":["Cast Range: Global","Attack Speed Bonus: 60","Night Vision Bonus: 200"],"notes":["Double clicking the item casts it on self.","A hero cannot consume more than one Moon Shard.","Once consumed the item remains factored into the hero's net worth and GPM.","Can target Spirit Bear as well, but not other creep-heroes.","Cannot target illusions and clones. Illusions and Tempest Doubles copy the Moon Shard buff, if the main hero has it. However, the buff is not copied by Meepo clones and Wukong's Command clones.","The vision bonus follows the same rules as Shade Sight.","The vision bonus from consumption also stacks with Shade Sight."],"elements":["Ability Target Unit","Affects Allied Heroes"],"description":"Consume the Moon Shard to permanently gain 60 attack speed and 200 bonus night vision. Max 1 use."},{"effects":["Night Vision Bonus: 400"],"notes":["Applies its vision after any other vision changing effect. This means it works against Desolate, Nightmare, and Smoke Screen.","Night vision bonuses from multiple shards do not stack.","Although this ability is lost upon consuming the Moon Shard, the buff from consumption still grants half the bonus night vision."],"elements":["Ability Passive","Affects Self"],"description":"Grants 400 bonus night vision."}],"cost":"4000","description":"Said to be a tear from the lunar goddess Selemene.","trivia":["Prior to the July 14, 2017 Patch, Moon Shard's active ability, Consume, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."],"further":["Hyperstone","Hyperstone"],"tips":["The item works very well with illusions especially with mana burn, critical hits and low base attack time.","In games where a player finds themselves with more gold than they can spend, due to having all 6 item slots filled out, it may be worth considering purchasing a Moon Shard to consume immediately.","It may be prudent for players to purchase the Moon Shard as their sixth item, to fill in an inventory slot and gain its full benefits while they farm a seventh item to replace Moon Shard, which only provides half the attack speed and night vision after consumption."],"attrs":["Active Consume","Charges 1","Passive Shade Sight","Bonus +140 Attack speed","Disassemble? No","Alert allies? No"]}