{
  "abilities": [
    {
      "notes": [
        "Наносит 14\/20\/26\/32 дополнительного урона + 0,5%\/0,9%\/1,3%\/1,7% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,8%\/1,2%\/1,6%\/2%) от максимального запаса маны цели в виде урона (до учёта сопротивлений). Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом и он может быть прорубающим, но он не может быть критическим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение",
        "Атаки иллюзий выжигают меньшее количество маны: 14\/20\/26\/32 единиц + 0,5%\/0,9%\/1,3%\/1,7% от максимального запаса за удар. Иллюзии также имеют меньший бонусный урон: 7\/10\/13\/16 дополнительного урона + 0,25%\/0,45%\/0,65%\/0,85% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,4%\/0,6%\/0,8%\/1%) от максимального запаса маны цели в виде урона (до учёта сопротивлений)",
        "Если после атаки по цели у неё заканчивается мана, то она замедляется на 0,75 секунд. Несколько срабатываний на цель не складываются, но обновляют длительность. Иллюзии также имеют этот эффект",
        "Сначала сжигает ману, затем наносит урон",
        "Не действует на союзных существ при атаке",
        "Складывается со способностью  Manabreak у Diffusal Blade"
      ],
      "item_behaviour": [],
      "description": "Сжигает ману врага с каждым ударом. Mana Break наносит противнику урон в размере 50% от сожженной маны.",
      "hot_key": "Q",
      "params": [
        "Сжигание маны за удар: 28\/40\/52\/64",
        "Сжигаемая доля от макс. маны: 1%\/1,8%\/2,6%\/3,4% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1,6%\/2,4%\/3,2%\/4%)",
        "Урон за единицу маны: 50%",
        "Процент для иллюзий: 50%",
        "Замедление целей без маны: 25%\/30%\/35%\/40%",
        "Длительность замедления: 0,75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2f\/Anti-Mage_Mana_Break.mp3\/revision\/latest?cb=20191216010736",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Mana Break",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Измененный прием турстаркурийских монахов, обращающий волшебную энергию против самого чародея."
    },
    {
      "notes": [
        "Blink можно использовать для избегания летящих снарядов",
        "Не телепортирует на полное расстояние при выборе точки, находящейся на меньшем расстоянии, чем максимальное",
        "При выборе точки, находящейся дальше, чем это позволяет способность, дистанция перемещения будет максимальной"
      ],
      "item_behaviour": [],
      "description": "Телепортация на короткую дистанцию, позволяющая Anti-Mage врываться в схватку и быстро возвращаться назад.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,53",
        "Дальность применения: Глобальная",
        "Макс. дальность телепортации: 750\/900\/1050\/1200 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1000\/1150\/1300\/1450)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Anti-Mage_Blink_1.mp3\/revision\/latest?cb=20191216010740",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя"
      ],
      "mana": "12\/10\/8\/6 (TagTalent 11\/9\/7\/5)",
      "aghanim": null,
      "name": "Blink",
      "cooldown": "45",
      "legacy_key": "B",
      "story": "В схватках с мертвыми богами юный послушник познал важность неуловимости."
    },
    {
      "notes": [
        "Сочетается мультипликативно с другими источниками сопротивления магии",
        "Увеличивает общее значение сопротивления магии Anti-Mage до 36,25%\/43,75%\/51,25%\/58,75% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 51,25%\/58,75%\/66,25%\/73,75%)",
        "Отраженные прерываемые способности можно отменить",
        "Эффекты от  Linken's Sphere,  Mirror Shield и  Lotus Orb сработают только в том случае, если  Counterspell находится на перезарядке.  Counterspell не отражает заклинания, отраженные  Mirror Shield и  Lotus Orb (отраженные заклинания повторно не отражаются). Эффект использует обычную перезарядку, поэтому на неё действуют любые эффекты, манипулирующие перезарядкой. В отличие от других источников отражения заклинаний, способность не отражает  Phantom Strike и  Blink Strike. Эти способности только блокируются"
      ],
      "item_behaviour": [],
      "description": "Увеличивает сопротивление магическому урону. Можно применить, чтобы создать вокруг себя противомагический щит, который полностью отражает все направленные заклинания обратно во врага.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Доп. сопротивление магии: 15%\/25%\/35%\/45% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 35%\/45%\/55%\/65%)",
        "Длительность: 1,2",
        "Внешний радиус ауры:  900",
        "Внутренний радиус ауры:  300",
        "Снижение магического урона во внешнем радиусе:  10%",
        "Множитель снижения магического урона во внутреннем радиусе:  3",
        "Длительность ауры:  0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Anti-Mage_Counterspell_1.mp3\/revision\/latest?cb=20191216010734",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "15\/11\/7\/3",
      "aghanim": null,
      "name": "Counterspell",
      "cooldown": "45",
      "legacy_key": "E",
      "story": "Сконцентрировавшись, Антимаг обращает врождённое сопротивление в точную контратаку."
    },
    {
      "notes": [
        "Требуется  Aghanim's Scepter для разблокировки",
        "Созданная иллюзия смотрит в том же направлении, что и заклинатель, использует частицы и звук способности  Blink",
        "Если  Blink не изучена, то Blink Fragment будет использовать дальность применения способности Blink первого уровня",
        "Иллюзия полностью неконтролируемая",
        "Иллюзия не является неуязвимой, её можно атаковать и убить",
        "Если целью является враждебный юнит, то иллюзия будет атаковать это существо",
        "Если целью является точка, то иллюзия будет использовать стандартные правила автоатаки. Иллюзия игнорирует настройки автоатаки игрока и всегда использует стандартную автоатаку. Если рядом с точкой нет противников, то иллюзия будет стоять, пока в радиусе автоатаки не появится враг",
        "Иллюзия имеет сквозное передвижение",
        "Иллюзия от этой способности получает бонусы от улучшения  Counterspell с помощью  Aghanim's Shard, создавая иллюзии Anti-Mage при успешном отражении способности"
      ],
      "item_behaviour": [],
      "description": "Перемещает к выбранному врагу или в выбранную точку иллюзию, которая 7 секунд атакует противников. Эта иллюзия применяет Counterspell одновременно с основным героем. Имеет заряда.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,84",
        "Дальность применения: 750\/900\/1050\/1200 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1000\/1150\/1300\/1450)",
        "Урон иллюзии: 25%",
        "Урон по иллюзии: 200%",
        "Длительность иллюзии: 7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Anti-Mage_Blink_Fragment_1.mp3\/revision\/latest?cb=20201220204524",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов"
      ],
      "mana": "",
      "aghanim": null,
      "name": "Blink Fragment",
      "cooldown": "25",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "Перекрестие указателя должно выделять вражеского юнита",
        "Урон основывается на количестве маны у основной цели, но урон наносится всем противникам в радиусе действия способности",
        "Mana Void сначала применяет дебафф, затем наносит урон",
        "Только основная цель будет оглушена",
        "При использовании на существ без запаса маны применяет только мини-оглушение",
        "Звуковой эффект проигрывается во время применения и слышен всем"
      ],
      "item_behaviour": [],
      "description": "За каждую отсутствующую у цели единицу маны ей и окружающим противникам наносится урон. Основная цель кратковременно оглушается.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,63",
        "Дальность применения: 600",
        "Радиус: 500 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 650)",
        "Урон за единицу отсутствующей маны: 0,8\/0,95\/1,1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,9\/1,05\/1,2)",
        "Длительность оглушения: 0,3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Anti-Mage_Mana_Void.mp3\/revision\/latest?cb=20191216010737",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "70 (TagTalent 20)",
      "aghanim": null,
      "name": "Mana Void",
      "cooldown": "100\/200\/300",
      "legacy_key": "V",
      "story": "Одолев врагов, борец с магией карает их за использование тайных искусств."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.6,
    "attrStrength": 21.0,
    "attrIntelligence": 12.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.8,
    "attrAgility": 24.0
  },
  "description": "Выжигает ману врагов атаками Если Anti-Mage наберёт полную силу, мало кто сможет его остановить. Он способен забирать у врагов ману каждым ударом или телепортироваться на небольшие расстояния, что не позволяет врагам загнать его в угол.  Керри Побег Быстрый урон ★☆☆",
  "history": "Монахи Турстаркури наблюдали за неровными долинами, раскинувшимися под их горным монастырем, в то время, как вторженцы, волна за волной, набегали на стоявшие у подножья королевства. Аскетичные, прагматичные, они пребывали в медитации, не знавшей никаких богов, засев в своем отрешенном от суетного мира высокогорном гнезде. Потом грянул легион Мертвого бога — крестоносцы, уничтожающие все местные культы и заменяющие их своей верой, родом из земель, известных лишь безжалостностью и тысячелетними войнами. Легионы мертвецов осадили Турстаркури. Две недели монастырь едва сдерживал натиск врагов, а те немногие монахи, что решили разузнать, в чем дело, восприняли нападение как попытку бесовских иллюзий отвлечь их от медитации. Они были убиты прямо на своих шелковых подстилках. Выжил лишь один молодой послушник — пилигрим, пришедший в поисках мудрости, но еще не принятый в монастырь. С ужасом он смотрел за тем, как монахи, которым он еще недавно подавал чаи и травы, гибли на своих местах, а потом присоединялись к рядам служителей Мертвого бога. Схватив охапку ценнейших священных писаний, он бежал в более безопасное место, поклявшись не только искоренить армию колдунов Мертвого бога, но и положить конец любой, какой бы то ни было, магии."
}