{
  "abilities": [
    {
      "notes": [
        "The cast range talent does not affect the max distance of Ether Shock.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+25 Wards Attack Damage",
          "talentRight": "+370 Ether Shock Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+1 Serpent Wards Max HP",
          "talentRight": "+2s Shackles Duration"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-5s Hex Cooldown",
          "talentRight": "+75 Serpent Wards Attack Range"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+175 Health",
          "talentRight": "+140 Shackles Total Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Shadow_Shaman_Ether_Shock.mp3\/revision\/latest?cb=20191216023116",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "With the starting radius, max distance and end radius, Ether Shock can hit units up to 1000 range away.",
        "The complete area is shaped like a cone in front of Shadow Shaman. The area starts in front of Shadow Shaman, and not at the primary target's position. Targets within the cone area are not chosen randomly. It chooses the closest valid targets to the primary target within the cone.",
        "The area starts in front of Shadow Shaman, and not at the primary target's position.",
        "Targets within the cone area are not chosen randomly. It chooses the closest valid targets to the primary target within the cone.",
        "All strikes together can deal up to 140\/600\/1300\/2240 (TagTalent 510\/1710\/3150\/4830) damage (before reductions).",
        "The purpose of the modifier is unknown."
      ],
      "mana": "100\/120\/140\/160",
      "hotKey": "Q",
      "cooldown": "14\/12\/10\/8",
      "description": "Creates a cone of ethereal energy that strikes multiple enemy units.",
      "spellName": "Ether Shock",
      "params": [
        "Cast Animation: 0.3+1.23",
        "Cast Range: 600",
        "Starting Radius: 200",
        "Max Distance: 500",
        "End Radius: 300",
        "Number of Targets: 1\/3\/5\/7",
        "Damage: 140\/200\/260\/320 (TagTalent 510\/570\/630\/690)",
        "Blocked fully only when primary target.",
        "Originally used to open shows with the travelling con-man, Rhasta's lightning display shocks adversaries in more ways than one."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Originally used to open shows with the travelling con-man, Rhasta's lightning display shocks adversaries in more ways than one."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/13\/Shadow_Shaman_Hex_1.mp3\/revision\/latest?cb=20191216023108",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Instant Kill"
      ],
      "notes": [
        "Applies a hex on the target, setting its base movement speed to 100, silencing, muting, and disarming it. However the target's movement speed is still affected by movement speed bonuses from items and abilities.",
        "However the target's movement speed is still affected by movement speed bonuses from items and abilities.",
        "Hex instantly destroys illusions.",
        "Shadow Shaman's hex transforms the target into a chicken. The Lamb to the Slaughter and Golden Lamb to the Slaughter change the model into a lamb.",
        "The Lamb to the Slaughter and Golden Lamb to the Slaughter change the model into a lamb."
      ],
      "mana": "70\/110\/150\/190",
      "hotKey": "W",
      "cooldown": "13 (TagTalent 8)",
      "description": "Transforms an enemy unit into a harmless creature, disabling their attacks and abilities.",
      "spellName": "Hex",
      "params": [
        "Cast Animation: 0+1.13",
        "Cast Range: 500",
        "Set Move Speed: 100",
        "Duration: 1.25\/2\/2.75\/3.5",
        "Effects persist if debuff was placed before spell immunity.",
        "Rhasta often ended performances by turning himself into a chicken - now, the humiliation is shared."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Rhasta often ended performances by turning himself into a chicken - now, the humiliation is shared."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Shadow_Shaman_Shackles.mp3\/revision\/latest?cb=20191216023113",
      "effects": [
        "Ability Target Unit \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Shackles stuns the target as long as it is channeled. If the target turns invulnerable or hidden, the channeling stops instantly.",
        "If the target turns invulnerable or hidden, the channeling stops instantly.",
        "Provides True Sight over the target, but only when the target was not invisible or within a fade time upon cast.",
        "Deals damage in 0.1-second intervals, starting immediately as the channeling begins, resulting in 28\/35\/43\/50 (TagTalent 48\/55\/63\/70) damage instances. The damage per tick is based on the total damage divided by its max channel time of 2.75\/3.5\/4.25\/5, and then divided by 10. The duration bonus from the talent is ignored. This translates to 21.82\/45.71\/61.18\/72 (TagTalent 85.45\/95.71\/102.35\/107) damage per second.",
        "The damage per tick is based on the total damage divided by its max channel time of 2.75\/3.5\/4.25\/5, and then divided by 10. The duration bonus from the talent is ignored.",
        "This translates to 21.82\/45.71\/61.18\/72 (TagTalent 85.45\/95.71\/102.35\/107) damage per second.",
        "Therefore, the final damage dealt (before reductions) is 61.09\/160\/263.06\/360 (TagTalent 239.27\/335\/440.12\/535) damage per second. The duration increasing talent deals up to 104.73\/251.43\/385.41\/504 damage per second. With both talents, it can deal up to 410.18\/526.43\/644.82\/749 per second.",
        "The duration increasing talent deals up to 104.73\/251.43\/385.41\/504 damage per second.",
        "With both talents, it can deal up to 410.18\/526.43\/644.82\/749 per second.",
        "Unlike other targeted spells, the caster vision of Shackles lasts for the entire channel duration (even if it gets canceled), instead of just 2 seconds.",
        "With Aghanim's Shard, places a total of 4 Serpent Wards based on its current level 100 range towards the target's north, east, south, and west. The wards' facing angle is set equal to Shadow Shaman's facing angle upon cast. Same auto attack settings from Mass Serpent Wards and its Aghanim's Scepter upgrade fully apply as well. If Mass Serpent Ward is not learnt, no wards are summoned.",
        "The wards' facing angle is set equal to Shadow Shaman's facing angle upon cast.",
        "Same auto attack settings from Mass Serpent Wards and its Aghanim's Scepter upgrade fully apply as well.",
        "If Mass Serpent Ward is not learnt, no wards are summoned."
      ],
      "mana": "140\/150\/160\/170",
      "hotKey": "E",
      "cooldown": "16\/14\/12\/10",
      "description": "Magically binds an enemy unit so that it cannot move or attack, while dealing damage over time.",
      "spellName": "Shackles",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 400 (TagTalent 525)",
        "Max Channel Time: 2.75\/3.5\/4.25\/5 (TagTalent 4.75\/5.5\/6.25\/7)",
        "Total Damage: 60\/160\/260\/360 (TagTalent 235\/335\/435\/535)",
        "Number of Serpent Wards: 4",
        "Wards Duration: 7",
        "Shackles creates Serpent Wards attacking the target. Increases Shackles cast range by 125. Lasts 7 seconds.",
        "Effect does not persist and immediately ends if debuff was placed before spell immunity.",
        "A self-defense incantation, Rhasta developed shackles after his master was slain in the Bleeding Hills."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "A self-defense incantation, Rhasta developed shackles after his master was slain in the Bleeding Hills."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Shadow_Shaman_Mass_Serpent_Ward.mp3\/revision\/latest?cb=20191216023109",
      "effects": [
        "Ability Target Point",
        "Damage Physical (TagAghanim Instant Attack)"
      ],
      "notes": [
        "Places a Serpent Ward on every 36°th of a 150 radius circle, resulting in 10 wards forming a ring The wards form a perfect barrier, so that enemies inside cannot move out, unless they have phased movement. Destroying one ward is enough to allow units to walk in and out of the ring of wards. The wards' facing angle is set equal to Shadow Shaman's facing angle upon cast.",
        "The wards form a perfect barrier, so that enemies inside cannot move out, unless they have phased movement.",
        "Destroying one ward is enough to allow units to walk in and out of the ring of wards.",
        "The wards' facing angle is set equal to Shadow Shaman's facing angle upon cast.",
        "Serpent Wards automatically attack enemies within their attack range, using ◉ Standard auto attack rules. It is possible to manually give the wards an attack target with A or Right Click an enemy in range. With Unified Orders with Ctrl, Ctrl+ Right Click an enemy in range will commands to all wards to attack the target. It is also possible to stop the wards from attacking with S (only works when the auto-attack option is ◎ Never).",
        "It is possible to manually give the wards an attack target with A or Right Click an enemy in range.",
        "With Unified Orders with Ctrl, Ctrl+ Right Click an enemy in range will commands to all wards to attack the target.",
        "It is also possible to stop the wards from attacking with S (only works when the auto-attack option is ◎ Never).",
        "Serpent Wards have a lower target priority than other units and heroes, so they are attacked by towers and creeps last.",
        "The serpent wards attack damage is not reduced by Damage Block.",
        "With Aghanim's Scepter, the wards perform instant attacks on enemy whenever they launch an attack projectile. This means the extra projectile is released at the same time together with the main attack. Therefore, it does not matter whether the primary attack misses or not, the extra projectile is still released. The extra projectile travels at the same speed as the primary projectile, and can be disjointed like regular attacks. These instant attacks do not proc any attack modifiers and on-hit effects normally. They do not have True Strike. However, they are affected by armor type and evasion. The extra attack does not target wards, invisible units, attack immune units, or units inside the Fog of War. They do target buildings. The secondary target is chosen randomly. There are no priorities.",
        "This means the extra projectile is released at the same time together with the main attack.",
        "Therefore, it does not matter whether the primary attack misses or not, the extra projectile is still released.",
        "The extra projectile travels at the same speed as the primary projectile, and can be disjointed like regular attacks.",
        "These instant attacks do not proc any attack modifiers and on-hit effects normally. They do not have True Strike.",
        "However, they are affected by armor type and evasion.",
        "The extra attack does not target wards, invisible units, attack immune units, or units inside the Fog of War. They do target buildings.",
        "The secondary target is chosen randomly. There are no priorities."
      ],
      "mana": "200\/350\/600",
      "hotKey": "R",
      "cooldown": "120",
      "description": "Summons 10 Serpent Wards to attack enemy units and structures. The Wards are immune to magic.",
      "spellName": "Mass Serpent Ward",
      "params": [
        "Cast Animation: 0.3+0.97",
        "Cast Range: 550",
        "Spawn Radius: 150",
        "Number of Serpent Wards: 10",
        "Attacks to Destroy: 2 (TagTalent 3)",
        "Wards Duration: 45",
        "Split Shot Search Radius: 875",
        "Bonus Attack Targets: 1",
        "Causes Serpent Wards to have split shot, attacking two units for full damage. Increases attack range of Serpent Wards.",
        "Snake charming was a big part of the Shadow Shaman's act; now Rhasta can empower the Snakes to do his bidding."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Snake charming was a big part of the Shadow Shaman's act; now Rhasta can empower the Snakes to do his bidding."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 23.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Rhasta, the Shadow Shaman, is a ranged intelligence hero mostly played as a pusher and disabler, wielding abilities that make pushing lanes more efficient. When his abilities are used in intelligent combos, he has one of the longest disables in game. He is also capable of disabling multiple enemy heroes, allowing him to initiate encounters as well. Though very supportive in nature, until the late game Rhasta is capable of killing lone enemy heroes with the use of his entire skill set; meaning he is more difficult to gank than most other supports. Playing Rhasta well requires good knowledge of target priority and timing; and some minor micromanagement. His peak is mid-game, but he can continue to wreak havoc on enemies all throughout the match.",
  "history": "Born in the Bleeding Hills, Rhasta was just a starving youngling when picked up by a travelling con-man. For two pins of copper, the old con-man would tell your fortune. For three, he'd castrate your pig, for five, he'd circumcise your sons. For a good meal, he'd don his shaman garb, read from his ancient books, and lay a curse upon your enemies. His strange new youngling, part hill troll, part…something else, worked as assistant and lent an air of the exotic to the con-man's trade. Always one step ahead of cheated customers, one town ahead of a pursuing patronage, the two trekked across the blighted lands until one day the con-man realized that the little youngling could actually do what he only pretended at. His ward had a gift—a gift that customers valued. And so the youngling Rhasta was thrust before the crowds, and the trade-name Shadow Shaman was born. The two continued from town to town, conjuring for money as Shadow Shaman's reputation grew. Eventually, the pair's duplicitous past caught up with them, and they were ambushed by a mob of swindled ex-clients. The con-man was slain, and for the first time, Rhasta used his powers for darkness, massacring the attackers. He buried his beloved master, and now uses his powers to destroy any who would seek to do him harm.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+25 Wards Attack Damage",
      "talentRight": "+370 Ether Shock Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+1 Serpent Wards Max HP",
      "talentRight": "+2s Shackles Duration"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-5s Hex Cooldown",
      "talentRight": "+75 Serpent Wards Attack Range"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+175 Health",
      "talentRight": "+140 Shackles Total Damage"
    }
  ]
}