{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Black_King_Bar.mp3\/revision\/latest?cb=20141214202232",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Прерывает заклинания при использовании (Прерываемые способности).",
        "При использовании предмета на героя накладывается развеивание и иммунитет к заклинаниям (на время действия). Для большей информации о иммунитете к заклинаниям с таблицей способностей, пробивающих его, посетите статью Иммунитет к заклинаниям.",
        "Для большей информации о иммунитете к заклинаниям с таблицей способностей, пробивающих его, посетите статью Иммунитет к заклинаниям.",
        "Во время действия Avatar герой не может получить эффекты от Ghost Scepter или от Ethereal Blade. Эти баффы будут сразу отменены.",
        "Модель героя увеличивается на 30% на время действия.",
        "Покупка нового Black King Bar не сбросит длительность до 10."
      ],
      "mana": null,
      "abilityName": "Avatar",
      "cooldown": "70",
      "description": "Дает невосприимчивость к заклинаниям и полное сопротивление магическому урону. Продолжительность уменьшается с каждым использованием. Некоторые способности могут проходить сквозь невосприимчивость к заклинаниям.",
      "params": [
        "Длительность: 10\/9\/8\/7\/6\/5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 200 здоровья, 1 регенерации здоровья и 34 урона от атаки.",
    "Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья и 24 урона от атаки.",
    "Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья и 24 урона от атаки."
  ],
  "cost": "4050",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Ogre Axe",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Black King Bar",
  "description": "Мощный посох, наделенный силой гигантов.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 к силе",
    "+24 к урону"
  ],
  "tips": null
}