{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Ghost_Scepter_Ghost_Form.mp3\/revision\/latest?cb=20191227195419",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца.",
        "Накладывает на владельца призрачную форму, обезоруживает его, даёт иммунитет к атакам и 100% сопротивление к физическому урону.",
        "Снижает общее сопротивление магии героев до -5%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления.",
        "Уменьшение сопротивления магии от Ghost Form не складывается с другими эффектами призрачной формы. Приоритет выше у той формы, что имеет более высокое значение.",
        "Имеет общую перезарядку с Ethereal Blade."
      ],
      "mana": null,
      "abilityName": "Ghost Form",
      "cooldown": "20",
      "description": "Придаёт владельцу бесплотную форму, в которой он полностью защищён от физического урона, но не может атаковать и получает на 40% больше магического урона. Действует 4 сек.",
      "params": [
        "Уменьшение сопротивления магии: 40%",
        "Длительность: 4"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_symbol)^Блокируется иммунитетом к заклинаниям\nМожно применять, имея иммунитет к заклинаниям\nОднако, эффект мгновенно исчезает при обнаружении иммунитета к заклинаниям."
      ],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 100 здоровья, 0,5 регенерации здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 регенерации маны и 5 урона от атаки.",
    "Для героев ловкости, даёт 100 здоровья, 0,5 регенерации здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 регенерации маны и 5 урона от атаки.",
    "Для героев интеллекта, даёт 100 здоровья, 0,5 регенерации здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 регенерации маны и 5 урона от атаки."
  ],
  "cost": "1500",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Разное",
  "name": "Ghost Scepter",
  "description": "Переносит сущность владельца в мир духов, защищая от физических атак.",
  "trivia": null,
  "upgradeIn": [
    "Ethereal Blade"
  ],
  "bonuses": [
    "+5 к силе",
    "+5 к ловкости",
    "+5 к интеллекту"
  ],
  "tips": [
    "Используйте Ghost Scepter после нападения вражеского керри-героя, заставив его потратить время на вас.",
    "Старайтесь следить за перезарядкой мощных вражеских способностей. Если вы знаете, что такая сильная способность, как Finger of Death, до сих пор не применялась, то лучше дважды подумать, стоит ли использовать Ghost Scepter."
  ]
}