{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/dd\/Revenant%27s_Brooch_Phantom_Province_1.mp3\/revision\/latest?cb=20220618225122",
      "effects": [
        "Number of Attacks: 5",
        "Duration: 15"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Consumes a charge upon performing an attack, regardless of outcome. For ranged heroes, this is on projectile launch.",
        "While active, the user can attack attack immune units normally. However, does not allow the user to bypass untargetability, meaning it does not work against Book of Shadows and Shadow Realm.",
        "However, does not allow the user to bypass untargetability, meaning it does not work against Book of Shadows and Shadow Realm.",
        "While active, the user's regular attacks deal magical damage, instead of physical. This includes all bonuses, except for the extra damage of mana break sources. Fully affects all other conditional attack damage bonuses (e.g. bash damage, Fury Swipes, Shadow Blade, etc.). Does not affect damage that is dealt in a separate instance. (e.g. Searing Arrows, Desolate etc.). Only affects physical attack damage, pure attack damage (e.g. Bloodrage) is not affected.",
        "Fully affects all other conditional attack damage bonuses (e.g. bash damage, Fury Swipes, Shadow Blade, etc.).",
        "Does not affect damage that is dealt in a separate instance. (e.g. Searing Arrows, Desolate etc.).",
        "Only affects physical attack damage, pure attack damage (e.g. Bloodrage) is not affected.",
        "Causes cleave and Psi Blades to deal no damage while active, regardless of whether the attack target takes damage or not. Also prevents lifesteal from healing the user while active. Does not prevent splash from dealing damage.",
        "Also prevents lifesteal from healing the user while active.",
        "Does not prevent splash from dealing damage.",
        "Fully works with instant attacks, with each individual instance taking a charge. This means abilities that perform multiple instances in a single cast drain a charge for each instance, not just one charge.",
        "This means abilities that perform multiple instances in a single cast drain a charge for each instance, not just one charge.",
        "If cast while not having the buff already, goes on a 0.25-second cooldown upon cast to prevent accidental usages. The 25-second cooldown only starts upon using up all attack charges or upon losing the buff. Can be cast again while already having the buff, to manually remove the buff and trigger the cooldown prematurely.",
        "The 25-second cooldown only starts upon using up all attack charges or upon losing the buff.",
        "Can be cast again while already having the buff, to manually remove the buff and trigger the cooldown prematurely.",
        "Only works while the item is in the inventory. Moving the item into the backpack causes the buff to no longer work, even after moving it back into the main inventory.",
        "Replaces the projectile particle of ranged heroes with a blue projectile."
      ],
      "mana": "300",
      "abilityName": "Phantom Province",
      "cooldown": "25\/0.25",
      "description": "Your next 5 attacks have True Strike and deal magic damage. Expires after 15 seconds. Can attack ethereal units and deals no damage to Magic Immune targets.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Revenant%27s_Brooch_Witch_Blade.mp3\/revision\/latest?cb=20220618225124",
      "effects": [
        "Intelligence as Damage per Second: 100%",
        "Move Speed Slow: 25%",
        "Duration: 4"
      ],
      "notes": [
        "Successive attacks with Witch Blade do not stack but refresh the duration instead.",
        "The attack first applies the debuff, then its own damage.",
        "Does not work against buildings, wards, or allied units.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 4 instances.",
        "Can deal up to 400% of intelligence as damage to the target (before reductions).",
        "Shares cooldown with Witch Blade. Witch Blade on Revenant's Brooch uses a custom cooldown system. It places a debuff on the user that prevents it from proccing again. This debuff's duration is affected by percentage-based cooldown reductions upon initially being placed. It is also not affected by cooldown reset sources or by flat cooldown reduction sources. This means it is possible for it to get de-synchronized with Witch Blade's cooldown. Losing the debuff in any way allows the item to immediately proc Witch Blade again.",
        "Witch Blade on Revenant's Brooch uses a custom cooldown system. It places a debuff on the user that prevents it from proccing again.",
        "This debuff's duration is affected by percentage-based cooldown reductions upon initially being placed.",
        "It is also not affected by cooldown reset sources or by flat cooldown reduction sources.",
        "This means it is possible for it to get de-synchronized with Witch Blade's cooldown.",
        "Losing the debuff in any way allows the item to immediately proc Witch Blade again."
      ],
      "mana": null,
      "abilityName": "Witch Blade",
      "cooldown": null,
      "description": "Causes your next attack to apply a poison for 4 seconds, slowing by 25% and dealing 1x your intelligence as damage every second. This attack has True Strike.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "540 mana and 2.25 mana regeneration.",
    "45 main attack damage to heroes."
  ],
  "cost": "6200",
  "lore": null,
  "consistFrom": [
    "Witch Blade",
    "Mystic Staff",
    "Recipe"
  ],
  "name": "Revenant's Brooch",
  "description": "The cursed brooch of a fallen guardian who stalks forever between the veil of life and death.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}