{"abilities":[{"spell":"Calls down a wave of meteors to damage nearby enemy units. The closest enemy unit to Mirana in a 425 radius will be struck a second time for 75% of the damage.","effects":["Ability No Target ( Passive)","Affects Enemies","Damage Magical"],"notes":["Meteors need 0.57 seconds to hit their targets.","Does not hit invisible, invulnerable or hidden units.","The initial wave does not hit units inside the Fog of War, but the secondary single meteor does.","The target for the second meteor is set upon cast of Starstorm, so it can hit its target even after it has moved out of the radius.","The second meteor starts falling exactly 0.8 second after cast, and also takes 0.57 seconds to hit its target.","Starstorm chooses a new target for the second meteor if the set target dies before or because of the first meteor's impact.","Can deal a total of 131.25\/262.5\/393.75\/525 damage to a single target (before reductions) with the second meteor hit.","When having Aghanim's Scepter, Starstorm is passively cast. This passive cast has a 8 second recharge time. These passive casts do not use cast time, do not interrupt Mirana in any way and do not cost mana or put the spell on cooldown. The passive cast only applies the initial wave (dealing the same damage as an active cast), and does not hit the closest enemy unit with a secondary meteor. When no enemies are within range or visible, the effect waits until an enemy is in range or is visible. Checks for valid targets in 1 second intervals. The time is adapted to the in-game clock, meaning it only happens on full seconds. Mirana receives the thinker modifier as soon as Starstorm is learned, but it does nothing until Scepter is acquired. Does not trigger while Mirana is invisible. It can trigger during fade times or fade delays, without breaking the invisibility. Just like a charge-based ability, the counter only starts counting once the effect procs. It has a charge limit of 1. A status buff icon shows whenever the effect is ready."],"mana":"80\/105\/130\/155","elements":["Cannot be disjointed.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"12","name":"Starstorm","description":["Cast Animation: 0.4+0","Main Radius: 650","Secondary Radius: 425","Main Damage: 75\/150\/225\/300","Secondary Damage: 56.25\/112.5\/168.75\/225","Passive Charge Time: 0 ( 8)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Fires a long-range arrow with deadly precision, which stuns and damages the first enemy unit it strikes. The stun duration ranges from 0.01 to 5 seconds, with bonus damage up to 140 added, based on the distance the arrow travels to its target. Instantly kills the first non-ancient creep it hits.","effects":["Ability Target Point","Affects Enemies","Damage Magical (HP Removal)"],"notes":["The Sacred Arrow travels at a speed of 950.","The arrow starts traveling 51 range in front of Mirana, and travels forward up to 3067 range. This means units within 50 range in front of Mirana cannot be hit, as it does not search for units right behind the arrow.","Can hit units up to 3163 range away (travel distance + radius).","The stun increases by 0.1 seconds and the damage by 2.8 for each 30 distance traveled, resulting in the following values at certain distances (before reductions): 300 Distance: 1 second stun, 28 (108\/188\/268\/348) damage 600 Distance: 2 seconds stun, 56 (136\/216\/296\/376) damage 900 Distance: 3 seconds stun, 84 (164\/244\/324\/404) damage 1200 Distance: 4 seconds stun, 112 (192\/272\/352\/432) damage 1500 Distance: 5 seconds stun, 140 (220\/300\/380\/460) damage The arrow reaches its full potential after traveling for 1500 distance, which takes 1.75 seconds.","The arrow first applies the damage, then the debuff.","The stun duration is shown above the target's head upon hit (visible to allies only). The shown value is rounded.","If the arrow collides with a unit which is not a hero, ancient creep, or creep-hero, it instantly kills it. The creep is killed by getting its health dealt as damage to it, in the form of HP Removal. Spell immune creeps are not killed.","The arrow cannot collide with invulnerable or hidden units, it simply flies through them.","The Sacred Arrow has 500 flying vision, which stays for 3 seconds at the point the arrow hits a target.","When choosing the talent which adds extra arrows, the extra arrows are launched together with the main arrow. The extra arrows are launched with a 30 degree angle to the left and right of the centered arrow. Although all three arrows overlap in front of Mirana, they cannot hit the same target."],"mana":"100","elements":["Partially pierces spell immunity."],"cooldown":"18\/17\/16\/15 ( 13\/12\/11\/10)","name":"Sacred Arrow","description":["Cast Animation: 0.5+0","Cast Range: 3000","Max Travel Distance: 3067","Arrow Collision Radius: 96","Number of Arrows: 1 ( 3)","Base Damage: 80\/160\/240\/320","Maximum Bonus Damage: 140","Min Stun Duration: 0.01","Max Stun Duration: 5"],"hot_key":"W","legacy_key":"R"},{"spell":"Mirana leaps forward into battle, empowering herself with a ferocious roar that grants bonus attack and movement speed. Speed bonus lasts 2.5 seconds.","effects":["Ability No Target","Affects Self"],"notes":["Mirana gets all 3 charges immediately upon learning Leap.","Leap interrupts Mirana's channeling spells upon cast.","Leaps at a speed of 1300 for up to 0.42 seconds.","Always leaps towards the direction Mirana is facing. Locks Mirana's facing angle during the leap.","Can leap over other units and over impassable terrain.","During Leap, Mirana can attack, cast spells, and use items. However, she cannot turn, so targeted spells and items may only be used in the direction she is facing.","The bonus movement and attack speed is applied instantly upon cast, and not upon landing.","The buff from multiple casts does not stack, only its duration gets refreshed.","Leap cannot be cast during Leap. During the leap, Leap is on an unrefreshable cooldown which is bound to the leap buff."],"mana":"40","elements":["Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"0","name":"Leap","description":["Cast Animation: 0+0","Leap Distance: 550","Move Speed Bonus: 8%\/16%\/24%\/32%","Attack Speed Bonus: 60\/80\/100\/120 ( 140\/160\/180\/200)","Speed Duration: 2.5","Number of Charges: 3","Charge Replenish Time: 45\/40\/35\/30"],"hot_key":"E","legacy_key":"E"},{"spell":"Turns Mirana and all allied heroes invisible and grants bonus movment speed. If a hero is revealed, invisibility will restore after the fade delay as long as Moonlight Shadow's duration has not expired.","effects":["Ability No Target","Affects Allies"],"notes":["Places a buff on all allied heroes. As long as this buff stays on them, they keep on turning invisible.","The movement speed bonus is only applied when fully invisible. It is not applied during the fade delay.","Fully affects invulnerable and hidden allies, placing the buff on them and turning them invisible.","Attacking, casting spells or using items during the fade delay resets it."],"mana":"75","elements":["Cannot be used by illusions.","Pierces spell immunity."],"cooldown":"140\/120\/100 ( 70\/50\/30)","name":"Moonlight Shadow","description":["Cast Animation: 0.5+0","Radius: Global","Fade Delay: 2.5\/2\/1.5","Movement Speed Bonus: 15%","Duration: 18"],"hot_key":"R","legacy_key":"W"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["Grants Mirana's attacks Mana Break, causing her attacks to burn the target's mana and deal damage based on the burned mana.","The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.","Effectively increases Mirana's attack damage by 20 against units which have enough mana to burn. Effectively increases the attack damage of Mirana's illusions by 8 against units which have enough mana to burn.","Applies the mana loss first, and then the damage.","Does not work against allied units when attacking them.","Fully stacks with other sources of Mana Break."],"mana":"0","elements":["Can be used by illusions.","Not disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Mana Break","description":["Mana Burned per Hit: 25","Illusion Mana Burned per Hit: 10","Burned Mana as Damage: 80%"]}],"bio":"Born to a royal family, a blood princess next in line for the Solar Throne, Mirana willingly surrendered any claim to mundane land or titles when she dedicated herself completely to the service of Selemene, Goddess of the Moon. Known ever since as Princess of the Moon, Mirana prowls the sacred Nightsilver Woods searching for any who would dare poach the sacred luminous lotus from the silvery pools of the Goddess's preserve. Riding on her enormous feline familiar, she is poised, proud and fearless, attuned to the phases of the moon and the wheeling of the greater constellations. Her bow, tipped with sharp shards of lunar ore, draws on the moon's power to charge its arrows of light.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["In the transition from DotA to Dota 2, various aspects of Mirana's character have been changed to avoid reference to Blizzard's intellectual property. The names of two of Mirana's abilities were changed; Starstorm was previously called Starfall and Sacred Arrow was called Elune's Arrow. Her DotA hero title was \"Priestess of the Moon\", a class within the Warcraft universe. Her title was changed during the beta to her current, Princess of the Moon. However, her voice lines remained unchanged, referring to herself still as the Priestess.","In addition to the above changes, Mirana's surname - \"Nightshade\" - was also dropped, so that she is known simply as \"Mirana\".","Mirana is the tiger of the Multan Fort that killed the king of Mongols (in the Mongol folklore).","Her mount's name is Sagan. Her response \"Carl meet Sagan.\" is a pun on Carl Sagan.","She appears to be wearing the Circlet item, which fits the item description as being \"designed for human princesses\"."],"talents":["-70 Moonlight Shadow Cooldown:+2 Multishot Sacred Arrows","+25 Mana Break:+12% Spell Amplification","+80 Leap Attack Speed:-5s Sacred Arrow cooldown","+200 Health:+15 Damage"],"desc":"Mirana, the Princess of the Moon, is a ranged agility hero that uses her abilities to surprise, chase, and assault enemies. She is an excellent huntress and widely known for her Sacred Arrow which stuns her victim with deadly precision. The arrow stuns longer when it's fired from a farther distance. Mirana can bring down the stars with Starstorm to damage nearby enemies and an additional star to cast down on her one unfortunate target. Mounting with her trusted tiger Sagan, Mirana can Leap forward over a distance, to escape or chase, and enhance her with a roar, increasing her attack and movement speed. Invoking the power of her moon goddess, Mirana uses her ultimate, Moonlight Shadow to cloak all allied heroes and herself with invisibility. At any time, Mirana and her allies can break out of their hiding with an ambush and fade into the shadows again during the duration of the spell. With an array of mighty and supportive abilities, Mirana is a versatile heroine that can excel early in the game as a mobile ganker. She is not very heavily reliant on luxury items but she can benefit from almost any item that gives her presence in the battlefield."}