{
  "abilities": [
    {
      "spell": "Призывает звёздный дождь, наносящий урон противникам, стоящим неподалеку. Ближайший враг в радиусе 425 получит второй удар, наносящий 75% от обычного урона.",
      "effects": [
        "Способность Ненаправленная ( Пассивная)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Метеору нужно 0,57 секунд, чтобы поразить цели.",
        "Не наносит урона невидимым, неуязвимым или спрятанным врагам.",
        "Начальная волна не поражает юнитов в тумане войны, но вторичный заряд это делает.",
        "Цель для второго заряда выбирается при использовании Starstorm, поэтому он может поразить свою цель, даже если она покинула радиус действия.",
        "Второй заряд начинает падать спустя 0,8 секунд после использования способности, и ему нужно ещё 0,57 секунд, чтобы поразить свою цель.",
        "Starstorm выбирает новую цель для второй атаки, если выбранная цель до этого умерла от самой способности или от чего-либо ещё.",
        "Может нанести до 131.25\/262.5\/393.75\/525 единиц урона в одиночную цель (до учета сопротивления) вместе с попаданием второго заряда.",
        "С Aghanim's Scepter Starstorm начинает применяться пассивно. У применения есть 10 секунд перезарядки. Это пассивное применение не использует время применения, не прерывает действия Mirana, не тратит ману и не запускает перезарядку способности. Пассивное применение использует только начальную волну (нанося тот же урон, что и активное применение) и не поражает ближайшего юнита как вторичную цель. Если в радиусе действия или обзора нет врагов, то эффект не сработает, пока враг не окажется поблизости. Проверяет наличие подходящих целей с интервалом в 1 секунду. Время адаптируется под внутригровое время, поэтому способность срабатывает только при достижении полных секунд. Mirana получает модификатор \"Готовность Starstorm\" как только изучит Starstorm, но модификатор неактивен до получения Aghanim's Scepter. Не срабатывает, если Mirana невидима. Способность может сработать при задержке невидимости или уходе в невидимость без выхода из неё. Как и остальные способности, основанные на зарядах, счетчик меняется только при срабатывании эффекта. У способности лимит зарядов равен 1. Иконка в статус-баре показывает, когда эффект будет готов."
      ],
      "mana": "80\/105\/130\/155",
      "elements": [
        "Нельзя избежать.",
        "Отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "12",
      "name": "Starstorm",
      "description": [
        "Анимация применения: 0,5+0",
        "Радиус: 650",
        "Вторичный радиус: 425",
        "Урон: 75\/150\/225\/300",
        "Вторичный урон: 56.25\/112.5\/168.75\/225",
        "Время восстановления заряда: 0 ( 10)"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Выпускает невероятно точную стрелу, оглушающую первое существо на своем пути и наносящую ему урон. Преодолённое стрелой расстояние увеличивает её урон, который может достичь 140, и длительность оглушения, которое составляет от 0,01 секунды до 5. Мгновенно убивает любого крипа, если он не древний.",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический (Отнимающий здоровье)"
      ],
      "notes": [
        "Стрела летит со скоростью в 857 единиц.",
        "Стрела начинает путь на расстоянии в 51 единицу от Mirana и летит до достижения расстояния в 3067 единиц. То есть юниты в пределах 50 единиц от Mirana не могут быть поражены, поскольку стрела не задевает юнитов, находящихся за ней.",
        "Может поражать юнитов на расстоянии до 3163 единиц (складывается из дальности полета и радиуса столкновения).",
        "Каждые 30 единиц расстояния, пройденные стрелой, прибавляют к длительности оглушения 0,1 секунд и 2,8 единиц урона; ниже указаны значения при прохождении определенного расстояния (до учета сопротивления): Дистанция в 300 единиц: 1 секунда оглушения, 28 (78\/168\/258\/348) единиц урона Дистанция в 600 единиц: 2 секунды оглушения, 56 106\/196\/286\/376) единиц урона Дистанция в 900 единиц: 3 секунды оглушения, 84 (134\/224\/314\/404) единиц урона Дистанция в 1200 единиц: 4 секунды оглушения, 112 (162\/252\/342\/432) единиц урона Дистанция в 1500 единиц: 5 секунд оглушения, 140 (190\/280\/370\/460) единиц урона Стрела выдает свой полный потенциал после преодоления расстояния в 1500 единиц, для чего требуется 1,75 секунды.",
        "При попадании длительность оглушения отображается над головой цели (видна только союзникам). Это значение округлено.",
        "Если стрела сталкивается с юнитом, который не является героем, древним крипом или крипом-героем, то мгновенно убивает его. Крип умирает от получения урона, равного значению его здоровья в виде урона, отнимающего здоровья. Крипы с иммунитетом к магии от способности не умирают.",
        "Стрела не может столкнутся с неуязвимыми или спрятанными юнитами, поэтому просто пролетает сквозь них.",
        "Стрела дает летающий обзор в радиусе 500 единиц, который остается на 3 секунды после достижения стрелой цели.",
        "При выборе таланта на дополнительные стрелы, они запускаются вместе с основной стрелой. Дополнительные стрелы выпускаются под углом в 30 градусов от основной стрелы влево и вправо. Хоть все три стрелы запускаются перед Mirana, они не могут поразить одну и ту же цель."
      ],
      "mana": "100",
      "elements": [
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "17 ( 12)",
      "name": "Sacred Arrow",
      "description": [
        "Анимация применения: 0,5+0",
        "Дальность применения: 3000",
        "Макс. дальность полета: 3067",
        "Радиус столкновения стрелы: 96",
        "Количество стрел: 1 ( 3)",
        "Базовый урон: 50\/140\/230\/320",
        "Максимальный дополнительный урон: 140",
        "Минимальное оглушение: 0,01",
        "Максимальное оглушение: 5"
      ],
      "hot_key": "W",
      "legacy_key": "R"
    },
    {
      "spell": "Герой врывается в битву, воодушевляясь свирепым рыком своего питомца, что даёт ему дополнительную скорость атаки и передвижения на 2.5 сек.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При изучении Leap Mirana сразу получает все 3 заряда.",
        "При использовании Leap прерывает произносимые способности Mirana.",
        "Герой прыгает со скоростью в 1300 единиц за 0.42 секунды.",
        "Прыжок всегда совершается в том направлении, куда смотрит Mirana. Направление взгляда фиксируется при прыжке.",
        "Может перепрыгивать через юнитов и запрыгивать на непроходимую территорию.",
        "Во время действия Leap Mirana может атаковать, использовать заклинания и предметы. Но при этом герой не может разворачиваться, поэтому направленные заклинания и предметы можно использовать только в том направлении, куда она смотрит.",
        "Дополнительная скорость передвижения и атаки дается сразу же после применения, а не в момент приземления.",
        "Баффы от нескольких применений не складываются, но обновляют длительность.",
        "Leap нельзя применить, пока герой находится в прыжке от него. Пока действует Leap, способность обладает несбрасываемой перезарядкой, которая связана с модификатором \"Leap\"."
      ],
      "mana": "40",
      "elements": [
        "Нельзя применять в оцепенении.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Leap",
      "description": [
        "Анимация применения: 0+0",
        "Дистанция прыжка: 550",
        "Доп. скорость передвижения: 8%\/16%\/24%\/32%",
        "Доп. скорость атаки: 60\/80\/100\/120 ( 140\/160\/180\/200)",
        "Длительность доп. скорости: 2.5",
        "Количество зарядов: 3",
        "Время восстановления заряда: 60\/50\/40\/30"
      ],
      "hot_key": "E",
      "legacy_key": "E"
    },
    {
      "spell": "Делает владельца способности и его союзных героев невидимыми. Если раскрыть невидимость, то после задержки она восстановится, если способность ещё действует.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Размещает бафф на всех союзных героев. Всё время, сколько бафф будет находится на героях, они будут оставаться невидимыми.",
        "Полностью работает на неуязвимых и спрятанных союзников, размещая на них бафф и делая их невидимыми.",
        "Атака, использование способностей или предметов в момент задержки невидимости сбросит отсчет."
      ],
      "mana": "75",
      "elements": [
        "Не может использоваться иллюзиями.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "140\/120\/100 ( 70\/50\/30)",
      "name": "Moonlight Shadow",
      "description": [
        "Анимация применения: 0,5+0",
        "Дальность: Глобальная",
        "Время до невидимости: 2,5\/2\/1,5",
        "Доп. скорость передвижения: 15%",
        "Длительность: 18"
      ],
      "hot_key": "R",
      "legacy_key": "W"
    },
    {
      "spell": "Для этой способности нет описания.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Добавляет к атакам Mirana эффект сжигания маны, позволяя её атакам выжигать ману цели и наносить урон, основанный на сожженой мане.",
        "Mirana может получать лечение от вампиризма с урона, наносимого Сожжение маны, но этот урон не может быть критическим.",
        "Урон можно снизить с помощью Enfeeble или Static Link. При этом его нельзя увеличить с помощью Empower или Руна двойного урона.",
        "В среднем усиливает урон Mirana на 20, если у юнита достаточно маны для выжигания. В среднем усиливает урон иллюзий Mirana на 8, если у юнита достаточно маны для выжигания.",
        "Сначала выжигает ману, затем наносит урон.",
        "Не работает при атаке союзных юнитов.",
        "Полностью сочетается с другими источниками сожжения маны."
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Не отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Сожжение маны",
      "description": [
        "Сжигает маны за удар: 25",
        "Иллюзии сжигают маны за удар: 10",
        "Урон от сожженной маны: 80%"
      ]
    }
  ],
  "bio": "Mirana, наследница королевской династии, которой было суждено занять Лучезарный Трон, с легкостью отреклась от всех своих привилегий в пользу службы Селемине, богине Луны. С тех пор прослывшая Принцессой Луны, Mirana ревностно охраняет священные Серебристые Леса от любого, кто решится сорвать цветок священного лучистого лотоса, растущего в серебряных запрудах заповедника богини. Разъезжая на огромном звере из рода благородных кошек, она с гордостью и отвагой несет службу, живя в гармонии с лунными фазами и движением великих созвездий. Ее лук, древко которого укреплено накладкой, выкованной из лунной породы, наделяет стрелы особой силой, наполняя их лучистым светом.",
  "talentsTips": [
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
  ],
  "trivia": [
    "\"Мирана\" - тигр Мултана, который убил Монгольского Хана (в Монгольском фольклоре)",
    "Имя тигра - Sagan, что является отсылкой к Карлу Сагану.",
    "В переходе из DotA в Dota 2, два названия способностей были переименованы. Starstorm назывался Starfall и Elune's Arrow теперь называется Sacred Arrow. В добавок, Mirana теперь Принцесса Луны, однако в оригинале была Жрицей. В репликах героя, при использовании Starstorm, Mirana по-прежнему произносит \"Starfall\".",
    "Имя героя в оригинальном Warcraft - Тиренд.",
    "Мирана имела шутливое\/альтернативное имя в русской версии DotA, отражающее механику её способности Sacred Arrow - 'Не стой под стрелой' фраза, которую пишут на стрелах грузоподъёмных кранов.",
    "Мирана - Белая Королева в фильме \"Алиса в Стране Чудес\" режисёра Тима Бёртона."
  ],
  "talents": [
    "-70 сек. перезарядки Moonlight Shadow:Sacred Arrow выпускает сразу три стрелы",
    "+25 к сожжению маны:+12% к урону от способностей",
    "+80 скорости атаки от Leap:-5 сек. перезарядки Sacred Arrow",
    "+200 к здоровью:+15 к урону"
  ],
  "tips": [
    "При использовании Starstorm, способность будет выбирать новую цель для второй звезды, если первичная цель погибла.",
    "Moonlight Shadow отлично подходит как и для отступления команды, так и на неожиданных атаках. Невидимость героя и союзников спадет при атаке или при окончании действия способности. Противники также могут увидеть вас и союзников, при наличии у них предметов, раскрывающих невидимость (например, Sentry Ward или Gem of True Sight и т.п.).",
    "Leap будет давать вам и вашим союзникам бонусы к скорости атаки и скорости передвижения. Стоит использовать эту способность в бою, однако, эта способность единственная для героя, предназначенная для ее спасения, если противникам удалось выиграть в битве. Также помните, что бонусы от этой способности будут даваться только в месте старта прыжка, а не по его окончанию.",
    "Sacred Arrow не действует на союзных юнитах и может проходить сквозь их. Однако, вражеские и нейтральные крипы, Рошан также может быть целью для стрелы. Есть также множество командных применений для способности. Например, герой Bane может использовать на противнике свою способность Nightmare, чтобы погрузить врага в сон. Противник, под действием этой способности, будет стоять на месте, что позволит Mirana бросить стрелу из далека, чтобы дать максимально-возможное время оглушения (макс. время составляет 5 секунд)."
  ],
  "desc": "Mirana — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Starstorm, призывает метеоритный дождь, наносящий урон противникам, стоящим неподалеку. Ближайший враг получит второй удар, наносящий 75% от обычного урона. Вторая способность, Sacred Arrow, выпускает стрелу, которая оглушает первого юнита на своем пути и наносит ему урон. Длительность оглушения увеличивается прямо пропорционально дистанции до цели, начиная с 0.01 и заканчивая 5 секундами, а дополнительный урон достигает 140 единиц и также зависит от дистанции до цели. Третья способность, Leap, позволяет Mirana совершить прыжок на своем тигре, воодушевляя союзников свирепым криком, что дает им дополнительную скорость атаки и передвижения. Ультимативная способность, Moonlight Shadow, делает Mirana и всех дружественных героев невидимыми."
}