{
  "abilities": [
    {
      "notes": [
        "Скорость полета кинжала — 1200",
        "При попадании в цель кинжал заставляет Phantom Assassin совершить мгновенную атаку по ней\n Поскольку это обычная атака, то кинжал может сработать любой модификатор атаки и эффекты, срабатывающие при ударе, за исключением <span image=\"images\/jinada.webp\">[picture:jinada]<\/span> Jinada и <span image=\"images\/tidebringer.webp\">[picture:tidebringer]<\/span> Tidebringer\n Урон от Tidebringer будет учтен, но рассекающий удар от него не сработает\n При этом у мгновенной атаки нет анимации атаки, поэтому способности, которые срабатывают из-за замаха атаки (например, <span image=\"images\/untouchable.webp\">[picture:untouchable]<\/span> Untouchable), не активируются\n Эффекты рассечения зависят от местоположения цели, нанося урон по трапецевидной области в противоположном направлении от места, откуда был отправлен кинжал\n Может показаться, что кинжал считается за дальнюю атаку, но она продолжает считаться ближней атакой, если исходит от Phantom Assassin\n То есть, все способности, у которых есть различия между дальним и ближним типом атаки, использую эффекты или значения ближней атаки\n Совершенная мгновенная атака имеет эффект True Strike, поэтому она не может промахнуться\n При избежании кинжала атака не совершается\n Мгновенная атака игнорирует обезоруживание",
        "Сначала кинжал берет процент от общего урона Phantom Assassin, затем добавляет 25%\/40%\/55%\/70% единиц дополнительного урона\n Урон можно выразить в формуле: 65 + 25%\/40%\/55%\/70% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 45%\/60%\/75%\/90%) * (базовый урон от атаки + бонусы\/уменьшения урона от атаки) \"Бонусы\/уменьшения урона от атаки\" включают в себя все возможные шансы нанести дополнительный урон, включая временные (оглушающий удар) и условные (Quell)\n Урон в 25%\/40%\/55%\/70% единиц также считается дополнительным уроном, но он добавляется уже после расчета основного урона от способности\n Модификаторы атаки, которые рассчитываются от урона (критический удар, вампиризм, рассекающий удар) также учитывают 25%\/40%\/55%\/70% единиц дополнительного урона\n Урон добавляется к урону Phantom Assassin с помощью баффа, который длится 0,03 сек\n Поскольку урон от способности наносится обычной атакой, то он не относится к урону от заклинаний, но считается за урон от атаки\n То есть на способность распространяется блокировка урона, но не действует усиление урона от способности и вампиризм заклинаний",
        "Кинжал сначала наносит урон, затем применяет дебафф",
        "Снаряд имеет летающий обзор в радиусе 450 единиц\n При успешном попадании обзор задерживается на 3,34 сек\n в месте пребывания цели",
        "Нельзя применить на курьеров",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ При выборе таланта 25-го уровня способность запускает 2 дополнительных снаряда в случайные видимые подходящие цели в радиусе применения\n Радиус поиска зависит от дальности применения плюс дополнительное расстояние, в итоге выбирая цели на расстоянии до 850\/1050\/1250\/1450 единиц\n Не может отметить основную цель дополнительными кинжалами, поэтому, если поблизости нет других целей, ничего не произойдет\n Вторичные цели выбираются случайно в области без каких-либо приоритетов\n Снаряды не могут выбрать одну и ту же цель\n Поскольку дополнительные кинжалы используют дальность применения заклинания, то эффекты увеличения дальности действия также увеличивают их дальность"
      ],
      "item_behaviour": [],
      "description": "Бросает кинжал, который замедляет скорость передвижения врага, наносит ему физический урон в размере 65 + 25%\/40%\/55%\/70% урона от атаки героя, а также накладывает эффекты предметов и способностей.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 550\/750\/950\/1150",
        "Число целей: 1 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3)",
        "Базовый урон: 65",
        "Урон от атаки: 25%\/40%\/55%\/70% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 45%\/60%\/75%\/90%)",
        "Замедление передвижения: 50%",
        "Длительность замедления: 2,2\/2,8\/3,4\/4",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Доп\n расстояние для поиска вторичной цели:  300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Phantom_Assassin_Stifling_Dagger_1.mp3\/revision\/latest?cb=20191216021615",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Мгновенная атака"
      ],
      "mana": "6 (TagTalent 4)",
      "aghanim": null,
      "name": "Stifling Dagger",
      "cooldown": "30",
      "legacy_key": "D",
      "story": "Первый навык, изученный Сёстрами вуали, часто предвещает скорый удар."
    },
    {
      "notes": [
        "<span image=\"images\/phantom_strike.webp\">[picture:phantom_strike]<\/span> Phantom Strike можно применить на союзных существ, при этом не получая дополнительных бонусов",
        "Перемещает Phantom Assassin к цели по направлению к месту, в котором цель была при использовании заклинания\n <span image=\"images\/counterspell.webp\">[picture:counterspell]<\/span> Counterspell не отражает Phantom Strike, но всё равно блокирует её\n Не позволяет избежать снаряды при телепортации",
        "Phantom Assassin получает приказ атаковать цель, автоматически отменяя остаточную анимацию",
        "Сочетается аддитивно с другими источниками вампиризма",
        "Нельзя использовать на курьеров"
      ],
      "item_behaviour": [],
      "description": "Герой телепортируется к выбранному существу и, если это противник, получает дополнительные скорость атаки и вампиризм.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,25+0,8",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1000 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 1250)",
        "Доп\n скорость атаки: 80\/110\/140\/170 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 140\/170\/200\/230)",
        "Вампиризм: 10%\/15%\/20%\/25%",
        "Длительность: 2 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2,5)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Phantom_Assassin_Phantom_Strike.mp3\/revision\/latest?cb=20191216021614",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Себя"
      ],
      "mana": "11\/9\/7\/5",
      "aghanim": null,
      "name": "Phantom Strike",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "B",
      "story": "Шёлковая вуаль Мортред — это последнее, что увидит её несчастный противник."
    },
    {
      "notes": [
        "При применении прерывает произносимые заклинания Phantom Assassin",
        "Применяет к Phantom Assassin невидимость с иммунитетом к эффекту раскрытия невидимости\n Только <span image=\"images\/chronosphere.webp\">[picture:chronosphere]<\/span> Chronosphere может выявить героя",
        "Атаки или применение заклинаний не выводят из невидимости",
        "Эффект развеивается, если заклинатель оказался на расстоянии 600 от вражеского героя (включая клонов, но исключая иллюзии) или вражеского постройки\n Эффект не развеивается мгновенно, а спадает спустя 0,5 сек\n после обнаружения\n Покидание области во время задержки не отменит развеивание эффекта",
        "Эффект также развеивается при атаке <span image=\"images\/roshan.png\">[picture:roshan]<\/span> Рошана, но не мгновеннно, а после задержки",
        "Уклонение и активная часть способности не связаны друг с другом\n Уклонение всегда будет активно",
        "В среднем, Blur увеличивает выживаемость против физических атак на 25%\/43%\/67%\/100% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 82%\/122%\/186%\/300%)",
        "При улучшении при использовании применяет к Phantom Assassin базовое развеивание\n Сброс перезарядки происходит независимо от того, чем именно был убит герой\n Он сбрасывает перезарядку всех основных способностей героя\n Сброс связан с Blur\n Если способность не изучена, то убийства не сбросят перезарядку\n В режиме Ability Draft сброс перезарядки действует на все способности, кроме ультимативных"
      ],
      "item_behaviour": [],
      "description": "Герой сосредотачивается на себе, что позволяет ему уклоняться от атак. Применение способности размоет очертания владельца, делая его невидимым, если рядом нет вражеских героев.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0,57 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0+0)",
        "Пассивное уклонение: 20%\/30%\/40%\/50% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 45%\/55%\/65%\/75%)",
        "Радиус развеивания невидимости: 600",
        "Задержка перед исчезновением: 0",
        "Задержка перед появлением: 0,5 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 0,75)",
        "Длительность: 25"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Phantom_Assassin_Blur_1.mp3\/revision\/latest?cb=20191216021620",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "60\/55\/50\/45 (TagTalent 10)",
      "aghanim": null,
      "name": "Blur",
      "cooldown": "50",
      "legacy_key": "R",
      "story": "Медитация позволяет Сёстрам вуали опережать противников в бою."
    },
    {
      "notes": [
        "Требует <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard для разблокировки",
        "Применяет истощение при нанесении урона противникам, сперва применяется истощение — затем наносится урон",
        "Выпущенные кинжалы имеют только визуальное назначение\n Эффект способности поражает всех врагов, находящихся в зоне действия способности вне зависимости от количества кинжалов",
        "Кинжалы летят со скоростью 1000, им потребуется 0,55 секунды, чтобы долететь до максимальной дистанции\n Центром способности является место, где она была применена\n Зона действия не передвигается вместе с персонажем",
        "Зона поражения — не кольцо, а увеличивающаяся в размере окружность\n Все враги, попавшие в неё, будут задеты эффектом способности\n Это означает, что невозможно увернуться от способности при помощи телепортации к центру её действия, попытавшись увернуться от летящих кинжалов"
      ],
      "item_behaviour": [],
      "description": "Выпускает острые кинжалы в радиусе 550. Они наносят врагам урон в размере 16% от их максимального здоровья и накладывают истощение на 3 секунды.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,15+0,9",
        "Радиус: 550",
        "Максимального здоровья цели в урон: 16%",
        "Длительность дебаффа: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Phantom_Assassin_Fan_of_Knives_1.mp3\/revision\/latest?cb=20210102190424",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Fan of Knives",
      "cooldown": "50",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "В среднем увеличивает урон от атак на 15%\/33,75%\/52,5% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 22%\/49,5%\/77%)",
        "Шанс срабатывания сочетается с другими источниками критического урона\n Если одновременно срабатывают два источника критического удара, используется более высокий множитель",
        "Coup de Grace использует псевдослучайное распределение",
        "Часть визуальных эффектов (белое свечение на её оружии) воспроизводится во время начала атаки, показывая, что она будет критической"
      ],
      "item_behaviour": [],
      "description": "Герой оттачивает свои боевые способности, получая шанс совершить сокрушительную критическую атаку по врагу. Способность Stifling Dagger получает такой же шанс.",
      "hot_key": "R",
      "params": [
        "Шанс срабатывания: 15% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 22%)",
        "Критический урон: 200%\/325%\/450%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/93\/Phantom_Assassin_Coup_de_Grace_1.mp3\/revision\/latest?cb=20191216021612",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Coup de Grace",
      "cooldown": null,
      "legacy_key": "C",
      "story": "Погибнуть от судьбоносного удара Мортред — честь для её врагов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 19.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 3.2,
    "attrAgility": 23.0
  },
  "description": "Прыгает к врагом и наносит им критические удары Phantom Assassin идёт в наступление, едва завидев свою жертву. Предварительно атаковав противника кинжалом, а затем мгновенно сблизившись с ним, Мортред легко уклоняется от атак и обрушивает на врага удар за ударом, любой из которых может оказаться роковым.  Керри Побег ★☆☆",
  "history": "Сёстры Вуали, считающие убийство священной частью естественного цикла жизни, находят новых воспитанников в гаданиях. О своих жертвах сёстры узнают в медитации и пророческих изречениях. Они не принимают контрактов, и, похоже, не преследуют жертв из-за политики или корысти. Их убийства не выглядят частью какого-то замысла, и могут показаться не связанными между собой: сегодня жертвой станет человек с великой властью, завтра — крестьянин или копатель колодцев. Какой бы между убийствами ни было связи, её знают лишь сёстры. Они считают убитых жертвенным даром, а смерть от рук ордена — большой честью. Не ведающие своей личности, взращённые лишь на устоях ордена, убийцы легко заменяют друг друга, и число их неведомо. Возможно, их много; возможно, их единицы. Что лежит под вуалью — тайна без ответа. И лишь изредка эта сестра, когда никто не слышит, поднимает свою вуаль, чтобы нарушить запрет, прошептав своё имя: Мортред."
}