{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+125 Smoke Screen AoE",
          "talentRight": "-4 Tricks of the Trade Cooldown"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+475 Blink Strike Cast Range",
          "talentRight": "+0.5 Backstab Multiplier"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-4s Smoke Screen Cooldown",
          "talentRight": "+20 Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Attack Speed",
          "talentRight": "+6 Health Regen"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Riki_Smoke_Screen.mp3\/revision\/latest?cb=20191216022340",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "All effects of Smoke Screen are provided by an aura. Its debuff lingers for 0.5 seconds.",
        "Although the debuff lingers, its effects instantly stop if the target turns invulnerable.",
        "Smoke Screen can be cast during Tricks of the Trade without interrupting it, as long as the targeted point is within cast range. This means during Tricks of the Trade, Smoke Screen has a cast point and backswing of 0 and does not require facing the targeted point to be cast. The channeling itself does get interrupted, but the ability continues with its effects. In this state, shift-queueing orders causes it to get completely canceled.",
        "This means during Tricks of the Trade, Smoke Screen has a cast point and backswing of 0 and does not require facing the targeted point to be cast.",
        "The channeling itself does get interrupted, but the ability continues with its effects.",
        "In this state, shift-queueing orders causes it to get completely canceled.",
        "Smoke Screen's blind uses pseudo-random distribution."
      ],
      "mana": "75",
      "hotKey": "Q",
      "cooldown": "20\/17\/14\/11 (TagTalent 16\/13\/10\/7)",
      "description": "Throws down a smoke bomb, silencing enemies, and causing them to miss attacks.",
      "spellName": "Smoke Screen",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: 550",
        "Effect Radius: 300\/325\/350\/375 (TagTalent 425\/450\/475\/500)",
        "Miss Chance: 20%\/35%\/50%\/65%",
        "Aura Linger Duration: 0.5",
        "Duration: 6",
        "Although the debuff lingers, it does nothing when the target turns spell immune."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Since his escape during the night of his betrayal, Riki has valued the use of a simple smoke screen to confuse his opponents."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Riki_Blink_Strike.mp3\/revision\/latest?cb=20191216022336",
      "effects": [
        "Ability Target Unit",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Riki gets all 2 charges immediately upon learning Blink Strike.",
        "The bonus damage is independent from Riki's attack damage and is instantly dealt to the target.",
        "Always teleports Riki behind the target.",
        "Does not disjoint projectiles upon teleporting.",
        "When targeting an enemy, Riki receives the Blinkstrike buff. This buff makes his next attack apply an ensured backstab hit with Cloak and Dagger, regardless of angle. This means when the target manages to turn around before Riki's attack hits, it still applies the backstab. The buff lasts for 1 attack, or for up to 1 second, whichever happens first. The buff is used up upon starting an attack, not upon landing it, so canceling or missing the attack wastes it. The 1 second duration allows Riki to use the ensured backstab against other units than the Blink Strike target if quick enough.",
        "This buff makes his next attack apply an ensured backstab hit with Cloak and Dagger, regardless of angle.",
        "This means when the target manages to turn around before Riki's attack hits, it still applies the backstab.",
        "The buff lasts for 1 attack, or for up to 1 second, whichever happens first.",
        "The buff is used up upon starting an attack, not upon landing it, so canceling or missing the attack wastes it.",
        "The 1 second duration allows Riki to use the ensured backstab against other units than the Blink Strike target if quick enough.",
        "Riki is ordered to attack the target if it is an enemy.",
        "Can be cast on allies without damaging them.",
        "Cannot be cast on couriers."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "0.1",
      "description": "Teleports behind the target unit, striking for bonus damage if it is an enemy.",
      "spellName": "Blink Strike",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 600\/700\/800\/900 (TagTalent 1075\/1175\/1275\/1375)",
        "Damage: 25\/50\/75\/100",
        "Number of Charges: 2",
        "Charge Replenish Time: 25\/20\/15\/10"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "The Stealth Assassin's agile movement makes him impossible to escape."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d5\/Riki_Tricks_of_the_Trade.mp3\/revision\/latest?cb=20191216022342",
      "effects": [
        "Ability Target Area (TagAghanim Target Unit) \/ Channeled",
        "Affects Self \/ Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "Tricks of the Trade disjoints projectiles upon cast.",
        "Certain items which do not cancel channeling spells (e.g. Shadow Blade or Shiva's Guard) do cancel Tricks of the Trade.",
        "Riki is invulnerable and hidden during Tricks of the Trade, turning him to an invalid target for every spell.",
        "Riki is phased during Tricks of the Trade, so that other units can pass through.",
        "Causes Riki to perform instant attacks on 1 (TagTalent 2) random enemy unit within range on each interval, starting immediately on cast. These attacks do not have True Strike, but ignore disarms. Can trigger any attack modifier and on-hit effects normally. The instant attacks do not break Cloak and Dagger's and Smoke of Deceit's invisibility, although Cloak and Dagger visually goes on cooldown. The instant attacks always trigger a backstab from Cloak and Dagger, regardless of facing angles.",
        "These attacks do not have True Strike, but ignore disarms.",
        "Can trigger any attack modifier and on-hit effects normally.",
        "The instant attacks do not break Cloak and Dagger's and Smoke of Deceit's invisibility, although Cloak and Dagger visually goes on cooldown.",
        "The instant attacks always trigger a backstab from Cloak and Dagger, regardless of facing angles.",
        "Performs instant attacks in 0.67-second intervals, starting immediately upon cast, resulting in 4 instances. With Aghanim's Scepter, attacks 2 enemies at once, resulting in up to 8 attacks over the same duration.",
        "With Aghanim's Scepter, attacks 2 enemies at once, resulting in up to 8 attacks over the same duration.",
        "Does not affect invisible units, but does affect units inside the Fog of War.",
        "The visual effects indicating Tricks of the Trade's attack radius are visible to both allies and enemies.",
        "The radius is always centered on Riki and follows him even when he gets moved (e.g. Glimpse). However, a part of the radius indicating visual effects on the ground do not follow Riki, and stay at the cast location.",
        "However, a part of the radius indicating visual effects on the ground do not follow Riki, and stay at the cast location.",
        "With Aghanim's Scepter, Tricks of the Trade can be cast on an allied hero, including illusions and clones, excluding creep-heroes. Riki and all of the spell's effects then follow the allied hero. He still remains hidden. Does not end when the target dies. The ability continues at its corpse's location. It is still bound to the ally, so when it resurrects, it follows it still.",
        "Riki and all of the spell's effects then follow the allied hero. He still remains hidden.",
        "Does not end when the target dies. The ability continues at its corpse's location. It is still bound to the ally, so when it resurrects, it follows it still.",
        "Riki reappears at the center of the ability after the max channel time. ↓↓ Double-tapping automatically moves Riki to the targeted location within the cast range. Riki reappears at the center of the ability.",
        "↓↓ Double-tapping automatically moves Riki to the targeted location within the cast range. Riki reappears at the center of the ability."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "21\/18\/15\/12 (TagTalent 17\/14\/11\/8)",
      "description": "Riki phases out of the world while striking random enemy units from behind in an area around him.",
      "spellName": "Tricks of the Trade",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 400 (TagAghanim 700)",
        "Max Channel Time: 2",
        "Radius: 450",
        "Attack Targets: 1 (TagAghanim 2)",
        "Attack Count: 4",
        "Instant Attack Damage: 70%\/80%\/90%\/100%",
        "Increases cast range and allows you to target an allied hero, hiding inside them for the duration."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The Stealth Assassin is not afraid to fight dirty, and specializes in attacking his opponents from behind."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Riki_Sleeping_Dart_1.mp3\/revision\/latest?cb=20210103151321",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "The projectile travels at a speed of 1600.",
        "The target is invulnerable while sleeping.",
        "The damage and slow are applied upon losing the sleep debuff.",
        "The debuff first applies the slow debuff, then the damage."
      ],
      "mana": "85",
      "hotKey": "D",
      "cooldown": "12",
      "description": "Fires a dart at the target enemy, putting them to sleep for 3 seconds. At the end of the duration, the target wakes up and takes 120 damage and is slowed by 30% for 4 seconds.",
      "spellName": "Sleeping Dart",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range: 1200",
        "Damage: 120",
        "Move Speed Slow: 30%",
        "Slow Duration: 4",
        "Sleep Duration: 3",
        "Blocked upon impact."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/90\/Riki_Cloak_and_Dagger.mp3\/revision\/latest?cb=20191216022338",
      "effects": [
        "Ability Passive",
        "Affects Self \/ Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Riki does not automatically attack enemies while invisible.",
        "When respawning or reincarnating, Riki starts off invisible and does not need to go through the fade delay.",
        "Casting spells or using items does not break the invisibility.",
        "The ability icon shows a cooldown whenever the invisibility is broken. However, this has only informative purposes. This means that using Refresher Orb does not refresh it. This also means it is not affected by the Cooldown Reduction of Octarine Core and Arcane Rune. Time Dilation and Chakra Magic affect the cooldown visually, but do not affect the fade delay in any way.",
        "This means that using Refresher Orb does not refresh it.",
        "This also means it is not affected by the Cooldown Reduction of Octarine Core and Arcane Rune.",
        "Time Dilation and Chakra Magic affect the cooldown visually, but do not affect the fade delay in any way.",
        "Backstab damage is applied when attacking and denying allies.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, and is considered by crit or cleave. It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, and is considered by crit or cleave.",
        "It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "The sound effect plays at the start of the attack, but the damage is applied on hit."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Riki fades into the shadows, becoming invisible. Every time Riki strikes his enemy from behind, he deals bonus damage based on his Agility. When Riki attacks, he becomes visible.",
      "spellName": "Cloak and Dagger",
      "params": [
        "Fade Delay: 4\/3\/2",
        "Back Angle: 105°",
        "Backstab Damage per Agility: 1.4\/1.8\/2.2 (TagTalent 1.9\/2.3\/2.7)",
        "Grants a new ability: Sleeping Dart.",
        "Invisibility part works for illusions. Illusions play the backstab sound upon attacking from behind, but do not deal any bonus damage."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Riki comes for you."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 18.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.3,
    "attrAgilityInc": 1.4,
    "attrAgility": 18.0
  },
  "description": "Riki, the Stealth Assassin, is a melee agility hero that uses stealth in order to surprise enemies and quickly kill them. Usually being played as a carry, his trademark ability, Cloak and Dagger, lets him sneak up on his enemies from behind and deal massive backstab damage, and then quickly escape. This enables him to close in on the enemy and drop his devastating Smoke Screen, which cripples fighters and spellcasters alike. Blink Strike allows Riki to chase with impunity, while Tricks of the Trade makes quick work of his enemies during teamfights. A sneaky and agile assassin, Riki ensures that none of his foes can get away or catch him with each passing opportunity.",
  "history": "Riki was born middle child to the great dynasty of Tahlin. With an older brother groomed for the throne, and a younger brother coddled and kept, Riki, the small middle son, seemed born for the art of invisibility. It was an art he cultivated, and one which ultimately saved his life on the night that his people were betrayed and his family slaughtered. Of all the royal line, he alone escaped—small and agile, unassuming, using smoke as cover. He cut his way out of the royal grounds, using the advantage of surprise, quietly slitting the throats of one enemy warrior after another. Now free of his royal responsibilities, Riki uses his talents in service to a new trade: Stealth Assassin. He silences his enemies, sharpening his skills, hoping to one day take revenge on those who killed his family and robbed him of his birthright.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+125 Smoke Screen AoE",
      "talentRight": "-4 Tricks of the Trade Cooldown"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+475 Blink Strike Cast Range",
      "talentRight": "+0.5 Backstab Multiplier"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-4s Smoke Screen Cooldown",
      "talentRight": "+20 Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Attack Speed",
      "talentRight": "+6 Health Regen"
    }
  ]
}