{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e1\/Glimmer_Cape.mp3\/revision\/latest?cb=20150428141344",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников"
      ],
      "notes": [
        "При использованиие не прерывает произносимые заклинания цели: ни владельца, ни союзника.",
        "Если цель находится на расстоянии, превышающее 800 единиц, то заклинатель будет двигаться в сторону цели до достижения между ними расстояния в 550. Если приказ на применение был дан на цель, находящуюся в пределах 800 единиц, то заклинателю не нужно будет перемещаться и он использует предмет сразу же.",
        "Если приказ на применение был дан на цель, находящуюся в пределах 800 единиц, то заклинателю не нужно будет перемещаться и он использует предмет сразу же.",
        "Заклинатель не поворачивается при использовании на союзников. Не прерывает произносимые заклинания цели.",
        "Применяет бафф на союзного героя. Пока эффект остается на нем, он будет невидимым.",
        "Время до невидимости сбрасывается, а невидимость теряется, если анимация применения заклинания или предмета завершается или цель совершает атаку.",
        "В невидимости существо может поворачиваться, поднимать и выкидывать предметы без повторного времени до невидимости.",
        "В невидимости существо получает способность к сквозному передвижению, давая другим существам проходить через цель без столкновения с ней.",
        "Сопротивление магии накладывается только при полной невидимости. Не накладывается во время ухода в невидимость.",
        "Увеличивает общее сопротивление магии героев до 58.75%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления.",
        "Можно применить на курьеров."
      ],
      "mana": "90",
      "abilityName": "Glimmer",
      "cooldown": "14",
      "description": "С задержкой в 0,6 сек. накладывает на героя или выбранного союзника невидимость и увеличивает сопротивление магии на 45%. Действует 5 сек. Не останавливает прерываемые способности.",
      "params": [
        "Стандартная дальность применения: 550",
        "Дальность применения баффа: 800",
        "Время до невидимости: 0,6",
        "Доп. сопротивление магии: 45%",
        "Длительность: 5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Сочетается по закону убывающей полезности с другими источниками сопротивления магии.",
    "Увеличивает общее сопротивление магии героев до 36.25%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления."
  ],
  "cost": "1950",
  "lore": null,
  "consistFrom": [
    "Shadow Amulet",
    "Cloak",
    "Recipe"
  ],
  "boughtFrom": "Магия",
  "name": "Glimmer Cape",
  "description": "Украденная накидка великого иллюзиониста.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+15% к сопротивлению магии"
  ],
  "tips": null
}