{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-12 Remnant Charge Restore Time",
          "talentRight": "2 Sleight of Fist Charges"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+65 Sleight of Fist Hero Damage",
          "talentRight": "+1 Searing Chains Target"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1s Searing Chains",
          "talentRight": "+50 Flame Guard DPS"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+280 Flame Guard Absorption",
          "talentRight": "+15 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Ember_Spirit_Searing_Chains_1.mp3\/revision\/latest?cb=20191216013535",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Searing Chains interrupts Ember Spirit's channeling abilities upon cast.",
        "Despite the visual effects, the Searing Chains' effects are applied instantly and cannot be disjointed.",
        "The units are selected randomly within its range. There are no priorities.",
        "Roots the targets, preventing them from moving and casting certain mobility spells. Provides True Sight over the targets, but only when the targets were not invisible or within a fade time upon cast.",
        "Provides True Sight over the targets, but only when the targets were not invisible or within a fade time upon cast.",
        "Does not target invisible units or units inside the Fog of War.",
        "Deals damage in 0.5-second intervals, starting 0.5 seconds after cast, resulting in 3\/4\/5\/6 (TagTalent 5\/6\/7\/8) damage instances. Can deal up to 75\/140\/225\/330 (TagTalent 125\/210\/315\/440) damage to each unit.",
        "Can deal up to 75\/140\/225\/330 (TagTalent 125\/210\/315\/440) damage to each unit."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10",
      "description": "Ember Spirit unleashes fiery bolas that wrap around nearby enemies, anchoring them in place and dealing damage each second.",
      "spellName": "Searing Chains",
      "params": [
        "Cast Animation: 0+0.5",
        "Search Radius: 400",
        "Max Targets: 2 (TagTalent 3)",
        "Damage per Second: 50\/70\/90\/110",
        "Duration: 1.5\/2\/2.5\/3 (TagTalent 2.5\/3\/3.5\/4)",
        "Root effect persists and attempts to damage if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Xin's harshest lessons often employed the use of red-hot chains."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Ember_Spirit_Sleight_of_Fist.mp3\/revision\/latest?cb=20191216013536",
      "effects": [
        "Ability Target Area",
        "Affects Enemies \/ Self",
        "Damage Instant Attack"
      ],
      "notes": [
        "Ember Spirit is invulnerable during Sleight of Fist. Does not disjoint projectiles upon cast.",
        "During Sleight of Fist, this ability is inactive, so that it cannot be recast until the current cast finishes. Ember Spirit is only disarmed during Sleight of Fist, so actions besides attacking can be performed normally during it.",
        "Ember Spirit is only disarmed during Sleight of Fist, so actions besides attacking can be performed normally during it.",
        "Upon cast, all targets within the area are marked. A flaming sword appears above them as an indicator, which lasts until they get hit. Sleight of Fist has no range limit. Once a target is marked, it cannot escape Sleight of Fist with distance. Does not affect invisible or attack immune units. When a marked unit turns invisible or attack immune, it gets fully skipped on its turn. Fully affects units in the Fog of War. Fogged units get marked on cast, and get hit as well.",
        "Sleight of Fist has no range limit. Once a target is marked, it cannot escape Sleight of Fist with distance.",
        "Does not affect invisible or attack immune units. When a marked unit turns invisible or attack immune, it gets fully skipped on its turn.",
        "Fully affects units in the Fog of War. Fogged units get marked on cast, and get hit as well.",
        "Jumps in 0.2-second intervals. The jumps are random between all marked units, there are no priorities.",
        "On each jump, Ember Spirit is positioned 50 range away from his target, on a line between the target and the cast location of Sleight of Fist.",
        "Causes Ember Spirit perform an instant attack on each jump against the targets. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike. If Ember Spirit is disarmed, no instant attack is performed on the jump. The instant attacks of Sleight of Fist do not break Smoke of Deceit's invisibility.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike.",
        "If Ember Spirit is disarmed, no instant attack is performed on the jump.",
        "The instant attacks of Sleight of Fist do not break Smoke of Deceit's invisibility.",
        "After all marked targets have been slashed, Ember Spirit returns to the position he had upon casting Sleight of Fist. That position is marked by a fiery replica of Ember Spirit for the duration.",
        "That position is marked by a fiery replica of Ember Spirit for the duration.",
        "Casting Activate Fire Remnant cancels Sleight of Fist. However, other sources of Forced Movement do not."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "18\/14\/10\/6 (TagTalent 0)",
      "description": "Ember Spirit dashes around with blazing speed, attacking all enemies in the targeted area of effect, then returning to his start location. Deals bonus damage to heroes, and less damage to creeps.",
      "spellName": "Sleight of Fist",
      "params": [
        "Cast Animation: 0+0.7",
        "Cast Range: 700",
        "Effect Radius: 250\/350\/450\/550",
        "Jump Interval: 0.2",
        "Hero Attack Damage Bonus: 40\/80\/120\/160 (TagTalent 105\/145\/185\/225)",
        "Creep Attack Damage Reduction: 40%",
        "Number of Charges: 2",
        "Charge Replenish Time: 18\/14\/10\/6"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The studied warrior must whip and weave through its enemies, burning each without pause."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Ember_Spirit_Flame_Guard.mp3\/revision\/latest?cb=20191216013533",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Flame Guard interrupts Ember Spirit's channeling abilities upon cast.",
        "Deals 5\/7\/9\/11 (TagTalent 15\/17\/19\/21) damage in 0.2-second intervals, starting 0.2 seconds after cast. Can deal a total of 275\/490\/765\/1100 (TagTalent 825\/1190\/1615\/2100) damage to a single unit (before reductions), assuming a max duration Flame Guard.",
        "Can deal a total of 275\/490\/765\/1100 (TagTalent 825\/1190\/1615\/2100) damage to a single unit (before reductions), assuming a max duration Flame Guard.",
        "Blocks damage before any reductions, except Mana Shield.",
        "Only blocks magical damage, coming from abilities and attacks. Does not block any physical or pure damage.",
        "Recasting Flame Guard refreshes the buff and resets the barrier's absorb capacity.",
        "Does not stack with other magical damage barriers. If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance. However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity.",
        "If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance.",
        "However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "E",
      "cooldown": "35",
      "description": "Ember Spirit surrounds himself with a ring of fire that consumes incoming magic damage, leaving him unharmed. Flame Guard deals damage per second in an area around Ember Spirit while Flame Guard is active. If the shield is broken, the damage is also lost.",
      "spellName": "Flame Guard",
      "params": [
        "Cast Animation: 0+0.6",
        "Damage Radius: 400",
        "Damage per Second: 25\/35\/45\/55 (TagTalent 75\/85\/95\/105)",
        "Magical Damage Absorbed: 110\/240\/370\/500 (TagTalent 390\/520\/650\/780)",
        "Duration: 11\/14\/17\/20"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "An enemy should never be allowed to approach without difficulty."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Ember_Spirit_Activate_Fire_Remnant.mp3\/revision\/latest?cb=20191216013542",
      "effects": [
        "Ability Target Point",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "This ability level scales together with Fire Remnant's level.",
        "Ember Spirit moves to a Fire Remnant with a speed of 1300 if it can be reached within 1 second at that speed, or reaches it in 0.4 seconds. Ember Spirit is invulnerable while traveling to a Fire Remnant.",
        "Ember Spirit is invulnerable while traveling to a Fire Remnant.",
        "Does not disjoint projectiles upon cast.",
        "The mana cost of Activate Fire Remnant is always the same, regardless of how many remnants he is traveling to with a single cast.",
        "While traveling, Ember Spirit cannot turn, but can attack, cast abilities, and use items (still requires facing his targets).",
        "Forced Movement cancels the movement of Activate Fire Remnant and removes its invulnerability. However, the remnants still get used up and Ember Spirit gets instantly moved to the last one's location once it explodes.",
        "However, the remnants still get used up and Ember Spirit gets instantly moved to the last one's location once it explodes.",
        "Always travels to the Fire Remnant furthest away from the targeted point first.",
        "Ember Spirit damages enemies within a 225 radius around him as he travels, and in a 450 radius around a remnant upon reaching it. Enemies may only be damaged once per remnant, either by Ember Spirit as he travels towards the remnant, or by him upon reaching the remnant.",
        "Enemies may only be damaged once per remnant, either by Ember Spirit as he travels towards the remnant, or by him upon reaching the remnant.",
        "Destroys trees Ember Spirit collides with while traveling to a remnant. Though at high traveling speeds, some trees may be skipped and not destroyed.",
        "Though at high traveling speeds, some trees may be skipped and not destroyed."
      ],
      "mana": "150 (TagTalent 75)",
      "hotKey": "D",
      "cooldown": "0",
      "description": "Select the Fire Remnant to arrive at.",
      "spellName": "Activate Fire Remnant",
      "params": [
        "Cast Animation: 0+1.07",
        "Cast Range: Global",
        "Remnant Damage Radius: 450",
        "Remnant Damage: 100\/200\/300",
        "Activate Fire Remnant costs less mana."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "With blazing speed does a spirit fly!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Ember_Spirit_Fire_Remnant_1.mp3\/revision\/latest?cb=20191216013530",
      "effects": [
        "Ability Target Point",
        "Affects Enemies"
      ],
      "notes": [
        "Leveling this ability automatically levels Activate Fire Remnant as well.",
        "Ember Spirit gets all 3 charges immediately upon learning Fire Remnant. Acquiring Aghanim's Scepter the first time instantly grants 2 charges as well. This only happens once, so re-acquiring it does not grant them again.",
        "Acquiring Aghanim's Scepter the first time instantly grants 2 charges as well. This only happens once, so re-acquiring it does not grant them again.",
        "Fire Remnants move to their targeted location at a speed of 250% (TagTalent 500%) of Ember Spirit's movement speed. The movement speed is set upon cast and does not adapt.",
        "The movement speed is set upon cast and does not adapt.",
        "Since Fire Remnants last for 45 seconds and the replenish time is 38 (TagTalent 26) seconds, it is possible to have 4 (TagTalent 4) (TagTalent 6, 6) remnants up at a time.",
        "Every time a Fire Remnant is placed, Ember Spirit gets a status buff, showing the duration of the remnant. The status buff disappears once the Remnant expires or is used.",
        "Fire Remnants are visible to everyone. They do not grant any vision and cannot be seen when sent into the Fog of War.",
        "Fire Remnants deal no damage when they expire.",
        "With Aghanim's Shard, Fire Remnants deal 22.5 damage in 0.5-second intervals, starting 0.5 seconds after receiving the debuff. The fire remnants start dealing damage as soon as they are created, so they already deal damage while traveling towards their destination. The damage from multiple remnants with overlapping areas do not stack. The damage is sourced to Ember Spirit, and not to the remnants themselves. The damage is provided by an aura, it's debuff lingers for 0.5 seconds.",
        "The fire remnants start dealing damage as soon as they are created, so they already deal damage while traveling towards their destination.",
        "The damage from multiple remnants with overlapping areas do not stack.",
        "The damage is sourced to Ember Spirit, and not to the remnants themselves.",
        "The damage is provided by an aura, it's debuff lingers for 0.5 seconds.",
        "With Aghanim's Shard, any enemy hero kill (including clones, excluding illusions and allies) done by Ember Spirit replenish a Fire Remnant charge. This also happens whenever an enemy hero dies within 400 range of him. Denies do not count. A charge is replenished even if the killed hero has Reincarnation. If Ember Spirit dies, he leaves behind a Fire Remnant at his death location.",
        "This also happens whenever an enemy hero dies within 400 range of him. Denies do not count.",
        "A charge is replenished even if the killed hero has Reincarnation.",
        "If Ember Spirit dies, he leaves behind a Fire Remnant at his death location."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Ember Spirit generates Fire Remnant charges every 38 seconds, with a max of 3 charges. Releasing a charge sends a Fire Remnant that runs to the target location at 2.5x Ember Spirit's speed. Using Activate Fire Remnant, Ember Spirit can dash out to his Remnants, dealing damage along the way and exploding them upon arrival. The targeted Remnant will be arrived at last.",
      "spellName": "Fire Remnant",
      "params": [
        "Cast Animation: 0+0.53",
        "Cast Range: 1400 (TagAghanim 3000)",
        "Remnant Travel Speed: 250% (TagAghanim 500%)",
        "Remnant Duration: 45",
        "Number of Charges: 3 (TagAghanim 5)",
        "Charge Replenish Time: 38 (TagTalent 26)",
        "Enemy Death Radius: 400",
        "Damage Radius: 600",
        "Damage per Second: 45",
        "Damage Aura Linger Duration: 0.5",
        "Increases cast range, initial remnant speed, and maximum charges.",
        "Fire Remnants deal 45 damage per second in a 600 AoE around them. If an enemy hero dies within 400 range of Ember Spirit, a Fire Remnant charge will be replenished."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "By the spirit's power are Xin's teachings spread anew."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 21.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.6,
    "attrAgility": 22.0
  },
  "description": "Xin, the Ember Spirit, is a highly mobile and versatile melee agility hero whose abilities make him a slippery foe who can dance around his enemies at will. His skill set allows for aggressive assaults on other heroes, as he can engage on them from long range using Sleight of Fist and tie them down with Searing Chains. His Flame Guard ability deals damage in a small area around him while shielding him from magic nukes, making him a force to be reckoned with by enemy casters. Finally, his Fire Remnant spell enables him to engage, escape, or move instantaneously around the map, allowing him to appear where the enemy least expects and disappear just as quickly.",
  "history": "Lost within the Wailing Mountains, the Fortress of Flares lay abandoned, its training halls empty, its courtyard covered in leaves and dust. Upon a dais in its sealed temple rests a topaz cauldron filled with ancient ash, remnants of a pyre for the warrior-poet Xin. For three generations, Xin taught his acolytes the Bonds of the Guardian Flame, a series of mantras to train the mind and body for the harsh realities beyond the fortress walls. However, in teaching a warrior's way he earned a warrior's rivals, and in his autumn Xin was bested and slain. His followers spread to the wind. Yet as years turned to centuries and followers to descendants, his teachings endured by subtle whisper and deed. Touched by the teacher's lasting legacy, the Burning Celestial, inquisitive aspect of fire, cast himself to the Fortress of Flares and reignited the pyre ash. From these glowing embers emerged an image of Xin, wreathed in flame, his thoughtful countenance prepared to train and to teach, and to spread the fires of knowledge to all who seek guidance.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-12 Remnant Charge Restore Time",
      "talentRight": "2 Sleight of Fist Charges"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+65 Sleight of Fist Hero Damage",
      "talentRight": "+1 Searing Chains Target"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1s Searing Chains",
      "talentRight": "+50 Flame Guard DPS"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+280 Flame Guard Absorption",
      "talentRight": "+15 Damage"
    }
  ]
}