{
  "abilities": [
    {
      "notes": [
        "Снаряд летит со скоростью в 700 единиц",
        "Длительность оглушения и количество урона отображаются над головой цели при поражении (видно как союзникам, так и противникам), при этом длительность указывается с округленным значением\n При этом настоящая длительность не всегда равна целому значению, а варьируется между заданными (например, на 1 уровне способность может оглушить на 1,74 секунды)",
        "Урон и длительность оглушения обратно связаны между собой, что означает, чем дольше длится оглушение, тем меньший урон нанесет способность, и наоборот\n Это означает, что урон уменьшается на 6,32\/6,92\/7,27\/7,5 за каждые дополнительные 0,1 секунды оглушения\n Далее показаны значения длительности оглушения и урона на разных уровнях способности: Уровень 1: 1,25 сек\n – 120, 1,4875 сек\n – 105, 1,725 сек\n – 90, 1,9625 сек\n – 75, 2,2 сек\n – 60 Уровень 2: 1,5 сек\n – 180, 1,825 сек\n – 157.5, 2,15 сек\n – 135, 2,475 сек\n – 112.5, 2,8 сек\n – 90 Уровень 3: 1,75 сек\n – 240, 2,1625 сек\n – 210, 2,575 сек\n – 180, 2,9875 сек\n – 150, 3,4 сек\n – 120 Уровень 4: 2 сек\n – 300, 2,5 сек\n – 262.5, 3 сек\n – 225, 3,5 сек\n – 187.5, 4 сек\n – 150  Поскольку  талант на увеличение минимального и максимального времени оглушения одинаково увеличивает оба показателя на 0,75, то указанные выше значения урона остаются прежними",
        "Способность сначала применяет дебафф, затем наносит урон",
        "Все иллюзии в радиусе 675 от цели, принадлежащие Chaos Knight, так же выпускают фальшивые Chaos Bolt\n Они используют ту же анимацию применения и выпускают свои заряды одновременно с настоящим\n Когда иллюзии не имеют никаких приказов и спокойно стоят, они поворачиваются к цели и используют фальшивые заряды\n Когда иллюзии двигаются или атакуют, они продолжают это делать и не поворачиваются к цели\n У них проиграется анимация использования, перекрывающая их анимации движения или атаки\n При отмене использования иллюзии все равно проигрывают полностью анимацию применения, но заряды не выпускают\n Фальшивые заряды ни с чем не взаимодействуют: не наносят урон и не оглушают",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Создаёт 1 контролируемую иллюзию Chaos Knight при успешном попадании по цели\n Созданная иллюзия полностью соответствует характеристикам  Phantasm, использует её значения урона и является сильной иллюзией\n Длительность жизни иллюзии 6 сек\n Длительность игнорирует сопротивление эффектам и увеличение длительности отрицательных эффектов\n Развеивание оглушения или смерть цели не убьют иллюзию\n Если Phantasm не изучен, то иллюзия не появится\n Иллюзия появляется именно на местоположении цели и автоматически начинает атаковать врага"
      ],
      "item_behaviour": [],
      "description": "Выпускает таинственный заряд энергии в указанного врага, оглушая его на случайное время и нанося случайный урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Дальность применения: 500 ( 650)",
        "Минимальный урон: 60\/90\/120\/150",
        "Максимальный урон: 120\/180\/240\/300",
        "Мин\n длительность оглушения: 1,25\/1,5\/1,75\/2 ( 2\/2,25\/2,5\/2,75)",
        "Макс\n длительность оглушения: 2,2\/2,8\/3,4\/4 ( 2,95\/3,55\/4,15\/4,75)",
        "Число создаваемых иллюзий от Phantasm:  1",
        "Наносимый иллюзией урон:  100%",
        "Получаемый иллюзией урон:  325%",
        "Длительность жизни иллюзии:  6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/15\/Chaos_Knight_Chaos_Bolt_1.mp3\/revision\/latest?cb=20191216012025",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "13\/12\/11\/10 (TagTalent 10\/9\/8\/7)",
      "aghanim": null,
      "name": "Chaos Bolt",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "C",
      "story": "Даже всадник раздора не способен предсказать поведение этого сгустка нечистой энергии."
    },
    {
      "notes": [
        "С помощью Reality Rift нельзя избегать снаряды",
        "Телепортирует Chaos Knight в точку на линии между героем и целью на расстоянии 250\/300\/350\/400 ( 475\/525\/575\/625) от начальной позиции цели\n Цель телепортируется в 62 единицах перед точкой, поэтому по факту она притягивается на расстояние 188\/238\/288\/338 ( 413\/463\/513\/563)\n Иллюзии развернуты под случайными углами вокруг цели на том же расстоянии, что и Chaos Knight\n Позиция определяется при начале применения\n Визуальные эффекты также проигрываются в начале применения, показывая точку для перемещения Chaos Knight и его цели\n Иллюзии и Chaos Knight смотрят в сторону цели и получают приказ на её атаку",
        "При применении на  Рошана Chaos Knight (и его иллюзии) перемещается к Рошану, но он сам позиции не меняет",
        "Снижение брони применяется к цели при использовании способности\n Chaos Knight не нужно отдавать приказ на атаку для применения дебаффа",
        "Дебафф от нескольких применений не складывается, но обновляет длительность",
        "Не прерывает произносимые заклинания цели"
      ],
      "item_behaviour": [],
      "description": "Переносит героя, все его иллюзии и выбранного врага в точку между владельцем способности и жертвой. Уменьшает броню цели на 6 сек.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 550\/600\/650\/750",
        "Радиус для телепортации иллюзий: 1375",
        "Дистанция притягивания цели: 250\/300\/350\/400 ( 475\/525\/575\/625)",
        "Снижение брони: 4\/5\/6\/7",
        "Длительность: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Chaos_Knight_Reality_Rift.mp3\/revision\/latest?cb=20191216012022",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя"
      ],
      "mana": "18\/14\/10\/6",
      "aghanim": null,
      "name": "Reality Rift",
      "cooldown": "50",
      "legacy_key": "E",
      "story": "Армагеддон перемещается между мирами, доставляя своего наездника к жертве, где бы та ни была."
    },
    {
      "notes": [
        "Увеличивает урон от атаки в среднем на 10,83%\/16,67%\/22,5%\/28,33% ( 14,08%\/21,67%\/29,25%\/36,83%) против клонов героев и иллюзий\n Увеличивает урон от атаки в средне на 32,91%\/41,66%\/50,41%\/59,16% ( 42,79%\/54,16%\/65,54%\/76,91%) против крипов",
        "Шанс срабатывания от нескольких источников критического удара сочетается\n Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора",
        "Вампиризм от способности сочетается с другими источниками вампиризма",
        "Не срабатывает при атаке вардов, строений и союзников",
        "Звук и частицы критического удара воспроизводится при замахе, а не при попадании атаки"
      ],
      "item_behaviour": [],
      "description": "Герой и его иллюзии имеют шанс совершить критическую атаку случайной силы и восстановить себе здоровье на часть от нанесённого урона. Урон крипам умножается на 1,5.",
      "hot_key": "E",
      "params": [
        "Шанс: 33,33% ( 43,33%)",
        "Мин\n критический урон: 125%",
        "Макс\n критический урон: 140%\/175%\/210%\/245%",
        "Вампиризм: 20%\/30%\/40%\/50% ( 42%\/52%\/62%\/72%)",
        "Множитель урона по крипам: 150%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/82\/Chaos_Knight_Chaos_Strike.mp3\/revision\/latest?cb=20191216012015",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов \/ Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Chaos Strike",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Неудержимая мощь всадника сокрушает даже самые толстые доспехи тех, кто осмелился выступить против него."
    },
    {
      "notes": [
        "При применении накладывает базовое развеивание и позволяет избегать снаряды",
        "Во время разделения Chaos Knight неуязвим, спрятан и на него действует иммунитет к заклинаниям\n Также даёт летающий обзор в радиусе 400 вокруг Chaos Knight на время разделения",
        "Сбрасывает текущий приоритет по выбору целью атак и заклинаний Chaos Knight",
        "После завершения разделения Chaos Knight появляется со своими иллюзиями\n Место появления зависит от позиции Chaos Knight при применении способности: одно из существ появляется на месте применения, остальные - на севере, западе, юге или востоке от этой точки\n То есть при появлении 3 иллюзий расположение выглядит как буква Т\n Расстояние между существами составляет 135 единиц\n Поскольку порядок расположения всегда один и тот же, то Chaos Knight и иллюзии занимают случайное положение, но все существа смотрят в одну и ту же сторону",
        "Способность отдает команду \"стоп\" заклинателю после разделения, отменяя все приказы, отданные до или во время разделения",
        "Повторное применение Phantasm заменяет иллюзии от предыдущего применения независимо от того, под чьим контролем они находятся",
        "Иллюзии, созданные Phantasm — сильные, то есть они не исчезают от способностей, обычно уничтожающих иллюзии",
        "При улучшении с <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter Phantasm создает 1 иллюзию каждого союзного героя, подконтрольные Chaos Knight\n Также применяет базовое развеивание к союзникам, но не позволяет им избежать снаряды\n Союзники не становятся неуязвимыми и спрятанными, а их действия не прерываются\n Союзники и иллюзии используют то же положение, что и Chaos Knight, а их позиции так же меняются местами с иллюзиями\n Действует на всех союзных героев, включая клонов\n Не действует на неуязвимых или спрятанных союзников"
      ],
      "item_behaviour": [],
      "description": "Призывает несколько копий героя из параллельных измерений. Иллюзии наносят 325% урона, а получают 30 урона.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,4+0",
        "Время разделения: 0,5",
        "Количество иллюзий: 1\/2\/3 ( 2\/3\/4)",
        "Наносимый иллюзией урон: 100%",
        "Получаемый иллюзией урон: 325% ( 250%)",
        "Длительность: 30 ( 40)",
        "Количество иллюзий союзников:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d7\/Chaos_Knight_Phantasm.mp3\/revision\/latest?cb=20191216012020",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя "
      ],
      "mana": "75",
      "aghanim": null,
      "name": "Phantasm",
      "cooldown": "75\/125\/175",
      "legacy_key": "T",
      "story": "Всадник хаоса участвовал в боях во многих мирах и в разные времена. Фантомы тех боев присоединяются к герою, чтобы повергнуть его врагов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.2,
    "attrAgilityInc": 1.4,
    "attrAgility": 18.0
  },
  "description": "Наносит высокий, но случайный урон. Chaos Knight — сам по себе армия. Он способен призывать кавалерию своих двойников и разрушать постройки врага, а когда покажутся защитники, он расколет реальность и перенесёт себя и свои копии на расстояние, достаточное для рокового взмаха булавы.  Керри Контроль Стойкость Осада Инициация ★☆☆",
  "history": "Сей рыцарь — ветеран бесчисленных сражений в мириадах миров, и появился он в далёком первичном измерении, где фундаментальные законы вселенной обрели разумное воплощение. Из древних Предвечных он самый старший и неутомимый, и он неизменно ищет сущность, что знает лишь под именем Свет. Давным-давно Свет нарушил первое соглашение, покинув прародительский мир. И теперь старший собрат путешествует из мира в мир в бесконечной охоте на Свет, стремясь затушить его везде, где он объявится. Тысячу раз источник сияния гас, и всякий раз рыцарь уходит в другое измерение, дабы продолжить поиски. Он скачет на Армаггедоне, яростно вступает в битвы, черпая силу из хаоса вселенной. Он — физическое воплощение самого хаоса. При нужде он призывает образы самого себя из других миров, и тогда тёмные наездники вместе мчатся в битву, непреодолимые, словно сила стихии. Поиск окончится, только когда последний Свет во вселенной погаснет. За хаосом последует смерть."
}