{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f8\/Treant_Protector_Nature%27s_Grasp_1.mp3\/revision\/latest?cb=20191215183430",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Эффект Nature's Grasp постепенно применяется по всей области.",
        "Лозы делятся на 8 кустов, располагающихся по прямой перед Treant Protector. Расстояние между кустами — 175 единиц; первый появляется в 100 единицах от Treant Protector, создавая линию длиной в 1500. Кусты появляются с интервалом в 0,1 секунды, первый создается сразу после применения, завершая лозу за 0,8 сек. Вместе с радиусом лоза задевает существ на расстоянии до 1635 единиц.",
        "Расстояние между кустами — 175 единиц; первый появляется в 100 единицах от Treant Protector, создавая линию длиной в 1500.",
        "Кусты появляются с интервалом в 0,1 секунды, первый создается сразу после применения, завершая лозу за 0,8 сек.",
        "Вместе с радиусом лоза задевает существ на расстоянии до 1635 единиц.",
        "Время жизни куста начинается после его появления. То есть последний куст исчезнет через 12,8 сек. после применения.",
        "Замедление и урон предоставлены аурой, распространяемой каждым кустом. Существует 2 модификатора: modifier_treant_natures_grasp_damage используется по умолчанию. modifier_treant_natures_grasp_damage_bonus используется, если куст усилен деревом. Модификаторы складываются, но не сами с собой.",
        "Существует 2 модификатора: modifier_treant_natures_grasp_damage используется по умолчанию. modifier_treant_natures_grasp_damage_bonus используется, если куст усилен деревом.",
        "Модификаторы складываются, но не сами с собой.",
        "Наносит 7,5\/10\/12,5\/15 (3,75\/5\/6,25\/7,5 крипам) урона с интервалом в 0,25 секунды спустя 0,25 после применения дебаффа. С усилением от дерева наносит 11,25\/15\/18,75\/22,5 (5,63\/7,5\/9,38\/11,25 крипам) урона с интервалом в 0,25 секунды.",
        "С усилением от дерева наносит 11,25\/15\/18,75\/22,5 (5,63\/7,5\/9,38\/11,25 крипам) урона с интервалом в 0,25 секунды.",
        "С талантом 15-го уровня наносит 15\/17,5\/20\/22,5 (7,5\/8,75\/10\/11,25 крипам) урона с интервалом в 0,25 секунды спустя 0,25 после применения дебаффа. С усилением от дерева наносит 22,5\/26,25\/30\/33,75 (11,25\/13,13\/15\/16,88 крипам) урона с интервалом в 0,25 секунды.",
        "С усилением от дерева наносит 22,5\/26,25\/30\/33,75 (11,25\/13,13\/15\/16,88 крипам) урона с интервалом в 0,25 секунды.",
        "Наносит до 375\/500\/625\/750 (187,5\/250\/312,5\/375 крипам) урона одному существу (до уменьшений). С усилением от дерева наносит до 562,5\/750\/937,5\/1125 (281,25\/375\/468,75\/562,5 крипам) одному существу (до уменьшений).",
        "С усилением от дерева наносит до 562,5\/750\/937,5\/1125 (281,25\/375\/468,75\/562,5 крипам) одному существу (до уменьшений).",
        "С талантом 15-го уровня наносит до 750\/875\/1000\/1125 (375\/437,5\/500\/562,5 крипам) урона одному существу (до уменьшений). С усилением от дерева наносит до 1125\/1312,5\/1500\/1687,5 (562,5\/656,25\/750\/843,75 крипам) одному существу (до уменьшений).",
        "С усилением от дерева наносит до 1125\/1312,5\/1500\/1687,5 (562,5\/656,25\/750\/843,75 крипам) одному существу (до уменьшений)."
      ],
      "mana": "20\/19\/18\/17 (TagTalent 15\/14\/13\/12)",
      "item_behaviour": [],
      "name": "Nature's Grasp",
      "cooldown": "75\/80\/85\/90",
      "description": "Протягивает лозы до указанной области. Они замедляют проходящих по ним врагов и наносят им урон (крипам — вдвое меньше). Лозы наносят на 50% больше урона, если касаются дерева.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,7",
        "Дальность применения: 1500",
        "Длина лоз: 1500",
        "Радиус лоз: 135",
        "Урон в секунду: 30\/40\/50\/60 ( 60\/70\/80\/90)",
        "Увеличение урона от контакта с деревом: 50%",
        "Урон по крипам: 50%",
        "Замедление передвижения: 25%\/30%\/35%\/40%",
        "Длительность лоз: 12",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "T",
      "story": "Стражи обычно не появляются в поле зрения. Чаще всего они скрываются среди своих кудрявых собратьев."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Treant_Protector_Leech_Seed.mp3\/revision\/latest?cb=20201009120946",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "notes": [
        "Наносит урон и выпускает лечащие снаряды с интервалом в 400 сек. спустя 400 сек. после применения, срабатывая 5 раз.",
        "Наносит 80\/160\/240\/320 (TagTalent 280\/360\/440\/520) урона (до уменьшений) и излечивает существо на то же значение.",
        "Лечение не связано с уроном и всегда применяется в полном объеме, независимо от фактически полученного целью урона.",
        "Лечащие снаряды летят со скоростью 450.",
        "Дебафф остается после смерти цели и продолжает выпускать снаряды.",
        "Если цель стала невидимой, то импульсы продолжат исходить из неё, выдавая текущее местоположение.",
        "Снаряды не могут выбрать неуязвимых или спрятанных существ, но уже выпущенные достигают и излечивают союзников."
      ],
      "mana": "18\/16\/14\/12",
      "item_behaviour": [],
      "name": "Leech Seed",
      "cooldown": "80\/90\/100\/110",
      "description": "Герой сажает в тело жертвы истощающее семя, которое замедляет цель и отнимает её здоровье. Также семя излечивает всех союзников вокруг цели.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,5+0,4",
        "Дальность применения: 400",
        "Радиус: 650",
        "Интервал пульсаций: 1",
        "Лечение\/урон за импульс: 16\/32\/48\/64 ( 56\/72\/88\/104)",
        "Замедление скорости передвижения: 8%\/14%\/20%\/26%",
        "Длительность: 5"
      ],
      "legacy_key": "E",
      "story": "Руфтреллен укрепляет союзных существ, черпая жизненные силы из нарушителей, ступивших на его священные земли."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Treant_Protector_Living_Armor_1.mp3\/revision\/latest?cb=20191215183426",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Союзников"
      ],
      "notes": [
        "При выборе области на земле способность выбирает ближайшее к ней существо. ↓↓ Двойное нажатие автоматически выбирает себя (TagTalent область вокруг Treant Protector радиусом 450).",
        "↓↓ Двойное нажатие автоматически выбирает себя (TagTalent область вокруг Treant Protector радиусом 450).",
        "Можно применить на постройки, давая им все эффекты.",
        "Излечивает 5\/8,33\/11,67\/15 (TagTalent 6,25\/9,58\/12,92\/16,25) здоровья с интервалом в 1 секунду спустя 1 секунду после применения баффа, срабатывая 12 раз.",
        "Талант 25-го уровня превращает Living Armor в заклинание, направленное на область, после чего его нельзя применить на существо напрямую. Применение на себя всё так же выбирает Treant Protector, делая героя центром области. В этом случае способность действует накрипов, героев (включая иллюзии и клонов, но исключая крипов-героев) и строения (исключая постройки).",
        "Применение на себя всё так же выбирает Treant Protector, делая героя центром области.",
        "В этом случае способность действует накрипов, героев (включая иллюзии и клонов, но исключая крипов-героев) и строения (исключая постройки)."
      ],
      "mana": "26\/22\/18\/14",
      "item_behaviour": [],
      "name": "Living Armor",
      "cooldown": "50",
      "description": "Накладывает на выбранного героя или постройку защитный покров, увеличивающий регенерацию здоровья и броню.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: Глобальная",
        "Суммарное лечение: 60\/100\/140\/180 ( 75\/115\/155\/195)",
        "Доп. броня: 5\/6\/7\/8 ( 13\/14\/15\/16)",
        "Длительность: 12",
        "Радиус: 450"
      ],
      "legacy_key": "V",
      "story": "Корни и усики Руфтреллена расстилаются повсюду, стимулируя рост и омоложение всего живого."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1b\/Treant_Protector_Eyes_In_The_Forest.mp3\/revision\/latest?cb=20191215183440",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Деревья"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. В режиме Ability Draft Eyes In The Forest может быть разблокирована при выборе игроком Overgrowth.",
        "В режиме Ability Draft Eyes In The Forest может быть разблокирована при выборе игроком Overgrowth.",
        "У способности нет ограничения на число одновременно зачарованных деревьев.",
        "Дерево можно зачаровывать несколько раз без какой-либо пользы.",
        "Длительность зачарования дерева не ограничена и длится до его разрушения.",
        "Деревья отмечаются отдельными иконками на мини-карте. Как и строения, они окрашены зеленым, если зачарованы союзником.",
        "Деревья дают летающий обзор в радиусе 800 единиц и невидимы (с задержкой до невидимости в 0 секунд).",
        "Если у врага есть источник True Sight на зачарованные деревья, то он увидит визуальные эффекты как на дереве, так и в радиусе 800 единиц вокруг него.",
        "Звуковой эффект при применении слышен только союзникам.",
        "При выкладывании, продаже или разрушении Aghanim's Scepter зачарованные деревья продолжают давать обзор и не разрушаются. При этом Overgrowth вокруг этих деревьев не применяется.",
        "При этом Overgrowth вокруг этих деревьев не применяется.",
        "Устанавливает время восстановления всех деревьев на карте в 10 сек. Не распространяется на деревья, созданные способностями и предметами. Если Aghanim's Scepter был приобретен при уже разрушенных деревьях, то они мгновенно появятся.",
        "Если Aghanim's Scepter был приобретен при уже разрушенных деревьях, то они мгновенно появятся."
      ],
      "mana": "",
      "item_behaviour": [],
      "name": "Eyes In The Forest",
      "cooldown": "100",
      "description": "Герой зачаровывает дерево, получая беспрепятственный обзор вокруг него. При применении способности Overgrowth существа в радиусе 800 вокруг зачарованных деревьев будут скованы и получат урон.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,83",
        "Дальность применения: 160",
        "Радиус обзора\/действия Overgrowth: 800",
        "Глобальное время восстановление деревьев: 10",
        "Число зарядов: 3",
        "Время восстановления заряда: 40"
      ],
      "legacy_key": "D",
      "story": "Нельзя знать наверняка, кому или чему понадобится защита."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Treant_Protector_Nature%27s_Guise_2.mp3\/revision\/latest?cb=20191215183434",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя ",
        "Урон: "
      ],
      "notes": [
        "Это врождённая способность и она не требует изучения. В режиме Ability Draft Treant Protector не имеет этой способности и она не связана с другими его способностями.",
        "В режиме Ability Draft Treant Protector не имеет этой способности и она не связана с другими его способностями.",
        "Эта способность отключается только при получении урона, пока она еще не активна. То есть, пока герой находится около дерева, то получение урона не отключает бонусы.",
        "То есть, пока герой находится около дерева, то получение урона не отключает бонусы.",
        "Реагирует на любой урон, превышающий 0 от любого игрока или Рошана.",
        "Применяет усиление лечения и регенерации здоровья, но не усиление вампиризма и вампиризма заклинаний.",
        "С Aghanim's Shard, если способность не на перезарядке, атаки применяют оцепенение к цели, предотвращая её передвижение и использование способностей для перемещения. Если у Treant Protector есть модификатор нахождения около дерева, то используется увеличенная длительность оцепенения. Срабатывает 4 раза, нанося 50 урона за всю длительность. Интервалы адаптируются к длительности. Первое срабатывание происходит через от длительности, а не сразу после применения дебаффа. Дает эффект True Sight на цель.",
        "Если у Treant Protector есть модификатор нахождения около дерева, то используется увеличенная длительность оцепенения.",
        "Срабатывает 4 раза, нанося 50 урона за всю длительность. Интервалы адаптируются к длительности.",
        "Первое срабатывание происходит через от длительности, а не сразу после применения дебаффа.",
        "Дает эффект True Sight на цель.",
        "С Aghanim's Shard Treant Protector также получает невидимость, пока в радиусе 150 от него есть дерево. В отличие от других бонусов, невидимость имеет задержку в сек. То есть невидимость не теряется мгновенно при выходе из радиуса дерева. При повторном приближении к дереву в течение этого времени герой не потеряет бафф. Использование заклинаний или предметов не прерывает невидимость. Атака прерывает невидимость, независимо от того, попала ли она или нет. При нахождении в радиусе дерева во время атаки невидимость вновь станет активной через 0 секунд.",
        "В отличие от других бонусов, невидимость имеет задержку в сек.",
        "То есть невидимость не теряется мгновенно при выходе из радиуса дерева. При повторном приближении к дереву в течение этого времени герой не потеряет бафф.",
        "Использование заклинаний или предметов не прерывает невидимость.",
        "Атака прерывает невидимость, независимо от того, попала ли она или нет.",
        "При нахождении в радиусе дерева во время атаки невидимость вновь станет активной через 0 секунд."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Nature's Guise",
      "cooldown": null,
      "description": "Позволяет ходить сквозь деревья, если герой не получал урон последние секунд. При этом он будет быстрее передвигаться и иметь усиленное лечение и восстановление здоровья.",
      "hot_key": "?",
      "params": [
        "Радиус поиска дерева: 150",
        "Доп. скорость передвижения: 15% ( 30%)",
        "Усиление лечения и регенерации здоровья: 40%",
        "Перезарядка при получении урона: 3",
        "Задержка до невидимости: 0",
        "Длительность задержки невидимости: 0,75",
        "Урон от оцепенения: 200",
        "Длительность оцепенения: 1",
        "Длительность оцепенения около дерева: 2"
      ],
      "legacy_key": "",
      "story": "Стражи обычно не появляются в поле зрения. Чаще всего они скрываются среди своих кудрявых собратьев."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Treant_Protector_Overgrowth_1.mp3\/revision\/latest?cb=20191215183435",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Применяет к целям оцепенение и обезоруживание, предотвращая их передвижение, атаки и использование определенных заклинаний для передвижения. Дает эффект True Sight на цели, но лишь в случае, если при применении они не были невидимы.",
        "Дает эффект True Sight на цели, но лишь в случае, если при применении они не были невидимы.",
        "Отдает команду «стоп» при применении дебаффа затронутым существам, отменяя применение и прерывая произнесение заклинаний. Поскольку действие происходит только при применении дебаффа, то оно не мешает последующим после него произнесениям.",
        "Поскольку действие происходит только при применении дебаффа, то оно не мешает последующим после него произнесениям.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 3\/4\/5 раз.",
        "Наносит до 225\/300\/375 (TagTalent Ошибка Lua в Модуль:Calculate на строке 39: in expression \"3*<strong class=\"error\">Ошибка выражения: + не хватает операнда<\/strong>\".) урона (до уменьшений).",
        "С Aghanim's Scepter также действует на врагов, оказавшихся в радиусе 800 от зачарованных Eyes In The Forest деревьев."
      ],
      "mana": "100 (TagTalent 92)",
      "item_behaviour": [],
      "name": "Overgrowth",
      "cooldown": "200\/250\/300",
      "description": "Вокруг героя разрастаются опутывающие врагов корни и лозы. Жертвы получают периодический урон и не могут перемещаться, телепортироваться, уходить в невидимость или атаковать.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,5+1,17",
        "Радиус: 800",
        "Урон в секунду: 75 ( Ошибка выражения: + не хватает операнда)",
        "Длительность: 3\/4\/5"
      ],
      "legacy_key": "R",
      "story": "Руфтреллен взывает к древнему духу природы, выпуская его мощь через своих собратьев."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 25.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.0,
    "attrAgility": 15.0
  },
  "description": "Living Armor применяется по области радиусом 450 Overgrowth нельзя развеять +40 к урону\/лечению от Leech Seed +8 к броне от Living Armor +30 к урону от Nature's Grasp +15% к замедлению передвижения от Leech Seed –5 сек. перезарядки Nature's Grasp +2 к лечению в секунду от Living Armor",
  "history": "Далеко на западе, в горах за Долиной прорицаний, лежат остатки древней силы, источник первозданной энергии, прорастающей глубоко в высокогорных лесах. Говорят, что то, что там растет — растет странно. Это место свято для сил природы, и его держат сокрытым и недоступным. Бесчисленны ловушки и опасности, покрывающие ту землю — всепоглощающие травы, смешанные животные и ядовитые цветы — но нет среди них ничего настолько же грозного, как могучие энты-защитники. Они — старцы-исполины, которым поручено сохранять мир в этих опасных землях, и не давать тем, кто живет в них, позариться на то, на что не положено, а тем, кто снаружи — вторгаться без причины. Неисчислимые века они сторожили свою землю, несокрушимые и непотревоженные, едва лишь знающие об изменениях мира вокруг. Однако с расширением внешнего мира живущие снаружи прознали о святой земле и с каждой зимой становились всё наглее. Вскоре они нагрянули с устройствами, чтобы рубить, и пламенем, чтобы жечь, и часто энты задумывались: что это за хрупкие, изобретательные существа? Что же случилось с тем зелёным миром? Пришёл и ушёл век раздумий, тысяча лет традиций подверглась исследованиям, а между тем всё больше и больше вторженцев приходили и питали их землю. Когда всё, что когда-то цвело, уже завяло, любопытство перебороло осторожность. Было решено: единственный защитник будет отправлен во внешний мир, и ему будет поручено бродить по нему до нового ледникового периода, следя за меняющейся землёй и населяющими её существами и узнавая, какие ещё неизвестные опасности могут грозить священной земле энтов."
}