{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Wind_Waker_Cyclone.mp3\/revision\/latest?cb=20210120233455",
      "effects": [
        "Дальность применения: 550",
        "Радиус урагана: 24",
        "Урон: 50",
        "Скорость торнадо при применении на себя: 360",
        "Длительность: 2,5"
      ],
      "notes": [
        "↓↓ Двойное нажатие по предмету применит его на владельца.",
        "Применяет к цели эффект урагана, делая её неуязвимой и полностью обезвреживая. При применении на себя применяет безмолвие, заглушение и обезоруживание. Нажатие по земле правой кнопкой мыши заставит пользователя перемещаться при помощи принудительного движения со скоростью 360. Принудительное движение игнорирует скорость поворота пользователя и позволяет ему проходить через возвышенности и деревья. Применение на собственном клоне Meepo или иллюзии Tempest Doubles считается за применением на себя.",
        "При применении на себя применяет безмолвие, заглушение и обезоруживание.",
        "Нажатие по земле правой кнопкой мыши заставит пользователя перемещаться при помощи принудительного движения со скоростью 360.",
        "Принудительное движение игнорирует скорость поворота пользователя и позволяет ему проходить через возвышенности и деревья.",
        "Применение на собственном клоне Meepo или иллюзии Tempest Doubles считается за применением на себя.",
        "Как и большинство других эффектов урагана, сопротивление эффектам не влияет на длительность торнадо от Wind Waker.",
        "При использовании применяет к цели базовое развеивание.",
        "Cyclone сначала применяет неуязвимость, а потом развеивание.",
        "Использовать можно на себя, союзника или противника. Не может выбрать варды или постройки.",
        "Когда существо в воздухе, остальные существа не могут проходить под ним в радиусе 24.",
        "Урон наносится по окончанию действия. Если ураган развеяли, то он все равно нанесет урон при приземлении цели.",
        "Урон наносится только вражеским целям.",
        "Можно применить на Рошана, но без какого-либо эффекта, поскольку у Рошана иммунитет к принудительному движению. При этом урон все равно нанесётся.",
        "Делит перезарядку с Eul's Scepter of Divinity."
      ],
      "mana": "175",
      "abilityName": "Cyclone",
      "cooldown": "18",
      "description": "Поднимает выбранную цель в воздух, делая её неуязвимой на 2,5 сек. Можно использовать только на себя, противников и союзников. Если применить на врага, то по приземлении он получит 50 магического урона.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6825",
  "lore": null,
  "consistFrom": [
    "Eul's Scepter of Divinity",
    "Mystic Staff",
    "Recipe"
  ],
  "name": "Wind Waker",
  "description": "Некоторые сочтут это убедительным доказательством того, что событиями материального мира управляют незримые силы.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}