{
  "abilities": [
    {
      "notes": [
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance.",
        "The magic resistance talent increases Techies's magic resistance to 40%.",
        "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+60 Mines Movement Speed",
          "talentRight": "+252 Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-22s Blast Off! Cooldown",
          "talentRight": "+40 Movement Speed"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+5 Mana Regen",
          "talentRight": "+240 Blast Off! Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-3s Proximity Mines Cooldown",
          "talentRight": "+20% Magic Resistance"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Techies_Proximity_Mines_1.mp3\/revision\/latest?cb=20191216024807",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Techies gets all 3 charges immediately upon learning Proximity Mines.",
        "The mines cannot be triggered during the initial activation delay. The during this delay, the mines are visible to the enemies. Once active, they turn invisible.",
        "The during this delay, the mines are visible to the enemies. Once active, they turn invisible.",
        "It takes 3.35 seconds for a Proximity Mine to detonate when placed right next to an enemy unit or structure.",
        "Proximity Mines are visible during the activation delay.",
        "The mines only damage enemies when they get triggered, not when they are destroyed by attacks.",
        "The mines only detonate when an enemy stands within its trigger radius for 1.6 seconds This means quickly entering and leaving the area does not cause them to trigger. Upon entering its trigger radius, a sound is emitted from the mine, warning the enemy that they just got within the trigger radius. This sound is audible to everyone and audible through the fog of war. The mine's explosion is also audible through the fog of war.",
        "This means quickly entering and leaving the area does not cause them to trigger.",
        "Upon entering its trigger radius, a sound is emitted from the mine, warning the enemy that they just got within the trigger radius.",
        "This sound is audible to everyone and audible through the fog of war. The mine's explosion is also audible through the fog of war.",
        "Proximity Mines can be triggered by invisible, but not by invulnerable or hidden units.",
        "Proximity Mines cannot be placed within the trigger radius of other allied Proximity Mines. When selecting the spell, all own Proximity Mines display a red circle, indicating their trigger radius. However, when choosing the speed granting talent, the mines can be moved together after being placed.",
        "When selecting the spell, all own Proximity Mines display a red circle, indicating their trigger radius.",
        "However, when choosing the speed granting talent, the mines can be moved together after being placed.",
        "The damage source is the mine itself, meaning certain on-damage effects react on the mine rather than on Techies (e.g. Blade Mail).",
        "Flying units cannot trigger or be damaged by the mines.",
        "Wards cannot trigger or be damaged by the mines either.",
        "A Proximity Mine deals 50\/100\/150\/200 damage to buildings.",
        "Provides 300 radius flying vision at its location for 1 second after detonating.",
        "The damage is based on the current level of Proximity Mines, rather than its level as the mine was placed.",
        "Proximity mines do not block neutral creep camps."
      ],
      "mana": "110\/130\/150\/170",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "Plant an invisible mine that cannot be detected by True Sight, but is visible if an enemy is within the active 400 AoE of the mine. Mines detonate if an enemy is standing within the active AoE for 1.6 seconds. The explosion deals full damage in the blast radius, and deals 25% damage to buildings.",
      "spellName": "Proximity Mines",
      "params": [
        "Cast Animation: 0+0.47",
        "Cast Range: 100 (TagAghanim 400)",
        "Trigger Radius: 400",
        "Damage Radius: 400",
        "Activation Delay: 1.75",
        "Detonation Delay: 1.6",
        "Damage: 200\/400\/600\/800",
        "Building Damage Percentage: 25%",
        "Number of Charges: 3",
        "Charge Replenish Time: 23 (TagTalent 20)",
        "Increases cast range."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "The bane of Toterin!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Techies_Stasis_Trap_1.mp3\/revision\/latest?cb=20191216024811",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "The traps cannot be triggered during the initial activation delay. The during this delay, the traps are visible to the enemies. Once active, they turn invisible.",
        "The during this delay, the traps are visible to the enemies. Once active, they turn invisible.",
        "Roots the targets, preventing them from moving and casting certain mobility spells. Provides True Sight over the targets.",
        "Provides True Sight over the targets.",
        "The traps only root enemies when they get triggered, not when they are destroyed by attacks.",
        "When a stasis trap triggers, all other stasis traps owned by the player within 600 radius of the triggering trap are destroyed. Despite this, the traps can still be placed within 600 range of each other.",
        "Despite this, the traps can still be placed within 600 range of each other.",
        "Stasis traps do not trigger on spell immune, invisible, invulnerable, or hidden units. However, invisible units are rooted when within range as a trap is triggered.",
        "However, invisible units are rooted when within range as a trap is triggered.",
        "Provides 600 radius flying vision at its location for 1 second after detonating.",
        "The root duration is based on the level of Stasis Trap as the trap was placed, and not as it detonates.",
        "The trap's explosion is audible through the fog of war.",
        "Stasis traps do not block neutral creep camps."
      ],
      "mana": "80\/110\/140\/160",
      "hotKey": "W",
      "cooldown": "20\/16\/13\/10",
      "description": "Plant an invisible trap that roots nearby enemy units instantly when triggered.",
      "spellName": "Stasis Trap",
      "params": [
        "Cast Animation: 1+0",
        "Cast Range: 150 (TagAghanim 450)",
        "Trigger Radius: 400",
        "Root Radius: 600",
        "Activation Delay: 2",
        "Root Duration: 2\/3\/4\/5",
        "Increases cast range."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The scourge of Trapper Town!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/74\/Techies_Blast_Off%21_1.mp3\/revision\/latest?cb=20191216024800",
      "effects": [
        "Ability Target Area",
        "Affects Enemies \/ Self",
        "Damage Magical (TagAghanimHP Removal)"
      ],
      "notes": [
        "The leap always takes 4\/5\/6\/7 seconds, so the horizontal speed varies between 0 and 1333.33.",
        "Leaps in an arc up to 281.108 range high, so that other units can pass below them.",
        "The self damage is lethal, so that Techies can deny themselves with this ability.",
        "The self damage is magic damage flagged as HP Removal and therefore ignores most sources of damage manipulation (except for magic resistance and magical damage barriers). Borrowed Time, Aphotic Shield, Ghostship, and False Promise are the only ones able to interact with the self damage. Shallow Grave prevents dying to the self damage.",
        "Borrowed Time, Aphotic Shield, Ghostship, and False Promise are the only ones able to interact with the self damage.",
        "Shallow Grave prevents dying to the self damage.",
        "Damages enemies in the area before damaging Techies, so Techies still gets the experience when enemies die to this spell. This means Techies can die to Blade Mail, Spiked Carapace, Dispersion, Last Will, and Static Charge if his health was low enough on cast.",
        "This means Techies can die to Blade Mail, Spiked Carapace, Dispersion, Last Will, and Static Charge if his health was low enough on cast.",
        "The explosion first applies the debuff, then the damage (TagTalent then the stun).",
        "Destroys trees within 400 radius around Techies upon landing.",
        "Can be interrupted by forced movement during the leap but is not interrupted by any other sort of disable.",
        "Can be cast while rooted and getting rooted during the leap does not interrupt it."
      ],
      "mana": "100\/125\/150\/175",
      "hotKey": "E",
      "cooldown": "35 (TagTalent 13)",
      "description": "Techies hurtle themselves into the enemy's midst, detonating charges upon impact which deal massive area of effect damage and silence enemies. Upon landing, the assault deals Techies damage equal to 300\/400\/500\/600 of their max health.",
      "spellName": "Blast Off!",
      "params": [
        "Cast Animation: 1+0.9",
        "Cast Range: 1000 (TagTalent 1600)",
        "Damage\/Silence Radius: 400",
        "Max Health as Self Damage: 50%",
        "Area Damage: 300\/400\/500\/600 (TagTalent 540\/640\/740\/840)",
        "Leap Duration: 0.75",
        "Silence Duration: 4\/5\/6\/7",
        "Stun Radius: 200",
        "Stun Duration: 1.5",
        "Increases Blast Off! cast range by 600, and applies a 1.5 second stun to enemies in 200 AoE."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Where we going?"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Techies_Minefield_Sign.mp3\/revision\/latest?cb=20191216024803",
      "effects": [
        "Ability Target Area (TagAghanim Aura)",
        "Affects Allied Units"
      ],
      "notes": [
        "This is an innate ability and cannot be learned or leveled. In Ability Draft, Minefield Sign is bound to Remote Mines, and is granted to the player that drafts it.",
        "In Ability Draft, Minefield Sign is bound to Remote Mines, and is granted to the player that drafts it.",
        "Only one sign can exist on the map at a time. Planting a second sign causes the previous one to immediately disappear (although there is a visual delay).",
        "Planting a second sign causes the previous one to immediately disappear (although there is a visual delay).",
        "The sign has no collision and cannot block unit pathing.",
        "The sign does not block neutral creep camps.",
        "Aghanim's Scepter grants the Minefield Sign an aura, applying invisibility which is immune to True Sight and has a 0-second fade time. The aura only affects Proximity Mines, Stasis Traps, and Remote Mines. Other kinds of wards are not affected. The aura affects the mines of all allied players, not just the ones of Techies himself, but not enemy mines. Mines within range of a sign do not have to go through their fade times to become invisible. The aura's invisibility prevents enemies from seeing Proximity Mines even within its trigger range, or from seeing Remote Mines during their detonation delay. The aura's buff lingers for 0.5 seconds.",
        "The aura only affects Proximity Mines, Stasis Traps, and Remote Mines. Other kinds of wards are not affected.",
        "The aura affects the mines of all allied players, not just the ones of Techies himself, but not enemy mines.",
        "Mines within range of a sign do not have to go through their fade times to become invisible.",
        "The aura's invisibility prevents enemies from seeing Proximity Mines even within its trigger range, or from seeing Remote Mines during their detonation delay.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "hotKey": "F",
      "cooldown": null,
      "description": "Plant a warning sign to remind enemies to step lightly. Only one sign can exist at a time. Lasts seconds.",
      "spellName": "Minefield Sign",
      "params": [
        "Cast Animation: 0+0.53",
        "Cast Range: 10",
        "Max Signs: 1",
        "Duration: 180",
        "Invisibility Radius: 125",
        "Invisibility Fade Time: 0",
        "Aura Linger Duration: 0.5",
        "Allows Minefield Sign to hide any Proximity Mines, Stasis Traps, and Remote Mines in an area around the sign from True Sight."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Watch your step!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Techies_Remote_Mines.mp3\/revision\/latest?cb=20191216024810",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The mines only damage enemies when they get triggered, not when they are destroyed by attacks or when they expire.",
        "Remote mines can be instantly detonated after placing them, but detonate with a very short delay.",
        "The damage source is the mine itself, meaning certain on-damage effects react on the mine rather than on Techies (e.g. Blade Mail).",
        "The mines can be stacked on one spot and cannot block unit pathing.",
        "Can have up to 67 remote mines at a time with the default cast time, cooldown and duration.",
        "Provides 500 radius flying vision at its location for 3 seconds after detonating.",
        "The damage is based on the level of Remote Mines as the mine was placed, and not as it detonates.",
        "However, they do upgrade\/downgrade when picking up\/dropping Aghanim's Scepter.",
        "Level 2 mines are 10% bigger than level 1 mines, and level 3 mines are 20% bigger than level 1 mines.",
        "Remote mines do not block neutral creep camps."
      ],
      "mana": "120\/180\/240",
      "hotKey": "R",
      "cooldown": "8",
      "description": "Plant an invisible explosive that will only detonate after a brief delay when triggered. Does not damage buildings.",
      "spellName": "Remote Mines",
      "params": [
        "Cast Animation: 1+0.13",
        "Cast Range: 500 (TagAghanim 800)",
        "Damage Radius: 425",
        "Activation Delay: 0",
        "Detonation Delay: 0.25",
        "Fade Time: 2",
        "Damage: 300\/450\/600 (TagAghanim 450\/600\/750)",
        "Mine Duration: 600",
        "Increases damage and cast range."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "The downfall of Dredger's Bight!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/48\/Techies_Focused_Detonate.mp3\/revision\/latest?cb=20191216024802",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "Focused Detonate is unlocked when Remote Mines is learned.",
        "Focused Detonate can be cast without having to face towards the targeted area.",
        "This ability can be used while Techies is dead and while prevented from acting, but not while Techies is disabled.",
        "If there are no remote mines within the search radius, nothing happens, wasting the cooldown."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Detonate all remote mines in the target area.",
      "spellName": "Focused Detonate",
      "params": [
        "Cast Animation: 0+0.53",
        "Cast Range: Global",
        "Radius: 700"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Why light one fuse when you can light them all?"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Techies_Pinpoint_Detonate.mp3\/revision\/latest?cb=20191216024806",
      "effects": [
        "Ability No Target",
        "Affects Enemies"
      ],
      "notes": [
        "This is cast from the mine itself, making it possible to detonate mines when unable to use Focused Detonate due to disables.",
        "Detonates all selected remote mines with a 0.03 seconds delay from each other."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Detonate all selected remote mines.",
      "spellName": "Pinpoint Detonate",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Kablooey!"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 19.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.3,
    "attrAgility": 14.0
  },
  "description": "Squee, Spleen, and Spoon, the Techies, are a trio of ranged intelligence heroes, known for laying deadly traps around the field with a wide array of mines.",
  "history": "In the storied saga of Dredger's Bight, no business has ever been more reviled than Techies Demolitions. Then again, Dredger's Bight no longer exists. Nor does Toterin. Or even Trapper Town. In fact, if one were to track the history of Techies Demolitions they might notice that shortly after Techies appear, towns tend to disappear. Like every inevitable disaster surrounding Techies, the obliteration of Dredger's Bight began with an invention. Tasked with designing a safer way of detonating explosives in the mines beneath the city, pyrotechnic prodigies Squee, Spleen, and Spoon developed their most outlandish creation yet: a button which, when pressed, would trigger a distant device to spark a fuse. Overeager to test their invention, the trio stuffed barrel after barrel with flamesalt explosives, piling every corner of their tiny workshop high with the newly developed remote bombs. From this stockpile they plucked a single payload, burying it in a far away field. As they cowered in a ditch, Spleen pressed the detonator button. Yet after a moment, nothing happened. Confused, he stood up, pressing his button again and again until, finally, an explosion tore a hole in the field. Elated, Squee and Spleen turned toward home just as a massive wave of sound and force arrived to knock them over. Bewildered, their ears ringing from the unexpected blast, they gathered in the dingy miasma to see a smoking ruin where their workshop once stood. Chunks of wood and stone continued to fall as the yawning crater before them slowly deepened into an expanding pit. The whole of Dredger's Bight shuddered, and then gradually started to slide into the mines below as its panicked residents fled. Sitting at the edge of their sinking home they grinned and giggled, as giddy at the possibilities as they were oblivious to the scorn of their former neighbors. They wondered only one thing: how could they trigger an even bigger blast?",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+60 Mines Movement Speed",
      "talentRight": "+252 Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-22s Blast Off! Cooldown",
      "talentRight": "+40 Movement Speed"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+5 Mana Regen",
      "talentRight": "+240 Blast Off! Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-3s Proximity Mines Cooldown",
      "talentRight": "+20% Magic Resistance"
    }
  ]
}