{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Shiva%27s_Guard.mp3\/revision\/latest?cb=20141214202429",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Активация предмета не прерывает использование других способностей.",
        "Взрыв имеет скорость 350 и требует 2,57 секунды для достижения максимальной дальности и исчезнуть.",
        "Центром области эффекта является владелец, и если он двигается или блинкуется, радиус двигается вместе с ним.",
        "Взрыв не является кольцом. Он затрагивает каждого врага в области действия эффекта. Это значит что в отличии от Ravage, эффект затронет героя, даже если он телепортируется через «край взрыва» в сторону заклинателя.",
        "Это значит что в отличии от Ravage, эффект затронет героя, даже если он телепортируется через «край взрыва» в сторону заклинателя.",
        "Даёт летающий обзор в радиусе 800, следует за заклинателем и оставляет след который исчезает через 2 секунды."
      ],
      "mana": "100",
      "abilityName": "Arctic Blast",
      "cooldown": null,
      "description": "Выпускает морозную волну, которая наносит противникам 200 магического урона и на 4 сек. снижает их скорость передвижения на 40%.",
      "params": [
        "Радиус: 900",
        "Урон: 200",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 4"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_symbol)^Блокируется иммунитетом к заклинаниям\nЗамедление остается если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Freezing Aura от нескольких Shiva's Guard не складывается.",
        "Дебафф ауры задерживается на 0,5 секунды."
      ],
      "mana": null,
      "abilityName": "Freezing Aura",
      "cooldown": null,
      "description": "Снижает скорость атаки противников на 45, а их лечение, восстановление здоровья и вампиризм — на 25%%.",
      "params": [
        "Радиус: 1200",
        "Замедление скорости атаки: 45",
        "Уменьшение лечения: 25%",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 15 брони, 360 маны и 1,5 регенерации маны.",
    "Для героев ловкости, даёт 15 брони, 360 маны и 1,5 регенерации маны.",
    "Для героев интеллекта, даёт 15 брони, 360 маны, 1,5 регенерации маны и 30 урона от атаки."
  ],
  "cost": "4950",
  "lore": null,
  "consistFrom": [
    "Platemail",
    "Mystic Staff",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Shiva's Guard",
  "description": "Артефакт, раньше принадлежавший богине, до сих пор сохранил часть былого могущества.",
  "trivia": [
    "Имя «Shiva» вероятно является отсылкой к важному в индуизме одноименному божеству. Однако из-за ледяной тематики, предмет может ссылаться на Shiva из серий игр Fantasy Final Fantasy."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+30 к интеллекту",
    "+15 к броне"
  ],
  "tips": null
}