{"abilities":[{"effects":["Radius: 1200","Charges per Cast Spell: 1","Max Charges: 20","Health and Mana Restored per Charge: 15"],"notes":["Interrupts the user's channeling spells upon cast.","Gains 1 charge whenever a visible enemy unit, including neutral creeps, uses an ability within the radius.","Does not gain charges from toggle abilities, active attack modifiers and the abilities listed here.","Clones, illusions and creep-heroes cannot gain charges.","Passively triggered spells (e.g. Quill Spray, Borrowed Time, Multicast, Reincarnation) do not add charges.","When an enemy casts a spell out of the invisibility from the Invisibility Rune, Shadow Walk, Sand Storm, Moonlight Shadow or Shukuchi, it does not give a charge.","Shares cooldown with Magic Stick.","When having multiple Holy Lockets, Magic Wands and Magic Sticks in the inventory, the oldest one gains charges first. If it is full, the second oldest one starts to gain charges.","Upon upgrading a Magic Wand into a Holy Locket, all its current charges are carried over."],"elements":["Ability No Target","Affects Self"],"description":"Instantly restores 15 health and mana per charge stored. Max 20 charges. Gains a charge whenever a visible enemy within 1200 range uses an ability."},{"effects":["Heal Amplification: 35%"],"notes":["Amplifies any heal sourced from the owner of the item. This means it does not amplify heals the owner receives from allies, but it does amplify heals allies receive from the owner.","Does not amplify mana or mana regeneration."],"elements":["Ability Passive","Affects Self"],"description":"Amplifies heals you provide by 35%."}],"cost":"2900","description":"Cost 2900 (850) Bought From Support","further":["Ring_of_Tarrasque","Energy_Booster","Magic_Wand","Recipe"],"tips":["Holy Locket synergizes well with Mekansm, Guardian Greaves, Urn of Shadows and Spirit Vessel, increasing their healing."],"attrs":["Active Energy Charge","Charges 0","Passive Holy Blessing","Bonus +3 Strength +3 Agility +3 Intelligence +250 Health +4 Health regeneration +325 Mana","Disassemble? No","Alert allies? No"],"info":["Holy Blessings from multiple Holy Lockets do not stack."]}