{"abilities":[{"effects":["Радиус: 1200","Зарядов за исп. способностей: 1","Максимум зарядов: 20","Восст. здоровья и маны за заряд: 15"],"notes":["Прерывает произносимые заклинания владельца при применении.","Даёт 1 заряд когда видимое вражеское существо, включая нейтральных крипов, использует способность в радиусе.","Не дает заряды от переключаемых способностей, активных модификаторов атаки и способностей срабатывающих от других способностей.","Пассивно срабатывающие способности (например Quill Spray, Borrowed Time, Multicast, Reincarnation) не дают заряды.","Когда враг применяет заклинание в невидимости с Руна невидимости, Shadow Walk, Sand Storm, Moonlight Shadow, Nature's Guise или Spin Web, оно не даст заряд.","Может восстановить до 300 здоровья и маны при максимальном количестве зарядов.","Делит перезарядку с Magic Stick и Magic Wand.","При наличии нескольких Magic Wand, Holy Locket или Magic Stick в инвентаре, первым заряды получит тот, который был раньше. Если он полон, второй по давности начнёт получать заряды.","При улучшении Magic Wand в Holy Locket, все его текущие заряды будут утеряны.","Несколько Holy Blessing аддитивно сочетаются друг с другом."],"elements":["Способность Ненаправленная","Действует на Себя"],"name":"Energy Charge","description":"Мгновенно восстанавливает 15 здоровья и маны за каждый имеющийся заряд. Может иметь до 20 зарядов. Получает один заряд каждый раз, когда видимый враг в радиусе 1200 использует способность."},{"effects":["Усиление лечения и регенерации здоровья: 35%"],"notes":["Усиливает любое лечение и регенерацию здоровья, полученную от владельца предмета. Это означает, что он не усиливает исцеления, полученные владельцем от союзников, но усиливает исцеления, получаемые союзниками от владельца.","Не усиливает регенерацию маны и получение маны."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Holy Blessing","description":"Усиливает лечение и регенерацию предоставляемую вами на 35%."}],"cost":"2900","description":"Стоимость 2900 (850) Покупается в Поддержка","further":["Ring_of_Tarrasque","Energy_Booster","Magic_Wand","Рецепт"],"attrs":["Активная Energy Charge","Зарядов 0","Пассивная Holy Blessing","Бонус +3 к силе +3 к ловкости +3 к интеллекту +250 к здоровью +4 к регенерации здоровья +325 к мане","Можно разобрать? Нет","Можно сообщать? Нет"]}