{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Magnus: 240 здоровья, 1,2 восстановления здоровья и 12 урона от атаки.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 сек. оглушения от Reverse Polarity",
          "talentRight": "+10% к урону\/прорубанию от Empower"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+375 к дальности Skewer",
          "talentRight": "+350 к здоровью"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−7 сек. перезарядки Skewer",
          "talentRight": "+12 к силе"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0,5 сек. замедления от Shockwave",
          "talentRight": "+10 сек. действия Empower"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/47\/Magnus_Shockwave_1.mp3\/revision\/latest?cb=20191216015854",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Shockwave движется со скоростью в 900, проходя максимальное расстояние за 1,333 сек.",
        "Поражает существ на расстоянии до 1400 (складывается из дальности прохождения и радиуса).",
        "Задетые враги притягиваются к центру Shockwave и к Magnus. Чем дальше враги от центра волны, тем сильнее их притягивает в нему, а не к Magnus. Притягивает врагов на расстояние 150 за 0,2 сек. со скоростью 750.",
        "Чем дальше враги от центра волны, тем сильнее их притягивает в нему, а не к Magnus.",
        "Притягивает врагов на расстояние 150 за 0,2 сек. со скоростью 750.",
        "Волна сначала применяет дебаффы, затем наносит урон.",
        "Проигрывает базовый звук и частицы при начале применения.",
        "Замедление от нескольких применений не складывается, но обновляет длительность."
      ],
      "mana": "90\/100\/110\/120",
      "item_behaviour": [],
      "name": "Shockwave",
      "cooldown": "13\/12\/11\/10",
      "description": "Герой отправляет в указанном направлении ударную волну, притягивающую к себе врагов, наносящую им урон и ненадолго замедляющую их.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+1,2",
        "Дальность применения: 1200",
        "Дальность прохождения волны: 1200",
        "Радиус: 200",
        "Урон: 75\/150\/225\/300 (TagTalent 82\/157\/232\/307)",
        "Замедление скорости передвижения: 75%",
        "Расстояние притягивания: 150",
        "Длительность притягивания: 0,2",
        "Длительность замедления: 0,9 (TagTalent 1,4)"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Magnus_Empower.mp3\/revision\/latest?cb=20191216015850",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников",
        "Урон Физический"
      ],
      "notes": [
        "При применении на себя дает 17,5%\/35%\/52,5%\/70% (TagTalent 35%\/52,5%\/70%\/87,5%) прорубающего урона и 19,25%\/31,5%\/43,75%\/56% (TagTalent 36,75%\/49%\/61,25%\/73,5%) к урону.",
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом существ. Дополнительный урон не увеличивается.",
        "Способность периодически проверяет текущий урон существа и мгновенно адаптирует бонус.",
        "Дает целям ближнего боя эффект прорубания и дополнительный урон, а целям дальнего боя - только урон.",
        "Прорубающий урон не может быть увеличен с помощью усиления урона заклинаний и он не дает лечения от вампиризма заклинаний.",
        "Прорубающий урон уменьшается блокировкой урона.",
        "Прорубающий урон зависит от значения урона атакующего существа, а не от урона, полученного основной целью.",
        "Урон вторичным целям распространяется по конической площади перед существом.",
        "Способность сочетается с другими источниками прорубания. Каждый источник действует независимо от другого.",
        "Прорубание не действует при атаке вардов, строений или союзных существ. На варды и строения прорубание не действует.",
        "Несмотря на визуальные эффекты, прорубающий урон наносится мгновенно по области."
      ],
      "mana": "45\/60\/75\/90",
      "item_behaviour": [],
      "name": "Empower",
      "cooldown": "8",
      "description": "Даёт союзнику дополнительный урон и прорубающую атаку. Действует на владельца на 75% сильнее.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+1,07",
        "Дальность применения: 800",
        "Начальный радиус прорубания: 150",
        "Дальность прорубания: 650",
        "Конечный радиус прорубания: 360",
        "Прорубающий урон: 10%\/20%\/30%\/40% (TagTalent 20%\/30%\/40%\/50%)",
        "Дополнительный урон: 11%\/18%\/25%\/32% (TagTalent 21%\/28%\/35%\/42%)",
        "Множитель для владельца: 1,75",
        "Длительность: 38\/42\/46\/50"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e7\/Magnus_Skewer_1.mp3\/revision\/latest?cb=20191216015855",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Вражеских героев \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Magnus разгоняется со скоростью 950 единиц.",
        "Перемещает Magnus на отрезок в 31,67 единиц. При выборе расстояние, не кратного этому числу, оно будет округлено в меньшую сторону. То есть минимальное расстояние составляет 31,67 единиц, а максимально возможное - 887\/982\/1077\/1172 (TagTalent 1267\/1362\/1457\/1552), что равно 28\/31\/34\/37 (TagTalent 40\/43\/46\/49) отрезкам.",
        "То есть минимальное расстояние составляет 31,67 единиц, а максимально возможное - 887\/982\/1077\/1172 (TagTalent 1267\/1362\/1457\/1552), что равно 28\/31\/34\/37 (TagTalent 40\/43\/46\/49) отрезкам.",
        "Во время движения Magnus обезврежен.",
        "Вражеские герои в радиусе 145 вокруг Magnus оказываются перед героем и движутся вместе с ним.",
        "Во время движения захваченные герои оглушены.",
        "При завершении движения герои оказываются в 200 единицах перед Magnus.",
        "Может захватывать и перемещать врагов через непроходимую территорию.",
        "Skewer сначала применяет дебафф замедления, затем наносит урон.",
        "Во время движения разрушает деревья в радиусе 200 единиц вокруг героя и в радиусе 400 в конечной точке.",
        "Может захватывать иллюзии и крипов-героев."
      ],
      "mana": "80 (TagTalent 40)",
      "item_behaviour": [],
      "name": "Skewer",
      "cooldown": "22\/20\/18\/16 (TagTalent 6)",
      "description": "Герой бросается вперёд, пронзая врагов своим массивным рогом. Если на пути попадутся вражеские герои, то их протащит до места назначения, после чего они получат урон, а их скорость передвижения и атаки уменьшится.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,33 (TagAghanim 0,15+0,5)",
        "Дальность применения: Глобальная",
        "Максимальная дальность прохождения: 887\/982\/1077\/1172 (TagTalent 1267\/1362\/1457\/1552)",
        "Радиус: 145",
        "Урон: 70\/140\/210\/280",
        "Замедление скорости передвижения: 10%\/20%\/30%\/40%",
        "Замедление скорости атаки: 25\/30\/35\/40",
        "Длительность замедления: 3,25",
        "Уменьшает перезарядку, расход маны и задержку перед применением.",
        "Не может задеть врагов с иммунитетом к заклинаниям. Замедляет и пытается нанести урон врагам, получившим иммунитет во время зацепления.",
        "Применение оцепенения во время движения не отменяет заклинание."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Magnus_Reverse_Polarity_1.mp3\/revision\/latest?cb=20191216015852",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Мгновенно притягивает всех существ на расстояние 150 от Magnus.",
        "Reverse Polarity сначала применяет дебафф, затем наносит урон.",
        "У способности нет лимита по количеству затрагиваемых существ.",
        "Оглушает Рошана, но не притягивает его к герою.",
        "Эффекты частицы и звук проигрываются в начале применения."
      ],
      "mana": "200\/250\/300",
      "item_behaviour": [],
      "name": "Reverse Polarity",
      "cooldown": "130",
      "description": "Герой изменяет свойства материи, стягивая всех врагов вокруг в точку перед собой, оглушая их мощным хлопком и нанося им урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+1,3",
        "Радиус: 410",
        "Урон: 50\/125\/200",
        "Длительность оглушения: 2,75\/3,25\/3,75 (TagTalent 3,75\/4,25\/4,75)"
      ],
      "legacy_key": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 25.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 2.5,
    "attrAgility": 15.0
  },
  "description": "Magnus — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Shockwave, посылает ударную волну, нанося урон врагам на линии ее прохождения. Вторая способность, Empower, увеличивает урон и наделяет свое оружие или оружие союзника эффектом, который позволяет наносить прорубающий удар. Этот эффект схож с эффектом от Battle Fury. Третьей способностью, Skewer, Magnus бросается вперед, пронзая врагов своим массивным бивнем. Если на пути попадутся вражеские герои, то их отталкивает к месту назначения, после чего они получат урон и будут замедлены. Ультимативная способность, Reverse Polarity, изменяет свойства материи, притягивая всех врагов на позицию перед собой и оглушая их мощным хлопком, а также при этом нанося им урон.",
  "history": "Лишь в одном было согласие между лучшими кузнецами вулкана Йорлак — в том, что рог магнорога есть драгоценнейший из всех материалов. Самый большой и острый из них принадлежит зверю, которого они прозвали Magnus. Он с легкостью пронзал своим рогом ещё их отцов, пытавшихся заполучить сокровища его рода. Изо дня в день он возвращался в свою пещеру с побагровевшими от крови копытами и рогом — до тех пор, пока родоначальница не призвала его и весь его род уйти из пещер и искать покоя на севере, в тени горы. Магнорог лишь усмехнулся, ведь он всегда справлялся с защитой своего народа. Он решил, что племя останется, ведь магнороги не верят в случайности… и не меняют своих решений. Однако когда внезапное извержение вулкана Йорлак обратило половину рода в пламя и пепел, защитник всё же решился изменить свою волю. Выжившие шли на север, пока не встретили на своем пути заставу с сотней охотников, вооруженных луками и закаленной сталью. Меньшего магнорог и не ожидал. Он повел своих самых свирепых братьев и сестер в битву с яростью, сравнимой лишь с яростью огнедышащей горы, подступающей сзади и неумолимо пожирающей их старейшин, матерей и телят. О дальнейшем ходе событий кузнецы спорят до сих пор. Одни говорят, что магнорог воссоздал свой род, а другие — что он не пережил побоища, умерев от смертельных ранений у бездыханного тела родоначальницы. Но ни те, ни другие не правы. Магнорог поклялся, что вернется в своё племя… но лишь когда последний из виновников извержения падёт от его могучего рога. Ведь магнороги не верят в случайности.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 сек. оглушения от Reverse Polarity",
      "talentRight": "+10% к урону\/прорубанию от Empower"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+375 к дальности Skewer",
      "talentRight": "+350 к здоровью"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−7 сек. перезарядки Skewer",
      "talentRight": "+12 к силе"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0,5 сек. замедления от Shockwave",
      "talentRight": "+10 сек. действия Empower"
    }
  ]
}