{
  "abilities": [
    {
      "effects": [
        "Cast Range: Global",
        "Max Blink Distance: 1200",
        "Penalty Blink Distance: 960",
        "Damage Cooldown: 3"
      ],
      "notes": [
        "Double clicking the item automatically casts it on your team's fountain, blinking towards its direction, using the penalty distance.",
        "Disjoints projectiles upon cast.",
        "Does not blink for the full distance when targeting closer than the max distance.",
        "When targeting beyond the max blink distance, it blinks for 960 range towards the targeted direction, instead of 1200.",
        "The second sound only plays when the blinked distance is greater than 960. It is audible to everyone.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan puts Blink on a 3 second cooldown. Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm. However, this cooldown is not affected by Octarine Core or Arcane Rune. Does not get disabled by damage flagged as HP Removal. This cooldown triggers even when the dagger is inactive due to being or just having left the backpack, or is not bought yet."
      ],
      "elements": [
        "Ability Target Point",
        "Affects Self"
      ],
      "name": "Blink",
      "description": "Teleport to a target point up to 1200 units away. Blink Dagger cannot be used for 3 seconds after taking damage from an enemy hero or Roshan."
    }
  ],
  "cost": "2250",
  "description": "The fabled dagger used by the fastest assassin ever to walk the lands.",
  "trivia": [
    "In the original DotA, this item was called Kelen's Dagger, in reference to a Warcraft III item, Kelen's Dagger of Escape. Kelen was a well known rogue in the Warcraft universe, who was known for his ability to escape from any dangerous situation thanks to the help of his dagger.",
    "Riki and Lion are the only heroes who are missing responses for acquiring a Blink Dagger.",
    "Axe's cosmetic item, Little Blink Dagger, is based on Blink Dagger."
  ],
  "tips": [
    "Blink requires heroes to face the direction in which they are blinking. This means that heroes facing away from their blink destination will have to turn first, causing a slight delay depending on their turn rate.",
    "Hood of Defiance's barrier blocks damage over time, meaning that it will prevent items like Radiance from resetting Blink Dagger's cooldown.",
    "Use Blink to dodge incoming projectile-based spells such as Storm Hammer or Spirit Lance, and from items like Rod of Atos."
  ],
  "attrs": [
    "Active Blink",
    "Disassemble? No",
    "Alert allies? No"
  ]
}