{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Bloodstone_Bloodpact.mp3\/revision\/latest?cb=20191227195357",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания владельца.",
        "Проверяет ману заклинателя при применении и дает соответствующую ей регенерацию здоровья. То есть значение регенерации не обновляется после применения и остается неизменным всю длительность действия. Повторное применение обновляет длительность, но не значение регенерации.",
        "То есть значение регенерации не обновляется после применения и остается неизменным всю длительность действия.",
        "Повторное применение обновляет длительность, но не значение регенерации.",
        "Восстанавливает здоровье в виде регенерации, излечивая 1.5% от максимальной маны с интервалом в 0,1 секунды."
      ],
      "mana": "30% от макс. запаса маны",
      "abilityName": "Bloodpact",
      "cooldown": null,
      "description": "Превращает 30% от максимального запаса маны в здоровье в течение 2 секунд.",
      "params": [
        "Длительность: 2"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "При наличии нескольких Bloodstone, предмет, занимающий приоритетнейший слот в инвентаре, получает заряды. Верхний левый слот инвентаря имеет наивысший приоритет, правый нижний — наименьший.",
        "Верхний левый слот инвентаря имеет наивысший приоритет, правый нижний — наименьший.",
        "Эффекты зарядов от всех имеющихся у владельца Bloodstone складываются.",
        "Получает заряд, если вражеский герой умирает в радиусе или владелец совершает убийство на любом расстоянии.",
        "Если в команде у нескольких героев есть Bloodstone, то каждый получит заряд от одной и той же смерти врага.",
        "Каждый заряд регенерирует до 12 маны в минуту.",
        "Bloodstone теряет 3 заряда при смерти владельца. Число зарядов не может опуститься ниже 0.",
        "Заряды не пропадают, если владелец воскрес."
      ],
      "mana": null,
      "abilityName": "Mana Battery",
      "cooldown": null,
      "description": "Каждый заряд увеличивает восстановление маны на 0,2 и урон от способностей на 0,35%. Изначально предмет имеет 14 зарядов. Получает 1 заряд за каждое убийство рядом. При смерти владельца теряет 3 заряда.",
      "params": [
        "Радиус получения заряда: 1600",
        "Зарядов за смерть врага: 1",
        "Теряется зарядов при смерти: 3",
        "Регенерации маны за заряд: 0,2",
        "Усиления урона заклинаний за заряд: 0,35%"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Вампиризм заклинаний от нескольких Octarine Core не складывается.",
        "Лечение идет от любого урона заклинаний, наносимого владельцем (с некоторыми исключениями) вражеским или союзным существам.",
        "Лечение не идет от урона, нанесённого строениям, вардам или самому себе.",
        "Лечение от всех трёх типов урона и от большинства мгновенно убивающих эффектов.",
        "Лечение от урона применяется после всех уменьшений.",
        "Для лечения источником урона должен быть владелец. Урон, нанесенный призываемыми существами (включая варды), не лечит."
      ],
      "mana": null,
      "abilityName": "Spell Lifesteal",
      "cooldown": null,
      "description": "Даёт магический вампиризм, который восстанавливает здоровье за наносимый способностями урон. Восстанавливает здоровье в размере 15% от урона по героям и 3% от урона по крипам.",
      "params": [
        "Вампиризм от героев: 15%",
        "Вампиризм от крипов: 3%"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 425 здоровья, 617 маны, 0,8 регенерации маны и 8% урона от способностей.",
    "Для героев ловкости, даёт 425 здоровья, 617 маны, 0,8 регенерации маны и 8% урона от способностей.",
    "Для героев интеллекта, даёт 425 здоровья, 617 маны, 0,8 регенерации маны, 8% урона от способностей и 16 урона от атаки.",
    "Усиление урона заклинаний от нескольких предметов, содержащих Kaya ( Kaya, Kaya and Sange, Yasha and Kaya, Bloodstone) не складывается.",
    "Усиление регенерация маны от нескольких предметов, содержащих Kaya, складывается, за исключением нескольких Bloodstone.",
    "Усиление вампиризма заклинаний от нескольких предметов, содержащих Kaya, складывается по закону убывающей полезности.",
    "Bloodstone нельзя положить в ранец."
  ],
  "cost": "5950",
  "lore": null,
  "consistFrom": [
    "Kaya",
    "Soul Booster",
    "Voodoo Mask"
  ],
  "boughtFrom": "Броня",
  "name": "Bloodstone",
  "description": "Багрянец этого камня легко приметить даже в разгаре битвы: он будто бы наделяет владельца безграничными жизненными и духовными силами.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+16 к интеллекту",
    "+425 к здоровью",
    "+425 к мане",
    "+8% к урону способностей",
    "+15 (герои)\/3 (крипы)% к вампиризму заклинаний",
    "+100% к усилению регенерации маны",
    "+30% к усилению вампиризма от способностей"
  ],
  "tips": null
}