{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Pangolier: 360 здоровья и 1,8 восстановления здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−25 сек. перезарядки Rolling Thunder",
          "talentRight": "−2,5 сек. перезарядки Swashbuckle"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+18 к силе",
          "talentRight": "+30 к урону за удар Swashbuckle"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+3 сек. к длительности Rolling Thunder",
          "talentRight": "В Rolling Thunder способность Shield Crash перезаряжается 2,5 сек."
        },
        {
          "talentLvl": "10",
          "talentLeft": "+400 к дальности ударов Swashbuckle",
          "talentRight": "+1,5 маны в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Pangolier_Swashbuckle.mp3\/revision\/latest?cb=20191216021540",
      "effects": [
        "Способность Направленная на точку \/ Направленная по вектору",
        "Действует на Врагов \/ Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Использование Swashbuckler во время действия Rolling Thunder моментально отменит последнюю.",
        "Pangolier отскакивает в указанную область со скоростью 2000, проскакивая через непроходимую территорию и деревья.",
        "После отскока Pangolier совершает 4 удара в выбранном направлении. Атаки совершаются с интервалом в 0,1 секунды сразу после достижении выбранной точки, тратя 0,3 сек. на их нанесение.",
        "Атаки совершаются с интервалом в 0,1 секунды сразу после достижении выбранной точки, тратя 0,3 сек. на их нанесение.",
        "Во время рывка и нанесения 4 атак Pangolier оглушен и не может совершать иные действия.",
        "Позволяет Pangolier совершать мгновенные атаки по всем пораженным врагам. На атаки могут сработать любые модификаторы атаки (включая Lucky Shot) на все пораженные цели. У них эффект атаки без промаха и они не могут промахнутся. Также они игнорируют обезоруживание. При срабатывании Echo Sabre наносит удары по всем целям без ухода на перезарядку. Swashbuckle не активирует блокировку урона. Эффект прорубания основывается на позиции пораженных врагов, нанося урон в трапецевидной области, которая противоположна изначальному направлению атаки. Вопреки звуковым эффектам удары не поражают существ в призрачной форме, поэтому на них модификаторы атаки не срабатывают. Также способность совершает мгновенные атаки по всем врагам, через которых Pangolier пролетел.",
        "На атаки могут сработать любые модификаторы атаки (включая Lucky Shot) на все пораженные цели. У них эффект атаки без промаха и они не могут промахнутся. Также они игнорируют обезоруживание.",
        "При срабатывании Echo Sabre наносит удары по всем целям без ухода на перезарядку.",
        "Swashbuckle не активирует блокировку урона.",
        "Эффект прорубания основывается на позиции пораженных врагов, нанося урон в трапецевидной области, которая противоположна изначальному направлению атаки.",
        "Вопреки звуковым эффектам удары не поражают существ в призрачной форме, поэтому на них модификаторы атаки не срабатывают.",
        "Также способность совершает мгновенные атаки по всем врагам, через которых Pangolier пролетел.",
        "Приравнивает значение атаки Pangolier к значению способности. То есть бонусы или уменьшение урона игнорируются. Предметы, у которых фиксированный урон наносится при срабатывании (например, Skull Basher или Javelin), продолжают наносить его.",
        "Предметы, у которых фиксированный урон наносится при срабатывании (например, Skull Basher или Javelin), продолжают наносить его.",
        "Все удары наносят до 96\/168\/240\/312 (TagTalent 216\/288\/360\/432) урона каждому задетому врагу (до уменьшений). Выбор таланта на дополнительный урон во время использования мгновенно обновит значение урона для оставшихся ударов.",
        "Выбор таланта на дополнительный урон во время использования мгновенно обновит значение урона для оставшихся ударов.",
        "После рывка удары задевают существ на расстоянии до 1125 (TagTalent 1525) единиц от Pangolier. При использовании максимальной дальности применения задевает существ на расстоянии до 1975 (TagTalent 2375) единиц от основного места использования.",
        "При использовании максимальной дальности применения задевает существ на расстоянии до 1975 (TagTalent 2375) единиц от основного места использования."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "20\/16\/12\/8 (TagTalent 17,5\/13,5\/9,5\/5,5)",
      "description": "Векторное применение. Герой отскакивает в указанную сторону, а затем рассекает всех врагов в выбранном направлении несколькими ударами шпаги. Может активировать способность Lucky Shot.",
      "spellName": "Swashbuckle",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 850",
        "Дальность ударов: 1000 (TagTalent 1400)",
        "Ширина ударов: 125",
        "Урон за удар: 24\/42\/60\/78 (TagTalent 54\/72\/90\/108)",
        "Ударов: 4",
        "Интервал ударов: 0,1"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Pangolier_Shield_Crash_1.mp3\/revision\/latest?cb=20191216021538",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Pangolier прыгает вперед на расстояние 15%\/16%\/17%\/18% единиц и вверх на 250 единиц. Пока герой в воздухе, под ним могут проходить другие существа.",
        "При прыжке Pangolier оглушен и не может совершать иные действия. При использовании с активной Rolling Thunder герой не обезвреживается.",
        "Фактическая длина прыжка зависит от ландшафта: если прыжок совершается на более высокую\/низкую область, то он будет короче\/длиннее. Это не влияет на дальность прыжка.",
        "Урон по области наносится всем врагам, но бафф учитывает только вражеских героев. Бафф не учитывает иллюзии, но учитывает клонов. Считает крипов-героев за крипов.",
        "Бафф не учитывает иллюзии, но учитывает клонов. Считает крипов-героев за крипов.",
        "Применяет обычное уменьшение входящего урона к Pangolier. Аддитивно складывается с другими источниками манипуляции входящим уроном. Влияет на любой получаемый Pangolier урон, не отмеченный как отнимающий здоровье.",
        "Влияет на любой получаемый Pangolier урон, не отмеченный как отнимающий здоровье.",
        "Здесь указано, сколько уменьшения урона получит Pangolier за определенное число задетых героев на каждом уровне способности. Уровень 1: 15%\/30%\/45%\/60%\/75% Уровень 2: 16%\/32%\/48%\/64%\/80% Уровень 3: 17%\/34%\/51%\/68%\/85% Уровень 4: 18%\/36%\/54%\/72%\/90%",
        "Уровень 1: 15%\/30%\/45%\/60%\/75%",
        "Уровень 2: 16%\/32%\/48%\/64%\/80%",
        "Уровень 3: 17%\/34%\/51%\/68%\/85%",
        "Уровень 4: 18%\/36%\/54%\/72%\/90%",
        "",
        "Визуальный эффект (пять кружащихся щитов) вокруг Pangolier имеет три различные анимации, зависящие от того, сколько врагов задела способность. При поражении одного или двух врагов 5 щитов маленькие и у них нет дополнительных эффектов. При поражении трех врагов щиты становятся больше и начинают испускать желтый эффект, похожий на пламя. При поражении четырех или более врагов желтое пламя пылает еще сильнее.",
        "При поражении одного или двух врагов 5 щитов маленькие и у них нет дополнительных эффектов.",
        "При поражении трех врагов щиты становятся больше и начинают испускать желтый эффект, похожий на пламя.",
        "При поражении четырех или более врагов желтое пламя пылает еще сильнее.",
        "При повторном использовании с действущим баффом сам бафф и сопротивление урону обновятся (причем сопротивление урону повышает значение, если вражеских героев стало больше, но не уменьшает, если их стало меньше).",
        "Если Pangolier оглушили во время прыжка, то при приземлении он не нанесет урон и не получит бафф сопротивления.",
        "Во время Rolling Thunder и Roll Up Shield Crash перемещает героя только по оси z (вертикальное движение) и не может перемещать по осям x и y (по горизонтали). При этом, поскольку вертикальное и горизонтальное перемещение складываются друг с другом, то оно не мешает заклинаниям, которые перемещают Pangolier по осям x и y. То есть, при использовании с активной Rolling Thunder герой прыгает по дуге, используя высоту прыжка и скорость Rolling Thunder. Если Rolling Thunder или Roll Up завершаются во время прыжка Shield Crash, то их длительность продлевается на длительность прыжка, поэтому скорость сохраняется до приземления. Но если Rolling Thunder или Roll Up во время прыжка завершили вручную (с помощью вспомогательных способностей), то скорость не сохраняется и Pangolier резко падает вниз. Во время Rolling Thunder и Roll Up остаточная анимация равна 0,54.",
        "При этом, поскольку вертикальное и горизонтальное перемещение складываются друг с другом, то оно не мешает заклинаниям, которые перемещают Pangolier по осям x и y.",
        "То есть, при использовании с активной Rolling Thunder герой прыгает по дуге, используя высоту прыжка и скорость Rolling Thunder.",
        "Если Rolling Thunder или Roll Up завершаются во время прыжка Shield Crash, то их длительность продлевается на длительность прыжка, поэтому скорость сохраняется до приземления.",
        "Но если Rolling Thunder или Roll Up во время прыжка завершили вручную (с помощью вспомогательных способностей), то скорость не сохраняется и Pangolier резко падает вниз.",
        "Во время Rolling Thunder и Roll Up остаточная анимация равна 0,54.",
        "С Aghanim's Scepter при использовании способности (а не при приземлении) мгновенно активируется Swashbuckle. Положение эффекта фиксируется при применении и не следует за Pangolier. Угол определяется стороной, куда смотрит герой, а остальные удары располагаются под углом 90° друг к другу. Примечания к Swashbuckle полностью применимы. Если способность не изучена, то она не будет применяться.",
        "Положение эффекта фиксируется при применении и не следует за Pangolier.",
        "Угол определяется стороной, куда смотрит герой, а остальные удары располагаются под углом 90° друг к другу.",
        "Примечания к Swashbuckle полностью применимы. Если способность не изучена, то она не будет применяться."
      ],
      "mana": "75\/85\/95\/105",
      "hotKey": "W",
      "cooldown": "16\/14\/12\/10 (TagTalent 2,5)",
      "description": "Герой прыгает вперёд и бьётся спиной о землю, нанося урон всем врагам неподалёку и замедляя их. За каждого задетого противника он получает эффект, ненадолго снижающий получаемый урон. Если применить эту способность во время действия Rolling Thunder, движение не прекратится, а герой перепрыгнет через любые препятствия.",
      "spellName": "Shield Crash",
      "params": [
        "Анимация применения: 0+0,37",
        "Радиус: 500",
        "Дальность прыжка: 225",
        "Урон: 90\/160\/230\/300",
        "Снижение урона за героя: 15%\/16%\/17%\/18%",
        "Замедление: 20%\/25%\/30%\/35%",
        "Длительность уменьшения урона: 5\/7\/9\/11",
        "Длительность замедления: 3",
        "Длительность прыжка: 0,4",
        "Длительность прыжка с Rolling Thunder: 0,75",
        "Число атак от Swashbuckle: 2",
        "Угол Swashbuckle: 90°",
        "Добавляет к прыжку атаки от способности Swashbuckle в четырёх направлениях.",
        "Под действием эффектов оцепенения или привязки способность активируется без перемещения заклинателя."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6d\/Pangolier_Lucky_Shot_1.mp3\/revision\/latest?cb=20191216021545",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Повторные срабатывания на одну и ту же цель не складываются, но обновляют длительность.",
        "Lucky Shot использует псевдослучайное распределение"
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой бросает кости, оставляя врагов на милость судьбы. Даёт шанс наложить на цель атаки бессилие и уменьшить её броню.",
      "spellName": "Lucky Shot",
      "params": [
        "Шанс срабатывания: 17%",
        "Уменьшение брони: 4\/5\/6\/7",
        "Длительность: 2\/3\/4\/5"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Pangolier_Roll_Up_1.mp3\/revision\/latest?cb=20210102183513",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Дает невосприимчивость к магии на всю длительность и применяет базовое развеивание при использовании.",
        "Для лучшего понимания скорость поворота в Roll Up указывается в градусах в секунду вместо радианов в 0,03 секунды. 175° градусов в секунду равны скорости поворота в 0,092.",
        "175° градусов в секунду равны скорости поворота в 0,092.",
        "Pangolier не катится во время Roll Up, пока по нему не попадет атака героя (включая иллюзии и клонов, но исключая крипов-героев). В этом случае он катится 0,75 сек. в противоположном направлении от текущего местоположения атаковавшего героя. Поведение во время движения идентично Rolling Thunder, включая столкновение с непроходимой территорией. Во время движения Roll Up отталкивает, наносит урон, оглушает, используя значения Rolling Thunder.",
        "В этом случае он катится 0,75 сек. в противоположном направлении от текущего местоположения атаковавшего героя.",
        "Поведение во время движения идентично Rolling Thunder, включая столкновение с непроходимой территорией.",
        "Во время движения Roll Up отталкивает, наносит урон, оглушает, используя значения Rolling Thunder.",
        "Shield Crash во время Roll Up действует так же, как и во время Rolling Thunder.",
        "Roll Up можно использовать во время Rolling Thunder без прерывания. После применения останавливает движение и применение эффектов Rolling Thunder. Её длительность так же приостанавливается. Применение Rolling Thunder мгновенно прерывает действие активной Roll Up.",
        "После применения останавливает движение и применение эффектов Rolling Thunder. Её длительность так же приостанавливается.",
        "Применение Rolling Thunder мгновенно прерывает действие активной Roll Up.",
        "Применение любой другой способности или предмета немедленно прекращает действие Roll Up."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "30",
      "description": "Герой сворачивается в неподвижный защитный шар на секунды, получая невосприимчивость к магии и не теряя возможность поворачиваться. Эту способность можно применять во время действия Rolling Thunder, чтобы на время затормозить. Во время действия Roll Up можно применять и Rolling Thunder, и Shield Crash. Если атаковать свернувшегося в шар героя, он будет катиться от нападающих 0,75 сек. с теми же уроном и оглушением, что и у Rolling Thunder. Перезарядка: 30 секунд.",
      "spellName": "Roll Up",
      "params": [
        "Анимация применения: 0,1+1,03",
        "Скорость разворота в градусах в секунду: 175°",
        "Длительность движения от атаки: 0,75",
        "Длительность: 4",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Заменяет Roll Up до использования вспомогательной способности или до завершения длительности."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Развернуться из защитного шара.",
      "spellName": "End Roll Up",
      "params": [
        "Анимация применения: 0+0",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Pangolier_Rolling_Thunder_1.mp3\/revision\/latest?cb=20191216021535",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Применяет к герою невосприимчивость к магии на всю длительность и базовое развеивание при использовании.",
        "Во время Rolling Thunder заклинателю не нужно поворачиваться для применения заклинаний или предметов.",
        "Для лучшего понимания скорость поворота в Rolling Thunder указывается в градусах в секунду вместо радианов в 0,03 секунды. 120° в секунду равны скорости поворота в 0,063. Скорость поворота возрастает до 165° при запуске, столкновении с возвышенностью или стеной или приземлении после использования Shield Crash. Ускорение длится 0,25 секунд. На это время скорость разворота увеличивается до 0,149.",
        "120° в секунду равны скорости поворота в 0,063.",
        "Скорость поворота возрастает до 165° при запуске, столкновении с возвышенностью или стеной или приземлении после использования Shield Crash.",
        "Ускорение длится 0,25 секунд. На это время скорость разворота увеличивается до 0,149.",
        "Pangolier поворачивается максимсимум за 1 секунду за полученный приказ на перемещение. То есть один приказ не перемещает героя вокруг выбранной точки. Окончательный путь и направление движения Pangolier зависит от вектора позиции героя до выбранной точки, который всегда параллелен пути.",
        "Окончательный путь и направление движения Pangolier зависит от вектора позиции героя до выбранной точки, который всегда параллелен пути.",
        "При столкновении с непроходимой территорией Pangolier останавливается на 0,2 секунды и начинает катится в сторону направления, откуда он двигался. Способность также может сталкиваться с препятствиями, создаваемыми Power Cogs, Fissure и Ice Shards. При столкновении с деревьями они мгновенно разрушаются, а Pangolier продолжает катиться без остановки. Герой не сталкивается с постройками или вардами, а просто прокатывается сквозь них.",
        "Способность также может сталкиваться с препятствиями, создаваемыми Power Cogs, Fissure и Ice Shards.",
        "При столкновении с деревьями они мгновенно разрушаются, а Pangolier продолжает катиться без остановки.",
        "Герой не сталкивается с постройками или вардами, а просто прокатывается сквозь них.",
        "Скорость, с которой герой катится, фиксированная и её нельзя ничем изменить.",
        "Любой враг (за исключением Рошана), оказавшийся в 150 единицах от Pangolier, получит урон, будет отброшен и оглушен. Урон и отбрасывание применяются мгновенно при соприкосновении. Оглушение применяется сразу же после отбрасывания, несмотря на то, что отбрасывание так же обезвреживает врагов. Врагов отбрасывает на 150 единиц от Pangolier за 0,4 сек. Способность может отбросить врагов на непроходимую территорию. То есть в итоге обезвреживание длится 1,4\/1,65\/1,9 сек. Дебафф предотвращает повторное получение удара от Rolling Thunder. Его длительность равна сумме длительность отбрасывания и оглушения и не может быть ничем изменено.",
        "Урон и отбрасывание применяются мгновенно при соприкосновении. Оглушение применяется сразу же после отбрасывания, несмотря на то, что отбрасывание так же обезвреживает врагов.",
        "Врагов отбрасывает на 150 единиц от Pangolier за 0,4 сек. Способность может отбросить врагов на непроходимую территорию.",
        "То есть в итоге обезвреживание длится 1,4\/1,65\/1,9 сек.",
        "Дебафф предотвращает повторное получение удара от Rolling Thunder. Его длительность равна сумме длительность отбрасывания и оглушения и не может быть ничем изменено.",
        "Rolling Thunder сначала наносит урон, затем применяет дебаффы."
      ],
      "mana": "100\/150\/200",
      "hotKey": "R",
      "cooldown": "70 (TagTalent 45)",
      "description": "Герой сворачивается в невосприимчивый к магии шар и катится с увеличенной скоростью, проходя сквозь деревья, но поворачиваясь медленнее обычного. Шар отталкивает задетых врагов, а когда они приземляются — наносит им урон и оглушает. Столкнувшись со стеной или уступом, шар после небольшой задержки покатится в обратную сторону. ТИП РАЗВЕИВАНИЯ: нормальное",
      "spellName": "Rolling Thunder",
      "params": [
        "Анимация применения: 1,2+0",
        "Радиус столкновения: 150",
        "Урон: 180\/260\/340",
        "Скорость шара: 550",
        "Скорость разворота в градусах в секунду: 120°",
        "Ускорение разворота после применения\/прыжка\/отскока: 165°",
        "Дальность толчка: 150",
        "Длительность отталкивания врага: 0,4",
        "Длительность оглушения врага: 1\/1,25\/1,5",
        "Длительность: 10 (TagTalent 13)",
        "Дарует новую способность: Roll Up."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/ce\/Rolling_Thunder_end.mp3\/revision\/latest?cb=20171104032006",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Заменяет Rolling Thunder на время её действия или до использования."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Стоять!",
      "spellName": "Stop Rolling",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 17.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 3.2,
    "attrAgility": 18.0
  },
  "description": "Донтé Панлин, Pangolier — герой с ближним типом атаки и основной характеристикой ловкость. Swashbuckle — одна из самых значимых способностей героя, использующая направление по вектору. После её активации, Донтé отскакивает в указанную сторону, а после атакует попавших под направление врагов несколькими быстрыми ударами. Shield Crash наносит урон по области и позволяет Pangolier ненадолго снизить получаемый урон за каждого задетого противника. Пассивная способность Lucky Shot даёт шанс обезоружить и снизить показатель брони врага, а также замедлить скорость его передвижения. При помощи ультимативной способности Rolling Thunder герой сворачивается в невосприимчивый к магии шар, который ценой замедленной скорости поворота оглушает, отталкивает и наносит урон всем врагам, которых встречает на пути. Способность также можно остановить преждевременно через Stop Rolling.",
  "history": "Дамы и господа, что зовутся Ниванскими франтами, живут фехтованием, гуляньями и помпезной романтикой. И пусть все они держатся своего кредо — «Достойна лишь та жизнь, что полна приключений», — подвиги Донтé Панлина вскружат голову даже самому праздному мастеру клинка. Он сразит любое чудище. Расположит к себе кого угодно. Восстанет против каждого тирана. И никакой чин не устоит перед его сладкими речами.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−25 сек. перезарядки Rolling Thunder",
      "talentRight": "−2,5 сек. перезарядки Swashbuckle"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+18 к силе",
      "talentRight": "+30 к урону за удар Swashbuckle"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+3 сек. к длительности Rolling Thunder",
      "talentRight": "В Rolling Thunder способность Shield Crash перезаряжается 2,5 сек."
    },
    {
      "talentLvl": "10",
      "talentLeft": "+400 к дальности ударов Swashbuckle",
      "talentRight": "+1,5 маны в секунду"
    }
  ]
}