{
  "abilities": [
    {
      "notes": [
        "Талант на \/ \/ все атрибуты в общем даёт Juggernaut: 100 здоровья, 0,5 восстановления здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 восстановления маны и 5 урона от атаки.",
        "Талант на броню не дается иллюзиям.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 сек. длительности Omnislash",
          "talentRight": "+475 к здоровью"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+160 к урону в секунду от Blade Fury",
          "talentRight": "+8 к броне"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 к скорости атаки",
          "talentRight": "−20 сек. перезарядки Healing Ward"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+75 к радиусу Blade Fury",
          "talentRight": "+5 ко всем атрибутам"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Juggernaut_Blade_Fury_1.mp3\/revision\/latest?cb=20191216014540",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический Мгновенная атака"
      ],
      "notes": [
        "Blade Fury нельзя использовать во время действия Omnislash и Swiftslash.",
        "При использовании не прерывает произносимые способности Juggernaut.",
        "При использовании применяет иммунитет к заклинаниям на всю длительность и базовое развеивание. Пока действует способность, Juggernaut не может подвергнутся действию призначной формы. Бафф от него будет мгновенно снят.",
        "Пока действует способность, Juggernaut не может подвергнутся действию призначной формы. Бафф от него будет мгновенно снят.",
        "Juggernaut может продолжать атаковать, использовать способности и предметы во время действия способности, но при этом Omnislash и Swiftslash неактивны и их нельзя применить, пока действует Blade Fury.",
        "Обычные атаки, совершенные в момент действия способности, наносят 0 урона существам, за исключением вардов и построек. Модификаторы атаки, такие, как Monkey King Bar, Diffusal Blade или Skull Basher, продолжат применять свои эффекты и урон при срабатывании. Поскольку прорубающий удар основан на значении урона героя, он продолжит наносить урон в области прорубания даже во время действия способности. С другой стороны, критический удар и вампиризм основаны на текущем наносимом уроне и поэтому не действуют (вопреки этому всплывающие красные цифры критического урона и частицы от вампиризма продолжают показываться).",
        "Модификаторы атаки, такие, как Monkey King Bar, Diffusal Blade или Skull Basher, продолжат применять свои эффекты и урон при срабатывании.",
        "Поскольку прорубающий удар основан на значении урона героя, он продолжит наносить урон в области прорубания даже во время действия способности.",
        "С другой стороны, критический удар и вампиризм основаны на текущем наносимом уроне и поэтому не действуют (вопреки этому всплывающие красные цифры критического урона и частицы от вампиризма продолжают показываться).",
        "Наносит 18\/23\/28\/33 (TagTalent 50\/55\/60\/65) единиц урона с интервалом в 0,2 сек. спустя 0,2 сек. после применения, нанося урон 25 раз. Может нанести до 450\/575\/700\/825 (TagTalent 1250\/1375\/1500\/1625) единиц урона одному юниту (до учета сопротивления).",
        "Может нанести до 450\/575\/700\/825 (TagTalent 1250\/1375\/1500\/1625) единиц урона одному юниту (до учета сопротивления).",
        "При улучшении с Aghanim's Shard, Juggernaut начинает наносить мгновенные атаки по случайным целям каждые 1, начиная спустя 0,2 секунды после применения, в результате срабатывая 4 раз. На эти мгновенные атаки могут сработать любые модификаторы атаки. Они не имеют эффекта True Strike, но полностью игнорируют обезоруживание. Мгновенные атаки выбирают случайные цели, они не имеют никаких приоритетов. Не могу сработать на варды и постройки. В отличие от обычных атак во время действия Blade Fury, мгновенные атаки наносят Общий урон × 75%, вместо 0. Так как урон мгновенных атак исходит от обычных атак, он считается за урон от атаки и может быть снижен блокировкой урона.",
        "На эти мгновенные атаки могут сработать любые модификаторы атаки. Они не имеют эффекта True Strike, но полностью игнорируют обезоруживание.",
        "Мгновенные атаки выбирают случайные цели, они не имеют никаких приоритетов. Не могу сработать на варды и постройки.",
        "В отличие от обычных атак во время действия Blade Fury, мгновенные атаки наносят Общий урон × 75%, вместо 0.",
        "Так как урон мгновенных атак исходит от обычных атак, он считается за урон от атаки и может быть снижен блокировкой урона."
      ],
      "mana": "120\/110\/100\/90",
      "item_behaviour": [],
      "name": "Blade Fury",
      "cooldown": "42\/34\/26\/18",
      "description": "Герой крутится в вихре сокрушительных ударов клинком, становясь невосприимчивым к магии и нанося урон врагам поблизости.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 260 (TagTalent 335)",
        "Урон в секунду: 90\/115\/140\/165 (TagTalent 250\/275\/300\/325)",
        "Длительность: 5",
        "Доп. скорость передвижения: 100",
        "Урон от мгновенных атак: 75%",
        "Интервал мгновенных атак: 1",
        "Под действием способности её владелец получает 100 к скорости передвижения и каждую секунду атакует случайного врага неподалёку, нанося 75% урона."
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Juggernaut_Healing_Ward.mp3\/revision\/latest?cb=20191216014542",
      "effects": [
        "Способность Направленная на область \/ Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "После применения вард сразу следует за Juggernaut, если ему не была отдана другая команда.",
        "Восстановление представлена в виде ауры. Бафф лечения задерживается на 2,5 сек.",
        "Лечение представлено в виде восстановления здоровья, поэтому вард восстанавливает 0,2%\/0,3%\/0,4%\/0,5% от максимального запаса здоровья с интервалом в 0,1 сек. Может вылечить до 55%\/82,5%\/110%\/137,5% от максимального здоровья существа (складывается из длительности варда и задержки баффа). Полностью излечивает существ за 50\/33,33\/25\/20 секунд.",
        "Может вылечить до 55%\/82,5%\/110%\/137,5% от максимального здоровья существа (складывается из длительности варда и задержки баффа).",
        "Полностью излечивает существ за 50\/33,33\/25\/20 секунд.",
        "Ауры от нескольких Healing Ward не складываются.",
        "Не работает на варды, постройки неуязвимых и спрятанных существ."
      ],
      "mana": "140",
      "item_behaviour": [],
      "name": "Healing Ward",
      "cooldown": "60 (TagTalent 40)",
      "description": "Призывает тотем, лечащий всех союзников неподалёку и передвигающийся со скоростью 325. Объём лечения зависит от максимального здоровья союзника. Действует 25 сек.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: 350",
        "Радиус: 500",
        "Лечение в секунду: 2%\/3%\/4%\/5%",
        "Длительность задержки ауры: 2,5",
        "Длительность: 25"
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Juggernaut_Blade_Dance.mp3\/revision\/latest?cb=20191216014552",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Усиливает урон атаки в среднем на 16%\/20%\/24%\/28%.",
        "Выпадение критического удара определяется при замахе, а не при нанесении удара. Когда срабатывает критический удар, Juggernaut использует особую анимацию атаки, появляются визуальные эффекты вокруг его оружия.",
        "Когда срабатывает критический удар, Juggernaut использует особую анимацию атаки, появляются визуальные эффекты вокруг его оружия.",
        "Шанс срабатывания от нескольких источников критического удара сочетается. Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора.",
        "Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора.",
        "Шанс использует псевдо-случайное распределение."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Blade Dance",
      "cooldown": null,
      "description": "Дает герою шанс нанести атакой критический урон.",
      "hot_key": "E",
      "params": [
        "Шанс: 20%\/25%\/30%\/35%",
        "Критический урон: 180%",
        "Красные цифры критического удара указаны до учета урона иллюзий и брони."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c5\/Juggernaut_Swiftslash.mp3\/revision\/latest?cb=20200419153429",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Требуется Aghanim's Scepter для разблокирования способности.",
        "Не требует изученного Omnislash для разблокирования, открывается сразу после покупки Aghanim's Scepter. Однако если Juggernaut использует заклинание, не изучив Omnislash, способность ничего не сделает, но потратит ману и уйдёт на перезарядку.",
        "Однако если Juggernaut использует заклинание, не изучив Omnislash, способность ничего не сделает, но потратит ману и уйдёт на перезарядку.",
        "Все примечания к Omnislash также относятся к Swiftslash.",
        "Swiftslash имеет синие частицы при применении, в отличие от оранжевых частиц Omnislash."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Swiftslash",
      "cooldown": "15",
      "description": "Герой применяет короткую версию Omnislash.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальности применения: 650",
        "",
        "",
        "",
        "",
        "Длительность: 0,8",
        "Блокируется только первый удар.",
        ""
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Juggernaut_Omnislash.mp3\/revision\/latest?cb=20191216014545",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Применяет базовое развеивание при использовании и даёт Juggernaut неуязвимость,иммунитет к заклинаниям и оцепенение и на всю длительность.",
        "Juggernaut может продолжать использовать способности и предметы в течение действия Omnislash, но при этом Blade Fury неактивна и её нельзя применить, пока действует Omnislash. Пока действует способность, Juggernaut не нужно разворачиваться для применения направленных способностей или предметов.",
        "Пока действует способность, Juggernaut не нужно разворачиваться для применения направленных способностей или предметов.",
        "Интервал атак равен текущей скорости атаки Juggernaut, поделённой на 1,5. То есть минимальный и максимальный возможный интервал для Juggernaut равны 0,087 и 3,03, учитывая максимальную и минимальную скорость атаки. Интервал не устанавливается при применении. С каждым прыжком он адаптируется к текущей скорости атаки героя.",
        "То есть минимальный и максимальный возможный интервал для Juggernaut равны 0,087 и 3,03, учитывая максимальную и минимальную скорость атаки.",
        "Интервал не устанавливается при применении. С каждым прыжком он адаптируется к текущей скорости атаки героя.",
        "Позволяет совершать мгновенные атаки по целям прыжков. Мгновенные атаки могут активировать модификаторы атаки. Мгновенные атаки игнорируют обезоруживание, но не обладают эффектом True Strike.",
        "Мгновенные атаки могут активировать модификаторы атаки.",
        "Мгновенные атаки игнорируют обезоруживание, но не обладают эффектом True Strike.",
        "Не считает целями и не прыгает по вардам, курьерам и постройкам. Не может выбрать, но может прыгать по древним крипам. Может прыгать на неуязвимых существ, но, поскольку Juggernaut атакует цели, неуязвимые (и в призрачной форме) цели не получат урон. Не может перепрыгнуть на существ в тумане войны, невидимых или спрятанных существ, Zombies и на Astral Spirit.",
        "Может прыгать на неуязвимых существ, но, поскольку Juggernaut атакует цели, неуязвимые (и в призрачной форме) цели не получат урон.",
        "Не может перепрыгнуть на существ в тумане войны, невидимых или спрятанных существ, Zombies и на Astral Spirit.",
        "Если поблизости нет подходящих целей в течение 0,15 сек после предыдущего прыжка, способность преждевременно завершается.",
        "С каждым прыжком Juggernaut появляется на противоположной стороне от своей позиции около цели. Радиус прыжков закреплен за Juggernaut, а не за текущей целью.",
        "Радиус прыжков закреплен за Juggernaut, а не за текущей целью.",
        "Дает летающий обзор в радиусе 200 единиц вокруг цели на 1 секунду с каждым ударом.",
        "Повторное применение способности при уже действующей способности отменит предыдущую и начнёт новую. Это также работает с применением Swiftslash во время действия Omnislash и наоборот.",
        "Это также работает с применением Swiftslash во время действия Omnislash и наоборот.",
        "Камера игрока фиксируется на Juggernaut при применении и двигается за его положением, пока действует способность."
      ],
      "mana": "200\/275\/350",
      "item_behaviour": [],
      "name": "Omnislash",
      "cooldown": "140",
      "description": "Герой прыгает к указанному врагу, а затем с повышенной скоростью атакует его и ближайших противников. На время действия способности герой становится неуязвимым.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 350",
        "Радиус прыжков: 425",
        "Множитель скорости атаки: 1,5",
        "Дополнительный урон: 30\/40\/50",
        "Доп. скорость атаки: 40",
        "Длительность: 3\/3,25\/3,5 (TagTalent 4\/4,25\/4,5)",
        "Дарует новую способность: Swiftslash.",
        "Блокируется только первый удар."
      ],
      "legacy_key": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 20.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.8,
    "attrAgility": 34.0
  },
  "description": "Juggernaut или Юрнеро — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Blade Fury, вызывает вихрь из сокрушительных ударов клинком вокруг Juggernaut, делая его невосприимчивым к магии и нанося урон врагам поблизости. Вторая способность, Healing Ward, призывает Healing Ward, лечащий всех союзников неподалеку и способный передвигаться. Скорость лечения зависит от максимального здоровья союзника. Пассивная способность, Blade Dance, дает Juggernaut шанс нанести критический урон при атаке. Ультимативной способностью, Omnislash, Juggernaut прыгает ко врагу, атакуя его, а затем врагов рядом с ним. При атаке Juggernaut становится неуязвимым. Покупка Aghanim's Scepter добавляет новую способность — Swiftslash, схожую с ультимативной, но отличающуюся меньшей длительностью и меньшей перезарядкой.",
  "history": "Никто никогда не видел лица, что скрыто за маской Юрнеро. Остаётся гадать, каков он на вид. Однажды Юрнеро бросил вызов нечистому на руку лорду и был изгнан с древнего острова Масок. Кара спасла ему жизнь: скорой ночью остров исчез под волнами, ведомыми мстительной магией. Лишь Юрнеро отныне хранит обычаи острова: древние ритуалы и искусство боя на мечах. Непоколебимость и мужество пришли к нему в нескончаемых упражнениях с клинком, а изобретательность в бою он укоренял, неутомимо испытывая себя. Как и лик воина, желания его остаются тайной. Он уже дважды терял всё, но сражается так, будто победа предрешена.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 сек. длительности Omnislash",
      "talentRight": "+475 к здоровью"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+160 к урону в секунду от Blade Fury",
      "talentRight": "+8 к броне"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 к скорости атаки",
      "talentRight": "−20 сек. перезарядки Healing Ward"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+75 к радиусу Blade Fury",
      "talentRight": "+5 ко всем атрибутам"
    }
  ]
}