{
  "abilities": [
    {
      "notes": [
        "Талант на все атрибуты в общем даёт Juggernaut: 100 здоровья, 0,5 регенерации здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 регенерации маны и 5 урона от атаки.",
        "Талант на броню не дается иллюзиям.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 сек. длительности Omnislash",
          "talentRight": "+475 к здоровью"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+140 к урону в сек. от Blade Fury",
          "talentRight": "+8 к броне"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 к скорости атаки",
          "talentRight": "Blade Fury даёт +100 к скорости передвижения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+5 ко всем атрибутам"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f5\/Blade_Fury.mp3\/revision\/latest?cb=20141201001724",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "При использовании не прерывает произносимые способности Juggernaut.",
        "При использовании применяет иммунитет к заклинаниям на всю длительность и базовое развеивание.",
        "Пока действует Blade Fury, Juggernaut не может подвергнутся действию Ghost Scepter. Бафф от него будет мгновенно снят.",
        "Juggernaut может продолжать атаковать, использовать способности и предметы в течение действия Blade Fury, но при этом Omnislash неактивен и его нельзя применить, пока действует Blade Fury.",
        "Обычные атаки, совершенные в момент действия Blade Fury не нанесут урон никаким юнитам, за исключением вардов и строений. Модификаторы атаки, такие, как Monkey King Bar, Diffusal Blade или Skull Basher, продолжат применять свои эффекты и урон при срабатывании. Поскольку прорубающий удар основан на значении урона героя, он продолжит наносить урон в области прорубания даже при действии Blade Fury. С другой стороны, критический удар и вампиризм основаны на текущем наносимом уроне и поэтому не действуют (вопреки этому всплывающие красные цифры критического урона и частицы от вампиризма продолжают показываться).",
        "Модификаторы атаки, такие, как Monkey King Bar, Diffusal Blade или Skull Basher, продолжат применять свои эффекты и урон при срабатывании.",
        "Поскольку прорубающий удар основан на значении урона героя, он продолжит наносить урон в области прорубания даже при действии Blade Fury.",
        "С другой стороны, критический удар и вампиризм основаны на текущем наносимом уроне и поэтому не действуют (вопреки этому всплывающие красные цифры критического урона и частицы от вампиризма продолжают показываться).",
        "Наносит 17\/22\/27\/32 (TagTalent 45\/50\/55\/60) единиц урона с интервалом в 0,2 секунды спустя 0,2 секунды после применения, нанося урон 25 раз.",
        "Может нанести до 425\/550\/675\/800 (TagTalent 1125\/1250\/1375\/1500) единиц урона одному юниту (до учета сопротивления)."
      ],
      "mana": "120\/110\/100\/90",
      "hotKey": "Q",
      "cooldown": "42\/34\/26\/18",
      "description": "Герой крутится в вихре сокрушительных ударов клинком, становясь невосприимчивым к магии и нанося урон врагам поблизости.",
      "spellName": "Blade Fury",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 250",
        "Доп. скорость передвижения: 0 (TagTalent 100)",
        "Урон в секунду: 85\/110\/135\/160 (TagTalent 225\/250\/275\/300)",
        "Длительность: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Умение Юрнеро обращаться с катаной внушает страх и воинам, и магам."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2c\/Healing_Ward.mp3\/revision\/latest?cb=20141201001749",
      "effects": [
        "Способность Направленная на область \/ Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "После применения вард сразу следует за Juggernaut, если ему не была отдана другая команда.",
        "Регенерация представлена в виде ауры. Бафф лечения задерживается на 2.5 секунды.",
        "Лечение представлено в виде регенерации здоровья, поэтому вард восстанавливает 0,2%\/0,3%\/0,4%\/0,5% от максимального запаса здоровья с интервалом в 0,1 секунду.",
        "Может вылечить до 55%\/82,5%\/110%\/137,5% от максимального здоровья юнита (складывается из длительности тотема и задержки баффа).",
        "Полностью излечивает юнитов за 50\/33,33\/25\/20 секунд.",
        "Ауры от нескольких Healing Ward не складываются.",
        "Не работает на варды и строения."
      ],
      "mana": "140",
      "hotKey": "W",
      "cooldown": "60",
      "description": "Призывает тотем, лечащий всех союзников неподалеку в течение 25 сек. и передвигающийся со скоростью 350. Скорость лечения зависит от максимального здоровья союзника.",
      "spellName": "Healing Ward",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: 350",
        "Радиус: 500",
        "Лечение в секунду: 2%\/3%\/4%\/5%",
        "Длительность задержки ауры: 2.5",
        "Длительность: 25"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Среди ритуалов, выученных на острове Масок, навык залечивания ран с толикой магии вуду оказался довольно полезным."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Blade_Dance.mp3\/revision\/latest?cb=20150210215856",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Усиливает урон атаки в среднем на 16%\/20%\/24%\/28%.",
        "Шанс срабатывания от нескольких источников критического удара сочетается. Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора.",
        "Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора.",
        "Blade Dance использует псевдо-случайное распределение.",
        "Звук и частицы появляются в начале удара, а не после."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Дает герою шанс нанести атакой критический урон.",
      "spellName": "Blade Dance",
      "params": [
        "Шанс: 20%\/25%\/30%\/35%",
        "Критический урон: 180%",
        "Красные цифры критического удара указаны до учета урона иллюзий и брони."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Как последний представитель своего культа, Юрнеро должен убедиться, что вы запомните стиль его боя."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Физический"
      ],
      "notes": [
        "Применяет базовое развеивание при использовании и делает Juggernaut неуязвимым и дает иммунитет к заклинаниям на всю длительность.",
        "Интервал атак равен текущей скорости атаки Juggernaut, поделённой на 1.6. То есть минимально возможный интервал для Juggernaut равен 4.38, а максимальный —0.13, учитывая минимальную и максимальную возможность скорость атаки. Интервал не устанавливается при применении. С каждым прыжком он адаптируется к текущей скорости атаки героя.",
        "То есть минимально возможный интервал для Juggernaut равен 4.38, а максимальный —0.13, учитывая минимальную и максимальную возможность скорость атаки.",
        "Интервал не устанавливается при применении. С каждым прыжком он адаптируется к текущей скорости атаки героя.",
        "Позволяет совершать мгновенные атаки по целям прыжков. Мгновенные атаки могут активировать модификаторы. Мгновенные атаки игнорируют обезоруживание, но не обладают эффектом True Strike.",
        "Мгновенные атаки могут активировать модификаторы.",
        "Мгновенные атаки игнорируют обезоруживание, но не обладают эффектом True Strike.",
        "Не считает целями и не прыгает по вардам, курьерам и строениям. Не может выбрать, но может прыгать по древним крипам.",
        "Может прыгать на неуязвимых юнитах, но, поскольку Juggernaut атакует цели, неуязвимые (и в призрачной форме) цели не получат урон.",
        "Не может перепрыгнуть на юнитов в тумане войны, невидимых или спрятанных юнитов, Tombstone Zombies и на Astral Spirit.",
        "Если поблизости нет подходящих целей, Omnislash преждевременно завершается.",
        "С каждым прыжком Juggernaut появляется на противоположной стороне от своей позиции около цели. Радиус прыжков закреплен за Juggernaut, а не за текущей целью.",
        "Радиус прыжков закреплен за Juggernaut, а не за текущей целью.",
        "Juggernaut может продолжать использовать способности и предметы в течение действия Omnislash, но при этом Blade Fury неактивна и её нельзя применить, пока действует Omnislash. Пока действует Omnislash, Juggernaut не нужно разворачиваться для применения направленных способностей или предметов.",
        "Пока действует Omnislash, Juggernaut не нужно разворачиваться для применения направленных способностей или предметов.",
        "Дает летающий обзор в радиусе 200 единиц вокруг цели на 1 секунду с каждым ударом.",
        "Повторное применение Omnislash при уже действующей способности обновит длительность.",
        "Камера игрока фиксируется на Juggernaut при применении и двигается за его положением, пока действует Omnislash."
      ],
      "mana": "200\/275\/350",
      "hotKey": "R",
      "cooldown": "140",
      "description": "Герой прыгает к указанному врагу, а затем с повышенной скоростью атакует его и ближайших противников. На время действия способности герой становится неуязвимым.",
      "spellName": "Omnislash",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 350",
        "Радиус прыжков: 425",
        "Множитель скорости атаки: 1.6",
        "Доп. урон: 30\/40\/50",
        "Длительность: 3\/3.25\/3.5 (TagTalent 4\/4,25\/4,5)",
        "Доп скорость атаки: 40",
        "Блокируется только первый удар."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "«Плоды дисциплины; повторение - мать умения»."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Требуется Aghanim's Scepter для разблокирования способности.",
        "Не требует изученного Omnislash для разблокирования, открывается сразу после покупки Aghanim's Scepter. Однако если Juggernaut использует заклинание, не изучив Omnislash, способность ничего не сделает, но потратит ману и уйдёт на перезарядку.",
        "Однако если Juggernaut использует заклинание, не изучив Omnislash, способность ничего не сделает, но потратит ману и уйдёт на перезарядку.",
        "Все примечания к Omnislash также относятся к Swiftslash."
      ],
      "mana": "100",
      "hotKey": "D",
      "cooldown": "15",
      "description": "Герой применяет короткую версию Omnislash.",
      "spellName": "Swiftslash",
      "params": [
        "Анимация применения: 0.3+0",
        "Дальности применения: 650",
        "Радиус прыжков: 425",
        "Множитель скорости атаки: 1.7",
        "Дополнительный урон: 30\/40\/50",
        "Длительность: 0.8",
        "Блокируется только первый удар."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 20.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.8,
    "attrAgility": 34.0
  },
  "description": "Juggernaut — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Blade Fury, вызывает вихрь из сокрушительных ударов клинком вокруг Juggernaut, делая его невосприимчивым к магии и нанося урон врагам поблизости. Вторая способность, Healing Ward, призывает Healing Ward, лечащий всех союзников неподалеку и способный передвигаться. Скорость лечения зависит от максимального здоровья союзника. Пассивная способность, Blade Dance, дает Juggernaut шанс нанести критический урон при атаке. Ультимативной способностью, Omnislash, Juggernaut прыгает ко врагу, атакуя его, а затем врагов рядом с ним. При атаке Juggernaut становится неуязвимым. Покупка Aghanim's Scepter добавляет новую способность — Swiftslash, схожую с ультимативной, но отличающуюся меньшей длительностью и меньшей перезарядкой.",
  "history": "Никто никогда не видел лица, что скрыто за маской Юрнеро. Остаётся гадать, каков он на вид. Однажды Юрнеро бросил вызов нечистому на руку лорду и был изгнан с древнего острова Масок. Кара спасла ему жизнь: скорой ночью остров исчез под волнами, ведомыми мстительной магией. Лишь Юрнеро отныне хранит обычаи острова: древние ритуалы и искусство боя на мечах. Непоколебимость и мужество пришли к нему в нескончаемых упражнениях с клинком, а изобретательность в бою он укоренял, неутомимо испытывая себя. Как и лик воина, желания его остаются тайной. Он уже дважды терял всё, но сражается так, будто победа предрешена.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 сек. длительности Omnislash",
      "talentRight": "+475 к здоровью"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+140 к урону в сек. от Blade Fury",
      "talentRight": "+8 к броне"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 к скорости атаки",
      "talentRight": "Blade Fury даёт +100 к скорости передвижения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+5 ко всем атрибутам"
    }
  ]
}