{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Bottle_Regenerate.mp3\/revision\/latest?cb=20191227195401",
      "effects": [
        "Способность Н\/Д",
        "Действует на Себя \/ Союзных героев"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания.",
        "Если Bottle пуст, то не даёт какого-либо эффекта, при этом активирует перезарядку.",
        "Несколько применений на одну и ту же цель не складываются, но обновляют длительность.",
        "При использовании без клавиши Ctrl всегда применяется на владельца. С зажатой клавишей Ctrl можно выбрать цель.",
        "Если цель находится на расстоянии более 600 единиц, то заклинатель будет перемещаться в сторону цели до тех пор, пока он не окажется в радиусе 350 единиц. Если приказ на применение был дан на цель, которая уже находится в радиусе 600 единиц, то заклинатель не перемещается к цели и сразу использует Bottle.",
        "Если приказ на применение был дан на цель, которая уже находится в радиусе 600 единиц, то заклинатель не перемещается к цели и сразу использует Bottle.",
        "Можно использовать только на героев (включая иллюзии) и крипов-героев.",
        "Курьеры могут применять Regenerate, при этом перезарядка запускается, здоровье и мана цели не восстанавливается, а заряды не тратятся.",
        "Заклинателю не нужно поворачиваться к цели, чтобы использовать Bottle.",
        "Один заряд восстанавливает до 125 здоровья и 75 маны за всю длительность.",
        "Все 3 заряда восстанавливают до 375 здоровья и 225 маны.",
        "Урон свыше 0 от любого игрока (включая союзников, исключая себя) или Рошана развеет эффект. Эффект не будет развеян уроном, помеченным как отнимающий здоровье.",
        "Эффект не будет развеян уроном, помеченным как отнимающий здоровье."
      ],
      "mana": null,
      "abilityName": "Regenerate",
      "cooldown": "0,5",
      "description": "Тратит один заряд, чтобы постепенно восстановить цели 125 здоровья и 75 маны за 2,5 сек. Восстановление прекращается при получении урона от вражеских героев или Рошана. Заряды можно восполнить возле союзного фонтана. Зажмите Ctrl, чтобы применить на союзника.",
      "params": [
        "Базовая дальность применения: 350",
        "Полная дальность применения: 600",
        "Макс. количество зарядов: 3",
        "Доп. регенерация здоровья: 50",
        "Доп. регенерация маны: 30",
        "Длительность: 2,5"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Bottle_Store_Rune.mp3\/revision\/latest?cb=20191227195402",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "При наличии Bottle, правый щелчок по руне вместо активации поместит её в бутыль. Руны нельзя хранить, когда Bottle находится в ранце. Когда Bottle находится в активной ячейке инвентаря, он может хранить руны. Для хранения рун Bottle необязательно должен быть пустой. Полный Bottle можно использовать для хранения рун так же, как и пустой или наполовину полный.",
        "Руны нельзя хранить, когда Bottle находится в ранце. Когда Bottle находится в активной ячейке инвентаря, он может хранить руны.",
        "Для хранения рун Bottle необязательно должен быть пустой. Полный Bottle можно использовать для хранения рун так же, как и пустой или наполовину полный.",
        "Руна хранится в Bottle 2 минуты, после чего она автоматически используется. Автоматическое использование не отменяет приказы владельца и не выводит из невидимости. Ручное использование отменяет приказы владельца и выводит из невидимости. При наличии руны, способность Regenerate активирует её, вместо восстановления владельца. Активация руны (ручная или автоматическая) восполняет 3 заряда Bottle. Если после 2 минут хранения владелец мёртв, то руна исчезает без применения эффектов, но Bottle пополняется как обычно.",
        "Автоматическое использование не отменяет приказы владельца и не выводит из невидимости.",
        "Ручное использование отменяет приказы владельца и выводит из невидимости.",
        "При наличии руны, способность Regenerate активирует её, вместо восстановления владельца.",
        "Активация руны (ручная или автоматическая) восполняет 3 заряда Bottle.",
        "Если после 2 минут хранения владелец мёртв, то руна исчезает без применения эффектов, но Bottle пополняется как обычно.",
        "Только герои и Spirit Bear могут хранить руны. Иллюзии, клоны и курьеры это делать не могут.",
        "В Bottle может храниться только одна руна. Попытка помещения новой руны, лишь активирует новую. При этом в инвентаре можно хранить несколько Bottle с разными рунами.",
        "При этом в инвентаре можно хранить несколько Bottle с разными рунами."
      ],
      "mana": null,
      "abilityName": "Store Rune",
      "cooldown": "0,5",
      "description": "В бутыль можно поместить одну руну, чтобы воспользоваться ей позже. Помещённая в бутыль руна задействуется сама спустя 2 минуты. Руны полностью наполняют бутыль.",
      "params": [
        "Дальность применения: 100",
        "Макс. длительность хранения руны: 120"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Bottle полностью передаваемый предмет. При этом Bottle с руной нельзя передать, выкинуть или переместить в ранец.",
    "При этом Bottle с руной нельзя передать, выкинуть или переместить в ранец.",
    "Bottle не исчезает после использования всех зарядов.",
    "Bottle автоматически восстанавливается, если носитель попал под воздействие Восстановление от фонтана."
  ],
  "cost": "625",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Bottle",
  "description": "",
  "trivia": [
    "До обновления от 1 февраля 2018 пассивная способность Bottle Store Rune не имела официального названия. Название было взято из Dota 2 Wiki и официально выпущено в Dota 2."
  ],
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Так как Bottle легко восполняется, его можно использовать для быстрого исцеления или для последующего использования сохранённой руны. Хотя он стоит значительно дороже, чем другие расходуемые предметы, всё же Bottle не имеет ограниченного использования, так как его можно снова восполнить на фонтане в любое время.",
    "Bottle восполняется автоматически каждый раз, когда он находится в инвентаре существа, на которого действует Восстановление от фонтана на союзном фонтане. Эффект ауры задерживается на три секунды, поэтому после выхода с фонтана, Bottle всё ещё наполняется. Используйте Bottle несколько раз на фонтане, чтобы быстрее восстановить здоровье и ману.",
    "Эффект ауры задерживается на три секунды, поэтому после выхода с фонтана, Bottle всё ещё наполняется.",
    "Используйте Bottle несколько раз на фонтане, чтобы быстрее восстановить здоровье и ману.",
    "После активации невидимости, Bottle можно использовать в течение нескольких секунд перед вхождением в невидимость без её потери, позволяя владельцу исцеляться во время вхождения в невидимость."
  ]
}