{
  "abilities": [
    {
      "notes": [
        "Interrupts Templar Assassin's channeling abilities upon cast",
        "Places two buffs on Templar Assassin, one granting instances of damage block and the other instances of bonus attack damage",
        "The number of remaining instances is visible on the buff icons\n The buffs and the visual effects of the ability are visible to everyone",
        "Grants regular flat bonus attack damage\n Loses a bonus damage instance when the attack projectile successfully lands on the target\n Missed or disjointed attacks do not count\n Neither loses instances upon attacking allies nor applies the bonus damage to them\n Does not provide bonus damage when cast while an attack projectile is traveling, but still uses up one instance upon projectile hit",
        "Refraction fully negates damage (after all reductions), causing several on-damage effects to not trigger\n Refracts the 3 damage types, but not heals and HP Removal effects (e.g\n  Sunder, <span image=\"items\/soul_ring\/full.webp\">[Soul Ring]<\/span> Soul Ring etc.)\n Has a higher priority than  Aphotic Shield, but lower than  False Promise\n However, it still loses a charge when combined with the latter\n Damage below 5 (after reductions) is completely ignored\n It is neither blocked nor consumes any block instances\n Does not negate any instant kill effects",
        "TALENT NOTES Refraction now can be cast while stunned, cycloned, slept, taunted, hidden or while being affected by forced movement sources\n It still cannot be cast while silenced, hexed or prevented from acting\n Templar Assassin is unable to ⇧ Shift-queue this ability upon learning the talent"
      ],
      "item_behaviour": [],
      "description": "Templar Assassin becomes highly elusive, avoiding damage and gaining a bonus to her damage. The damage and avoidance effects are separate, and have a limited number of instances.",
      "hot_key": "Q",
      "params": [
        "Cast Animation:  0+0",
        "Number of Instances: 3\/4\/5\/6 ( 10\/11\/12\/13)",
        "Attack Damage Bonus: 25\/45\/65\/85 ( 50\/70\/90\/110)",
        "Duration: 17"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Templar_Assassin_Refraction_1.mp3\/revision\/latest?cb=20191216025003",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "17",
      "aghanim": null,
      "name": "Refraction",
      "cooldown": "85\/90\/95\/100",
      "legacy_key": "R",
      "story": "Manipulating her psionic veil, Lanaya bends nature's law to her will."
    },
    {
      "notes": [
        "Meld first applies a basic dispel, instantly turns Templar Assassin invisible and phased, then a stop order is issued\n She can turn, pick up, drop or attack items without breaking the invisibility, considering she does not move while doing so\n The invisibility is lost upon reaching the cast point of abilities, upon landing an attack, or upon moving\n Forced movement sources also cancel Meld if moved horizontally\n However, upward movement and teleporting effects (e.g\n  Psionic Projection) do not cancel it\n After an attack projectile has been launched, Templar Assassin can perform any action without losing invisibility\n However, if the projectile misses or is disjointed, the invisibility is lost at the moment it misses\n Does not break invisibility upon a  Psionic Projection cast",
        "Templar Assassin's next attack which connects with a unit applies the Meld effects\n Meld first applies the armor debuff, then the Meld damage, the bash and then the attack damage",
        "The Meld damage is dealt in a separate damage instance, and counts as attack damage\n Since it is applied separately, it does not trigger attack modifiers (e.g\n crit or lifesteal) or  Psi Blades\n Killing a unit with the Meld damage also does not trigger Psi Blades as well",
        "Neither the bonus damage nor the armor reduction from Meld affects buildings",
        "Multiple instances of the armor reduction debuff fully stack",
        "TALENT NOTES The Meld hit bash  talent stacks with other bash sources\n SPELL STEAL \/ MORPH NOTES Invisibility persists upon losing ability"
      ],
      "item_behaviour": [],
      "description": "Templar Assassin conceals herself, becoming invisible as long as she remains still. If Meld's invisibility is broken by attacking an enemy, Lanaya will deal bonus damage to the enemy and reduce their armor for 12 seconds.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0.53",
        "Fade Time: 0",
        "Damage: 80\/120\/160\/200",
        "Armor Reduction: 5\/6\/7\/8 ( 8\/9\/10\/11)",
        "Debuff Duration: 12",
        "Invisibility Duration: Permanent",
        "Bash Duration:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Templar_Assassin_Meld_1.mp3\/revision\/latest?cb=20191216025015",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies",
        "Damage: Physical"
      ],
      "mana": "11\/9\/7\/5",
      "aghanim": null,
      "name": "Meld",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "D",
      "story": "Lanaya is as elusive as her covenant with the Hidden Temple."
    },
    {
      "notes": [
        "Increases Templar Assassin's total attack range to 240\/290\/340\/390 ( 360\/410\/460\/510)",
        "The spill area has a rectangular shape, with a width of 90 and a length of 550\/600\/650\/700 ( 670\/720\/770\/820)\n The spill area starts at the attack target's location and extends beyond them\n With her default attack range and Psi Blade's attack range bonus, Psi Blades can hit units up to 790\/890\/990\/1090 ( 1030\/1130\/1230\/1330) range away",
        "Does not perform instant attacks\n The projectiles deal regular spell damage\n Attack modifiers are only applied to the primary target\n The initial spill damage equals the amount of damage the primary attack target took from the attack\n Attack damage amount is calculated upon attack begin\n This also means that it also works with critical strike, quell and bashes\n It also means that other conditional attack damage bonuses (i.e\n <span image=\"items\/javelin\/full.webp\">[Javelin]<\/span> Javelin damage proc) are not included, since these happen later in the calculations as well",
        "Psi Blade's damage has the following flags: No-spell-lifesteal flag, preventing its damage from utilizing spell lifesteal\n No-spell-amplification flag, preventing its damage from being amplified with spell damage amplification",
        "The 5% damage loss per target is always based on the initial damage, not on the damage the previous target took\n This means Psi Blades' damage reaches 0% after the 20th target\n However, it still affects all enemies within its area, applying a 0 damage instance to further targets\n Fully procs on damage effects, such as  Corrosive Skin, except for abilities which have a minimum damage threshold (e.g\n  Gravekeeper's Cloak)",
        "Templar Assassin's position is checked as the projectile hits the target, not upon launching",
        "Psi Blades spill damage when attacking allies or wards which use flat health (e.g\n  Plague Ward)\n Spill damage can hit  Courier and invisible units\n It spills an instance of 0 damage when attacking wards that require a fixed amount of attacks to be destroyed\n Despite the visual effects, Psi Blades do not spill damage when attacking buildings"
      ],
      "item_behaviour": [],
      "description": "Templar Assassin's psi blades slice through the attacked unit, splitting and damaging enemy units directly behind it, while gaining bonus attack range. For each unit it damages, the spill damage is reduced by a percentage.",
      "hot_key": "E",
      "params": [
        "Attack Range Bonus: 80\/130\/180\/230 ( 200\/250\/300\/350)",
        "Spill Area Width: 90",
        "Spill Area Length:  550\/600\/650\/700 ( 670\/720\/770\/820)",
        "Attack Damage Spilled: 100%",
        "Damage Loss per Target: 5%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Templar_Assassin_Psi_Blades.mp3\/revision\/latest?cb=20191216025000",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Psi Blades",
      "cooldown": null,
      "legacy_key": "B",
      "story": "Her blades pierce the skin as much as the mind, furthering her understanding of the mystery that is reality."
    },
    {
      "notes": [
        "This ability is unlocked when  Psionic Trap is learned",
        "Does not interrupt Templar Assassin's channeling abilities upon cast",
        "Cannot be cast when there is no  Psionic Traps present",
        "The slow starts at 30% and increases by 0.29% in each server tick, reaching its maximum values at 3.5 seconds\n SHARD NOTES The silence duration starts at 1.5 and increases by 0.01 in the same intervals",
        "On each second after placement, the movement speed slow values and silence durations are: 0s: 30% slow, 1.5s silence\n 1s: 38.57% slow, 2.07s silence\n 2s: 47.14% slow, 2.64s silence\n 3s: 55.71% slow, 3.21s silence.",
        "The damage is only applied when the trap is fully charged\n The trap visually changes once fully charged\n Its outer ring starts black and turns white once fully charged\n The damage values are always based on the current level and  talent upgrades upon triggering the trap, and are not set upon spawning the trap\n The source of the damage is the caster, and not the trap itself\n Therefore, the damage is affected by outgoing damage manipulation and spell lifesteal\n Deals 50\/60\/70 ( 72\/82\/92) damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 5 damage instances",
        "Multiple instances of the debuff do not stack but get refreshed instead\n When refreshed, the movement speed slow and damage values get updated based on how long that trap was charged"
      ],
      "item_behaviour": [],
      "description": "Springs the nearest trap, slowing nearby enemies.",
      "hot_key": "D",
      "params": [
        "Cast Animation:  0+0",
        "Trap Search Radius: Global",
        "Slow Radius: 400",
        "Total Damage: 250\/300\/350 ( 360\/410\/460)",
        "Min Move Speed Slow: 30%",
        "Max Move Speed Slow: 60%",
        "Trap Charge Time: 3.5",
        "Slow Duration: 5",
        "Min Silence Duration:  1.5",
        "Max Silence Duration:  3.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Templar_Assassin_Trap.mp3\/revision\/latest?cb=20191216025009",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies ",
        "Damage: Magical"
      ],
      "mana": "0.5",
      "aghanim": null,
      "name": "Trap",
      "cooldown": "0",
      "legacy_key": "T",
      "story": null
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter to be unlocked",
        "After the channeling time, Psionic Projection moves Templar Assassin to the closest  Psionic Trap's coordinates from the targeted point, then the trap is detonated\n Therefore, it does not disjoint projectiles upon teleporting\n Unlike teleport of <span image=\"items\/town_portal_scroll\/full.webp\">[Town Portal Scroll]<\/span> Town Portal Scroll, Templar Assassin may purchase items from shops if she is within the shop trigger range",
        "Trap notes fully apply",
        "Does not break  Meld's invisiblity upon cast",
        "Casting this while traps are not present does nothing, wasting mana and cooldown"
      ],
      "item_behaviour": [],
      "description": "Allows Templar Assassin to teleport to any Psionic Trap after channeling for 1.5 seconds, detonating it upon arrival. Channeling Psionic Projection does not break Meld.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: Global",
        "Slow Radius: 400",
        "Channel Time: 1.5",
        "Total Damage: 250\/300\/350 ( 360\/410\/460)",
        "Min Move Speed Slow: 30%",
        "Max Move Speed Slow: 60%",
        "Trap Charge Time: 3.5",
        "Slow Duration: 5",
        "Min Silence Duration:  1.5",
        "Max Silence Duration:  3.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a5\/Templar_Assassin_Psionic_Projection.mp3\/revision\/latest?cb=20191216025000",
      "effects": [
        "Ability: Target Point",
        "Affects: Self \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "10",
      "aghanim": null,
      "name": "Psionic Projection",
      "cooldown": "50",
      "legacy_key": "W",
      "story": "In reward for her service, Lanaya has been granted access to secrets that unlock new techniques for her psionic gifts."
    },
    {
      "notes": [
        "Psionic Traps only apply their effects on enemies when they are triggered by either  Trap,  Psionic Projection or the ability from the trap itself\n The traps do not apply their effects when they are destroyed by attacks, or by detonating when exceeding the maximum allowed traps count",
        "Psionic Traps do not block neutral creep camps\n SPELL STEAL Traps do not disappear upon losing ability\n Despite being fully functional, Traps only deal Level 1 damage values"
      ],
      "item_behaviour": [],
      "description": "Templar Assassin places mystical traps that invisibly monitor enemy movement. When sprung at her command, they exert a slowing influence of 30% in the area. Traps charge up to slow 60% after 3.5 seconds. Deals bonus damage when fully charged.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  1800",
        "Max Traps: 5\/8\/11 ( 9\/12\/15)",
        "Trap Fade Time: 2",
        "Trap Duration: Permanent"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Templar_Assassin_Psionic_Trap.mp3\/revision\/latest?cb=20191216025002",
      "effects": [
        "Ability: Target Point"
      ],
      "mana": "11\/8\/5",
      "aghanim": null,
      "name": "Psionic Trap",
      "cooldown": "15",
      "legacy_key": "C",
      "story": "Calling upon the reach of the Hidden Temple, none escape the eye of the Templar."
    },
    {
      "notes": [
        "This ability is cast from the trap itself, allowing Templar Assassin to trigger traps from afar without having to trigger nearby traps first",
        "Trap notes fully apply"
      ],
      "item_behaviour": [],
      "description": "Springs the trap, slowing nearby enemies.",
      "hot_key": "Q",
      "params": [
        "Cast Animation:  0+0",
        "Slow Radius: 400",
        "Total Damage: 250\/300\/350 ( 360\/410\/460)",
        "Min Move Speed Slow: 30%",
        "Max Move Speed Slow: 60%",
        "Trap Charge Time: 3.5",
        "Slow Duration: 5",
        "Min Silence Duration:  1.5",
        "Max Silence Duration:  3.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Templar_Assassin_Self_Trap.mp3\/revision\/latest?cb=20191216025007",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "0.5",
      "aghanim": null,
      "name": "Trap",
      "cooldown": "0",
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 21.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.2,
    "attrAgility": 23.0
  },
  "description": "Slows down enemies with traps. Bending the laws of nature itself, Lanaya forms a Refraction field that absorbs incoming blows, yet amplifies outgoing attacks. She Melds into the background, lying in ambush to unleash a burst of psionic energy on unsuspecting targets. Violet light emanates from her fingertips, her Psi Blades out-ranges any melee weapon, shreds and pierce through lines of foes at once. Persistent in her goals, Lanaya marks the ground with magic circles of eldritch design. Those who walk unknowingly over a Psionic Trap can only limp away from the explosion — for their presence has been revealed, and the assassin who Projected herself into place is not far behind.  Carry Escape ★★☆",
  "trivia": [
    "In DotA, Templar Assassin makes numerous references to the game Starcraft, another famous RTS game by Blizzard. Her ability to manipulate psionic energy, the psi blades she wields, and the mention of her master being originally from Aiur in her DotA biography all apply to the Protoss, one of the three main races of the game. The description of Meld also describes it as the \"Art of Shakuras\". In Starcraft lore Shakuras is the capital of the Lenassa clan which is part of the Nerazim faction better known as Dark Templar. Lenassa templars are wearing cloth shrouds on their faces, and have purple warp blades and purple eyes.[1]",
    "Templar Assassin's rare response upon snapping a trap, Link▶️ \"It's a trap!\" is a reference based on Star Wars' Admiral Ackbar's quote from \"Return of the Jedi.\"",
    "The response Link▶️ \"My body is a temple for which I will kill.\" is a reference to the bible verse John 2:19-22.",
    "Templar Assassin's response upon killing Snapfire Link▶️ \"Alright then, keep your secrets.\" is a reference to Frodo's quote in the 2001 film The Lord of the Rings."
  ],
  "history": "Lanaya, the Templar Assassin, came to her calling by a path of curious inquiry. Possessed of a scientific bent, she spent her early years engaged in meticulous study of nature's laws--peering into grimoires of magic and alchemy, recreating experiments from charred fragments of the Violet Archives, and memorizing observations of the Keen recordkeepers. Already quiet and secretive by nature, the difficulty of acquiring these objects further reinforced her skills of stealth. Had she been less retiring, she might have become notorious among the guilds as a thief-scholar. Instead her investigations led her into far more obscure corners. As she devoted her furtive talents to unlocking the secrets of the universe, she instead unlocked a secret door that exists in nature itself: the entryway to the most Hidden Temple. The intelligences that waited beyond that portal, proved to be expecting her, and whatever mysteries they revealed in the moment of their discovery was nothing compared to the answers they held out to Lanaya should she continue in their service. She swore to protect the mysteries, but more to the point, in service to the Hidden Temple she satisfies her endless craving for understanding. In the eyes of each foe she expunges, a bit more of the mystery is revealed.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "1s Meld Hit Bash",
        "talent_left": "+7 Refraction Instances"
      },
      {
        "talent_lvl": "20",
        "talent_right": "Meld Dispels",
        "talent_left": "-3 Meld Armor Reduction"
      },
      {
        "talent_lvl": "15",
        "talent_right": "Refraction Can Be Cast While Disabled",
        "talent_left": "+120 Psi Blades Attack and Spill Range"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+25 Refraction Attack Damage",
        "talent_left": "+110 Psionic Trap Damage"
      }
    ]
  }
}