{"abilities":[{"effects":["Max Health Restored per Second: 5%","Damage Cooldown (Melee): 5","Damage Cooldown (Ranged): 7"],"notes":["Health Regeneration from multiple Hearts of Tarrasque does not stack.","Can regenerate up to 300% of the wielder's max health in one minute.","Can fully regenerate the wielder's health within 20 seconds.","Damage greater than 0 from any player (including allies, excluding self) or Roshan puts the regeneration on a 5\/7-second cooldown. Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb and Rearm. Is also affected by Cooldown Reduction from Octarine Core & Arcane Rune. Does not get disabled by damage flagged as HP Removal."],"elements":["Ability Passive","Affects Self"],"description":"Restores 5% of max health per second. If damage is taken from an enemy hero or Roshan, this ability is disabled for 5 seconds for melee heroes, or 7 seconds for ranged heroes."}],"cost":"5200","description":"Preserved heart of an extinct monster, it bolsters the bearer's fortitude.","trivia":["The name \"Tarrasque\" references the Tarrasque, an almost undefeatable monster in Dungeons & Dragons, which in return references the Tarasque, a mythological dragon-hybrid that was tamed by Saint Martha."],"further":["Ring_of_Tarrasque","Vitality_Booster","Reaver","Recipe"],"tips":["Heart of Tarrasque is effective against teams with a lot of burst damage.","Heart of Tarrasque's strength bonus mostly benefits Strength heroes. Agility or Intelligence heroes can consider an Eye of Skadi instead for tankiness.","Heart of Tarrasque can quickly regenerate health, allowing wielders to briefly disengage then re-enter fights if necessary.","Heart of Tarrasque is very valuable item when you have Oracle in your team as False Promise enables passive regeneration even while fighting enemy heroes."],"attrs":["Passive Health Regeneration","Bonus +45 Strength +400 Health +50% Health regen amplification","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 1300 health, 4.5 health regen, 3.6% magic resistance and 45 attack damage.","For agility heroes, it grants 1300 health, 4.5 health regen and 3.6% magic resistance.","For intelligence heroes, it grants 1300 health, 4.5 health regen and 3.6% magic resistance."]}