{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Magic_Stick_Energy_Charge.mp3\/revision\/latest?cb=20191227195452",
      "effects": [
        "Стандартная дальность применения: 500",
        "Дальность применения баффа: 750",
        "Радиус: 1200",
        "Зарядов за использ. заклинание: 1",
        "Максимум зарядов: 20",
        "Восст. здоровья и маны за заряд: 15"
      ],
      "notes": [
        "Двойной щелчок применяет предмет на владельца.",
        "Если цель находится на расстоянии, превышающее 750 единиц, то заклинатель будет двигаться в сторону цели до достижения между ними расстояния в 500. Если приказ на применение был дан на цель, находящуюся в пределах 750 единиц, то заклинателю не нужно будет перемещаться и он использует предмет сразу же.",
        "Если приказ на применение был дан на цель, находящуюся в пределах 750 единиц, то заклинателю не нужно будет перемещаться и он использует предмет сразу же.",
        "Можно применять только на героев (включая иллюзии и крипов-героев).",
        "Заклинатель не поворачивается при использовании на союзников.",
        "Получает заряд каждый раз, когда видимое вражеское существо, включая нейтральных крипов, использует способность в радиусе 1200 или автоматически каждые 15 секунд. Заряды автоматически добавляются даже если владелец мертв.",
        "Заряды автоматически добавляются даже если владелец мертв.",
        "Не дает заряды от переключаемых способностей, активных модификаторов атаки и способностей, перечисленных здесь.",
        "Клоны, иллюзии и крипы-герои не получают заряды.",
        "Пассивно срабатывающие заклинания (например, Quill Spray, Borrowed Time, Multicast, Reincarnation) не дают заряды.",
        "Если враг применяет заклинание в невидимости от Руна невидимости, Shadow Walk, Sand Storm, Moonlight Shadow или Spin Web, то оно не даст заряд.",
        "Восстанавливает до 300 здоровья и маны при максимальном количестве зарядов.",
        "Делит перезарядку с Magic Stick и Magic Wand.",
        "При наличии нескольких Magic Wand или Magic Stick в инвентаре, первым заряды получит тот предмет, который приобрели раньше. Если он полон, второй по давности начнёт получать заряды.",
        "При улучшении Magic Wand в Holy Locket, все его текущие заряды сохраняются."
      ],
      "mana": null,
      "abilityName": "Energy Charge",
      "cooldown": null,
      "description": "Мгновенно восстанавливает выбранному союзному существу 15 здоровья и маны за каждый имеющийся заряд. Может иметь до 20 зарядов. Получает один заряд каждые 10 сек. и каждый раз, когда видимый враг в радиусе 1200 использует способность.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Усиление лечения: 30%"
      ],
      "notes": [
        "В отличии от усиления лечения, Holy Blessing усиливает только лечение, применяемое владельцем, а не получаемое им. То есть любое лечение, исходящее от владельца, усиливается независимо от выбранной цели. И наоборот — лечение, полученное владельцем, не увеличивается.",
        "То есть любое лечение, исходящее от владельца, усиливается независимо от выбранной цели.",
        "И наоборот — лечение, полученное владельцем, не увеличивается.",
        "Дает только усиление лечения. Не дает усиление регенерации здоровья, вампиризма или вампиризма заклинаний.",
        "Несколько Holy Blessing не складываются.",
        "Складывается по закону убывающей полезности с другими источниками усиления лечения."
      ],
      "mana": null,
      "abilityName": "Holy Blessing",
      "cooldown": null,
      "description": "Все лечащие способности владельца восстанавливают на 30% больше здоровья.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Доп. регенерация здоровья: 3",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Складывается со всеми источниками фиксированной регенерации здоровья, за исключением Regeneration Aura от нескольких Holy Locket.",
        "Восстанавливает до 180 здоровья в минуту.",
        "Не действует на варды, постройки и неуязвимых существ.",
        "Бафф ауры задерживается на 0,5 сек."
      ],
      "mana": null,
      "abilityName": "Regeneration Aura",
      "cooldown": null,
      "description": "Увеличивает восстановление здоровья на 3 всем союзникам в радиусе 1200.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2400",
  "lore": null,
  "consistFrom": [
    "Headdress",
    "Fluffy Hat",
    "Energy Booster",
    "Magic Wand",
    "Recipe"
  ],
  "name": "Holy Locket",
  "description": "Заветная реликвия, которая долгое время считалась утерянной в неудавшемся походе.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}