{
  "abilities": [
    {
      "notes": [
        "Талант на ловкость в общем даёт Morphling: 1,67 брони, 10 скорости атаки и 10 урона от атаки.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+3 цели Adaptive Strike",
          "talentRight": "2 заряда Waveform"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Атаки во время Waveform",
          "talentRight": "-12% перезарядки заклинаний"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к скорости атаки",
          "talentRight": "+16 сек. к длительности Morph"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+275 к дальности Waveform",
          "talentRight": "+10 к ловкости"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Morphling_Waveform.mp3\/revision\/latest?cb=20191216020828",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Себя",
        "Урон Магический Мгновенная атака"
      ],
      "notes": [
        "При применении перемещает со скоростью в 1250 единиц и позволяет избежать снаряды.",
        "Morphling неуязвим и его модель нельзя выделить мышкой во время Waveform. Однако Morphling можно выбрать нажатием на иконку героя.",
        "Однако Morphling можно выбрать нажатием на иконку героя.",
        "Поражает существ на расстоянии до 900\/1000\/1100\/1200 (TagTalent 1175\/1275\/1375\/1475) единиц (складывается из максимальной дистанции и радиуса).",
        "Morphling может поворачиваться, атаковать, использовать способности и предметы во время Waveform.",
        "Не проходит полную дистанцию, если выбрать точку ближе максимального расстояния.",
        "При выборе таланта на 20-ом уровне Morphling совершает мгновенные атаки по каждому задетому врагу. На эти мгновенные атаки может сработать любой модификатор атаки. Они не обладают эффектом True Strike, но игнорируют обезоруживание.",
        "На эти мгновенные атаки может сработать любой модификатор атаки. Они не обладают эффектом True Strike, но игнорируют обезоруживание."
      ],
      "mana": "150\/155\/160\/165",
      "hotKey": "Q",
      "cooldown": "20\/17\/14\/11 (TagTalent 17,6\/14,96\/12,32\/9,68)",
      "description": "Герой принимает жидкую форму и устремляется вперёд, нанося урон всем врагам на своём пути. Во время применения способности герой неуязвим.",
      "spellName": "Waveform",
      "params": [
        "Анимация применения: 0,25+0",
        "Дальность применения: 700\/800\/900\/1000 (TagTalent 975\/1075\/1175\/1275)",
        "Макс. дистанция прохождения: 700\/800\/900\/1000 (TagTalent 975\/1075\/1175\/1275)",
        "Радиус урона: 200",
        "Урон: 75\/150\/225\/300",
        "Число зарядов: 0 (TagTalent 2)",
        "Время восстановления заряда: 0 (TagTalent 20\/17\/14\/11)",
        "Мгновенные атаки, добавляемые талантом, проходят сквозь иммунитет к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "На врагов обрушивается стремительный поток воды."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c1\/Morphling_Adaptive_Strike_%28Agility%29_1.mp3\/revision\/latest?cb=20191216020828",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Adaptive Strike (Ловкость) и Adaptive Strike (Сила) - связанные способности; при улучшении одной улучшается другая. В режиме Ability Draft обе версии Adaptive Strike разделены, поэтому их можно выбирать и изучать по отдельности.",
        "В режиме Ability Draft обе версии Adaptive Strike разделены, поэтому их можно выбирать и изучать по отдельности.",
        "Использование этой способности запускает фиксированную перезарядку в 3 секунды для связанной Adaptive Strike. Может быть сброшена эффектами, сбрасывающими перезарядку.",
        "Снаряд летит со скоростью в 1150 единиц.",
        "Множитель урона не фиксирован и плавно увеличивается в зависимости от разницы между текущими значениями силы и ловкости Morphling.",
        "Значения меняются с каждым процентом разницы между ловкостью и силой, даже если разница между ними минимальна.",
        "Множитель учитывает не только базовые атрибуты, но и дополнительные.",
        "Если текущая ловкость на 50% больше силы, множитель урона устанавливается на максимальное значение в 1\/1,5\/2\/2,5.",
        "Если текущая сила на 50% больше ловкости, множитель урона устанавливается на минимальное значение в 0,5.",
        "Проверяет атрибуты Morphling при попадании снаряда.",
        "При выборе таланта 25 уровня заклинание запускает 3 дополнительных снаряда в случайные видимые подходящие цели в радиусе дальности применения. Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 900\/1000\/1100\/1200 единиц. Не может выбрать повторно главную цель, поэтому при отсутствии подходящих целей ничего не произойдет. Вторичные цели выбираются случайно в области и для них нет приоритета. Снаряды не могут выбрать одну и ту же цель. Поскольку снаряды используют дальность применения способности, то на них также действуют эффекты, увеличивающие дальность применения.",
        "Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 900\/1000\/1100\/1200 единиц.",
        "Не может выбрать повторно главную цель, поэтому при отсутствии подходящих целей ничего не произойдет.",
        "Вторичные цели выбираются случайно в области и для них нет приоритета. Снаряды не могут выбрать одну и ту же цель.",
        "Поскольку снаряды используют дальность применения способности, то на них также действуют эффекты, увеличивающие дальность применения."
      ],
      "mana": "80",
      "hotKey": "W",
      "cooldown": "10 (TagTalent 8,8)",
      "description": "Запускает во вражеское существо поток воды, нанося ему урон в зависимости от ловкости героя. Множитель ловкости будет максимальным, если ловкость героя на 50% выше его силы. Способность Adaptive Strike (сила) также уходит на перезарядку в 3 сек.",
      "spellName": "Adaptive Strike (Ловкость)",
      "params": [
        "Анимация применения: 0,25+0,67",
        "Дальность применения: 600\/700\/800\/900",
        "Доп. расстояние для поиска вторичной цели: 300",
        "Число целей: 1 (TagTalent 1,01)",
        "Базовый урон: 70\/80\/90\/100",
        "Мин. множитель ловкости: 0,5",
        "Макс. множитель ловкости: 1\/1,5\/2\/2,5",
        "Недоступность Adaptive Strike (TagTalentСила): 3",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Герой взывает к своей стихии, дабы врагов сокрушили волны."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Morphling_Adaptive_Strike_%28Strength%29_1.mp3\/revision\/latest?cb=20191216020820",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Adaptive Strike (Ловкость) и Adaptive Strike (Сила) - связанные способности; при улучшении одной улучшается вторая. В режиме Ability Draft обе версии Adaptive Strike разделены, поэтому их можно выбирать и изучать по отдельности.",
        "В режиме Ability Draft обе версии Adaptive Strike разделены, поэтому их можно выбирать и изучать по отдельности.",
        "Использование этой способности запускает фиксированную перезарядку в 3 секунды для связанной Adaptive Strike. Может быть сброшена эффектами, сбрасывающими перезарядку.",
        "Снаряд летит со скоростью в 1150 единиц.",
        "Значения отбрасывания и оглушения не фиксированы и плавно увеличиваются в зависимости от разницы между текущими значениями силы и ловкости Morphling.",
        "Значения меняются с каждым процентом разницы между ловкостью и силой, даже если разница между ними минимальна.",
        "Отбрасывание и оглушение учитывают не только базовые атрибуты, но и дополнительные.",
        "Если текущая сила на 50% больше ловкости, дальность отбрасывания и длительность оглушения устанавливаются на их максимальное значение в 500 и 1,5\/2\/2,5\/3 соответственно.",
        "Если текущая ловкость на 50% больше силы, дальность отбрасывания и длительность оглушения устанавливаются на их минимальное значение в 100 и 0,5 соответственно.",
        "Отбрасывает цель назад со скоростью в 1000 единиц за 0,1-0,5 секунды.",
        "Проверяет атрибуты Morphling при попадании снаряда.",
        "При выборе таланта 25 уровня заклинание запускает 3 дополнительных снаряда в случайные видимые подходящие цели в радиусе дальности применения. Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 900\/1000\/1100\/1200 единиц. Не может выбрать повторно главную цель, поэтому при отсутствии подходящих целей ничего не произойдет. Вторичные цели выбираются случайно в области и для них нет приоритета. Снаряды не могут выбрать одну и ту же цель. Поскольку снаряды используют дальность применения способности, то на них также действуют эффекты, увеличивающие дальность применения.",
        "Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 900\/1000\/1100\/1200 единиц.",
        "Не может выбрать повторно главную цель, поэтому при отсутствии подходящих целей ничего не произойдет.",
        "Вторичные цели выбираются случайно в области и для них нет приоритета. Снаряды не могут выбрать одну и ту же цель.",
        "Поскольку снаряды используют дальность применения способности, то на них также действуют эффекты, увеличивающие дальность применения."
      ],
      "mana": "80",
      "hotKey": "E",
      "cooldown": "10 (TagTalent 8,8)",
      "description": "Запускает во вражеское существо поток воды, оглушая и отталкивая его назад в зависимости от силы героя. Оглушение и толчок будут максимальными, если сила героя на 50% выше его ловкости. Способность Adaptive Strike (ловкость) также уходит на перезарядку в 3 сек.",
      "spellName": "Adaptive Strike (Сила)",
      "params": [
        "Анимация применения: 0,25+0,67",
        "Дальность применения: 600\/700\/800\/900",
        "Доп. расстояние для поиска вторичной цели: 300",
        "Число целей: 1 (TagTalent 1,01)",
        "Мин. расстояние отбрасывания: 100",
        "Макс. расстояние отбрасывания: 500",
        "Мин. длительность оглушения: 0,5",
        "Макс. длительность оглушения: 1,5\/2\/2,5\/3",
        "Недоступность Adaptive Strike (TagTalentЛовкость): 3",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Герой взывает к своей стихии, дабы врагов сокрушили волны."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d9\/Morphling_Attribute_Shift_%28Agility_Gain%29.mp3\/revision\/latest?cb=20191216020822",
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя"
      ],
      "notes": [
        "Attribute Shift (Ловкость) и Attribute Shift (Сила) - связанные способности; при улучшении одной улучшается другая.",
        "При переключении Attribute Shift не прерывает произносимые заклинания Morphling.",
        "Преобразовывает 1\/4\/10\/25 очков атрибута в секунду, в результате чего в секунду: Ловкость: Morphling получает\/теряет 0,17\/0,67\/1,67\/4,17 единиц брони, 1\/4\/10\/25 скорости атаки и 1\/4\/10\/25 урона. Сила: Morphling получает\/теряет 20\/80\/200\/500 максимального здоровья и 0,1\/0,4\/1\/2,5 регенерации здоровья. Получение\/потеря силы не сохраняют текущий процент здоровья, но взамен добавляют\/отнимают 20 здоровья за единицу силы к\/от текущего запаса здоровья. Это дополнительное здоровье не добавляется во время действия Ice Blast или False Promise и не считается для них за лечение.",
        "Ловкость: Morphling получает\/теряет 0,17\/0,67\/1,67\/4,17 единиц брони, 1\/4\/10\/25 скорости атаки и 1\/4\/10\/25 урона.",
        "Сила: Morphling получает\/теряет 20\/80\/200\/500 максимального здоровья и 0,1\/0,4\/1\/2,5 регенерации здоровья.",
        "Получение\/потеря силы не сохраняют текущий процент здоровья, но взамен добавляют\/отнимают 20 здоровья за единицу силы к\/от текущего запаса здоровья.",
        "Это дополнительное здоровье не добавляется во время действия Ice Blast или False Promise и не считается для них за лечение.",
        "Attribute Shift продолжает перекачивать атрибуты даже если Morphling обезврежен, но при этом способность нельзя переключать в обезвреженном состоянии. Включение одной способности Attribute Shift автоматически выключит другую. Если Attribute Shift не может перекачивать очки атрибутов, поскольку они закончились, то она останется включенной, но процесс будет приостановлен до появления свободных очков.",
        "Включение одной способности Attribute Shift автоматически выключит другую.",
        "Если Attribute Shift не может перекачивать очки атрибутов, поскольку они закончились, то она останется включенной, но процесс будет приостановлен до появления свободных очков.",
        "Может перекачивать только базовые атрибуты Morphling. Дополнительные атрибуты не перекачиваются. Пассивно получаемые сила и ловкость не добавляются к базовым, и потому не могут быть перекачаны.",
        "Пассивно получаемые сила и ловкость не добавляются к базовым, и потому не могут быть перекачаны.",
        "Перекачанные атрибуты постоянны и не возвращаются при смерти.",
        "Пассивная дополнительная ловкость в среднем дает Morphling 0,5\/0,83\/1,17\/1,5 брони и по 3\/5\/7\/9 скорости атаки и урона.",
        "Пассивная дополнительная сила в среднем дает Morphling 60\/100\/140\/180 здоровья и 0,3\/0,5\/0,7\/0,9 регенерации здоровья.",
        "Эта способность недоступна в режиме Ability Draft."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Герой меняет свою форму, превращая очки силы в очки ловкости. Этот процесс обратим. С уровнем растёт скорость превращения. Также даёт постоянный бонус к ловкости.",
      "spellName": "Attribute Shift (Ловкость)",
      "params": [
        "Анимация применения: 0+0",
        "Скорость обмена: 1\/0,25\/0,1\/0,04",
        "Очков атрибута за обмен: 1",
        "Дополнительная ловкость: 3\/5\/7\/9",
        "Иллюзии появляются с текущими атрибутами Morphling, а не с исходными."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Непостоянство вод не позволяет уловить природу героя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Morphling_Attribute_Shift_%28Strength_Gain%29.mp3\/revision\/latest?cb=20191216020823",
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя"
      ],
      "notes": [
        "Примечания те же, что и для Attribute Shift (Ловкость)."
      ],
      "mana": null,
      "hotKey": "F",
      "cooldown": null,
      "description": "Герой меняет свою форму, превращая очки ловкости в очки силы. Этот процесс обратим. С уровнем растёт скорость превращения. Также даёт постоянный бонус к силе.",
      "spellName": "Attribute Shift (Сила)",
      "params": [
        "Анимация применения: 0+0",
        "Скорость обмена: 1\/0,25\/0,1\/0,04",
        "Скорость обмена: 1",
        "Дополнительная сила: 3\/5\/7\/9",
        "Иллюзии появляются с текущими атрибутами Morphling, а не с исходными."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Непостоянство вод не позволяет уловить природу героя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5c\/Morphling_Morph.mp3\/revision\/latest?cb=20191216020825",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя"
      ],
      "notes": [
        "Не заменяет Morphling клоном цели. Morph лишь копирует модель цели (включая надетые на неё косметические предметы). То есть герой продолжает считаться Morphling, поэтому он не получает родные пассивные способности цели. Например, при превращении в Faceless Void Morphling все равно будет застывать в Chronosphere. Также Morphling может умереть как обычно, будучи превращенным, поскольку эта форма продолжает считаться им самим, а не отдельным клоном или иллюзией. Morphling визуально отличается от цели, в которую он обратился. Большинство баффов и дебаффов, полученных Morphling в превращении, остаются при нем при развоплощении. Большинство произносимых способностей прервутся при развоплощении, за исключением Phase Shift, Upheaval и способностей предметов.",
        "То есть герой продолжает считаться Morphling, поэтому он не получает родные пассивные способности цели.",
        "Например, при превращении в Faceless Void Morphling все равно будет застывать в Chronosphere.",
        "Также Morphling может умереть как обычно, будучи превращенным, поскольку эта форма продолжает считаться им самим, а не отдельным клоном или иллюзией.",
        "Morphling визуально отличается от цели, в которую он обратился.",
        "Большинство баффов и дебаффов, полученных Morphling в превращении, остаются при нем при развоплощении.",
        "Большинство произносимых способностей прервутся при развоплощении, за исключением Phase Shift, Upheaval и способностей предметов.",
        "Также копирует значения атрибутов цели, базовые характеристики, скорость передвижения, тип и дальность атаки. То есть при выборе героя ближнего боя с атрибутом силы Morphling будет этим героем всю длительность. Копирует только базовые атрибуты цели. Дополнительные атрибуты от способностей и предметов не копируются. Также не копирует бонусы от талантов. Также не копирует остальные базовые характеристики (показатели урона, брони, сопротивления магии и прочие).",
        "То есть при выборе героя ближнего боя с атрибутом силы Morphling будет этим героем всю длительность.",
        "Копирует только базовые атрибуты цели. Дополнительные атрибуты от способностей и предметов не копируются.",
        "Также не копирует бонусы от талантов.",
        "Также не копирует остальные базовые характеристики (показатели урона, брони, сопротивления магии и прочие).",
        "Morphling сохраняет при превращении текущее соотношение здоровье и маны в процентах и не копирует текущее здоровье\/ману цели.",
        "Убирает способности Morphling и заменяет их на все способности цели (включая пассивные), кроме ультимативной. В способности входят вспомогательные заклинания и даже способности, даваемые Aghanim's Scepter, за исключением Second Chakram, поскольку данная способность - часть ультимативной. Сюда также входят созданные заклинания Invoker или любые украденные Rubick неультимативные заклинания при превращении в него.",
        "В способности входят вспомогательные заклинания и даже способности, даваемые Aghanim's Scepter, за исключением Second Chakram, поскольку данная способность - часть ультимативной.",
        "Сюда также входят созданные заклинания Invoker или любые украденные Rubick неультимативные заклинания при превращении в него.",
        "При использовании Morph у Morphling остаются все его предметы, поскольку он не копирует предметы цели. То есть в случае, когда у Morphling есть Aghanim's Scepter, то данный предмет улучшит каждую скопированную улучшаемую способность. Поскольку таланты не копируются, то улучшения, даваемые ими, не действуют на скопированные Morphling способности.",
        "То есть в случае, когда у Morphling есть Aghanim's Scepter, то данный предмет улучшит каждую скопированную улучшаемую способность.",
        "Поскольку таланты не копируются, то улучшения, даваемые ими, не действуют на скопированные Morphling способности.",
        "Можно использовать на вражеских героев, включая иллюзии и клонов. Нельзя использовать на крипов-героев. При использовании на иллюзии способность копирует того героя, кому иллюзия принадлежит, а не того, с кого она скопирована. Например, при выборе иллюзии, созданной Disruption, то Morphling превращается в Shadow Demon, а не в героя, с которого была сделана иллюзия. С Aghanim's Scepter способность также может копировать союзных героев с теми же ограничениями. Morph нельзя использовать на самого Morphling или любую иллюзию под его контролем. При приручении врагом одной из иллюзий Morphling с помощью Enchant её все равно нельзя выбрать целью Morph, поскольку иллюзия продолжает считаться подконтрольной Morphling.",
        "При использовании на иллюзии способность копирует того героя, кому иллюзия принадлежит, а не того, с кого она скопирована.",
        "Например, при выборе иллюзии, созданной Disruption, то Morphling превращается в Shadow Demon, а не в героя, с которого была сделана иллюзия.",
        "С Aghanim's Scepter способность также может копировать союзных героев с теми же ограничениями.",
        "Morph нельзя использовать на самого Morphling или любую иллюзию под его контролем.",
        "При приручении врагом одной из иллюзий Morphling с помощью Enchant её все равно нельзя выбрать целью Morph, поскольку иллюзия продолжает считаться подконтрольной Morphling.",
        "Уменьшение расхода маны сочетается по закону убывающей полезности с остальными источниками уменьшения.",
        "Эта способность недоступна в режиме Ability Draft."
      ],
      "mana": "50",
      "hotKey": "R",
      "cooldown": "160\/100\/40 (TagTalent 140,8\/88\/35,2)",
      "description": "Герой изменяет свою форму по образу и подобию выбранного противника, получая его основные способности с уменьшенным расходом маны. Во время действия форму героя можно изменить на основную и наоборот.",
      "spellName": "Morph",
      "params": [
        "Анимация применения: 0,25+0,1",
        "Дальность применения: 700\/850\/1000",
        "Доп. дальность применения: 0 (TagAghanim 600)",
        "Уменьшение расхода маны: 50%",
        "Длительность: 20 (TagTalent 36)",
        "Позволяет применять способность на союзников. В форме другого героя увеличивается дальность применения способностей."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Если неотрывно смотреть в его воды, можно увидеть своё отражение."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Morphling_Morph_Replicate.mp3\/revision\/latest?cb=20191216020824",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Заменяет слот ультимативной способности Morphling на все время действия Morph. Классическая клавиша для способности будет установлена той же клавишей, которая назначена для ультимейта цели, выбранной для превращения.",
        "Классическая клавиша для способности будет установлена той же клавишей, которая назначена для ультимейта цели, выбранной для превращения.",
        "При применении Morph Replicate прерывает произносимые заклинания Morphling.",
        "Использование не завершает действие Morph. При этом способность возвращает Morphling к его оригинальной форме. При повторном использовании Morph Replicate снова превращает Morphling в выбранную ранее цель. Уходит на перезарядку при завершении превращения.",
        "Уходит на перезарядку при завершении превращения.",
        "При повторном превращении в цель Morphling вновь копирует все её способности. То есть при повторном превращении уровни скопированных способностей обновляются под их уровень у цели. Также, если цель получила новые заклинания (например, Invoker скомбинировал новое), Morphling их скопирует.",
        "То есть при повторном превращении уровни скопированных способностей обновляются под их уровень у цели.",
        "Также, если цель получила новые заклинания (например, Invoker скомбинировал новое), Morphling их скопирует."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Герой моментально превращается в копию врага или наоборот.",
      "spellName": "Morph Replicate",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "?",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 4.3,
    "attrAgility": 24.0
  },
  "description": "Morphling — это герой с дальним типом атаки, основной характеристикой которого является Ловкость. Первая способность, Waveform, растворяет Morphling и устремляется вперед, нанося повреждения всем врагам на своем пути. Во время использования способности герой неуязвим. Вторая и третья способности, Adaptive Strike (Ловкость) и Adaptive Strike (Сила), запускают во врага мощный поток воды, нанося цели урон или оглушая её, что частично зависит от силы и ловкости Morphling соответственно. Четвертая и пятая способности, Attribute Shift (Ловкость) и Attribute Shift (Сила), позволяют Morphling менять свою форму, превращая очки силы в очки ловкости и наоборот. Процесс обратим. Дополнительные уровни увеличат количество обмениваемых очков. Пассивно получает перманентный бонус к ловкости или силе. Ультимативная способность, Morph, превращает Morphling в копию указанного вражеского (при покупке Aghanim's Scepter в союзного) героя, которая использует обычные способности скопированного героя.",
  "history": "Многие века космос бороздила ледяная комета. Громадный шар, прикованный к дальней звезде неумолимыми силами гравитации, мчался сквозь тьму меж мирами, обретая в своём путешествии необычайные свойства. Однажды, в канун войны за Влой, комета рухнула со звёздного неба, оставив в ночи светящийся след, принятый обеими армиями как знак судьбы. Ледяной шар стремительно таял во вспышке кипящей жары, а две стороны схлестнулись в схватке по берегам узкой речонки. Тогда-то, вырвавшись из ледяного сна, был рождён Морфлинг — элементаль, обладающий силой стихии столь же капризной и необузданной, как сам океан. Он инстинктивно принял облик первого же генерала, отваживавшегося ступить в воду, и сразив того намертво, вступил в бой. Пока глупые солдатики бились друг с другом, элементаль перемещался по полю битвы, меняя форму одну за другой. Он мгновенно поглощал образы странных существ — то пехотинца, то лучника, то кавалериста, — и к тому мгновению, когда пал последний солдат, элементаль сыграл каждую роль. Конец этой битвы стал его началом.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+3 цели Adaptive Strike",
      "talentRight": "2 заряда Waveform"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Атаки во время Waveform",
      "talentRight": "-12% перезарядки заклинаний"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к скорости атаки",
      "talentRight": "+16 сек. к длительности Morph"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+275 к дальности Waveform",
      "talentRight": "+10 к ловкости"
    }
  ]
}