{
  "abilities": [
    {
      "notes": [
        "The strength talent effectively grants Night Stalker 400 health, 2 health regeneration, and 20 main attack damage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-50s Dark Ascension Cooldown",
          "talentRight": "+80 Hunter In The Night Attack Speed"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 Strength",
          "talentRight": "-4s Crippling Fear Cooldown"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+10% Hunter In The Night Movement Speed",
          "talentRight": "+40 Dark Ascension Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10s Dark Ascension Duration",
          "talentRight": "+45 Void Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Night_Stalker_Void.mp3\/revision\/latest?cb=20191216021028",
      "effects": [
        "Ability Target Unit (TagAghanim No Target)",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Also uses the night values during the night from Eclipse.",
        "Void first applies the slow debuff, then the damage, then the stun debuff.",
        "Has a cast backswing of 0.57 during Hunter in the Night.",
        "With Aghanim's Scepter, Void turns into a non-targetable ability affecting all enemy units within 900 radius. Does not target invisible units, or units inside the Fog of War within the radius.",
        "Does not target invisible units, or units inside the Fog of War within the radius."
      ],
      "mana": "80\/90\/100\/110",
      "item_behaviour": [],
      "name": "Void",
      "cooldown": "11\/10\/9\/8",
      "description": "Creates a damaging void that slows an enemy unit and deals damage. Void also mini-stuns, interrupting channeling abilities. The slowing effect lasts longer at night.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.33",
        "Cast Range: 525 (TagAghanim 0)",
        "Damage: 80\/160\/240\/320 (TagTalent 125\/205\/285\/365)",
        "Move Speed Slow: 50%",
        "Attack Speed Slow: 50",
        "Day Slow Duration: 1.25",
        "Night Slow Duration: 2.5\/3\/3.5\/4",
        "Day Stun Duration: 0",
        "Night Stun Duration: 0.1 (TagAghanim 0.5)",
        "Radius: 900",
        "Causes Void to be an AoE ability. Increases the ministun duration.",
        "Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "Not blocked when upgraded."
      ],
      "legacy_key": "V",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ee\/Night_Stalker_Crippling_Fear_1.mp3\/revision\/latest?cb=20191216021032",
      "effects": [
        "Ability No Target",
        "Affects Enemies"
      ],
      "notes": [
        "Also uses the night values during the night from Eclipse.",
        "The silence is provided by an aura, its debuff lingers for 0.5 seconds.",
        "The aura's duration does not update when it turns day or night while the buff is on.",
        "Has a cast backswing of 0.67 during Hunter in the Night."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Crippling Fear",
      "cooldown": "30\/25\/20\/15 (TagTalent 26\/21\/16\/11)",
      "description": "Night Stalker horrifies all nearby enemies, causing them to become silenced while near him. The effect lasts longer at night.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.2+0.43",
        "Radius: 375",
        "Day Duration: 3",
        "Night Duration: 4\/5\/6\/7",
        "Aura Linger Duration: 0.5",
        "Debuff persists if it was placed before spell immunity."
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Night_Stalker_Hunter_in_the_Night_move.mp3\/revision\/latest?cb=20191216021026",
      "effects": [
        "Ability Passive (TagAghanim Target Unit)",
        "Affects Self (TagAghanim Units)",
        "Damage Instant Kill"
      ],
      "notes": [
        "Also works during the night from Eclipse.",
        "With Aghanim's Shard, Hunter in the Night turns into an active ability. The passive effects are still present. Can be cast on any unit except for heroes, illusions, clones, creep-heroes, and Roshan. Cannot be cast on ancient creeps during daytime, but can during nighttime. The targeted creep is instantly killed, granting its gold and experience bounties if it was an enemy, denying it if it was an ally. Despite the visual effect, the health and mana restore are applied instantly on cast.",
        "Can be cast on any unit except for heroes, illusions, clones, creep-heroes, and Roshan.",
        "Cannot be cast on ancient creeps during daytime, but can during nighttime.",
        "The targeted creep is instantly killed, granting its gold and experience bounties if it was an enemy, denying it if it was an ally.",
        "Despite the visual effect, the health and mana restore are applied instantly on cast."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Hunter in the Night",
      "cooldown": "20",
      "description": "Night Stalker is in his element at night, attacking and moving with great swiftness.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+1.07",
        "Passive Move Speed Bonus: 22%\/28%\/34%\/40% (TagTalent 32%\/38%\/44%\/50%)",
        "Passive Attack Speed Bonus: 20\/40\/60\/80 (TagTalent 100\/120\/140\/160)",
        "Cast Range: 150",
        "Active Max Health as Heal: 35%",
        "Active Max Mana as Mana Restore: 35%",
        "Night Stalker can cast Hunter in the Night. Consumes a creep, instantly killing it and restoring 35% of Night Stalker's maximum HP and and 35% of maximum mana. Cannot target ancients during the daytime. Cooldown: 20"
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Night_Stalker_Dark_Ascension.mp3\/revision\/latest?cb=20191216021025",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Dark Ascension has a lower priority than the daytime caused by Supernova. During it, Night Stalker still flies, has the damage bonus and unobstructed vision, but the vision is limited to his default daytime vision.",
        "During it, Night Stalker still flies, has the damage bonus and unobstructed vision, but the vision is limited to his default daytime vision.",
        "Has a cast backswing of 0.5 seconds when cast during nighttime.",
        "The damage increasing talent immediately updates the currently running instance."
      ],
      "mana": "125\/175\/225",
      "item_behaviour": [],
      "name": "Dark Ascension",
      "cooldown": "150\/140\/130 (TagTalent 100\/90\/80)",
      "description": "Night Stalker smothers the sun and summons instant darkness, so that he might use his powers at their fullest. Night Stalker gains flight and bonus damage during this time. Has unobstructed vision.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0",
        "Attack Damage Bonus: 50\/100\/150 (TagTalent 90\/140\/190)",
        "Duration: 30 (TagTalent 40)"
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.3,
    "attrAgility": 18.0
  },
  "description": "Balanar, the Night Stalker, is a melee strength hero, renowned for being a very potent ganker once night falls.",
  "history": "Of the Night Stalker, there is no history, only stories. There are ancient tales woven into the lore of every race and every culture, of an impossible time before sunlight and daytime, when night reigned alone and the world was covered with the creatures of darkness--creatures like Balanar the Night Stalker. It is said that on the dawn of the First Day, all the night creatures perished. All, that is, save one. Evil's embodiment, Night Stalker delights in his malevolence. He created the primal role of the Night Terror, the Boogeyman, and as long as there have been younglings, his is the specter summoned to terrify them. This is a role he relishes; nor are these empty theatrics. He does indeed stalk the unwary, the defenseless, those who have strayed beyond the lighted paths or denied the warnings of their communities. Night Stalker serves as living proof that every child's worst nightmare....is true.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-50s Dark Ascension Cooldown",
      "talentRight": "+80 Hunter In The Night Attack Speed"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 Strength",
      "talentRight": "-4s Crippling Fear Cooldown"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+10% Hunter In The Night Movement Speed",
      "talentRight": "+40 Dark Ascension Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10s Dark Ascension Duration",
      "talentRight": "+45 Void Damage"
    }
  ]
}