{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Pipe_of_Insight_Barrier.mp3\/revision\/latest?cb=20191227195518",
      "effects": [
        "Ability No Target",
        "Affects Allies"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "Affects all allied units, including buildings, but excluding wards. Affects invulnerable, but not hidden allies.",
        "Blocks damage before any reductions, except Mana Shield.",
        "Recasting Barrier refreshes the buff and resets the barrier's absorb capacity.",
        "Does not stack with other magical damage barriers. If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance. However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity.",
        "If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance.",
        "However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity.",
        "Only blocks magical damage, coming from spells and attacks. Does not block any physical or pure damage.",
        "Does not share cooldown with Hood of Defiance."
      ],
      "mana": "100",
      "abilityName": "Barrier",
      "cooldown": null,
      "description": "Gives a shield that blocks 400 magic damage to all nearby allies. Lasts 12 seconds.",
      "params": [
        "Radius: 1200",
        "Magical Damage Absorbed: 400",
        "Duration: 12"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies"
      ],
      "notes": [
        "Stacks with all other sources of flat health regeneration and magic resistance, except with Insight Aura from multiple Pipes of Insight.",
        "Increases most heroes' total magic resistance to 32.5%, assuming basic 25% magic resistance and no other sources of magic resistance. Together with the passive bonus, this is further increased to 52.75% for the wielder of the item.",
        "Together with the passive bonus, this is further increased to 52.75% for the wielder of the item.",
        "Can regenerate up to 120 health in one minute.",
        "Does not affect wards, buildings and invulnerable units.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "abilityName": "Insight Aura",
      "cooldown": null,
      "description": "Gives allied units 2 health regeneration and 10% magic resistance.",
      "params": [
        "Radius: 1200",
        "Health Regeneration Bonus: 2",
        "Magic Resistance Bonus: 10%",
        "Aura Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The magic resistance stacks multiplicatively with other sources of magic resistance.",
    "Increases most heroes' total magic resistance to 47.5%, assuming basic 25% magic resistance and no other sources of magic resistance.",
    "Together with the aura, one Pipe of Insight grants a total of 10.5 health regeneration to the owner."
  ],
  "cost": "3425",
  "lore": null,
  "consistFrom": [
    "Hood of Defiance",
    "Headdress",
    "Recipe"
  ],
  "boughtFrom": "Support",
  "name": "Pipe of Insight",
  "description": "A powerful artifact of mysterious origin, it creates barriers against magical forces.",
  "trivia": [
    "In the transition from DotA to Dota 2, Pipe of Insight name was changed from the Khadgar's Pipe of Insight to simply Pipe of Insight. Khadgar was a wizard in Warcraft II.",
    "Dazzle's cosmetic item Pipe of Dezun is based on the Pipe of Insight."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+8.5 Health regeneration",
    "+30% Magic resistance"
  ],
  "tips": [
    "The Pipe of Insight is useful for frail heroes who can be easily taken down by damages from spells. With its aura, it can slightly increase the magic resistance of a hero.",
    "It is an ideal for a support heroes to carry a Pipe of Insight in order to protect the nearby allies against the strongest magic spells.",
    "It is best combined with Crimson Guard and any abilities that grants damage block."
  ]
}