{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на ловкость в общем даёт Hoodwink: 2,67 брони, 16 скорости атаки и 16 урона от атаки.",
        "Снижение брони от талантов не отключается истощением. Снижение брони длится 10 секунд и сочетается с талантами на снижение брони от других героев.",
        "Снижение брони длится 10 секунд и сочетается с талантами на снижение брони от других героев."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Sharpshooter наносит чистый урон сквозь защиту от магии",
          "talentRight": "2 заряда Acorn Shot"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Атаки снижают броню на 3",
          "talentRight": "+25% к скорости подготовки и заряда Sharpshooter"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+16 к ловкости",
          "talentRight": "Камуфляж от Scurry"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-4 сек. перезарядки Bushwhack",
          "talentRight": "+200 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a0\/Hoodwink_Acorn_Shot_1.mp3\/revision\/latest?cb=20201219182025",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Дальность применения Acorn Shot основана на дальности атаки владельца способности. Вместе с бонусом самой способности, Acorn Shot имеет эффективную дальность применения 1100. Бонус дальности применения может быть увеличен другими бонусами дальности атаки, а также бонусами дальности применения",
        "Вместе с бонусом самой способности, Acorn Shot имеет эффективную дальность применения 1100.",
        "Бонус дальности применения может быть увеличен другими бонусами дальности атаки, а также бонусами дальности применения",
        "Желудь летит со скоростью 1000.",
        "Снаряд отскакивает с интервалом в 0,1 секунды.",
        "Может перескочит на ту же цель, но только после того как попадёт в другую цель во время отскока.",
        "Не может отскочить в невидимых, неуязвимых или спрятанных существ, но может отскакивать в существ в тумане войны.",
        "Когда выбрано существо изначальное попадание не учитывает лимит отскоков поэтому снаряд может отскочить 3\/4\/5\/6 раз.",
        "Заставляет Hoodwink совершать мгновенные атаки по врагам когда снаряд отскакивает. Эти атаки не обладают точностью, но игнорируют обезоруживание. Может вызвать любые Модификаторы атаки и эффекты от атаки как обычно.",
        "Эти атаки не обладают точностью, но игнорируют обезоруживание.",
        "Может вызвать любые Модификаторы атаки и эффекты от атаки как обычно.",
        "Замедление не зависит от мгновенной атаки и накладывается, даже если мгновенная атака промахивается.",
        "Снаряд сначала выполняет мгновенную атаку, а затем применяет дебафф.",
        "Снаряд даёт 200 летающего обзора вокруг цели а затем накладывает дебафф.",
        "При применении на точку, появляется дерево. Посаженное дерево, по сравнению с обычными деревьями, меньше блокирует видимость и имеет маленький размер столкновения. Посаженное дерево дает 200 наземного обзора вокруг себя. Обзор пропадает через 20 секунд либо если дерево уничтожено. В отличии от других посаженных деревьев, применение Tango к дереву от Acorn Shot не увеличивает длительность лечения. Если включено Авто-применение, то способность всегда будет применятся на точку.",
        "Посаженное дерево дает 200 наземного обзора вокруг себя. Обзор пропадает через 20 секунд либо если дерево уничтожено.",
        "В отличии от других посаженных деревьев, применение Tango к дереву от Acorn Shot не увеличивает длительность лечения.",
        "Если включено Авто-применение, то способность всегда будет применятся на точку."
      ],
      "mana": "75\/85\/95\/105",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10 (TagTalent 0)",
      "description": "Герой выстреливает жёлудем в выбранного врага, нанося урон от атаки. Жёлудь отскакивает в существ неподалёку, замедляя их и нанося дополнительный урон. Можно применить на точку, чтобы создать дерево, после чего желудь отскочит в ближайших врагов.",
      "spellName": "Acorn Shot",
      "params": [
        "Анимация применения: 0,2+1,37",
        "Дальность применения: 525",
        "Дополнительная дальность атаки: 125\/200\/275\/350",
        "Дополнительный урон: 50\/75\/100\/125",
        "Урона от атаки: 75%",
        "Число отскоков: 2\/3\/4\/5",
        "Замедление скорости передвижения: 100%",
        "Длительность замедления: 0,25",
        "Длительность дерева: 20",
        "Число зарядов: 2",
        "Время восстановления заряда: 16\/14\/12\/10",
        "Можно применить на врагов с иммунитетом. Не пытается замедлить врагов с иммунитетом.",
        "Блокируется только при применении на существо. Не блокируется при применении на точку."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Прохвостка совсем не привередливая, но из желудей дубового и железного дерева получаются самые эффективные снаряды — их она и припасла больше всего."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Hoodwink_Bushwhack_1.mp3\/revision\/latest?cb=20201219182032",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд летит со скоростью 1200.",
        "Bushwhack может задеть существ на расстоянии до 1265 (максимальная дальность применения + радиус).",
        "Если в выбранной области нет деревьев, то ничего не произойдёт.",
        "Затронутые существа оглушаются и перемещаются к дереву которое находится ближе всего к центру радиуса применения способности. Однако если на пути есть другое дерево, то существо привяжется к нему. Перемещает существ к дереву со скоростью 1000. При попадании дает общий обзор, показывая их точное местоположение на время действия дебаффа.",
        "Однако если на пути есть другое дерево, то существо привяжется к нему.",
        "Перемещает существ к дереву со скоростью 1000.",
        "При попадании дает общий обзор, показывая их точное местоположение на время действия дебаффа.",
        "Если юнит привязан к обычному дереву на карте, разрушение этого дерева освобождает его от Bushwhack. Привязанные юниты могут быть освобождены любым источником принудительного движения. Однако если существо привязано к созданному дереву (например Iron Branch, или Acorn Shot), оно не освободится.",
        "Привязанные юниты могут быть освобождены любым источником принудительного движения.",
        "Однако если существо привязано к созданному дереву (например Iron Branch, или Acorn Shot), оно не освободится.",
        "Если Bushwhack привязывает существо к посаженному дереву с длительностью существования, это посаженное дерево не может исчезнуть, пока не закончится Buswhack.",
        "Применяет к пораженным врагам True Sight на длительность дебаффа.",
        "Даёт летающий обзор в радиусе 265 вокруг цели в течении 1,5\/1,8\/2,1\/2,4 сек.",
        "Действует на существ в тумане войны, но не на невидимых существ."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "14 (TagTalent 10)",
      "description": "Герой бросает сеть-ловушку, которая оглушает вражеских героев, если они находятся в области действия рядом с деревом. Ловушка наносит урон и притягивает жертв к ближайшему дереву, лишая их обзора на время оглушения.",
      "spellName": "Bushwhack",
      "params": [
        "Анимация применения: 0,2+1,07",
        "Дальность применения: 1000",
        "Радиус: 265",
        "Урон: 75\/150\/225\/300",
        "Длительность оглушения: 1,5\/1,8\/2,1\/2,4"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Прохвостка предпочитает устраивать засады в зарослях железных деревьев, но самые осмотрительные гости туманной рощи не теряют бдительности никогда."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Hoodwink_Scurry_1.mp3\/revision\/latest?cb=20201219182019",
      "effects": [
        "Способность Ненаправленная \/ Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Hoodwink получает 2 заряда сразу после изучения Scurry.",
        "Применение прерывает прерываемые способности Hoodwink.",
        "Даёт сквозное передвижение и передвижение сквозь деревья для Hoodwink.",
        "Уклонение от Scurry складывается мультипликативно с другими источниками уклонения и использует псевдослучайное распределение.",
        "Пассивный модификатор изначально скрыт и становится виден когда герой находится рядом с деревом.",
        "Уклонение и активная часть способности не связаны друг с другом. Уклонение всегда будет активно.",
        "Уклонение всегда будет активно.",
        "Когда выбран соответствующий талант 15 уровня, Hoodwink получает невидимость и сквозное перемещение когда находится в радиусе 275 поиска дерева в течении 1,2 секунд. Невидимость прерывается при использовании способностей или предметов, или атаке. Остальные действия не прерывают невидимость. Невидимость также теряется при смене местонахождения. Это означает, что принудительное движение прервет невидимость. Это также означает, что при отдаче команды передвижения (M) невидимость не прервется, однако при непосредственном передвижении эффект пропадает.",
        "Невидимость прерывается при использовании способностей или предметов, или атаке. Остальные действия не прерывают невидимость.",
        "Невидимость также теряется при смене местонахождения. Это означает, что принудительное движение прервет невидимость.",
        "Это также означает, что при отдаче команды передвижения (M) невидимость не прервется, однако при непосредственном передвижении эффект пропадает."
      ],
      "mana": "35",
      "hotKey": "E",
      "cooldown": "0",
      "description": "Герой имеет шанс избежать физических атак, находясь рядом с деревьями. При активации эта способность ускоряет передвижение и позволяет проходить сквозь существ и деревья.",
      "spellName": "Scurry",
      "params": [
        "Анимация применения: 0+0",
        "Пассивный радиус поиска дерева: 275",
        "Пассивное уклонение: 8%\/16%\/24%\/32%",
        "Активный бонус к скорости передвижения: 20%\/25%\/30%\/35%",
        "Активная длительность: 4",
        "Количество зарядов: 2",
        "Скорость восстановления заряда: 30\/24\/18\/12",
        "Пассивное время до выхода из невидимости: 1,2",
        "Пассивное уклонение отключается истощением.",
        "Пассивное уклонение и камуфляж работают на иллюзиях."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "В роще Томо'кан нет ни норки, ни веточки, куда не дотянулись бы лапки Прохвостки."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bd\/Hoodwink_Decoy_1.mp3\/revision\/latest?cb=20210410154146",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "↓↓ Двойное нажатие автоматически выбирает текущее место курсора. Игнорирует интерфейс, так что таким путём нельзя применить через мини-карту.",
        "Decoy можно применять без поворота к выбранной точке.",
        "При применении не прерывает произносимые способности Hoodwink или любые другие приказы.",
        "При создании иллюзия автоматически следует в указанную точку.",
        "Иллюзия появляется с баффом Scurry основаном на текущем уровне способности. Если Scurry не изучена, бафф всеравно устанавливается, но без каких-либо значений. Это значит что она не даст бонус к скорости передвижения, но всё ещё даст сквозное передвижение и передвижение сквозь деревья.",
        "Если Scurry не изучена, бафф всеравно устанавливается, но без каких-либо значений.",
        "Это значит что она не даст бонус к скорости передвижения, но всё ещё даст сквозное передвижение и передвижение сквозь деревья.",
        "Установка дерева и оглушение по области применяются только если иллюзию спровоцируют. Они не применятся если иллюзия будет уничтожена другим путём или исчезнет. Иллюзия провоцируется когда вражеский герой (включая иллюзии, клонов и крипов-героев) наносит по ней атаку. Промахнувшиеся атаки не считаются. Она также провоцируется если на неё была нацелена способность, следуя правилам блокировки заклинаний.",
        "Иллюзия провоцируется когда вражеский герой (включая иллюзии, клонов и крипов-героев) наносит по ней атаку. Промахнувшиеся атаки не считаются.",
        "Она также провоцируется если на неё была нацелена способность, следуя правилам блокировки заклинаний.",
        "Когда спровоцирована, иллюзия мгновенно уничтожается и это никому не засчитывается. Создаёт обычное посаженное дерево в том месте где была спровоцирована. Это дерево меньше других деревьев на карте и имеет меньший размер столкновения. Tango лечит вдвое дольше при выборе дерева от Decoy. Хоть и используется модификатор Bushwhack, оглушение по области является полностью независимым от способности.",
        "Создаёт обычное посаженное дерево в том месте где была спровоцирована. Это дерево меньше других деревьев на карте и имеет меньший размер столкновения.",
        "Tango лечит вдвое дольше при выборе дерева от Decoy.",
        "Хоть и используется модификатор Bushwhack, оглушение по области является полностью независимым от способности."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "60",
      "description": "Герой отправляет в указанную точку иллюзию-обманку. Если враг атакует эту иллюзию или применит на неё направленную способность, на её месте появится дерево, вокруг которого на вражеских героев сработает слабая версия способности Bushwack. Иллюзия существует 12 секунд.",
      "spellName": "Decoy",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: Глобальная",
        "Количество иллюзий: 1",
        "Урон наносимый иллюзией: 0%",
        "Урон получаемый иллюзией: 200%",
        "Длительность иллюзии: 12",
        "Радиус оглушения: 250",
        "Длительность оглушения: 1",
        "Длительность дерева: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Hoodwink_Hunter%27s_Boomerang_1.mp3\/revision\/latest?cb=20210410154149",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "Можно применять на существ, включая союзников, но исключая себя, постройки и варды. Выбор союзников отправляет бумеранг к ним, но не действует на них.",
        "Выбор союзников отправляет бумеранг к ним, но не действует на них.",
        "Бумеранг или летит со скоростью 900 или достигает указанное существо между 0,5 и 1,2 секунды, смотря что быстрее. Так же и при возвращении. Это значит что бумеранг может лететь минимум 1 секунду и максимум 2,4 секунды. Длительность устанавливается при применении, основываясь на расстояниях. Если расстояния изменяются после применения, то скорость адаптируется к предопределённой длительности. Например, если цель была на расстоянии 450 при применении, то бумеранг полностью возвратится через 1 секунду. Если цель была на расстоянии более чем 1800, то бумеранг полностью возвратится через 2,4 секунды.",
        "Это значит что бумеранг может лететь минимум 1 секунду и максимум 2,4 секунды.",
        "Длительность устанавливается при применении, основываясь на расстояниях. Если расстояния изменяются после применения, то скорость адаптируется к предопределённой длительности. Например, если цель была на расстоянии 450 при применении, то бумеранг полностью возвратится через 1 секунду. Если цель была на расстоянии более чем 1800, то бумеранг полностью возвратится через 2,4 секунды.",
        "Например, если цель была на расстоянии 450 при применении, то бумеранг полностью возвратится через 1 секунду.",
        "Если цель была на расстоянии более чем 1800, то бумеранг полностью возвратится через 2,4 секунды.",
        "Бумеранг всегда бросается справа от Hoodwink и возвращается с противоположной стороны. Он летит к цели по дуге по правой стороне и возвращается к Hoodwink отзеркаленной дугой. Обе дуги имеют общую ширину 400. Минимальное расстояние полёта также равно 400, так что при выборе точки на расстоянии ближе чем 400 он полетит по треугольному пути со сторонами длиной в 400 единиц.",
        "Он летит к цели по дуге по правой стороне и возвращается к Hoodwink отзеркаленной дугой.",
        "Обе дуги имеют общую ширину 400.",
        "Минимальное расстояние полёта также равно 400, так что при выборе точки на расстоянии ближе чем 400 он полетит по треугольному пути со сторонами длиной в 400 единиц.",
        "Бумеранг сперва применяет дебафф, а потом — урон.",
        "Основная цель получает урон и дебафф при попадании в радиус действия бумеранга, как и любое другое существо. Тем не менее, бумеранг начнёт возвращаться как только полностью достигнет цели и не раньше.",
        "Тем не менее, бумеранг начнёт возвращаться как только полностью достигнет цели и не раньше.",
        "Применяет усиление основного входящего урона к цели. Аддитивно сочетается с другими источниками манипуляторами входящим основным уроном. Усиление действует лишь на получаемый целью урон заклинаний, который не отмечен как отнимающий здоровье. Урон от атаки не усиливается. Так как он использует усиление входящего урона, он также действует на урон способностей которые игнорируют усиление исходящего урона, такие как Damage Return и Moon Glaives.",
        "Усиление действует лишь на получаемый целью урон заклинаний, который не отмечен как отнимающий здоровье. Урон от атаки не усиливается.",
        "Так как он использует усиление входящего урона, он также действует на урон способностей которые игнорируют усиление исходящего урона, такие как Damage Return и Moon Glaives."
      ],
      "mana": "125",
      "hotKey": "F",
      "cooldown": "18",
      "description": "Герой швыряет в указанного врага бумеранг, который летит по дуге и возвращается к владельцу при достижении цели. Бумеранг наносит урон всем врагам на пути и накладывает на них охотничью метку, которая замедляет жертв, увеличивает получаемый ими урон от заклинаний и уменьшает их сопротивление эффектам.",
      "spellName": "Hunter's Boomerang",
      "params": [
        "Анимация применения: 0,2+1,07",
        "Дальность применения: 1000",
        "Радиус бумеранга: 150",
        "Расстояние дуги бумеранга: 400",
        "Урон: 350",
        "Замедление скорости передвижения: 20%",
        "Усиление входящего урона от заклинаний: 25%",
        "Уменьшение сопротивления эффектам: 25%",
        "Длительность дебаффа: 7",
        "Полностью блокируется только если цель является основной. Блокируется при столкновении. При блокировке бумеранг не возвращается.",
        "При избегании бумеранг начнёт возвращаться как только достигнет последнего места цели до избегания."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Hoodwink_Sharpshooter_1.mp3\/revision\/latest?cb=20201219182022",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический Чистый"
      ],
      "notes": [
        "Для лучшей читаемости, скорость поворота во время Sharpshooter предоставлена градусами в секунду, вместо радиан в 0,03 секунды. 60° градусов в секунду равняется скорости поворота 0,031.",
        "60° градусов в секунду равняется скорости поворота 0,031.",
        "Таймер над головой Hoodwink показывает сколько времени осталось до выстрела. Этот таймер виден всем.",
        "Направление можно менять с помощью приказа на передвижение (M). Порядок перемещения задается щелчком правой кнопкой мыши или нажатием горячей клавиши перемещения и выборе цели. Индикатор линии размещается перед Hoodwink во время прицеливания, показывая путь, по которому он пойдет после выпуска. Индикатор также показывает, как долго он заряжается, сначала зеленый, затем медленно становится красным в течение 5 секунд. Индикатор виден только игроку. Ни союзники, ни враги его не видят.",
        "Индикатор линии размещается перед Hoodwink во время прицеливания, показывая путь, по которому он пойдет после выпуска.",
        "Индикатор также показывает, как долго он заряжается, сначала зеленый, затем медленно становится красным в течение 5 секунд.",
        "Индикатор виден только игроку. Ни союзники, ни враги его не видят.",
        "Hoodwink может выполнять другие действия во время Sharpshooter. Ненаправленные заклинания и предметы используются как обычно. Однако предметы требующие поворота в сторону применения, могут быть применены только в том случае, если они нацелены в текущем направлении взгляда. Выбор цели вне направлении взгляда героя, заставит героя остановится в повороте, пока не будет отдан приказ стоп (S) или удерживать позицию.",
        "Однако предметы требующие поворота в сторону применения, могут быть применены только в том случае, если они нацелены в текущем направлении взгляда.",
        "Выбор цели вне направлении взгляда героя, заставит героя остановится в повороте, пока не будет отдан приказ стоп (S) или удерживать позицию.",
        "Hoodwink получает обезоруживание во время Sharpshooter. Приказы атаки действуют как приказы движения во время обезвреживания, поэтому щелчок правой кнопкой мыши по врагу также устанавливает новое местоположение.",
        "Нельзя отменить ничем, кроме End Sharpshooter и смерти. Его нельзя прервать обезвреживаниями.",
        "После выпуска снаряда, Hoodwink отбрасывается по дуге высотой 75 и расстоянием до 350 за 0,4 секунд, или пока снова не коснется земли. Это означает, что расстояние и продолжительность отбрасывания можно уменьшить \/ увеличить, прыгая вверх \/ вниз со скалы или другой возвышенности.",
        "Это означает, что расстояние и продолжительность отбрасывания можно уменьшить \/ увеличить, прыгая вверх \/ вниз со скалы или другой возвышенности.",
        "Урон начинается с 0 и увеличивается на 18,33\/30\/41,67 (TagTalent 24,44\/40\/55,56) за каждые 0,03 секунды применения, достигая полного урона за 3 секунд.",
        "Длительность дебаффа начинается с 0 и увеличивается на 0,17 (TagTalent 0,22) за каждые заряженные 0,03 секунды, достигнув полной продолжительности в 3 секунд.",
        "Снаряд движется со скоростью 2200 (TagTalent 2750), и пролетает все расстояние или пока не достигнет цель.",
        "Стрела начинается с позиции Hoodwink. Она может поражать существ до расстояния 3125. Она не учитывает существ за начальной точкой.",
        "Может поразить только героев или крипов-героев. Не поражает неуязвимых или спрятанных существ, пролетая сквозь них.",
        "Снаряд сначала применяет дебафф, затем наносит урон.",
        "Снаряд даёт летающий обзор в радиусе 350 во время полёта. Этот обзор не имеет задержки.",
        "Анимация перед применением начинается в момент начала применения, поэтому эффективная анимация перед применением зависит от того, когда был произведен выстрел. Это означает, что анимация перед применением может варьироваться от 4,5 до 9,5 секунд.",
        "Это означает, что анимация перед применением может варьироваться от 4,5 до 9,5 секунд."
      ],
      "mana": "125\/175\/225",
      "hotKey": "R",
      "cooldown": "45",
      "description": "Герой готовит смертельный выстрел из своего арбалета. Он наносит вражескому герою огромный урон, замедляет его и накладывает истощение. Урон и длительность эффекта становятся максимальными спустя 3 сек. подготовки, а выстрел происходит автоматически спустя 5 сек. Отдача отталкивает героя назад на расстояние в 350.",
      "spellName": "Sharpshooter",
      "params": [
        "Анимация применения: 0+9,5",
        "Дальность применения: 3000",
        "Максимальная дистанция полёта: 3000",
        "Радиус попадания снаряда: 125",
        "Скорость поворота во время прицеливания: 60°",
        "Максимальное время подготовки: 3 (TagTalent 2,25)",
        "Максимальное время прицеливания: 5",
        "Дистанция отдачи: 350",
        "Максимальный урон: 550\/900\/1250",
        "Замедление скорости передвижения: 30%\/40%\/50%",
        "Максимальная длительность замедления: 5",
        "Длительность отдачи: 0,4",
        "Даёт новую способность: Hunter's Boomerang.",
        "Даёт новую способность: Decoy.",
        "Не действует на врагов с иммунитетом. Проходит через иммунитет при выборе соответствующего таланта."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Первый арбалет-самострел Прохвостка нашла по случайности, но теперь она холит и лелеет свой собственный — и, разумеется, некоторые его детали она у кого-то стянула или добыла другим способом."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Sharpshooter до завершения применения.",
        "При использовании прерывает произносимые способности Hoodwink."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "0",
      "description": "Совершить выстрел и вернуть способность передвигаться и атаковать.",
      "spellName": "End Sharpshooter",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Огонь!"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 17.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 3.6,
    "attrAgility": 24.0
  },
  "description": "Hoodwink, или Прохвостка — это герой с дальним типом атаки и основным атрибутом ловкость. Она имеет четыре способности, каждая из которых является активной. При помощи первой способности Acorn Shot герой выстреливает в выбранного врага жёлудем, который наносит урон от физической атаки и начинает отскакивать в ближайших существ, замедляя их и нанося дополнительный урон. Способность можно применить на точку — тогда на ней вырастет дерево и выстрелит жёлудем, который так же начнёт отскакивать по врагам. Вторая способность героя — Bushwhack; она позволяет Прохвостке бросить на врагов сеть-ловушку, которая сработает, если они находятся рядом с деревом. Сеть нанесёт урон, оглушит противников и лишит их обзора на время оглушения. Третья способность Scurry даёт Hoodwink увеличенную скорость передвижения и возможность проходить сквозь существ и деревья. Также, способность пассивно даёт герою небольшой шанс уклонения, если она находится рядом с деревом. При активации ультимативной способности Sharpshooter Прохвостка начинает готовить смертельный выстрел из арбалета. Выстрел нанесёт вражескому герою огромный урон и наложит на него эффект истощения, а саму Hoodwink из-за отдачи оттолкнёт на небольшое расстояние. Выстрел зарядится полностью по истечении 3 секунд, а ещё через 2 секунды он произойдёт автоматически. Во время подготовки направление вектора выстрела можно изменять, а также в любой момент прервать способность.",
  "history": "Юные годы Прохвостки прошли в беззаботных зелёных раздольях, которые когда-то окутывали Кримвол. Однако чем больше ширилось королевство, тем ненасытнее становились нужды его армии и граждан. Соперничающие бароны рудников и лесопилок словно сцепились в прожорливой схватке: кто быстрее истребит красоты пограничных лесов и насытит растущие потребности изменяющихся земель? А вот гонимым жителям древней пущи оставался не лучший выбор: либо жить беженцами на захваченных территориях, либо погибнуть от стали или чёрного пороха Кримвола в попытках отстоять свой дом, либо бежать дальше на север и попытать удачу средь жутких долин и лесков туманной рощи Томо'кан. Именно в этой коварной северной роще и обжилась Прохвостка. Она умела перехитрить ужасных томо'канских хищников, снискать расположение среди одних местных бандитов, разозлив других, и непременно путалась под ногами, встревая во всевозможные интересные передряги... довольно часто, как поговаривают, становясь их причиной. Но как только и в этом приёмном доме повеяло кримвольским порохом, все мысли Прохвостки захватили родные и знакомые, которые могли пережить вторжение и были вынуждены скитаться по разоренным землям, терзающим душу одним своим видом. В итоге Прохвостка решилась отправиться навстречу цивилизации, чтобы взглянуть на злодеев, разрушивших её прежнюю жизнь. Обнаружила она, что чудища из ее детства — не чудища вовсе. Это были обычные люди. Солдаты, рабочие, торговцы... и беженцы. И даже солдаты Кримвола с их порохом и сталью в подмётки не годились монстрам Томо'кана — настоящим монстрам‚ с щупальцами и клыками‚— меж которыми она полила, словно кленовая крылатка. Зная, что она всегда может укрыться в лозах Томо'кана, куда страшатся ступать теплокровные с головой на плечах, Прохвостка даёт бой тем, кто смеет посягнуть на границы рощи. А заодно с радостью прикарманивает приглянувшиеся вещи захватчиков, портит те, от которых ей нет пользы, и помогает любой родственной душе вновь обрести жизнь среди бескрайней зелени.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Sharpshooter наносит чистый урон сквозь защиту от магии",
      "talentRight": "2 заряда Acorn Shot"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Атаки снижают броню на 3",
      "talentRight": "+25% к скорости подготовки и заряда Sharpshooter"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+16 к ловкости",
      "talentRight": "Камуфляж от Scurry"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-4 сек. перезарядки Bushwhack",
      "talentRight": "+200 к здоровью"
    }
  ]
}