{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as base attack damage. It benefits illusions, and is affected by every percentage-based damage increasing or reducing effects.",
        "It benefits illusions, and is affected by every percentage-based damage increasing or reducing effects."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-1.5s Enchant Totem Cooldown",
          "talentRight": "+200 Aftershock Range"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+320 Fissure Range",
          "talentRight": "+40 Echo Damage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+50 Aftershock Damage",
          "talentRight": "+25 Movement Speed"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+80 Fissure Damage",
          "talentRight": "+30 Base Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Earthshaker_Fissure_1.mp3\/revision\/latest?cb=20191216013150",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Fissure's effects are instantly applied within its whole area. There is no travel time.",
        "The fissure is created using many segments lined up in front of Earthshaker. The amount of segments determines the total effective range of the Fissure. The segments have a collision size of 24, and a distance of 8.25 between each other, with the first one being placed 8.25 range in front of Earthshaker. This means the actual length of the Fissure can only be a factor of 56.25. It is defined as (2 * 24 + 8.25) so that it never exceeds the listed values. Therefore, Fissure consists of 24 (TagTalent 30) segments, resulting in an actual range of 1350 (TagTalent 1687.5). Every unit (except wards and buildings) which is within that radius upon cast is pushed aside.",
        "The segments have a collision size of 24, and a distance of 8.25 between each other, with the first one being placed 8.25 range in front of Earthshaker.",
        "This means the actual length of the Fissure can only be a factor of 56.25. It is defined as (2 * 24 + 8.25) so that it never exceeds the listed values.",
        "Therefore, Fissure consists of 24 (TagTalent 30) segments, resulting in an actual range of 1350 (TagTalent 1687.5).",
        "Every unit (except wards and buildings) which is within that radius upon cast is pushed aside.",
        "The stun and damage are applied in a circular shape around each segment. This means the total damage\/stun radius consists of multiple overlapping circles, and not a smooth line. A unit can only be hit by one instance per cast, even when within the damage\/stun radius of multiple segments. Can hit units up to 1575 (TagTalent 1912.5) range in front and 216.75 range behind Earthshaker.",
        "A unit can only be hit by one instance per cast, even when within the damage\/stun radius of multiple segments.",
        "Can hit units up to 1575 (TagTalent 1912.5) range in front and 216.75 range behind Earthshaker.",
        "Fissure first applies the debuff, then the damage.",
        "Flying units and units with unobstructed movement (e.g. Spectral Dagger, Spin Web) are not blocked by Fissure. They still are fully affected by it otherwise when hit. They are pushed aside, stunned and damaged.",
        "They still are fully affected by it otherwise when hit. They are pushed aside, stunned and damaged.",
        "Non-player-controlled units (i.e. lane creeps) do not try to path around the Fissure, but simply walk against it as if it is not there. This effectively causes them to get stuck, until they change directions (e.g. when being aggro'd), or until the Fissure dissipates.",
        "This effectively causes them to get stuck, until they change directions (e.g. when being aggro'd), or until the Fissure dissipates.",
        "With Aghanim's Shard, the Fissure segments provide the caster with unobstructed movement while within 150 range of them. The modifier lingers for 1 second. This means the caster can path through anything while standing on the Fissure and for a short time after leaving its area. Also, Aftershock based on the current level gets applied around each of Fissure's segments whenever it gets triggered. A unit can only be hit by one instance of Aftershock per cast, even when within the damage\/stun radius of multiple segments. The Aftershock uses a reduced stun duration of 0.3\/0.45\/0.6\/0.75 seconds.",
        "This means the caster can path through anything while standing on the Fissure and for a short time after leaving its area.",
        "Also, Aftershock based on the current level gets applied around each of Fissure's segments whenever it gets triggered.",
        "A unit can only be hit by one instance of Aftershock per cast, even when within the damage\/stun radius of multiple segments.",
        "The Aftershock uses a reduced stun duration of 0.3\/0.45\/0.6\/0.75 seconds."
      ],
      "mana": "125\/140\/155\/170",
      "hotKey": "Q",
      "cooldown": "21\/19\/17\/15 (TagTalent 19\/17\/15\/13)",
      "description": "Slams the ground with a mighty totem, creating an impassable ridge of stone while stunning and damaging enemy units along its line.",
      "spellName": "Fissure",
      "params": [
        "Cast Animation: 0.69+0",
        "Cast Range: 1400 (TagTalent 1720)",
        "Fissure Length: 1400 (TagTalent 1720)",
        "Fissure Pathing Block Radius: 24",
        "Fissure Damage\/Stun Radius: 225",
        "Damage: 110\/160\/210\/260 (TagTalent 190\/240\/290\/340)",
        "Stun Duration: 1\/1.25\/1.5\/1.75",
        "Fissure Duration: 6.5\/7\/7.5\/8",
        "Free Pathing Radius: 150",
        "Free Pathing Linger Duration: 1",
        "Aftershock Stun Duration Percentage: 50%",
        "Reduces Fissure cooldown by 2 seconds and allows Earthshaker to walk on it. When he casts an ability, an aftershock is released along its path.",
        "Pushes aside and blocks path for all spell immune units. Does not stun or attempt to damage spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Earthshaker_Enchant_Totem_1.mp3\/revision\/latest?cb=20191216013148",
      "effects": [
        "Ability No Target (TagAghanim Target Unit \/ Target Area)",
        "Affects Self"
      ],
      "notes": [
        "Upon cast, Enchant Totem increases Earthshaker's attack range to 225. Grants flat bonus attack damage based on the caster's main attack damage. Does not further increase bonus attack damage. The Enchant Totem buff is only used up upon successfully hitting a target. Missed attacks do not waste it.",
        "Grants flat bonus attack damage based on the caster's main attack damage. Does not further increase bonus attack damage.",
        "The Enchant Totem buff is only used up upon successfully hitting a target. Missed attacks do not waste it.",
        "With Aghanim's Scepter, Enchant Totem turns into an area-targeted ability. It may only target the ground or self. ↓↓ Double-tapping automatically targets self. When self-targeted, Enchant Totem behaves like the non-upgraded version, using 1.1-second cast animation and not leaping. When ground-targeted, it has no cast point or cast backswing. The leap duration is always the same, so the speed adapts based on the targeted distance. The leap height is always 950 range. During the leap, Earthshaker is fully disabled, unable to move, turn, attack or cast abilities or items. The ability counts as cast as soon as the leap starts, however, Aftershock and the totem buff are applied upon landing. Getting disabled during the leap does not prevent the Aftershock and the totem buff from being applied. Getting hit by other sources of Forced Movement causes the leap's trajectory to change, but it is not interrupted. However, getting hit by forced movement causes the ability to not apply Aftershock or the totem buff upon landing. The ability is fully and immediately canceled when getting moved upwards or teleported by other abilities. While in the air, other units may pass below Earthshaker. The targeting reticule shows the radius of Aftershock, even when it hasn't been learned yet. The Enchant Totem buff grants the caster cleave while it is present, if they are a melee hero. Cleave damage cannot be amplified with outgoing spell damage amplification and cannot spell lifesteal. Can be amplified by incoming spell damage amplification. Cleave damage is reduced by Damage Block. The complete area is shaped like an isosceles trapezoid in front of the attacking Earthshaker. Fully stacks with other sources of cleave. Each source of cleave works independently. Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave. Despite the visual effect, cleave damage is applied instantly in the whole area.",
        "↓↓ Double-tapping automatically targets self.",
        "When self-targeted, Enchant Totem behaves like the non-upgraded version, using 1.1-second cast animation and not leaping.",
        "When ground-targeted, it has no cast point or cast backswing.",
        "The leap duration is always the same, so the speed adapts based on the targeted distance. The leap height is always 950 range.",
        "During the leap, Earthshaker is fully disabled, unable to move, turn, attack or cast abilities or items.",
        "The ability counts as cast as soon as the leap starts, however, Aftershock and the totem buff are applied upon landing.",
        "Getting disabled during the leap does not prevent the Aftershock and the totem buff from being applied.",
        "Getting hit by other sources of Forced Movement causes the leap's trajectory to change, but it is not interrupted.",
        "However, getting hit by forced movement causes the ability to not apply Aftershock or the totem buff upon landing.",
        "The ability is fully and immediately canceled when getting moved upwards or teleported by other abilities.",
        "While in the air, other units may pass below Earthshaker.",
        "The targeting reticule shows the radius of Aftershock, even when it hasn't been learned yet.",
        "The Enchant Totem buff grants the caster cleave while it is present, if they are a melee hero. Cleave damage cannot be amplified with outgoing spell damage amplification and cannot spell lifesteal. Can be amplified by incoming spell damage amplification. Cleave damage is reduced by Damage Block. The complete area is shaped like an isosceles trapezoid in front of the attacking Earthshaker. Fully stacks with other sources of cleave. Each source of cleave works independently. Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave. Despite the visual effect, cleave damage is applied instantly in the whole area.",
        "Cleave damage cannot be amplified with outgoing spell damage amplification and cannot spell lifesteal.",
        "Can be amplified by incoming spell damage amplification.",
        "Cleave damage is reduced by Damage Block.",
        "The complete area is shaped like an isosceles trapezoid in front of the attacking Earthshaker.",
        "Fully stacks with other sources of cleave. Each source of cleave works independently.",
        "Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.",
        "Despite the visual effect, cleave damage is applied instantly in the whole area."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "W",
      "cooldown": "5 (TagTalent 3.5)",
      "description": "Empowers Earthshaker's totem, causing it to deal extra damage and have 75 bonus attack range on the next attack.",
      "spellName": "Enchant Totem",
      "params": [
        "Cast Animation: 0.6+0.5 (TagAghanim 0+0)",
        "Attack Range Bonus: 75",
        "Attack Damage Bonus: 100%\/200%\/300%\/400%",
        "Damage Bonus Duration: 14",
        "Cast Range: 950",
        "Leap Duration: 0.8",
        "Cleave Starting Radius: 150",
        "Cleave Distance: 650",
        "Cleave End Radius: 360",
        "Cleave Damage: 40%",
        "Enchant Totem becomes a 950 range ground target ability, causing Earthshaker to jump in the air and land at the target spot, casting Enchant Totem there. Self-casting the ability will behave in the original form, without jumping. Grants Enchant Totem a 40% cleave hit.",
        "Can only be self-cast while rooted."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not trigger on active item abilities, on abilities with 0 cooldown, or on abilities which do not trigger on-cast effects.",
        "Aftershock first applies the stun debuff, then the damage.",
        "Applies its own effects before the effects of the triggering ability are applied.",
        "The stun does not stack with the stun of Fissure. It follows the regular rule of stuns—the longer stun overrides the shorter one."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Causes the earth to shake underfoot, adding additional damage and stuns to nearby enemy units when Earthshaker casts his abilities.",
      "spellName": "Aftershock",
      "params": [
        "Radius: 300 (TagTalent 500)",
        "Damage: 75\/100\/125\/150 (TagTalent 125\/150\/175\/200)",
        "Stun Duration: 0.6\/0.9\/1.2\/1.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Earthshaker_Echo_Slam_1.mp3\/revision\/latest?cb=20191216013146",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Echo Slam interrupts Earthshaker's channeling abilities upon cast.",
        "The echo waves travel at a speed of 600.",
        "Each enemy within the initial search radius sends echo waves towards other enemies within the echo search radius. Hit enemy heroes send two echoes to every valid target within the radius, and not only to other heroes.",
        "Hit enemy heroes send two echoes to every valid target within the radius, and not only to other heroes.",
        "The echo search radii are centered around each unit hit by the initial damage. Echo waves are sent out to every enemy unit within the search radius, except to the unit itself. This means the echo waves targets can be up to 1200 range away from Earthshaker upon cast. This also means when only one enemy is within the radius, it takes no damage, since it cannot send echoes to itself.",
        "Echo waves are sent out to every enemy unit within the search radius, except to the unit itself.",
        "This means the echo waves targets can be up to 1200 range away from Earthshaker upon cast.",
        "This also means when only one enemy is within the radius, it takes no damage, since it cannot send echoes to itself.",
        "Wards and buildings are completely ignored, they do not release and are not targeted by echoes.",
        "Fully affects invisible units and units in the Fog of War.",
        "Total damage when hitting a certain amount of heroes, with no other units nearby (before reductions): 2 Heroes: 240\/320\/400 (TagTalent 320\/400\/480) damage to each hero, 480\/640\/800 (TagTalent 640\/800\/960) total damage. 3 Heroes: 380\/500\/620 (TagTalent 540\/660\/780) damage to each hero, 1140\/1500\/1860 (TagTalent 1620\/1980\/2340) total damage. 4 Heroes: 520\/680\/840 (TagTalent 760\/920\/1080) damage to each hero, 2080\/2720\/3360 (TagTalent 3040\/3680\/4320) total damage. 5 Heroes: 660\/860\/1060 (TagTalent 980\/1180\/1380) damage to each hero, 3300\/4300\/5300 (TagTalent 4900\/5900\/6900) total damage.",
        "2 Heroes: 240\/320\/400 (TagTalent 320\/400\/480) damage to each hero, 480\/640\/800 (TagTalent 640\/800\/960) total damage.",
        "3 Heroes: 380\/500\/620 (TagTalent 540\/660\/780) damage to each hero, 1140\/1500\/1860 (TagTalent 1620\/1980\/2340) total damage.",
        "4 Heroes: 520\/680\/840 (TagTalent 760\/920\/1080) damage to each hero, 2080\/2720\/3360 (TagTalent 3040\/3680\/4320) total damage.",
        "5 Heroes: 660\/860\/1060 (TagTalent 980\/1180\/1380) damage to each hero, 3300\/4300\/5300 (TagTalent 4900\/5900\/6900) total damage.",
        "",
        "The delay modifier is placed on every enemy damaged by Echo Slam, and is used to [ Info Needed ]. It lasts for 10.5 seconds. The heating up modifier is placed on Earthshaker when hitting more than 4 heroes with Echo Slam, and is used to [ Info Needed ]. It lasts 2 seconds.",
        "The heating up modifier is placed on Earthshaker when hitting more than 4 heroes with Echo Slam, and is used to [ Info Needed ]. It lasts 2 seconds.",
        "The kill effect modifier is placed on enemies killed by Echo Slam while having Planetfall equipped, and is responsible for the custom death effect."
      ],
      "mana": "145\/205\/265",
      "hotKey": "R",
      "cooldown": "150\/130\/110",
      "description": "Shockwaves travel through the ground, damaging enemy units. Each enemy hit causes an echo to damage nearby units. Real heroes cause two echoes.",
      "spellName": "Echo Slam",
      "params": [
        "Cast Animation: 0+1.33",
        "Initial Search Radius: 600",
        "Echo Search Radius: 600",
        "Base Damage: 100\/140\/180",
        "Echo Damage: 70\/90\/110 (TagTalent 110\/130\/150)",
        "Spell immune enemies send echo waves towards nearby spell immune enemies. Echoes do not attempt to damage spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 1.4,
    "attrAgility": 12.0
  },
  "description": "Raigor Stonehoof, the Earthshaker, is a melee strength hero with several area of effect (AoE) disables, commonly played as a ganker or initiator. Good usage of his spells allow him to damage and chainstun multiple enemies at once, making him very disruptive in skirmishes and teamfights. His Fissure is a versatile long-ranged spell that affects enemies in a line, used to stun, inflict moderate damage, and create an impassable wall of earth for a significant duration. Proper usage of this can allows him to cut off chokepoints, leaving enemies with no escape routes or preventing them from chasing after endangered allies. Enchant Totem massively boosts his attack damage for one attack, and has a very short cooldown. Aftershock lets the Earthshaker deal additional damage and stun in a small area around him every time he uses one of his spells, and combos particularly well with Enchant Totem, given the former's very low cooldown. Earthshaker's heavy AoE-centric kit is most powerful when his enemies are in large numbers and in close proximity. With his Echo Slam, he can deal heavy damage to clusters of enemies. All of Earthshaker's spells (with the exception of his ultimate) have a long casting animation, but with proper positioning, an adept Earthshaker can wreak havoc. Blink Dagger is an essential item for him to be able to properly land Echo Slam within a cluster of enemies. At the same time, because of the high mana costs of his spells, he needs some form of mana sustenance. With his tremendous seismic power, the Earthshaker is never one that should be taken lightly even when he is heavily outnumbered.",
  "history": "Like a golem or gargoyle, Earthshaker was one with the earth but now walks freely upon it. Unlike those other entities, he created himself through an act of will, and serves no other master. In restless slumbers, encased in a deep seam of stone, he became aware of the life drifting freely above him. He grew curious. During a season of tremors, the peaks of Nishai shook themselves loose of avalanches, shifting the course of rivers and turning shallow valleys into bottomless chasms. When the land finally ceased quaking, Earthshaker stepped from the settling dust, tossing aside massive boulders as if throwing off a light blanket. He had shaped himself in the image of a mortal beast, and named himself Raigor Stonehoof. He bleeds now, and breathes, and therefore he can die. But his spirit is still that of the earth; he carries its power in the magical totem that never leaves him. And on the day he returns to dust, the earth will greet him as a prodigal son.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-1.5s Enchant Totem Cooldown",
      "talentRight": "+200 Aftershock Range"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+320 Fissure Range",
      "talentRight": "+40 Echo Damage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+50 Aftershock Damage",
      "talentRight": "+25 Movement Speed"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+80 Fissure Damage",
      "talentRight": "+30 Base Damage"
    }
  ]
}