{
  "abilities": [
    {
      "notes": [
        "При выборе юнита Crypt Swarm выпускается по направлению его текущего расположения",
        "Crypt Swarm летит со скоростью 1100, пролетая все расстояние за 0,74 секунды",
        "Может поражать юнитов на расстоянии до 1110",
        "Площадь поражения по форме похожа на конус"
      ],
      "item_behaviour": [],
      "description": "Посылает вперёд стаю крылатых тварей, наносящих урон врагам на своём пути.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: 600",
        "Начальный радиус: 110",
        "Дистанция прохождения: 810",
        "Конечный радиус: 300",
        "Урон: 75\/150\/225\/300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3f\/Crypt_Swarm.mp3\/revision\/latest?cb=20141211202923",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "8\/7\/6\/5 (TagTalent -392\/-393\/-394\/-395)",
      "aghanim": null,
      "name": "Crypt Swarm",
      "cooldown": "85\/110\/135\/160",
      "legacy_key": "R",
      "story": "Во время своих путешествий в загробный мир Кробелус забирает с собой души проклятых, материализуя их стаей летучих мышей в нашем мире."
    },
    {
      "notes": [
        "Применяет дебафф на врагов по области применения\n Вхождение или покидание области после применения не даст эффекта"
      ],
      "item_behaviour": [],
      "description": "Запрещает врагам в указанной области применять способности.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,87",
        "Дальность применения: 900",
        "Радиус: 425",
        "Длительность: 3\/4\/5\/6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/13\/Silence_%28Death_Prophet%29.mp3\/revision\/latest?cb=20141211203123",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов"
      ],
      "mana": "15\/14\/13\/12",
      "aghanim": null,
      "name": "Silence",
      "cooldown": "80\/90\/100\/110",
      "legacy_key": "E",
      "story": "Кробелус видит лишь безмолвное будущее, вглядываясь в смертное предначертание своего врага."
    },
    {
      "notes": [
        "При изучении способности, повышении её уровня и при покупку <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Death Prophent сразу получает 1 заряд\n Связь разрывается только если цель заклинания умрет или отойдет на расстояние, превышающее дистанцию действия",
        "Восстановление здоровья для Death Prophet независимо от фактического количества нанесённого урона\n Это значит, даже если цель не получает урон, то Death Prophet всё равно излечивается",
        "Высасывает 3.5 + 0,25%\/0,625%\/1%\/1,375% ( 4%\/4,375%\/4,75%\/5,125%) от максимального здоровья врага каждые 0,25 секунды спустя 0,25 секунды после применения, срабатывая 24 раз",
        "Может нанести до 84 + 6%\/15%\/24%\/33% ( 96%\/105%\/114%\/123%) от максимального запаса здоровья врага при полном действии связи (до учета сопротивления)\n Получение увеличивающего % от макс\n здоровья  таланта не усиливает действующие связи Spirit Siphon",
        "При применении на юнита, которого Death Prophet уже атакует, герой продолжит его атаковать, несмотря на настройки автоатаки",
        "Не может быть применена на юнита уже находящегося под эффектом Spirit Siphon\n Death Prophet получает здоровье от каждого юнита под эффектом Spirit Siphon",
        "Не дает обзор на цель, при этом связь не рвется при потере обзора\n При потере обзора цели, связь визуально рисует то место, где цель была видна последний раз",
        "Не может быть применена к  Рошану",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Spirit Siphon будет накладывать страх после 4-x секунд действия связи\n Страх не может быть применён к неуязвимым, спрятанным или невосприимчивым к заклинаниям существам\n Если цель находится под одним из этих эффектов, когда на неё должен был быть наложен страх, то страх будет наложен позже при условии, что связь будет еще действовать\n Страх будет длиться вне зависимости от того, сколько времени осталось до конца действия Spirit Siphon\n Страх будет продолжать действовать, если связь разорвётся\n Страх от Spirit Siphon вынуждает противников бежать от заклинателя, а не к фонтану своей команды"
      ],
      "item_behaviour": [],
      "description": "Герой создаёт мистическую связь с вражеским существом, забирая себе 6 от скорости передвижения жертвы и каждую секунду нанося ей 14 + 1%\/2,5%\/4%\/5,5% урона от максимального запаса здоровья.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 500",
        "Дистанция разрыва связи: 750",
        "Начальное высасывание здоровья в секунду: 14",
        "Высасывание от максимального здоровья в секунду: 1%\/2,5%\/4%\/5,5% ( 16%\/17,5%\/19%\/20,5%)",
        "Длительность: 6",
        "Число зарядов: 1\/2\/3\/4",
        "Время восстановления заряда: 36\/34\/32\/30 ( 16\/14\/12\/10)",
        "Длительность связи для наложения страха:  4",
        "Длительность страха: 1,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f1\/Spirit_Siphon.mp3\/revision\/latest?cb=20180815103701",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Spirit Siphon",
      "cooldown": "80",
      "legacy_key": "C",
      "story": "Кробелус охотно покажет другим путь, по которому ей не пройти в одиночку."
    },
    {
      "notes": [
        "Духи появляются вокруг Death Prophet с интервалом в 0,35 секунды сразу после применения; для появления всех духов нужно 2,45\/5,25\/8,05 ( 5,25\/8,05\/10,85) секунды",
        "Духи не являются юнитами, поэтому с ними нельзя взаимодействовать или чем-то на них повлиять",
        "Духи движутся со скоростью 525, витая в радиусе 700 вокруг Death Prophet\n Духи могут разворачиваться только путем движения по дуге радиусом примерно 150",
        "Духи автоматически атакуют ближайших врагов в радиусе 700 от Death Prophet\n Каждый из духов получает свою цель случайно, но приоритетом для атаки духов является та цель, которую атакует Death Prophet\n При получении цели дух обычно преследует юнита до его смерти, выхода из зоны действия или до выбора новой цели героем\n Преследование нельзя отменить\n Дух прервет его после достижения цели или если расстояние между ним и целью превысит 1900 единиц\n То есть с выбором новой цели Death Prophet уже атакующие духи не переключаются на новую\n Духи не наносят урон юнитам, находящимся более чем в 1200 единицах от Death Prophet, хотя могут преследовать на гораздо большее расстояние\n Для повторной атаки духи должны возвращаться к Death Prophet после каждой совершенной",
        "Духи могут атаковать любой доступный для атаки вражеский юнит, включая постройки, варды и юнитов в тумане войны, но не невидимых юнитов",
        "Атаки духов не считаются обычными атаками, поэтому они игнорируют такие понятия, как уклонение и блокировка урона\n Их урон относится к урону заклинаний, а не к урону от атак, поэтому на духов действует усиление урона и вампиризм заклинаний\n Духи также не могут активировать эффекты, срабатывающие на атаки, такие как  Counter Helix,  Moment of Courage и  Reactive Armor, и не могут сбить врагу  Tranquil Boots\n Духи также не наносят урон юнитам, которым для смерти нужно определенное число ударов, поскольку их атаки не считаются обычными",
        "Если дух улетел на расстояние более 0,35 единиц от Death Prophet, он исчезает и появляется рядом с ней\n Появление таких духов связано с интервалами появления, поэтому несколько исчезнувших духов не появятся одновременно возле героя",
        "Лечение происходит единоразово при возвращении духов обратно к Death Prophet с завершением длительность способности\n Духи не лечат героя при возвращении после каждой атаки\n Лечение от духов основано на значении их урона, а не фактически нанесенном уроне\n То есть после возврата духи излечат Death Prophet на 14,75-16 за каждую совершенную атаку вне зависимости от того, получили ли враги урон или нет",
        "Повторное применение Exorcism досрочно прервет предыдущее примененение, заставляя духов вернутся к Death Prophet и исцелить",
        "Духи, созданные <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter, действуют как духи, вызванные применением и у них также есть максимальное расстояние\n Духи призываются для каждого юнита, задетого  Crypt Swarm и  Silence, целей  Spirit Siphon и обычных атак Death Prophet\n Если применение Spirit Siphon заблокировали, атака героя промахнулась или её избежали, то дух не появится\n Духи также появляются при атаке строений, но не вардов или союзников\n Духи наносят 88,5-96 урона и излечивают заклинателя на 22,13-24 единиц при возвращении\n Духи преследуют цели до 20 секунд, а затем возвращаются к Death Prophet"
      ],
      "item_behaviour": [],
      "description": "Герой выпускает злых духов, высасывающих жизнь из вражеских существ и сооружений поблизости. Через 35 секунд они возвращаются к владельцу, исцеляя его. Сила исцеления зависит от количества нанесённого духами урона.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,5+0,77",
        "Радиус появления духов: 700",
        "Макс\n радиус атаки: 1200",
        "Интервал появления духов: 0,35",
        "Количество духов: 8\/16\/24 ( 16\/24\/32)",
        "Мин\n урон духов: 59",
        "Макс\n урон духов: 64",
        "Восстановление здоровья: 25%",
        "Доп\n скорость передвижения: 16%\/18%\/20%",
        "Длительность: 35",
        "Множитель урона духов при нанесении урона: 1 ( 1,5)",
        "Замедление скорости передвижения духом: 0% ( 100%)",
        "Длительность замедления духом: 0 ( 0,3)",
        "Макс\n длительность духа: 0 ( 20)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f8\/Exorcism.mp3\/revision\/latest?cb=20141211203114",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: Физический"
      ],
      "mana": "145",
      "aghanim": null,
      "name": "Exorcism",
      "cooldown": "250\/350\/450",
      "legacy_key": "X",
      "story": "Осколки неисчислимых прошлых жизней банши материализуются, чтобы сеять ужас в настоящем."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.1,
    "attrStrength": 19.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.4,
    "attrAgility": 14.0
  },
  "description": "+8 к числу духов для Exorcism −20 сек. восстановления заряда Spirit Siphon +400 к здоровью −20% к скорости передв. жертв у Spirit Siphon −2 сек. перезарядки Crypt Swarm +15 к урону\/лечению от Spirit Siphon +14% к сопротивлению магии +30 к урону",
  "history": "Когда-то Кробелус была пророчицей смерти — другими словами, она предсказывала судьбы богачам, пожелавшим заглянуть за вуаль загробного мира. Но спустя годы гаданий ворожея захотела узнать свою собственную судьбу. Когда смерть отказалась открывать свои тайны, пророчица решила заплатить за них своей жизнью. Однако даже такой жертвы оказалось недостаточно. Смерть отвергала ворожею снова и снова, ни за что не раскрывая своих глубоких секретов. В Кробелус начала расти зависть. Если другим дано умереть навсегда — почему не могла она? Почему лишь она возвращается к бренной жизни с таким утомительным постоянством? Почему она недостойна того единственного, что остальные существа принимают как должное? Несмотря ни на что, Кробелус не опускала руки. Возвращаясь из могилы вновь и вновь, она приносила с собой частичку смерти. Призраки стали следовать за ней, словно осколки её раздробленной души, кровь её поблекла и стала походить на эктоплазму, а ненасытные обитатели сумеречных миров начали принимать её за свою... С каждой смертью пророчица отдавала крупицу своей жизни, и её конец словно бы приближался. Стремясь к погибели как никогда, забыв о всякой судьбе кроме своей, ворожея страстно бросается в пучину смерти, надеясь осуществить несбыточное до сих пор пророчество — пророчество о том, что однажды Кробелус обретёт вечный покой."
}