{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на уклонение мультипликативно складывается с другими источниками уклонения."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Battle Trance применяет сильное развеивание",
          "talentRight": "+2 сек. действия Battle Trance"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 к урону",
          "talentRight": "+20% к уклонению"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+90 к урону от Whirling Axes",
          "talentRight": "+5 к скорости атаки за эффект от Fervor"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+25 к скорости передв. от Berserker's Rage",
          "talentRight": "+7 к броне от Berserker's Rage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Troll_Warlord_Berserker%27s_Rage_1.mp3\/revision\/latest?cb=20191216025527",
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Berserker's Rage не прерывает произносимые способности Troll Warlord.",
        "При переключении заменяет Whirling Axes (дальний бой) на Whirling Axes (ближний бой).",
        "При отключении все изменения отменяются и Troll Warlord снова ставится существом дальнего боя.",
        "Превращает Troll Warlord в существо ближнего боя с дальностью атаки в 150 единиц, то есть предметы начинают применять бонусы ближнего боя (например, Battle Fury, Skull Basher).",
        "При переключении во время полета снаряд дальней атаки будет считаться за ближнюю атаку для предметов, но не применит оцепенение от Berserker's Rage. То есть можно использовать прорубающий удар в области за целью, если у Troll Warlord есть Battle Fury, а предметы, схожие с Orb of Venom и Skull Basher, используют значения ближнего боя. Но Quelling Blade использует значение дальнего боя, если Troll Warlord активировал дальнюю атаку при запуске снаряда.",
        "То есть можно использовать прорубающий удар в области за целью, если у Troll Warlord есть Battle Fury, а предметы, схожие с Orb of Venom и Skull Basher, используют значения ближнего боя. Но Quelling Blade использует значение дальнего боя, если Troll Warlord активировал дальнюю атаку при запуске снаряда.",
        "Berserker's Rage остается после смерти Troll Warlord. Если Berserker's Rage была активна на момент смерти, то герой возродится с активной способностью.",
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Оцепенение от Berserker's Rage использует псевдослучайное распределение.",
        "Оцепенение не действует на союзных существ, варды и постройки.",
        "Способность недоступна в Ability Draft."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Когда эта способность активирована, герой использует свои метательные топоры в ближнем бою. При этом уменьшается базовый интервал атак, повышается скорость передвижения и броня героя. Он может опутать сетью цель атаки, не давая ей передвигаться или применять способности для перемещения. Berserker's Rage также изменяет свойства способности Whirling Axes.",
      "spellName": "Berserker's Rage",
      "params": [
        "Анимация применения: 0+0",
        "Доп. броня: 4\/5\/6\/7",
        "Доп. скорость передвижения: 15\/25\/35\/45",
        "Потеря дальности атаки: 350",
        "Базовое время атаки: 1,45",
        "Шанс оцепенения: 14%\/16%\/18%\/20%",
        "Отключается только оцепенение, остальные эффекты остаются.",
        "Иллюзии ближнего боя не применяют оцепенение."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Troll_Warlord_Whirling_Axes_%28Ranged%29_1.mp3\/revision\/latest?cb=20191216025521",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Whirling Axes (дальний бой) доступна только при неактивированной Berserker's Rage. В режиме Ability Draft обе версии Whirling Axes разделены, поэтому их можно выбирать и изучать по отдельности.",
        "В режиме Ability Draft обе версии Whirling Axes разделены, поэтому их можно выбирать и изучать по отдельности.",
        "Топоры летят со скоростью в 1500 единиц, преодолевая расстояние за 0.63 сек.",
        "Создает 5 топоров с расстоянием между ними в 25 градусов и поражает существ в радиусе 100 единиц вокруг них.",
        "У способности нет начального радиуса, топоры появляются в точке перед Troll Warlord. Общая площадь напоминает по форме конус.",
        "Поражает существ на расстоянии до 1050 единиц (складывается из дальности полета топоров и их радиуса).",
        "Топоры сначала наносят урон, затем применяют дебафф. С Aghanim's Scepter они сначала применяют базовое развеивание, затем наносят урон, а затем применяют дебафф.",
        "С Aghanim's Scepter они сначала применяют базовое развеивание, затем наносят урон, а затем применяют дебафф.",
        "Не действует на Рошана.",
        "Во время действия Battle Trance эта способность применяется мгновенно и не требует поворота героя в сторону выбранного направления."
      ],
      "mana": "60 (TagTalent 30)",
      "hotKey": "W",
      "cooldown": "9 (TagTalent 4)",
      "description": "Герой бросает пять топоров веером на расстояние в 950, замедляя врагов и нанося им урон.",
      "spellName": "Whirling Axes (дальний бой)",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 950",
        "Дальность полета топоров: 950",
        "Радиус топоров: 100",
        "Конечный радиус топоров: 206,17",
        "Урон: 75 (TagTalent 165)",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 2,5\/3\/3,5\/4",
        "Способность развеивает положительные эффекты с врагов. Уменьшает перезарядку и расход маны.",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Troll_Warlord_Whirling_Axes_%28Melee%29_1.mp3\/revision\/latest?cb=20191216025518",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов (TagAghanim Себя)",
        "Урон Магический"
      ],
      "notes": [
        "Whirling Axes (ближний бой) доступна только при активированной Berserker's Rage. В режиме Ability Draft обе версии Whirling Axes разделены, поэтому их можно выбирать и изучать по отдельности.",
        "В режиме Ability Draft обе версии Whirling Axes разделены, поэтому их можно выбирать и изучать по отдельности.",
        "При использовании прерывает произносимые заклинания Troll Warlord.",
        "С Aghanim's Scepter при использовании применяет к Troll Warlord базовое развеивание.",
        "Если Troll Warlord умрет, то заклинание завершится, а топоры пропадут.",
        "Топоры всегда появляются на востоке и западе от расположения Troll Warlord и вращаются по часовой стрелке.",
        "Топоры движутся со скоростью в 1250 единиц и вылетают из центра со скоростью в 233.33 до достижения максимального расстояния за 1.5 сек., а затем возвращаются к Troll Warlord с той же скоростью.",
        "Только находящиеся в пределах 100 единиц существа получают урон и ослепление.",
        "Ослепление от Whirling Axes использует псевдослучайное распределение.",
        "Поражает существ на расстоянии до 450 единиц (складывается из радиуса вращения и радиуса топоров).",
        "Полный урон и дебафф применяются при первом соприкосновении существа с топором, поэтому попадание другого топора не наносит дополнительный урон и не обновляет дебафф.",
        "Топоры сначала наносят урон, затем применяют дебафф.",
        "Визуальные эффекты от этого заклинания смещены и не отображают реальную область поражения.",
        "Не действует на Рошана."
      ],
      "mana": "50 (TagTalent 25)",
      "hotKey": "E",
      "cooldown": "9 (TagTalent 4)",
      "description": "Герой вращает два топора в небольшой области вокруг себя, нанося врагам урон и вынуждая их промахиваться атаками.",
      "spellName": "Whirling Axes (ближний бой)",
      "params": [
        "Анимация применения: 0+0",
        "Радиус вращение: 350",
        "Радиус топоров: 100",
        "Урон: 50\/100\/150\/200 (TagTalent 140\/190\/240\/290)",
        "Шанс промаха: 60%",
        "Длительность ослепления: 5",
        "Длительность вращения: 3",
        "Способность развеивает отрицательные эффекты с владельца. Уменьшает перезарядку и расход маны.",
        "Эффект ослепления остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Troll Warlord получает или теряет накопления как только его атаки достигли цели. То есть атаки, которые промахнулись или которых избежали, не засчитываются; в дальнем бою способность реагирует на попадание, а не запуск снаряда.",
        "То есть атаки, которые промахнулись или которых избежали, не засчитываются; в дальнем бою способность реагирует на попадание, а не запуск снаряда.",
        "Здесь указано, сколько скорости атаки Fervor дает за определенное число зарядов на каждом уровне. Уровень 1: 15\/30\/45\/60\/75\/90\/105\/120\/135\/150\/165\/180 Уровень 2: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240 Уровень 3: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300 Уровень 4: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360",
        "Уровень 1: 15\/30\/45\/60\/75\/90\/105\/120\/135\/150\/165\/180",
        "Уровень 2: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240",
        "Уровень 3: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300",
        "Уровень 4: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360",
        "Здесь указано, сколько скорости атаки Fervor дает за определенное число зарядов на каждом уровне c выбранным талантом на дополнительную скорость атаки. Уровень 1: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240 Уровень 2: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300 Уровень 3: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360 Уровень 4: 35\/70\/105\/140\/175\/210\/245\/280\/315\/350\/385\/420",
        "Уровень 1: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240",
        "Уровень 2: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300",
        "Уровень 3: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360",
        "Уровень 4: 35\/70\/105\/140\/175\/210\/245\/280\/315\/350\/385\/420",
        "При наличии накоплений атака по новой цели убирает предыдущие заряды без добавления нового.",
        "Действует на любых существ, включая союзников, варды и постройки."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Каждый последующий удар по одной и той же цели увеличивает скорость атаки героя. Если сменить цель, скорость станет обычной.",
      "spellName": "Fervor",
      "params": [
        "Макс. число эффектов: 12",
        "Скорость атаки за эффект: 15\/20\/25\/30 (TagTalent 20\/25\/30\/35)",
        "Не предотвращает получение новых накоплений. Сбрасывает дополнительную скорость атаки от всех эффектов."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Смена стойки мгновенно обновляет бафф для соответствия бонусов как для союзников, так и для Troll Warlord.",
        "Вопреки описанию, бафф можно развеять любым развеиванием.",
        "Вопреки описанию, бафф действует на союзников с иммунитетом к заклинаниям."
      ],
      "mana": "75",
      "hotKey": "F",
      "cooldown": "80",
      "description": "Глобальная активная способность. На 5 сек. даёт всем союзным героям бонусы, которые зависят от текущего типа атаки владельца: +70 к скорости атаки в дальнем бою или +25% к сопротивлению эффектам в ближнем бою.",
      "spellName": "Rampage",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: Глобальный",
        "Доп. скорость атаки (TagTalentактивен дальний бой): 70",
        "Доп. сопротивление эффектам (TagTalentактивен ближний бой): 25%",
        "Длительность: 5",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Troll_Warlord_Battle_Trance_1.mp3\/revision\/latest?cb=20191216025526",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания Troll Warlord.",
        "При использовании применяет базовое развеивание (TagTalent сильное развеивание).",
        "Battle Trance сначала применяет бафф, затем развеивание.",
        "При активации без атаки кого-либо выбранный герой автоматически выбирает цель, подходящую для атаки, в радиусе поиска. Приоритет у героев выше, чем у существ. Использует стандартные правила автоатаки для выбора целей. Не выбирает Рошана, постройки, варды, союзников или врагов с неуязвимостью или иммунитетом к атакам.",
        "Приоритет у героев выше, чем у существ. Использует стандартные правила автоатаки для выбора целей.",
        "Не выбирает Рошана, постройки, варды, союзников или врагов с неуязвимостью или иммунитетом к атакам.",
        "При активации во время атаки кого-либо выбранный герой привязывается к этой цели, даже если это Рошан, строение, вард или союзник.",
        "Герой меняет текущую цель атаки только если она стала недоступной (стала неуязвимой, получила иммунитет к атакам или умерла).",
        "Дает общий обзор на текущую цель атаки и проявляет ее сквозь туман войны, пока она остается в радиусе 900 от героя. Не дает эффекта True Sight.",
        "При активации герой неподконтролен игроку и может только переключать Berserker's Rage или использовать Whirling Axes. Выбранный герой игнорирует провокацию. Страх и гипноз предотвращают атаки и мешают передвижению героя. Если поблизости нет целей, то героем вновь можно управлять до появления в радиусе поиска врага.",
        "Выбранный герой игнорирует провокацию. Страх и гипноз предотвращают атаки и мешают передвижению героя.",
        "Если поблизости нет целей, то героем вновь можно управлять до появления в радиусе поиска врага.",
        "Предотвращает смерть Troll Warlord, приравнивая его минимальное здоровье к 1. То есть он не умирает даже от урона, отмеченного как отнимающий здоровье, поэтому способность может заблокировать отложенный урон от False Promise. Не защищает от разрубания Culling Blade или завершения призрачной формы от Reincarnation. Предотвращает взрыв от Ice Blast во время Battle Trance, если здоровье героя ниже порога.",
        "То есть он не умирает даже от урона, отмеченного как отнимающий здоровье, поэтому способность может заблокировать отложенный урон от False Promise.",
        "Не защищает от разрубания Culling Blade или завершения призрачной формы от Reincarnation.",
        "Предотвращает взрыв от Ice Blast во время Battle Trance, если здоровье героя ниже порога.",
        "Технически, получаемый урон не уменьшается, поэтому каждое его нанесение учитывается в полном размере.",
        "Талант 25-го уровня меняет базовое развеивание способности на сильное. Позволяет использовать Battle Trance во время оглушения, урагана, сна, исчезновения и принудительного движения. Невозможно использовать и поставить в очередь действий во время безмолвия, провокации, проклятия или запрета действия.",
        "Позволяет использовать Battle Trance во время оглушения, урагана, сна, исчезновения и принудительного движения.",
        "Невозможно использовать и поставить в очередь действий во время безмолвия, провокации, проклятия или запрета действия."
      ],
      "mana": "150",
      "hotKey": "R",
      "cooldown": "90",
      "description": "Герой входит в боевой транс, вынуждающий его атаковать ближайшее вражеское существо в радиусе 900 (в первую очередь героев). Под действием этой способности героя нельзя убить. Даёт дополнительные вампиризм, скорость атаки и передвижения. Применяет нормальное развеивание.",
      "spellName": "Battle Trance",
      "params": [
        "Анимация применения: 0+0,5",
        "Радиус поиска врагов: 900",
        "Вампиризм: 40%\/60%\/80%",
        "Доп. скорость передвижения: 25%\/30%\/35%",
        "Доп. скорость атаки: 140\/170\/200",
        "Длительность: 6,5 (TagTalent 8,5)",
        "Дарует новую способность: Rampage."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 21.0,
    "attrIntelligence": 13.0,
    "attrIntelligenceInc": 1.0,
    "attrAgilityInc": 3.3,
    "attrAgility": 21.0
  },
  "description": "Troll Warlord — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Berserker's Rage, меняет тип атаки с дальнего на ближний. В ближнем бою повышается наносимый героем урон, его скорость атаки и передвижения, он получает дополнительное здоровье, броню и шанс опутать сетью цель при атаке. Вторая способность в дальнем бою, Whirling Axes (дальний бой), бросает пять топоров веером, замедляя врагов и нанося им урон. Вторая способность в ближнем бою Whirling Axes (ближний бой), вращает два топора вокруг себя в небольшом радиусе, нанося урон вражеским существам и заставляя их промахиваться во время атак. Пассивная способность, Fervor, увеличивает скорость атаки с каждого последующего удара по одной и той же цели. Если тролль сменит цель, бонус обнулится. Ультимативная способность, Battle Trance, повышает скорость атаки и скорость передвижения Troll Warlord, даёт ему дополнительный вампиризм и защищает от смерти взамен на возможность контролировать героя.",
  "history": "Обидеть тролля проще простого. Взбалмошных и сварливых, их хлебом не корми, а дай поспорить и попрепираться по любому поводу. До совершеннолетия самцы обитают в подземных пещерах под домищем матриарха, не принося никакого толку, лишь откармливаясь да озорничая. Зачастую уже даже взрослые тролли сидят на шее матриарха годами. Когда же их, наконец, вышвыривают с насиженных мест, тролли сбиваются в бродячие стаи, скандалят и недовольствуют по любому поводу. Так вот, представьте себе, какой невыносимой занозой нужно быть, чтобы тебя отвергли собственные соплеменники, при их-то любви позадирать друг друга. Такова была судьба Джа'ракала, тролля-барышника из глубин Ховена. Был он настолько склочен и злобен, что не терпели его даже тролли из собственной стаи. Однажды, после острого приступа жадности, в котором он присвоил себе львиную долю скарба с последнего налета, терпение соплеменников лопнуло. Его скрутили, поколотили дубинами и выволокли из лагеря. Обезумев от ярости, Джа'ракал вернулся на следующий день с оружием в руках и убил всех обидчиков, одного за другим. Отдышавшись, он дал кровавую клятву: отныне он будет сражаться только сам за себя. По сей день скитается Джа'ракал по миру, озлобленный и беспощадный. И прозвали его повелителем троллей, Troll Warlord, вот только повелевает он лишь собой.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Battle Trance применяет сильное развеивание",
      "talentRight": "+2 сек. действия Battle Trance"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 к урону",
      "talentRight": "+20% к уклонению"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+90 к урону от Whirling Axes",
      "talentRight": "+5 к скорости атаки за эффект от Fervor"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+25 к скорости передв. от Berserker's Rage",
      "talentRight": "+7 к броне от Berserker's Rage"
    }
  ]
}