{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/89\/Force_Staff_Force.mp3\/revision\/latest?cb=20191227195419",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "Double clicking the item casts it on self.",
        "Pushes the target at a speed of 800.",
        "The target is not disabled during the push, so they still can cast spells or items, attack and turn during the push. This means it does not cancel channeling spells of the target. However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "This means it does not cancel channeling spells of the target.",
        "However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "Does not push units affected by Black Hole, Chronosphere, Duel, or Flaming Lasso.",
        "Cannot push units through Kinetic Fields or Arenas of Blood.",
        "If the target is affected by Soulbind, it cannot push the unit further than its max stretch distance allows.",
        "If the target is leashed by Pounce, the leash gets instantly broken upon cast. However, if the target gets leashed after cast, it cannot push the unit further than the max stretch distance of Pounce allows.",
        "However, if the target gets leashed after cast, it cannot push the unit further than the max stretch distance of Pounce allows.",
        "Cannot be cast on wards or buildings. Can be cast on Homing Missiles.",
        "Can move units over impassable terrain. Trees within 100 radius around the pushed target get destroyed during the push.",
        "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement."
      ],
      "mana": null,
      "abilityName": "Force",
      "cooldown": "30",
      "description": "Pushes any target unit away from you 400 distance.",
      "params": [
        "Cast Range: 750",
        "Push Distance: 400",
        "Push Duration: 0.5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Psychic Headband",
  "description": "A failed experiment in finer telekinetic control, still fit for other ends.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+12% Intelligence",
    "+100 Cast range"
  ],
  "tips": null
}