{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Осколки от Splinter Blast оглушают на 1,5 сек.",
          "talentRight": "+1,5 сек. действия Winter's Curse"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 к урону от Splinter Blast",
          "talentRight": "+12% к замедлению от Arctic Burn"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+400 к радиусу разлёта осколков у Splinter Blast",
          "talentRight": "+2 сек. к длительности урона от Arctic Burn"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+35 к урону",
          "talentRight": "+25% к базовому лечению в секунду от Cold Embrace"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/92\/Winter_Wyvern_Arctic_Burn_1.mp3\/revision\/latest?cb=20191216030732",
      "effects": [
        "Способность Ненаправленная (TagAghanim Переключаемая)",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Winter Wyvern.",
        "Временно превращает Winter Wyvern в летающее существо, позволяя летать над непроходимой территорией, деревьями, существами и строениями. При этом не даёт Winter Wyvern летающий обзор.",
        "При этом не даёт Winter Wyvern летающий обзор.",
        "Увеличивает дальность атаки до 775\/825\/875\/925, скорость полета снаряда до 1200, ночной обзор до 1200 и уменьшает анимацию атаки до 0,1.",
        "Каждый враг может получить дебафф только один раз за атаку. Успешные атаки по одной цели не складываются и не обновляют длительность.",
        "Атаки сначала применяют дебафф, а затем наносят урон.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после наложения дебаффа, срабатывая 8 раз.",
        "Наносит до 27%\/30%\/34%\/38% урона от текущего здоровья цели (до уменьшений), учитывая, что больше ничего не влияет на здоровье цели.",
        "Поскольку урон основан на проценте от текущего здоровья цели, то он никогда не сможет самостоятельно убить цель.",
        "С Arctic Burn Winter Wyvern не может ни активировать, ни получить урон от Proximity Mines.",
        "После окончания действия уничтожает деревья в радиусе 175 от героя.",
        "Не действует на варды, строения и Рошана.",
        "С Aghanim's Scepter Arctic Burn превращается в переключаемую способность. Поэтому Arctic Burn при активации больше не прерывает произносимые заклинания. Также Aghanim's Scepter убирает ограничение на 1 атаку по врагу, позволяя обновлять дебафф последовательными атаками по цели. Поглощает ману с интервалом в 1 секунду спустя 1 секунду после переключения. Всё ещё требует ману на активацию.",
        "Поэтому Arctic Burn при активации больше не прерывает произносимые заклинания.",
        "Также Aghanim's Scepter убирает ограничение на 1 атаку по врагу, позволяя обновлять дебафф последовательными атаками по цели.",
        "Поглощает ману с интервалом в 1 секунду спустя 1 секунду после переключения. Всё ещё требует ману на активацию."
      ],
      "mana": "90",
      "hotKey": "Q",
      "cooldown": "42\/36\/28\/20 (TagTalent 0)",
      "description": "Герой взмывает в небо на арктическом ветре, получая беспрепятственное передвижение и вдыхая жгучий мороз в каждую свою атаку. В полёте можно атаковать дальше и быстрее. Цель морозных атак замедляется и каждую секунду получает урон в размере 6%\/7%\/8%\/9% от текущего запаса здоровья. Также эта способность защищает глаза от ночной прохлады, увеличивая радиус ночного обзора в полёте на 400.",
      "spellName": "Arctic Burn",
      "params": [
        "Анимация применения: 0+0",
        "Доп. дальность атаки: 350\/400\/450\/500",
        "Доп. скорость полета снаряда: 500",
        "Доп. радиус обзора ночью: 400",
        "Урон от текущего здоровья в секунду: 6%\/7%\/8%\/9%",
        "Замедление скорости передвижения врага: 16%\/24%\/32%\/40% (TagTalent 28%\/36%\/44%\/52%)",
        "Длительность дебаффа: 5 (TagTalent 7)",
        "Длительность: 8 (TagAghanim Бесконечная)",
        "Доп. скорость передвижения: 25%",
        "Маны в секунду: 20",
        "Делает способность переключаемой и ежесекундно расходующей ману. Также снимает ограничение на число атак по одной цели и увеличивает скорость героя.",
        "Замедление остается и пытается нанести урон, если дебафф был применен до невосприимчивости к магии и не был развеян.",
        "При улучшении перестает активировать эффекты, срабатывающие от применения."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/77\/Winter_Wyvern_Splinter_Blast_1.mp3\/revision\/latest?cb=20191216030729",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Начальный снаряд движется со скоростью от 650 до 4000. Его скорость зависит от расстояния и изменяется динамически, чтобы достичь цель за 1 секунду. Если цель перемещается со скоростью более 4000 единиц, то снаряду требуется больше 1 секунды для её достижения. И наоборот, если цель перемещается со скоростью меньше 650 единиц, то снаряду требуется меньше 1 секунды, чтобы её достичь.",
        "Если цель перемещается со скоростью более 4000 единиц, то снаряду требуется больше 1 секунды для её достижения.",
        "И наоборот, если цель перемещается со скоростью меньше 650 единиц, то снаряду требуется меньше 1 секунды, чтобы её достичь.",
        "Вторичные снаряды или же осколки движутся со скоростью 600.",
        "Действует на невидимых существ и существ в тумане войны.",
        "Талант на оглушение от Splinter Blast действует только на вторичные цели (как и урон с замедлением). Оглушение не заменяет замедление. Оно все равно применяется, замедляя пораженных существ на 2,5 сек.",
        "Оглушение не заменяет замедление. Оно все равно применяется, замедляя пораженных существ на 2,5 сек.",
        "Осколки сначала наносят урон, а затем применяют дебафф."
      ],
      "mana": "105\/120\/135\/150",
      "hotKey": "W",
      "cooldown": "7",
      "description": "Запускает во врага ледяной шар, который после удара раскалывается на осколки, летящие в противников в радиусе 500 вокруг цели, не причиняя ей ущерб. Задетые осколками противники будут замедлены на 30%.",
      "spellName": "Splinter Blast",
      "params": [
        "Анимация применения: 0,3+1,17",
        "Дальность применения: 1200",
        "Радиус поиска цели: 500 (TagTalent 900)",
        "Урон: 100\/180\/260\/340 (TagTalent 200\/280\/360\/440)",
        "Замедление скорости передвижения: 30%",
        "Длительность замедления: 4",
        "Длительность оглушения: 1,5",
        "Нельзя использовать на врагов с невосприимчивостью к магии. Вторичные снаряды могут отскочить на врагов с невосприимчивостью. Не замедляет и не наносит урон врагам с невосприимчивостью. Замедление остается, если дебафф был применен до невосприимчивости и не был развеян.",
        "Блокируется только основной целью. Блокируется при попадании.",
        "Начальный снаряд нельзя избежать. Вторичные снаряды можно избежать всем, кроме невидимости."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/49\/Winter_Wyvern_Cold_Embrace.mp3\/revision\/latest?cb=20191216030726",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников"
      ],
      "notes": [
        "Нельзя использовать на союзников, которые отключили помощь от Winter Wyvern. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Оглушает цель, делая её невосприимчивой к физическому урону. Цель можно атаковать и на неё действует магический и чистый урон.",
        "Излечивает 7,5\/8,75\/10\/11,25 (TagTalent 13,75\/15\/16,25\/17,5) + 0,44%\/0,63%\/0,81%\/1% здоровья с интервалом в 0,25 секунды спустя 0,25 секунды после применения баффа, срабатывая 16 раз. Излечивает до 120\/140\/160\/180 (TagTalent 220\/240\/260\/280) + 7%\/10%\/13%\/16% от максимального здоровья существа за всю длительность.",
        "Излечивает до 120\/140\/160\/180 (TagTalent 220\/240\/260\/280) + 7%\/10%\/13%\/16% от максимального здоровья существа за всю длительность.",
        "С Aghanim's Shard исчезновение баффа любым способом выпускает осколки от Splinter Blast. Обзор не требуется; осколки могут выбрать невидимых существ и существ в тумане войны. При этом эти осколки, в отличии от обычного применения, можно избежать невидимостью. Осколки связаны с текущим уровнем Splinter Blast. Если способность не изучена, то снаряды не появятся.",
        "Обзор не требуется; осколки могут выбрать невидимых существ и существ в тумане войны.",
        "При этом эти осколки, в отличии от обычного применения, можно избежать невидимостью.",
        "Осколки связаны с текущим уровнем Splinter Blast. Если способность не изучена, то снаряды не появятся."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "E",
      "cooldown": "24\/21\/18\/15 (TagTalent 20\/17\/14\/11)",
      "description": "Заковывает союзника в ледяной кокон, замораживая его и ежесекундно восстанавливая определенное число здоровья плюс процент от максимального уровня здоровья. Кокон полностью блокирует весь физический урон.",
      "spellName": "Cold Embrace",
      "params": [
        "Анимация применения: 0,3+0,63",
        "Дальность применения: 1000",
        "Базовое лечение в секунду: 30\/35\/40\/45 (TagTalent 55\/60\/65\/70)",
        "Восстановление от макс. здоровья: 1,75%\/2,5%\/3,25%\/4%",
        "Длительность: 4",
        "Радиус осколков от Splinter Blast: 1200",
        "По окончании действия кокон взрывается осколками способности Splinter Blast, которые летят во врагов в радиусе 1200. Уменьшает перезарядку на 4 секунд."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1c\/Winter_Wyvern_Winter%27s_Curse.mp3\/revision\/latest?cb=20191216030732",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Цель способности оглушается, а все её союзники попадают под действие провокации и атакуют её. Противники, зашедшие в радиус действия после применения, попадут под действие провокации на оставшуюся длительность. Если в течение 2,5 сек. вокруг цели нет союзников, то дебафф отменяется. Не действует и не учитывает существ с невосприимчивостью к магии,неуязвимостью, спрятанных существ, варды и строения. Действует только на союзников цели. То есть при использовании способности на врага, нейтральные крипы не будут спровоцированы, и наоборот. Хотя провокация не действует на нейтральных крипов, но они учитываются способностью при поиске союзников цели, предотвращая отмену дебаффа.",
        "Противники, зашедшие в радиус действия после применения, попадут под действие провокации на оставшуюся длительность.",
        "Если в течение 2,5 сек. вокруг цели нет союзников, то дебафф отменяется.",
        "Не действует и не учитывает существ с невосприимчивостью к магии,неуязвимостью, спрятанных существ, варды и строения.",
        "Действует только на союзников цели. То есть при использовании способности на врага, нейтральные крипы не будут спровоцированы, и наоборот.",
        "Хотя провокация не действует на нейтральных крипов, но они учитываются способностью при поиске союзников цели, предотвращая отмену дебаффа.",
        "Провокация представлена аурой с бесконечной длительностью задержки. Дебафф сбрасывается после потери целью дебаффа или её смерти. То есть провокация закрепляется за затронутыми существами; перемещение из области не освободит существо от провокации. Также провокация остается, даже если дебафф исчез с основной цели из-за отсутствия врагов в области.",
        "То есть провокация закрепляется за затронутыми существами; перемещение из области не освободит существо от провокации.",
        "Также провокация остается, даже если дебафф исчез с основной цели из-за отсутствия врагов в области.",
        "Область провокации закрепляется за основной целью и следует за ней, если её переместили c помощью принудительного движения.",
        "Применяет базовое уменьшение получаемого урона к целям. Складывается с другими источниками базового уменьшения. То есть источники уменьшения могут использоваться против эффекта самой способности. Уменьшение действует на все типы урона, кроме отмеченного как отнимающий здоровье, от всех источников, кроме Winter Wyvern.",
        "То есть источники уменьшения могут использоваться против эффекта самой способности.",
        "Уменьшение действует на все типы урона, кроме отмеченного как отнимающий здоровье, от всех источников, кроме Winter Wyvern.",
        "Если цель под действием способности умирает из-за союзника или врага, то убийство засчитывается Winter Wyvern. У способности приоритет ниже, если цель находилась под действием Reaper's Scythe. У способности приоритет выше, если цель находилась под действием Ice Blast.",
        "У способности приоритет ниже, если цель находилась под действием Reaper's Scythe.",
        "У способности приоритет выше, если цель находилась под действием Ice Blast.",
        "Не отключает способности; при этом большинство пассивных способностей не действуют на союзных существ.",
        "Если главная цель умирает, провокация моментально прекращается."
      ],
      "mana": "250",
      "hotKey": "R",
      "cooldown": "90\/85\/80",
      "description": "Примораживает противника к земле, повергая окружающих его союзников в безумие и заставляя их атаковать цель способности с повышенной скоростью. Противники под этим эффектом получают урон только от своих союзников, владельца способности и его подконтрольных существ.",
      "spellName": "Winter's Curse",
      "params": [
        "Анимация применения: 0,3+1,37",
        "Дальность применения: 700",
        "Радиус: 525",
        "Уменьшение получаемого урона: 100%",
        "Увеличение скорости атаки: 65",
        "Длительность: 4\/4,75\/5,5 (TagTalent 5,5\/6,25\/7)",
        "Длительность поиска врагов: 2,5",
        "Может выбрать врагов с невосприимчивостью к магии. Не применяет провокацию к врагам с невосприимчивостью. Провокация остается, если дебафф был применен до невосприимчивости.",
        "Блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 24.0,
    "attrIntelligence": 26.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.7,
    "attrAgility": 16.0
  },
  "description": "Winter Wyvern — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Она имеет четыре способности, каждая из которых является активной. Первая способность, Arctic Burn, дает герою бонусную дальность атаки и способность к полету. Атаки, произведенные во время Arctic Burn будут наносить урон в размере 9 % от текущего здоровья цели, а также будут замедлять её на определенный процент. Вторая способность, Splinter Blast, кидает в противника осколок льда. При попадании в цель осколок разбивается на несколько частей, которые замедляют и наносят урон окружающим врагам, оставляя начальную цель нетронутой. Третья способность, Cold Embrace, заковывает союзника или самого себя в ледяную ловушку, при этом восстанавливая процент от максимального здоровья, а также блокируя весь физический урон. Ультимативная способностью, Winter's Curse, накладывает на поле битвы холод, заставляя выбранного врага замерзнуть на месте. Все окружающие союзники вражеского юнита впадают в неконтролируемое безумие, начиная его бить. При этом как цель, так и её союзники имеют 100 % сопротивление всему входящему урону. Улучшение от Aghanim's Scepter делает способность Arctic Burn переключаемой, также убирая ограничение на количество атак по цели.",
  "history": "Как и другим великим поэтам, Аурот постоянно не хватает времени на творчество, ведь жизнь ее полна неожиданностей. Эпос древних драконов знаменит своей долгой и насыщенной историей, но некоторые с опаской полагают, что оставшиеся ученые драконы не настолько плодовиты, как их предки, поскольку с момента процветания в Сказание драконов было добавлено всего лишь несколько строк. Аурот сетует: «Мы стали забывать, что жизнь — это не только победы над врагами и завоевания земель. Каждый должен стремиться к творчеству». Она собралась в исследовательскую экспедицию на поиски новых книг для вдохновения. Но эти исследования жутко утомляют и отвлекают от творческого процесса, на который должно уходить гораздо больше времени. Хоть Аурот и должна скрываться в своем логове, постоянно пополняя сказание, она часто вступает в грандиозные битвы с могучими противниками. Она обыскивает замки и древние библиотеки, а славу, заслуженную в процессе своих поисков, считает побочным эффектом этих исследований. Ее мастерство и отвага на полях сражений стали легендарными, но в муках творчества она не смогла создать того, что заслужило бы признание. Как бы то ни было, она не будет довольствоваться ролью героя сказания. Она хочет быть его автором.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Осколки от Splinter Blast оглушают на 1,5 сек.",
      "talentRight": "+1,5 сек. действия Winter's Curse"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 к урону от Splinter Blast",
      "talentRight": "+12% к замедлению от Arctic Burn"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+400 к радиусу разлёта осколков у Splinter Blast",
      "talentRight": "+2 сек. к длительности урона от Arctic Burn"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+35 к урону",
      "talentRight": "+25% к базовому лечению в секунду от Cold Embrace"
    }
  ]
}