{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7f\/Manta_Style_Mirror_Image.mp3\/revision\/latest?cb=20191227195454",
      "effects": [
        "Split Time: 0.1",
        "Number of Illusions: 2",
        "Illusion Damage Dealt (TagAghanimMelee): 33%",
        "Illusion Damage Dealt (TagAghanimRanged): 28%",
        "Illusion Damage Taken: 300%",
        "Illusion Duration: 20"
      ],
      "notes": [
        "The user is invulnerable, hidden and spell immune during the split time.",
        "Disjoints projectiles, and applies a basic dispel on the wielder upon cast.",
        "After the split time, the caster reappears with their illusions. The reappear locations are based on the caster's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point. The distance in between each is 108 range if the hero has a collision size of 24, and 72 if the collision size is 8. Though the formation is always the same, the caster and their illusions take a random position in the formation and have all the same facing angle. The illusions have a EXPR 2 * IllusionLVL bounty.",
        "The reappear locations are based on the caster's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point.",
        "The distance in between each is 108 range if the hero has a collision size of 24, and 72 if the collision size is 8.",
        "Though the formation is always the same, the caster and their illusions take a random position in the formation and have all the same facing angle.",
        "The illusions have a EXPR 2 * IllusionLVL bounty.",
        "Orders the caster to stop after the split time, canceling all queued orders, and orders given during the split time. Also stops all ongoing targeted orders of other units that have been issued before Mirror Image was cast.",
        "Also stops all ongoing targeted orders of other units that have been issued before Mirror Image was cast.",
        "Provides 1000 radius ground vision for 0.1 seconds upon cast.",
        "Recasting this replaces the illusions from the previous cast which are currently under the owner's control."
      ],
      "mana": "125",
      "abilityName": "Mirror Image",
      "cooldown": "30",
      "description": "Creates 2 images of your hero that last 20 seconds. Melee images deal 33% damage, while Ranged images deal 28%. Illusions take 300% damage.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "200 health and 1 health regeneration.",
    "120 mana and 0.5 mana regeneration.",
    "26 attack speed and 4.33 main armor.",
    "10, 26 and 10 main attack damage to all \/ \/ heroes respectively."
  ],
  "cost": "4600",
  "lore": null,
  "consistFrom": [
    "Yasha",
    "Ultimate Orb",
    "Recipe"
  ],
  "name": "Manta Style",
  "description": "An axe made of reflective materials that causes confusion amongst enemy ranks.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "The Manta Style is less effective on ranged heroes except with heroes with attack modifiers that works on illusions like Luna Moon Glaives bounce, Drow Ranger's high agility and Morphling which mostly buy stats items that benefits illusions.",
    "Doesn't work with Lone Druid's Spirit Bear.",
    "The illusions can be used to scout to secure your farming, prepare a gank, or before attacking Roshan. They are useful to deward and destroy Techies' mines but they don't get True Sight from Gem.",
    "The active of the Manta Style applies a basic dispel, so it can replace a Linken's Sphere against a Bloodthorn or Rod of Atos.",
    "The illusions are good against a hero carrying a Skull Basher, they will have 2\/3 chances to bash your illusion.",
    "Illusions inherit effects such as critical strike and Manabreak, albeit diminished.As a result, Daedalus and Diffusal Blade synergise well with Manta."
  ]
}