{
  "abilities": [
    {
      "notes": [
        "Талант на дальность применения также влияет на максимальную дальность Earth Spike и дистанцию разрыва Mana Drain.",
        "Дополнительный урон и плюс к максимальному здоровью за убийство Finger of Death действует на все существующие накопления, а не только на полученные после взятия таланта.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Hex применяется по области радиусом 250",
          "talentRight": "+800 к дальности Earth Spike"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Mana Drain передаёт ману союзникам",
          "talentRight": "+20 к урону за убийство у Finger of Death"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+70 к макс. здоровью за убийство Finger of Death",
          "talentRight": "−2 сек. перезарядки Earth Spike"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+60 к урону",
          "talentRight": "+15 к скорости передвижения"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Lion_Earth_Spike_1.mp3\/revision\/latest?cb=20191216015624",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость шипов - 1600.",
        "При выборе существа шипы запускаются к его текущему местоположению. Они не перемещаются мгновенно, поэтому от них можно уклониться.",
        "Пораженные существа подбрасываются на 350 единиц на базовые 0,5 секунды оглушения.",
        "Пока существа в воздухе, то остальные могут проходить под ними.",
        "Урон наносится при приземлении, а не при поражении.",
        "Шипам нужно 0.56 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1025 единиц (складывается из дальности прохождения и радиуса). При выборе таланта на дополнительную дальность применения требуется 0.61 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1095 единиц. При выборе таланта на дополнительную дальность Earth Spike требуется 1.06 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1825 единиц. При выборе обоих талантов требуется 1.11 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1895.",
        "При выборе таланта на дополнительную дальность применения требуется 0.61 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1095 единиц.",
        "При выборе таланта на дополнительную дальность Earth Spike требуется 1.06 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1825 единиц.",
        "При выборе обоих талантов требуется 1.11 сек. для достижения максимального расстояния и они поражают существ на расстоянии до 1895.",
        "У способности отображаются только дальность применения и увеличение дистанции прохождения от таланта 25-го уровня. Талант 10-го уровня может увеличить общую дальность применения до 1445 единиц, а дальность прохождения — до 1770 единиц. Только талант 10-го уровня увеличивает дальность применения до 645 единиц, а дальность прохождения — до 970.",
        "Только талант 10-го уровня увеличивает дальность применения до 645 единиц, а дальность прохождения — до 970.",
        "Если Earth Spike задевает невидимых существ, то визуальные эффекты под ними все равно видны."
      ],
      "mana": "70\/100\/130\/160",
      "hotKey": "Q",
      "cooldown": "12 (TagTalent 10)",
      "description": "Из земли прорывается полоса каменных шипов. Они подбрасывают врагов в воздух, а по приземлении оглушают их и наносят урон.",
      "spellName": "Earth Spike",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 575 (TagTalent 1375)",
        "Дальность прохождения: 900 (TagTalent 1700)",
        "Радиус: 125",
        "Урон: 80\/140\/200\/260",
        "Длительность оглушения: 1,4\/1,8\/2,2\/2,6",
        "Пытается нанести урон, если уже задетые враги получили иммунитет к заклинаниям до приземления.",
        "Блокируется при попадании всеми по всей длине шипов."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/43\/Lion_Hex_1.mp3\/revision\/latest?cb=20191216015630",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на область)",
        "Действует на Врагов",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Применяет к цели проклятие, приравнивая её базовую скорость передвижения к 120, обезмолвливая, заглушая и обезоруживая. При этом на цель продолжают действовать бонусы к передвижению от предметов и способностей.",
        "При этом на цель продолжают действовать бонусы к передвижению от предметов и способностей.",
        "Поскольку проклятие меняет базовую скорость передвижения и не применяет замедление, то все эффекты, влияющие на скорость, будут рассчитываться с учетом базовой скорости в 120 единиц.",
        "Hex мгновенно уничтожает иллюзии.",
        "Проклятие Lion превращает цель в лягушку. Косметические предметы Fin King's Charm и Fin King's Charm of Eminent Revival меняют модель на рыбку.",
        "Косметические предметы Fin King's Charm и Fin King's Charm of Eminent Revival меняют модель на рыбку.",
        "Талант 25-го уровня превращает Hex в заклинание, направленное на область, поэтому им больше нельзя напрямую выбрать существ. Действует на каждую подходящую цель в области. Действует на невидимых, но не на неуязвимых или спрятанных существ.",
        "Действует на каждую подходящую цель в области. Действует на невидимых, но не на неуязвимых или спрятанных существ."
      ],
      "mana": "125\/150\/175\/200",
      "hotKey": "W",
      "cooldown": "30\/24\/18\/12",
      "description": "Превращает врага в безобидную зверюшку, блокируя все его способности.",
      "spellName": "Hex",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 500 (TagTalent 570)",
        "Скорость передвижения цели: 120",
        "Длительность: 2,5\/3\/3,5\/4",
        "Радиус: 250",
        "Эффект остается, если дебафф был применен до иммунитета к заклинаниям.",
        "Блокируется при применении. (TagTalentНе блокируется при превращении в заклинание, направленное на область."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Lion_Mana_Drain.mp3\/revision\/latest?cb=20191216015631",
      "effects": [
        "Способность Направленная на существо \/ Произносимая",
        "Действует на Врагов \/ Себя",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Можно использовать только на существ с запасом маны.",
        "Поглощение прервется, если цель покидает пределы обзора заклинателя, получает иммунитет к заклинаниям или неуязвимость, выходит за пределы дистанции разрыва или у неё заканчивается мана.",
        "Вытягивает 0,5 единиц маны с интервалом в 0,1 секунду спустя 0,1 секунды после применения, срабатывая 12 000 раз.",
        "Вытягивает до 100\/200\/300\/600 маны при полном произнесении.",
        "С первым интервалом мгновенно уничтожает иллюзии.",
        "При выборе таланта 20-го уровня способность автоматически выбирает 2-х дополнительных врагов вокруг основной цели, используя те же правила выбора цели. Радиус поиска равен дальности применения плюс дальность поиска вторичной цели, достигая радиуса в 1150 (TagTalent 1220). Поскольку вторичные связи используют дальности применения заклинания, то эффекты, увеличивающие дальность применения, так же действуют на них. Вторичные цели выбираются в области случайно без какого-либо приоритета. Вторичные связи не прерываются, даже если существа становятся неуязвимыми или у них заканчивается мана. Связи прерываются только при выходе за пределы дистанции разрыва. Связи перестают вытягивать ману, если цели стали невидимыми или вышли из обзора, но способность продожает их замедлять. Все связи рвутся в тот момент, когда способность больше не может действовать на основную цель.",
        "Радиус поиска равен дальности применения плюс дальность поиска вторичной цели, достигая радиуса в 1150 (TagTalent 1220).",
        "Поскольку вторичные связи используют дальности применения заклинания, то эффекты, увеличивающие дальность применения, так же действуют на них.",
        "Вторичные цели выбираются в области случайно без какого-либо приоритета.",
        "Вторичные связи не прерываются, даже если существа становятся неуязвимыми или у них заканчивается мана. Связи прерываются только при выходе за пределы дистанции разрыва.",
        "Связи перестают вытягивать ману, если цели стали невидимыми или вышли из обзора, но способность продожает их замедлять.",
        "Все связи рвутся в тот момент, когда способность больше не может действовать на основную цель.",
        "С Aghanim's Shard Mana Drain замедляет скорость атаки и дает эффект True Sight на затронутых врагов."
      ],
      "mana": "10",
      "hotKey": "E",
      "cooldown": "16\/12\/8\/4",
      "description": "Поглощает магическую энергию цели, с каждой секундой передавая ее ману игроку.",
      "spellName": "Mana Drain",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 850 (TagTalent 920)",
        "Макс. целей: 1 (TagTalent 3)",
        "Дистанция разрыва: 1200 (TagTalent 1270)",
        "Вытягивает маны в секунду: 20\/40\/60\/120",
        "Замедление скорости передвижения: 20%\/25%\/30%\/35% (TagTalent 35%\/40%\/45%\/50%)",
        "Макс. длительность: 5",
        "Радиус поиска вторичной цели: 300",
        "Замедление скорости атаки: 120",
        "Mana Drain раскрывает невидимость жертвы и уменьшает её скорость атаки на 120.",
        "Эффект не сохраняется и мгновенно завершается, если дебафф был применен до иммунитета к заклинаниям. (TagTalent Эффект сохраняется на вторичных целях, если дебафф был применен до иммунитета.)",
        "Блокируется при использовании. (TagTalent Блокируется только основной целью.)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/32\/Lion_Finger_of_Death_1.mp3\/revision\/latest?cb=20191216015627",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании применяет дебафф к цели, наносящий урон, и второй дебафф при завершении первого. Дебафф длится 0,25 сек. То есть урон можно избежать, если цель станет неуязвимой, спрятанной или получит иммунитет к заклинаниям при завершении дебаффа.",
        "То есть урон можно избежать, если цель станет неуязвимой, спрятанной или получит иммунитет к заклинаниям при завершении дебаффа.",
        "Если цель умерла под действием второго дебаффа, то Finger Of Death получает постоянный бонус к урону. Иконка баффа у Lion отображает количество убитых под дебаффом героев. Дебафф дополнительного урона складывается; при двойном применении Finger Of Death в течение 3 секунд и смерти цели заклинатель дважды получит бонус.",
        "Иконка баффа у Lion отображает количество убитых под дебаффом героев.",
        "Дебафф дополнительного урона складывается; при двойном применении Finger Of Death в течение 3 секунд и смерти цели заклинатель дважды получит бонус.",
        "Хоть урон дается только за убийство героя, но дебафф применяется к каждой цели. Бонусный урон также дается за умерших клонов Meepo, но не за Tempest Double, иллюзии или крипов-героев.",
        "Бонусный урон также дается за умерших клонов Meepo, но не за Tempest Double, иллюзии или крипов-героев.",
        "Aghanim's Scepter позволяет использовать Finger of Death на всех вражеских существ в радиусе 325 от основной цели. Также целями считаются невидимые враги и враги в тумане войны. К курсору мыши добавляется индикатор области, с помощью которого легче понять, входят ли враги в радиус действия или нет.",
        "Также целями считаются невидимые враги и враги в тумане войны.",
        "К курсору мыши добавляется индикатор области, с помощью которого легче понять, входят ли враги в радиус действия или нет."
      ],
      "mana": "200\/420\/650 (TagTalent 200\/420\/625)",
      "hotKey": "R",
      "cooldown": "160\/100\/40 (TagTalent 100\/60\/20)",
      "description": "Разрывает вражеское существо, пытаясь вывернуть его наизнанку. Наносит большой урон, который увеличивается с каждым убитым этой способностью врагом.",
      "spellName": "Finger of Death",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 900 (TagTalent 970)",
        "Задержка: 0,25",
        "Базовый урон: 600\/725\/850 (TagAghanim 725\/875\/1025)",
        "Доп. урон за убийство: 40 (TagTalent 60)",
        "Длительность учета убийства: 3",
        "Радиус: 325",
        "Увеличивает урон. Уменьшает время перезарядки. Finger of Death бьет существ в небольшой области.",
        "Нельзя использовать на врагов с иммунитетом к заклинаниям. Пытается нанести урон и применяет дебафф, если цель получила иммунитет во время задержки.",
        "Блокируется только основной целью. Блокируется при применении. Частицы все равно отображаются."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.5,
    "attrAgility": 15.0
  },
  "description": "Lion — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первая способность, Earth Spike, выпускает каменные шипы из земли перед вами. Враги будут подброшены в воздух, а затем оглушены и получат урон от падения. Вторая способность, Hex, проклинает врага, превращая его в безобидную лягушку, тем самым снизив его скорость перемещения, а также не дав ему возможность атаковать и применять заклинания. Третья способность, Mana Drain, поглощает ману врагов и крипов, а также замедляет их. Ультимативная способность, Finger of Death, разрывает вражеского юнита, при этом нанося огромный урон. Улучшение с Aghanim's Scepter увеличивает урон, уменьшает время перезарядки, Finger of Death начинает бить по области.",
  "history": "Некогда Великий магистр демонологии заслужил известность среди своих собратьев, сражаясь на стороне света и справедливости. Но лесть испортила его. Силы мага превосходило лишь его же честолюбие, и демон завлёк его на тёмную сторону, выменяв душу магистра на уважение других. Запятнав душу ужасными преступлениями, маг остался в одиночестве: демон предал его и стал искать выгоды у врагов. Ярость демонолога погнала его за предателем в самый ад, где, отрывая конечность за конечностью, он жестоко расправился с демоном и забрал себе его демоническую руку. Оказалось, что демонопластика не проходит бесследно. В ходе трансфигурации тело мага изменилось до неузнаваемости. Он восстал из ада и обрушил ярость на наш мир, убивая даже тех, кто однажды называл его господином, и не оставляя камня на камне в тех землях, где его когда-то обожали. Теперь он живёт в уединении, упражняясь в демонологии, а те, кто называют себя его помощниками или учениками, вскоре лишаются своей маны и растворяются в легчайших порывах ветра.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Hex применяется по области радиусом 250",
      "talentRight": "+800 к дальности Earth Spike"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Mana Drain передаёт ману союзникам",
      "talentRight": "+20 к урону за убийство у Finger of Death"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+70 к макс. здоровью за убийство Finger of Death",
      "talentRight": "−2 сек. перезарядки Earth Spike"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+60 к урону",
      "talentRight": "+15 к скорости передвижения"
    }
  ]
}