{
  "abilities": [
    {
      "notes": [
        "The \/ \/ all stats talent effectively grants Juggernaut 100 health, 0.5 health regeneration, 0.83 armor, 5 attack speed, 60 mana, 0.25 mana regeneration, and 5 main attack damage.",
        "The armor talent does not benefit illusions.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1s Omnislash Duration",
          "talentRight": "+475 Health"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+160 Blade Fury DPS",
          "talentRight": "+8 Armor"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 Attack Speed",
          "talentRight": "-20s Healing Ward Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+75 Blade Fury Radius",
          "talentRight": "+5 All Stats"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Juggernaut_Blade_Fury_1.mp3\/revision\/latest?cb=20191216014540",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self",
        "Damage Magical (TagAghanim Instant Attack)"
      ],
      "notes": [
        "Blade Fury cannot be cast during Omnislash and Swiftslash.",
        "Does not interrupt Juggernaut's channeling abilities upon cast.",
        "Applies spell immunity for the duration and a basic dispel upon cast. Juggernaut cannot be affected by Ghost Form for its duration. The buff gets removed immediately.",
        "Juggernaut cannot be affected by Ghost Form for its duration. The buff gets removed immediately.",
        "Juggernaut can perform attacks, cast abilities, and use items during Blade Fury. However, both Omnislash and Swiftslash are inactive for the duration and cannot be cast.",
        "However, both Omnislash and Swiftslash are inactive for the duration and cannot be cast.",
        "During Blade Fury, Juggernaut's attacks deal 0 damage, except against wards and buildings. Attack modifiers (i.e. Monkey King Bar etc.) still apply their effects and damage on procs. Despite the visual effect, critical strike, lifesteal and cleave have no effect, since they are based on the actual damage dealt.",
        "Attack modifiers (i.e. Monkey King Bar etc.) still apply their effects and damage on procs.",
        "Despite the visual effect, critical strike, lifesteal and cleave have no effect, since they are based on the actual damage dealt.",
        "Deals 18\/23\/28\/33 (TagTalent 50\/55\/60\/65) damage in 0.2-second intervals, starting 0.2 seconds after cast, resulting in 25 damage instances. Can deal up to 450\/575\/700\/825 (TagTalent 1250\/1375\/1500\/1625) damage to a single unit (before reductions).",
        "Can deal up to 450\/575\/700\/825 (TagTalent 1250\/1375\/1500\/1625) damage to a single unit (before reductions).",
        "With Aghanim's Shard, Juggernaut performs instant attacks on random enemies within the area in 1-second intervals, starting 0.2 seconds after cast, resulting in up to 4 attacks. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms. The instant attack targets are chosen randomly, there are no priorities. The instant attack does not target buildings or wards. Unlike the regular attacks that can be performed during Blade Fury, the instant attacks' damage can be defined as ΣAtk × 75%, instead of 0. Since the instant attack damage comes from a regular attack, it counts as attack damage and is affected by damage block.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "The instant attack targets are chosen randomly, there are no priorities. The instant attack does not target buildings or wards.",
        "Unlike the regular attacks that can be performed during Blade Fury, the instant attacks' damage can be defined as ΣAtk × 75%, instead of 0.",
        "Since the instant attack damage comes from a regular attack, it counts as attack damage and is affected by damage block."
      ],
      "mana": "120\/110\/100\/90",
      "hotKey": "Q",
      "cooldown": "42\/34\/26\/18",
      "description": "Causes a bladestorm of destructive force around Juggernaut, rendering him immune to magic and dealing damage to nearby enemy units.",
      "spellName": "Blade Fury",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 260 (TagTalent 335)",
        "Damage per Second: 90\/115\/140\/165 (TagTalent 250\/275\/300\/325)",
        "Duration: 5",
        "Move Speed Bonus: 100",
        "Instant Attack Damage: 75%",
        "Instant Attack Interval: 1",
        "Increases movement speed during Blade Fury by 100 and attacks a random nearby unit once per second dealing 75% damage."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Juggernaut_Healing_Ward.mp3\/revision\/latest?cb=20191216014542",
      "effects": [
        "Ability Target Area \/ Aura",
        "Affects Allies"
      ],
      "notes": [
        "After cast, the ward automatically follows Juggernaut, if no other order is given.",
        "The heal is provided by an aura. The buff lingers for 2.5 seconds. The healing auras of multiple Healing Wards do not stack.",
        "The healing auras of multiple Healing Wards do not stack.",
        "Can regenerate up to 55%\/82.5%\/110%\/137.5% of a unit's max health over its full duration. Can fully regenerate a unit's health within 50\/33.33\/25\/20 seconds.",
        "Can fully regenerate a unit's health within 50\/33.33\/25\/20 seconds.",
        "Does not affect wards, buildings, invulnerable or hidden units."
      ],
      "mana": "140",
      "hotKey": "W",
      "cooldown": "60 (TagTalent 40)",
      "description": "Summons a Healing Ward which heals all nearby allied units, based on their max health. The Healing Ward moves at 325 movement speed after being summoned. Lasts 25 seconds.",
      "spellName": "Healing Ward",
      "params": [
        "Cast Animation: 0.3+0.47",
        "Cast Range: 350",
        "Radius: 500",
        "Max Health as Health Regen Bonus: 2%\/3%\/4%\/5%",
        "Aura Linger Duration: 2.5",
        "Duration: 25"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Juggernaut_Blade_Dance.mp3\/revision\/latest?cb=20191216014552",
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Increases attack damage by an average of 16%\/20%\/24%\/28%.",
        "A critical strike proc is decided upon attack begin, not upon landing an attack. When a critical strike procs, Juggernaut uses a specific crit attack animation, and particle effects appear on his weapon.",
        "When a critical strike procs, Juggernaut uses a specific crit attack animation, and particle effects appear on his weapon.",
        "The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher crit multiplier has priority.",
        "If two sources of critical strike proc at the same time, the higher crit multiplier has priority.",
        "Blade Dance uses pseudo-random distribution."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Gives Juggernaut a chance to deal critical damage on each attack.",
      "spellName": "Blade Dance",
      "params": [
        "Proc Chance: 20%\/25%\/30%\/35%",
        "Critical Damage: 180%",
        "Red critical numbers are before illusion and armor reduction."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c5\/Juggernaut_Swiftslash.mp3\/revision\/latest?cb=20200419153429",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Instant Attack"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Swiftslash cannot be cast during Blade Fury.",
        "Does not require Omnislash to be leveled to be unlocked, once Aghanim's Scepter is acquired. However, it relies on Omnislash to work, since it directly uses its values. This means when Omnislash is not learned, Swiftslash does nothing on cast.",
        "However, it relies on Omnislash to work, since it directly uses its values. This means when Omnislash is not learned, Swiftslash does nothing on cast.",
        "Omnislash notes fully apply.",
        "Swiftslash is distinguished by blue particles, as opposed to the orange particles of Omnislash."
      ],
      "mana": "125",
      "hotKey": "D",
      "cooldown": "20",
      "description": "Performs a quick Omnislash.",
      "spellName": "Swiftslash",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 550",
        "Duration: 0.8",
        "Only the very first slash of the cast is blocked."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Juggernaut_Omnislash.mp3\/revision\/latest?cb=20191216014545",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Instant Attack"
      ],
      "notes": [
        "Turns Juggernaut spell immune, invulnerable, and rooted for the whole duration, and applies a basic dispel on cast.",
        "Juggernaut can cast abilities and use items during Omnislash. However, Blade Fury is inactive for the duration and cannot be cast. During Omnislash, Juggernaut does not need to turn in order to cast targeted abilities or items.",
        "However, Blade Fury is inactive for the duration and cannot be cast.",
        "During Omnislash, Juggernaut does not need to turn in order to cast targeted abilities or items.",
        "The slash interval equals Juggernaut's current attack rate divided by 1.5. This can be defined as With the attack speed cap, the minimum and maximum possible slash intervals are 0.087 and 3.03 respectively. The interval is not set on cast. On each slash, the interval updates based on his current attack rate.",
        "This can be defined as",
        "With the attack speed cap, the minimum and maximum possible slash intervals are 0.087 and 3.03 respectively.",
        "The interval is not set on cast. On each slash, the interval updates based on his current attack rate.",
        "Causes Juggernaut to perform instant attacks on enemies he slashes. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "Can neither be cast on nor jump on wards, Couriers and buildings. Can jump on invulnerable and ethereal units, however, the instant attacks do not trigger. Cannot jump on units in the Fog of War, invisible or hidden units, Undying Zombie and Astral Spirit.",
        "Can jump on invulnerable and ethereal units, however, the instant attacks do not trigger.",
        "Cannot jump on units in the Fog of War, invisible or hidden units, Undying Zombie and Astral Spirit.",
        "If no valid targets can be found within range and within 0.15 seconds after the previous jump, Omnislash ends prematurely.",
        "On each slash, Juggernaut is positioned at the opposite side of the target from Juggernaut's position, facing the target. The slash radius is centered around Juggernaut, not around the current target.",
        "The slash radius is centered around Juggernaut, not around the current target.",
        "Provides 200 radius flying vision lasting 1 second on each slash around the current target.",
        "Recasting Omnislash while the previous cast is still active cancels the previous cast and starts a new instance. This also applies when Swiftslash is cast during Omnislash, the former canceling the latter, and vice versa.",
        "This also applies when Swiftslash is cast during Omnislash, the former canceling the latter, and vice versa.",
        "Centers the player's camera perspective on Juggernaut on cast, following his position during Omnislash."
      ],
      "mana": "200\/275\/350",
      "hotKey": "R",
      "cooldown": "140",
      "description": "Juggernaut leaps towards the target enemy units, and then slashes the target and other nearby enemy units at an increased attack rate. Juggernaut is invulnerable for the duration.",
      "spellName": "Omnislash",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 350",
        "Search Radius: 425",
        "Attack Rate Divisor: 1.5",
        "Attack Damage Bonus: 30\/40\/50",
        "Attack Speed Bonus: 40",
        "Duration: 3\/3.25\/3.5 (TagTalent 4\/4.25\/4.5)",
        "Grants a new ability: Swiftslash.",
        "Only the very first slash of the cast is blocked."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 20.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.8,
    "attrAgility": 34.0
  },
  "description": "Yurnero, the Juggernaut, is a melee agility hero whose abilities allow him to sprint into battle and recklessly devastate enemies in an impenetrable flurry of blades.",
  "history": "No one has ever seen the face hidden beneath the mask of Yurnero the Juggernaut. It is only speculation that he even has one. For defying a corrupt lord, Yurnero was exiled from the ancient Isle of Masks--a punishment that saved his life. The isle soon after vanished beneath the waves in a night of vengeful magic. He alone remains to carry on the Isle's long Juggernaut tradition, one of ritual and swordplay. The last practitioner of the art, Yurnero's confidence and courage are the result of endless practice; his inventive bladework proves that he has never stopped challenging himself. Still, his motives are as unreadable as his expression. For a hero who has lost everything twice over, he fights as if victory is a foregone conclusion.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1s Omnislash Duration",
      "talentRight": "+475 Health"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+160 Blade Fury DPS",
      "talentRight": "+8 Armor"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 Attack Speed",
      "talentRight": "-20s Healing Ward Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+75 Blade Fury Radius",
      "talentRight": "+5 All Stats"
    }
  ]
}