{
  "abilities": [
    {
      "notes": [
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-30% перезарядки заклинаний",
          "talentRight": "-4 к снижению брони от Presence of the Dark Lord"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+120 к урону от Shadowraze",
          "talentRight": "+3 урона за душу"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25 к скорости передвижения",
          "talentRight": "Аура Presence of the Dark Lord действует на строения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости атаки",
          "talentRight": "+6% к урону от заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Shadow_Fiend_Shadowraze.mp3\/revision\/latest?cb=20191216022921",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Все три способности Shadowraze связаны и имеют один и тот же уровень. Улучшение одной из них автоматически повысит уровень двух других.",
        "При использовании Shadowraze (Близко) бьет по области с радиусом в 250 единиц в 200 единицах от Невермора. То есть способность поражает существ на расстоянии до 50 единиц позади Shadow Fiend и до 450 единицах перед ним.",
        "То есть способность поражает существ на расстоянии до 50 единиц позади Shadow Fiend и до 450 единицах перед ним.",
        "Накладывает один дебафф на врага. Этот дебафф высчитывает, сколько раз цель была задета способностью за его длительность. Shadowraze сначала устанавливает значение урона, учитывая текущее число эффектов, затем применяет дебафф\/добавляет эффект, а затем наносит урон. То есть эффект, добавляемый применением, не влияет непосредственно на урон. Число в иконке показывает, сколько раз дебафф был обновлен с учетом первого применения. У дебаффа нет ограничения по числу эффектов и он может увеличиваться бесконечно.",
        "Shadowraze сначала устанавливает значение урона, учитывая текущее число эффектов, затем применяет дебафф\/добавляет эффект, а затем наносит урон.",
        "То есть эффект, добавляемый применением, не влияет непосредственно на урон.",
        "Число в иконке показывает, сколько раз дебафф был обновлен с учетом первого применения.",
        "У дебаффа нет ограничения по числу эффектов и он может увеличиваться бесконечно.",
        "Поражение всеми тремя способностями наносит до 420\/660\/900\/1140 (TagTalent 780\/1020\/1260\/1500) единиц урона одному существу (до уменьшений) при условии их попадания.",
        "Дебафф Shadowraze Counter, размещенный на героях, используется для подсчета успешных попаданий Shadowraze и длится 3 секунды. Несмотря на то, что дебафф используется только косметическим предметом Demon Eater, счетчик при этом размещается всегда.",
        "Несмотря на то, что дебафф используется только косметическим предметом Demon Eater, счетчик при этом размещается всегда."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "Q",
      "cooldown": "10 (TagTalent 7)",
      "description": "Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.",
      "spellName": "Shadowraze (Близко)",
      "params": [
        "Анимация применения: 0,55+0",
        "Дистанция: 200",
        "Радиус: 250",
        "Базовый урон: 90\/160\/230\/300 (TagTalent 210\/280\/350\/420)",
        "Увеличение урона за эффект: 50\/60\/70\/80",
        "Длительность эффекта: 8",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "Z",
      "story": "Фирменный метод сбора душ."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Shadowraze.mp3\/revision\/latest?cb=20140526001653",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Shadowraze (Средне) бьет по области с радиусом в 250 единиц в 450 единицах от Невермора. То есть способность поражает существ на расстоянии от 200 до 700 единиц перед Shadow Fiend.",
        "То есть способность поражает существ на расстоянии от 200 до 700 единиц перед Shadow Fiend.",
        "Способность недоступна в режиме Ability Draft."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "W",
      "cooldown": "10 (TagTalent 7)",
      "description": "Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.",
      "spellName": "Shadowraze (Средне)",
      "params": [
        "Анимация применения: 0,55+0",
        "Дистанция: 450",
        "Радиус: 250",
        "Базовый урон: 90\/160\/230\/300 (TagTalent 210\/280\/350\/420)",
        "Увеличение урона за эффект: 50\/60\/70\/80",
        "Длительность эффекта: 8",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "X",
      "story": "Фирменный метод сбора душ."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Shadowraze.mp3\/revision\/latest?cb=20140526001653",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Shadowraze (Далеко) бьет по области с радиусом в 250 единиц в 700 единицах от Невермора. То есть способность поражает существ на расстоянии от 450 до 950 единиц перед Shadow Fiend.",
        "То есть способность поражает существ на расстоянии от 450 до 950 единиц перед Shadow Fiend.",
        "Способность недоступна в режиме Ability Draft."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "E",
      "cooldown": "10 (TagTalent 7)",
      "description": "Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.",
      "spellName": "Shadowraze (Далеко)",
      "params": [
        "Анимация применения: 0,55+0",
        "Дистанция: 700",
        "Радиус: 250",
        "Базовый урон: 90\/160\/230\/300 (TagTalent 210\/280\/350\/420)",
        "Увеличение урона за эффект: 50\/60\/70\/80",
        "Длительность эффекта: 8",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Фирменный метод сбора душ."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Получает души за каждое существо, включая варды и союзников, но исключая союзные Варды, иллюзии, Tempest Double и строения.",
        "Вопреки визуальным эффектам Shadow Fiend мгновенно получает душу и урон от убитых существ.",
        "Текущее число душ видно в иконке баффа.",
        "Если у Shadow Fiend нечетное число душ на момент смерти, то число теряемых округляется в меньшую сторону. То есть он никогда не сможет потерять все свои души. У Shadow Fiend всегда будет оставаться 1 душа, даже если он умрет, имея всего 1.",
        "То есть он никогда не сможет потерять все свои души. У Shadow Fiend всегда будет оставаться 1 душа, даже если он умрет, имея всего 1.",
        "Чем больше душ у Shadow Fiend, тем больше красных частиц летает около его груди.",
        "Максимальное число душ на каждом уровне Necromastery дает 11\/28\/51\/80 (TagTalent 25\/50\/75\/100) дополнительного урона. С изученным талантом на дополнительный урон с душ он увеличивается до 44\/70\/102\/140 (TagTalent 100\/125\/150\/175) Может увеличить урон от заклинаний на 8,25%\/10,5%\/12,75%\/15% (TagTalent 18,75%) при максимальном запасе душ.",
        "С изученным талантом на дополнительный урон с душ он увеличивается до 44\/70\/102\/140 (TagTalent 100\/125\/150\/175)",
        "Может увеличить урон от заклинаний на 8,25%\/10,5%\/12,75%\/15% (TagTalent 18,75%) при максимальном запасе душ.",
        "Души не теряются при смерти при наличии Aegis of the Immortal.",
        "Дополнительные души от Aghanim's Scepter влияют на число волн, создаваемых Requiem of Souls. При потере Aghanim's Scepter герой сохраняет накопленные души, даже если их количество больше, чем текущее допустимое. То есть Requiem of Souls выпустит большее число волн даже без Aghanim's Scepter. При этом дополнительный урон мгновенно адаптируется и не учитывает дополнительные души без наличия Aghanim's Scepter.",
        "При потере Aghanim's Scepter герой сохраняет накопленные души, даже если их количество больше, чем текущее допустимое.",
        "То есть Requiem of Souls выпустит большее число волн даже без Aghanim's Scepter.",
        "При этом дополнительный урон мгновенно адаптируется и не учитывает дополнительные души без наличия Aghanim's Scepter."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Герой крадет душу каждого убитого врага, получая бонус к атаке. После смерти выпускает половину из них.",
      "spellName": "Necromastery",
      "params": [
        "Максимум душ: 11\/14\/17\/20 (TagAghanim 25)",
        "Душ за убийство: 1",
        "Доп. урон за душу: 1\/2\/3\/4 (TagTalent 4\/5\/6\/7)",
        "Доп. урон от заклинаний за душу: 0 (TagTalent 0,75%)",
        "Потеря при смерти: 50%",
        "Увеличивает максимальное число душ.",
        "Necromastery даёт +0,75% к урону от заклинаний за душу.",
        "Предотвращает получение новых накоплений. Уже полученные продолжают давать бонус к урону.",
        "Изначально иллюзии имеют 0 душ. Они способны собирать души, но бонус к урону от них не добавляется."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "Собранные души скользят по грани Бездны, усиливая Невермора и позволяя ему и дальше пополнять свою коллекцию."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Снижение брони предоставлено аурой. Дебафф задерживается на 0.5 сек.",
        "Не действует на врагов, не имеющих обзора на Shadow Fiend.",
        "С выбранным талантом способность действует на строения."
      ],
      "mana": null,
      "hotKey": "F",
      "cooldown": null,
      "description": "Присутствие героя снижает броню ближайших врагов.",
      "spellName": "Presence of the Dark Lord",
      "params": [
        "Радиус: 1200",
        "Снижение брони: 4\/5\/6\/7 (TagTalent 8\/9\/10\/11)",
        "Длительность задержки ауры: 0.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "P",
      "story": "Даже просто будучи рядом, Невермор разъедает душу."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Shadow_Fiend_Requiem_of_Souls_1.mp3\/revision\/latest?cb=20191216022919",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов (TagAghanim Себя)",
        "Урон Магический"
      ],
      "notes": [
        "При произнесении этой способности к Shadow Fiend применяется сквозное передвижение, позволяя другим существам проходить сквозь него.",
        "Урон зависит от числа душ, полученных от Necromastery. Каждые 1 души создают одну волну. В режиме Ability Draft для действия Requiem of Souls необходима Necromastery.",
        "В режиме Ability Draft для действия Requiem of Souls необходима Necromastery.",
        "Волны действуют согласно следующим механикам: Область каждой волны имеет форму конуса. Расстояние между волнами всегда одинаковое. Одна волна всегда выпускается на востоке, а остальные подстраиваются под неё. Волны движутся со скоростью в 700 единиц, преодолевая максимальное расстояние за 1.43 сек. Волны поражают существ на расстоянии до 1350 единиц (складывается из дальности прохождения и конечной ширины). Любая волна не может поразить одно и то же существо больше одного раза за применение (TagTalent соответственно при выпускании и возвращении).",
        "Область каждой волны имеет форму конуса.",
        "Расстояние между волнами всегда одинаковое. Одна волна всегда выпускается на востоке, а остальные подстраиваются под неё.",
        "Волны движутся со скоростью в 700 единиц, преодолевая максимальное расстояние за 1.43 сек.",
        "Волны поражают существ на расстоянии до 1350 единиц (складывается из дальности прохождения и конечной ширины).",
        "Любая волна не может поразить одно и то же существо больше одного раза за применение (TagTalent соответственно при выпускании и возвращении).",
        "Применяет страх и снижает скорость передвижения всех вражеских существ, задетых волнами от Requiem of Souls. Длительность увеличивается на 0,8 за каждую попавшую волну, но максимальная длительность ограничена 2,4 секундами.",
        "Длительность увеличивается на 0,8 за каждую попавшую волну, но максимальная длительность ограничена 2,4 секундами.",
        "В отличии от других источников страха пораженный враг бежит от заклинателя, а не направляется к фонтану своей команды.",
        "Выпущенные волны наносят до 1600\/2400\/3200 (TagTalent 2000\/3000\/4000) урона одному существу (до уменьшений), если его задели все волны.",
        "Волны сначала наносят урон, а затем применяют дебафф.",
        "При смерти героя Requiem of Souls автоматически и мгновенно применяется вне зависимости от количества маны и статуса перезарядки. До этого Shadow Fiend сначала теряет 0 от запаса душ. Поэтому пассивная Requiem of Souls может выпустить лишь до 0\/0\/0\/0 (TagTalent 0) волн от максимального значения. Пассивная Requiem of Souls не применяет страх, но замедляет скорость передвижения. Пассивная Requiem of Souls не выпускается в момент смерти при наличии Aegis of the Immortal.",
        "До этого Shadow Fiend сначала теряет 0 от запаса душ. Поэтому пассивная Requiem of Souls может выпустить лишь до 0\/0\/0\/0 (TagTalent 0) волн от максимального значения.",
        "Пассивная Requiem of Souls не применяет страх, но замедляет скорость передвижения.",
        "Пассивная Requiem of Souls не выпускается в момент смерти при наличии Aegis of the Immortal.",
        "С Aghanim's Scepter каждая выпущенная волна при достижении максимального расстояния начинает возвращаться к Shadow Fiend. Вопреки визуальным эффектам волны не \"появляются\" вокруг Shadow Fiend. Они движутся обратно точно с того места, где остановились. Волны возвращаются к текущему расположению Shadow Fiend, а не к месту произнесения заклинания. Волны не будут подстраиваться к новому расположению, если Shadow Fiend передвинется. Начав свое возвращение, их путь уже не меняется. Максимальная дальность прохождения применяется и к возвращению волн; то есть всего они проходят путь в 2000 единиц. При возвращении волн значения максимальной и минимальной ширины меняются между собой: волны начинают с максимальной ширины и заканчивают минимальной. Возвращающиеся волны наносят 40% от урона. Они, как и расширяющиеся волны, поражают всех существа и так же применяют дебафф. Возвращающиеся волны так же применяют страх и замедление скорости передвижения. Эффекты Aghanim's Scepter не распространяются на пассивное срабатывание способности.",
        "Вопреки визуальным эффектам волны не \"появляются\" вокруг Shadow Fiend. Они движутся обратно точно с того места, где остановились.",
        "Волны возвращаются к текущему расположению Shadow Fiend, а не к месту произнесения заклинания.",
        "Волны не будут подстраиваться к новому расположению, если Shadow Fiend передвинется. Начав свое возвращение, их путь уже не меняется.",
        "Максимальная дальность прохождения применяется и к возвращению волн; то есть всего они проходят путь в 2000 единиц.",
        "При возвращении волн значения максимальной и минимальной ширины меняются между собой: волны начинают с максимальной ширины и заканчивают минимальной.",
        "Возвращающиеся волны наносят 40% от урона. Они, как и расширяющиеся волны, поражают всех существа и так же применяют дебафф.",
        "Возвращающиеся волны так же применяют страх и замедление скорости передвижения.",
        "Эффекты Aghanim's Scepter не распространяются на пассивное срабатывание способности.",
        "Возвращающиеся волны наносят до 800\/1200\/1600 единиц урона одному существу (до уменьшений), в случае, если его задели все волны. Вместе с выпускаемыми волнами Requiem of Souls наносит до 2800\/4200\/5600 единиц урона одному существу (до уменьшений).",
        "Вместе с выпускаемыми волнами Requiem of Souls наносит до 2800\/4200\/5600 единиц урона одному существу (до уменьшений).",
        "Лечение зависит от урона, нанесенного возвращающимся волнами, а не базовыми выпускаемыми. Лечение применяется после завершения движения волн. В учет лечения идет только тот урон, который был нанесен героям (включая иллюзий). Всегда лечит на 32\/48\/64 за пораженного независимо от фактически нанесенного волнами урона.",
        "Лечение применяется после завершения движения волн.",
        "В учет лечения идет только тот урон, который был нанесен героям (включая иллюзий).",
        "Всегда лечит на 32\/48\/64 за пораженного независимо от фактически нанесенного волнами урона."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "120\/110\/100 (TagTalent 84\/77\/70)",
      "description": "Герой выпускает собранные души в волнах демонической энергии. Существа возле него могут получить урон от нескольких волн. Замедляет передвижение врагов и накладывает на них страх на 0,8 сек. за каждую задетую волну. Создаёт одну волну энергии за каждую 1-ну душу, захваченные с помощью Necromastery. Если герой погибнет, то эта способность сработает автоматически вне зависимости от её готовности.",
      "spellName": "Requiem of Souls",
      "params": [
        "Анимация применения: 1,67+0,77",
        "Дальность прохождения волн: 1000",
        "Начальная ширина волны: 125",
        "Конечная ширина волны: 350",
        "Число душ для волны (TagTalentNecromastery): 1",
        "Урон за выпущенную волну: 80\/120\/160",
        "Урон за вернувшуюся волну: 0 (TagAghanim 32\/48\/64)",
        "Лечение за героя: 0 (TagAghanim 32\/48\/64)",
        "Замедление скорости передвижения: 25%",
        "Длительность дебаффа за волну: 0,8",
        "Макс. длительность дебаффа: 2,4",
        "Заставляет ослабленные волны способности возвращаться к герою, излечивая его на количество нанесённого урона.",
        "Пассивное срабатывание при смерти не блокируется истощением."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Заточённые души тех, кто пал в былых сражениях, обретают свободу, дабы мстительно преследовать своих бывших союзников."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.7,
    "attrStrength": 19.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 3.5,
    "attrAgility": 20.0
  },
  "description": "Shadow Fiend — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Первые три способности, Shadowraze, разрывают участок земли перед Shadow Fiend, нанося урон всем врагам в зоне действия. Разница между этими способностями заключается в дальности применения. Первая пассивная способность, Necromastery, крадет душу каждого убитого врага, давая бонус к атаке. При убийстве героя способность накапливает 1 душу. После смерти половина из них выпускается. Вторая пассивная способность, Presence of the Dark Lord, снижает броню ближайших врагов. Ультимативная способность, Requiem of Souls, выпускает собранные души, нанося урон, снижая урон каждого юнита в радиусе. Если Shadow Fiend погибает, то способность автоматически срабатывает вне зависимости от ее готовности. Requiem of Souls накладывает страх на противника длительностью 1.25",
  "history": "Говорят, у Невермора душа поэта, но на самом деле у него их тысячи. Веками он поглощал души стихотворцев, священников, императоров, нищих, рабов, философов, преступников и, естественно, героев. Не скрыться от него ни душе. Никто не знает, что он с ними делает. Никто не вглядывался в Бездну, где среди астральных скал Невермор таится, словно змея. Пожирает ли он души одну за другой? Выставляет ли он их трофеями в коридорах зловещего храма? Маринует ли в чернокнижном рассоле? А может, он — лишь марионетка, которой кукловодит зловещий разум извне пространства? Таково его зло, настолько силен его тёмный дух, что разумом его не понять. А если вам всё же очень хочется разузнать, что он делает с душами, то всё просто: присоединяйтесь к его коллекции. Или просто подождите: Невермор уже идёт к вам.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-30% перезарядки заклинаний",
      "talentRight": "-4 к снижению брони от Presence of the Dark Lord"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+120 к урону от Shadowraze",
      "talentRight": "+3 урона за душу"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25 к скорости передвижения",
      "talentRight": "Аура Presence of the Dark Lord действует на строения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости атаки",
      "talentRight": "+6% к урону от заклинаний"
    }
  ]
}