{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−50 сек. перезарядки Requiem of Souls",
          "talentRight": "−4 к снижению брони от Presence of the Dark Lord"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0,4 страха\/замедления за волну Requiem of Souls",
          "talentRight": "+3 урона за душу"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 урона от Shadowraze",
          "talentRight": "Аура Presence of the Dark Lord действует на строения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+25 к скорости атаки",
          "talentRight": "+8% к урону от заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Shadow_Fiend_Shadowraze.mp3\/revision\/latest?cb=20191216022921",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Все три способности Shadowraze связаны и имеют один и тот же уровень. Улучшение одной из них автоматически повысит уровень двух других.",
        "При использовании Shadowraze (Близко) бьет по области с радиусом в 250 единиц в 200 единицах от Невермора. То есть способность поражает существ на расстоянии до 50 единиц позади Shadow Fiend и до 450 единицах перед ним.",
        "То есть способность поражает существ на расстоянии до 50 единиц позади Shadow Fiend и до 450 единицах перед ним.",
        "Накладывает один скрытый дебафф на врага. Этот дебафф высчитывает, сколько раз цель была задета способностью за его длительность. Shadowraze сначала устанавливает значение урона, учитывая текущее число эффектов, затем применяет дебафф\/добавляет эффект, а затем наносит урон. То есть эффект, добавляемый применением, не влияет непосредственно на урон. Число в иконке показывает, сколько раз дебафф был обновлен с учетом первого применения. У дебаффа нет ограничения по числу эффектов и он может увеличиваться бесконечно.",
        "Shadowraze сначала устанавливает значение урона, учитывая текущее число эффектов, затем применяет дебафф\/добавляет эффект, а затем наносит урон.",
        "То есть эффект, добавляемый применением, не влияет непосредственно на урон.",
        "Число в иконке показывает, сколько раз дебафф был обновлен с учетом первого применения.",
        "У дебаффа нет ограничения по числу эффектов и он может увеличиваться бесконечно.",
        "Поражение всеми тремя способностями наносит до 420\/660\/900\/1140 (TagTalent 720\/960\/1200\/1440) единиц урона одному существу (до уменьшений).",
        "Скрытый дебафф, размещенный на героях, используется для подсчета успешных попаданий Shadowraze и длится 3 секунды. Несмотря на то, что дебафф используется только косметическим предметом Demon Eater, счетчик при этом размещается всегда.",
        "Несмотря на то, что дебафф используется только косметическим предметом Demon Eater, счетчик при этом размещается всегда."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "Q",
      "cooldown": "10",
      "description": "Герой опустошает участок земли прямо перед собой, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.",
      "spellName": "Shadowraze (Близко)",
      "params": [
        "Анимация применения: 0,55+0",
        "Дистанция: 200",
        "Радиус: 250",
        "Базовый урон: 90\/160\/230\/300 (TagTalent 190\/260\/330\/400)",
        "Увеличение урона за эффект: 50\/60\/70\/80",
        "Длительность эффекта: 8",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "Z",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Shadowraze.mp3\/revision\/latest?cb=20140526001653",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Все три способности Shadowraze связаны и имеют один и тот же уровень. Улучшение одной из них автоматически повысит уровень двух других.",
        "При использовании Shadowraze (Средне) бьет по области с радиусом в 250 единиц в 450 единицах от Невермора. То есть способность поражает существ на расстоянии от 200 до 700 единиц перед Shadow Fiend.",
        "То есть способность поражает существ на расстоянии от 200 до 700 единиц перед Shadow Fiend.",
        "Действуют те же примечания, что и для Shadowraze (Близко)."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "W",
      "cooldown": "10",
      "description": "Герой опустошает участок земли недалеко от себя, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.",
      "spellName": "Shadowraze (Средне)",
      "params": [
        "Анимация применения: 0,55+0",
        "Дистанция: 450",
        "Радиус: 250",
        "Базовый урон: 90\/160\/230\/300 (TagTalent 190\/260\/330\/400)",
        "Увеличение урона за эффект: 50\/60\/70\/80",
        "Длительность эффекта: 8",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "X",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Shadowraze.mp3\/revision\/latest?cb=20140526001653",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Все три способности Shadowraze связаны и имеют один и тот же уровень. Улучшение одной из них автоматически повысит уровень двух других.",
        "При использовании Shadowraze (Далеко) бьет по области с радиусом в 250 единиц в 700 единицах от Невермора. То есть способность поражает существ на расстоянии от 450 до 950 единиц перед Shadow Fiend.",
        "То есть способность поражает существ на расстоянии от 450 до 950 единиц перед Shadow Fiend.",
        "Действуют те же примечания, что и для Shadowraze (Близко)."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "E",
      "cooldown": "10",
      "description": "Герой опустошает участок земли на значительном расстоянии от себя, нанося урон всем врагам в зоне действия. Накладывает на жертву складывающийся эффект, увеличивающий урон от этой способности с каждым её попаданием.",
      "spellName": "Shadowraze (Далеко)",
      "params": [
        "Анимация применения: 0,55+0",
        "Дистанция: 700",
        "Радиус: 250",
        "Базовый урон: 90\/160\/230\/300 (TagTalent 190\/260\/330\/400)",
        "Увеличение урона за эффект: 50\/60\/70\/80",
        "Длительность эффекта: 8",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная (TagAghanim Направленная на существо \/ Авто-применяемая)",
        "Действует на Себя (TagAghanim Врагов)"
      ],
      "notes": [
        "Получает души за каждое существо, включая варды и союзников, но исключая союзные варды для обзора, иллюзии, Tempest Double и постройки. Текущее число душ видно в иконке баффа.",
        "Текущее число душ видно в иконке баффа.",
        "Если у Shadow Fiend нечетное число душ на момент смерти, то число теряемых округляется в меньшую сторону. То есть он никогда не сможет потерять все свои души. У Shadow Fiend всегда будет оставаться 1 душа, даже если он умрет, имея всего 1.",
        "То есть он никогда не сможет потерять все свои души. У Shadow Fiend всегда будет оставаться 1 душа, даже если он умрет, имея всего 1.",
        "Души не теряются при наличии воскрешения.",
        "Вопреки визуальным эффектам Shadow Fiend мгновенно получает душу и урон от убитых существ.",
        "Чем больше душ у Shadow Fiend, тем больше красных частиц летает около его груди.",
        "Максимальное число душ дает до 11\/28\/51\/80 (TagTalent 44\/70\/102\/140) урона.",
        "С Aghanim's Scepter максимальное число душ дает до 25\/50\/75\/100 (TagTalent 100\/125\/150\/175) урона. Дополнительные души от Aghanim's Scepter влияют на число волн, создаваемых Requiem of Souls. При потере Aghanim's Scepter герой сохраняет накопленные души, даже если их количество больше, чем текущее допустимое. То есть Requiem of Souls выпустит большее число волн даже без Aghanim's Scepter. При этом дополнительный урон мгновенно адаптируется и без наличия Aghanim's Scepter не учитывает дополнительные души.",
        "Дополнительные души от Aghanim's Scepter влияют на число волн, создаваемых Requiem of Souls.",
        "При потере Aghanim's Scepter герой сохраняет накопленные души, даже если их количество больше, чем текущее допустимое.",
        "То есть Requiem of Souls выпустит большее число волн даже без Aghanim's Scepter.",
        "При этом дополнительный урон мгновенно адаптируется и без наличия Aghanim's Scepter не учитывает дополнительные души.",
        "При улучшении с Aghanim's Shard способность становится активным модификатором атаки. Пассивная часть продолжает давать всё те же бонусы. Дальность применения зависит от дальности атаки заклинателя. Дальность применения может быть увеличена при помощи бонусов к дальности атаки, но не бонусами к дальности применения. И Автоприменение, и ручное использование используют текущую дальность атаки Shadow Fiend. Тратит душу и уходит на перезарядку при запуске снаряда. Это значит, что при промахе душа будет потрачена, а способность уйдёт на перезарядку. Necromastery даёт критический удар. Если одновременно с ней сработают другие способности, дающие критический удар меньшего значения, то они не подействуют. Если критический удар будет большего размера, чем удар от Necromastery, то способность не применится, не уйдёт на перезарядку и не потратит душу. Снаряд этой способности ярче и крупнее обычной атаки Shadow Fiend. Выпущенный снаряд оставляет визуальный след на земле.",
        "Дальность применения зависит от дальности атаки заклинателя.",
        "Дальность применения может быть увеличена при помощи бонусов к дальности атаки, но не бонусами к дальности применения.",
        "И Автоприменение, и ручное использование используют текущую дальность атаки Shadow Fiend.",
        "Тратит душу и уходит на перезарядку при запуске снаряда. Это значит, что при промахе душа будет потрачена, а способность уйдёт на перезарядку.",
        "Necromastery даёт критический удар. Если одновременно с ней сработают другие способности, дающие критический удар меньшего значения, то они не подействуют. Если критический удар будет большего размера, чем удар от Necromastery, то способность не применится, не уйдёт на перезарядку и не потратит душу.",
        "Снаряд этой способности ярче и крупнее обычной атаки Shadow Fiend. Выпущенный снаряд оставляет визуальный след на земле."
      ],
      "mana": "0",
      "hotKey": "D",
      "cooldown": "3",
      "description": "Герой крадёт душу каждого убитого врага, получая бонус к атаке. После смерти выпускает 40% из них.",
      "spellName": "Necromastery",
      "params": [
        "Максимум душ: 11\/14\/17\/20 (TagAghanim 25)",
        "Душ за убийство: 1 (TagTalent 2)",
        "Доп. урон за душу: 1\/2\/3\/4 (TagTalent 4\/5\/6\/7)",
        "Потеря при смерти: 40%",
        "Дальность применения: 500",
        "Трата душ при использовании: 1",
        "Критический урон: 190%",
        "Увеличивает максимальное число душ.",
        "Герой получает 2 души за каждое убийство. Позволяет потратить 1 душу, чтобы следующая атака нанесла 190% критического урона. Перезарядка: 3 секунды.",
        "Предотвращает получение новых накоплений. Уже полученные продолжают давать бонус к урону. Активная часть способности работает нормально.",
        "Изначально иллюзии имеют 0 душ. Они способны собирать души, но бонус к урону от них не добавляется."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Снижение брони и сопротивления магии предоставлены аурой. Дебафф задерживается на 0,5 сек.",
        "Не действует на врагов, не имеющих обзора на Shadow Fiend. С выбранным талантом 15-го уровня способность действует на постройки.",
        "С выбранным талантом 15-го уровня способность действует на постройки."
      ],
      "mana": null,
      "hotKey": "F",
      "cooldown": null,
      "description": "Присутствие героя снижает броню ближайших врагов.",
      "spellName": "Presence of the Dark Lord",
      "params": [
        "Радиус: 1200",
        "Снижение брони: 4\/5\/6\/7 (TagTalent 8\/9\/10\/11)",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "P",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Shadow_Fiend_Requiem_of_Souls_1.mp3\/revision\/latest?cb=20191216022919",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов (TagAghanim Себя)",
        "Урон Магический"
      ],
      "notes": [
        "При произнесении этой способности к Shadow Fiend применяется сквозное передвижение, позволяющее другим существам проходить сквозь него.",
        "Урон зависит от числа душ, полученных от Necromastery.",
        "Волны действуют согласно следующим механикам: Область каждой волны имеет форму конуса. Расстояние между волнами всегда одинаковое. Одна волна всегда выпускается на востоке, а остальные подстраиваются под неё. Создаёт волны каждые 32,7°\/25,7°\/21,2°\/18° (TagTalent 14,4°) при максимальном количестве душ на каждом уровне Necromastery. Волны движутся со скоростью в 700 единиц, преодолевая максимальное расстояние за 1,43 сек. Волны поражают существ на расстоянии до 1350 единиц (складывается из дальности прохождения и конечной ширины). Любая волна не может поразить одно и то же существо больше одного раза за применение при выпускании и, соответственно, возвращении).",
        "Область каждой волны имеет форму конуса.",
        "Расстояние между волнами всегда одинаковое. Одна волна всегда выпускается на востоке, а остальные подстраиваются под неё.",
        "Создаёт волны каждые 32,7°\/25,7°\/21,2°\/18° (TagTalent 14,4°) при максимальном количестве душ на каждом уровне Necromastery.",
        "Волны движутся со скоростью в 700 единиц, преодолевая максимальное расстояние за 1,43 сек.",
        "Волны поражают существ на расстоянии до 1350 единиц (складывается из дальности прохождения и конечной ширины).",
        "Любая волна не может поразить одно и то же существо больше одного раза за применение при выпускании и, соответственно, возвращении).",
        "Применяет страх и снижает скорость передвижения всех вражеских существ, задетых волнами от Requiem of Souls. Длительность увеличивается на 0,8 (TagTalent 1,2) за каждую попавшую волну, но максимальная длительность ограничена 2,4 (TagTalent 3,6) сек. В отличии от других источников страха пораженный враг бежит от заклинателя, а не направляется к фонтану своей команды.",
        "Длительность увеличивается на 0,8 (TagTalent 1,2) за каждую попавшую волну, но максимальная длительность ограничена 2,4 (TagTalent 3,6) сек.",
        "В отличии от других источников страха пораженный враг бежит от заклинателя, а не направляется к фонтану своей команды.",
        "Выпущенные волны наносят до 1600\/2400\/3200 урона одному существу (до уменьшений), если его задели все волны.",
        "Волны сначала наносят урон, а затем применяют дебафф.",
        "При смерти героя Requiem of Souls автоматически и мгновенно применяется вне зависимости от количества маны и статуса перезарядки. До этого Shadow Fiend сначала теряет 40% от запаса душ. Поэтому пассивная Requiem of Souls может выпустить лишь до 4\/5\/6\/8\/10 волн от максимального значения. Пассивная Requiem of Souls не применяет страх, но замедляет скорость передвижения. Пассивная Requiem of Souls не выпускается при наличии воскрешения. Улучшение от Aghanim's Scepter не действует на пассивное срабатывание способности.",
        "До этого Shadow Fiend сначала теряет 40% от запаса душ. Поэтому пассивная Requiem of Souls может выпустить лишь до 4\/5\/6\/8\/10 волн от максимального значения.",
        "Пассивная Requiem of Souls не применяет страх, но замедляет скорость передвижения.",
        "Пассивная Requiem of Souls не выпускается при наличии воскрешения.",
        "Улучшение от Aghanim's Scepter не действует на пассивное срабатывание способности.",
        "С Aghanim's Scepter каждая выпущенная волна при достижении максимального расстояния начинает возвращаться к Shadow Fiend. Вопреки визуальным эффектам волны не \"появляются\" вокруг Shadow Fiend. Они движутся обратно точно с того места, где остановились. Волны возвращаются к текущему расположению Shadow Fiend, а не к месту произнесения заклинания. Волны не будут подстраиваться к новому расположению, если Shadow Fiend передвинется. Начав свое возвращение, их путь уже не меняется. Максимальная дальность прохождения применяется и к возвращению волн; то есть всего они проходят путь в 2000 единиц. При возвращении волн значения максимальной и минимальной ширины меняются между собой: волны начинают с максимальной ширины и заканчивают минимальной. Возвращающиеся волны наносят 40% урона. Они, как и расширяющиеся волны, поражают всех существа, применяют страх и замедление скорости передвижения.",
        "Вопреки визуальным эффектам волны не \"появляются\" вокруг Shadow Fiend. Они движутся обратно точно с того места, где остановились.",
        "Волны возвращаются к текущему расположению Shadow Fiend, а не к месту произнесения заклинания.",
        "Волны не будут подстраиваться к новому расположению, если Shadow Fiend передвинется. Начав свое возвращение, их путь уже не меняется.",
        "Максимальная дальность прохождения применяется и к возвращению волн; то есть всего они проходят путь в 2000 единиц.",
        "При возвращении волн значения максимальной и минимальной ширины меняются между собой: волны начинают с максимальной ширины и заканчивают минимальной.",
        "Возвращающиеся волны наносят 40% урона. Они, как и расширяющиеся волны, поражают всех существа, применяют страх и замедление скорости передвижения.",
        "Возвращающиеся волны наносят до 800\/1200\/1600 урона одному существу (до уменьшений), в случае, если его задели все волны. Вместе с выпускаемыми волнами Requiem of Souls наносит до 2800\/4200\/5600 единиц урона одному существу (до уменьшений).",
        "Вместе с выпускаемыми волнами Requiem of Souls наносит до 2800\/4200\/5600 единиц урона одному существу (до уменьшений).",
        "Лечение зависит от урона, нанесенного возвращающимся волнами, а не базовыми выпускаемыми. Лечение применяется после завершения движения волн. Всегда лечит на 32\/48\/64 за пораженного героя (включая иллюзии) независимо от фактически нанесенного волнами урона.",
        "Лечение применяется после завершения движения волн.",
        "Всегда лечит на 32\/48\/64 за пораженного героя (включая иллюзии) независимо от фактически нанесенного волнами урона."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "120\/110\/100 (TagTalent 60\/55\/50)",
      "description": "Герой выпускает собранные души в волнах демонической энергии. Существа возле него могут получить урон от нескольких волн. Замедляет передвижение врагов и накладывает на них страх на сек. за каждую задетую волну. Создаёт одну волну энергии за каждую 1-ну душу, захваченные с помощью Necromastery. Если герой погибнет, то эта способность сработает автоматически вне зависимости от её готовности.",
      "spellName": "Requiem of Souls",
      "params": [
        "Анимация применения: 1,67+0,77",
        "Дальность прохождения волн: 1000",
        "Начальная ширина волны: 125",
        "Конечная ширина волны: 350",
        "Число душ для волны (TagTalentNecromastery): 1",
        "Урон за выпущенную волну: 80\/120\/160",
        "Замедление скорости передвижения: 20%\/25%\/30%",
        "Длительность дебаффа за волну: 0,8 (TagTalent 1,2)",
        "Макс. длительность дебаффа: 2,4 (TagTalent 3,6)",
        "Урон за вернувшуюся волну: 32\/48\/64",
        "Лечение за героя: 32\/48\/64",
        "Увеличивает максимальное число душ от Necromastery и заставляет ослабленные волны способности Requiem of Souls возвращаться к герою, излечивая его на количество нанесённого урона.",
        "Пассивное срабатывание при смерти не блокируется истощением."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.7,
    "attrStrength": 19.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 3.5,
    "attrAgility": 20.0
  },
  "description": "Shadow Fiend — это герой с дальним типом атаки, основным атрибутом которого является Ловкость. Первые три способности, Shadowraze, разрывают участок земли перед Shadow Fiend, нанося урон всем врагам в зоне действия. Разница между этими способностями заключается в дальности применения. Первая пассивная способность, Necromastery, крадет душу каждого убитого врага, давая бонус к урону атак. После смерти треть из них теряется. Вторая пассивная способность, Presence of the Dark Lord, снижает броню ближайших врагов. Ультимативная способность, Requiem of Souls, выпускает собранные души, которые наносят урон всем существам вокруг, также они снижают наносимый ими урон и накладывают эффект страха. Если Shadow Fiend погибает, то способность автоматически срабатывает вне зависимости от ее готовности, но не применяет страх и действует вполсилы.",
  "history": "Говорят, у Невермора душа поэта, но на самом деле у него их тысячи. Веками он поглощал души стихотворцев, священников, императоров, нищих, рабов, философов, преступников и, естественно, героев. Не скрыться от него ни душе. Никто не знает, что он с ними делает. Никто не вглядывался в Бездну, где среди астральных скал Невермор таится, словно змея. Пожирает ли он души одну за другой? Выставляет ли он их трофеями в коридорах зловещего храма? Маринует ли в чернокнижном рассоле? А может, он — лишь марионетка, которой кукловодит зловещий разум извне пространства? Таково его зло, настолько силен его тёмный дух, что разумом его не понять. А если вам всё же очень хочется разузнать, что он делает с душами, то всё просто: присоединяйтесь к его коллекции. Или просто подождите: Невермор уже идёт к вам.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−50 сек. перезарядки Requiem of Souls",
      "talentRight": "−4 к снижению брони от Presence of the Dark Lord"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0,4 страха\/замедления за волну Requiem of Souls",
      "talentRight": "+3 урона за душу"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 урона от Shadowraze",
      "talentRight": "Аура Presence of the Dark Lord действует на строения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+25 к скорости атаки",
      "talentRight": "+8% к урону от заклинаний"
    }
  ]
}