{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The night vision talent does not counter any vision reducing effect.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Splinter Blast 1.5s Stun",
          "talentRight": "+1.5s Winter's Curse Duration"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 Splinter Blast Damage",
          "talentRight": "+12% Arctic Burn Slow"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+400 Night Vision",
          "talentRight": "+275 Health"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+50 Damage",
          "talentRight": "+1.5% Cold Embrace Heal"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/92\/Winter_Wyvern_Arctic_Burn_1.mp3\/revision\/latest?cb=20191216030732",
      "effects": [
        "Ability No Target (TagAghanim Toggle)",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Arctic Burn interrupts Winter Wyvern's channeling abilities upon cast.",
        "Temporarily turns Winter Wyvern into a flying unit, allowing her to fly over impassable terrain, trees, units and buildings. However, it does not grant Winter Wyvern flying vision.",
        "However, it does not grant Winter Wyvern flying vision.",
        "Increases Winter Wyvern's attack range to 775\/850\/925\/1000, projectile speed to 1200, night vision range to 1200 and reduces attack point to 0.1.",
        "Each enemy can only receive the debuff once per cast. Successive attacks on the same target neither stack, re-apply, nor refresh the duration.",
        "The attacks first apply the debuff, then their own damage.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 8 instances.",
        "Can deal up to 27%\/30%\/34%\/38% of the target's current health as damage (before reductions), assuming nothing else affects the target's health.",
        "Since the damage per second is based on a percentage of the target's current health, it can never kill an enemy by itself.",
        "During Arctic Burn, Winter Wyvern can neither trigger nor take damage from Proximity Mines.",
        "Destroys trees within a 175 radius at the end of the duration.",
        "Does not affect wards, buildings, Roshan.",
        "With Aghanim's Scepter, Arctic Burn turns into a toggle ability. As such, it no longer interrupts Winter Wyvern's channeling abilities upon toggling On \/ Off. Aghanim's Scepter also removes the 1 attack per target limit, allowing her to refresh the debuff with consecutive attacks on the same target. Drains mana in 1-second intervals, starting 1 second after toggling. Still uses the initial mana cost upon toggling on.",
        "As such, it no longer interrupts Winter Wyvern's channeling abilities upon toggling On \/ Off.",
        "Aghanim's Scepter also removes the 1 attack per target limit, allowing her to refresh the debuff with consecutive attacks on the same target.",
        "Drains mana in 1-second intervals, starting 1 second after toggling. Still uses the initial mana cost upon toggling on."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "42\/36\/28\/20 (TagTalent 0)",
      "description": "Winter Wyvern soars upon an arctic wind, granting her unobstructed movement and allowing her to exhale a blistering chill into each attack. While soaring, her attacks travel further and faster, and slow enemies with a burning freeze that strips them of 6%\/7%\/8%\/9% of their current health each second. Her sight is also hardened against night's chill, granting her 400 additional vision range at night while soaring.",
      "spellName": "Arctic Burn",
      "params": [
        "Cast Animation: 0+0",
        "Attack Range Bonus: 350\/425\/500\/575",
        "Attack Projectile Speed Bonus: 500",
        "Night Vision Bonus: 400",
        "Current Health as Damage per Second: 6%\/7%\/8%\/9%",
        "Enemy Move Speed Slow: 22%\/28%\/34%\/40% (TagTalent 34%\/40%\/46%\/52%)",
        "Debuff Duration: 5",
        "Arctic Burn Duration: 8 (TagAghanim Indefinite)",
        "Self Move Speed Bonus: 25%",
        "Mana Cost per Second: 20",
        "Causes Arctic Burn to be a toggle ability, draining mana every second when active. Removes limit on number of attacks per target. Increases Winter Wyvern's movement speed.",
        "Slow persists and attempts to damage if debuff was placed before spell immunity and when not dispelled.",
        "Stops proccing on-cast effects when upgraded."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "The same organ where some dragons stoke their inner flame is, in Auroth, a crucible of unimaginable cold. From deep within her frosty gullet, an exhalation sends enemies into burning agony."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/77\/Winter_Wyvern_Splinter_Blast_1.mp3\/revision\/latest?cb=20191216030729",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The initial projectile travels at a speed between 650 and 4000. It adapts so that it reaches the target in 1 second. This means when the target gets more than 4000 range away on cast, it takes more than 1 second to reach it. Vice versa, if the target gets closer than 650 range on cast, it takes less than 1 second to reach it.",
        "This means when the target gets more than 4000 range away on cast, it takes more than 1 second to reach it.",
        "Vice versa, if the target gets closer than 650 range on cast, it takes less than 1 second to reach it.",
        "The secondary projectiles travel at a static speed of 600.",
        "Fully affects invisible units and units in the Fog of War.",
        "The Splinter Blast stun talent only affects the secondary targets, like the damage and slow. The stun does not replace the slow. The slow is still applied, effectively slowing hit units for 2.5 seconds.",
        "The stun does not replace the slow. The slow is still applied, effectively slowing hit units for 2.5 seconds.",
        "The splinters first apply the damage, then the debuff."
      ],
      "mana": "105\/120\/135\/150",
      "hotKey": "W",
      "cooldown": "7",
      "description": "Launches a ball of brittle ice towards an enemy. The ice shatters on impact, leaving the primary target completely unaffected, while hurling damaging splinters into nearby enemies in a 500 radius. Enemies struck by these splinters are slowed by 30%.",
      "spellName": "Splinter Blast",
      "params": [
        "Cast Animation: 0.3+1.17",
        "Cast Range: 1200",
        "Splinter Search Radius: 500",
        "Damage: 100\/180\/260\/340 (TagTalent 200\/280\/360\/440)",
        "Move Speed Slow: 30%",
        "Slow Duration: 4",
        "Stun Duration: 1.5",
        "Cannot be cast on spell immune enemies. Secondary projectiles are launched towards spell immune enemies. Does not slow or attempt to damage spell immune enemies. Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "Blocked fully only when primary target. Blocked upon impact.",
        "Initial projectile cannot be disjointed. Secondary projectiles can be disjointed with any disjoint, except invisibility."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Produced slowly by specialized vesicles in her frozen gullet, Winter Wyvern blast shards of ice at her enemies."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/49\/Winter_Wyvern_Cold_Embrace.mp3\/revision\/latest?cb=20191216030726",
      "effects": [
        "Ability Target Unit",
        "Affects Allies"
      ],
      "notes": [
        "Cannot be cast on allies who have ☐ Disabled Help from Winter Wyvern. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Stuns the target and turns it immune to physical damage. The target can still be attacked and affected by magical and pure damage.",
        "Heals 7.5\/8.75\/10\/11.25 + 0.5%\/0.75%\/1%\/1.25% (TagTalent 0.88%\/1.13%\/1.38%\/1.63%) health in 0.25-second intervals, starting 0.25 seconds after the buff is placed, resulting in 16 instances. Can heal up to 120\/140\/160\/180 + 8%\/12%\/16%\/20% (TagTalent 14%\/18%\/22%\/26%) of a unit's max health over its full duration.",
        "Can heal up to 120\/140\/160\/180 + 8%\/12%\/16%\/20% (TagTalent 14%\/18%\/22%\/26%) of a unit's max health over its full duration.",
        "With Aghanim's Shard, losing the buff in any way causes Splinter Blast secondary projectiles to be released based. The splinters released this way does not require vision, and can target invisible units and units inside the Fog of War. However, unlike the projectiles of a regular cast, these projectiles are disjointed by invisibility. The projectiles are based on Splinter Blast's current level, if it is not learned, no projectiles are released.",
        "The splinters released this way does not require vision, and can target invisible units and units inside the Fog of War.",
        "However, unlike the projectiles of a regular cast, these projectiles are disjointed by invisibility.",
        "The projectiles are based on Splinter Blast's current level, if it is not learned, no projectiles are released."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "E",
      "cooldown": "24\/21\/18\/15 (TagTalent 19\/16\/13\/10)",
      "description": "Encases an ally in an icy cocoon, freezing them solid while healing a base amount as well as a percentage of their maximum health each second. The cocoon blocks all physical damage.",
      "spellName": "Cold Embrace",
      "params": [
        "Cast Animation: 0.3+0.63",
        "Cast Range: 1000",
        "Base Heal Per Second: 30\/35\/40\/45",
        "Max Health as Heal Per Second: 2%\/3%\/4%\/5% (TagTalent 3.5%\/4.5%\/5.5%\/6.5%)",
        "Duration: 4",
        "Splinter Blast Radius: 1200",
        "When Cold Embrace ends, a Splinter Blast goes off that location, hitting enemies within 1200 range. Reduces cooldown by 5 seconds."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "From winter's heart comes a cold, healing embrace. The ice slows the blood and allows the spell to better work its curative magic."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1c\/Winter_Wyvern_Winter%27s_Curse.mp3\/revision\/latest?cb=20191216030732",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "The target gets stunned, while any of its allies within the radius get taunted, forcing them to attack the primary target. Enemies that enter the radius after cast also get taunted for its remaining duration. If no eligible enemies are within the area for a total of 2.5 seconds, the debuff gets removed. Does not affect or check for spell immune, invulnerable, or hidden enemies, wards or buildings within the area. Only affects units allied to the target. This means when cast on an enemy, neutral creeps are not taunted, and vice versa. Despite not getting taunted when targeting an enemy, neutral creeps still prevent the curse debuff from being removed prematurely.",
        "Enemies that enter the radius after cast also get taunted for its remaining duration.",
        "If no eligible enemies are within the area for a total of 2.5 seconds, the debuff gets removed.",
        "Does not affect or check for spell immune, invulnerable, or hidden enemies, wards or buildings within the area.",
        "Only affects units allied to the target. This means when cast on an enemy, neutral creeps are not taunted, and vice versa.",
        "Despite not getting taunted when targeting an enemy, neutral creeps still prevent the curse debuff from being removed prematurely.",
        "The taunt is based on an aura, with an infinite linger duration. The debuff gets cleared when the debuff on the primary target expires, or when the target dies. This means the taunt sticks on the affected units, and getting moved outside the area does not free the unit from the taunt. This also means the taunt sticks even if the debuff got removed on the primary target due to no enemies being within the area.",
        "This means the taunt sticks on the affected units, and getting moved outside the area does not free the unit from the taunt.",
        "This also means the taunt sticks even if the debuff got removed on the primary target due to no enemies being within the area.",
        "The taunt area is centered on the primary target and follows them if they get forcibly moved.",
        "Applies generic incoming damage reduction on the targets. Stacks additively with other sources of generic incoming damage manipulation. This means that sources of generic incoming damage amplification can be used to counter the effect. The reduction affects all damage that is not flagged as HP removal the targets take from any source except for Winter Wyvern.",
        "This means that sources of generic incoming damage amplification can be used to counter the effect.",
        "The reduction affects all damage that is not flagged as HP removal the targets take from any source except for Winter Wyvern.",
        "If the target gets killed during the curse, Winter Wyvern gets credit for the kill. Has a lower priority than Reaper's Scythe, so if affected by both, Reaper's Scythe takes priority. Has a higher priority than Ice Blast, so if affected by both, Winter's Curse takes priority.",
        "Has a lower priority than Reaper's Scythe, so if affected by both, Reaper's Scythe takes priority.",
        "Has a higher priority than Ice Blast, so if affected by both, Winter's Curse takes priority.",
        "Does not disable any abilities. However, most passive abilities do not affect allied units.",
        "When the primary target dies, the taunt effect ends immediately."
      ],
      "mana": "250",
      "hotKey": "R",
      "cooldown": "90\/85\/80",
      "description": "Winter Wyvern freezes an enemy in place while striking those nearby with a maddening curse which causes them to attack their frozen ally with increased attack speed. The frozen ally and those cursed to attack their ally are immune to all damage from their enemies with the exception of Winter Wyvern or her controlled units.",
      "spellName": "Winter's Curse",
      "params": [
        "Cast Animation: 0.3+1.37",
        "Cast Range: 800",
        "Radius: 525",
        "Curse Damage Reduction: 100%",
        "Curse Attack Speed Bonus: 65",
        "Duration: 4.5\/5\/5.5 (TagTalent 6\/6.5\/7)",
        "Nearby Allies Check Timer: 2.5",
        "Can target spell immune enemies. Cannot taunt spell immune enemies. Taunt persists if debuff was placed before spell immunity.",
        "Blocked fully only when primary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "The oldest of the bookwurm's spells, this curse lends truth to the old saw: sometimes the enemy of my enemy is my enemy still."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 24.0,
    "attrIntelligence": 26.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.9,
    "attrAgility": 16.0
  },
  "description": "Auroth, the Winter Wyvern, is a ranged intelligence hero whose arsenal of spells gives her powerful nuking capabilities. Usually played as a lane support, Winter Wyvern's spells allow her to fulfill a myriad of roles depending on what her team needs. Arctic Burn grants her temporarily flying movement, increased attack range as well as night vision while causing her attacks to slow enemies and burn their health over time, allowing her to gank and harass with ease. Splinter Blast is a low-cooldown nuke that, while leaving its target unaffected, slows and deals tremendous damage to all other nearby enemies. Cold Embrace allows Winter Wyvern to encase a target ally within a protective layer of ice, disabling them for the duration of the spell but also rendering them immune to physical damage while healing them for a percentage of their maximum health. Her ultimate, Winter's Curse, turns the enemies' own weapons against them by stunning the target enemy while forcing all of their nearby allies to attack them. A fearsome ganker and powerful nuker, Winter Wyvern can chill her foes to the bone and wreak havoc on their ranks.",
  "history": "Like many great poets, Auroth just wants time to write, but the Winter Wyvern's life is full of interruptions. The epics of the Eldwurms have a long and colorful history, but some fear that the remaining dragon scholars are not as prolific as they once were, with few lines added to the Eldwurm Eddas since the last age of greatness. Auroth laments: \"We forget that there is more to life than triumph and dominion over enemies. We must also live our lives in the pursuit of creative expression.\" She embarks on research expeditions, collecting books for inspiration. But all this research can be terribly distracting, and she spends less time writing than she should. Although she knows she should be lurking in her lair, adding to the Eddas, she finds herself engaged in epic battles against powerful enemies. She loots castles, raids ancient libraries... and if she happens to heap glory on herself in the process, she tells herself that it's merely a side effect of her research. The fact is, while her skill and power on the battlefield are legendary, her scholarly travails have thus far hardly been the stuff of literary acclaim. But she is not content to stand as a protagonist of heroic lore. She wishes also to create it.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Splinter Blast 1.5s Stun",
      "talentRight": "+1.5s Winter's Curse Duration"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 Splinter Blast Damage",
      "talentRight": "+12% Arctic Burn Slow"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+400 Night Vision",
      "talentRight": "+275 Health"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+50 Damage",
      "talentRight": "+1.5% Cold Embrace Heal"
    }
  ]
}