{
  "abilities": [
    {
      "notes": [
        "The initial projectile travels at a speed of 1200, subsequent projectiles travel 1000\n However, all projectiles bounce in 0.3-second intervals",
        "Cannot bounce on invisible, invulnerable, hidden or attack immune units, but can bounce on units in the Fog of War\n Cannot bounce on enemy  Couriers",
        "The initial target is not counted towards the bounces, resulting in a total of 3\/5\/7\/9 ( 5\/7\/9\/11) instances\n All bounces together can deal up to 150\/350\/700\/1260 ( 300\/595\/1080\/1815) to heroes (before reductions)\n All bounces together can deal up to 300\/700\/1400\/2520 ( 600\/1190\/2160\/3630) to non-hero units\n For how much damage each bounce Paralyzing Cask deals on each level, and with the cask bounce increasing  talent, please refer to the chart below",
        "The projectile can bounce on the same unit multiple times, but only when another target was hit between the bounces\n This means it may hit the same target a maximum of 2\/3\/4\/5 ( 3\/4\/5\/6) times\n Can deal up to 100\/210\/400\/700 ( 180\/340\/600\/990) damage to a single hero\n Can deal up to 200\/420\/800\/1400 ( 360\/680\/1200\/1980) damage to a single non-hero unit",
        "The stun treats clones, creep-heroes and  Roshan as heroes, but treats illusions as creeps\n However, the damage treats illusions, clones, and creep-heroes as heroes",
        "The cask first applies the debuff, then the damage",
        "If Paralyzing Cask is cast multiple times, the previous cast's bounce counter gets reset\n All instances coming from the same hero use the same bounce counter, instead of each instance having an independent counter"
      ],
      "item_behaviour": [],
      "description": "Launches a cask of paralyzing powder that ricochets between enemy units, stunning and damaging those it hits. Each bounce deals more damage than the previous one. Deals 1 damage to creeps.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.35+0.37",
        "Cast Range:  600",
        "Bounce Distance: 575",
        "Number of Bounces: 2\/4\/6\/8 ( 4\/6\/8\/10)",
        "Base Damage: 40",
        "Damage Increase per Bounce: 10\/15\/20\/25",
        "Creep Damage Percentage: 200%",
        "Stun Duration: 1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d6\/Witch_Doctor_Paralyzing_Cask_1.mp3\/revision\/latest?cb=20191216030754",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "20\/18\/16\/14",
      "aghanim": null,
      "name": "Paralyzing Cask",
      "cooldown": "80\/100\/120\/140",
      "legacy_key": "C",
      "story": "The Witch Doctor recycles the bones of fallen friends and foes, using the powder as part of his arsenal of charms and alchemy."
    },
    {
      "notes": [
        "Voodoo Restoration does not interrupt Witch Doctor's channeling abilities upon toggling On \/ Off",
        "Disabling Witch Doctor does not toggle Off Voodoo Restoration\n However, he cannot turn it off himself while disabled either\n While Witch Doctor is invulnerable or hidden, all effects of Voodoo Restoration still applies\n In this case, the mana per second cost will not be consumed",
        "Heals and damage for 3.3\/6.6\/9.9\/13.2 health (+  0.495% of max health) in 0.33-second intervals (before reductions), starting 0.33 seconds when toggled On\n Costs 2.64\/3.96\/5.28\/6.6 ( 1.98\/2.97\/3.96\/4.95) mana in the same intervals",
        "Both the heal and damage are provided by the same aura and lingers for 0.5 seconds\n Always heals for the full amount per instance, regardless of how much damage the ability actually deals\n The mana cost is also bound to the aura, this means when toggled Off, the ability still heals and drains mana for 0.5 seconds before stopping\n The ability toggles Off if Witch Doctor does not have enough mana to support another heal instance\n However, the lingering buff continues healing, despite the lack of mana, providing up to 2 possible heal instances for free\n It does not affect invulnerable or hidden units\n Fully affect ally  Couriers"
      ],
      "item_behaviour": [],
      "description": "Witch Doctor focuses his magic to heal nearby allied units, costing Witch Doctor mana every second Voodoo Restoration is active.",
      "hot_key": "W",
      "params": [
        "Cast Animation:  0+0",
        "Radius: 500\/550\/600\/650",
        "Base Heal\/Damage per Second: 10\/20\/30\/40",
        "Aura Linger Duration: 0.5",
        "Max Health as Heal\/Damage per Second:  1.5%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Witch_Doctor_Voodoo_Restoration_1.mp3\/revision\/latest?cb=20191216030758",
      "effects": [
        "Ability: Toggle",
        "Affects: Units",
        "Damage: Magical"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Voodoo Restoration",
      "cooldown": "35\/40\/45\/50 + 8\/12\/16\/20\/ second + 6\/9\/12\/15\/ second",
      "legacy_key": "V",
      "story": "Zharvakko's hocus pocus is not limited only hexxing his opponents and is quite adept at curing ailments."
    },
    {
      "notes": [
        "Checks the affected units' current health 4 times, once as the curse is applied, and then every 4 seconds for the duration",
        "The burst damage is entirely based on the difference between the hero's current health and its health as the curse got applied\n This means the bigger the difference between current health and health upon receiving the debuff gets, the more damage the bursts do\n Vice versa, the lower the difference gets, the lower the damage of the bursts, so getting healed during it reduces its damage\n It also means it does not matter how affected units lose health, as it directly compares its health values, not damage values\n This is how much of the lost health is re-dealt as damage by Maledict, depending on when the health was lost during the curse on each level (before reductions): 0 – 3.9 Seconds: 48%\/72%\/97%\/121% ( 109%\/133%\/157%\/181%) 3.9 – 7.9 Seconds: 32%\/48%\/64%\/80% ( 72%\/88%\/105%\/121%) 7.9 – 11.9 Seconds: 16%\/24%\/32%\/40% ( 36%\/44%\/52%\/60%)",
        "Deals its own damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 12 damage instances\n Together with the bursts, it deals a total of 15 damage instances\n The bursts happen 0.1 seconds before each 4th damage tick, so the bursts happen after the 3rd, 7th, and 11th damage tick",
        "With no other sources of health loss or heals, Maledict can deal up to 188.5\/320.9\/483.6\/680.2 ( 256.6\/432.2\/644.6\/897.8) damage to a unit (before reductions)",
        "The debuff can be placed on illusions and creep-heroes",
        "Successive casts neither update the damage values nor damage intervals, but refresh its duration",
        "Affects invisible units and units in the Fog of War\n Neither affects invulnerable nor hidden units"
      ],
      "item_behaviour": [],
      "description": "Curses all enemy Heroes in a small area, causing them to take a set amount of damage each second, as well as bursts of damage every 4 seconds based on how much health they have lost since the curse began.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.35+0",
        "Cast Range:  575",
        "Radius: 180 ( 255)",
        "Damage per Second: 12\/18\/24\/30",
        "Lost Health as Burst Damage: 16%\/24%\/32%\/40% ( 36%\/44%\/52%\/60%)",
        "Burst Damage Interval: 4",
        "Curse Duration: 12"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Witch_Doctor_Maledict_1.mp3\/revision\/latest?cb=20191216030750",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "mana": "30\/26\/22\/18",
      "aghanim": null,
      "name": "Maledict",
      "cooldown": "105\/110\/115\/120",
      "legacy_key": "E",
      "story": "Certain voodoo magics can make an enemy regret engaging the Witch Doctor."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Disjoints projectiles upon cast",
        "Witch Doctor is invulnerable, hidden, and prevented from acting for the duration",
        "Death Ward based on its current level is summoned at Witch Doctor's location\n Death Ward notes fully apply\n If it is not learned, Voodoo Switcheroo does nothing upon cast\n The <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter upgrade fully affects Voodoo Switcheroo as well",
        "Voodoo Switcheroo cannot be canceled prematurely and always lasts for the full duration unless Witch Doctor dies during it",
        "The Death Ward has its attack speed reduced by 30, attacking slower than a regular Death Ward cast",
        "With its 0.22-second attack rate and the 30 attack speed slow, it can attack up to 10 times\n Can deal up to 286.36\/477.27\/668.18 ( 477.27\/668.18\/859.09) damage per second to a single hero\n Can deal up to 900\/1500\/2100 ( 1500\/2100\/2700) damage to a single hero (before reductions)"
      ],
      "item_behaviour": [],
      "description": "Turns Witch Doctor into a Death Ward briefly with reduced attack speed. He is hidden during this time.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.1+0.73",
        "Death Ward Attack Speed Reduction: 30",
        "Duration: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Witch_Doctor_Voodoo_Switcheroo.mp3\/revision\/latest?cb=20210103153444",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ "
      ],
      "mana": "40",
      "aghanim": null,
      "name": "Voodoo Switcheroo",
      "cooldown": "150",
      "legacy_key": "W",
      "story": null
    },
    {
      "notes": [
        "The  Death Ward automatically attacks enemies within its attack range, using ◉ Standard auto-attack rules\n It is possible to manually give the ward an attack target with A or  Right Click an enemy in range\n With Unified Orders with Ctrl, Ctrl+ Right Click an enemy in range commands the ward to attack the target\n It is also possible to stop the ward from attacking with S (only works when the auto-attack option is ◎ Never)",
        "Can only attack heroes, clones and illusions\n Treats creep-heroes as creeps",
        "The damage source is the ward itself, meaning certain on-damage effects react on the ward rather than on Witch Doctor (e.g\n <span image=\"items\/blade_mail\/full.webp\">[Blade Mail]<\/span> Blade Mail)",
        "With its 0.22-second attack rate, it can attack up to 37 times\n Can deal up to 409.09\/681.82\/954.55 ( 681.82\/954.55\/1227.27) damage per second to a single hero\n Can deal up to 3330\/5550\/7770 ( 5550\/7770\/9990) damage to a single hero (before reductions)",
        "Death Ward's attack damage is not reduced by damage block\n Its attacks has first definition accuracy, which prevents its attacks from being missed by 50% ( 100%) (i.e\n evasion or blind effects)\n Stacks additively with other sources of accuracy",
        "After the channeling stops or is interrupted, the ward is now phased and will expire in 5 seconds\n Therefore, it provides ground vision for 5 seconds at its location",
        "SCEPTER NOTES Attacks from Death Ward now have True Strike and bounce towards the closest enemy heroes within 100% range\n One projectile can never hit the same unit twice\n Does not bounce on invisible units or units in the Fog of War\n Does not perform instant attacks\n The bouncing projectiles are entirely spell-based, which means they do not trigger any attack modifier or on-hit effects, ignore evasion, and count as spell damage\n The bouncing attacks deal damage based on the damage amount calculated for the leading attack upon attack begin\n The bouncing attacks have the following flags: No-spell-lifesteal flag, preventing their damage from utilizing spell lifesteal\n No-spell-amplification flag, preventing their damage from being amplified with spell damage amplification\n The bouncing attacks' damage is neither reduced by damage block and  Resonant Pulse nor amplified by  Stone Gaze, but it can be reduced by  Bulwark\n Acquiring <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter immediately upgrades the current Death Ward instance"
      ],
      "item_behaviour": [],
      "description": "Summons a deadly ward to attack enemy heroes within its attack range. Lasts a maximum of 8 seconds.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.35+0",
        "Cast Range:  600",
        "Max Channel Time: 8",
        "Death Ward Accuracy: 50% ( 100%)",
        "Bounce Distance:  650",
        "Number of Bounces:  Infinite"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Witch_Doctor_Death_Ward.mp3\/revision\/latest?cb=20191216030749",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemy Heroes"
      ],
      "mana": "60",
      "aghanim": null,
      "name": "Death Ward",
      "cooldown": "200",
      "legacy_key": "D",
      "story": "Witch Doctor performs a ritualistic dance, one that haunts the dreams of those who live to recount it."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.4,
    "attrAgility": 13.0
  },
  "description": "Channels a high damage death ward. A bizarre figure shambles across the land, searching for any opportunity to apply the morbid arts of Prefectura Island. Filling a skull with noxious powder, the Witch Doctor throws this Paralyzing Cask to stun enemies in succession. To his allies, Zharvakko is a fountain of health, curing ailments with Voodoo Restoration. To his foes, he is the source of curses and Switcheroos. Notoriously known for Maledicting his adversaries and forcing them to relive the agony they will inevitably receive from his Death Ward, few can match Witch Doctor's versatility.  Support Nuker Disabler ★☆☆",
  "trivia": [
    "Witch Doctor is sometimes called \"The Walking Fountain\", referring to his support abilities Voodoo Restoration and Death Ward.",
    "Witch Doctor's last hit response Link▶️ \"Pills here!\" is a reference to Left 4 Dead, another title from Valve, where the players can notify the other survivors that they found pills. The survivors would say \"Pills here\" upon finding some.[1]",
    "Witch Doctor's original name in DotA was Vol'jin, a reference to the character from the Warcraft universe. Vol'Jin is the warchief of the playable race, the Trolls.[2]",
    "Witch Doctor's fun name in DotA was Moose, taken from the player DL.Moose who played the Witch Doctor.",
    "His dying line Link▶️ \"Bad medicine..\" is likely a reference to Bon Jovi's popular old classic Bad Medicine.",
    "The line Link▶️ \"Ask not for whom the spell tolls.\" is a reference to John Donne's poem \"Meditation XVII\".[3]",
    "Witch Doctor's name, Zharvakko, may be a reference to the popular novel and film Doctor Zhivago.[4]"
  ],
  "history": "A wiry silhouette hitches forward—uneven of feature and limb, bizarre of gait, relentlessly criss-crossing the battlefield in search of that vital weak point where his talents can do most good, and most harm. Whether broken or mismade it is not clear, but still, none can doubt the power carried in his twisted physique. A long staff thumps the earth as the Witch Doctor advances, deploying a terrifying arsenal of fetishes, hexes and spells. It is a body of magical knowledge learned over several lifetimes in the island highlands of Prefectura, now wielded with precise accuracy against his enemies. Witch Doctor is your best friend, or your worst enemy--healing allies and laying waste to all who oppose him.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+1.5% Max Health Voodoo Restoration Heal\/Damage",
        "talent_left": "+60 Death Ward Damage"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+100 Death Ward Attack Range",
        "talent_left": "+20% Maledict Burst Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+2 Cask Bounces",
        "talent_left": "+300 Health"
      },
      {
        "talent_lvl": "10",
        "talent_right": "-25% Voodoo Restoration Mana Per Second",
        "talent_left": "+75 Maledict AoE"
      }
    ],
    "notes": [
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}