{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+50 к восстановлению здоровья от Chemical Rage",
          "talentRight": "+50 к скорости передвижения от Chemical Rage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+400 к урону от Unstable Concoction",
          "talentRight": "+25% к прорубанию"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 к урону",
          "talentRight": "+350 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-6 сек. перезарядки Unstable Concoction",
          "talentRight": "+15 к скорости атаки"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b8\/Acid_Spray.mp3\/revision\/latest?cb=20141125094204",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Снижение брони основано на ауре, негативный эффект задерживается на 0,5 секунды. Урон не связан с аурой.",
        "Урон наносится каждую секунду, первый раз мгновенно после применения, срабатывая до 17 раз.",
        "В сумме может нанести до 320\/400\/480\/560 одному юниту (без учета снижений).",
        "При улучшении способности или взятии таланта после применения заклинания и пока оно еще активно, значение снижения брони у уже затронутых врагов остается прежним. Если же враг получит дебафф после этого момента, то значение снижения брони будет новым. Количество урона всегда остается того же уровня, что и в момент произнесения заклинания.",
        "Если же враг получит дебафф после этого момента, то значение снижения брони будет новым.",
        "Количество урона всегда остается того же уровня, что и в момент произнесения заклинания.",
        "Урон от нескольких применений Acid Spray складывается, но снижение брони - нет.",
        "Не действует на курьеров."
      ],
      "mana": "130\/140\/150\/160",
      "hotKey": "Q",
      "cooldown": "22",
      "description": "Распыляет в указанной области облако кислоты, которое наносит врагам периодический урон и снижает их броню.",
      "spellName": "Acid Spray",
      "params": [
        "Анимация применения: 0,2+0,7",
        "Дальность применения: 900",
        "Радиус: 475\/525\/575\/625",
        "Урон в секунду: 20\/25\/30\/35",
        "Снижение брони: 4\/5\/6\/7",
        "Длительность задержки ауры: 0,5",
        "Длительность: 16"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Используя семейные рецепты рода Темноваров, Раззил получает едкую кислоту, которая разрушает даже самые прочные металлы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b8\/Unstable_Concoction.mp3\/revision\/latest?cb=20141125094538",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя",
        "Урон Физический"
      ],
      "notes": [
        "При использовании прерывает произносимые способности Alchemist.",
        "Таймер над головой Alchemist показывает время, оставшееся до взрыва. Противники видят этот таймер.",
        "Анимация встряхивания и частицы видны всем. Бафф Unstable Concoction - скрытый.",
        "Враги услышат звук подготовки заклинания, если только оно было применено в пределах их обзора.",
        "Количество урона начинается с 0 (TagTalent ) и увеличивается на 3,2\/4,8\/6,4\/8 за каждую 0,1 секунды подготовки, достигая полного урона за 5 секунд.",
        "Время оглушения начинается с 0,3 секунды и увеличивается на 0,029\/0,044\/0,059\/0,074 за каждую 0,1 секунды подготовки, достигая 1,75\/2,5\/3,25\/4 за 5 секунд.",
        "Колба сначала наносит урон, затем применяет дебафф.",
        "Unstable Concoction всегда поражает площадь вокруг цели в радиусе 250 единиц при взрыве, в том числе когда взрывается на Alchemist.",
        "Если Alchemist умрет во время подготовки, колба мгновенно взорвется, поражая юнитов вокруг с учетом длительности встряхивания.",
        "Во время подготовки заклинания Alchemist может передвигаться и действовать как обычно.",
        "Оглушение и урон по площади работают также и на крипов-героев.",
        "Этой способностью можно совершить самоубийство.",
        "Взятие таланта на дополнительный урон к этой способности мгновенно обновляет значение урона снаряда, который готовится, а также всех снарядов, которые находятся в полете."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "16 (TagTalent 10)",
      "description": "Герой начинает встряхивать колбу с гремучей смесью, которую можно бросить во вражеского героя. При попадании колба взорвётся, оглушив всех противников в радиусе взрыва и нанеся им урон. Чем дольше смесь встряхивалась, тем больше урона она нанесёт и тем дольше будет оглушение. Смесь достигает максимального эффекта после 5 секунд, однако если не выбросить её через 5,5 секунды, она взорвётся в руках героя, подействовав и на него самого.",
      "spellName": "Unstable Concoction",
      "params": [
        "Анимация применения: 0+0",
        "Радиус взрыва: 250",
        "Макс. время подготовки: 5",
        "Макс. время броска: 5,5",
        "Мин. урон: 0",
        "Макс. урон: 160\/240\/320\/400 (TagTalent 560\/640\/720\/800)",
        "Макс. оглушение: 1,75\/2,5\/3,25\/4",
        "Не действует на заклинателя при взрыве, если на него действует иммунитет к заклинаниям, но способность все равно применит эффект по области.",
        "Блокируется врагами, но не блокируется заклинателем при взрыве."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Хоть превращение горы в золото и потерпело провал, благодаря ему была получена летучая микстура с разрушительным потенциалом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/52\/Throw_Unstable_Concoction.mp3\/revision\/latest?cb=20141125094220",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев",
        "Урон Физический"
      ],
      "notes": [
        "Заменяет Unstable Concoction до того момента, как колба будет выброшена или взорвется.",
        "Перекрестие указателя должно выделять вражеского юнита.",
        "Колба летит со скоростью 900.",
        "При броске Unstable Concoction перестает заряжаться.",
        "Колбу можно бросить только в героев и иллюзии. Урон по области не действует на крипов.",
        "Нельзя бросить в крипов-героев, но способность может их оглушить и нанести урон в радиусе подходящей цели.",
        "Попав в неуязвимую или спрятанную цель, колба все равно применяет эффекты по области."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Бросайте, пока не взорвалось!",
      "spellName": "Unstable Concoction Throw",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: 775",
        "Не может выбрать юнитов с иммунитетом к заклинаниям. Если снаряд соприкоснулся с юнитом с иммунитетом, то способность все равно будет действовать на юнитов в радиусе действия.",
        "Полностью блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Greevil's Greed активируется при каждом добивании, за исключением добивания союзников, строений, иллюзий а также Tempest Double.",
        "Бонусы работают независимо друг от друга. Каждый длится по 36 секунд и не обновляет длительность другого.",
        "Alchemist должен сам совершить добивание, чтобы получить бонус, таким образом добивание другими подконтрольными юнитами бонусы не дает.",
        "Иконка баффа показывает сколько бонусного золота герой заработает при следующем добивании.",
        "При добивании над Alchemist появляется второе число, показывающее сколько бонусного золота он заработал. Это число видит только Alchemist.",
        "Минимальное количество добиваний, необходимое для достижения максимума бонусов - 4\/5\/6\/7 (в течение 36 секунд длительности первого бонуса).",
        "Золото, заработанное с помощью Greevil's Greed, является ненадежным.",
        "Множитель Руна богатства влияет только на золото, получаемое Alchemist (вне зависимости от того, поднял ли руну сам Alchemist). Союзники получают стандартное количество золота."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Позволяет синтезировать больше золота из врагов и рун. Дополнительное золото за убийство существ состоит из начального бонуса и нарастающего, который увеличивается с каждым существом, убитым в течение 36 сек. после предыдущего. Также способность умножает золото от рун богатства.",
      "spellName": "Greevil's Greed",
      "params": [
        "Начальный бонус золота: 3",
        "Доп. золото: 3",
        "Макс. доп. золото: 15\/18\/21\/24",
        "Время между убийствами: 36",
        "Множитель руны богатства: 1,5\/2\/2,5\/3"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Пускай эксперимент с горой и не удался, зато структуры поменьше Раззил легко обращает в звонкую монету."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/ff\/Chemical_Rage.mp3\/revision\/latest?cb=20141125094214",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании позволяет избегать снаряды и применяет к Alchemist базовое развеивание.",
        "Увеличивает общую скорость передвижения героя до 345\/355\/365 (TagTalent 395\/405\/415) и приравнивает его базовое время атаки к 1.2\/1.1\/1.",
        "Восстанавливает до 1250\/1875\/2500 (TagTalent 2500\/3125\/3750) здоровья за всю длительность.",
        "Chemical Rage отменяется при смерти.",
        "Повторное применение Chemical Rage до завершения предыдущего обновит длительность и все значения до текущего уровня способности."
      ],
      "mana": "50\/100\/150",
      "hotKey": "R",
      "cooldown": "55",
      "description": "Особая химическая смесь разъяряет героя, отчего задержка перед его атакой уменьшается, а скорость его передвижения и восстановление здоровья\/маны увеличивается.",
      "spellName": "Chemical Rage",
      "params": [
        "Анимация применения: 0+0",
        "Время трансформации: 0.35",
        "Задержка перед атакой: 1.2\/1.1\/1",
        "Доп. регенерация здоровья: 50\/75\/100 (TagTalent 100\/125\/150)",
        "Доп. скорость передвижения: 40\/50\/60 (TagTalent 90\/100\/110)",
        "Длительность: 25",
        "Иллюзии, созданные во время действия Chemical Rage, получают новый бафф от Chemical Rage, который действует всю длительность способности без связи с оставшимся временем действия для самого Alchemist."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Варево, которым Раззил напоил огра для побега из тюрьмы, стало полезным в сражении зельем."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Alchemist_Aghanims_target.mp3\/revision\/latest?cb=20150430175817",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Aghanim's Scepter является используемым предметом для Alchemist, позволяя персонажу применить его на союзного героя (исключая клонов и иллюзий). Однажды его использовав, Aghanim's Scepter Alchemist разрушается, а выбранный союзник получает постоянный бафф Эссенция Aghanim's Scepter. Этот бафф дает союзнику все улучшения Aghanim's Scepter, в том числе атрибуты предмета. Общая стоимость Scepter передастся от Alchemist цели заклинания. Использование на самого Alchemist общей стоимости не изменит. Это действие не приведет к изменению показателя золота в минуту ни для Alchemist, ни для выбранной цели. Aghanim's Scepter можно подарить лишь один раз на одного и того же персонажа.",
        "Однажды его использовав, Aghanim's Scepter Alchemist разрушается, а выбранный союзник получает постоянный бафф Эссенция Aghanim's Scepter.",
        "Этот бафф дает союзнику все улучшения Aghanim's Scepter, в том числе атрибуты предмета.",
        "Общая стоимость Scepter передастся от Alchemist цели заклинания. Использование на самого Alchemist общей стоимости не изменит.",
        "Это действие не приведет к изменению показателя золота в минуту ни для Alchemist, ни для выбранной цели.",
        "Aghanim's Scepter можно подарить лишь один раз на одного и того же персонажа.",
        "Способность передавать Aghanim's Scepter привязана непосредственно к самому Alchemist, а не к его ультимативной способности. Исходя из этого также следует, что Alchemist может передавать Scepter в Ability Draft вне зависимости от набранных им способностей.",
        "Исходя из этого также следует, что Alchemist может передавать Scepter в Ability Draft вне зависимости от набранных им способностей.",
        "Если расплавить Aghanim's Scepter для союзника, у которого уже есть этот предмет или его улучшение, потраченные на него 4200 или 5800 золота вернутся владельцу.",
        "При передаче предмета 4 союзникам и поглощении самим заклинателем Alchemist получает до 100 урона от атаки и до 25% усиления урона заклинаний."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Герой может расплавить Aghanim's Scepter, чтобы передать союзнику все его улучшения и свойства. Сам предмет дарует герою дополнительный урон от атак и способностей за каждый расплавленный для союзников Aghanim's Scepter.",
      "spellName": "Синтез Aghanim's Scepter",
      "params": [
        "Дальность применения: 600",
        "Доп. урон от атак за скипетр: 0 (TagAghanim 20)",
        "Доп. урон способностей за скипетр: 0% (TagAghanim 5%)",
        "Иллюзии копируют бафф Aghanim's Scepter. Иллюзии Alchemist не копируют бафф урона."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ad\/Alchemist_Berserk_Potion_1.mp3\/revision\/latest?cb=20201220184644",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Снаряд летит со скоростью 900.",
        "От снаряда нельзя увернуться неуязвимостью и исчезновением."
      ],
      "mana": "125",
      "hotKey": "D",
      "cooldown": "35",
      "description": "Бросает в союзника зелье, которое применяет на него нормальное развеивание и даёт ему +50 к скорости атаки и +40 к восстановлению здоровья. Длительность: 10 секунд.",
      "spellName": "Berserk Potion",
      "params": [
        "Анимация применения: 0,2+0,63",
        "Дальность применения: 800",
        "Доп. скорость атаки: 50",
        "Восстановление здоровья: 40",
        "Длительность: 10"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.7,
    "attrStrength": 25.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.5,
    "attrAgility": 22.0
  },
  "description": "Alchemist, или Раззил Темновар — это герой с ближним типом атаки, основным атрибутом которого является сила. Алхимическое мастерство героя делает его странным, но разносторонним бойцом. Он необычный герой роли Керри, который опирается на преобразование убитых крипов в большое количество бонусного золота, с влиянием как в начале, так и в конце игры из-за огромной регенерации здоровья от его ультимативной способности и наступательного характера его других умений. Низкие, но сбалансированные характеристики Alchemist и уверенный приток золота на предметы означают, что он может быть одним из самых разрозненно собранных (по предметам) героев в игре.",
  "history": "Преданность священной алхимии была традицией рода Темноваров, но никто в нём не был таким изобретательным, честолюбивым и безрассудным, как юный Раззил. Повзрослев, он оставил семейное дело и решил попробовать себя в алхимическом создании золота. С присущей ему самоуверенностью он объявил, что обратит в золото целую гору. Спустя два десятилетия исследований, вложений и подготовок алхимик с треском провалился — и вскоре оказался за решёткой за множественные разрушения, причинённые экспериментом. Однако Раззил был не из робкого десятка и тщательно обдумывал варианты побега, чтобы продолжить свои исследования. Когда его новым сокамерником оказался свирепый огр, в голову алхимика тут же пришла идея. Первым делом Раззил уговорил огра не съедать его, а потом принялся тщательно составлять настойку из плесени и мха, что нашёл на исправительных работах. Через неделю варево созрело. Чуть огр выпил его, он тут же впал в ослепительную ярость, разорвал железные прутья, разнёс стены и перебил стражу. Скоро беглецы затерялись где-то в пригородном лесу, оставив за собой след разрушений и не оставив ни следа от преследователей. Когда действие настойки отошло, огр чувствовал себя вполне хорошо и выглядел счастливым и даже энергичным. И вот, решив работать вместе, парочка отправилась собирать материалы, чтобы Раззил в очередной раз попытал удачу.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+50 к восстановлению здоровья от Chemical Rage",
      "talentRight": "+50 к скорости передвижения от Chemical Rage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+400 к урону от Unstable Concoction",
      "talentRight": "+25% к прорубанию"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 к урону",
      "talentRight": "+350 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-6 сек. перезарядки Unstable Concoction",
      "talentRight": "+15 к скорости атаки"
    }
  ]
}