{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Шанс срабатывания Pierce складывается от нескольких Javelin и полностью работает независимо друг от друга. Это означает, что двое из них могут сработать одновременно, нанеся свой урон. Также складывается с Pierce Monkey King Bar.",
        "Это означает, что двое из них могут сработать одновременно, нанеся свой урон.",
        "Также складывается с Pierce Monkey King Bar.",
        "Доп. урон наносится одновременно с уроном от атаки и также считается уроном от атаки. Эффект вампиризма накладывается на урон Pierce. Однако, этот урон не учитывается при критических и прорубающих ударах. На Pierce не влияют процентный доп. урон к базовой атаке и уменьшение урона, однако его можно уменьшить при помощи прямого уменьшения.",
        "Эффект вампиризма накладывается на урон Pierce. Однако, этот урон не учитывается при критических и прорубающих ударах.",
        "На Pierce не влияют процентный доп. урон к базовой атаке и уменьшение урона, однако его можно уменьшить при помощи прямого уменьшения.",
        "Не работает на строениях, но работает против вардов и союзных существ.",
        "В среднем, наносит 21 магического урона за каждую атаку.",
        "Pierce использует псевдослучайное распределение.",
        "Атаки, на которые сработал Pierce, не могут промахнуться."
      ],
      "mana": null,
      "abilityName": "Pierce",
      "cooldown": null,
      "description": "Каждая атака может с вероятностью в 30% пройти сквозь уклонение и нанести 70 магического урона.",
      "params": [
        "Шанс срабатывания: 30%",
        "Урон: 70",
        "Может сработать у иллюзий, позволяя им атаковать сквозь уклонения, при этом доп. урон не наносится."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1100",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Снаряжение",
  "name": "Javelin",
  "description": "Довольно обычное копьё, которым иногда можно пробить вражескую броню.",
  "trivia": null,
  "upgradeIn": [
    "Monkey King Bar",
    "Maelstrom"
  ],
  "bonuses": null,
  "tips": null
}