{
  "abilities": [
    {
      "audioUrl": "",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Общая задержка на всех уровнях составляет 2 сек. (складывается из анимации применения и задержки).",
        "Torrent можно использовать, не поворачиваясь в сторону выбранной области.",
        "Подброшенные в воздух существа оглушаются и их всё так же можно атаковать.",
        "Пока существа в воздухе, остальные могут под ними проходить",
        "Оглушение и замедление применяются одновременно; в итоге замедление длится 2,6\/3,6\/4,6\/5,6 (TagTalent 27,6\/28,6\/29,6\/30,6) сек.",
        "Само подбрасывание длится 1,53 сек., поэтому пораженные существа будут находится на земле оставшиеся 0,07 сек. оглушения.",
        "После применения в выбранной области появляется визуальных эффект, а во время задержки проигрывается звуковой эффект. Эти эффекты видны и слышны только союзникам.",
        "Эти эффекты видны и слышны только союзникам.",
        "Наносит 10\/20\/30\/40 (TagTalent 15,63\/25,63\/35,63\/45,63) урона с интервалом в 0,2 секунды спустя 0,2 секунды после задержки, срабатывая 8 (TagTalent 133) раз. Так как урон наносится каждые 0,2 действия способности, талант на увеличение длительности оглушения увеличивает общий урон до 1330\/2660\/3990\/5320 (TagTalent 2078,125\/3408,125\/4738,125\/6068,125) единиц.",
        "Так как урон наносится каждые 0,2 действия способности, талант на увеличение длительности оглушения увеличивает общий урон до 1330\/2660\/3990\/5320 (TagTalent 2078,125\/3408,125\/4738,125\/6068,125) единиц.",
        "При применении дает наземный обзор в радиусе 350 единиц в выбранной области на 3,13 секунды."
      ],
      "mana": "16\/14\/12\/10",
      "item_behaviour": [],
      "name": "Torrent",
      "cooldown": "100",
      "description": "После небольшой задержки создаёт мощный поток воды, который подбрасывает врагов в воздух, оглушает их, наносит урон, а затем снижает скорость их передвижения.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 1300",
        "Радиус: 225 ( 305)",
        "Задержка: 1,6",
        "Урон: 80\/160\/240\/320 ( 125\/205\/285\/365)",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 1\/2\/3\/4",
        "Длительность оглушения: 1,6 ( 26,6)",
        "Длительность подбрасывания: 1,53 ( 26,53)"
      ],
      "legacy_key": "E",
      "story": "Адмирал вызывает мощный всплеск воды, который вырывается на поверхность прямо из центра мира."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/95\/Kunkka_Tidebringer_1.mp3\/revision\/latest?cb=20200509115806",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "notes": [
        "При изучении Tidebringer способность по умолчанию включает автоприменение.",
        "Прорубающий урон нельзя усилить с помощью усиления урона заклинаний и от него не идет лечение от вампиризма заклинаний.",
        "Прорубающий урон уменьшается блокировкой урона.",
        "Область поражения выглядит как равнобедренная трапеция, исходящая от героя.",
        "Сочетается с другими источниками прорубания. Каждый источник действует независимо от других.",
        "Эффекты частиц на пораженных существах видны на невидимых врагах и врагах в тумане войны.",
        "Не действует на варды, постройки и союзных существ.",
        "При завершении перезарядки проигрывает звуковой эффект, слышимый только игроку.",
        "При готовности на мече отображается визуальный эффект, видимый и союзникам, и врагам."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Tidebringer",
      "cooldown": null,
      "description": "Своим легендарным мечом адмирал бьёт врагов в большой площади перед собой, нанося увеличенный урон.",
      "hot_key": "W",
      "params": [
        "Дальность применения: 150",
        "Начальный радиус: 150",
        "Дистанция: 650\/800\/950\/1100",
        "Конечный радиус: 500\/550\/600\/650",
        "Прорубающий урон: 150% ( 220%)",
        "Дополнительный урон: 30\/60\/90\/120",
        "Замедление передвижения: 60%",
        "Длительность замедления: 1"
      ],
      "legacy_key": "D",
      "story": "Потерянная душа кладдского офицера поселилась в верном мече адмирала, дабы тот истреблял демонов Катаракты."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Kunkka_X_Marks_the_Spot.mp3\/revision\/latest?cb=20191216014831",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически применит на владельца способности.",
        "При возврате цель получает приказ \"стоп\", который отменяет произносимые заклинания.",
        "При возвращении не позволяет цели избежать снаряды.",
        "Отмечает текущее местоположение цели красной X. Отметка видна врагам только если у них есть обзор на существо или на сам крест.",
        "Помеченное существо при движении оставляет за собой красную пунктирную линию, показывая направление движения. Линия не отображается для врагов, если существо не видно. При этом уже нарисованная линия отображаться будет. Как только существо становится видимым, то линия немедленно рисует путь до последнего известного местоположения. В этом случае линия игнорирует пройденный существом путь. Она просто проводит прямую от последнего известного до текущего местоположения.",
        "Линия не отображается для врагов, если существо не видно. При этом уже нарисованная линия отображаться будет.",
        "Как только существо становится видимым, то линия немедленно рисует путь до последнего известного местоположения.",
        "В этом случае линия игнорирует пройденный существом путь. Она просто проводит прямую от последнего известного до текущего местоположения.",
        "Несколько использований X Marks the Spot на одну и ту же цель не складываются. Длительность способности обновляется лишь визуально. Обновление не влияет на таймер возврата, поэтому возврат существа все так же связан с первым применением. Каждое применение создает под целью отдельный крест. Если у модификатора завершается длительность, то возврат произойдет к первому. Если любой из заклинателей использует вспомогательное заклинание Return, то возврат произойдет к созданной им отметке. Как только происходит возврат к любой отметке, то все остальные применения отменяются, хоть визуально событие не отображается.",
        "Обновление не влияет на таймер возврата, поэтому возврат существа все так же связан с первым применением.",
        "Каждое применение создает под целью отдельный крест. Если у модификатора завершается длительность, то возврат произойдет к первому.",
        "Если любой из заклинателей использует вспомогательное заклинание Return, то возврат произойдет к созданной им отметке.",
        "Как только происходит возврат к любой отметке, то все остальные применения отменяются, хоть визуально событие не отображается.",
        "Вопреки визуальным эффектам цель под действием способности не возвращается к кресту после смерти и возрождения.",
        "Если цель неуязвима, то возврат не произойдет, а способность уйдет на перезарядку.",
        "Дает наземный обзор в радиусе 300 единиц вокруг креста на 5,94 секунды."
      ],
      "mana": "30\/24\/18\/12",
      "item_behaviour": [],
      "name": "X Marks the Spot",
      "cooldown": "50",
      "description": "Помечает место расположения дружественного или вражеского героя крестом и через несколько секунд или по нажатию кнопки возвращает его на это самое место. На союзниках длится вдвое дольше.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 550\/700\/850\/1000",
        "Длительность на противниках: 4",
        "Длительность на союзниках: 8",
        "Изменение скорости: 25%"
      ],
      "legacy_key": "X",
      "story": "Ряд мистических способностей Адмирала можно использовать как для битвы, так и для развлечения."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Вражеских героев"
      ],
      "notes": [
        "Заменяет X Marks the Spot до исчезновения креста под целью.",
        "Несмотря на то, что эта способность - вспомогательная, на неё, как и на обычное заклинание, срабатывают все эффекты, реагирующие на заклинания."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Return",
      "cooldown": null,
      "description": "Возвращает выбранного героя к кресту.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0"
      ],
      "legacy_key": "X",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/81\/Kunkka_Torrent_Storm.mp3\/revision\/latest?cb=20200509120416",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "При применении сразу же создает Torrent, а затем — каждые 0,25 сек., всего вызывая 21 поток.",
        "Появляющиеся потоки связаны с текущим уровнем способности Torrent Kunkka. Если способность не изучена, то потоки не появятся.",
        "Каждый поток может появится в пределах 300—1100 единиц от Kunkka.",
        "Радиус появления Torrent поделен на четыре сегмента в 90° (0°–90°, 90°–180°, 180°–270°, 270°–360°).",
        "Первый поток появляется в северо-восточном сегменте круга, далее появляясь против часовой стрелки.",
        "Центр радиуса появления — Kunkka, поэтому способность следует за ним.",
        "В отличии от обычного использования Torrent, эффекты частиц и звук во время задержки видны и слышны всем.",
        "Несколько применений Torrent Storm сочетаются, создавая собственные потоки.",
        "Если Kunkka умирает, то потоки в этом месте продолжают появляться."
      ],
      "mana": "70",
      "item_behaviour": [],
      "name": "Torrent Storm",
      "cooldown": "250",
      "description": "Применяет видимую всем способность Torren в случайной области вокруг владельца каждые 0,25 сек. Радиус действия: 1100. Длительность: 5 сек.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,4+0,53",
        "Мин. радиус появления Torrent: 300",
        "Макс. радиус появления Torrent: 1100",
        "Интервал появления: 0,25",
        "Длительность: 5"
      ],
      "legacy_key": "R",
      "story": "Сотням сухопутных лье не сдержать морской прилив."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/06\/Kunkka_Tidal_Wave_1.mp3\/revision\/latest?cb=20201229231613",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "В Ability Draft Tidal Wave может быть разблокирован, если игрок выберет способность Ghostship.",
        "В Ability Draft Tidal Wave может быть разблокирован, если игрок выберет способность Ghostship.",
        "Волна движется со скоростью 700, преодолевая всё расстояние за 3,29 сек.",
        "Волна появляется на расстоянии 900 от Kunkka, с противоположной стороны от той, куда герой смотрит.",
        "Благодаря дальности и радиусу прохождения волна может поразить существ на расстоянии 2150.",
        "Принудительное движение поражает врагов в направлении перемещения волны. Во время отбрасывания волной враги обезоружены. Они не могут атаковать, но могут поворачиваться и использовать предметы и способности. Прерываемые способности не прерываются.",
        "Во время отбрасывания волной враги обезоружены. Они не могут атаковать, но могут поворачиваться и использовать предметы и способности. Прерываемые способности не прерываются.",
        "Вначале волной будет наложен дебафф, а затем нанесён урон."
      ],
      "mana": "12",
      "item_behaviour": [],
      "name": "Tidal Wave",
      "cooldown": "75",
      "description": "Герой выпускает из-за себя приливную волну, которая наносит врагам 250 урона и переносит их на расстояние в 600, не давая им атаковать.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0,2+1",
        "Дальность применения: 1400",
        "Дальность движения: 2300",
        "Радиус: 750",
        "Урон: 250",
        "Дальность отталкивания: 600",
        "Длительность отталкивания: 1,25"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/32\/Kunkka_Ghostship.mp3\/revision\/latest?cb=20191216014835",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ ",
        "Урон: Магический"
      ],
      "notes": [
        "Корабль движется со скоростью 650, достигая места крушения за 3,08 сек.",
        "Корабль появляется позади Kunkka в 2000 единиц от выбранной точки и распадается в ней.",
        "Корабль сначала наносит урон, затем применяет дебафф.",
        "В выбранной точке появляется визуальный индикатор, показывающий пункт назначения корабля и радиус. Индикатор виден только союзникам.",
        "Бафф Ghost Ship Damage Absorb применяется к союзным героям, оказавшимся в любой момент на пути корабля на расстоянии в 425 единиц.",
        "Как только бафф «Адмиральский ром» исчезает, то применяется Ghost Ship Damage Delay, длящийся 1,4 сек. Бафф наносит 5% от сниженного ранее урона с интервалом в 1 секунду до возврата всего сниженного урона.",
        "Бафф наносит 5% от сниженного ранее урона с интервалом в 1 секунду до возврата всего сниженного урона.",
        "Отложенный урон, наносимый после завершения эффекта \"Похмелье от рома\", отмечен как отнимающий здоровье. Он не взаимодействует с эффектами, реагирующими на урон. Отложенный урон нельзя никак избежать. При этом он не смертельный.",
        "Отложенный урон нельзя никак избежать. При этом он не смертельный.",
        "Ром не уменьшает урон для существ под действием любого эффекта отрицания урона.",
        "Бафф от нескольких применений не складывается, но обновляет длительность и откладывает нанесение урона.",
        "Одновременно действующие баффы \"Адмиральский ром\" и \"Похмелье от рома\" не взаимодействуют друг с другом.",
        "Корабль во время движения дает летающий обзор вокруг себя в радиусе 300.",
        "При выборе на 25 уровне таланта на флот кораблей, 3 корабля появляются в одном и той же месте и движутся в одну и ту же точку. Корабли появляются с интервалом в 3,5 сек. сразу после применения, так что последний корабль появится через 7 сек. после применения. Место появления кораблей устанавливается при применении и не адаптируется под текущее местоположение заклинателя.",
        "Корабли появляются с интервалом в 3,5 сек. сразу после применения, так что последний корабль появится через 7 сек. после применения.",
        "Место появления кораблей устанавливается при применении и не адаптируется под текущее местоположение заклинателя."
      ],
      "mana": "80\/70\/60",
      "item_behaviour": [],
      "name": "Ghostship",
      "cooldown": "125\/175\/225",
      "description": "Вызывает призрачный корабль, который прорывается сквозь битву и разбивается, оглушая врагов и нанося им урон. Все союзники, задетые кораблем, оказываются под ливнем рома, получая дополнительную скорость передвижения и замедленную реакцию на урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 1000",
        "Радиус корабля: 425",
        "Дальность прохождения: 2000",
        "Число кораблей: 1 ( 3)",
        "Интервал появления кораблей: 3,5",
        "Урон: 400\/500\/600",
        "Ускорение передвижения: 12%",
        "Уменьшение урона: 40%",
        "Длительность рома: 10",
        "Длительность похмелья: 10",
        "Длительность оглушения: 1,4"
      ],
      "legacy_key": "T",
      "story": "Последний корабль кладдского флота — не более чем фантом. Однако для врагов адмирала он весьма реален."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.8,
    "attrStrength": 24.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.6,
    "attrAgility": 14.0
  },
  "description": "−2 сек. перезарядки Tidebringer Флот призрачных кораблей +70% к прорубающему урону от Tidebringer +80 к радиусу Torrent +45 к урону +30% времени оглушения и подбрасывания у Torrent X Marks the Spot изменяет скорость на 25% Tidebringer замедляет передвижение на 60% на 1 сек.",
  "history": "Адмирала могущественного кладдского флота Кункку отправили защищать родные острова, когда демоны Катаракты объединились и начали захватывать земли людей. Несколько лет гремели небольшие стычки, перераставшие в смелые и масштабные нападения, и вот весь флот кровожадных демонов направился к Дрожащему острову. В отчаянии маги-фаталисты Кладда провели свой последний ритуал, отдав свои жизни и призвав тысячи древних духов на защиту своего флота, но даже это едва ли изменило течение битвы. Пока кладдские корабли тонули один за другим, адмирал отдувался на вражеских — топя судна магией своих предков. Однако в разгаре битвы между людьми, демонами и призраками далекого прошлого что-то подняло с глубин доселе дремавшую четвёртую силу. Морские потоки взмыли над немногими целыми кораблями, и в сердце боя появился Мэльрон Щупальцеликий. Его склизкие конечности расшвыривали корабли, разбивая кладдские фрегаты о судна Катаракты и смешивая волны и потоки ветра в бушующий хаос. Никто не может точно сказать, чем закончилось то столкновение. Катаракта с демоническими воплями затянулась обратно в пустоту, брошенная своими обитателями. Кункка же стал адмиралом, чей флот — единственное призрачное судно, которое бесконечно повторяет последние секунды своей жизни. Но пережил ли ту бурю сам адмирал? Этого не знает даже Левиафан — тот, кто призвал Мэльрона."
}