{"abilities":[{"spell":"Герой увеличивает свой посох и бьет им по земле, оглушая всех попавшихся врагов. Такая атака наносит критический урон и не может промахнуться.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Физический"],"notes":["Эффекты Boundless Strike применяются мгновенно по всей области. Нет времени движения.","Эффект начинается на расстоянии в 75 спереди Monkey King и имеет фактическую длинну 1125, что в сумме дает 1200 эффективной длины. Может ударить существ на расстоянии до 1350 (складывается из начальной дистанции, длины и ширины). Также может ударить существ на расстоянии 75 позади Monkey King из-за радиуса и стартовой позиции.","Позволяет Monkey King мгновенно атаковать всех затронутых врагов. Оглушёние не зависит от этих атак. Эти атаки имеют эффект True Strike и не могут промахнуться. Они также игнорируют обезоруживание. На все затронутые цели может сработать любой модификатор атаки, за исключением прорубающего удара. Также срабатывает Jingu Mastery, устанавливая негативный эффект на всех затронутых врагов, или добавив к счётчику один удар, если негативный эффект уже имеется. Несмотря на звук, Daedalus всё еще имеет шанс сработать. Boundless Strike не гарантирует срабатывание эффектов, основанных на шансе. Так как Boundless Strike имеет гарантированный крит, то криты с меньшими множителями не дадут эффекта, если сработают (высшее значение крита будет приоритетнее).","Jingu Mastery теряет заряд при применении Boundless Strike, независимо от того попала ли способность по существам или нет. Урон бонусной атаки применяется на все затронутые цели, и вампиризм будет также от каждой затронутой цели, несмотря на то что используется только 1 заряд.","Boundless Strike сначала применяет дебафф, затем наносит урон.","Звук во время анимации применения слышен всем."],"mana":"100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"22","name":"Boundless Strike","description":["Анимация применения: 0,4+0,5","Дальность применения: 1200","Длина эффекта: 1200","Ширина эффекта: 150","Критический урон: 150%\/175%\/200%\/225% ( 200%\/225%\/250%\/275%)","Длительность оглушёния: 0.4\/0.8\/1.2\/1.6"],"hot_key":"Q","legacy_key":"B"},{"spell":"Герой запрыгивает на верхушку выбранного дерева. Там он получает прерываемую способность Primal Spring — атаку в прыжке. Если разрушить дерево, герой упадет и оглушится на 4 секунды. При получении на земле урона от управляемых игроками существ или Рошана способность уходит на перезарядку.","effects":["Способность Направленная на юнита","Действует на Себя \/ Деревья"],"notes":["Повышение уровня Tree Dance также повысит уровень Primal Spring.","Monkey King прыгает к выбранному дереву со скоростью 700, достигая дерева за 1,4 секунды.","Прыгает дугой высотой в 192. Во время прыжка другие существа могут проходить под Monkey King.","Несмотря на то что визуально видно как Monkey King над землей когда находится на дереве, всё еще считается что он на земле. Высота является частью анимаций.","Tree Dance имеет несколько разных перезарядок, которые активируются в разное время. При применении длительность прыжка добавляется к перезарядке, что в результате дает перезарядку от 1.1 до 2.4 секунд в зависимости от дистанции. При достижении дерева перезарядка длится 1 секунды, что имеет значение только если была пропущена перезарядка применения (например с Chakra Magic). При спрыгивании с дерева командами передвижения или атаки способность уходит на перезарядку в 1 секунды. Не уходит на перезарядку при спрыгивании с дерева любыми другими способами. При получении урона от источников, принадлежащих игрокам, или Рошана и превышающего 0, находясь на земле, способность уходит на перезарядку в 3 секунды. Все эти перезарядки не попадают под влияние процентных уменьшений перезарядок. Прямые уменьшения и установки перезарядок всё еще работают.","Во время прыжка Monkey King обезврежен и не способен выполнять какие-либо действия. Последняя отданная команда будет исполнена как только он приземлится.","Во время прыжка и находясь на дереве, Monkey King получает летающий обзор, но его видимость уменьшена до 800\/400 ( 1200\/800). Бонусный ночной обзор от Moon Shard и Darkness всё еще работают, но Nightmare не влияет на обзор Monkey King, когда он на дереве.","Находясь на дереве, Monkey King спрятан от взора. Его можно увидеть только имея летающий обзор. Его также можно увидеть находясь на 2 уровня поверхности выше чем дерево на котором сидит Monkey King, позволяя вардам увидеть его если они находятся на высшей точке. Но его нельзя увидеть с помощью способностей? которые подбрасывают в небо (например Toss). Лишь стоя на высшей поверхности можно получить видимость на героя.","Находясь на дереве, Monkey King может нормально выполнять обычные действия, при выполнении некоторых он слезет с дерева, а при других нет. Применение Boundless Strike, Mischief и любой способности предметов не спустят его с дерева. Применение Wukong's Command, передвижение и атака спустят его с дерева. Прямое движение и патрулирование не дадут эффекта если отдать команду находясь на дереве, так что Monkey King не спустится. При перезарядке на дереве, Monkey King обезоружен и не может передвигаться, что не позволяет ему слезть с дерева командами передвижения и атаки. Принудительное движение также спустит героя с дерева. Сюда входят эффекты Blink Dagger, Eul's Scepter of Divinity, Force Staff и Hurricane Pike.","Находясь на дереве, Tree Dance можно использовать еще раз, выбрав другое ближайшее дерево. Все деревья в дальности применения будут подсвечены белым цветом.","Monkey King будет оглушён, если дерево, на которое он прыгает или на котором сидит, будет уничтожено. Спуск другими способами (в том числе принудительным движением) не будет оглушать. Находясь на деревьях, созданных Sprout или Iron Branch, Monkey King не будет оглушён, когда они исчезнут или будут уничтожены.","Модификатор активности Tree Dance появляется во время прыжка и отвечает за анимацию скачка. Его развеивание не отменит прыжок."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Нельзя применять в оцепенении или будучи связанным.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"1","name":"Tree Dance","description":["Анимация применения: 0,3+0","Дальность применения: 1000 ( 1600)","Перезарядка при получении урона: 3","Обзор с дерева днём: 800 ( 1200)","Обзор с дерева ночью: 400 ( 800)","Длительность оглушёния при падении с дерева: 4"],"hot_key":"W","legacy_key":"T"},{"spell":"Герой спрыгивает с дерева, нанося урон врагам в указанной области и замедляя их. Урон и замедление усиливаются в зависимости от времени подготовки способности.","effects":["Способность Направленная на область \/ Произносимая","Действует на Врагов","Урон Магический"],"notes":["Эта способность автоматически повышает свой уровень,если повысить уровень Tree Dance.","Эта способность активна только при времени применения Tree Dance, прыжка с земли на дерево и находясь на дереве. Она неактивна при прыжке с дерева на другое дерево и при нахождении на земле.","Так как Monkey King обезврежен во время прыжка, команда применения во время прыжка с земли на дерево поместит способность в очередь, так что он применит её мгновенно как только окажется на дереве.","Прыгает в указанную область со скоростью 1300, достигая её за 0,77 секунды, основываясь на дистанции.","Урон и замедление основываются на времени произнесения, то есть их потенциал увеличивается с каждым тиком сервера (0,03 секунды), потраченным на произнесение, до 54 раз. Урон увеличивается на 2,642\/3,962\/5,283\/6,604 ( 10,189\/11,509\/12,83\/14,151) за каждый тик сервера, начиная мгновенно, достигая 142,6\/214\/285,3\/356,6 ( 550,2\/621,5\/692,8\/764,2) урона за 1.6 секунды. Замедление увеличивается на 0,4%\/0,8%\/1,1%\/1,5% за каждый тик сервера, также начиная мгновенно, достигая 20%\/40%\/60%\/80% замедления за 1.6 секунды.","Попадание по тому же врагу с Primal Spring несколько раз обновит длительность замедления, но не обновит значение замедления, основаное на времени произнесения.","Primal Spring сначала наносит урон, затем применяет дебафф.","Визуальные эффекты во время произнесения видны только союзникам, но звук слышен так же и врагам.","Звук произнесения слышен врагам даже сквозь туман войны.","Модификатор активности Tree Dance появляется во время прыжка и отвечает за анимацию скачка. Его развеивание не отменит прыжок."],"mana":"100","elements":["Нельзя применять в оцепенении или будучи связанным.","Блокируется иммунитетом к заклинаниям."],"cooldown":"19\/17\/15\/13","name":"Primal Spring","description":["Анимация применения: 0+0","Дальность применения: Глобальная","Макс. дистанция прыжка: 1000","Радиус: 375","Макс. время произнесения: 1.6","Макс. урон: 140\/210\/280\/350 ( 540\/610\/680\/750)","Макс. замедление скорости передвижения: 20%\/40%\/60%\/80%","Длительность замедления: 4"],"hot_key":"E","legacy_key":"G"},{"spell":"Для этой способности нет описания.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Заменяет Primal Spring до окончания произнесения.","Мгновенно заканчивает произнесение Primal Spring, что позволяет Monkey King прыгнуть раньше.","Нельзя поставить в очередь через Shift."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Spring Early","description":["Анимация применения: 0+0"],"hot_key":"E","legacy_key":"G"},{"spell":"Удары героя пробуждают мощь Цзиньгубана. Каждая четвертая атака по вражескому герою дарует четыре усиленные атаки с дополнительным уроном и вампиризмом.","effects":["Способность Пассивная","Действует на Врагов \/ Себя"],"notes":["Каждая успешная атака по вражескому герою применяет к нему дебафф, если на Monkey King не действует бафф на доп. урон и вампиризм, или добавляет 1 к его счётчику, если бафф уже действует.","Только фактические вражеские герои (включая клонов) могут получать дебафф. Иллюзии и крипы-герои не учитываются. Союзные герои также не учитываются.","Длительность дебаффа обновляется с каждым ударом. Необязательно наносить все 4 удара в течение 10 секунд.","Мгновенная атака Boundless Strike также считается и способна разместить дебафф\/добавить в счётчик дебаффа.","При попадании по одной и той же цели 4 раза, дебафф на цели исчезает и Monkey King получает урон к атаке и эффект вампиризма.","Заряд используется при успешной атаке любого юнита, включая строения, варды и союзных юнитов, всегда применяя бонусный урон.","Вампиризм не работает на строения и союзников, но работает на любых других юнитов, включая варды.","Вампиризм от бафа складывается аддитивно с другими источниками вампиризма.","Boundless Strike также использует эффекты Jingu Mastery, ударяя всех врагов с бонусным уроном и вампиризмом, но за применение используется только 1 заряд. Даже если не был ударен ни один враг, Boundless Strike всё еще теряет 1 заряд Jingu Mastery."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Jingu Mastery","description":["Ударов нужно: 4","Зарядов: 4","Дополнительный урон: 60\/90\/120\/150 ( 160\/190\/220\/250)","Вампиризм: 15%\/30%\/45%\/60%","Длительность счётчика: 10","Длительность баффа: 35"],"hot_key":"D","legacy_key":"R"},{"spell":"Изменяет форму героя, чтобы обхитрить противников. Маскировка зависит от окружения и спадает при получении урона, попытке атаковать и применении предметов или способностей. Делает героя неуязвимым на 0.2 сек.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Это врождённая способность и не требует изучения. Она не относится ни к какой способности, а к самому Monkey King.","Прерывает произносимые заклинания Monkey King, команды передвижения и атаки при применении.","При использовании Mischief превращает Monkey King в один из предметов или юнитов: Animal Courier (использует модель курьера команды), Iron Branch, Clarity, Healing Salve, Town Portal Scroll, Banana (целый или кожуру), Tango","Если в пределах 350 при применении есть курьер команды, Monkey King в него превращается.","Если в пределах 350 при применении есть дерево, Monkey King превращается в это дерево. Если в дальности несколько деревьев, будет выбрано случайное. Это включает созданные деревья с Sprout и Iron Branch.","Если в пределах 350 есть точка руны, Monkey King превращается в случайную руну которая может быть в этой точке руны.","При применении после первой смерти Рошана в его логове Monkey King превращается в Aegis of the Immortal. После 2-й смерти Рошана герой также может превратится в Cheese. После 3-й герой может превратиться в Refresher Shard.","При превращении скорость передвижения приравнивается к 200 (к 380, если герой стал курьером). Как и в случае с ускорением, на его скорость нельзя ничем повлиять.","Бокс выбора Monkey King адаптируется к моделям маскировки. Но его размер столкновения не меняется.","Иконка Monkey King на мини-карте не видна врагам, когда он замаскирован. К тому же полоса здоровья и маны над головой скрывается для всех, включая самого игрока.","Автоматическая атака игнорирует Monkey King, так что линейные и нейтральные крипы, башни и фонтаны не будут атаковать его автоматически. Юниты игроков с включенной автоматической атакой также не будут атаковать его автоматически, если не отдавать приказ атаки. Атака на землю также будет игнорировать его. Monkey King всё еще полностью затрагивается любым заклинанием (как направленным на цель, так и ненаправленным). Его можно выбрать в качестве цели. Эффекты частиц заклинаний всё еще будут принадлежать ему.","В течение 0.2 секунды Mischief отрицает урон, не позволяя срабатывать определенным эффектам, реагирующим на урон.","Урон, превышающий 0 развеивает эффект. Не развеивается уроном, помеченным как отнимающий здоровье."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Не может использоваться иллюзиями."],"cooldown":"20","name":"Mischief","description":["Анимация применения: 0+0,53","Установленная скорость передвижения (По умолчанию): 200","Установленная скорость передвижения (будучи курьером): 380","Радиус поиска: 350","Длительность иммунитета к урону: 0.2"],"hot_key":"F","legacy_key":"F"},{"spell":"Возвращает героя в изначальную форму.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Заменяет Mischief до окончания маскировки.","Прерывает произносимые заклинания Monkey King, команды передвижения и атаки при применении."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"1","name":"Revert Form","description":["Анимация применения: 0+0,53"],"hot_key":"F","legacy_key":"F"},{"spell":"Герой создает круговую формацию солдат, которые расходятся из его местоположения. Если герой покидает область действия способности, его солдаты исчезают. Их атака идентична атаке героя, а своей целью они выбирают только других героев. На время действия способности герой получает дополнительную броню.","effects":["Способность Направленная на область","Действует на Вражеских героев","Урон Физический"],"notes":["При применении появляется 14 ( 21) клонов Monkey King, которые мгновенно идут к своим определенным точкам в формации.","Клоны движутся со скоростью 700 и имеют безпрепятственное передвижение, проходя через уступы и деревья.","Строй, занимаемый солдатами, всегда одинаков, за исключением варианта, когда пространство ограничено краем карты. Внутренние солдаты формируют пятиугольник с кругом радиусом в 300, с вершиной, всегда повернутой в сторону севера. Внешние солдаты формируют девятиугольник с кругом радиусом в 750, также с вершиной, всегда повернутой в сторону севера. ( Солдаты в третьем круге формируют семиугольник с кругом радиусом в 1100, также с вершиной, всегда повернутой в сторону севера.)","Солдаты неуязвимы и их нельзя выбрать, что позволяет им игнорировать почти все заклинания.","Солдаты - это клоны Monkey King, копирующие все атрибуты Monkey King, за несколькими исключениями. Они не являются иллюзиями. Их базовые характеристики адаптируются при каждом призыве (например, постоянная потеря атрибутов от Intelligence Steal или Essence Shift). Их скорость атаки фиксирована, так что они всегда совершают одну атаку каждые 1.2 секунды. Эффекты, увеличивающие или замедляющие скорость атаки, не влияют на них. Их дневной и ночной обзор уменьшен до 600. Они дают видимость при движении к своей точке и когда стоят в ней. Клоны способны атаковать только тех врагов, которых видят. Невидимые враги и враги внутри тумана войны не будут атакованы, даже если они внутри круга и в пределах дальности атаки. Клоны также копируют большую часть предметов Monkey King, так что они могут использовать все модификаторы атаки и получать те же ауры, что и Monkey King. Клоны копируют Abyssal Blade и Skull Basher, но не могут использовать их оглушение. Клоны не копируют Aegis of the Immortal, Gem of True Sight и Animal Courier. Постоянный бафф от Синтез Aghanim's Scepter и Intelligence Steal также копируется. При этом другие постоянные баффы (например Moon Shard, Duel) не копируются. Так как их скорость атаки фиксирована, то Echo Sabre не позволит им атаковать дважды. Замедление от предмета всё еще применяется. Jingu Mastery не работает для клонов. Они не добавляют заряды на врагах и не получают бонусный урон, если у Monkey King был эффект при применении. Так как солдаты совершают обычные атаки, их урон уменьшается блокировкой урона.","Солдаты атакуют только вражеских героев, клонов, крипов-героев и иллюзии внутри круга. Другие существа и любые существа вне круга игнорируются даже если они в пределах дальности атаки.","Если Monkey King выйдет за радиус 780 ( 1130) от центра круга или умрет, то солдаты исчезнут и заклинание закончится.","Повторное использование Wukong's Command, пока предыдущее применение всё еще активно, мгновенно завершит предыдующее применение.","Пассивное создание солдат от Aghanim's Scepter использует время восстановления, а не интервал. То есть, если солдат готов появится, но Monkey King находится в состоянии, запрещающем появление, то способность призовет клона как только появится возможность. Солдаты не появляются, если на героя действуют модификаторы прыжка и нахождения на дереве от Tree Dance, превращение Mischief, невидимость или герой мертв. В отличии от призываемых солдат, клоны могут атаковать любого юнита, но требуют присутствия Monkey King в радиусе 500 для атаки строений."],"mana":"100","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"130\/110\/90","name":"Wukong's Command","description":["Анимация применения: 1,2+0,37","Дальность применения: 550","Внутренний радиус: 300","Внешний радиус: 750","Радиус доп. круга: 0 ( 1100)","Радиус командования: 780 ( 1130)","Радиус появления солдата: 0 ( 300)","Интервал появления солдата: 0 ( 3.5)","Кол-во внутренних солдат: 5","Кол-во внешних солдат: 9","Кол-во солдат в доп. круге: 0 ( 7)","Интервал между атаками солдат: 1.2","Бонусная броня: 12\/18\/24 ( 100)","Макс. длительность: 13"],"hot_key":"R","legacy_key":"W"}],"bio":"500 лет Сунь Укуна сдавливала гора, и лишь его голова не ощущала сокрушительного веса каменной тюрьмы, в которой древние боги заточили бесшабашного бунтаря. Черты его открытого всем ветрам лица покрыл мох, из ушей проросла трава; его взор обрамляли полевые цветы, пустившие корешки в почве вокруг его щёк. Многие думали, что он погиб, сгинул в мучениях за войну с небесами, но легенды о нём не забывались. И гласили они: Сунь Укун не способен умереть. И он ждал. Терпеливо ждал шанса искупить свою вину перед богами. И когда они решили назвать ему свою цену, Сунь Укун согласился: он пообещал сопроводить юного пилигрима в его тайном походе, защитить его от демонов и внешних напастей, привести путника домой вместе с желанной реликвией. «Сделай так, — сказали боги, — да покорно слушайся приказов своего господина, что служит нам своей святой миссией, и тогда избавишь себя от нашей немилости». Переменившийся Сунь Укун с честью исполнил свою клятву перед богами, искупив свои прошлые грехи. Пилигрим, укрепив свою веру в лишениях, вернулся в обитель вместе с реликвией; Сунь Укун же гордо вошёл в пантеон богов — и первое время пытался побороть старую страсть к приключениям и славе. Но жить он мог лишь хитростью... А что может быть лучше, чем обхитрить богов вновь?","talentsTips":["Таланты полностью перенимаются клонами Wukong's Command."],"trivia":["Monkey King основан на Сунь Укуне, легендарном герое из китайской классики Путешествие на Запад.","Monkey King это первый герой изначально созданный для Dota 2. Все предыдущие герои были импортированы из DotA.","Monkey King основан на ранних концептах во времена DotA. Like many DotA heroes, there was an easter egg boss fight versus Monkey King added to the 6.79 DotA map to hint at his upcoming release, but he was never added to the game.","Предмет Banana, который появляется лишь в приватных лобби, возможно был ранним намеком на релиз Monkey King.","Концепт Monkey King был часто использован в жанре MOBA, с другими Monkey King героями в League of Legends, Heroes of Newerth и SMITE.","В трейлере, Monkey King озвучен Мэттью Мерсером, который также озвучил Monkey King из Heroes of Newerth.","Эмблема на земле в момент произнесения Primal Spring называется Багуа и символизирует описание действительности относительно Даосской космологии."],"talents":["Дополнительный круг Wukong's Command:+100 к броне от Wukong's Command","+400 урона от Primal Spring:+50% множитель крита от Boundless Strike","+100 к урону от Jingu Mastery:+600 к дальности применения Tree Dance","+20 к скорости атаки:+400 к радиусу обзора Tree Dance"],"desc":"Герой   Руководство   Противостоящие   Снаряжение   Принадлежности   Таланты   Реликвии   Реплики   Звуки   История   Старые способности   Изменения  "}