{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The cooldown reduction talent stacks multiplicatively with other sources cooldown reduction.",
        "The strength talent effectively grants Timbersaw 320 health, 1.6 health regeneration, and 16 attack damage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1125 Timber Chain Range",
          "talentRight": "+10% Whirling Death Attribute Reduction"
        },
        {
          "talentLvl": "20",
          "talentLeft": "12% Cooldown Reduction",
          "talentRight": "+16 Strength"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+8 Reactive Armor Stacks",
          "talentRight": "+8% Spell Amplification"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1.5 Mana Regen",
          "talentRight": "+200 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ec\/Timbersaw_Whirling_Death_1.mp3\/revision\/latest?cb=20191216025155",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Interrupts Timbersaw's channeling spells upon cast.",
        "Whirling Death first applies the debuff, then the damage.",
        "Reduces the total main attributes of hit enemy heroes, including bonus attributes. The reduction does not update if the target gains or loses attributes after the debuff is placed.",
        "The reduction does not update if the target gains or loses attributes after the debuff is placed.",
        "Before applying the damage, it first reduces current health by 20 for each point of strength it reduced.",
        "Upon losing the debuff, enemies first only regain 19 health per missing strength point, before gaining their attributes back.",
        "Has no effect on affected units' current mana percentage if intelligence gets reduced.",
        "Cannot reduce any attributes below 0.",
        "Debuffs from successive casts stack additively, with each cast placing a new debuff.",
        "The attribute reduction fully affects illusions, Meepo Clones and Tempest Doubles."
      ],
      "mana": "80",
      "hotKey": "Q",
      "cooldown": "6 (TagTalent 5.28)",
      "description": "Timbersaw whirls extremely sharp edges, damaging enemies and destroying trees around him in an area. If an enemy hero is affected, it loses some of its primary attribute for a short duration. Whirling Death will deal bonus damage per tree destroyed.",
      "spellName": "Whirling Death",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 325",
        "Base Damage: 80\/120\/160\/200",
        "Bonus Damage per Cut Tree: 12\/18\/24\/30",
        "Primary Attribute Reduction: 13%\/14%\/15%\/16% (TagTalent 23%\/24%\/25%\/26%)",
        "Attribute Reduction Duration: 14",
        "Attribute reduction persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "In the case that Rizzrack gets surrounded by the vines and plants of nightmares, he has an immediate chainsaw defense."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/81\/Timbersaw_Timber_Chain_1.mp3\/revision\/latest?cb=20191216025152",
      "effects": [
        "Ability Target Point",
        "Affects Self \/ Enemies",
        "Damage Pure"
      ],
      "notes": [
        "The chain travels at a speed of 1900\/2200\/2500\/2800 and always travels either the full distance or until connecting with a tree.",
        "Can connect to trees up to 850\/1050\/1250\/1450 (TagTalent 1975\/2175\/2375\/2575) range away (max travel distance + tree search radius).",
        "The hooked tree is destroyed once the chain stops pulling.",
        "Can pull Timbersaw over impassable terrain and through trees.",
        "Timbersaw stops being pulled if he is disabled at any point during Timber Chain.",
        "If Timbersaw is disabled before the chain starts pulling, the chain still pulls him for a very short distance This is still enough to cause damage around him to nearby units or to affect effects based on distance (e.g. Rupture).",
        "This is still enough to cause damage around him to nearby units or to affect effects based on distance (e.g. Rupture).",
        "Timbersaw can cast spells and items during the pull, but cannot attack.",
        "The chain's tip briefly provides 100 radius ground vision around itself while traveling, and 400 radius ground vision once reaching max distance or connecting with a tree.",
        "If Timbersaw dies during Timber Chain and then instantly respawns (e.g. after buying back), the pull still continues possibly moving him all across the map to the targeted tree."
      ],
      "mana": "60\/70\/80\/90",
      "hotKey": "W",
      "cooldown": "4 (TagTalent 3.52)",
      "description": "Timbersaw fires a chain that embeds itself in the first tree it hits, pulling him towards it. Any enemy in the path takes damage.",
      "spellName": "Timber Chain",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 800\/1000\/1200\/1400 (TagTalent 1925\/2125\/2325\/2525)",
        "Max Travel Distance: 800\/1000\/1200\/1400 (TagTalent 1925\/2125\/2325\/2525)",
        "Tree Search Radius: 50",
        "Damage Radius: 225",
        "Damage: 100\/140\/180\/220",
        "Getting rooted after cast does not stop the chain from latching and pulling Timbersaw."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "You never know when you might need to escape from malevolent saplings."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Only procs when a unit lands an attack on Timbersaw, regardless of distance. This means it cannot proc on missed attacks.",
        "Secondary attacks from Moon Glaives, Split Shot and Flak Cannon cannot trigger Reactive Armor.",
        "Procs on the secondary attacks from other sources of instant attacks.",
        "Procs on attacks from any unit, regardless of team or unit type (including wards and buildings).",
        "Each successful attack on Timbersaw grants him 1 stack. The stack is added right before the attack's damage is applied.",
        "Each stack has its own duration and is independent from other stacks. The amount of stacks is shown on the status buff icon.",
        "Each stack can regenerate up to 10\/14.3\/19.2\/24.7 health over their full durations.",
        "This is how much health regeneration Reactive Armor grants with a certain amount of stacks on each level (including the talent max stacks bonus). Level 1: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14 Level 2: 1.1\/2.2\/3.3\/4.4\/5.5\/6.6\/7.7\/8.8\/9.9\/11\/12.1\/13.2\/14.3\/15.4\/16.5\/17.6\/18.7\/19.8\/20.9\/22 Level 3: 1.2\/2.4\/3.6\/4.8\/6\/7.2\/8.4\/9.6\/10.8\/12\/13.2\/14.4\/15.6\/16.8\/18\/19.2\/20.4\/21.6\/22.8\/24\/25.2\/26.4\/27.6\/28.8\/30\/31.2 Level 4: 1.3\/2.6\/3.9\/5.2\/6.5\/7.8\/9.1\/10.4\/11.7\/13\/14.3\/15.6\/16.9\/18.2\/19.5\/20.8\/22.1\/23.4\/24.7\/26\/27.3\/28.6\/29.9\/31.2\/32.5\/33.8\/35.1\/36.4\/37.7\/39\/40.3\/41.6",
        "Level 1: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14",
        "Level 2: 1.1\/2.2\/3.3\/4.4\/5.5\/6.6\/7.7\/8.8\/9.9\/11\/12.1\/13.2\/14.3\/15.4\/16.5\/17.6\/18.7\/19.8\/20.9\/22",
        "Level 3: 1.2\/2.4\/3.6\/4.8\/6\/7.2\/8.4\/9.6\/10.8\/12\/13.2\/14.4\/15.6\/16.8\/18\/19.2\/20.4\/21.6\/22.8\/24\/25.2\/26.4\/27.6\/28.8\/30\/31.2",
        "Level 4: 1.3\/2.6\/3.9\/5.2\/6.5\/7.8\/9.1\/10.4\/11.7\/13\/14.3\/15.6\/16.9\/18.2\/19.5\/20.8\/22.1\/23.4\/24.7\/26\/27.3\/28.6\/29.9\/31.2\/32.5\/33.8\/35.1\/36.4\/37.7\/39\/40.3\/41.6",
        "This is how much armor Reactive Armor grants with a certain amount of stacks on each level (including the talent max stacks bonus). Level 1: 0.9\/1.8\/2.7\/3.6\/4.5\/5.4\/6.3\/7.2\/8.1\/9\/9.9\/10.8\/11.7\/12.6 Level 2: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14\/15\/16\/17\/18\/19\/20 Level 3: 1.1\/2.2\/3.3\/4.4\/5.5\/6.6\/7.7\/8.8\/9.9\/11\/12.1\/13.2\/14.3\/15.4\/16.5\/17.6\/18.7\/19.8\/20.9\/22\/23.1\/24.2\/25.3\/26.4\/27.5\/28.6 Level 4: 1.2\/2.4\/3.6\/4.8\/6\/7.2\/8.4\/9.6\/10.8\/12\/13.2\/14.4\/15.6\/16.8\/18\/19.2\/20.4\/21.6\/22.8\/24\/25.2\/26.4\/27.6\/28.8\/30\/31.2\/32.4\/33.6\/34.8\/36\/37.2\/38.4",
        "Level 1: 0.9\/1.8\/2.7\/3.6\/4.5\/5.4\/6.3\/7.2\/8.1\/9\/9.9\/10.8\/11.7\/12.6",
        "Level 2: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14\/15\/16\/17\/18\/19\/20",
        "Level 3: 1.1\/2.2\/3.3\/4.4\/5.5\/6.6\/7.7\/8.8\/9.9\/11\/12.1\/13.2\/14.3\/15.4\/16.5\/17.6\/18.7\/19.8\/20.9\/22\/23.1\/24.2\/25.3\/26.4\/27.5\/28.6",
        "Level 4: 1.2\/2.4\/3.6\/4.8\/6\/7.2\/8.4\/9.6\/10.8\/12\/13.2\/14.4\/15.6\/16.8\/18\/19.2\/20.4\/21.6\/22.8\/24\/25.2\/26.4\/27.6\/28.8\/30\/31.2\/32.4\/33.6\/34.8\/36\/37.2\/38.4",
        "The amount of stacks is also visually indicated by a dome which closes over on Timbersaw. The exhaust on the suit also starts emitting fire once the dome is fully closed. The dome has 4 fragments, each appearing for every 4 stacks (1-4, 5-8, 9-12, 13-16). The dome opens again upon dropping below the given amount of stacks.",
        "The dome has 4 fragments, each appearing for every 4 stacks (1-4, 5-8, 9-12, 13-16). The dome opens again upon dropping below the given amount of stacks."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Each time Timbersaw is attacked, he gains increased health regen and armor.",
      "spellName": "Reactive Armor",
      "params": [
        "Max Stacks: 6\/12\/18\/24 (TagTalent 14\/20\/26\/32)",
        "Armor Bonus per Stack: 0.9\/1\/1.1\/1.2",
        "Health Regen Bonus per Stack: 1\/1.1\/1.2\/1.3",
        "Stack Duration: 10\/13\/16\/19",
        "Prevents gaining new stacks. Already existing stacks still provide bonus health regeneration and armor. If Break is applied by an attack, Reactive Armor first triggers on that attack before getting disabled.",
        "Illusions gain stack and benefit from the regen, but not from the armor."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "The saw-suit is equipped to react to the slightest touch with fortified defenses."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Timbersaw_Chakram_1.mp3\/revision\/latest?cb=20191216025147",
      "effects": [
        "Ability Target Area",
        "Affects Enemies \/ Self",
        "Damage Pure"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. Available in Ability Draft.",
        "If Aghanim's Scepter is acquired before Chakram was learned, this Chakram will be at level 1.",
        "The level of this Chakram scales with the level of the main Chakram.",
        "This Chakram is fully equivalent to the main Chakram. Two Chakrams act independently.",
        "This Chakram uses a separate slow modifier that fully stacks with that of the main Chakram.",
        "Timbersaw is disarmed if either Chakram is out."
      ],
      "mana": "80\/140\/200",
      "hotKey": "D",
      "cooldown": "8 (TagTalent 7.04)",
      "description": "Fires a secondary saw blade at the target location where it will spin in place, dealing damage in an area around it. Additionally, for each 5% of health missing, enemies caught in the saw blade move more slowly. The blade deals damage and cuts down trees in its path when fired and retracted. While active the ability costs mana, and you lose the ability to attack.",
      "spellName": "Second Chakram",
      "params": [
        "Cast Animation: 0.15+0",
        "Cast Range: 1200",
        "Effect Radius: 200",
        "Pass Damage: 100\/140\/180",
        "Damage per Second: 50\/75\/100",
        "Move Speed Slow per 5% Max Health Missing: 5%",
        "Mana Cost per Second: 16\/23\/30",
        "Aura Linger Duration: 0.5",
        "Passing Slow Duration: 0.5",
        "Slow persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Cut cut cut cut cut cut cut cut cut cut cut!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d0\/Timbersaw_Return_Chakram.mp3\/revision\/latest?cb=20191216025151",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Second Chakram until the blue Chakram has fully returned to Timbersaw.",
        "Does not interrupt Timbersaw's channeling spells upon cast."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Returns the Chakram to Timbersaw.",
      "spellName": "Return Chakram (Aghanim's Scepter)",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Timbersaw_Flamethrower_1.mp3\/revision\/latest?cb=20210103154315",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Interrupts Timbersaw's channeling spells upon cast.",
        "The complete area is shaped like a cone.",
        "Applies the fire debuff within the area in 0.1-second intervals, starting immediately upon cast, resulting in 71 instances.",
        "The debuff deals 45 damage in 0.5-second intervals, starting immediately upon getting placed, resulting in a minimum of 7 instances. Can apply up to 21 damage instances if an enemy stands within the flames for the whole duration",
        "Can apply up to 21 damage instances if an enemy stands within the flames for the whole duration",
        "Can deal at least 315 damage, considering the minimum duration (before reductions). Can deal a total 945 damage if an enemy stands within the flames for the whole duration (before reductions).",
        "Can deal a total 945 damage if an enemy stands within the flames for the whole duration (before reductions).",
        "Any tree within the area of effect is set on fire, and gets destroyed 5 seconds afterwards.",
        "Provides 175 radius non-lingering ground vision 400 range in front of Timbersaw for the duration."
      ],
      "mana": "100",
      "hotKey": "F",
      "cooldown": "15 (TagTalent 13.2)",
      "description": "Releases a 275 width flame that extends 400 range in the direction Timbersaw is facing. Applies a debuff that deals 90 damage per second and slows by 30%. Lasts 7 seconds. Debuff lingers for 3 seconds.",
      "spellName": "Flamethrower",
      "params": [
        "Cast Animation: 0+0",
        "Flame Starting Width: 0",
        "Flame Length: 400",
        "Flame End Width: 275",
        "Damage per Second: 90",
        "Move Speed Slow: 30%",
        "Tree Destruction Delay: 5",
        "Debuff Duration: 3",
        "Flamethrower Duration: 7"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Timbersaw_Chakram_1.mp3\/revision\/latest?cb=20191216025147",
      "effects": [
        "Ability Target Area",
        "Affects Enemies \/ Self",
        "Damage Pure"
      ],
      "notes": [
        "The Chakram travels at a speed of 900. Disarms Timbersaw as soon as the Chakram is launched, until the Chakram fully returns to Timbersaw. While traveling towards the target point, the blade deals pass damage and slow on enemy units within range once. Upon reaching the target area, the Chakram starts draining mana, dealing damage over time, and applying a slow aura. Drains 8\/11.5\/15 mana in 0.5 second intervals, starting 0.5 seconds after reaching the target area. Deals 25\/37.5\/50 damage (before reductions) in 0.5 second intervals, starting 0.5 seconds after reaching the target area. The Chakram stops draining mana and dealing damage over time as soon as it starts to return. While returning, the Chakram deals the pass damage to nearby units again and slows enemy units by placing a debuff again. The slow from passing (in both directions) lasts 0.5 seconds. The slow debuff from the aura while stationary lingers for 0.5 seconds. The slow debuff from passing and from the stationary aura are the same. However, the former is dispellable, the latter is not. A passing Chakram first applies the passing damage, then the debuff.",
        "Disarms Timbersaw as soon as the Chakram is launched, until the Chakram fully returns to Timbersaw.",
        "While traveling towards the target point, the blade deals pass damage and slow on enemy units within range once.",
        "Upon reaching the target area, the Chakram starts draining mana, dealing damage over time, and applying a slow aura.",
        "Drains 8\/11.5\/15 mana in 0.5 second intervals, starting 0.5 seconds after reaching the target area.",
        "Deals 25\/37.5\/50 damage (before reductions) in 0.5 second intervals, starting 0.5 seconds after reaching the target area.",
        "The Chakram stops draining mana and dealing damage over time as soon as it starts to return.",
        "While returning, the Chakram deals the pass damage to nearby units again and slows enemy units by placing a debuff again.",
        "The slow from passing (in both directions) lasts 0.5 seconds. The slow debuff from the aura while stationary lingers for 0.5 seconds.",
        "The slow debuff from passing and from the stationary aura are the same. However, the former is dispellable, the latter is not.",
        "A passing Chakram first applies the passing damage, then the debuff.",
        "The Chakram returns to Timbersaw upon using Return Chakram or automatically if it gets more than 2000 range away.",
        "The first 5% movement speed slow are applied at 100%–96% health, so it can slow for up to 100% when between 1% and 5% health.",
        "Pass damage may only damage the same unit once when flying towards the targeted point, and once again when returning.",
        "Applies damage before debuff.",
        "The slows of multiple same Chakrams (multiple orange or blue Chakrams) do not stack.",
        "The slows of two different Chakrams (orange with blue Chakrams) use a separate slow modifier that fully stack.",
        "Chakram provides 300 radius flying vision while spinning in place at the target area (but not while traveling)."
      ],
      "mana": "80\/140\/200",
      "hotKey": "R",
      "cooldown": "8 (TagTalent 7.04)",
      "description": "Fires your main saw blade at the target location where it will spin in place, dealing damage in an area around it. Enemies caught in the saw blade will move more slowly for every 5% of health missing. The blade deals damage and cuts down trees in its path when fired and retracted. While active the ability costs mana, and you lose the ability to attack.",
      "spellName": "Chakram",
      "params": [
        "Cast Animation: 0.15+0",
        "Cast Range: 1200",
        "Effect Radius: 200",
        "Pass Damage: 100\/140\/180",
        "Damage per Second: 50\/75\/100",
        "Move Speed Slow per 5% Max Health Missing: 5%",
        "Mana Cost per Second: 16\/23\/30",
        "Aura Linger Duration: 0.5",
        "Passing Slow Duration: 0.5",
        "Grants a new ability: Second Chakram.",
        "Grants a new ability: Flamethrower.",
        "Slow persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "The ultimate in anti-flora weaponry."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d0\/Timbersaw_Return_Chakram.mp3\/revision\/latest?cb=20191216025151",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Chakram until the orange Chakram has fully returned to Timbersaw.",
        "Does not interrupt Timbersaw's channeling spells upon cast."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Returns the Chakram to Timbersaw.",
      "spellName": "Return Chakram",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 24.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Rizzrack, the Timbersaw, is a melee strength hero that excels in dealing damage and causing destruction in large areas. His effectiveness is highly dependent on the presence of trees in the surrounding environment, as they can amplify the damage of his spells and allow him to escape and chase easily. He is not naturally very durable, having relatively low health for a strength hero and almost nonexistent armor from the start of the game, but becomes far more resilient when he has been repeatedly attacked due to his Reactive Armor, providing him both with a hefty amount of armor and regeneration. This can make him a huge nuisance to deal with in the early and midgame, when spell damage output is low from enemies and they are reliant on physical attacks to harass him. His three active abilities all have very low cooldowns and the capacity to deal pure damage, which is not reduced by magic resistance or armor, making him a very destructive hero if left to his own devices. Whirling Death deals damage to enemies in a small area around him, and will deal bonus damage if trees were cut down with its usage; it also lowers the primary attributes of the afflicted, being especially effective against enemy strength heroes as they lose a portion of their maximum health pool. Timber Chain serves as a multipurpose mobility and damage spell, allowing him to quickly close distant gaps between himself and enemies and escape, but requires a tree to latch onto. Finally his ultimate, Chakram, can deal considerable pure damage and slow all at a very low cooldown, but can be difficult to land. With proper positioning and timing, he can cause massive damage to multiple enemies all the while debilitating their attributes and movement.",
  "history": "Rizzrack could still hear the screams in his mind. He worked, frantically turning wrenches, twisting screws, building and carving and forging. Sleep eluded him; he only built. Months had passed since he had shut himself in his uncle's workshop, and his deliverance was nearly complete. He rubbed his back as his eyes drifted shut, and saw a blanket of flowers floating on the placid waves of Augury Bay before exploding into a cloud of pollen that silenced lives as it seized the lungs. He woke with a choking start. For hours the rhythmic sound of a whetstone filled the shop as he sharpened a set of massive blades, his mind filled with images of strangling vines garroting neighbors, enwrapping homes. The flooding of Augury Bay had been nothing compared to the violent horrors the waters left to take root beyond the city walls. But the saw-suit would make him strong and safe he thought, allowing himself this sliver of hope before the full might of his fear crashed into his fading mind. Branches and blood. When the city fell, Rizzrack fled trees that walked, and fought, and killed. Trees had shattered the gates and swarmed into the city. Trees had crushed and thrashed and stomped the last that Augury Bay could muster in defense, and stalked the few fleeing refugees. In addled silence Rizzrack unspooled the thick chain from the suit's arm, his hands quaking as he inspected each link and ran a trembling finger along the claw attached at its end. The saw-suit was ready. With his hand trembling he sparked the bladed machine to life. Terror drove him, terror of what awaited him and of what he would have to face to have any hope of calming his mind. As the saw-suit shuddered to life he knew he must face this fear, and he knew he wouldn't like it one bit.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1125 Timber Chain Range",
      "talentRight": "+10% Whirling Death Attribute Reduction"
    },
    {
      "talentLvl": "20",
      "talentLeft": "12% Cooldown Reduction",
      "talentRight": "+16 Strength"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+8 Reactive Armor Stacks",
      "talentRight": "+8% Spell Amplification"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1.5 Mana Regen",
      "talentRight": "+200 Health"
    }
  ]
}