{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Bloodstone_Bloodpact.mp3\/revision\/latest?cb=20191227195357",
      "effects": [
        "Расход текущего здоровья: 10%",
        "Множитель вампиризма заклинаний: 2,5",
        "Длительность: 6"
      ],
      "notes": [
        "Прерывает прерываемые способности заклинателя при применения.",
        "Применение наносит владельцу чистый урон, отмеченный в качестве отнимающего здоровья, поэтому он не провоцирует эффекты, срабатывающие при получении урона.",
        "Увеличивает вампиризм заклинаний от Bloodstone до 75% против героев и до 15% против крипов.",
        "Восстановление маны основано на итоговом значении вылеченного здоровья при помощи вампиризма заклинаний, включая бонусы. Вопреки описанию в игре По окончании эффекта превращает ту же долю нанесённого урона в ману., мана восстанавливается сразу после нанесения урона и излечения от него, а не после окончания действия эффекта. Это значит, что манипуляция вампиризмом заклинаний также будет влиять на количество восстанавливаемой маны. Восстановление маны также подвержено манипуляции восстановлением маны. Если здоровье заклинателя полное, он все равно будет восстанавливать ману в полном объёме.",
        "Вопреки описанию в игре По окончании эффекта превращает ту же долю нанесённого урона в ману., мана восстанавливается сразу после нанесения урона и излечения от него, а не после окончания действия эффекта.",
        "Это значит, что манипуляция вампиризмом заклинаний также будет влиять на количество восстанавливаемой маны.",
        "Восстановление маны также подвержено манипуляции восстановлением маны.",
        "Если здоровье заклинателя полное, он все равно будет восстанавливать ману в полном объёме.",
        "Не накладывает эффект, если он уже был под его действием в последние 30 секунд. При нажатии во время утомления расходует здоровье и уходит на перезарядку, эффект утомления не продлевается. Нажатие Alt на иконку эффекта отобразит, сколько времени герой не будет получать бонусов от использования Bloodstone. Длительность эффекта устанавливается при использовании способности и подвержена манипуляцией перезарядкой.",
        "При нажатии во время утомления расходует здоровье и уходит на перезарядку, эффект утомления не продлевается.",
        "Нажатие Alt на иконку эффекта отобразит, сколько времени герой не будет получать бонусов от использования Bloodstone.",
        "Длительность эффекта устанавливается при использовании способности и подвержена манипуляцией перезарядкой."
      ],
      "mana": null,
      "abilityName": "Bloodpact",
      "cooldown": null,
      "description": "Расходует 10% от текущего здоровья, чтобы временно удвоить вампиризм заклинаниями от этого предмета. Восстанавливает ману в размере нанесённого урона. Длительность: 6 сек.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4400",
  "lore": null,
  "consistFrom": [
    "Voodoo Mask",
    "Soul Booster",
    "Recipe"
  ],
  "name": "Bloodstone",
  "description": "Багрянец этого камня легко приметить даже в разгаре битвы: он будто бы наделяет владельца безграничными жизненными и духовными силами.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}