{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Ward.mp3\/revision\/latest?cb=20141214193617",
      "effects": [
        "Дальность применения: 500",
        "Радиус обзора: 1400",
        "Атак для разрушения героем: 2",
        "Атак для разрушения не-героем: 8",
        "Прирост золота в минуту: 4",
        "Прирост опыта в минуту: 6",
        "Длительность: 360"
      ],
      "notes": [
        "Даёт наземный обзор в радиусе 1400 вокруг себя.",
        "Нельзя поставить внутри области фонтана (включая маленькую область перед подъёмом на базу), или в логове Рошана.",
        "Observer Ward нельзя передать курьеру или духу-медведю с зажатой клавишей Ctrl.",
        "Перед установкой варда отображаются области появления нейтральных крипов, позволяя заблокировать лагеря.",
        "Также отображаются радиусы уже установленных вардов, показывая возможные области пересечения.",
        "При выборе варда, в пространстве и на мини-карте появляется множество индикаторов. Курсор выбора отображает вард с зелёным кругом вокруг него. Круг показывает дальность обзора. Мини-карта подсвечивает жёлтую область, показывая возможное раскрытие области при установке варда в конкретную точку. Жёлтая маркировка учитывает деревья и высоту ландшафта вокруг области.",
        "Курсор выбора отображает вард с зелёным кругом вокруг него. Круг показывает дальность обзора.",
        "Мини-карта подсвечивает жёлтую область, показывая возможное раскрытие области при установке варда в конкретную точку.",
        "Жёлтая маркировка учитывает деревья и высоту ландшафта вокруг области.",
        "Награда за вард увеличивается на 1 золото каждые 15 секунд и на 1 единицу опыта каждые 10 секунд.",
        "Иллюзии и крипы-герои считаются за крипа при атаке варда, поэтому им нужно совершить 8 атак для уничтожения вместо 2 для героев."
      ],
      "mana": null,
      "abilityName": "Plant",
      "cooldown": null,
      "description": "Устанавливает невидимый тотем наблюдения, который даёт наземный обзор в радиусе 1400. Действует 6 мин. Можно передать один вард союзному герою, зажав клавишу Ctrl.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Время исчезновения: 0"
      ],
      "notes": [
        "Способность и модификатор не отображаются в игре."
      ],
      "mana": null,
      "abilityName": "Невидимость",
      "cooldown": null,
      "description": "Этот юнит всегда невидим.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складывается c другими Observer Ward и с Sentry Ward в инвентаре без ограничения. Стоимость продажи зависит от их количества. Варды от разных игроков объединяются.",
    "Варды от разных игроков объединяются.",
    "Observer Ward не раскрывает невидимость.",
    "Уничтожение Observer Ward отображается в уведомлениях чата для союзников.",
    "Награда в виде золота за Observer Ward даётся тому игроку, который купил и поставил источник раскрытия невидимости. В случае с Gem of True Sight и Sentry Ward, золото получает игрок, который их купил. Если Gem of True Sight или Sentry Ward были украдены у врага, то золото получает игрок, который имеет украденный Gem of True Sight или Sentry Ward. В случае со способностями Lightning Bolt, Thundergod's Wrath и Rocket Flare, золото получает заклинатель. В случае со способностями Chronosphere, Kinetic Field и Aether Remnant, золото получает игрок, уничтоживший вард.",
    "В случае с Gem of True Sight и Sentry Ward, золото получает игрок, который их купил.",
    "Если Gem of True Sight или Sentry Ward были украдены у врага, то золото получает игрок, который имеет украденный Gem of True Sight или Sentry Ward.",
    "В случае со способностями Lightning Bolt, Thundergod's Wrath и Rocket Flare, золото получает заклинатель.",
    "В случае со способностями Chronosphere, Kinetic Field и Aether Remnant, золото получает игрок, уничтоживший вард.",
    "Существам ближнего боя даётся дополнительно 150 к дальности атаки при атаке Observer Ward.",
    "Герой, купивший Observer Ward, может атаковать его в любой момент независимо от того, можно ли добить вард. Observer Ward получает по 10 урона, если его здоровье выше 50.",
    "Observer Ward получает по 10 урона, если его здоровье выше 50."
  ],
  "cost": "0",
  "lore": null,
  "consistFrom": null,
  "name": "Observer Ward",
  "description": "Вид полуразумного растения, который часто разводят начинающие волшебники.",
  "trivia": null,
  "upgradeIn": [
    "Варды"
  ],
  "tips": null
}