{"abilities":[{"spell":"Releases a wave of energetic plasma that grows in power as it expands, but also zaps on contraction, slowing and dealing damage to enemy units caught in its path. Damage and slow increases with distance from Razor. The Plasma Field hits each unit twice, once each direction.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Plasma Field interrupts Razor's channeling spells upon cast.","Plasma Field expands and retracts at a speed of 636, taking 1.1 seconds to fully expand.","The damage and slow are applied upon expanding and upon retracting, so each enemy can be hit twice. The slow debuff fully stacks.","Plasma Field's effect area is actually a 200 radius ring, which is right in front of the actual visible ring.","This means that upon cast, it instantly hits units within 200 radius and can hit units up to 900 range away.","So upon expanding, the effects hits 200 range before the visible ring hits, and upon retracting, the effects hits after the ring passed the units already.","Plasma Field is centered on and follows Razor.","Plasma Field provides 700 radius flying vision during the 2.2 second effect, following Razor and leaving a trail of vision which lasts 2 seconds."],"mana":"125","elements":["Does not pierce spell immunity."],"cooldown":"14","name":"Plasma Field","description":["Cast Animation: 0+0","Max Extension Radius: 700","Damage Width: 200","Minimum Damage: 15\/25\/35\/45","Maximum Damage: 80\/115\/150\/185","Minimum Movement Speed Slow: 5%","Maximum Movement Speed Slow: 25%\/30%\/35%\/40%","Slow Duration: 1.5"],"hot_key":"Q","legacy_key":"F"},{"spell":"Creates a charged link between Razor and an enemy Hero, stealing damage from the target and giving it to Razor. Causes Razor to continuously attack the linked target, even while moving. Razor cannot attack other units during this time.","effects":["Ability Target Unit","Affects Enemy Heroes \/ Self","Damage Instant Attack"],"notes":["Static Link is broken when either unit dies or the link gets stretched more than 800 range. Nothing else can break the link.","Static Link keeps stealing damage even if the target's damage has reached 0.","The distance between Razor and the target is checked right before each damage steal interval. If the distance is greater upon check, the link breaks.","Static Link provides shared vision over the target while draining.","Drains 1.75\/3\/4.25\/5.5 ( 3.25\/4.5\/5.75\/7) damage in 0.25 second intervals, starting 0.25 seconds after cast, resulting in 20\/24\/28\/32 instances.","Can steal up to 35\/72\/119\/176 ( 65\/108\/161\/224) damage when draining for the full duration.","While linked, Razor performs instant attacks on the target, using his current attack speed as interval. These instant attacks are allowed to use attack modifiers and trigger any on-attack effects normally. These instant attacks ignore disarms, but have no True Strike.","Razor is disarmed while draining, so that he cannot attack other targets in the meantime.","Can be cast on heroes, illusions and creep-heroes.","Multiple casts of Static Link stack with each other, each cast placing its own debuff on the target and buff on Razor. However, the vision modifier does not stack. It disappears as soon as the first link ends."],"mana":"65","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"40\/35\/30\/25","name":"Static Link","description":["Cast Animation: 0.3+0","Cast Range: 550","Link Break Distance Buffer: 250","Attack Damage Stolen per Second: 7\/12\/17\/22 ( 13\/18\/23\/28)","Link Duration: 5\/6\/7\/8","Buff Duration: 18"],"hot_key":"W","legacy_key":"C"},{"spell":"Passively increases the movement speed for you and your allied heroes. Has double the effect on your hero.","effects":["Ability Aura","Affects Allied Heroes"],"notes":["The aura's buff lingers for 0.5 seconds."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Storm Surge","description":["Radius: 1200","Ally Movement Speed Bonus: 3%\/5%\/7%\/9%","Self Movement Speed Bonus: 6%\/10%\/14%\/18%","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"N"},{"spell":"A powerful lightning storm strikes out at enemy units with the lowest health, dealing damage and reducing their armor. Additionally, shocks every unit within a 500 radius of Razor.","effects":["Ability No Target \/ Passive","Affects Enemies","Damage Physical \/ Magical"],"notes":["Interrupts Razor's channeling spells upon cast.","Eye of the Storm always targets the unit with the lowest current health in range first. If there are multiple units with the same lowest health in range, Eye of the Storm chooses between them randomly. The storm prioritizes enemies which have the Static Link Vision modifier on them, striking them over any other unit when within range, regardless of health values. When there are multiple enemies with the Static Link Vision modifier within strike range, the storm chooses between them randomly on each strike. When upgraded, only one of the strikes will hit the enemy with the Static Link vision modifier. The strikes can never hit the same target at the same time. If two enemies have the Static Link vision modifier, one strike goes for one of them and the other strike goes for the other.","The armor reduction debuff on units lasts as long as the storm, or until Razor dies.","The strikes first deal their damage and then apply the armor reduction.","The strikes are not regular attacks, so they fully ignore effects such as evasion and Damage Block. This also means that they cannot trigger the on-attack effects of Counter Helix, Moment of Courage and Reactive Armor or break enemy Tranquil Boots.","Does not affect couriers, Roshan, invisible units and units in the Fog of War.","Aghanim's Scepter upgraded Eye of the Storm does not lower the armor of buildings.","Aghanim's Scepter upgraded Eye of the Storm always prioritizes units over buildings and fully ignores filler buildings.","Eye of the Storm can strike up to 42\/50\/60 ( 50\/60\/75) times and deal up to 1680\/2750\/4200 ( 2000\/3300\/5250) damage (before reductions).","When Razor turns invisible, the whole storm and its strike turn invisible as well, but still strike nearby enemies without them seeing or hearing them.","Eye of the Storm immediately ends when Razor dies.","The damage does not happen instantly when triggered, but is delayed by 0.3 seconds. Once triggered, the area damage will happen, even if there is no enemy within the area anymore.","Triggers regardless of Razor's current status. It triggers even when disabled or when invisible.","On average, deals 20\/33.33\/46.67 ( 86.67\/100\/113.33) damage per second, if continuously triggered.","Triggers on invisible enemies or enemies inside the fog of war as well."],"mana":"100\/150\/200","elements":["Cannot be used by illusions.","Disabled by Break.","Partially pierces spell immunity."],"cooldown":"80\/70\/60","name":"Eye of the Storm","description":["Cast Animation: 0+0","Active\/Passive Radius: 500","Passive Damage: 60\/100\/140 ( 260\/300\/340)","Passive Damage Delay: 0.3","Passive Damage Interval: 3","Active Number of Targets: 1 ( 2)","Active Strike Interval: 0.7\/0.6\/0.5 ( 0.6\/0.5\/0.4)","Active Damage per Strike: 40\/55\/70","Active Armor Reduction per Strike: 1","Active Duration: 30"],"hot_key":"R","legacy_key":"E"}],"bio":"Among the emblematic powers that populate the Underscape, Razor the Lightning Revenant is one of the most feared. With his whip of lightning, he patrols the Narrow Maze, that treacherous webwork of passages by which the souls of the dead are sorted according to their own innate intelligence, cunning and persistence. Drifting above the Maze, Razor looks down on the baffled souls below, and delivers jolts of scalding electricity that both punish and quicken the souls as they decide their own fates, hurrying on toward luminous exits or endlessly dark pits. Razor is the eternal embodiment of a dominating power, abstract and almost clinical in his application of power. Yet he has a lordly air that suggests he takes a sardonic satisfaction in his work.","talentsTips":["The agility talent effectively grants Razor 1.6 armor, 10 attack speed, 0.5% movement speed and 10 attack damage.","The health talent increases maximum health capacity, and keeps the current health percentage.","The strength talent effectively grants Razor 240 health, 1.2 health regen and 0.96% magic resistance.","The armor talent does not benefit illusions."],"trivia":["Razor's alternate\/fun name was Gillette, which is also the name of a reputable brand of shaving razors.","Razor's attack response \"Ride the Lightning!\" is also the name of a Metallica's album and song (which references execution via electric chair).","Razor's response upon picking the Aegis of the Immortal \"There is a lightning that never goes out.\" is a reference to a song \"There is a light that never goes out\" by The Smiths.","Razor's response \"Conduct me where you will.\" is also a line said by Scrooge in A Christmas Carol."],"talents":["+200 Eye of the Storm Passive Damage:+100 Attack Speed","-0.1 Eye of the Storm Strike Interval:+10 Armor","+12 Strength:+6 Static Link Damage Steal","+10 Agility:+225 Health"],"desc":"Razor, the Lightning Revenant, is a ranged agility hero who works as a position-based tank\/carry that employs his abilities to deal massive damage in a relatively short amount of time, chase down the fleeing injured with his speed, and inflict debuffs on more powerful foes. Razor prefers to keep his position or kite his enemies allowing his spells to unleash its full potential. Known for being a great anti-carry hero, Razor specializes in using his opponent's own powers against them, draining them of their damage and using it to smite them, as well as damaging, slowing, and dispelling them of buffs should they stay too close to him. His ultimate, Eye of the Storm, further enhances his carry-killing powers by inflicting constant, armor-shattering, lightning strikes on the foe with the lowest HP within a 500 radius. For those who rely on their pure brute force alone to fight, there is truly no escape from the Underscape."}