{"abilities":[{"spell":"Герой высвобождает волну энергетической плазмы, которая затем возвращается к нему. Волна замедляет врагов и наносит им урон: чем дальше она от владельца, тем замедление и урон сильнее. Волна наносит урон дважды, при движении в обе стороны.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Plasma Field прерывает произносимые способности Razor.","Plasma Field расширяется и сужается со скоростью 636 единиц; требуется 1,1 секунды для достижения максимального радиуса.","Урон и замедление применяются при расширении и возвращении волны, поэтому способность может поразить каждого врага дважды. Дебафф замедления складывается.","Площадь поражения Plasma Field представляет собой кольцо радиусом в 200 единиц, находящееся прямо перед видимым кольцом.","То есть при использовании способность мгновенно поражает существ в радиусе 200 единиц и может задеть существ на расстоянии до 900 единиц.","После расширения эффект наносится в области 200 до того, как видимое кольцо поразит цели; при возвращении эффект применяется после прохождения сквозь существ.","Plasma Field закреплена на герое и будет перемещаться вместе с ним.","Plasma Field дает летающий обзор в радиусе 700 единиц на 2,2 секунды, следуя за героем и оставляя след обзора, который длится 2 секунды."],"mana":"125","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14","name":"Plasma Field","description":["Анимация применения: 0+0","Радиус: 700","Ширина урона: 200","Минимальный урон: 15\/25\/35\/45","Максимальный урон: 80\/115\/150\/185","Мин. замедление скорости передвижения: 5%","Макс. замедление скорости передвижения: 25%\/30%\/35%\/40%","Длительность замедления: 1,5"],"hot_key":"Q","legacy_key":"F"},{"spell":"Создаёт электрическую связь с выбранным вражеским героем, передавая его урон от атак владельцу способности. Он автоматически атакует связанную жертву даже в движении, но не может атаковать других существ.","effects":["Способность Направленная на юнита","Действует на Вражеских героев \/ Себя","Урон Мгновенная атака"],"notes":["Static Link разрывается, если существо под действием способности умирает или расстояние от него до Razor превышает 800. Никакие другие способы не смогут разорвать связь.","Static Link продолжит похищать урон, даже если урон цели достиг 0.","Расстояние между Razor и целью проверяется перед каждым интервалом кражи урона. Если расстояние превышено при проверке, связь порвется.","Static Link дает общий обзор на цель при похищении урона.","Вытягивает 1,75\/3,5\/5,25\/7 ( 3,25\/5\/6,75\/8,5) урона с интервалом в 0,25 секунды спустя 0,25 секунды после применения, срабатывая 32 раз.","Крадет до Ошибка Lua в Модуль:Calculate на строке 63: bad argument #2 to 'gsub' (string\/function\/table expected). ( Ошибка Lua в Модуль:Calculate на строке 63: bad argument #2 to 'gsub' (string\/function\/table expected).) урона в случае, если его вытягивали всю длительность способности.","Пока действует связь, Razor совершает мгновенные атаки по цели, используя свою текущую скорость атаки в качестве интервала. На атаки могут сработать любые модификаторы атаки и эффекты, срабатывающие при атаках. Атаки игнорируют обезоруживание, но не имеют эффекта True Strike.","Во время связи Razor обезоружен и не может атаковать другие цели.","Можно применять на героев, иллюзии и крипов-героев.","Несколько применений Static Link действуют отдельно друг от друга, размещая за каждое применение дебафф на цель и бафф на Razor. При этом модификатор обзора не складывается. Он исчезнет, как только закончится первая связь."],"mana":"65","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"40\/35\/30\/25","name":"Static Link","description":["Анимация применения: 0,3+0","Дальность применения: 550","Доп. расстояние до разрыва: 250","Скорость похищения урона: 7\/14\/21\/28 ( 13\/20\/27\/34)","Длительность связи: 8","Длительность эффекта: 18"],"hot_key":"W","legacy_key":"C"},{"spell":"Пассивно увеличивает скорость передвижения как себе, так и союзникам. На владельца способности действует вдвое сильнее.","effects":["Способность Аура","Действует на Союзных героев"],"notes":["Бафф ауры задерживается на 0.5 секунды."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Storm Surge","description":["Радиус: 1200","Доп. скорость передвижения: 3%\/5%\/7%\/9%","Доп. скорость передвижения себе: 6%\/10%\/14%\/18%","Длительность задержки ауры: 0.5"],"hot_key":"E","legacy_key":"N"},{"spell":"Собирает над героем грозовую тучу, которая бьёт молнией врага с наименьшим здоровьем, нанося ему урон и уменьшая его броню. Помимо этого, способность пассивно поражает каждого врага в радиусе 500.","effects":["Способность Ненаправленная \/ Пассивная","Действует на Врагов","Урон Физический \/ Магический"],"notes":["При применении прерывает произносимые заклинания Razor.","Eye of the Storm всегда выбирает первой целью существо с наименьшим текущим здоровьем в области действия. Если в области действия несколько существ с одинаково низким здоровьем, то Eye of the Storm выберет среди них цель случайно. Способность отдает приоритет врагам под действием модификатора обзора от Static Link, поражая их в первую очередь (даже при наличии других существ в радиусе действия), независимо от значения здоровья. При наличии в радиусе действия нескольких врагов под действием модификатора обзора от Static Link способность будет случайно выбирать между ними при каждом ударе. При улучшении только одна молния будет бить цель под модификатором Static Link. Молнии не поражают одновременно одну и ту же цель. Если у двух врагов присутствует модификатор Static Link, то каждая молния будет бить свою цель.","Дебафф снижения брони длится столько же, сколько и сама способность, либо до смерти Razor.","Разряды сначала наносят урон, после чего накладывают снижение брони.","Разряды не являются обычными атаками, поэтому они игнорируют уклонение и блокировку урона. Также они не могут активировать эффекты, срабатывающие от удара ( Counter Helix, Moment of Courage и Reactive Armor) и не сбрасывает перезарядку Tranquil Boots.","Не действует на курьеров, Рошана, невидимых существ и существ в тумане войны.","Eye of the Storm, улучшенный Aghanim's Scepter, не снижает броню строений.","Eye of the Storm, улучшенный Aghanim's Scepter, при атаках отдает приоритет существам вместо строений, но игнорирует постройки.","Eye of the Storm может ударить до 42\/50\/60 ( 50\/60\/75) раз и нанести до 1680\/2750\/4200 ( 2000\/3300\/5250) единиц урона (до уменьшений).","Когда Razor становится невидимым, туча и молнии от нее становятся невидимыми вместе с ним, но продолжают бить по ближайшим врагам, не становясь видимыми или слышимыми для них.","Eye of the Storm мгновенно заканчивается при смерти Razor.","Урон наносится не сразу, а спустя 0.3 секунды. При срабатывании наносится урон по области, даже если поблизости уже нет врагов.","Срабатывание не связано с текущим состоянием Razor. Срабатывает даже при обезвреживании или невидимости героя.","В среднем наносит 20\/33,33\/46,67 ( 86,67\/100\/113,33) урона в секунду при постоянном срабатывании.","Также срабатывает на невидимыъ существах и существам в тумане войны."],"mana":"100\/150\/200","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"80\/70\/60","name":"Eye of the Storm","description":["Анимация применения: 0+0","Радиус: 500","Пассивный урон: 60\/100\/140 ( 260\/300\/340)","Задержка урона (пассивно): 0.3","Интервал урона (пассивно): 3","Число целей (активно): 1 ( 2)","Интервал ударов (активно): 0.7\/0.6\/0.5 ( 0,6\/0,5\/0,4)","Урона за удар (активно): 40\/55\/70","Снижение брони за удар (активно): 1","Длительность (активно): 30"],"hot_key":"R","legacy_key":"E"}],"bio":"Никто из легендарных обитателей загробного мира не внушает такой страх, как призрак молний. Держа наготове свою молниеносную плеть, он охраняет порядок в Узком лабиринте, коварные и cпутанные коридоры которого направляют мёртвые души к судьбе, достойной их ума, способностей и упорства. Надзиратель парит над лабиринтом, выискивает замешкавшихся и стегает их обжигающим электрическим хлыстом. Судьба душ вершится их же руками, а разряды молний лишь подгоняют их либо к свету в конце тоннеля, либо к тёмным пучинам вечности. Беспристрастный и почти безразличный в применении силы призрак молний — извечное воплощение господства. Однако по его высокомерным манерам можно догадаться, что он получает от работы сардоническое удовольствие.","talentsTips":["Талант на ловкость в общем даёт Razor: 1,6 брони, 10 скорости атаки, 0,5% скорости передвижения и 10 урона от атаки.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на силу в общем даёт Razor: 240 здоровья, 1,2 регенерации здоровья и 0,96% сопротивления магии.","Талант на броню не дается иллюзиям."],"trivia":["Альтернативное имя Razor было Gillette, что является известным брендом бритв и лезвий.","Фраза \"Ride The Lightning\" возможно является отсылкой к песне метал-группы Metallica из одноимённого альбома."],"talents":["+200 к пассивному урону от Eye of the Storm:+100 к скорости атаки","-0.1 сек. интервала разрядов Eye of the Storm:+10 к броне","+12 к силе:+6 к урону в секунду у Static Link","+10 к ловкости:+225 к здоровью"],"desc":"Razor — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Он имеет четыре способности, три из которых активные и одна пассивная. Его первая способность, Plasma Field, высвобождает волну энергетической плазмы, которая усиливается по мере ее увеличения, но ослабевает по мере уменьшения, нанося урон всем врагам на своем пути, а также замедляя их. Урон, как и замедление, увеличивается прямо пропорционально расстоянию от волны до героя. Вторая способность, Static Link, создает электрическое соединение между героем и врагом, воруя урон от атак у цели и передавая его герою. Пассивная способность, Ошибка Lua в Модуль:Ability_ID на строке 45: Не найдено данных Cargo для \"Unstable Current\"., дает дополнительную скорость передвижения; каждые несколько секунд Razor ударяет молнией всех находящихся поблизости противников, нанося им урон. Ультимативной способностью, Eye of the Storm, герой вызывает разрушительную грозу, которая бьет врагов с наименьшим здоровьем, нанося им урон и уменьшая их броню."}