{"abilities":[{"spell":"Высвобождает волну энергетической плазмы, которая затем возвращается, усиливаясь по мере движения. Волна замедляет врагов и наносит им урон при каждом прикосновении. Чем дальше волна от героя, тем сильнее замедление и больше урон.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Plasma Field прерывает произносимые способности Razor.","Plasma Field расширяется и сужается со скоростью 636 единиц; требуется 1,1 секунды для достижения максимального радиуса.","Урон и замедление применяются при расширении и возвращении волны, поэтому способность может поразить каждого врага дважды. Дебафф замедления складывается.","Площадь поражения Plasma Field представляет собой кольцо радиусом в 200 единиц, находящееся прямо перед видимым кольцом.","Это значит, что при использовании способность мгновенно поражает юнитов в радиусе 200 единиц и может поразить юнитов на расстоянии до 900 единиц.","После расширения эффект наносится в области 200 до того, как видимое кольцо поразит цели; после сужения эффект применяется после того, как кольцо пройдет сквозь юнитов.","Plasma Field закреплена на герое и будет перемещаться вместе с ним.","Plasma Field дает летающий обзор в радиусе 700 единиц на 2,2 секунды, следуя за героем и оставляя след обзора, который длится 2 секунды."],"mana":"125","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14","name":"Plasma Field","description":["Анимация применения: 0+0","Радиус: 700","Урон по ширине: 200","Минимальный урон: 15\/25\/35\/45","Максимальный урон: 80\/115\/150\/185","Мин. замедление скорости передвижения: 5%","Макс. замедление скорости передвижения: 25%\/30%\/35%\/40%","Длительность замедления: 1,5"],"hot_key":"Q","legacy_key":"F"},{"spell":"Создаёт электрическую связь с выбранным вражеским героем, передавая его урон от атак владельцу способности.","effects":["Способность Направленная на юнита","Действует на Вражеских героев \/ Себя"],"notes":["Static Link разрывается, если юнит под действием способности умирает или превышает расстояние дистанции разрыва. Никакие другие способы не смогут разорвать связь.","Static Link продолжит похищать урон, даже если у цели урон стал равен 0.","Расстояние между Razor и целью проверяется перед каждым интервалом кражи урона. Если расстояние превышено при проверке, связь порвется.","Static Link дает общий обзор на цель при похищении урона.","Вытягивает 1.75\/3.5\/5.25\/7 ( 3.5\/5.25\/7\/8.75) урона с интервалом в 0,25 секунды спустя 0,25 секунды после применения, срабатывая 32 раз.","Может украсть до 56\/112\/168\/224 ( 112\/168\/224\/280) урона в случае, если урон вытягивали всю длительность способности.","Можно применять на героев, иллюзии и крипов-героев.","Несколько применений Static Link действуют отдельно друг от друга, размещая за каждое применение дебафф на цель и бафф на Razor. При этом визуальный модификатор от нескольких Static Link не складывается. Модификатор исчезнет, как только закончится первая связь."],"mana":"65","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"40\/35\/30\/25","name":"Static Link","description":["Анимация применения: 0,3+0","Дальность применения: 550","Дистанция разрыва: 800","Похищение урона в секунду: 7\/14\/21\/28 ( 14\/21\/28\/35)","Длительность привязки: 8","Длительность эффекта: 18"],"hot_key":"W","legacy_key":"C"},{"spell":"Увеличивает скорость передвижения героя и раз в несколько секунд наносит урон всем противникам неподалёку.","effects":["Способность Пассивная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Урон не наносится мгновенно, а срабатывает спустя 0.3 секунды. После срабатывания урон по области все равно наносится, даже если в области врагов больше нет.","Поражает врагов вне зависимости от текущего состояния Razor. Способность срабатывает даже если герой обезврежен или находится в невидимости.","Также срабатывает на невидимых врагов или врагов в тумане войны.","Иконка способности отображает перезарядку после срабатывания. При этом она показывает перезарядку лишь для визуального информирования. То есть использование Refresher Orb не обновляет способность, хоть иконка и сбрасывает перезарядку. Также на способность не действует уменьшение перезарядки. Time Dilation и Chakra Magic визуально влияют на перезарядку, но фактически ничего не меняют."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Unstable Current","description":["Радиус: 500","Доп. скорость передвижения: 4%\/8%\/12%\/16% ( 8%\/12%\/16%\/20%)","Урон: 60\/80\/100\/120 ( 260\/280\/300\/320)","Задержка урона: 0.3","Интервал: 6\/5\/4\/3"],"hot_key":"E","legacy_key":"N"},{"spell":"Собирает над героем грозовую тучу, которая бьёт молнией врага с наименьшим здоровьем, нанося ему урон и уменьшая его броню.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Физический"],"notes":["Eye of the Storm всегда первым выбирает целью юнита с наименьшим количеством здоровья в области действия. Если в области действия несколько юнитов с одинаково низким уровнем здоровья, то Eye of the Storm будет отдавать приоритет ближайшему. Способность отдает приоритет врагам под действием модификатора обзора от Static Link, поражая их в первую очередь (даже при наличии других юнитов в радиусе действия), независимо от значения здоровья. При наличии в радиусе действия нескольких врагов под действием модификатора обзора от Static Link способность будет случайно выбирать между ними при каждом ударе.","Дебафф на снижение брони длится столько же, сколько и сама способность, либо до смерти Razor.","Разряды сначала наносят урон, после чего накладывают снижение брони.","Разряды не являются обычными атаками, поэтому они полностью игнорируют уклонение и блокирование урона. Также они не могут активировать эффекты, срабатывающие от удара ( Counter Helix, Moment of Courage и Reactive Armor) и не сбрасывает перезарядку Tranquil Boots.","Не работает на курьеров, Рошана, невидимых юнитов и юнитов в тумане войны.","Eye of the Storm, улучшенный Aghanim's Scepter, не снижает броню строений.","Eye of the Storm, улучшенный Aghanim's Scepter, при атаках отдает приоритет юнитам вместо строений, но полностью игнорирует постройки.","Eye of the Storm может ударять до 42\/50\/60 ( 50\/60\/75) раз и наносить до 1680\/2750\/4200 ( 2000\/3300\/5250) единиц урона (до учета сопротивления). При выборе таланта способность ударяет до 50\/60\/75 ( 60\/75\/100) раз и наносит до 2000\/3300\/5250 ( 2400\/4125\/7000) единиц урона (до учета сопротивления).","Когда Razor становится невидимым, туча и молнии от нее становятся невидимыми вместе с ним, но продолжают бить по ближайшим врагам, не становясь видимыми или слышимыми для них.","Eye of the Storm мгновенно заканчивается при смерти Razor."],"mana":"100\/150\/200","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"80\/70\/60","name":"Eye of the Storm","description":["Анимация применения: 0+0","Радиус: 500","Интервал ударов: 0.7\/0.6\/0.5 ( 0.6\/0.5\/0.4) ( 0.6\/0.5\/0.4, 0.5\/0.4\/0.3)","Урон за удар: 40\/55\/70","Снижение брони за удар: 1","Длительность: 30"],"hot_key":"R","legacy_key":"E"}],"bio":"Никто из легендарных обитателей загробного мира не внушает такой страх, как призрак молний. Держа наготове свою молниеносную плеть, он охраняет порядок в Узком лабиринте, коварные и cпутанные коридоры которого направляют мёртвые души к судьбе, достойной их ума, способностей и упорства. Надзиратель парит над лабиринтом, выискивает замешкавшихся и стегает их обжигающим электрическим хлыстом. Судьба душ вершится их же руками, а разряды молний лишь подгоняют их либо к свету в конце тоннеля, либо к тёмным пучинам вечности. Беспристрастный и почти безразличный в применении силы призрак молний — извечное воплощение господства. Однако по его высокомерным манерам можно догадаться, что он получает от работы сардоническое удовольствие.","talentsTips":["Талант на ловкость в общем даёт Razor: 2.4 брони, 15 скорости атаки, 0.75% скорости передвижения и 15 урона от атаки.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на броню не дается иллюзиям."],"trivia":["Альтернативное имя Razor было Gillette, что является известным брендом бритв и лезвий.","Фраза \"Ride The Lightning\" возможно является отсылкой к песне метал-группы Metallica из одноимённого альбома."],"talents":["+200 к урону от Unstable Current:+100 к скорости атаки","-0,1 сек. интервала разрядов Eye of the Storm:+10 к броне","+4% к скорости передвижения от Unstable Current:+7 к урону в секунду у Static Link","+15 к ловкости:+225 к здоровью"],"desc":"Razor — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Он имеет четыре способности, три из которых активные и одна пассивная. Его первая способность, Plasma Field, высвобождает волну энергетической плазмы, которая усиливается по мере ее увеличения, но ослабевает по мере уменьшения, нанося урон всем врагам на своем пути, а также замедляя их. Урон, как и замедление, увеличивается прямо пропорционально расстоянию от волны до героя. Вторая способность, Static Link, создает электрическое соединение между героем и врагом, воруя урон от атак у цели и передавая его герою. Пассивная способность, Unstable Current, дает дополнительную скорость передвижения; каждые несколько секунд Razor ударяет молнией всех находящихся поблизости противников, нанося им урон. Ультимативной способностью, Eye of the Storm, герой вызывает разрушительную грозу, которая бьет врагов с наименьшим здоровьем, нанося им урон и уменьшая их броню. Улучшение с Aghanim's Scepter снижает интервалы между ударами молнии, а также позволяет способности наносить урон башням, казармам и древним существам."}