{"abilities":[{"effects":["Lifesteal: 25%"],"notes":["Stacks additively with other sources of lifesteal.","Cannot lifesteal off of wards, buildings or allied units."],"elements":["Ability Passive","Affects Self"],"description":"Heals the attacker for 25% of attack damage dealt."},{"effects":["Lifesteal Bonus: 175%","Duration: 5"],"notes":["Interrupts the user's channeling spells upon cast.","Directly increases the lifesteal granted by its passive part by 175%, resulting in 200% lifesteal."],"elements":["Ability No Target","Affects Self"],"description":"Increases Lifesteal percentage to 200% for 5 seconds."}],"cost":"5300","description":"Immense power at the cost of your soul.","further":["Morbid_Mask","Claymore","Reaver"],"tips":["Satanic's active ability, Unholy Rage, has quite a short duration. If the enemy has many disables, it is recommended to get a Black King Bar first and use them together, or wait for the main disables to get used first and then join the fight.","Since lifesteal heals for the actual amount of damage dealt, attacking targets with low armor and damage reduction and\/or obtaining high amounts of attack damage can greatly increase the survivability in a fight. With high enough attack damage, one critical strike during Unholy Rage can potentially fully restore the user's health.","Missing an attack does not grant lifesteal. Consider a Monkey King Bar if an opponent has evasion.","Lifesteal is more efficient with defensive items that give Effective Hit Points like Armor, Damage Block, Evasion and Magic Resistance than items that only give HP."],"attrs":["Active Unholy Rage","Passive Lifesteal","Bonus +25 Strength +25 Attack damage +30% Status resistance","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 500 health, 2.5 health regen, 2% magic resistance and 50 attack damage.","For agility heroes, it grants 500 health, 2.5 health regen and 2% magic resistance.","For intelligence heroes, it grants 500 health, 2.5 health regen and 2% magic resistance.","The status resistance stacks diminishingly with other sources of status resistance."]}