{
  "abilities": [
    {
      "spell": "Slardar slithers ahead, moving significantly faster and passing through units. At ability level 4, Slardar may move at 700 speed while in the river.",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Guardian Sprint does not interrupt Slardar's channeling spells upon cast.",
        "Turns Slardar phased for the duration, allowing him to pass through other units and wards.",
        "When on level 4, applies haste on Slardar, meaning he cannot be slowed below the set value. The haste does not linger after leaving the river."
      ],
      "mana": "0",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "17",
      "name": "Guardian Sprint",
      "description": [
        "Cast Animation: 0+0",
        "Move Speed Bonus: 20%\/28%\/36%\/44%",
        "Level 4 River Haste Speed: 700",
        "Duration: 10"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Slams the ground, stunning and damaging nearby enemy land units. After the stun, the affected units are slowed.",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "The stun and slow are applied at the same time, so overall, the slow lasts for 4\/5\/6\/7 seconds.",
        "The crush first applies the debuffs, then the damage."
      ],
      "mana": "80\/95\/105\/115",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "8",
      "name": "Slithereen Crush",
      "description": [
        "Cast Animation: 0.35+0.6",
        "Radius: 350",
        "Damage: 80\/140\/200\/260",
        "Move Speed Slow: 20%\/25%\/30%\/35%",
        "Attack Speed Slow: 20\/25\/30\/35",
        "Stun Duration: 1 ( 2.5)",
        "Slow Duration: 3\/4\/5\/6"
      ],
      "hot_key": "W",
      "legacy_key": "R"
    },
    {
      "spell": "After 3 attacks, your next attack will bash the target.",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Each successful attack done on an enemy hero or creep adds one to the attack counting buff. The buff is always present, but turns invisible when at 0 charges.",
        "Does not count attacks done against allies, wards or buildings, nor bashes allies, buildings or wards on the bashing attack.",
        "The charges have no duration and last indefinitely.",
        "When the charges reach 4, the bash is applied and the charges set back to 0.",
        "Does not stack with other bashes. The bash from Skull Basher and Abyssal Blade is completely disabled for Slardar.",
        "The triggering attack first applies the debuff, then its own damage.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions."
      ],
      "mana": "0",
      "elements": [
        "Cannot be used by illusions.",
        "Not disabled by Break.",
        "Pierces spell immunity."
      ],
      "cooldown": "0",
      "name": "Bash of the Deep",
      "description": [
        "Required Hits: 4",
        "Damage: 75\/125\/175\/225 ( 150\/200\/250\/300)",
        "Stun Duration: 1\/1.1\/1.2\/1.3"
      ],
      "hot_key": "E",
      "legacy_key": "B"
    },
    {
      "spell": "Reduces enemy armor to amplify physical damage and provides True Sight of the targeted unit, revealing invisibility.",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Provides shared vision and True Sight over the target."
      ],
      "mana": "25",
      "elements": [
        "Blocked by Linken's Sphere.",
        "Pierces spell immunity."
      ],
      "cooldown": "5",
      "name": "Corrosive Haze",
      "description": [
        "Cast Animation: 0.35+0.6",
        "Cast Range: 700",
        "Armor Reduction: 10\/15\/20",
        "Duration: 18"
      ],
      "hot_key": "R",
      "legacy_key": "G"
    }
  ],
  "bio": "Slardar is a Slithereen, one of the Deep Ones, guardian of a vast network of sunken cities and the ancient riches buried within them. In the lightless gulf of the deepest ocean abysses, the Slithereen Guard patrols secret treasure rooms, ever vigilant against the subaqueous thieves sent into the deeps by covetous dryland sorcerers. He is utterly loyal, and his taciturn nature hides deep knowledge of the most secret places of the sea. He rises to the shallows in spite of the pain caused him by brightness, to commit reconnaissance, to make sure no one is conspiring against the depths, and sometimes in relentless pursuit of the rare few who manage to steal off with an item from the Sunken Treasury. Because he has spent his whole life at great pressure, under tremendous weight of the sea, Slardar the Slithereen Guard is a creature of immense power.",
  "talentsTips": [
    "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.",
    "The health talent increases maximum health capacity, and keeps the current health percentage.",
    "The night vision talent does not counter any vision reducing effect.",
    "The lifesteal talent stacks additively with other sources of lifesteal."
  ],
  "trivia": [
    "In DotA, Corrosive Haze was auto-castable.",
    "With the 7.00 gameplay update, three of Slardar's abilities have been renamed: Sprint to Guardian Sprint, Bash to Bash of the Deep, and Amplify Damage to Corrosive Haze.",
    "Slardar's voice lines \"That is not dead that can eternal lie.\" and \"And with strange aeons even death may die.\" are direct quotes from H. P. Lovecraft's short story The Nameless City.",
    "Another Lovecraft story, The Shadow over Innsmouth is also referred several times in Slardar's backstory and voice files with mentions to \"The Old Ones\" and \"The Deep Ones\".",
    "Slardar's model is based of the Naga from the Warcraft franchise."
  ],
  "talents": [
    "Corrosive Haze Undispellable:+1.5s Slithereen Crush Stun",
    "+1000 Night Vision:30% Lifesteal",
    "+75 Bash Damage:+300 Health",
    "+25 Damage:+6 Health Regen"
  ],
  "desc": "Slardar, the Slithereen Guard, is a melee strength hero who uses brute force, low cooldown spells, and high physical strength to bring his enemies to their knees. He excels and thrives in close combat situations, and has high mobility, strong initiation and ganking abilities, and good synergy between his abilities. Guardian Sprint greatly increases Slardar's movement speed for a lengthy duration, and allows him to chase down heroes, and escape with ease. Guardian Sprint can be used to get right next to enemies so Slardar can use Slithereen Crush, which delivers an area of effect (AoE) stun to nearby enemies followed by a minor slow afterwards, all on a very low cooldown. This allows Slardar to take on multiple opponents simultaneously and deliver a potent initiation. Bash of the Deep serves as a strong steroid ability, occasionally locking enemies in place while Slardar whacks at them with impunity. Finally, his ultimate Corrosive Haze is a great armor reduction modifier and allows him to reveal an enemy for its duration, making Slardar very potent against tanks and invisible heroes alike. It will also increase the damage dealt by his Crush and Bash, since they are physical. Although a strength hero, he has a high physical damage output, an agility gain and armor value, which rivals that of most agility heroes, allowing him to carry quite well if the situation calls for it. Chasing enemies relentlessly, pummeling them into the ground, and reducing their armor to shreds, Slardar is a fearsome opponent to face."
}