{
  "abilities": [
    {
      "spell": "Герой стремительно скользит, передвигаясь значительно быстрее и проходя сквозь других существ. На 4-м уровне эта способность увеличивает скорость передвижения по реке до 700.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Guardian Sprint не прерывает произносимые заклинания Slardar.",
        "Применяет к Slardar сквозное передвижение, позволяя проходить сквозь других юнитов и варды, пока действует способность.",
        "На 4-ом уровне способности применяет к Slardar ускорение, поэтому его нельзя замедлить ниже установленного значения. Ускорение не задерживается после выхода из реки."
      ],
      "mana": "0",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "17",
      "name": "Guardian Sprint",
      "description": [
        "Анимация применения: 0+0",
        "Доп. скорость передвижения: 20%\/28%\/36%\/44%",
        "Ускорение на реке на 4-ом уровне: 700",
        "Длительность: 10"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Бьёт по земле, оглушая ближайших наземных врагов и нанося им урон. После оглушения враги будут замедлены.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Оглушение и замедление применяются одновременно, поэтому в итоге замедление будет действовать 4\/5\/6\/7 секунд.",
        "Способность сначала применяет дебаффы, затем наносит урон."
      ],
      "mana": "80\/95\/105\/115",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "8",
      "name": "Slithereen Crush",
      "description": [
        "Анимация применения: 0,35+0,6",
        "Радиус: 350",
        "Урон: 80\/140\/200\/260",
        "Замедление скорости передвижения: 20%\/25%\/30%\/35%",
        "Замедление скорости атаки: 20\/25\/30\/35",
        "Длительность оглушения: 1 ( 2.5)",
        "Длительность замедления: 3\/4\/5\/6"
      ],
      "hot_key": "W",
      "legacy_key": "R"
    },
    {
      "spell": "Каждая 4-я атака героя оглушает и наносит дополнительный урон.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Каждая успешная атака по вражескому герою или крипу добавляет один заряд к счётчику баффа. Бафф всегда активен, но его иконка скрывается, если у счётчика нет зарядов.",
        "Не учитывает атаки по союзникам, вардам и строениям и не оглушает.",
        "У зарядов нет установленной длительности действия.",
        "Когда счётчик достигает 4, то применяется оглушающий удар и счётчик обнуляется.",
        "Не сочетается с другими источниками оглушающего удара. Оглушение от Skull Basher и Abyssal Blade отключено для Slardar.",
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Дополнительный урон наносится вместе с основной атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение."
      ],
      "mana": "0",
      "elements": [
        "Не может использоваться иллюзиями.",
        "Не отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Bash of the Deep",
      "description": [
        "Ударов нужно: 4",
        "Дополнительный урон: 75\/125\/175\/225 ( 150\/200\/250\/300)",
        "Длительность оглушения: 1\/1.1\/1.2\/1.3"
      ],
      "hot_key": "E",
      "legacy_key": "B"
    },
    {
      "spell": "Уменьшает сопротивление цели физическому урону и позволяет видеть её, даже если она невидима.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов"
      ],
      "notes": [
        "Дает общий обзор и эффект True Sight на цель."
      ],
      "mana": "25",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "5",
      "name": "Corrosive Haze",
      "description": [
        "Анимация применения: 0,35+0,6",
        "Дальность применения: 700",
        "Снижение брони: 10\/15\/20",
        "Длительность: 18"
      ],
      "hot_key": "R",
      "legacy_key": "G"
    }
  ],
  "bio": "Slardar — змееногий, один из обитателей глубин, стражник богатств затопленных городов и прочих сокровищ морского дна. Проплывая по бессветным заливам океанских глубин, змееногий страж освещает путь по запрятанным сокровищницам своим светильником-приманкой. Подводные воры (посланные на морское дно корыстолюбивыми волшебниками с поверхности) подплывают к, казалось бы, дружелюбному источнику света, и никогда уже не возвращаются на сушу. Slardar верен своей службе как никто, а его молчаливость скрывает знание всех тайных морских проходов. Несмотря на боль от яркого света, он поднимается на сушу, чтобы разведать, не собирается ли кто-то в очередную экспедицию за богатствами морского дна, а иногда и для расправы над теми немногими, что всё же выкрали что-то из затопленной сокровищницы. Проведенное под огромным давлением морской толщи время сделало из змееногого стража существо невероятной силы и ловкости, и встретиться с ним лицом к лицу осмелится лишь безумец.",
  "talentsTips": [
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
    "Талант на ночной обзор не поддается никакому эффекту уменьшения обзора.",
    "Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."
  ],
  "trivia": [
    "В DotA, Corrosive Haze можно поставить на авто-применение.",
    "Реплика Слардара Играть \"That is not dead that can eternal lie.\" и Играть \"And with strange aeons even death may die.\" ссылаются на рассказ Говарда Лавкрафта \"Безымянный Город\".",
    "Предыстория и реплики Слардара ссылаются на другой рассказ Лавкрафта \"Тень над Иннсмутом\" с символами \"The Old Ones\" и \"The Deep Ones\".",
    "Данная реплика Играть I welcome the abyss может являться маловероятной отсылкой к игре Planescape:Torment. Потому что в игровой вселенной Planescape - Бездна(Abyss), - это место куда после смерти попадают все \"злые\" существа. Любопытно, что исходя из оригинальной Dota, Слардар как раз и является \"злым\" существом, то есть героем тьмы."
  ],
  "talents": [
    "Эффект от Corrosive Haze нельзя развеять:+1,5 сек. оглушения от Slithereen Crush",
    "+1000 к ночному обзору:30% вампиризма",
    "+75 урона от Bash of the Deep:+300 к здоровью",
    "+25 к урону:+6 здоровья в секунду"
  ],
  "tips": [
    "Особая способность Corrosive Haze требует мало маны, а также быстро перезаряжается, что позволяет часто применять на противниках. Таким образом, применение на противниках позволяет союзникам наблюдать за противником, а в случае если у противника есть невидимость - Corrosive Haze разоблачит невидимого противника вам и вашим союзникам.",
    "Особая способность Corrosive Haze также сочетается с предметами и способностями, которые снижают броню противникам.",
    "Поскольку у Slardar имеется возможность оглушать противника с каждой атакой от действия Bash of the Deep, стоит задуматься о покупке предметов, дающих бонусы к скорости атаки. Чем чаще герой будет атаковать врагов, тем чаще будет шанс на срабатывание оглушения.",
    "Slardar с легкостью догоняет врагов или убегает от ганков с помощью Guardian Sprint, ведь он позволяет ему разгоняться до скорости в 504, из 522 возможных, имея лишь Power Treads или Phase Boots.",
    "Несмотря на сравнительно небольшой урон, Slithereen Crush оглушает всех врагов вокруг на целых 2.5 секунды. С перезарядкой в 8 секунд, его вполне можно использовать постоянно, выводя из игры сразу несколько вражеских героев.",
    "Corrosive Haze может в несколько раз повысить физический урон наносимый цели, на которую будет наложен. Кроме того, делает видимыми невидимых героев, если его наложить на них.",
    "Важно грамотно использовать Slithereen Crush, так как в командных боях этот навык может повернуть исход битвы. Corrosive Haze следует накладывать по ситуации — если есть возможность быстро убить вражеских героев под оглушением, то стоит использовать его на них."
  ],
  "desc": "Slardar — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способностью, Guardian Sprint, увеличивает скорость передвижения. Вторая способность, Slithereen Crush, оглушает ближайших вражеских юнитов и наносит им урон. После оглушения юниты замедляются. Пассивная способность, Bash of the Deep, позволяет герою каждый четвертый удар наносить дополнительный урон и оглушать врага. Ультимативная способность, Corrosive Haze, уменьшает броню врага и раскрывает его невидимость. Делает цель видимой для всех ваших союзников."
}