{"abilities":[{"spell":"Герой стремительно скользит, передвигаясь значительно быстрее и проходя сквозь других существ. При движении по реке скорость ещё выше и не ограничена стандартным максимумом.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Guardian Sprint не прерывает произносимые заклинания Slardar.","Применяет к Slardar сквозное передвижение, позволяя проходить сквозь других юнитов и варды, пока действует способность.","Бонусы от реки активируется, когда Slardar непосредственно находится в воде. То есть, если герой перемещается вертикально, то бонусы прекращают действие до соприкосновения с водой. Бонусы от реки не задерживаются.","Несколько источников бонусов не сочетаются."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"17","name":"Guardian Sprint","description":["Анимация применения: 0+0","Доп. скорость передвижения в реке: 5%\/20%\/35%\/50%","Восстановление здоровья: 0 ( 35)","Доп. броня: 0 ( 12)","Сопротивление эффектам: 0% ( 40%)","Доп. скорость передвижения при активации: 20%\/28%\/36%\/44%","Длительность: 10"],"hot_key":"Q","legacy_key":"T"},{"spell":"Бьёт по земле, оглушая ближайших наземных врагов и нанося им урон. После оглушения враги будут замедлены.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Физический"],"notes":["Оглушение и замедление применяются одновременно, поэтому в итоге замедление будет действовать 4\/5\/6\/7 секунд.","Способность сначала применяет дебаффы, затем наносит урон.","При улучшении пруд создает ауру, дающую заклинателю те же бонусы, что и река. В отличии от реки пруд не дает бонусы ни другим юнитам, ни иллюзиям заклинателя. Также бонусы пруда, в отличии от реки, задерживаются на 0.5 секунды. Бонусы от нескольких применений не складываются."],"mana":"80\/95\/105\/115","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"8 ( 3.5)","name":"Slithereen Crush","description":["Анимация применения: 0,35+0,6","Радиус: 350","Радиус пруда: 0 ( 550)","Урон: 80\/140\/200\/260","Замедление скорости передвижения: 20%\/25%\/30%\/35%","Замедление скорости атаки: 20\/25\/30\/35","Длительность оглушения: 1","Длительность пруда: 0 ( 25)","Длительность задержки ауры: 0 ( 0.5)","Длительность замедления: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"R"},{"spell":"Каждая 4-я атака героя оглушает и наносит дополнительный урон.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Каждая успешная атака по вражескому герою или крипу добавляет один заряд к счётчику баффа. Бафф всегда активен, но его иконка скрывается, если у счётчика нет зарядов.","Не учитывает атаки по союзникам, вардам и строениям и не оглушает.","У зарядов нет установленной длительности действия.","Когда счётчик достигает 4, то применяется оглушающий удар и счётчик обнуляется.","Не сочетается с другими источниками оглушающего удара. Оглушение от Skull Basher и Abyssal Blade отключено для Slardar.","Сработавшая атака сначала применяет дебафф, затем наносит урон.","Дополнительный урон наносится вместе с основной атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Bash of the Deep","description":["Ударов нужно: 4","Дополнительный урон: 75\/125\/175\/225 ( 150\/200\/250\/300)","Длительность оглушения: 1\/1.1\/1.2\/1.3"],"hot_key":"E","legacy_key":"B"},{"spell":"Уменьшает сопротивление цели физическому урону и позволяет видеть её, даже если она невидима.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Дает общий обзор и эффект True Sight на цель."],"mana":"25","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"5","name":"Corrosive Haze","description":["Анимация применения: 0,3+0,6","Дальность применения: 700\/800\/900","Снижение брони: 10\/15\/20","Длительность: 18"],"hot_key":"R","legacy_key":"G"}],"bio":"Змееногий обитатель глубин охраняет грандиозные богатства затонувших городов и скрытых ими древних ценностей. Своей приманкой страж озаряет потайные сокровищницы, скрытые в бессветной пучине, а её дружелюбное сияние ведёт на верную смерть подводных воров (посланных на морское дно алчными магами с поверхности). Страж верен своей службе как никто, а за его молчаливостью скрыто знание всех тайных морских проходов. Несмотря на жгучий свет, он поднимается на мелководье, чтобы разведать, не сговаривается ли кто против моря, — а иногда и чтобы расправиться с теми немногими, кто всё же обворовал затонувшую сокровищницу. Проведённое под огромным давлением морской толщи время сделало из змееногого стража существо невероятной мощи.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на ночной обзор не поддается никакому эффекту уменьшения обзора.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"trivia":["В DotA, Corrosive Haze можно поставить на авто-применение.","Реплика Слардара \"That is not dead that can eternal lie.\" и \"And with strange aeons even death may die.\" ссылаются на рассказ Говарда Лавкрафта \"Безымянный Город\".","Предыстория и реплики Слардара ссылаются на другой рассказ Лавкрафта \"Тень над Иннсмутом\" с символами \"The Old Ones\" и \"The Deep Ones\".","Данная реплика I welcome the abyss может являться маловероятной отсылкой к игре Planescape:Torment. Потому что в игровой вселенной Planescape - Бездна(Abyss), - это место куда после смерти попадают все \"злые\" существа. Любопытно, что исходя из оригинальной Dota, Слардар как раз и является \"злым\" существом, то есть героем тьмы."],"talents":["Эффект от Corrosive Haze нельзя развеять:-4,5 сек. перезарядки Slithereen Crush","+1000 к ночному обзору:+30% к вампиризму","+75 урона от Bash of the Deep:+350 к здоровью","+25 к урону:+8 здоровья в секунду"],"desc":"Slardar — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способностью, Guardian Sprint, увеличивает скорость передвижения. Вторая способность, Slithereen Crush, оглушает ближайших вражеских юнитов и наносит им урон. После оглушения юниты замедляются. Пассивная способность, Bash of the Deep, позволяет герою каждый четвертый удар наносить дополнительный урон и оглушать врага. Ультимативная способность, Corrosive Haze, уменьшает броню врага и раскрывает его невидимость. Делает цель видимой для всех ваших союзников."}