{"abilities":[{"spell":"While active, Troll Warlord swaps from using ranged to melee attacks. Melee attacks have a chance to ensnare, preventing the target from moving or using mobility spells. Berserker's Rage also grants additional movement speed, armor, and increased attack speed. Whirling Axes has different functionality while Berserker's Rage is active.","effects":["Ability Toggle","Affects Self \/ Enemies","Damage Magical"],"notes":["Berserker's Rage does not interrupt Troll Warlord's channeling spells upon cast.","When toggling on, disables Whirling Axes (Ranged) and then enables Whirling Axes (Melee).","When toggling off, all changes are reverted and he becomes a ranged unit again.","Turns Troll Warlord into a melee unit with 150 attack range, meaning items treat him as such (e.g. Battle Fury, Stout Shield).","When toggling on while a ranged projectile is flying, it is treated as a melee attack by items, but cannot root with Berserker's Rage. This means that it can cleave in an area behind the target if Troll Warlord has Battle Fury, he gains the full lifesteal from Vladmir's Offering, and items such as Orb of Venom and Eye of Skadi use the melee attack values. However, Quelling Blade uses the ranged values if Troll Warlord was ranged at the start of the projectile.","Berserker's Rage persists through Troll Warlord's death. If Berserker's Rage was active upon death, he respawns with it activated.","The proccing attack first applies the debuff, then its own damage.","The root of Berserker's Rage uses pseudo-random distribution.","The root does not work against allied units, wards and buildings."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Partially usable by illusions.","Partially disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Berserker's Rage","description":["Cast Animation: 0+0","Armor Bonus: 6","Movement Speed Bonus: 10\/20\/30\/40","Attack Range Loss: 350","Base Attack Time: 1.45","Root Chance: 10%\/12%\/14%\/16%","Root Duration: 0.8\/1.2\/1.6\/2"],"hot_key":"Q","legacy_key":"G"},{"spell":"Troll hurls a fistful of five axes in a cone shape over 1000 range, slowing and damaging enemy units.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Whirling Axes (Ranged) is only available when Berserker's Rage is toggled off.","The axes travel at a speed of 1500, taking 0.67 seconds to travel the full distance.","Spawns 5 axes which spread up to 25 degrees and affect units within 100 radius around them.","Has no starting radius, the axes spawn at one point in front of Troll Warlord. So the total area is shaped like a cone.","Can hit units up to 1100 range away (travel distance + axes radius).","The axes first apply the damage, then the debuff.","Does not affect Roshan.","During Battle Trance this ability has an instant cast time, and does not require Troll Warlord to face the targeted direction."],"mana":"50","elements":["Does not pierce spell immunity."],"cooldown":"9 ( 3)","name":"Whirling Axes (Ranged)","description":["Cast Animation: 0.2+0","Cast Range: 1000","Axes Travel Distance: 1000","Axes Radius: 100","Axes Spread End Radius: 206.17","Damage: 75 ( 165)","Move Speed Slow: 40%","Slow Duration: 2.5\/3\/3.5\/4"],"hot_key":"W","legacy_key":"E"},{"spell":"Troll hurls two axes around him in a close range area of effect, damaging enemy units and causing them to miss some attacks.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Whirling Axes (Melee) is only available when Berserker's Rage is toggled on.","Interrupts Troll Warlord's channeling spells upon cast.","If Troll Warlord dies, the spell ends and the axes disappear.","The axes always spawn towards east and west at Troll Warlord's position and rotate clock-wise.","The axes travel at a speed of 1250 and move out at a speed of 233.33 until reaching the max distance in 1.5 seconds, and then move back to Troll Warlord at the same speed.","Only units within 100 range of an axe get damaged and blind","Can hit units up to 450 range away (max spin radius + axes radius).","The full damage and debuff is dealt the first time a unit comes in contact with an axe, being hit by the other axe does not deal extra damage or reapply the debuff.","The axes first apply the damage, then the debuff.","The visual effects of this spell are offset and do not reflect the actual currently affected area.","Does not affect Roshan."],"mana":"50","elements":["Does not pierce spell immunity."],"cooldown":"9 ( 3)","name":"Whirling Axes (Melee)","description":["Cast Animation: 0+0","Spin Radius: 350","Axes Radius: 100","Damage: 75\/125\/175\/225 ( 165\/215\/265\/315)","Miss Chance: 60%","Blind Duration: 5","Whirl Duration: 3"],"hot_key":"E","legacy_key":"F"},{"spell":"With each continuous blow on the same target, Troll gains increased attack speed. If Troll changes targets, the stacks drop to zero.","effects":["Ability Passive","Affects Self"],"notes":["Troll Warlord gains or loses stacks as soon as his attacks land on the target. This means that missed or disjointed attacks do not count, and in ranged form, it reacts on projectile hit, not launch.","This is how much attack speed Fervor grants with a certain amount of stacks on each level. Level 1: 15\/30\/45\/60\/75\/90\/105\/120\/135\/150\/165\/180 ( \/195\/210\/225) Level 2: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240 ( \/260\/280\/300) Level 3: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300 ( \/325\/350\/375) Level 4: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360 ( \/390\/420\/450)","When already having stacks, the first attack against a new target removes the previous stacks, without granting a new stack.","Works against any unit, including allies, wards and buildings."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Fervor","description":["Max Stacks: 12 ( 15)","Attack Speed Bonus per Stack: 15\/20\/25\/30"],"hot_key":"D","legacy_key":"V"},{"spell":"Troll unleashes a powerful battle trance, that forces you to continuously attack the closest enemy unit within 0 range, prioritizing heroes. Damage does not kill you during this mode. Grants you bonus lifesteal, attack speed and movement speed. Applies a Basic Dispel.","effects":["Ability No Target ( Target Unit)","Affects Self ( Heroes)"],"notes":["Battle Trance interrupts Troll Warlord's channeling spells upon cast.","Applies a basic dispel ( strong dispel) on Troll Warlord upon cast.","When cast while not attacking, Troll Warlord automatically chooses an attack target within the search radius. Prioritizes heroes over other units. Uses default auto-attack rules to decide for targets. Does not target Roshan, buildings, wards, allies, or invulnerable or attack immune enemies.","When cast while already attacking a target, Troll Warlord sticks to that target, even if it is Roshan, a building, a ward, or an ally.","Troll Warlord only switches the current attack target when it becomes unattackable (turns invulnerable or attack immune, or dies).","Grants shared vision over the current attack target as long as it stays within 0 range of Troll Warlord, revealing it through the fog of war. Does not provide True Sight.","While attacking, Troll Warlord becomes almost fully uncontrollable, and can only be ordered to to toggle Berserker's Rage, or cast Whirling Axes. While attacking, Troll Warlord ignores taunts. Fear and Hypnosis prevent him from attacking and cause conflicting movement. When no enemies are nearby, he becomes controllable again, until a new visible enemy enters the search radius.","Prevents Troll Warlord from dying by setting his minimum health to 1. Unlike the loss of control over Troll Warlord, this effect is always present. This means he cannot die to damage, but can die to instantly killing effects (e.g. Culling Blade and Wraith Delay), since they do not kill with damage. Although using an instant kill effect, Ice Blast does not shatter units affected by the Min Health mechanic. HP removal cannot kill the unit either, so that it prevents Troll Warlord from dying to e.g. False Promise's delayed damage.","Damage taken is technically not reduced, so any damage event still registers the full damage.","The level 25 talent turns the basic dispel into a strong dispel. Also allows Battle Trance to be cast while stunned, cycloned, slept, taunted, hidden, or during Forced Movement. Does not allow it from being cast while silenced, hexed or prevented from acting, and also makes it impossible to shift-queue it.","When upgraded, Battle Trance can target enemy or allied heroes in addition to yourself. Can be also cast on creep-heroes like Spirit Bear, Fire, Earth, Storm. Applies the debuff to targetted allied or enemy hero, as well as a basic dispel. When cast on an enemy hero, it only lasts half as long as it does on Troll Warlord or an Allied hero."],"mana":"150","elements":["Pierces spell immunity."],"cooldown":"90 ( 35)","name":"Battle Trance","description":["Cast Animation: 0+0","Cast Range: 0 ( 525)","Enemy Search Radius: 900","Lifesteal: 40%\/60%\/80%","Movement Speed Bonus: 30%\/35%\/40%","Attack Speed Bonus: 140\/170\/200","Duration: 6.5"],"hot_key":"R","legacy_key":"R"}],"bio":"It's an easy thing to offend a troll. A prickly and contentious race, trolls thrive on argument and strife, missing no excuse to raise their voices in dispute. Males grow to maturity in subterranean chambers beneath their matriarch's domicile, feeding and amusing themselves while contributing nothing. Often they stay for years beyond the age of maturity, while the matriarch provides them with sustenance. When young trolls are finally pushed from their sub-chamber, they gather with others of their kind, forming roving gangs of malcontents who complain loudly about all manner of vexation. As much as trolls love to argue, imagine how rare it is for a troll to be driven from his own kind for being too difficult to get along with. Such was Jah'rakal's fate, a monger troll from deep in the Hoven. So deluded was he, so bitter and abrasive, that even other trolls found his company intolerable. After one particularly vitriolic outburst in which he claimed the lion's share of loot from their latest raid, his cohorts finally snapped. They turned on him, beat him with clubs, and drove him from the encampment. Enraged at his banishment, he returned the next day, armed with steel, and slew them all, one by one. He then swore a blood oath: he would ever after be a fighting force unto himself. Now he roams the world as the Troll Warlord, bitter and angry, the Imperial high commander of an army of one.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","The agility talent effectively grants Troll Warlord 1.6 armor, 10 attack speed, 0.5% movement speed and 10 attack damage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The evasion talent stacks multiplicatively with other sources of evasion."],"trivia":["Jah'rakal's lore and certain dialogue lines make several references to Internet trolls, a type of identity or role assumed by certain Internet users.","Troll Warlord's alternate name in DotA was Cory Clark a nod to the famous internet troll.","Battle Trance's sound effect is based on this and this line combined.","Troll Warlord's rare Whirling Axes cast response \"Axes of evil.\" is a reference to the term \"axis of evil\" which former U.S. president George W. Bush coined and used many times during his presidency."],"talents":["Battle Trance Strong Dispels:-6s Whirling Axes Cooldown","+40 Damage:25% Evasion","+90 Whirling Axes Damage:+3 Max Fervor Stacks","+250 Health:+10 Agility"],"desc":"Jah'rakal, the Troll Warlord, is a ranged agility hero able to output mighty damage competitively at range and in melee. His Berserker's Rage gives him the unique ability to change his attack position from ranged to melee and back at will as the situation warrants. When in close combat, his stats are increased accordingly: he gains bonus armor, movement speed, reduced base attack time, and the ability to root. Not only does this greatly improve the Troll Warlord, but allows him to overpower most other carries, as well as permanently ensnare a target for extended amounts of time. The Troll Warlord is an axe specialist, using them in his unique Whirling Axes, which has two variations: the first is available to his ranged form wherein he throws axes in a cone formation to damage and slow enemies. The second is available to his melee form, whirling axes around himself in a small radius to damage and blind nearby enemies. In keeping with his savage nature, Fervor builds up the Warlord's momentum, granting him attack speed with each consecutive hit on the same target, though the momentum is lost upon switching targets. His Ultimate, Battle Trance, increases his attack speed further, boosts his movement speed, prevents death and grants lifesteal at the expense of almost complete loss of control when enemies are nearby, mindlessly attacking them. Notorious for his superbly fast attack speed that can be matched by few, Jah'rakal is truly a force to be reckoned with."}