{"abilities":[{"spell":"Когда эта способность активирована, герой использует свои метательные топоры в ближнем бою. При этом повышается скорость атаки и передвижения героя, он получает дополнительную броню и может опутать сетью цель атаки, не давая ей передвигаться или применять способности для перемещения. Berserker's Rage также изменяет свойства способности Whirling Axes.","effects":["Способность Переключаемая","Действует на Себя \/ Врагов","Урон Магический"],"notes":["При использовании Berserker's Rage не прерывает произносимые способности Troll Warlord.","При переключении заменяет Whirling Axes (дальний бой) на Whirling Axes (ближний бой).","При обратном переключении все изменения возвращаются и Troll Warlord снова ставится существом дальнего боя.","Превращает Troll Warlord в юнита ближнего боя с дальностью атаки в 150 единиц, а предметы начинают считать его за данного юнита (к примеру, Battle Fury, Stout Shield).","При переключении в момент полета снаряда от дальней атаки, снаряд будет считаться как ближняя атака для предметов, но не применит оцепенение от Berserker's Rage. То есть можно использовать прорубающий удар в области перед Troll Warlord, как и получать лечение от вампиризма на полные 25%.","Berserker's Rage остается после смерти Troll Warlord. Если Berserker's Rage был активен на момент смерти, герой возродится также с активной способностью.","Сработавшая атака сначала применяет дебафф, затем наносит урон.","Оцепенение от Berserker's Rage использует псевдослучайное распределение.","Оцепенение не действует на союзных юнитов, варды и строения."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Частично используется иллюзиями.","Частично отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Berserker's Rage","description":["Анимация применения: 0+0","Дополнительная броня: 6","Доп. скорость передвижения: 10\/20\/30\/40","Потеря дальности атаки: 350","Базовое время атаки: 1,45","Шанс оцепенения: 10%\/12%\/14%\/16%"],"hot_key":"Q","legacy_key":"G"},{"spell":"Тролль бросает пять топоров веером на расстояние 1000, замедляя врагов и нанося им урон.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Whirling Axes (дальний бой) доступна только при неактивированной Berserker's Rage.","Топоры летят со скоростью в 1500 единиц, преодолевая всю дистанцию за 0.67 секунды.","Создает 5 топоров с расстоянием между ними в 25 градусов и затрагивает существ в радиусе 100 единиц вокруг них.","У способности нет начального радиуса, топоры появляются перед Troll Warlord. Общая площадь напоминает по форме конус.","Может поражать существ на расстоянии до 1100 единиц (складывается из дальности полета топоров и их радиуса).","Топоры сначала наносят урон, затем применяют дебафф.","Не действует на Рошана.","Во время действия Battle Trance эта способность применяется мгновенно и не требует поворота героя в сторону выбранного направления."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"9 ( 3)","name":"Whirling Axes (дальний бой)","description":["Анимация применения: 0,2+0","Дальность применения: 1000","Дальность полета топоров: 1000","Радиус топоров: 100","Конечный радиус топоров: 206.17","Урон: 75 ( 165)","Замедление скорости передвижения: 40%","Длительность замедления: 2.5\/3\/3.5\/4"],"hot_key":"W","legacy_key":"E"},{"spell":"Герой вращает два топора в небольшом радиусе вокруг себя, нанося врагам урон и вынуждая их промахиваться атаками.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Whirling Axes (ближний бой) доступна только при активированной Berserker's Rage.","При использовании прерывает произносимые заклинания Troll Warlord.","Если Troll Warlord умрет, то заклинание завершится и топоры пропадут.","Топоры всегда появляются на востоке и западе от расположения Troll Warlord и вращаются по часовой стрелке.","Топоры движутся со скоростью в 1250 единиц и вылетают из центра со скоростью в 233.33 до достижения максимальной дистанции за 1.5 секунды, а затем возвращаются к Troll Warlord с той же скоростью.","Только находящиеся в пределах 100 единиц существа получают урон и ослепление.","Может поражать существ на расстоянии до 450 единиц (складывается из радиуса вращения и радиуса топоров).","Топоры сначала наносят урон, затем применяют дебафф.","Визуальные эффекты от этого заклинания смещены и не отображают реальную область поражения.","Не действует на Рошана."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"9 ( 3)","name":"Whirling Axes (ближний бой)","description":["Анимация применения: 0+0","Радиус вращение: 350","Радиус топоров: 100","Урон: 50\/100\/150\/200 ( 140\/190\/240\/290)","Шанс промаха: 60%","Длительность промахов: 5","Длительность вращения: 3"],"hot_key":"E","legacy_key":"F"},{"spell":"Каждый последующий удар по одной и той же цели увеличивает скорость атаки тролля. Если тролль сменит цель, бонус обнулится.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Troll Warlord получает или теряет заряды как только его атаки достигли цели. То есть атаки, которые промахнулись или которые избежали, не засчитываются, а в дальнем бою способность реагирует на попадание, а не запуск снаряда.","Здесь указано, сколько скорости атаки Fervor дает за определенное количество зарядов на каждом уровне. Уровень 1: 15\/30\/45\/60\/75\/90\/105\/120\/135\/150\/165\/180 ( \/195\/210\/225) Уровень 2: 20\/40\/60\/80\/100\/120\/140\/160\/180\/200\/220\/240 ( \/260\/280\/300) Уровень 3: 25\/50\/75\/100\/125\/150\/175\/200\/225\/250\/275\/300 ( \/325\/350\/375) Уровень 4: 30\/60\/90\/120\/150\/180\/210\/240\/270\/300\/330\/360 ( \/390\/420\/450)","При наличии зарядов атака по новой цели убирает предыдущие заряды без добавления нового.","Действует на любых юнитов, включая союзников, варды и строения."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Fervor","description":["Мак. количество эффектов: 12 ( 15)","Скорость атаки за эффект: 15\/20\/25\/30"],"hot_key":"D","legacy_key":"V"},{"spell":"Герой входит в боевой транс, вынуждающий его атаковать ближайшее вражеское существо в радиусе 0 (в первую очередь героев). Под действием этой способности героя нельзя убить. Даёт дополнительные вампиризм, скорость атаки и передвижения. Применяет на владельца нормальное развеивание.","effects":["Способность Ненаправленная ( Направленная на юнита)","Действует на Себя ( Героев)"],"notes":["При использовании прерывает произносимые заклинания Troll Warlord.","При использовании применяет базовое развеивание ( сильное развеивание) к Troll Warlord.","При активации Troll Warlord может получать приказы только на переключение Berserker's Rage или использование Whirling Axes. Герой не подчиняется приказам на передвижение, атаку, использование предметов или повторное применение Battle Trance. Если поблизости нет врагов, то Troll Warlord можно управлять. Игрок теряет контроль, если в пределах радиуса вновь появляются видимые враги.","После выбора цели Troll Warlord атакует её до тех пор, пока это станет невозможным. При использовании способности при атаке существа, герой также выберет его.","Не выбирает целью строения, варды, неуязвимых существ и существ в призрачной форме.","Предотвращает смерть Troll Warlord, приравнивая его минимальное здоровье к 1. То есть герой не может умереть от урона, но умирает от мгновенно убивающих эффектов (например, Culling Blade и призрачной формы от Reincarnation), поскольку они не наносят урона. Несмотря на использование мгновенно убивающего эффекта, Ice Blast не взрывает существ под действием механики минимального здоровья. Отнимающий здоровье урон также не убивает юнита, поэтому, например, герой не может умереть от отложенного урона False Promise.","Технически, получаемый урон не уменьшается, поэтому каждое нанесение учитывается в полном размере.","Талант 25-го уровня меняет базовое развеивание способности на сильное развеивание. Позволяет использовать Battle Trance при оглушении, урагане, сне, провокации, исчезновении и во время принудительного движения. Невозможно использовать и поставить в очередь действий во время безмолвия, проклятия или запрета действия.","При улучшении Battle Trance можно также применять на вражеского или союзного героя. Накладывает на противника дебафф Battle Trance на всё время действия способности. Также можно применить на крипов-героев (например, Spirit Bear, воина огня, земли или шторма). При применении на вражеского героя способность действует вдвое меньше, чем на Troll Warlord или его союзнике."],"mana":"150","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"90 ( 35)","name":"Battle Trance","description":["Анимация применения: 0+0","Дальность применения: 0 ( 525)","Радиус поиска врагов: 900","Вампиризм: 40%\/60%\/80%","Доп. скорость передвижения: 30%\/35%\/40%","Доп. скорость атаки: 140\/170\/200","Длительность на союзнике: 6,5","Длительность на враге: 0 ( 3,25)"],"hot_key":"R","legacy_key":"R"}],"bio":"Обидеть тролля проще простого. Тролли обидчивы и сварливы, их хлебом не корми, а дай поспорить и попрепираться по любому поводу. До совершеннолетия самцы обитают в подземных пещерах под домищем матриархата, не принося никакого толку, лишь откармливаясь да озорничая. Зачастую уже даже взрослые тролли сидят на материнской матерей годами. Когда же их наконец вышвыривают с насиженных мест, тролли сбиваются в бродячие стаи, скандалят и недовольствуют по любому поводу. Так представьте же себе, какой невыносимой занозой нужно быть, чтобы тебя отвергли собственные соплеменники, при их-то любви позадирать друг друга. Такова была судьба Джа'ракала, тролля-барышника из глубин Ховена. Был он настолько блажным, склочным и злобным, что его не выносили даже тролли из собственной стаи. Однажды, когда особенно взбешённый в тот день Джа'ракал присвоил себе львиную долю скарба с последнего налёта, терпение соплеменников лопнуло: жадину поколотили дубинами и выдворили из лагеря. Взбешённый изгнанием, Джа'ракал вернулся на следующий день с оружием в руках и убил всех обидчиков, одного за другим. Отдышавшись, он дал кровавую клятву: отныне он будет сражаться только сам за себя. Теперь озлобленный и беспощадный Джа'ракал скитается по миру, командуя армией одного воина — себя любимого.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на ловкость в общем даёт Troll Warlord: 1,6 брони, 10 скорости атаки, 0,5% скорости передвижения и 10 урона от атаки.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на уклонение мультипликативно сочетается с другими источниками уклонения."],"trivia":["Фраза Troll Warlord \"Please do feed the trolls\" является изменённым советом по поводу сетевых троллей - \"Please do not feed trolls\" (\"Пожалуйста, не кормите троллей\").","Troll Warlord, наряду с Phantom Assassin, имеет самый низкий прирост интеллекта в игре (1 за уровень).","Альтернативное имя Troll Warlord в DotA было Cory Clark, в честь знаменитого сетевого тролля.","Его набор способностей был полностью изменен в версиях DotA 6.60 и выше. Его способности были либо изменены, либо заменены. Некоторые из этих изменений: Berserker's Rage использовал ману. Blind был визитной карточкой героя, из-за которой его именовали Blinding Axe (Слепящий Топор) по сюжету DotA. Яркая вспышка ослепляла врагов, заставляя некоторые их атаки промахиваться. Fervor был похож на способность Inner Beast героя Beastmaster, когда представлял из себя ауру увеличения скорости атаки. Rampage — старая особая способность, вводила героя в состояние зверского буйства, увеличивая его скорость передвижения и атаки на короткое время. Эта способность делала Blind мгновенным и давала герою возможность уничтожить пятерых героев по отдельности, что вдохновило сообщество называть убийство пятерых одним героем \"Rampage\" (\"Буйство\").","Звук активации Battle Trance основан на комбинации этой и этой фраз."],"talents":["Battle Trance применяет сильное развеивание:-6 сек. перезарядки Whirling Axes","+40 к урону:+25% к уклонению","+90 к урону от Whirling Axes:+3 к максимуму эффектов от Fervor","+250 к здоровью:+10 к ловкости"],"desc":"Troll Warlord — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Berserker's Rage, меняет тип атаки с дальнего на ближний. В ближнем бою повышается наносимый героем урон, его скорость атаки и передвижения, он получает дополнительное здоровье, броню и шанс опутать сетью цель при атаке. Вторая способность в дальнем бою, Whirling Axes (дальний бой), бросает пять топоров веером, замедляя врагов и нанося им урон. Вторая способность в ближнем бою Whirling Axes (ближний бой), вращает два топора вокруг себя в небольшом радиусе, нанося урон вражеским существам и заставляя их промахиваться во время атак. Пассивная способность, Fervor, увеличивает скорость атаки с каждого последующего удар по одной и той же цели. Если тролль сменит цель, бонус обнулится. Ультимативная способность, Battle Trance, повышает скорость атаки и скорость передвижения Troll Warlord, даёт ему дополнительный вампиризм и защищает от смерти взамен на возможность контролировать героя."}