{
  "abilities": [
    {
      "notes": [
        "Interrupts Gyrocopter's channeling abilities upon cast",
        "Despite the visual effects, the damage is dealt instantly, rather than on each rocket's impact",
        "Rocket Barrage cannot hit invisible units or units in the Fog of War",
        "Gyrocopter can act freely during Rocket Barrage",
        "Does not fire rockets while Gyrocopter is hidden. The units damaged are selected randomly within its search radius. There are no priorities",
        "Deals damage in 0.1-second intervals, starting 0.1 seconds after cast, resulting in 30 damage instances",
        "Can deal a total of 210\/360\/510\/660 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 690\/840\/990\/1140) damage (before reductions), assuming all rockets hit. Leveling up ability does not update the current active instance",
        "TALENT NOTES The movement speed increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent does not update the current active instance. Increases Gyrocopter's total movement speed to 345 while active. However, the damage per rocket increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent immediately update the current active instance"
      ],
      "item_behaviour": [],
      "description": "Launches a salvo of rockets at nearby enemy units in a radius around the Gyrocopter. Lasts 3 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0",
        "Search Radius: 400",
        "Number of Targets: 1",
        "Rockets per Second: 10",
        "Damage per Rocket: 7\/12\/17\/22 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 23\/28\/33\/38)",
        "Barrage Duration: 3",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Move Speed Bonus:  30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/13\/Gyrocopter_Rocket_Barrage.mp3\/revision\/latest?cb=20191216014024",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "7\/6.5\/6\/5.5",
      "aghanim": null,
      "name": "Rocket Barrage",
      "cooldown": "90",
      "legacy_key": "R",
      "story": "Aurel's new craft has an increased payload for rockets, enhancing their rapid-fire capabilities."
    },
    {
      "notes": [
        "When cast, a stationary missile is placed 150 range in front of Gyrocopter, which begins to move 2.5 seconds later",
        "Homing Missile has an initial speed of 500 and increases by 15 per second, increasing by 1 movement speed every 0.07 seconds. The speed acceleration is not capped, and continues to increase until it hits the target or is destroyed",
        "If the missile's target dies, it automatically switches to the nearest valid target within 700 range of the previous target",
        "Only attacks from heroes, illusions (counting as heroes), towers and fountain, can damage the missile. The missile can be pushed forward or backward by  Force Staff,  Hurricane Pike and  Psychic Headband. The missile cannot impact the target while being affected by the aformentioned forced movement sources. it passes through, reorients, and continues to chase the target. The missile is instantly destroyed by  Force Boots and when affected by  Chronosphere while moving forward",
        "The rocket first applies the debuff, then the damage",
        "The cross-hair over the target is visible to allies only",
        "Although the ability grants no vision or True Sight over the target, the missile follows and hits invisible units",
        "If the missile hits its target, its 400 range flying vision stays at the location for 3.5 seconds",
        "Leveling up ability does not update the current active flying missiles",
        "SHARD NOTES Homing Missile starts firing  Rocket Barrage of the current level, 1 second after being deployed. This Rocket Barrage has a radius of 725 and prioritizes its current target over other units. Rocket Barrage notes fully apply. If it is not leveled, the missile will still fire at the target, but deal no damage. Although the missile launches the Rocket Barrage, the damage is sourced to Gyrocopter, and not to the  Homing Missile. Therefore, the damage is affected by outgoing damage manipulation and spell lifesteal. Acquiring  Aghanim's Shard immediately updates all currently existing Homing Missiles. SPELL STEAL The  Rocket Barrage applied is based on  Gyrocopter's current ability level when acquired"
      ],
      "item_behaviour": [],
      "description": "Fires a homing missile to seek the targeted enemy unit. The missile gains speed over time, dealing damage and stunning when it impacts the target. Enemy units can destroy the missile before it reaches its target.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range:  1050",
        "Launch Delay: 2.5",
        "Hero Attacks to Destroy: 3",
        "Tower Attacks to Destroy: 6",
        "Damage: 90\/180\/270\/360",
        "Stun Duration: 1.8\/2.2\/2.6\/3 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2.2\/2.6\/3\/3.4)",
        "Rocket Barrage Radius:  725",
        "Rocket Barrage Delay:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/43\/Gyrocopter_Homing_Missile_1.mp3\/revision\/latest?cb=20200917220359",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "26\/21\/16\/11",
      "aghanim": null,
      "name": "Homing Missile",
      "cooldown": "120\/130\/140\/150",
      "legacy_key": "E",
      "story": "The biggest missile Aurel could possibly attach to his craft, The Bomb™ has carefully calculated aerodynamics and explosives for maximum impact."
    },
    {
      "notes": [
        "Interrupts Gyrocopter's channeling abilities upon cast",
        "Causes Gyrocopter to perform instant attacks on all nearby enemies whenever he launches an attack projectile. This means it does not matter if the attack successfully hits or not. The instant attacks do not trigger attack modifiers or any on-hit effects. They do not have True Strike. The projectiles from the instant attacks travel at a speed of 800",
        "The flaks have no count limit. All valid nearby targets get targeted. The primary attack target is not affected by Flak Cannon. It is only hit by the primary attack. Does not target  Couriers, wards, buildings, invisible units, or units inside the Fog of War. However, attacking couriers, wards, buildings, or allied units still causes flaks to hit all valid targets within the search radius",
        "The visual effect above Gyrocopter and the number of attacks left on the buff icon are visible to everyone",
        "SCEPTER NOTES Adds a passive component to Flak Cannon, with the active components still present. Therefore, the Side Cannon ability upgrade requires Flak Cannon to be learned to work. Gyrocopter performs instant attacks, using the his current projectile speed, on the furthest enemy within 700 range of him. These instant attacks can trigger any attack modifiers and on-hit effects normally, except for Flak Cannon while it is active. They do not have True Strike, but ignore disarms. Instant attacks launched this way do not interrupt Gyrocopter's channeling abilities. Does not target wards,  Couriers or attack immune enemies, but does target buildings. Only targets units Gyrocopter has vision over. Does not launch attacks when Gyrocopter is hidden or invisible. The Side Gunner ignores fade times and fade delays of invisible sources. It stops launching instant attacks when fully invisible. For  melee units, if the enemy target is farther than 350 range more than the attacker's range, the attack will always miss",
        "TALENT NOTES The active attack damage bonus <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent grants flat bonus attack damage when Flak Cannon is active"
      ],
      "item_behaviour": [],
      "description": "Gyrocopter's attacks hit all enemy units in an area around it for a limited number of attacks. Only the main target of attacks will receive attack bonuses such as Critical Strike. Lasts 10 seconds or until the attacks are used.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Flak Search Radius: 1000",
        "Number of Attacks: 3\/4\/5\/6 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 6\/7\/8\/9)",
        "Flak Duration: 10",
        "Side Gunner Range:  700",
        "Side Gunner Attack Interval:  1.2",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Active Attack Damage Bonus:  40"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Gyrocopter_Flak_Cannon_1.mp3\/revision\/latest?cb=20191216014016",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Instant Attack"
      ],
      "mana": "18 (TagTalent 12)",
      "aghanim": null,
      "name": "Flak Cannon",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "F",
      "story": "This newly revamped Gyrocopter has attached enough armaments to assault in a 360 degree radius."
    },
    {
      "notes": [
        "The first missile impacts 2 seconds and the second missile impacts 4 seconds after cast",
        "Provides 300 radius flying vision at the targeted area for 4 seconds upon cast",
        "Can deal a total of 350\/525\/700 damage (before reductions), assuming both missiles hit",
        "The missiles first apply their debuffs, then their damage",
        "The big red area indicator is visible to allies only. The sound effects are audible and the missiles visible to everyone",
        "TALENT NOTES With the Airstrike <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent, Call Down additionally gains vector-targeting functionality. Causes 2 additional instances of Call Down, ergo 4 additional missiles to be launched after the main instance. These instances are launched in 0.75-second intervals, starting 0.75 seconds after the primary Call Down, taking 1.5 seconds to launch them all. The additional instances are launched along the selected vector, 500 range apart from each other, so that they overlap a bit. This results in them covering a total area with a length of 2200 and a width of 600. Each first missile of the additional instances deals 75\/125\/175 damage, and each second missile deals 100\/137.5\/175. Each additional instance can deal a total of 175\/262.5\/350 damage. All instances together can deal a total of 700\/1050\/1400 damage, if all 6 missiles hit. Once cast, the additional instances cannot be stopped in any way, not even by Gyrocopter's death"
      ],
      "item_behaviour": [],
      "description": "Call down an aerial missile strike on enemy units in a target area. After 2 seconds, two missiles arrive in succession, with 2 seconds between them.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  1000",
        "Effect Radius: 600",
        "Number of Call Downs: 1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 3)",
        "Number of Missiles per Call Down: 2",
        "Delay per Missile: 2",
        "Missile One Damage: 150\/250\/350",
        "Missile One Move Speed Slow: 30%",
        "Missile One Slow Duration: 2",
        "Missile Two Damage: 200\/275\/350",
        "Missile Two Move Speed Slow: 60%",
        "Missile Two Slow Duration: 4",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Distance Between Call Downs:  500",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Call Down Interval:  0.75",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Secondary Call Downs Damage Percentage:  50%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Gyrocopter_Call_Down_1.mp3\/revision\/latest?cb=20210823213938",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "90\/75\/60",
      "aghanim": null,
      "name": "Call Down",
      "cooldown": "125",
      "legacy_key": "C",
      "story": "'Bombs away!'"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.4,
    "attrAgilityInc": 3.3,
    "attrAgility": 26.0
  },
  "description": "Barrages with his cannon and homing missiles. The world's first non-magical flying device took over a decade to create, and less than a few seconds to shoot down. But its pilot was not deterred. Aurel returned to the skies in a newer, better Gyrocopter. Armed with Flak Cannons, the Gyrocopter can attack while traveling and mow down entire fields of foes even at distance greater than the reach of the main guns. Against targets that manage to escape the reach of the cannons, the contraption is equipped with self-regulating Homing Missiles that can tail their targets to the end of the world if not shot down. With a flick of a single button, a seemingly endless Barrage of Rockets can be released on anyone stepping too close to the flying machine. As the Keen he is, Aurel went overboard and mounted two huge rocket launchers on the back of the alerady loaded construction, allowing him to Call Down an air strike to devastate entire sectors.  Carry Nuker Disabler ★☆☆",
  "trivia": [
    "Aurel Vlaicu was a Romanian pioneer of early flight.",
    "Gyrocopter's response upon meeting Viper Link▶️ \"Holy shit, it's Viper!\" is a reference to a scene of the movie Top Gun.[1]",
    "Gyrocopter's helmet is similar to Gaetan \"The Mole\" Moliere's headgear from Atlantis: The Lost Empire.",
    "Gyrocopter's response upon using homing missile \"Fox Two\" is a reference to the NATO brevity code for an air-to-air infrared-guided missile launch."
  ],
  "history": "After serving through a lifetime of wars, upheaval, riots, and revolutions, the brass figured Aurel had seen enough. But in addition to a few trinkets and his considerable pension, the erstwhile engineer left with something far more interesting: a long-forgotten, incomplete schematic for a Gyrocopter, the world's first manned, non-magical flying device. Retiring to the tropical obscurity of the Ash Archipelago with little else but time and money, he set to work building the device. As the years wore on and the remains of failed prototypes began to pile up, he began to wonder if mechanical flight was even possible. A decade and a day after his retirement, on a sunny afternoon with a southerly breeze, Aurel sat in his latest attempt bristling with indignation and expectant failure. With a grunt of effort he pulled the ignition cord and covered his head, waiting for the inevitable explosion. However to his great surprise he began to lift and, following a few panicked adjustments, stabilize. Within an hour, he was ducking and weaving with the breeze, level with the gulls, and Aurel found himself filled with the breathless wonder of flight. As dusk settled in he set a course back to his workshop, but no sooner had he turned his craft when a cannonball tore through his tailfin. Disentangling himself from the wreckage, he swam toward the nearest piece of land in sight, and cursed to see the ship responsible for the cannonball collecting the debris. Days later, when Aurel returned to his workshop, he set to work on yet another gyrocopter, this one capable of carrying a much heavier, more dangerous payload.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-6s Flak Cannon Cooldown",
        "talent_left": "3x Call Down"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+40 Flak Cannon Damage",
        "talent_left": "+16 Rocket Barrage Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+0.4s Homing Missile Stun Duration",
        "talent_left": "+3 Flak Cannon Attacks"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+30 Movement Speed during Rocket Barrage",
        "talent_left": "+200 Health"
      }
    ],
    "notes": [
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}