{"abilities":[{"effects":["Cast Range: Global","Min Targeting Distance to Building: 70","Max Targeting Distance to Building: 575","Channel Time: 3","Town Portal Scroll Cooldown Increase: 10"],"notes":["Double clicking the item while being at least 1500 range away from the team's fountain, automatically targets the fountain's location.","On level 1, can target allied non-hero units and buildings. On level 2, can additionally target allied heroes.","Teleporting to captured outposts takes 3 seconds longer than to other buildings, taking 6 seconds.","When targeting far away from buildings, it teleports to the closest building, 575 range away from it. Has a max distance of 250 when targeting Shrines or Outposts.","Disjoints projectiles upon teleporting.","Units can be directly targeted. The effect then chases the unit. Buildings cannot be directly targeted, the ground is targeted instead.","The targeted unit's priority is lowered, meaning it is attacked as the last auto attack target by other units.","During the channeling, the teleport destination is marked with a visual effect in the same color as the player and a sound is played.","Both are visible and audible to everyone. The visual effect is also visible on teleporting invisible enemies.","Also marks the point on the minimap for allies. The mark is in the player's color and lasts as long as the channeling does.","Provides 200 range flying vision at the destination point for the whole channel duration, even if cancelled. The vision lingers for 1 second.","When the target unit dies or changes ownership during the channeling, the teleport gets cancelled, wasting the cooldown and mana cost. Since buildings are not directly targeted, the destruction of the building, or loss of the Outpost does not cancel the teleport.","Does not share cooldown with Town Portal Scroll. However, when teleporting with Boots of Travel, Town Portal Scroll gets 10 seconds added to its current cooldown (even when off cooldown)."],"elements":["Ability Target Point \/ Target Unit \/ Channeled","Affects Self"],"description":"Teleports you to an allied non-hero unit or structure. Teleporting to a unit is interrupted if the target unit dies. Adds 10 seconds to the cooldown of Town Portal Scroll."}],"contains":["Boots_of_Speed","Recipe"],"cost":"2500","description":"","further":["Boots_of_Travel_2"],"tips":["Boots of Travels is useful on all heroes during the late game, where it is needed to make desperate pushes or defenses, especially if one or both teams are dead or away from their bases.","Consider using Glyph of Fortification to prevent creeps from dying so Boots of Travel can complete channeling of Teleport.","Players with Boots of Travel should still carry Town Portal Scrolls for added map mobility. For example, players can: Teleport back to fountain with TP scroll to heal, and then back to a lane or a fight with Travels Defend a tower with TP scroll and then teleport back somewhere else with Travels Travels to a creep to push out a lane, and then teleport back to base with TP scroll"],"attrs":["Active Teleport","Bonus +32%\/35% Movement speed","Disassemble? No","Alert allies? No"],"info":["Upgrading the item improves the Teleport ability. Can be upgraded only once.","The total gold cost for each level is 2500\/4500.","Movement speed bonuses from multiple pairs of boots do not stack.","Stacks with all other movement speed bonuses.","Holding ALT causes an icon to appear below every allied heroes' portrait below the top bar of the HUD, showing the allies' teleport status. The icon shows their current cooldown on their teleport. If the ally has no teleport item, no icon appears. If it is in the backpack, it appears grey. The display prioritizes Boots of Travel over Town Portal Scrolls and Boots of Travel level 2 over level 1. It does not show other teleport abilities."]}