{
  "abilities": [
    {
      "notes": [
        "Талант 15 уровня даёт здоровье в ауре.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+4% к доп. урону за эффект Wild Axes",
          "talentRight": "+30 к скорости атаки от Inner Beast"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−30 сек. перезарядки Primal Roar",
          "talentRight": "+35 к урону кабана"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+350 к здоровью героя и подконтрольных существ",
          "talentRight": "+3 маны в секунду"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+30 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Wild_Axes.mp3\/revision\/latest?cb=20141124003219",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Топоры или летят со скоростью 1200 или долетают до цели за одну секунду, смотря что быстрее. Работает также при возвращении. При возвращении скорость топоров периодически обновляется, основываясь на расстоянии до Beastmaster и оставшемся времени полета. Таким образом в полете топоры находятся до двух секунд, до одной секунды в каждом направлении.",
        "При возвращении скорость топоров периодически обновляется, основываясь на расстоянии до Beastmaster и оставшемся времени полета.",
        "Таким образом в полете топоры находятся до двух секунд, до одной секунды в каждом направлении.",
        "Топоры разлетаются в стороны друг от друга на расстояние 450 перед тем как начнут сближаться, летя в сторону цели.",
        "Минимальная дистанция полета топоров — 450, поэтому при выборе точки, находящейся на расстоянии меньшем, чем 450 единиц, топоры все равно пересекутся на расстоянии в 450",
        "Оба топора летят по дуге, таким образом топор, выпущенный из правой руки героя, возвращается в левую руку и наоборот.",
        "Использует один дебафф на пораженных целях для всех зарядов. Иконка дебаффа отражает количество зарядов.",
        "Повторное поражение одного и того же юнита обновит длительность всех зарядов.",
        "Топоры сначала применяют дебафф, затем наносят урон. То есть они также увеличивают свой урон. Поскольку топоры действуют отдельно друг от друга, то один из топоров всегда наносит больше урона, если в юнита попали оба топора.",
        "Поскольку топоры действуют отдельно друг от друга, то один из топоров всегда наносит больше урона, если в юнита попали оба топора.",
        "Юнит может быть задет каждым топором лишь единожды, таким образом максимальный возможный урон (до учета сопротивлений и усилений) — 80\/140\/200\/260 (TagTalent 140\/200\/260\/320).",
        "Топоры накладывают на цель эффект увеличения урона только для Beastmaster и его подконтрольных юнитов.",
        "Не действует на курьеров.",
        "Топоры разрушают деревья в радиусе 175 вокруг каждого.",
        "Каждый топор имеет летающий обзор в радиусе 350. Этот обзор не задерживается.",
        "Изучение соответствующего таланта мгновенно обновляет значение урона всех топоров героя, находящихся в полете."
      ],
      "mana": "80",
      "hotKey": "Q",
      "cooldown": "8 (TagTalent 0)",
      "description": "Герой швыряет топоры, которые прорубают деревья и противников на своём пути и возвращаются обратно. Каждый топор задевает одного врага лишь единожды и увеличивает урон, получаемый от героя и его существ.",
      "spellName": "Wild Axes",
      "params": [
        "Анимация применения: 0,4+0,47",
        "Дальность применения: 1500",
        "Радиус: 175",
        "Дистанция полета топоров: 1500",
        "Расстояние разлета топоров: 450",
        "Урон каждого топора: 40\/70\/100\/130 (TagTalent 70\/100\/130\/160)",
        "Увеличение урона за эффект: 6%\/8%\/10%\/12%",
        "Длительность эффекта: 12",
        "Убирает перезарядку: способность можно использовать, когда топоры вернутся к герою."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Учась в одиночку выживать в дикой природе, Каррох приноровился использовать два томагавка, одинаково хорошо справляясь и с деревьями, и с врагами."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f5\/Call_of_the_Wild_Boar.mp3\/revision\/latest?cb=20141124234340",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Повышение уровня этого заклинания автоматически улучшает Call of the Wild (ястреб).",
        "Не убивает предыдущего призванного Кабана, если способность используют до его исчезновения.",
        "Кабан призывается в случайной точке около Beastmaster на расстоянии 100 единиц.",
        "В режиме Ability Draft, способность Call of the Wild (кабан) одиночное заклинание и оно не идёт вместе с Call of the Wild (ястреб)."
      ],
      "mana": "60\/65\/70\/75",
      "hotKey": "W",
      "cooldown": "42\/38\/34\/30",
      "description": "Герой призывает на поле битвы кабана-помощника..",
      "spellName": "Call of the Wild (кабан)",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Число кабанов: 1",
        "Длительность жизни: 60"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Подружившись в детстве с удивительным зверем, Каррох научился взывать к помощи животных."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f6\/Call_of_the_Wild.mp3\/revision\/latest?cb=20150105144026",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Повышение уровня этого заклинания автоматически улучшает Call of the Wild (кабан).",
        "Не убивает предыдущего призванного Ястреба, если способность используют до его исчезновения.",
        "Улучшение с Aghanim's Shard не даст возможности управлять уже призванным ястребом.",
        "Ястреб призывается в случайной точке около Beastmaster на расстоянии 300 единиц. Он сразу невидим без какой-либо задержки.",
        "Ястреба нельзя контролировать. После призыва он автоматически летит к выбранной области и там зависает. При улучшении с Aghanim's Shard полёт можно прервать в любой момент, отдав какой-либо приказ ястребу.",
        "При улучшении с Aghanim's Shard полёт можно прервать в любой момент, отдав какой-либо приказ ястребу.",
        "Если перемещение ястреба прервали (например, оглушением, оцепенением и т.д.), то после завершения эффекта он продолжит свой полет.",
        "Провокация и гипноз заставляют ястреба остановиться, но после завершения эффекта он продолжит свой полет. Также юнит игнорирует эффект страха.",
        "Ястреб не блокирует нейтральные лагеря.",
        "В режиме Ability Draft, способность Call of the Wild (ястреб) не доступна."
      ],
      "mana": "30",
      "hotKey": "W",
      "cooldown": "60\/50\/40\/30",
      "description": "Герой отправляет невидимого ястреба разведать территорию.",
      "spellName": "Call of the Wild (ястреб)",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Число ястребов: 1",
        "Длительность жизни: 60",
        "Даёт контроль над ястребами. Они получают способность Dive Bomb."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Подружившись в детстве с удивительным зверем, Каррох научился взывать к помощи животных."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "Действует на всех призываемых существ, иллюзии и неуязвимых юнитов.",
        "Эффект ауры задерживается на 0,5 секунды."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Высвобождает животную ярость союзников, увеличивая скорость их атак.",
      "spellName": "Inner Beast",
      "params": [
        "Радиус: 1200",
        "Доп. скорость атаки: 15\/25\/35\/45 (TagTalent 45\/55\/65\/75)",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Способность пробуждать внутреннюю мощь других существ проявилась у Карроха ещё в тот день, когда король Слома сгинул в лапах своего зверинца."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Primal_Roar.mp3\/revision\/latest?cb=20141124003225",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Откидываются только вражеские юниты. На Рошана отталкивание не работает.",
        "Юниты под воздействием откидывания полностью обезврежены.",
        "Primal Roar можно использовать на курьера для оглушения, но он не получит урона. Курьеры также подвергаются откидыванию.",
        "Раскидывает существ по сторонам со скоростью 450, на расстояние до 450, получая в итоге откидывание на 1 секунд.",
        "Откинутые существа смотрят в направлении, откуда их толкнули.",
        "Откидываемые существа ломают деревья вокруг себя по пути следования.",
        "Откидывание и замедление имеют динамический радиус действия, основанный на расстоянии между Beastmaster и основной целью. За каждые 2 единицы расстояния между Beastmaster и целью, радиус действия откидывания увеличивается на 1. Когда цель находится на расстоянии 600, откидываются юниты, находящиеся на расстоянии до 300 за целью и Beastmaster. Когда цель находится на расстоянии 825, откидываются юниты, находящиеся на расстоянии до 412.5 за целью и Beastmaster. Ширина откидывания всегда равна 300, так что площадь, на которой действует эффект, всегда в форме стадиона.",
        "За каждые 2 единицы расстояния между Beastmaster и целью, радиус действия откидывания увеличивается на 1.",
        "Когда цель находится на расстоянии 600, откидываются юниты, находящиеся на расстоянии до 300 за целью и Beastmaster.",
        "Когда цель находится на расстоянии 825, откидываются юниты, находящиеся на расстоянии до 412.5 за целью и Beastmaster.",
        "Ширина откидывания всегда равна 300, так что площадь, на которой действует эффект, всегда в форме стадиона.",
        "Учитывая динамическую дальность, замедление\/откидывание могут попасть по существам на расстоянии до 900.",
        "Если враг стоит ровно между Beastmaster и целью Primal Roar, его не откидывает в сторону. Тем не менее, замедление и урон по-прежнему накладываются, и цель оказывается обезврежена на время откидывания.",
        "Тем не менее, замедление и урон по-прежнему накладываются, и цель оказывается обезврежена на время откидывания.",
        "На основную цель сначала накладывается дебафф, затем наносится урон. Вторичные цели сначала получают урон, затем — дебафф.",
        "Вторичные цели сначала получают урон, затем — дебафф.",
        "Дополнительная скорость передвижения действует только на Beastmaster и его подконтрольных юнитов."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "90\/80\/70",
      "description": "Герой издаёт громогласный рык, который оглушает цель и раскидывает всех противников на пути к ней. Все задетые враги получают урон, а у отлетевших в стороны врагов снижается скорость атаки и передвижения. Также на 3 секунды скорость передвижения героя и его существ увеличивается на 40%%.",
      "spellName": "Primal Roar",
      "params": [
        "Анимация применения: 0,5+0,63",
        "Дальность применения: 600",
        "Радиус доп. скорости: 900",
        "Радиус откидывания: 300",
        "Урон: 150\/225\/300",
        "Замедление скорости передвижения: 60%",
        "Замедление скорости атаки: 60",
        "Доп. скорость передвижения союзникам: 40%",
        "Длительность замедления: 3\/3.5\/4",
        "Расстояние откидывания: 450",
        "Длительность откидывания: 1",
        "Длительность оглушения: 3\/3.5\/4",
        "Длительность ускорения: 3",
        "Может выбрать и оглушить врагов с иммунитетом к заклинаниям. Пытается нанести урон основной цели с иммунитетом. Не действует на вторичные цели с иммунитетом. Замедление сохраняется, если дебафф был применен до иммунитета и не был развеян.",
        "Полностью блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Beastmaster научился сливать все свои первобытные инстинкты в оглушающий вопль, сеющий смятение в рядах противника."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Себя"
      ],
      "notes": [
        "Действует на всех существ под контролем Beastmaster, включая самого героя.",
        "Аура не действует на неуязвимых и спрятанных существ.",
        "Аура увеличивает максимальный запас здоровья и сохраняет текущий процент здоровья.",
        "Аура не работает, пока Beastmaster мертв."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Для этой способности нет описания.",
      "spellName": "Health Aura",
      "params": [
        "Радиус: Глобальный",
        "Бонус к здоровью: 4",
        "Иллюзии распространяют ауру и получают от неё бонусы, но эффект от нескольких аур не сочетается."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Удачные атаки не накапливают замедление, длительность обновляется."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Впрыскивает яд, замедляющий атаку и скорость врага.",
      "spellName": "Poison",
      "params": [
        "Замедление передвижения: 10%\/20%\/30%\/40%",
        "Замедление атаки: 10\/20\/30\/40",
        "Длительность замедления: 3",
        "Замедление сохраняется, если эффект был наложен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Hawk_Dive_Bomb_1.mp3\/revision\/latest?cb=20210626132907",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки",
        "Не смотря на описание, Dive Bomb использует анимацию применения, а не является прерываемой способностью.",
        "Модификатор раскрытия невидимости накладывается на ястреба в момент начала применения заклинания и заканчивается при окончании пикирования или при остановке применения.",
        "Ястреб всегда летит по дуге 0,4 секунды, поэтому его скорость варьируется. Скорость не адаптируется мгновенно при изменении расстояния, скорее, она медленно увеличивается или уменьшается.",
        "Скорость не адаптируется мгновенно при изменении расстояния, скорее, она медленно увеличивается или уменьшается.",
        "Использует принудительное движение для перемещения ястреба. Это значит, что полёт можно прервать другим принудительным передвижением. При прерывании ястреб не умрёт. Пикирование нельзя остановить каким-либо другим образом, он игнорирует другие обезвреживания.",
        "Пикирование нельзя остановить каким-либо другим образом, он игнорирует другие обезвреживания.",
        "Ястреб сначала наносит урон, потом накладывает оглушение, затем умирает. Смерть ястреба нельзя предотвратить.",
        "Смерть ястреба нельзя предотвратить."
      ],
      "mana": "0",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "Ястреб раскрывает свою невидимость и после прочтения в 1 сек. пикирует в выбранного врага, наносит ему урона и оглушает его на сек. и погибает.",
      "spellName": "Dive Bomb",
      "params": [
        "Анимация применения: 1+0",
        "Дальность применения: 500",
        "Урон: 175",
        "Длительность оглушения: 1",
        "Длительность пикирования: 0,4",
        "Не может быть применена на врагов, невосприимчивых к заклинаниям. Если невосприимчивость была приобретена во время полёта, то цель не получит ни урона, ни оглушения."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 1.6,
    "attrAgility": 18.0
  },
  "description": "Beastmaster, или Каррох — это герой с ближним типом атаки, основным атрибутом которого является сила. Он универсальный герой, который чаще всего используется в качестве оффлейнера и инициатора, приносит большую пользу своей команде в любой ситуации. Его Wild Axes позволяют ему довольно эффективно стоять на линии и фармить на протяжении всей игры, даже когда на него есть давление. Он может призвать на помощь ястреба и кабана, каждый из которых крайне полезен его команде. Call of the Wild (ястреб) обеспечивают свободный обзор на карту, разведывая врагов, в то время как его Call of the Wild (кабан) могут беспокоить и замедлять его врагов до ползания, помогая ему в бою. Его аура Inner Beast делает его команду силой, с которой нужно считаться, обеспечивая значительный прирост скорости атаки для самого героя, его призванных существ и всех ближайших союзников. Наконец, его ультимативная способность, Primal Roar, является самым продолжительным надежным оглушением по одной цели в игре, а также пробивает иммунитет к заклинаниям (которому можно противостоять только с помощью Linken's Sphere), обеспечивая сильную инициацию для его команды. Обладая этими способностями, он может быстро и безопасно разрушать вражеские башни, уничтожать незащищенные цели, блокировать одиночную цель, а также не давать врагам приблизиться в командных боях. Внимательно наблюдая за полем боя, Beastmaster уничтожает врагов одного за другим и прокладывает путь к победе. Улучшение с Aghanim's Scepter убирает перезарядку Wild Axes.",
  "history": "Детство Карроха прошло несладко. Мать его умерла при родах. Отца, кузнеца при последнем короле Слома, растоптали насмерть, когда ребенку было пять лет. Тогда Карроха поселили в королевский зверинец, где он рос среди животных: львов, обезьян, оленей-падунов и других, менее известных существ, в которых не всякий верил. На седьмой год жизни парня королевский лазутчик привел во дворец новую тварь. Её подтащили к королю, закованную в цепи, и та заговорила, хоть и не двигала ртом. Просила она одно: свободы. Король лишь рассмеялся и приказал зверю выступать ему на потеху, а когда тот отказался, огрел его своим Диким скипетром и приказал отправить тварь в темницу. Следующие месяцы мальчик тайком проносил к существу еду и лекарства, но они лишь слегка отодвигали полное истощение. Без слов зверь говорил с мальчиком, и со временем их связь усилилась настолько, что Каррох понял — он может поддерживать разговор. Более того, он научился общаться со всеми обитателями королевского зверинца. В ночь, когда зверь умер, мальчик впал в ярость. Он повел чудищ войной на прислужников короля, отперев клетки и выпустив зверей на дворцовые земли. В погроме насмерть растерзали и самого короля. Пока царила неразбериха, Каррох освободил одного из королевских оленей, и тот поклонился в ответ, а затем, с Каррохом на спине, перемахнул через высокие стены дворца, унося того из проклятого места. Теперь повелитель зверей Каррох по прозвищу Beastmaster уже взрослый мужчина, но он не потерял способности говорить с дикими зверьми. Сирота из королевского зверинца превратился в неукротимого воина природы.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+4% к доп. урону за эффект Wild Axes",
      "talentRight": "+30 к скорости атаки от Inner Beast"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−30 сек. перезарядки Primal Roar",
      "talentRight": "+35 к урону кабана"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+350 к здоровью героя и подконтрольных существ",
      "talentRight": "+3 маны в секунду"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+30 к урону"
    }
  ]
}