{
  "abilities": [
    {
      "notes": [
        "The first instance occurs upon cast, and then every 2 seconds",
        "On each tick, Malefice first applies the damage, then the stun\n SHARD NOTES Malefice now creates a  Lesser Eidolon based on the current level of  Demonic Conversion per stun instance\n Can create a maximum of 3 ( 7) Lesser Eidolons for its duration\n Lesser Eidolons created this way cannot multiply but their duration is still refreshed after its 7th attack projectile launch\n Demonic Conversion notes fully apply\n If it is not leveled, no Eidolons are created",
        "Can deal up to 120\/180\/240\/300 ( 210\/270\/330\/390) damage (before reductions)\n TALENT NOTES With the number of instances increasing  talent, it can deal up to 280\/420\/560\/700 damage\n With both  talents, it can deal up to 490\/630\/770\/910 damage",
        "Can stun for up to 1.2\/1.8\/2.4\/3 ( 2.25\/2.85\/3.45\/4.05) seconds in total\n TALENT NOTES With the number of instances increasing  talent, it can stun for up to 2.8\/4.2\/5.6\/7 ( 5.25\/6.65\/8.05\/9.45) seconds in total",
        "Successive casts do not stack but refresh the duration\n It also continues ticking with the same intervals as the first cast"
      ],
      "item_behaviour": [],
      "description": "Focuses Enigma's power on a target, causing it to take damage and become repeatedly stunned for multiple instances. An instance strikes every 2 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range:  600",
        "Number of Instances: 3 ( 7)",
        "Instance Interval: 2",
        "Damage per Instance: 40\/60\/80\/100 ( 70\/90\/110\/130)",
        "Stun Duration per Instance: 0.4\/0.6\/0.8\/1 ( 0.75\/0.95\/1.15\/1.35)",
        "Malefice Duration: 4 ( 12)",
        "Number of Eidolons per Instance:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e6\/Enigma_Malefice.mp3\/revision\/latest?cb=20191216013739",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "20\/18\/16\/14",
      "aghanim": null,
      "name": "Malefice",
      "cooldown": "100\/120\/140\/160",
      "legacy_key": "F",
      "story": "Strange gravities pull at the core of those who would oppose you, holding them in place."
    },
    {
      "notes": [
        "Demonic Conversion instantly kills the target unit, granting the gold and experience bounty, or resulting in a deny when cast on allied units",
        "Attacking buildings or allied units do not count towards the number of attacks required to multiply, but attacking wards does\n The attack is counted upon projectile launch, not upon hit, therefore, it does not matter whether the attack actually hits the target or not\n Eidolons multiply upon their 7th attack projectile launch, regardless of whether the attack is a valid one (such as attacking a building)",
        "When multiplying, the original Eidolon's health created from the ability is refreshed, then it creates new Eidolons that cannot multiply\n Since Eidolon(s) multiplying is not considered as death, buffs and debuffs are neither dispelled, nor projectiles are disjointed\n The original Eidolons' duration is also not refreshed\n However, the newly created Eidolon's duration gets increased by 2 seconds\n The Eidolon's name progress is as follows: Lesser Eidolon ➜ Eidolon ➜ Greater Eidolon ➜ Dire Eidolon",
        "Cannot be cast on ancient creeps, wards, creep-heroes,  Necronomicon Warriors,  Necronomicon Archers, and neutral creeps above Level 4:  Alpha Wolf,  Centaur Conqueror,  Dark Troll Summoner,  Hellbear Smasher,  Satyr Tormenter,  Warpine Raider,  Wildwing Ripper,",
        "TALENT NOTES Both the attack speed increasing and attack damage increasing  talents immediately update all currently spawned  Eidolons"
      ],
      "item_behaviour": [],
      "description": "Transforms a creep into three fragments of Enigma himself. These eidolons are all under Enigma's control, and repeated successful attacks cause them to multiply. When this happens, the eidolons have their health restored.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.7",
        "Cast Range:  700",
        "Max Creep Level: 4",
        "Number of Eidolons: 3 ( 8)",
        "Attacks to Multiply: 6",
        "Duration: 40"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Enigma_Demonic_Conversion.mp3\/revision\/latest?cb=20191216013747",
      "effects": [
        "Ability: Target Unit",
        "Affects: Units",
        "Damage: Instant Kill"
      ],
      "mana": "60\/52\/44\/36",
      "aghanim": null,
      "name": "Demonic Conversion",
      "cooldown": "140\/150\/160\/170",
      "legacy_key": "C",
      "story": "Enigma is capable of drawing aspects of himself from other dimensions - the result is a trio of dark eidolons that hunt the corporeal plane."
    },
    {
      "notes": [
        "The damage is provided by an aura and its debuff lingers for 0.5 seconds",
        "Midnight Pulse deals damage in 1-second intervals, starting 1 second after cast, resulting in 9\/10\/11\/12 instances\n Can deal up to 36.98%\/51.6%\/64.56%\/75.3% of the affected units' current health as damage (before reductions)",
        "Does not affect ancient creeps and wards",
        "The debuff from successive casts does not stack but extends its duration",
        "Destroys trees within the effect radius at the target location upon cast"
      ],
      "item_behaviour": [],
      "description": "Steeps an area in dark resonance, damaging enemy units based on their current HP.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range:  700",
        "Effect Radius: 550 ( 750)",
        "Current Health as Damage per Second: 5%\/7%\/9%\/11%",
        "Duration: 9\/10\/11\/12",
        "Aura Linger Duration: 0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Enigma_Midnight_Pulse.mp3\/revision\/latest?cb=20191216013740",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "50\/45\/40\/35",
      "aghanim": null,
      "name": "Midnight Pulse",
      "cooldown": "50\/80\/110\/140",
      "legacy_key": "D",
      "story": "A section of the world slowly descends into the void."
    },
    {
      "notes": [
        "Fully disables all enemies within the inner effect radius and silences them",
        "Spirals affected units counterclockwise towards the center at a speed of 30, resulting in a maximum possible distance of 120\n The closer the units are to the center, the stronger they get pulled to the center, with almost no pull, but only rotation at max distance\n This can be defined using the following polar equation: EXPR r = 0.25^θ\n [?]",
        "Can pull affected units over impassable terrain and through trees without destroying them",
        "Units inside Black Hole can be pulled out by various abilities\n However, the following abilities or items cannot move units out of Black Hole: <span image=\"items\/force_staff\/full.webp\">[Force Staff]<\/span> Force Staff, <span image=\"items\/hurricane_pike\/full.webp\">[Hurricane Pike]<\/span> Hurricane Pike,  Snowball,  Dispose and  Geomagnetic Grip",
        "The pull and disable are provided by an aura, which lingers for 0.5 seconds, or until the channeling stops, whichever is shorter",
        "Does not affect wards or buildings, but fully affects  Couriers",
        "Provides 800 range ground vision at the targeted point for 4 seconds upon cast",
        "Deals damage in 1-second intervals, starting 1 second after cast, resulting in 4 instances",
        "Can deal up to 400\/600\/800 ( 600\/800\/1000) (+  14% of max health as) damage (before reductions)",
        "SCEPTER NOTES The max health as damage is added to the main damage and dealt together in one instance\n Does not work against  Roshan, he only takes the base damage per second",
        "SCEPTER NOTES Black Hole now also spirals enemies within a 1200 radius counter-clockwise in at a speed of 175, resulting in a maximum possible distance of 700\n The pull towards the center gets stronger the closer the affected units are to it\n However, unlike the pull within the main area, this pull spirals much weaker and goes more toward the center\n The outer pull is provided by a separate aura, which also lingers for 0.5 seconds, or until the channeling stops, whichever is shorter\n This pull does not impede the targets at all, and even allows them to move still\n Does not pull enemies that are affected by sources of forced movement that disable enemies in some way\n It does not affect enemies that are affected by the main Black Hole modifier"
      ],
      "item_behaviour": [],
      "description": "Summons a vortex that sucks in nearby enemy units. Enemies affected by Black Hole cannot move, attack, or cast spells.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  275",
        "Max Channel Time: 4",
        "Inner Effect Radius: 420",
        "Inner Pull Speed: 30",
        "Damage per Second: 100\/150\/200 ( 150\/200\/250)",
        "Aura Linger Duration: 0.5",
        "Outer Effect Radius:  1200",
        "Outer Pull Speed:  175",
        "Max Health as Damage per Second:  3.5%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Enigma_Black_Hole.mp3\/revision\/latest?cb=20191216013746",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "mana": "200\/180\/160",
      "aghanim": null,
      "name": "Black Hole",
      "cooldown": "300\/400\/500",
      "legacy_key": "B",
      "story": "The ground trembles as Enigma channels his ultimate vortex of destruction, a singularity with the power to end worlds."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 21.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.0,
    "attrAgility": 14.0
  },
  "description": "Traps and damages enemies in a black hole. A mystery worthy of his name, Enigma could only be described as a being of the void, a beast between planes. He draws aspects of himself from other dimensions, performing Demonic Conversions summoning an ever-present contigent of Eidolons. The ground darkens under a Midnight Pulse, and foes are stunned by the unseen enchantments and Malefices as they try to flee its entropic effects. One legend has it that Enigma is actually the first collapsed star. This theory grows more plausible as Enigma begins to channel a cosmic singularity, pulling and entrapping all except himself into the super-dense center of his Black Hole.  Disabler Jungler Initiator Pusher ★★☆",
  "trivia": [
    "Many of Enigma's responses are references to Friedrich Nietzsche's works; the line, Link▶️ \"I stare also into you.\" references a passage in Beyond Good and Evil, where it is stated that \"And when you gaze long into an abyss the abyss also gazes into you\".[1]",
    "Enigma's rival line towards Faceless Void Link▶️ \"Even time may fail in the face of gravity.\" is a reference to the time dilating effect of gravity.[2]",
    "Many of Enigma's responses are also references to concepts in cosmology (the Big Bang, gravity wells, redshifts, and black holes) or particle physics (path integrals, universal constants).",
    "In DotA, Enigma's hero name was \"Darchrow\", and Enigma was the title. In the transition to Dota 2, \"Enigma\" has been turned into the name, and the title was changed to \"Consumer of Worlds\".",
    "Enigma, Chaos Knight, Keeper of the Light, and Io together represent the four fundamental forces of the universe with Enigma representing the gravitational force. Most of Enigma's abilities reflect his theme of gravity, especially his ultimate ability Black Hole.",
    "Most of Enigma's abilities reflect his theme of gravity, especially his ultimate ability Black Hole.",
    "The term \"eidolon\" comes from ancient greek literature, where it refers to a human-like phantom, the shade of one who died.",
    "Enigma's original voice (somewhere back in 2011) did not have the reverse feedback filter that his current voice has.[3] His old voice can be heard here."
  ],
  "history": "Nothing is known of Enigma's background. There are only stories and legends, most of them apocryphal, passed down through the ages. In truth, Enigma is a mystery for whom the only true biography is description: he is a universal force, a consumer of worlds. He is a being of the void, at times corporeal, other times ethereal. A beast between the planes. There are stories that say he was once a great alchemist who tried to unlock the secrets of the universe and was cursed for his arrogance. Other legends tell that he is an ancient being of strange gravity, the abyss personified—a twisted voice from out the original darkness, before the first light in the universe. And there are older legends that say he is the first collapsed star, a black hole grown complicated and sentient—his motivations unknowable, his power inexorable, a force of destruction unleashed upon existence itself.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+4 Malefice Instances",
        "talent_left": "+5 Demonic Conversion Eidolons"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+200 Midnight Pulse Radius",
        "talent_left": "+40 Eidolon Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+250 Health",
        "talent_left": "+30 Malefice Instance Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+12 Eidolon Attack Speed",
        "talent_left": "+50 Black Hole Damage Per Second"
      }
    ],
    "notes": [
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}