{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Drow_Ranger_Frost_Arrows.mp3\/revision\/latest?cb=20191215202224",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "notes": [
        "Frost Arrow's cast range can only be further increased by attack range bonuses of the same range type as the caster. However, it is not affected by cast range bonuses. Both Autocast and manually casting it uses Drow Ranger's current attack range.",
        "Both Autocast and manually casting it uses Drow Ranger's current attack range.",
        "Frost Arrows' damage is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Drow Ranger's attack damage. The attack damage bonus values are not considered by critical strike. However, it is considered by lifesteal and cleave, and it can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Drow Ranger's attack damage.",
        "The attack damage bonus values are not considered by critical strike.",
        "However, it is considered by lifesteal and cleave, and it can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "The attacks first apply Hypothermia debuff, then the slow debuff, then their own damage.",
        "Movement speed slow of successive casts do not stack but refresh the duration.",
        "Frost Arrows does not work against allied units, buildings or wards.",
        "SHARD NOTES Frost Arrows now place one hypothermia debuff on the enemy. This debuff gets stronger when it gets refreshed with successive casts. Works against every unit Frost Arrows can affect. Also works when applied with Multishot or instant attacks (e.g. Splinter Shots). A number on the icon, as well as a number above the target show the current amount of stacks on them. The debuff applies heal reduction, health regeneration reduction, lifesteal reduction and spell lifesteal reduction on the target. Can reduce health restoration by up to 10%\/20%\/30%\/40%\/50%\/60%\/70%, based on the amount of stacks.",
        "Works against every unit Frost Arrows can affect. Also works when applied with Multishot or instant attacks (e.g. Splinter Shots).",
        "A number on the icon, as well as a number above the target show the current amount of stacks on them.",
        "The debuff applies heal reduction, health regeneration reduction, lifesteal reduction and spell lifesteal reduction on the target.",
        "Can reduce health restoration by up to 10%\/20%\/30%\/40%\/50%\/60%\/70%, based on the amount of stacks.",
        "If the target dies, including Reincarnation, with the hypothermia debuff on them, they release projectile towards all enemies within a 650 radius around them. These projectiles travel at a speed of 1300. The projectiles first apply the damage, then the debuff. The projectiles deal up to 60\/120\/180\/240\/300\/360\/420 damage, based on how many stacks the unit had.",
        "These projectiles travel at a speed of 1300.",
        "The projectiles first apply the damage, then the debuff.",
        "The projectiles deal up to 60\/120\/180\/240\/300\/360\/420 damage, based on how many stacks the unit had.",
        "SHARD NOTES The bonus damage increases to the following values with certain amount of hypothermia stacks on each level: Level 1: 11\/16\/21\/26\/31\/36\/41 (TagTalent 26\/31\/36\/41\/46\/51\/56) damage Level 2: 17\/22\/27\/32\/37\/42\/47 (TagTalent 32\/37\/42\/47\/52\/57\/62) damage Level 3: 23\/28\/33\/38\/43\/48\/53 (TagTalent 38\/43\/48\/53\/58\/63\/68) damage Level 4: 29\/34\/39\/44\/49\/54\/59 (TagTalent 44\/49\/54\/59\/64\/69\/74) damage",
        "Level 1: 11\/16\/21\/26\/31\/36\/41 (TagTalent 26\/31\/36\/41\/46\/51\/56) damage",
        "Level 2: 17\/22\/27\/32\/37\/42\/47 (TagTalent 32\/37\/42\/47\/52\/57\/62) damage",
        "Level 3: 23\/28\/33\/38\/43\/48\/53 (TagTalent 38\/43\/48\/53\/58\/63\/68) damage",
        "Level 4: 29\/34\/39\/44\/49\/54\/59 (TagTalent 44\/49\/54\/59\/64\/69\/74) damage",
        ""
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Frost Arrows",
      "cooldown": "9\/10\/11\/12",
      "description": "Adds a freezing effect to Drow's attacks, slowing enemy movement and dealing bonus damage. Slow lasts 1.5 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Range:  625",
        "Base Damage: 6\/12\/18\/24 ( 21\/27\/33\/39)",
        "Move Speed Slow: 10%\/25%\/40%\/55%",
        "Slow Duration: 1.5",
        "Burst Radius: 650",
        "Max Stacks: 7",
        "Extra Damage per Stack: 5",
        "Burst Damage per Stack: 60",
        "Burst Move Speed Slow: 40%",
        "Health Restoration Reduction per Stack: 10%",
        "Burst Slow Duration: 2",
        "Stacks Duration: 7"
      ],
      "legacy_key": "R",
      "story": "Ice-encased arrows pierce the silence, chilling their victims to the core."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Drow_Ranger_Gust.mp3\/revision\/latest?cb=20191215202225",
      "effects": [
        "Ability: Target Point",
        "Affects: Self \/ Enemies"
      ],
      "notes": [
        "With the travel distance and the effect radius, Gust reaches up to 1150 range away. The wave travels at a speed of 2000, reaching max distance in 0.45 seconds.",
        "The wave travels at a speed of 2000, reaching max distance in 0.45 seconds.",
        "The knockback distance is based on the distance between Drow Ranger and the affected enemies. The closer they are, the further they get knocked back. The knockback is strongest when the distance between Drow Ranger and the enemy is 1 range, pushing the enemy 450 range away. Each additional range of distance between them affects the knockback's distance, reducing it by 0.5. However, the knockback values are truncated, so that the knockback distance decreases by 1 for every 2 – 2 range between Drow and the enemy. Due to this, the minimum knockback distance is 1 range. When standing at the exact same location as Drow Ranger, the formula multiplies by 0, which results in no knockback.",
        "The knockback is strongest when the distance between Drow Ranger and the enemy is 1 range, pushing the enemy 450 range away.",
        "Each additional range of distance between them affects the knockback's distance, reducing it by 0.5.",
        "However, the knockback values are truncated, so that the knockback distance decreases by 1 for every 2 – 2 range between Drow and the enemy.",
        "Due to this, the minimum knockback distance is 1 range.",
        "When standing at the exact same location as Drow Ranger, the formula multiplies by 0, which results in no knockback.",
        "Since the knockback distances does not scale with higher ability levels, but the knockback duration does, the knockback speed gets lower on each level. This results in a maximum knockback speed is 750\/642.86\/562.5\/500, while the minimum speed is 1.67\/1.43\/1.25\/1.11.",
        "This results in a maximum knockback speed is 750\/642.86\/562.5\/500, while the minimum speed is 1.67\/1.43\/1.25\/1.11.",
        "Can push units over impassable terrain. Destroys trees enemies come in contact with during the knockback.",
        "Units are not disabled during the knockback. They can still turn, attack and use items. Does not interrupt channeling abilities. Successive debuffs do not stack but refresh the duration instead.",
        "Successive debuffs do not stack but refresh the duration instead.",
        "Does not affect Roshan.",
        "TALENT NOTES The Gust reveal invisible enemies talent instantly update the current active debuffs. The debuff places True Sight on affected units in the Fog of War and on invulnerable units, but not on hidden units or on wards. Cannot detect units under the effect of Shadow Dance, Depth Shroud and Smoke of Deceit (although the debuff is still placed on them).",
        "The debuff places True Sight on affected units in the Fog of War and on invulnerable units, but not on hidden units or on wards.",
        "Cannot detect units under the effect of Shadow Dance, Depth Shroud and Smoke of Deceit (although the debuff is still placed on them)."
      ],
      "mana": "19\/17\/15\/13 (TagTalent 15\/13\/11\/9)",
      "item_behaviour": [],
      "name": "Gust",
      "cooldown": "70",
      "description": "Releases a wave that silences and knocks back enemy units. Knockback distance is relative to how close they are to Drow. Drow Gains Movement Speed for the same duration.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.25+0.6",
        "Cast Range:  900",
        "Travel Distance:  900",
        "Effect Radius: 250",
        "Max Knockback Distance: 450",
        "Knockback Duration: 0.6\/0.7\/0.8\/0.9",
        "Self Move Speed Bonus: 10% ( 25%)",
        "Buff\/Debuff Duration: 3\/4\/5\/6"
      ],
      "legacy_key": "E",
      "story": "Traxex is rather fond of the tranquility of physical combat, calling on her Drow heritage to end the incantations of opposing magi."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ec\/Drow_Ranger_Multishot.mp3\/revision\/latest?cb=20191215202228",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "notes": [
        "The arrows fly at a speed of 1200, and fly either the full distance or until hitting an enemy. The speed is not affected by projectile speed increasing effects.",
        "The speed is not affected by projectile speed increasing effects.",
        "Releases the waves in a 0.55-second interval. The first wave starts 0.1 seconds after the channel begins. Within the waves, the arrows are released with a 0.033-second delay between them, so it takes 0.1 seconds for all arrows of one wave to be released. This results in a total duration of 1.3 seconds to release all arrows, making it safe to cancel the last 0.45 seconds of the channeling without losing an arrow.",
        "Within the waves, the arrows are released with a 0.033-second delay between them, so it takes 0.1 seconds for all arrows of one wave to be released.",
        "This results in a total duration of 1.3 seconds to release all arrows, making it safe to cancel the last 0.45 seconds of the channeling without losing an arrow.",
        "The arrows are released in a cone centered in front of Drow Ranger. The first arrow in each wave always starts on Drow Ranger's right side. The cone's angle is calculated as if 6 arrows get released per wave. If 6 arrows would get released, the cone's angle would be 50°. However, since only 4 arrows get released, the cone's angle is 33.33°, with an angle of 8.33° between each arrow. Considering Drow Ranger's default attack range of 625, the cone has a length of 1094, and an end radius of 358.5. The travel distance can be further increased by other attack range bonuses.",
        "The cone's angle is calculated as if 6 arrows get released per wave. If 6 arrows would get released, the cone's angle would be 50°.",
        "However, since only 4 arrows get released, the cone's angle is 33.33°, with an angle of 8.33° between each arrow.",
        "Considering Drow Ranger's default attack range of 625, the cone has a length of 1094, and an end radius of 358.5.",
        "The travel distance can be further increased by other attack range bonuses.",
        "The arrows provide 100 radius flying vision around them as they travel.",
        "An enemy may only be hit one arrow per wave, so that up to 3 (TagTalent 6) arrows can hit the same enemy per cast.",
        "Despite the appearance, Multishot are not instant attacks. Instead, it deals physical spell damage based on the caster's average main attack damage, plus Frost Arrows' damage. Other attack damage bonuses are ignored. This means the arrows cannot proc any attack modifier or trigger any on-attack effects, but are affected by spell damage amplification and spell lifesteal. The damage dealt can be defined as (TagTalent 6\/12\/18\/24 + f(x) + 32.5 + ΣAgi) × 100%\/120%\/140%\/160% (TagTalent 125%\/145%\/165%\/185%) Multishot does not affect attack immune units.",
        "Instead, it deals physical spell damage based on the caster's average main attack damage, plus Frost Arrows' damage. Other attack damage bonuses are ignored.",
        "This means the arrows cannot proc any attack modifier or trigger any on-attack effects, but are affected by spell damage amplification and spell lifesteal.",
        "The damage dealt can be defined as (TagTalent 6\/12\/18\/24 + f(x) + 32.5 + ΣAgi) × 100%\/120%\/140%\/160% (TagTalent 125%\/145%\/165%\/185%)",
        "Multishot does not affect attack immune units.",
        "The arrows also apply Frost Arrows on their targets, based on its current level. If Frost Arrows is not leveled, its damage and debuffs are not applied. The Frost Arrows applied by Multishot do not cost any mana. Like on regular attacks, the arrows first apply Hypothermia debuff, then the slow debuff, then their own damage. Also like on regular attacks, the Frost Arrows damage is dealt in one instance together with the Multishot's damage and is affected by the damage percentage as well.",
        "If Frost Arrows is not leveled, its damage and debuffs are not applied.",
        "The Frost Arrows applied by Multishot do not cost any mana.",
        "Like on regular attacks, the arrows first apply Hypothermia debuff, then the slow debuff, then their own damage.",
        "Also like on regular attacks, the Frost Arrows damage is dealt in one instance together with the Multishot's damage and is affected by the damage percentage as well.",
        "Does not affect Couriers."
      ],
      "mana": "26\/24\/22\/20 (TagTalent 18\/16\/14\/12)",
      "item_behaviour": [],
      "name": "Multishot",
      "cooldown": "50\/70\/90\/110",
      "description": "Drow releases a flurry of arrows in continuous salvos, hitting enemies for extra damage and applying longer duration Frost Arrows. Lasts up to 1.75 seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: Global",
        "Attack Range as Travel Distance:  175%",
        "Arrows Cone Angle: 50°",
        "Arrows Collision Radius: 90",
        "Max Channel Time: 1.75 ( 2.85)",
        "Number of Waves: 3 ( 6)",
        "Arrows per Wave: 4",
        "Main Attack Damage as Damage: 100%\/120%\/140%\/160% ( 125%\/145%\/165%\/185%)",
        "Arrows Slow Duration: 1.25\/2\/2.75\/3.5"
      ],
      "legacy_key": "T",
      "story": "In the ranger's youth, learning to fire multiple arrows at once was considered a distracting frivolity. In the war of the Ancients, such technique has become strange necessity."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Drow_Ranger_Marksmanship.mp3\/revision\/latest?cb=20191215202226",
      "effects": [
        "Ability: Passive",
        "Affects: Self \/ Enemies",
        "Damage: Physical"
      ],
      "notes": [
        "An icy particle effect is visible on Drow Ranger while Marksmanship is active.",
        "The aura checks for nearby enemy heroes, including invulnerable or hidden enemies, in 0.1-second intervals and adapts the bonus accordingly. Neither reacts on the presence of illusions nor creep-heroes. Checks for Drow Ranger's agility within the same intervals and adapts the bonus agility instantly. The aura affects invulnerable, but not hidden ranged allies, and its buff lingers for 0.5 seconds.",
        "Neither reacts on the presence of illusions nor creep-heroes.",
        "Checks for Drow Ranger's agility within the same intervals and adapts the bonus agility instantly.",
        "The aura affects invulnerable, but not hidden ranged allies, and its buff lingers for 0.5 seconds.",
        "Marksmanship's damage is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Drow Ranger's attack damage. The attack damage bonus values are not considered by critical strike. However, it is considered by lifesteal and cleave, and it can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Drow Ranger's attack damage.",
        "The attack damage bonus values are not considered by critical strike.",
        "However, it is considered by lifesteal and cleave, and it can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Marksmanship grants the proccing attack True Strike and the proc damage ignores main armor. Neither proc against attacking buildings nor attacking allies.",
        "Neither proc against attacking buildings nor attacking allies.",
        "Marksmanship uses pseudo-random distribution.",
        "Visually alters Drow Ranger's attack projectile when proccing. All attack projectiles have the following visual priorities: Corruption or Greater Corruption ➤ Cold Attack ➤ Marksmanship procs.",
        "Corruption or Greater Corruption ➤ Cold Attack ➤ Marksmanship procs.",
        "SCEPTER NOTES Successful attacks now release 2 splinter projectiles within 375 radius on random enemies around the primary attacked target. Missed or disjointed attacks do not release any splinters. Attacks do not splinter to or from invisible, invulnerable or hidden units. Attacks also do not splinter to Couriers, buildings, wards, allied units or units in the Fog of War, but can splinter off of them to nearby valid targets. The enemy hero search radius does not disable this upgrade.",
        "Missed or disjointed attacks do not release any splinters.",
        "Attacks do not splinter to or from invisible, invulnerable or hidden units.",
        "Attacks also do not splinter to Couriers, buildings, wards, allied units or units in the Fog of War, but can splinter off of them to nearby valid targets.",
        "The enemy hero search radius does not disable this upgrade.",
        "Splinter projectiles are considered as regular spell projectiles. The splinters use Drow Ranger's 1250 projectile speed and are disjointable. For melee heroes, it uses the same arrow model, splinter projectiles, and has the same projectile speed. Causes Drow Ranger to perform an instant attack on the target if the splinter hits its target. The instant attacks do not use attack projectiles and are instant, but still count as a ranged attack if coming from Drow Ranger. These instant attacks can proc any attack modifiers and on-hit effects normally (including Marksmanship). They do not have True Strike.",
        "For melee heroes, it uses the same arrow model, splinter projectiles, and has the same projectile speed.",
        "Causes Drow Ranger to perform an instant attack on the target if the splinter hits its target.",
        "The instant attacks do not use attack projectiles and are instant, but still count as a ranged attack if coming from Drow Ranger.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally (including Marksmanship). They do not have True Strike.",
        "SCEPTER NOTES The instant attacks deal damage to secondary targets based on Drow Ranger's total attack damage independently from the primary attacked target. The 50% splinter damage reduction only applies to her main attack damage. Other damage dealt in separate instances (e.g. Chain Lightning) is unaffected.",
        "The 50% splinter damage reduction only applies to her main attack damage.",
        "Other damage dealt in separate instances (e.g. Chain Lightning) is unaffected.",
        "When Frost Arrows is set to Autocast, Frost Arrows based on its current level and the upgrade is applied with the instant attack. The Autocast check is performed when the instant attack is performed. The Frost Arrows applied are independent from the ability and do not cost any mana.",
        "The Autocast check is performed when the instant attack is performed.",
        "The Frost Arrows applied are independent from the ability and do not cost any mana."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Marksmanship",
      "cooldown": null,
      "description": "Drow's experiences in battle grant her a chance to launch arrows with incredible accuracy and effectiveness. Pierces through the enemy's defenses, ignoring their base armor. Grants Drow and nearby ranged heroes with bonus agility based on Drow's current agility. This ability is disabled if there is an enemy hero within 400 range.",
      "hot_key": "R",
      "params": [
        "Enemy Hero Search Radius: 400",
        "Aura Radius: 1200",
        "Agility as Ranged Agility Bonus: 30%\/40%\/50%",
        "Proc Chance: 20%\/30%\/40% ( 32%\/42%\/52%)",
        "Proc Damage: 40\/60\/80",
        "Aura Linger Duration: 0.5",
        "Splinter Search Radius: 375",
        "Max Splinter Targets: 2",
        "Splinter Damage Reduction: 50%"
      ],
      "legacy_key": "P",
      "story": "The Drow Ranger is the epitome of archery prowess."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.9,
    "attrStrength": 16.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.9,
    "attrAgility": 20.0
  },
  "description": "Slows with her frost-tipped arrows Dwelling deep within the forest, few have ever caught glimpse of the solitary and impossibly beautiful Drow Ranger. Her presence was known only from the chill of Frost Arrows, driving deep into her enemies' hearts. Named and raised by the sympathetic Drow, Traxex draws on her heritage to send forth a powerful Gust, silencing and repulsing assailants who venture too close. Although normally aiming for precision, Traxex does not shy away from unorthodox methods, launching a rapid salvo of ice-tipped arrows at multiple targets at once. Honing her skill to peerless precision, the Drow Ranger's legendary Marksmanship only improves with each passing skirmish.  Carry Disabler Pusher ★☆☆",
  "trivia": [
    "Traxex's original design was slightly different from the one now; aside from the same hood, her white hair was not present, and her eyes were completely white. Her outfit was also slightly more revealing. This was changed with her March 2019 reskin.",
    "From her transition to Dota 2, the name of her aura changed from \"Trueshot Aura\" to \"Precision Aura\".",
    "Drow Ranger's response Link▶️ \"I quiver with anticipation.\" references a line in The Rocky Horror Picture Show \"I see you shiver with anticipation.\""
  ],
  "history": "Drow Ranger's given name is Traxex--a name well suited to the short, trollish, rather repulsive Drow people. But Traxex herself is not a Drow. Her parents were travelers in a caravan set upon by bandits, whose noisy slaughter of innocents roused the ire of the quiet Drow people. After the battle settled, the Drow discovered a small girl-child hiding in the ruined wagons, and agreed she could not be abandoned. Even as child, Traxex showed herself naturally adept at the arts they prized: Stealth, silence, subtlety. In spirit, if not in physique, she might have been a Drow changeling, returned to her proper home. But as she grew, she towered above her family and came to think of herself as ugly. After all, her features were smooth and symmetrical, entirely devoid of warts and coarse whiskers. Estranged from her adopted tribe, she withdrew to live alone in the woods. Lost travelers who find their way from the forest sometimes speak of an impossibly beautiful Ranger who peered at them from deep among the trees, then vanished like a dream before they could approach. Lithe and stealthy, icy hot, she moves like mist in silence. That whispering you hear is her frozen arrows finding an enemy's heart.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+12% Marksmanship Chance",
        "talent_left": "+3 Multishot Waves"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+25% Multishot Damage",
        "talent_left": "-4s Gust Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "Gust Reveals Invisible Units",
        "talent_left": "-8s Multishot Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+15% Gust Self Movement Speed",
        "talent_left": "+15 Frost Arrow Damage"
      }
    ]
  }
}