{
  "abilities": [
    {
      "notes": [
        "Копия движется к указанной точке со скоростью в 900",
        "По достижении выбранной точки копия поворачивается в указанное направление и остаётся неактивной 0,4 сек",
        "После задержки активации копия даёт летающий обзор перед собой\n Обзор даётся двумя ячейками обзора, каждая с радиусом 200\n Первая ячейка обзора распологается перед копией на расстоянии 225 от неё, вторая на расстоянии 450\n Сама копия имеет наземный обзор в радиусе 250\n Это обзор модели и он всегда даётся вокруг копии\n Вместе с собственным обзором копии, общая область обзора имеет длину 925 и ширину 450",
        "После задержки копия ищет врагов на пути перед ней\n Путь поиска имеет длину 450 и ширину \n Если в области несколько врагов, копия притягивает самого дальнего и ближнего к центральной линии",
        "Гипнотизирует цель, заставляя её двигаться к копии и не давая ей действовать\n Устанавливает скорость передвижения цели на 44%\/50%\/56%\/62% от расстоянии между копией и целью\n Если цель слишком близко, движение прекратится как только она будет на расстоянии в 100 от копии\n При применении на максимальную дальность скорость будет составлять 235,71\/234,38\/233,33\/232,5\n Даёт цели беспрепятственное передвижение, так что она может передвигаться через возвышенности, деревья и других существ, пока идёт к копии",
        "Скорость устанавливается при применении\n Если цель подвинется или телепортируется, скорость не изменится",
        "Aether Remnant сперва наносит урон, затем применяет дебафф притягивания",
        "В конце гипноза разрушает деревья вокруг цели в радиусе 200",
        "Талант 15-го уровня добавляет True Sight радиусом 475 вокруг копии"
      ],
      "item_behaviour": [],
      "description": "Векторное применение. Герой отправляет в указанную точку свою копию. Копия смотрит в сторону, указанную при применении. Когда в её обзор попадает существо, копия притягивает его и наносит урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 850",
        "Расстояние поиска копии: 450",
        "Ширина обзора копии: 130",
        "Радиус пути обзора вгляда: 200",
        "Задержка активации: 0,4",
        "Урон: 80\/130\/180\/230 ( 130\/180\/230\/280)",
        "Проходимая дистанция: 44%\/50%\/56%\/62%",
        "Длительность притягивания: 1,4\/1,6\/1,8\/2",
        "Длительность копии: 20",
        "Радиус True Sight:  475"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Void_Spirit_Aether_Remnant_1.mp3\/revision\/latest?cb=20191215162220",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "17\/15\/13\/11",
      "aghanim": null,
      "name": "Aether Remnant",
      "cooldown": "75\/80\/85\/90",
      "legacy_key": "R",
      "story": "Инай существует далеко не в одной точке пространства и времени."
    },
    {
      "notes": [
        "Создаёт 7 ( 13) порталов, располагая один портал в месте применения\n Оставшиеся 6 порталов образуют круг вокруг центрального портала на расстоянии 520 от его центра\n Один портал создаётся в направлении взгляда Void Spirit, а другие 5 подстраиваются под него, с углами 60 градусов между ними, формируя шестиугольник\n С <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard оставшиеся 6 порталов располагаются по прямой относительно внутренних\n С <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard внешние порталы расположены в 6 от центрального портала и используют те же углы, что и внутренние",
        "Игрок может выбрать портал для появления, отдавая команду движения\n Команда движения даётся нажатием правой кнопкой мыши или нажатием горячей клавиши движения и выбором точки\n Прямое нажатие на порталы не требуется, достаточно команды направления\n Будет выбран ближайший портал к месту нажатия правой кнопкой мыши\n Игрок может изменять выбранные порталы во время длительности исчезновения сколько угодно раз\n Выбранный портал подсвечивается для Void Spirit и его союзников\n Для врагов все порталы выглядят одинаково",
        "Делает заклинателя неуязвимым и спрятанным на длительность",
        "Способность обезвреживает, обезмолвливает, заглушает и обезоруживает Void Spirit, запрещая ему делать что-либо\n Команды атаки ведут себя так же, как и команды движения во время обезоруживания, поэтому выбор врага правой кнопкой мыши также выберет ближайший портал к этому врагу",
        "Не даёт сквозное передвижение, поэтому Void Spirit всё ещё может блокировать других существ во время Dissimilate",
        "Не избегает снаряды при телепортации",
        "Урон наносится вокруг выбранного портала при появлении\n  Талант 25-го уровня также добавляет к нему оглушение в 2 сек\n Сперва наносится урон, затем применяется оглушение"
      ],
      "item_behaviour": [],
      "description": "Герой временно исчезает в иной мир, создавая несколько порталов, через которые он может собрать свою сущность воедино. Выйдя из портала, герой наносит урон всем врагам в области действия.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0",
        "Радиус портала: 275",
        "Радиус первого кольца: 520",
        "Порталов в первом круге: 6",
        "Урон: 100\/180\/260\/340 ( 235\/315\/395\/475)",
        "Длительность исчезновения: 1,3",
        "Длительность оглушения:  2",
        "Радиус второго кольца:  1040",
        "Порталов во втором круге:  6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Void_Spirit_Dissimilate_1.mp3\/revision\/latest?cb=20191215162213",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "20\/17\/14\/11",
      "aghanim": null,
      "name": "Dissimilate",
      "cooldown": "100\/110\/120\/130",
      "legacy_key": "D",
      "story": "Инай предпочитает наблюдать за нашим миром, не обременяя себя материальной формой."
    },
    {
      "notes": [
        "При применении прерывает произносимые заклинания Void Spirit",
        "Волна распространяется со скоростью 1200, расширяясь за 0,42 сек\n до максимального радиуса и рассеиваясь",
        "Волна представляет собой тонкий круг, расширяющееся наружу\n То есть его можно избежать телепортацией внутрь круга к Void Spirit",
        "Любой враг, задетый кругом, получает урон и выпускает снаряд, движущийся к Void Spirit со скоростью в 900\n Как только эти снаряды достигают Void Spirit, они увеличивают прочность оболочки на данное значение\n Если базовая оболочка разрушится до прибытия снарядов, то они создадут новую с собственной прочностью\n Эти снаряды нельзя избежать",
        "Волна связана с модификатором Resonant Pulse Ring\n Несколько модификаторов складываются, поэтому каждое применение выпускает круг\n Модификатор пропадает при смерти, поэтому смерть останавливает круг",
        "Оболочка работает только против урона от физической атаки\n Магический или чистый урон атаки, а также урон заклинаний любого типа не блокируются",
        "Блокирует урон после уменьшения бронёй, но до любых других уменьшений",
        "Несколько оболочек не складываются, повторное применение обновляет длительность и сбрасывает значение накопления",
        "С улучшением от <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter волна сначала наносит урон, затем применяет дебафф"
      ],
      "item_behaviour": [],
      "description": "Герой помещает себя в защитную оболочку, которая поглощает физический урон и выпускает одну наносящую урон волну. Оболочка поглощает тем больше урона, чем больше вражеских героев заденет волна.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 500",
        "Урон: 70\/120\/170\/220 ( 76\/126\/176\/226)",
        "Блокируемый урон физических атак: 40\/80\/120\/160",
        "Доп\n поглощение за пораженного героя: 30\/45\/60\/70",
        "Длительность оболочки: 10",
        "Длительность безмолвия:  2",
        "Число зарядов:  2",
        "Время восстановления заряда:  18"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c9\/Void_Spirit_Resonant_Pulse_1.mp3\/revision\/latest?cb=20191215162216",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "18 (TagTalent 0,25)",
      "aghanim": null,
      "name": "Resonant Pulse",
      "cooldown": "115\/120\/125\/130",
      "legacy_key": "E",
      "story": "Инай без сомнений укрывается своей истинной сущностью, когда ему приходится взаимодействовать с миром смертных."
    },
    {
      "notes": [
        "При применении Void Spirit мгновенно телепортируется в указанную точку",
        "Не избегает снаряды при телепортации",
        "Применяет мгновенную атаку на каждое вражеское существо на пути\n Эти атаки имеют True Strike и игнорируют обезоруживания\n Может сработать любой модификатор атаки, кроме рассечения\n Может также спровоцировать эффекты от удара\n  Талант 25-го уровня также добавляет к мгновенной атаке критический удар",
        "Все пораженные враги также получают замедляющий дебафф\n Этот дебафф наносит урон при исчезновении\n То есть его развеивание наносит урон досрочно\n Несколько применений дебаффа сочетаются и действуют независимо друг от друга",
        "Astral Step сперва применяет мгновенную атаку, затем дебафф"
      ],
      "item_behaviour": [],
      "description": "Герой перемещается в указанную точку через астральный разлом, атакуя всех врагов на пути. Эта атака накладывает метку пустоты, которая замедляет жертв на 1,25 сек. и затем наносит урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: Глобальная",
        "Минимальное расстояние: 200",
        "Максимальное расстояние: 800\/900\/1000",
        "Ширина пути: 170",
        "Замедление скорости передвижения: 40%\/60%\/80%",
        "Критический урон: 100% ( 160%)",
        "Урон метки: 150\/250\/350",
        "Длительность метки: 1,25",
        "Число зарядов: 2",
        "Время восстановления заряда: 28\/23\/18 ( 24\/19\/14)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/77\/Void_Spirit_Astral_Step_1.mp3\/revision\/latest?cb=20191215162210",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ Себя",
        "Урон: Мгновенная атака"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Astral Step",
      "cooldown": "100",
      "legacy_key": "T",
      "story": "Один шаг Иная приводит к страшным разрушениям в мире смертных."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 2.2,
    "attrAgility": 19.0
  },
  "description": "Dissimilate накладывает оцепенение на 2 сек. Критические атаки в 160% урона от Astral Step −4 сек. восстановления заряда Astral Step +120 к урону от Resonant Pulse Внешний круг у Dissimilate Копия раскрывает невидимость в радиусе 475 +50 к урону от Aether Remnant +1,75 маны в секунду",
  "history": "Даже другие духи не понимают стремлений и замыслов их старшего брата Иная, духа пустоты. Он хранит секреты, которые могут расколоть сознание смертного, и наблюдает за мановениями вселенной с непостижимой прозорливостью, оставляя подготовленным слугам исполнять его волю; и только если он решит, что больше никто не сможет направить реальность на верный путь, он покинет сокрытый храм и переместится в материальный мир. Инай видит перед собой всё сущее, но его взгляд прикован к тому моменту времени, в котором столкнётся множество реальностей - грядущее ему неведомо.Теперь же он материализуется из небытия, чтобы лично решить исход битвы Древних и подготовить своих союзников к более важному противостоянию."
}