{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/04\/Hurricane_Pike_Hurricane_Thrust_1.mp3\/revision\/latest?cb=20191227195440",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "Double clicking the item casts it on self.",
        "Pushes the target at a speed of 1200, if the target is self or an ally. Pushes the caster and target at a speed of 2250, if the target is an enemy.",
        "Targeting allies pushes them based on their facing direction. Targeting enemies pushes them based on the caster's facing direction. The caster is pushed into the opposite direction, adding a 900 range distance between the caster and targeted enemy. The caster is only pushed when the target was an enemy, not an ally.",
        "The caster is pushed into the opposite direction, adding a 900 range distance between the caster and targeted enemy.",
        "The caster is only pushed when the target was an enemy, not an ally.",
        "The unlimited attack range only works against the targeted enemy. Attacking other units still uses the regular attack range.",
        "Same goes for the attack speed. When switching targets uses regular attack speed. Updates the speed upon reaching attack point.",
        "Gives the caster an attack order on the target if the target is an enemy. This effect works exclusively for ranged heroes.",
        "The push does not disabled affected units, so they still can cast spells or items, attack and turn during the push. This means it does not cancel channeling spells of the target. However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "This means it does not cancel channeling spells of the target.",
        "However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "Does not push units affected by Black Hole, Chronosphere, Duel, or Flaming Lasso.",
        "Cannot push units through Kinetic Fields or Arenas of Blood.",
        "If a pushed unit is affected by Soulbind, it cannot push the unit further than its max stretch distance allows.",
        "If a pushed unit is leashed by Pounce, the leash gets instantly broken upon cast. However, if a pushed unit gets leashed after cast, it cannot push the unit further than the max stretch distance of Pounce allows.",
        "However, if a pushed unit gets leashed after cast, it cannot push the unit further than the max stretch distance of Pounce allows.",
        "Cannot be cast on wards or buildings. Can be cast on Homing Missiles.",
        "Can move units over impassable terrain. Trees within 100 radius around the pushed target get destroyed during the push.",
        "Can be cast on Roshan but without pushing him, since Roshan is immune to forced movement. The caster still gets pushed and gains the range\/speed buff.",
        "Casting on self or allies uses the default Force Staff sound.",
        "Shares cooldown with Force Staff. Does not share cooldown with Force Boots."
      ],
      "mana": "100",
      "abilityName": "Hurricane Thrust",
      "cooldown": null,
      "description": "Pushes you and target enemy 450 units away from each other, and for 5 seconds, allows you to make 4 attacks against the target without range restrictions and with +100 attack speed. Works like Force Staff when used on self or allies.",
      "params": [
        "Cast Range (Ally\/Self): 550",
        "Cast Range (Enemy): 400",
        "Push Distance (Ally\/Self): 600",
        "Push Distance (Enemy): 450",
        "Push Duration (Ally\/Self): 0.5",
        "Push Duration (Enemy): 0.2",
        "Number of Attacks: 4",
        "Attack Speed Bonus: 100",
        "Buff Duration: 5"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_partial_symbol)^Partially pierces spell immunity\nCan be cast on self while spell immune\nCannot be cast on other spell immune units."
      ],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "Dragon's Reach",
      "cooldown": null,
      "description": "Increases attack range of ranged heroes by 140.",
      "params": [
        "Attack Range Bonus: 140"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 300 health, 4 health regen, 3.33 armor, 20 attack speed, 156 mana, 0.65 mana regen and 15 attack damage.",
    "For agility heroes, it grants 300 health, 4 health regen, 3.33 armor, 20 attack speed, 156 mana, 0.65 mana regen and 20 attack damage.",
    "For intelligence heroes, it grants 300 health, 4 health regen, 3.33 armor, 20 attack speed, 156 mana, 0.65 mana regen and 13 attack damage.",
    "Attack range bonuses from multiple Dragon Lance based items do not stack.",
    "Stacks with all other attack range bonuses.",
    "Affects the cast range of active attack modifiers as well."
  ],
  "cost": "4525",
  "lore": null,
  "consistFrom": [
    "Force Staff",
    "Dragon Lance",
    "Recipe"
  ],
  "boughtFrom": "Armor",
  "name": "Hurricane Pike",
  "description": "A legendary pike once held as royal sigil of the ancient wyvern riders.",
  "trivia": [
    "Hurricane Pike's icon shows that it is half Force Staff, half Dragon Lance.",
    "The name may be from the last volume of Kaze no Stigma where the Hurricane Pike, also known as Kokusen, is a divine artifact that greatly enhances the power of a wind mage.",
    "Prior to the July 14, 2017 Patch, Hurricane Pike's active ability, Hurricane Thrust, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+15 Strength",
    "+20 Agility",
    "+13 Intelligence",
    "+2.5 Health regeneration",
    "+140 Attack range (ranged)"
  ],
  "tips": [
    "Make sure to have Ward, tower or cliff vision or you will lose sight of your target, rendering the unlimited range useless. Alternatively, you either need a spell of your own to give you vision over the enemy (such as Weaver's The Swarm), or work with an ally to keep vision over him ( Bounty Hunter's Track is the obvious choice, Thundergod's Wrath, Corrosive Haze, Thunder Strike, Haunt also work, to name a few).",
    "Alternatively, you either need a spell of your own to give you vision over the enemy (such as Weaver's The Swarm), or work with an ally to keep vision over him ( Bounty Hunter's Track is the obvious choice, Thundergod's Wrath, Corrosive Haze, Thunder Strike, Haunt also work, to name a few).",
    "Hurricane Pike can be used as an escape mechanism by pushing away persistent enemies.",
    "Enemies can be pushed away in mid-air, like during Earthshaker's upgraded Enchant Totem and units Tossed by Tiny.",
    "It is possible to propel yourself through Disruptor's Kinetic Field by using the active on an enemy with your back toward the rim, pushing yourself backwards through the barrier. Be wary, as this can also accidentally save an enemy from your team's Disruptor as well. This cannot be done with the normal self-push and regular Force Staff, both of which get stopped by the barrier."
  ]
}