{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c9\/Leshrac_Split_Earth.mp3\/revision\/latest?cb=20191216015216",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Split Earth first applies the debuff, then the damage.",
        "Destroys trees within the affected radius.",
        "Split Earth has no visual or audio indicator during the effect delay.",
        "SHARD NOTES Split Earth now applies its effect 4 times at the targeted point. The first instance still happens 0.35 seconds after cast. The following instances happen 5.35\/10.35\/15.35 seconds after cast. The visual effect during the delay between the extra instances is visible to everyone. Each instance has the following radius: Level 1: 150\/210\/270\/330 (TagTalent 190\/250\/310\/370) Level 2: 175\/235\/295\/355 (TagTalent 215\/275\/335\/395) Level 3: 200\/260\/320\/380 (TagTalent 240\/300\/360\/420) Level 4: 225\/285\/345\/405 (TagTalent 265\/325\/385\/445)",
        "The first instance still happens 0.35 seconds after cast. The following instances happen 5.35\/10.35\/15.35 seconds after cast.",
        "The visual effect during the delay between the extra instances is visible to everyone.",
        "Each instance has the following radius: Level 1: 150\/210\/270\/330 (TagTalent 190\/250\/310\/370) Level 2: 175\/235\/295\/355 (TagTalent 215\/275\/335\/395) Level 3: 200\/260\/320\/380 (TagTalent 240\/300\/360\/420) Level 4: 225\/285\/345\/405 (TagTalent 265\/325\/385\/445)",
        "Level 1: 150\/210\/270\/330 (TagTalent 190\/250\/310\/370)",
        "Level 2: 175\/235\/295\/355 (TagTalent 215\/275\/335\/395)",
        "Level 3: 200\/260\/320\/380 (TagTalent 240\/300\/360\/420)",
        "Level 4: 225\/285\/345\/405 (TagTalent 265\/325\/385\/445)",
        ""
      ],
      "mana": "9",
      "item_behaviour": [],
      "name": "Split Earth",
      "cooldown": "80\/100\/120\/140",
      "description": "Splits the earth under enemies. Deals damage and stuns for a short duration.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.7+0.67",
        "Cast Range:  650",
        "Base Radius: 150\/175\/200\/225 ( 190\/215\/240\/265)",
        "Number of Instances: 1 ( 4)",
        "Effect Delay: 0.35",
        "Damage: 120\/180\/240\/300",
        "Stun Duration: 2",
        "Radius Increase per Instance: 60",
        "Radius Increase Interval: 5"
      ],
      "legacy_key": "T",
      "story": "Twisting nature to his vile will, the shifting earth consumes those unlucky enough to cross Leshrac's path."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Leshrac_Diabolic_Edict.mp3\/revision\/latest?cb=20191216015221",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "notes": [
        "Diabolic Edict's radius is centered on and follows Leshrac.",
        "Randomly selects nearby valid units, including buildings, for each explosion. There are no priorities. Fully affects invisible units and units in the Fog of War. When no valid targets are nearby, the explosions randomly appear within a square with 500 side lengths. These random explosions deal no damage.",
        "Fully affects invisible units and units in the Fog of War.",
        "When no valid targets are nearby, the explosions randomly appear within a square with 500 side lengths. These random explosions deal no damage.",
        "Creates explosions in 0.25 (TagTalent 0.15)-second intervals, starting immediately as the ability is cast, resulting in 40 (TagTalent 65) explosions.",
        "Can deal up to 280\/560\/840\/1120 (TagTalent 455\/910\/1365\/1820) damage to a single target.",
        "Successive cast of Diabolic Edict fully stack, with each cast creating its own independent instance.",
        "When Leshrac dies, the explosions still occur at his death location."
      ],
      "mana": "22",
      "item_behaviour": [],
      "name": "Diabolic Edict",
      "cooldown": "95\/120\/135\/155",
      "description": "Saturates the area around Leshrac with magical explosions that deal pure damage to enemy units and structures. The fewer units available to attack, the more damage those units will take. Lasts 10 seconds.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.5+0.87",
        "Radius: 500",
        "Number of Explosions: 40 ( 65)",
        "Damage per Explosion: 7\/14\/21\/28",
        "Duration: 10"
      ],
      "legacy_key": "C",
      "story": "Chronoptic energy bursts from one plane to the other, evaporating anything it touches."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Leshrac_Lightning_Storm.mp3\/revision\/latest?cb=20191216015222",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The lightning hits the initial target after the 0.25-second effect delay and then jumps to other targets in 0.25-second intervals, so hitting all targets takes 1.25\/1.75\/2.25\/2.75 seconds. This means the initial lightning can be avoided by being invulnerable, hidden, or spell immune. However, this does not prevent it from jumping.",
        "This means the initial lightning can be avoided by being invulnerable, hidden, or spell immune. However, this does not prevent it from jumping.",
        "Lightning Storm does not jump on to invisible units, or units in the Fog of War. The lightning storm buff is a hidden buff required for the lightning to jump. It cannot hit the same unit again per cast. TALENT NOTES The bounce twice on units talent can only hit the same unit again per cast when all other valid targets within the jump distance are hit. Once all valid units are hit, Lightning Storm starts jumping on the same units again. However, it still does not jump on the same unit twice in a row, so a lone target is hit only once.",
        "The lightning storm buff is a hidden buff required for the lightning to jump. It cannot hit the same unit again per cast.",
        "TALENT NOTES The bounce twice on units talent can only hit the same unit again per cast when all other valid targets within the jump distance are hit. Once all valid units are hit, Lightning Storm starts jumping on the same units again. However, it still does not jump on the same unit twice in a row, so a lone target is hit only once.",
        "Once all valid units are hit, Lightning Storm starts jumping on the same units again.",
        "However, it still does not jump on the same unit twice in a row, so a lone target is hit only once.",
        "Successive cast of Lightning Storm fully stack, with each cast creating its own independent instance.",
        "All jumps together can deal up to 350\/840\/1530\/2420 (TagTalent 850\/1540\/2430\/3520) damage (before reductions) per storm instance.",
        "Lightning Storm first applies the damage, then the debuff."
      ],
      "mana": "4",
      "item_behaviour": [],
      "name": "Lightning Storm",
      "cooldown": "80\/100\/120\/140",
      "description": "Summons a lightning storm that blasts the target enemy unit, then jumps to nearby enemy units. Struck units are slowed by 70\/120\/170\/220 for a duration.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+1.04",
        "Cast Range:  650",
        "Jump Distance: 475",
        "Total Storm Instances: 1 ( 2)",
        "Number of Jumps: 5\/7\/9\/11",
        "Effect Delay: 0.25",
        "Damage: 70\/120\/170\/220 ( 170\/220\/270\/320)",
        "Move Speed Slow: 75%",
        "Slow Duration: 0.4\/0.6\/0.8\/1"
      ],
      "legacy_key": "G",
      "story": "The Tormented Soul's mastery of the elements is evident in the massive storms that strike down armies before him."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/75\/Leshrac_Nihilism_1.mp3\/revision\/latest?cb=20210109164935",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Interrupts Leshrac's channeling abilities upon cast.",
        "Turns Leshrac and all enemies within the radius ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance.",
        "Reduces most heroes' total magic resistance to 2.5%.",
        "Nihilism's magic resistance reduction does not stack with other ethereal effects, the one with a higher value takes priority. However, it still stacks multiplicatively with other sources of magic resistance.",
        "However, it still stacks multiplicatively with other sources of magic resistance.",
        "The ethereal effect on enemies is provided by an aura, its debuff lingers for 0.5 seconds.",
        "Successive casts do not stack but refresh the duration."
      ],
      "mana": "25",
      "item_behaviour": [],
      "name": "Nihilism",
      "cooldown": "75",
      "description": "Causes Leshrac and all nearby enemies to turn ethereal, preventing them from attacking, slowing them, and making them take more magic damage. Increases Leshrac's speed rather than reducing it. Does not cause Leshrac to take amplified damage.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 450",
        "Enemy Magic Resistance Reduction: 30%",
        "Move Speed Change: 30%",
        "Duration: 4",
        "Aura Linger Duration: 0.5"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Leshrac_Pulse_Nova.mp3\/revision\/latest?cb=20200509130123",
      "effects": [
        "Ability: Toggle",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Does not interrupt Leshrac's channeling abilities upon toggling On \/ Off. If toggled On, Pulse Nova continues working even when silenced, disabled, or hidden. When toggled Off, Pulse Nova goes on a fixed 1-second cooldown. This cooldown can be reset with cooldown resetting abilities, but it is not affected by percentage-based cooldown reductions.",
        "If toggled On, Pulse Nova continues working even when silenced, disabled, or hidden.",
        "When toggled Off, Pulse Nova goes on a fixed 1-second cooldown.",
        "This cooldown can be reset with cooldown resetting abilities, but it is not affected by percentage-based cooldown reductions.",
        "Drains 25\/45\/65 mana in 1-second intervals, starting 1 second upon activation. However, Pulse Nova deals its damage immediately upon activation.",
        "However, Pulse Nova deals its damage immediately upon activation.",
        "Fully affects invisible units and units in the Fog of War."
      ],
      "mana": "1",
      "item_behaviour": [],
      "name": "Pulse Nova",
      "cooldown": "70 + 25\/45\/65\/ second",
      "description": "Creates waves of damaging energy around Leshrac, one per second, to damage nearby enemy units. Drains Leshrac's mana with each pulse.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 525",
        "Damage per Second: 90\/140\/190 ( 130\/180\/230)",
        "Pulse Nova Downtime: 1"
      ],
      "legacy_key": "V",
      "story": "If necessary, the Tormented Soul can manipulate space time itself, ravaging lesser beings."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 20.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 2.8,
    "attrAgility": 23.0
  },
  "description": "Can deal heavy damage in an aura around himself. Once a worldly philosopher, the hideous truth at the heart of existence emanated Nihilism and twisted Leshrac into the vile being he is today. The Split Earth beneath his hooves opens to consume the unsuspecting, while Lightning Storms strike down entire fields of foes. He pronounces a Diabolic Edict, saturating the air with bouts of magical explosions. Warping the structure of spacetime, Leshrac emits a continuous Pulse Nova, disintegrating and scouring nearby foes without ever lifting a finger.  Carry Support Nuker Pusher Disabler ★☆☆",
  "trivia": [
    "The name Leshrac comes from a Planeswalker from the Magic: the Gathering multiverse. Diabolic Edict is the name of an iconic black card in that game; much like the Dota 2 spell, the Magic card was more effective when there were fewer targets, as your opponent got to choose which target got hit. When meeting Leshrac as an enemy or an ally, Spirit Breaker (who also happens to be a planeswalker or planeshifter in Dota 2's lore) will reference this in his lines towards Leshrac.",
    "Diabolic Edict is the name of an iconic black card in that game; much like the Dota 2 spell, the Magic card was more effective when there were fewer targets, as your opponent got to choose which target got hit.",
    "When meeting Leshrac as an enemy or an ally, Spirit Breaker (who also happens to be a planeswalker or planeshifter in Dota 2's lore) will reference this in his lines towards Leshrac.",
    "Leshrac's response Link▶️ \"An evil wind rises.\" is a reference to the real life mazuku, which is Swahili for \"evil wind\". A mazuku is a toxic pocket of air that is rich in carbon dioxide which is lethal to anyone inside the pocket. It originates from vents in the earth such as lava tunnels where it rises into the low lying areas on the surface, or beneath lakes rich in CO2 where it rises into the air of the surrounding area via limnic eruptions.[1]"
  ],
  "history": "Leshrac, Tormented Soul, is an entity torn from the heart of nature, a liminal being that exists half in one plane of existence, half in another. His penetrating intelligence is such that he can never ignore for a moment the agonizing horror at the heart of all creation. Once a great philosopher who sought the meaning of existence, he plumbed the depths of nature with the haunted Chronoptic Crystals, and was forever altered by the hideous mysteries thereby revealed to him. Now the darkest depths of his enlightenment are illumined only by the fitful glare of his arrogance. Like other elemental characters, he is completely at one with nature, but in his case it is a nature lurid and vile. He alone sees the evil truth of reality, and has no use for those who believe the cosmos reserves a special reward for those who practice benevolence.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Lightning Storm Can Bounce Twice On Units",
        "talent_left": "+25 Diabolic Edict Explosions"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+20 Strength",
        "talent_left": "+40 Pulse Nova Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+100 Lightning Storm Damage",
        "talent_left": "+25 Movement Speed"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+1.5 Mana Regen",
        "talent_left": "+40 Split Earth Radius"
      }
    ],
    "notes": [
      "The strength talent effectively grants Leshrac 400 health and 2 health regeneration bonus."
    ]
  }
}