{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+6 Mortimer Kisses Launched",
          "talentRight": "3x Lil' Shredder Multishot"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20% Mortimer Kisses Movement Slow",
          "talentRight": "Lil' Shredder Uses Your Attack Damage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+60 Scatterblast Damage",
          "talentRight": "Firesnap Cookie Restores 200 Health"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Movement Speed",
          "talentRight": "+200 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Snapfire_Scatterblast_1.mp3\/revision\/latest?cb=20191215162240",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Scatterblast travels at a speed of 3000, taking 0.73 seconds to travel the full distance.",
        "Can hit units up to 1200 range away (travel distance + end radius).",
        "The complete area is shaped like a cone.",
        "Deals 120\/225\/330\/435 (TagTalent 210\/315\/420\/525) damage to units within point-blank range. With Aghanim's Shard, deals 245\/350\/455\/560 (TagTalent 335\/440\/545\/650) damage to units within point-blank range. Also stuns and knocks back enemies in point-blank. Knocks back at a speed of 833.33. The knockback destroys trees the enemies collide with.",
        "With Aghanim's Shard, deals 245\/350\/455\/560 (TagTalent 335\/440\/545\/650) damage to units within point-blank range.",
        "Also stuns and knocks back enemies in point-blank. Knocks back at a speed of 833.33.",
        "The knockback destroys trees the enemies collide with.",
        "Scatterblast first applies the damage, then the movement speed slow. With Aghanim's Shard, it first applies the stun, then the knockback, then the damage, then the slow.",
        "With Aghanim's Shard, it first applies the stun, then the knockback, then the damage, then the slow.",
        "Leveling up Scatterblast, or choosing the damage increasing talent does not affect the damage of an already launched instance of Scatterblast."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10",
      "description": "Snapfire unloads with a wide blast that damages and slows enemies in a cone. Enemies caught at point-blank range take an extra 50% damage.",
      "spellName": "Scatterblast",
      "params": [
        "Cast Animation: 0.4+0.83",
        "Cast Range: 800",
        "Starting Radius: 225",
        "Travel Distance: 800",
        "End Radius: 400",
        "Point-Blank Distance: 450",
        "Damage: 80\/150\/220\/290 (TagTalent 140\/210\/280\/350)",
        "Point-Blank Percentage Damage Bonus: 50%",
        "Move Speed Slow: 100%",
        "Attack Speed Slow: 100",
        "Slow Duration: 1",
        "Point-Blank Flat Damage Bonus: 125",
        "Point-Blank Knockback Distance: 250",
        "Point-Blank Knockback Duration: 0.3",
        "Point-Blank Stun Duration: 1.5",
        "Causes Scatterblast to knock units back in the point blank range for 250 units, dealing 125 extra damage and stunning for 1.5 seconds.",
        "Debuff persists if placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "A favorite from her collection, Beadie crafted Ol' Rackatee as her first line of defense when she ventured into the Outlands."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Snapfire_Firesnap_Cookie_1.mp3\/revision\/latest?cb=20191215162224",
      "effects": [
        "Ability Target Unit",
        "Affects Allies \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1000.",
        "Cannot be cast on units that are currently channeling, making it impossible to accidentally cancel an allied channeling spell. If the ally starts channeling after projectile launch, the projectile does nothing upon impact. This includes self-casts.",
        "If the ally starts channeling after projectile launch, the projectile does nothing upon impact.",
        "This includes self-casts.",
        "Can target, but has no effect on units affected by Chronosphere and Black Hole, the projectile does nothing on impact.",
        "The target jumps 450 range forwards upon projectile impact, 257 range high. While in the air, other units can pass below them.",
        "During the jump, the target is fully disabled, unable to move, turn, attack or cast spells or items.",
        "Can jump over other units and over impassable terrain.",
        "The area damage and stun are applied upon losing the hop buff. This means if the leap gets interrupted, the effects are applied earlier.",
        "Firesnap Cookie first applies the damage, then the stun.",
        "Destroys trees within the impact area upon landing.",
        "Has no cast backswing when cast on self.",
        "Choosing the level 15 talent that adds the heal immediately updates already launched cookies, making them heal on impact."
      ],
      "mana": "110",
      "hotKey": "W",
      "cooldown": "24\/21\/18\/15",
      "description": "Snapfire feeds a potent cookie to Mortimer or an ally, causing them to hop a short distance. The hopping unit stuns and damages enemies in the landing zone.",
      "spellName": "Firesnap Cookie",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range: 700",
        "Self Cast Time: 0.3",
        "Impact Radius: 300",
        "Jump Distance: 450",
        "Impact Damage: 70\/140\/210\/280",
        "Jump Duration: 0.5",
        "Impact Stun Duration: 1.6\/1.8\/2\/2.2",
        "Heal: 200",
        "Can be cast on spell immune allies. Does not affect spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "With the help of a secret mixture that pairs Beadie's baking skills with her passion for black powder, these battle biscuits pack a punch."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Snapfire_Lil%27_Shredder_1.mp3\/revision\/latest?cb=20191215162230",
      "effects": [
        "Ability No Target",
        "Affects Self",
        "Damage Instant Attack"
      ],
      "notes": [
        "Interrupts Snapfire's channeling spells on cast.",
        "Increased Snapfire's attack range to 575\/650\/725\/800, and sets her base attack time to 1.",
        "Sets Snapfire's damage to the given values. This means attack damage bonuses and reductions are completely ignored. With the level 20 talent, Lil' Shredder's attack damage is no longer set to a fixed value.",
        "With the level 20 talent, Lil' Shredder's attack damage is no longer set to a fixed value.",
        "An attack charge is lost whenever an attack is executed, regardless of outcome. This means missed attacks use up charges as well.",
        "The number of charges left is visible on the buff icon.",
        "Lil' Shredder uses a single debuff on the target. Following attacks increase its stack count. A number on the icon reveals the amount of stacks. The number is visible to everyone. Since only one debuff is used, each attack resets the duration of the entire stack.",
        "A number on the icon reveals the amount of stacks. The number is visible to everyone.",
        "Since only one debuff is used, each attack resets the duration of the entire stack.",
        "The armor reduction is applied on any attacked target, including buildings and allies.",
        "Can deal a total of 120\/240\/360\/480 damage with all 6 attacks (before reductions), considering the level 20 talent is not chosen.",
        "The attacks first place the debuff, then apply their own damage.",
        "Successive casts do not stack, but refresh the buff instead, resetting the amount of attacks and updating the range bonus.",
        "Leveling up Lil' Shredder, or choosing the talent that makes it use regular attack damage, does not update the damage of an already existing instance from a previous cast.",
        "With the level 25 talent, whenever attacking during Lil' Shredder, different random targets within attack range are also attacked. Causes Snapfire to perform an instant attack on the chosen targets whenever she attacks. This instant attack can proc any attack modifier or on-hit effect like a regular attack. The secondary attacks have no target priorities. They simply choose random valid targets within range.",
        "Causes Snapfire to perform an instant attack on the chosen targets whenever she attacks.",
        "This instant attack can proc any attack modifier or on-hit effect like a regular attack.",
        "The secondary attacks have no target priorities. They simply choose random valid targets within range."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "E",
      "cooldown": "24\/20\/16\/12",
      "description": "Snapfire heats up her mounted turret to rapidly fire 6 fixed-damage attacks. Each attack reduces the enemy's armor. Provides bonus attack range for the duration.",
      "spellName": "Lil' Shredder",
      "params": [
        "Cast Animation: 0+0",
        "Attack Range Bonus: 75\/150\/225\/300",
        "Attack Speed Bonus: 300",
        "Base Attack Time: 1",
        "Fixed Attack Damage: 20\/40\/60\/80 (TagTalent 0)",
        "Number of Attacks: 6",
        "Armor Reduction per Attack: 1",
        "Armor Reduction Duration: 4",
        "Buff Duration: 8",
        "Bonus Attack Targets: 3",
        "Debuff persists if placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Beadie constantly tinkers with a design she first dreamed up plotting an exodus from her old gang."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4c\/Snapfire_Gobble_Up_1.mp3\/revision\/latest?cb=20200527011842",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Instant Kill"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. In Ability Draft, Gobble Up can be unlocked by the player that drafted Mortimer Kisses.",
        "In Ability Draft, Gobble Up can be unlocked by the player that drafted Mortimer Kisses.",
        "Can be cast on any unit, except for enemy heroes and creep-heroes. Cannot be cast on allies who have ☐ Disabled Help from Snapfire.",
        "Cannot be cast on allies who have ☐ Disabled Help from Snapfire.",
        "Disjoints projectiles for the target unit upon cast.",
        "The target unit is invulnerable, hidden, silenced, muted, and disarmed while swallowed.",
        "During Gobble Up, the unit is periodically moved to Snapfire's current position. This periodic movement cannot be interrupted. This means their auras are effectively bestowed around Snapfire until spat out.",
        "This means their auras are effectively bestowed around Snapfire until spat out.",
        "The unit is automatically released after 3 seconds if not manually spat out. If the unit is not a hero or a clone, it gets instantly killed upon getting released. Targeted non-hero units also get their ownership changed to that of the caster, meaning its death counts as a deny.",
        "If the unit is not a hero or a clone, it gets instantly killed upon getting released.",
        "Targeted non-hero units also get their ownership changed to that of the caster, meaning its death counts as a deny.",
        "Swallowing a unit turns this ability inactive and turns the Spit Out sub-ability active. This ability stays inactive until the unit is released, either by timing out, by using the sub-ability, or by the caster dying.",
        "This ability stays inactive until the unit is released, either by timing out, by using the sub-ability, or by the caster dying."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "40",
      "description": "Mortimer gobbles up a creep or an allied hero, which he can then spit towards enemies. The unit stays in his belly up to 3 seconds.",
      "spellName": "Gobble Up",
      "params": [
        "Cast Animation: 0.3+1.27",
        "Cast Range: 150",
        "Max Duration: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/da\/Snapfire_Spit_Out.mp3\/revision\/latest?cb=20200527011844",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical \/ Instant Kill"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "This ability stays inactive until Gobble Up is cast and turns inactive again once the targeted unit is spat out in any way.",
        "The swallowed unit serves as projectile, and gets moved in an arc towards the targeted point. While flying, the unit is stunned, invulnerable and hidden.",
        "While flying, the unit is stunned, invulnerable and hidden.",
        "The projectile has a minimum travel time of 0.6, and a maximum travel time of 2 seconds. While in the air, other units can pass below it.",
        "If the swallowed unit was not a hero, illusion, clone, or creep-hero, it gets instantly killed upon landing.",
        "Upon landing, the unit deals the impact damage and leaves a lava puddle behind. The puddle lasts 3 seconds. The impact damage equals the one of Mortimer Kisses, based on its current level. The puddle applies the debuff on enemies in 0.5 second intervals, starting immediately as it is created, resulting in 7 instances. The debuff lasts 1 second, and deals 50 damage in 0.5 second intervals, starting immediately upon being placed, resulting in 3 instances. Can deal a total of 610\/690\/770 damage, considering impact damage, and standing within the puddle for the full duration. Multiple instances of the debuff do not stack. Since Spit Out and Mortimer Kisses use the same modifier_snapfire_magma_burn_slow modifier, they do not stack, with the damage from the first applied debuff taking priority.",
        "The impact damage equals the one of Mortimer Kisses, based on its current level.",
        "The puddle applies the debuff on enemies in 0.5 second intervals, starting immediately as it is created, resulting in 7 instances.",
        "The debuff lasts 1 second, and deals 50 damage in 0.5 second intervals, starting immediately upon being placed, resulting in 3 instances.",
        "Can deal a total of 610\/690\/770 damage, considering impact damage, and standing within the puddle for the full duration.",
        "Multiple instances of the debuff do not stack.",
        "Since Spit Out and Mortimer Kisses use the same modifier_snapfire_magma_burn_slow modifier, they do not stack, with the damage from the first applied debuff taking priority.",
        "The impact first applies the damage, then the stun.",
        "The projectile provides 500 radius flying vision as it travels. This vision lingers for 3.5 seconds at the impact area.",
        "Destroys trees within the impact area upon landing."
      ],
      "mana": "0",
      "hotKey": "F",
      "cooldown": "0",
      "description": "Mortimer spits out the unit that's in his mouth, causing impact damage and stun in a large area. The glob leaves a pool of firespit that slows and applies damage over time.",
      "spellName": "Spit Out",
      "params": [
        "Cast Animation: 0.3+1.04",
        "Cast Range: 3000",
        "Impact Radius: 400",
        "Debuff Damage per Second: 100",
        "Move Speed Slow: 25%",
        "Puddle Duration: 3",
        "Debuff Duration: 1",
        "Stun Duration: 1.5",
        "Debuff persists if placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Snapfire_Mortimer_Kisses_1.mp3\/revision\/latest?cb=20191215162234",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectiles have a minimum travel time of 0.8, maximum travel time of 2 seconds, and a projectile speed of 1300. This means up to 1625 range, the speed adapts to lower values, and for distance starting at 2600, the speed adapts to higher values.",
        "This means up to 1625 range, the speed adapts to lower values, and for distance starting at 2600, the speed adapts to higher values.",
        "For better readability, the turn rate during Mortimer Kisses is given as degrees per second, instead of radians per 0.03 seconds. 75° per second equal a turn rate of 0.039.",
        "75° per second equal a turn rate of 0.039.",
        "Mortimer Kisses is canceled if Snapfire gets stunned, silenced, cycloned, hexed, slept, feared, or hypnotized. Taunts prevent Snapfire from changing locations for the globs, but do not cancel it. Mortimer Kisses can also be stopped manually by giving Snapfire any other order besides moving.",
        "Taunts prevent Snapfire from changing locations for the globs, but do not cancel it.",
        "Mortimer Kisses can also be stopped manually by giving Snapfire any other order besides moving.",
        "The location for the globs can be changed with a move order. A move order is given by right-clicking, or by pressing the move hotkey and selecting a target point. Selecting a point outside the minimum\/maximum distance, the globs are launched using the minimum\/maximum distance towards the targeted direction. Although reducing turn rate a lot while active, the globs are launched where the order was targeted, they are not launched based on facing angle.",
        "Selecting a point outside the minimum\/maximum distance, the globs are launched using the minimum\/maximum distance towards the targeted direction.",
        "Although reducing turn rate a lot while active, the globs are launched where the order was targeted, they are not launched based on facing angle.",
        "Snapfire is disarmed during Mortimer Kisses. Attack orders behave like move orders during disarms, so right-clicking an enemy sets a new location as well.",
        "The destination for each glob is marked with a red circle indicator, which is visible to allies only.",
        "Launches globs in 0.75 (TagTalent 0.429) second intervals, starting immediately upon cast, resulting in 8 (TagTalent 14) globs.",
        "Each glob deals the impact damage and leaves a lava puddle behind. The puddles last 3 seconds. The puddles apply the debuff on enemies in 0.5 second intervals, starting immediately as they are created, resulting in 7 instances. The debuff lasts 1 second, and deals 25\/37.5\/50 damage in 0.5 second intervals, starting immediately upon being placed, resulting in 3 instances. Multiple instances of the debuff do not stack.",
        "The puddles apply the debuff on enemies in 0.5 second intervals, starting immediately as they are created, resulting in 7 instances.",
        "The debuff lasts 1 second, and deals 25\/37.5\/50 damage in 0.5 second intervals, starting immediately upon being placed, resulting in 3 instances.",
        "Multiple instances of the debuff do not stack.",
        "A single glob can deal a total of 385\/577.5\/770 damage, considering impact damage, and standing within the puddle for the full duration.",
        "Provides 275 radius flying vision at the current targeted location for the globs, lasting until Mortimer stops launching projectiles.",
        "The projectiles provide 500 radius flying vision as they travel. This vision lingers for 3.5 seconds at the impact area.",
        "Destroys trees within the impact areas of each projectile upon impact.",
        "Leveling up the spell does not update the impact damage of already launched globs to the new level. However, the lava puddles are updated to apply the debuff with the new level's value. Already placed debuffs are not updated to the new level.",
        "However, the lava puddles are updated to apply the debuff with the new level's value.",
        "Already placed debuffs are not updated to the new level.",
        "Choosing the slow increasing talent immediately updates all existing puddles to use the new value. However, already placed debuffs are not updated.",
        "However, already placed debuffs are not updated."
      ],
      "mana": "125\/150\/175",
      "hotKey": "R",
      "cooldown": "110",
      "description": "Snapfire's friend launches a barrage of firespit globs over 6 seconds. Globs cause impact damage and create pools of firespit, which slow and apply damage over time. Snapfire has a reduced turn rate for the duration and a minimum launch range of 600. Each glob can be targeted with a right click.",
      "spellName": "Mortimer Kisses",
      "params": [
        "Cast Animation: 0.5+0.73",
        "Cast Range: 3000",
        "Min Distance: 600",
        "Max Distance: 3000",
        "Impact Radius: 275",
        "Turn Rate in Degrees per Second: 75°",
        "Number of Projectiles: 8 (TagTalent 14)",
        "Impact Damage: 160\/240\/320",
        "Debuff Damage per Second: 50\/75\/100",
        "Move Speed Slow: 15%\/20%\/25% (TagTalent 35%\/40%\/45%)",
        "Launch Duration: 6",
        "Puddle Duration: 3",
        "Debuff Duration: 1",
        "Grants a new ability: Gobble Up. Mortimer gobbles up a creep or an allied hero, which he can then spit towards enemies.",
        "Debuff persists if placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Little did Beadie know when she adopted Mortimer, dragon toads--which aren't even toads at all--share more than just a name with their distant draconic cousins."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 20.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 1.9,
    "attrAgility": 16.0
  },
  "description": "Beatrix Snapfire, or simply Snapfire, is a ranged strength hero armed with a wide array of firepower, riding into battle on her dragon toad Mortimer. Her powerful Scatterblast blasts foes who get too close, while her mounted turret increases her range, allowing her to unleash a barrage of rapid fire attacks. Snapfire's coveted Firesnap Cookies give allies a boost, allowing them to leap a short distance. The cookies aren't her only secret weapon, her dragon toad has the ultimate nasty surprise for the enemy team—a long range artillery barrage of Mortimer Kisses that coat the map in searing lava.",
  "history": "Beatrix Snapfire and her dragon toad Mortimer are a welcome sight to the ragged folk who scratch out lives along the desert routes and oases scattered throughout Nanarak, the rain-forsaken gateway to the Outlands. As well known for her unrivaled skills as a weaponsmith as for dispensing wisdom, mirth, and the meanest firesnap cookies the world has ever seen, Beadie's survived to a ripe old age in a young keen's trade by being quick with her wits and even quicker with her guns. Indeed, the Outlands are littered with the bones of bandits and ne'er-do-wells who thought to take advantage of her small stature and propensity for kindness.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+6 Mortimer Kisses Launched",
      "talentRight": "3x Lil' Shredder Multishot"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20% Mortimer Kisses Movement Slow",
      "talentRight": "Lil' Shredder Uses Your Attack Damage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+60 Scatterblast Damage",
      "talentRight": "Firesnap Cookie Restores 200 Health"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Movement Speed",
      "talentRight": "+200 Health"
    }
  ]
}