{
  "abilities": [
    {
      "notes": [
        "Charges forward at a speed of 1200",
        "The max charge distance cannot be increased with cast range bonuses",
        "For better readability, the turn rates are given as degrees per second, instead of radians per 0.03 seconds. During the wind-up, 70° degrees per second equals 1.22 radians, which is a turn rate of 0.037. During the charge, 50° degrees per second equals 0.87 radians, which is a turn rate of 0.026",
        "While winding up and while charging, the direction can be changed with a move order ( Right Click or M). Primal Beast is disarmed during Onslaught. Attack orders behave like move orders while disarmed, causing them to change the direction as well",
        "During the wind-up, if Primal Beast is given any order that cancels channeling abilities, the wind-up ends and the charge begins. This means non-targeted abilities that do not interrupt channeling (e.g.  Shadow Walk) do not end the wind-up. If ended by a targeted order, the order may get executed while charging if the target comes within range, considering no other orders are given while charging",
        "While charging, if Primal Beast is given any targeted order, the charge is canceled",
        "During the wind-up, Onslaught is completely canceled if Primal Beast gets stunned, hexed, slept, feared, taunted, or affected by forced movement. It is also canceled when Primal Beast turns invulnerable or hidden, or dies. Silence does not cancel the wind-up, but prevents using  Begin Onslaught to start the charge early. However, the charge can still be started early with the previously mentioned orders",
        "While charging, Onslaught is canceled if Primal Beast gets slept, feared, or affected by other forced movement sources. Stuns and taunts do not cancel the charge but prevent Primal Beast from changing directions. Hexes do not cancel it either. Additionally, stun pauses Onslaught's charge, and Primal Beast continues charging once the stun duration expires. Channeling  Town Portal Scroll immediately cancels the charge as well",
        "Every enemy (except  Roshan) coming within 190 range of Primal Beast while charging gets damaged, knocked back, and stunned. Allies are only knocked back. Does not interrupt allied channeling abilities. Units are knocked 200 range away from Primal Beast over 0.2 seconds. Can knock units over impassable terrain",
        "Onslaught first applies the damage, then the knockback, and then the stun",
        "The damage is applied as spell damage, it is affected by spell damage amplification and works with spell lifesteal. However, it is still affected by damage block sources and  Bulwark, but not  Resonant Pulse",
        "Can charge through impassable terrain",
        "Destroys trees within 100 radius around Primal Beast while charging, and around units during the knockback"
      ],
      "item_behaviour": [],
      "description": "Primal Beast charges up and then runs in the chosen direction, knocking back enemies and allies alike. Enemy units are damaged and stunned on impact. The longer the charge duration, the farther Primal Beast's momentum will carry him. Can be cancelled at any time with the Stop command.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.15+0",
        "Cast Range: Global",
        "Max Charge Distance: 2000",
        "Effect Radius: 190",
        "Max Windup Time: 2",
        "Turn Rate in Degrees per Second During Windup: 70°",
        "Turn Rate in Degrees per Second During Charge: 50°",
        "Damage: 95\/190\/285\/380 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 185\/280\/375\/470)",
        "Knockback Distance: 200",
        "Knockback Duration: 0.2",
        "Stun Duration: 1\/1.2\/1.4\/1.6",
        "Max Charge Duration: 1.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Primal_Beast_Onslaught_1.mp3\/revision\/latest?cb=20220412221020",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies \/ Allies",
        "Damage: Physical"
      ],
      "mana": "25\/22\/19\/16",
      "aghanim": null,
      "name": "Onslaught",
      "cooldown": "120",
      "legacy_key": "G",
      "story": "The Beast's single-minded focus on chosen prey leaves all other considerations scattered in his ruinous wake."
    },
    {
      "notes": [
        "Replaces  Onslaught until the sub-ability is used or the wind-up ends",
        "Can be used while stunned, cycloned, slept, taunted, hidden, or during forced movement",
        "Cannot be used while silenced, hexed or prevented from acting. Primal Beast is unable to ⇧ Shift-queue this ability",
        "A line indicator with a width of 190 is cast in front of Primal Beast while winding up, showing the path Primal Beast will take. The line's length extends the longer Onslaught is wound up, indicating the charge distance based on the wind-up time. The indicator is visible to the player only. Neither allies nor enemies can see it",
        "Goes into a 0.3-second cooldown right after Onslaught is cast, this is to prevent accidental double-casts prematurely ending the wind-up"
      ],
      "item_behaviour": [],
      "description": "Begins the rush to the specified location.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "0.3",
      "aghanim": null,
      "name": "Begin Onslaught",
      "cooldown": "0",
      "legacy_key": "G",
      "story": null
    },
    {
      "notes": [
        "Does not interrupt Primal Beast's channeling abilities upon cast",
        "Primal Beast is disarmed for the duration. TALENT NOTES Increases Primal Beast's magic resistance to 40% while active. Stacks multiplicatively with other sources of magic resistance",
        "Immediately stomps once upon cast, without requiring to move. This only happens upon receiving the buff, refreshing the buff does not cause another immediate stomp",
        "Trample releases a single pulse when Primal Beast collectively moves a distance of 140 on the x and y-axis. Moving includes forced movement sources and teleporting effects, including Blink-based abilities as well. Does not release pulses upon being moved by  Force Staff and  Hurricane Pike. Teleporting effects may only add up to 140 range to the distance counter, no matter how far the actual teleported distance was. This means teleporting a distance of 280 still results in one stomp, and not multiple times based on the entire distance. When Primal Beast moves a distance greater than 500 within 0.1 seconds, it does not stomp. This means the stomps do not occur when teleporting a distance greater than 500",
        "Considering default movement speed of 310, Trample can stomp up to 2.21 times per second. For how many stomps per second Primal Beast can perform at varying movement speed values, please refer to the chart below",
        "Trample deals regular spell damage within the area, based on Primal Beast's average attack damage, plus attack damage bonuses. This means attack modifiers are not applied, and it works with spell damage amplification and spell lifesteal",
        "Destroys trees around Primal Beast while active"
      ],
      "item_behaviour": [],
      "description": "Primal Beast stomps over everything. For every 140 units traveled, all enemies around the Beast receive damage. Deals base damage plus a multiplier of Primal Beast's attack damage. Primal Beast is disarmed for the duration of the ability.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 230",
        "Distance Required per Stomp: 140",
        "Distance Cap: 500",
        "Base Damage: 15\/30\/45\/60",
        "Attack Damage as Damage: 35% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 60%)",
        "Duration: 5.5",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Magic Resistance Bonus:  20%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Primal_Beast_Trample.mp3\/revision\/latest?cb=20220412221042",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": "30\/27\/24\/21 (TagTalent 25\/22\/19\/16)",
      "aghanim": null,
      "name": "Trample",
      "cooldown": "90\/85\/80\/75",
      "legacy_key": "T",
      "story": "As the only member of his species to arrive on this world, locals can only speculate on the Beast's size relative to his kin. Such observation would prove easier of course if the subject didn't eat everything it sees and destroy most of what it doesn't."
    },
    {
      "notes": [
        "Passively grants flat bonus attack damage",
        "Uproar passively gains a stack when Primal Beast collectively takes 50 damage (after all reductions). Counts player-based damage values of all 3 damage types, including  Roshan-based damage, between 20 – 2000 that is dealt to Primal Beast. The damage counter does not count damage flagged as HP Removal (e.g.  Dispersion). The damage counter and all stacks reset if no damage has been taken in the last 20 seconds. Any exceeding damage is completely ignored, this means if an enemy deals an instance of 100 damage, it gains only one stack. Gaining a new stack refreshes the duration of already existing stacks. Does not gain any stacks while on cooldown",
        "The passive buff is always present but is hidden when having no stacks. The ability icon changes at 0 stacks, 1 – 4 stacks, and at 5 stacks. Also plays a sound effect when reaching 5 stacks, audible to the player only. A number on the icon shows how many stacks Primal Beast currently has",
        "Uproar cannot be cast while having no stacks. Uproar does not interrupt Primal Beast's channeling abilities upon cast. When cast, goes on a 7-second cooldown. The cooldown timer on the ability icon is displayed in red. This cooldown is not affected by any cooldown reduction and cooldown reset sources, however, it is affected by  Time Dilation. Although the buff upon cast is dispellable, doing so does not affect the cooldown",
        "Grants Primal Beast flat bonus attack damage, bonus armor and a basic dispel upon cast. Grants Primal Beast 50\/100\/150\/200 attack damage and 5\/10\/15\/20 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 25\/30\/35\/40) armor at max stacks. Slows enemy movement speed by 40% at max stacks. For how much attack damage and armor Primal Beast gains and enemies are slowed per stack, please refer to the chart below",
        "The slow debuff on enemies has a number visible on it, showing them how many stacks Primal Beast had upon cast. The buff on Primal Beast does not have a number on it",
        "SCEPTER NOTES Uproar releases 3 waves of damaging lines upon cast. Creates a damaging line on every 180°th\/90°th\/60°th\/45°th\/36°th based the number of Uproar stacks. The distance between the damaging lines is always even, and is centered on and follows Primal Beast for the full duration. Lines are also created upon Primal Beast's death location. The area of every single damaging line is shaped like a cone. Upon cast, a total of 2 lines are released towards the east and the west of Primal Beast, and the others adapt accordingly",
        "SCEPTER NOTES The damaging lines travel at a speed of 500 and has an effect width of 75. After travelling for 625 distance in 1.25 seconds, the initial damaging line splints from one to two with a 30° angle. The newly splintered lines use the same travel distance and travel speed and do not further splinter. Although the total effect radius is 1400, units within certain cone areas might not be damaged. Each damaging line cannot hit the same unit more than once per cast upon expanding"
      ],
      "item_behaviour": [],
      "description": "The Beast's temper passively provides bonus damage. Additionally, for every instance of 50 damage or more Primal Beast takes from enemy heroes, he accumulates stacks of Uproar. When activated, Primal Beast releases a roar that slows surrounding enemies and grants the Beast additional attack damage and armor for 7 seconds based on his current stacks of Uproar.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0.53",
        "Passive Attack Damage Bonus: 6\/12\/18\/24",
        "Max Stacks: 5",
        "Stack Gain Damage Threshold: 50",
        "Roar Radius: 900",
        "Roar Attack Damage Bonus per Stack: 10\/20\/30\/40",
        "Roar Armor Bonus per Stack: 1\/2\/3\/4 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 5\/6\/7\/8)",
        "Roar Move Speed Slow per Stack: 8%",
        "Roar Slow Duration: 3",
        "Roar Buff Duration: 7",
        "Stacks Duration: 20",
        "Number of Waves:  3",
        "Wave Projectiles per Stack:  2",
        "Damage per Line:  100",
        "Wave Split Delay:  1.25",
        "Break Duration on Hit:  2.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e8\/Primal_Beast_Uproar_1.mp3\/revision\/latest?cb=20220412221045",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies",
        "Damage: "
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Uproar",
      "cooldown": "0",
      "legacy_key": "R",
      "story": "Already draped in a broken patchwork of barding and chains upon appearing in the mistwoods, the Beast tolerates no further attempts at subjugation."
    },
    {
      "notes": [
        "Requires  Aghanim's Shard to be unlocked",
        "The projectile has a min and max travel time of 0.45 – 1.7 seconds respectively, and no set projectile speed. This means at minimum distance and default max cast range, it has a travel speed of 1222.22 - 1058.82 respectively",
        "Upon selecting the ability, a red circle appears around Primal Beast, indicating the minimum distance. The min distance is not affected by cast range bonuses",
        "Upon initial projectile impact, another 3 red circles appears 600 distance behind the initial impact radius, indicating the fragment impact radius that will happen in 0.6 seconds later",
        "The initial impact radius and fragment impact radius indicator can only be seen by allies",
        "Rock Throw first applies the damage, then the debuff",
        "The damage is applied as spell damage, it is affected by spell damage amplification and works with spell lifesteal. However, it is still affected by damage block sources and  Bulwark, but not  Resonant Pulse"
      ],
      "item_behaviour": [],
      "description": "Primal Beast throws a rock at the target location that stuns and damages enemies. The rock cannot be thrown within a minimum range of Primal Beast. After landing, the throck splits into 3 additional fragments that land behind the initial target location.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.5+0.5",
        "Cast Range:  1800",
        "Min Distance: 550",
        "Initial Impact Radius: 225",
        "Fragment Impact Radius: 150",
        "Number of Fragments: 3",
        "Fragment Effect Delay: 0.6",
        "Damage: 325",
        "Stun Duration: 1.75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Primal_Beast_Rock_Throw_1.mp3\/revision\/latest?cb=20220412221031",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "mana": "25",
      "aghanim": null,
      "name": "Rock Throw",
      "cooldown": "85",
      "legacy_key": "W",
      "story": "AGAIN WITH THE ROCKS!"
    },
    {
      "notes": [
        "The targeting reticule must be centered over an enemy unit",
        "Fully disables the target as long as it is channeled",
        "Exposes the target, revealing their model through the Fog of War. Does not provide True Sight over them",
        "Teleports the target 200 distance in front of Primal Beast upon cast. Does not teleport  Roshan upon cast, but teleports him once the channeling stops in any way",
        "Slams the target in 0.75-second intervals, starting 0.75 seconds after cast, resulting in up to 3 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 6) instances. Can deal up to 450\/630\/810 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 900\/1260\/1620) damage to the target and nearby enemies",
        "Pulverize first applies the damage, then the stun",
        "During Pulverize, the target cannot be affected by any forced movement. Despite the target being rotated along the x-axis and z-axis when it hits the ground, and its model being Pulverized face down towards Primal Beast, the target's facing direction is not changed in any way. On each slam, the affected target is being moved up 350 ‒ 500 distance and the same approximate distance values down along the z-axis, and can be affected by distance-based abilities (e.g.  Rupture)",
        "Pulverize ends immediately if the target gets teleported or is affected by fear, or when Primal Beast is being moved more than 200 distance. It also ends if  Pounce or  Soulbind expire on the target during Pulverize",
        "When cast on  Roshan, Primal Beast does not slam him into the ground but instead throws punches at him. This animation difference only has cosmetic purposes, the ability still applies all its effects normally",
        "Uses a different and louder sound effect when cast on heroes",
        "TALENT NOTES The Pulverize Pierces Magic Immunity <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent allows casting on magic immune units, and changes damage type to pure. SOULBIND Only slams the primary target. The secondary target is teleported next to the primary target when the duration ends"
      ],
      "item_behaviour": [],
      "description": "Primal Beast channels his rage, grabbing the target enemy and slamming them into the ground repeatedly, damaging and mini-stunning any enemies caught in the AoE. Lasts 2.3 seconds.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.25+0",
        "Cast Range:  200",
        "Slam Radius: 600",
        "Max Channel Time: 2.3 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 4.6)",
        "Slam Interval: 0.75",
        "Slam Damage: 150\/210\/270",
        "Slam Stun Duration: 0.25"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2c\/Primal_Beast_Pulverize_1.mp3\/revision\/latest?cb=20220412221025",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "32\/28\/24",
      "aghanim": null,
      "name": "Pulverize",
      "cooldown": "100",
      "legacy_key": "V",
      "story": "Though none are certain whether his utterances have true meaning, most concede the Beast's powerful grip and tendency to smash his enemies into naught but pulp and pieces communicates his intent well enough."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.3,
    "attrStrength": 26.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 1.0,
    "attrAgility": 15.0
  },
  "description": "Stomps over everything and smashes enemies into messy bits. An ancient beast awakened from a long slumber, he uses a wide array of savagely cunning abilities which can impede the enemy groups. Rushing savagely through enemies and allies alike, Primal Beast Tramples into battle as one born to raise a ruckus. An unavoidable threat amidst any fray, the Uproared Beast can punish attackers and Hurl Massive Rocks at them with ease. It relishes grabbing prey and Pulverizing them against the ground until nothing but mush remains. A fearsome beast, the Primal Beast shows no mercy to his helpless prey as the epitome of a true apex predator.  Initiator Durable Disabler ★☆☆",
  "trivia": [
    "The Primal Beast first debuted in Aghanim's Labyrinth: The Continuum Conundrum as the event's final boss, appearing several months before he was released as a playable hero.",
    "The Primal Beast wears three skulls on the \"barding\" that he wears as a sign of his previous imprisonment, possibly as trophies. Connected to one of his back-plates is the skull of what appears to be a Slithereen, Slardar's race. Shackled to his left leg is the skull of what appears to be a rhino's resembling that of Frull's, the Shopkeeper's trusty beast of burden. Often mistaken for Magnus' skull, the longer skull and the hole in its horn where her ring is supposed to be is proof that this is indeed Frull's skull, two features that Magnus lacks. On his right shoulder is a another rhinolike skull. This one may or may not be a Magnoceroi skull.",
    "Connected to one of his back-plates is the skull of what appears to be a Slithereen, Slardar's race.",
    "Shackled to his left leg is the skull of what appears to be a rhino's resembling that of Frull's, the Shopkeeper's trusty beast of burden. Often mistaken for Magnus' skull, the longer skull and the hole in its horn where her ring is supposed to be is proof that this is indeed Frull's skull, two features that Magnus lacks.",
    "On his right shoulder is a another rhinolike skull. This one may or may not be a Magnoceroi skull."
  ],
  "history": "Though the deterioration of the Mistwood and its evolution from idyllic expanse to death-filled tanglewild was a slow, wizard-fueled process, most scholars agree the true beginning of the end was marked by the interdimensional arrival of the Primal Beast. A creature hatched into an existence devoid of all feeling but hunger and pain, aeons of carnage shaped the Primal Beast into the apex predator on a planet filled with violent terrors. Desperately banished by would-be masters with failed hopes to control him, the beast was cast into a new world — one where he could ascend from mere hungry predator into an invasive killing machine with nothing able to stand in his way. For thousands of years, the Mistwood served as massive stomping ground for the beast's destructive play — and even the feared durana beasts made for tasty snacks. Indeed, there could be no rivals for the beast's territory, only minor annoyances. Until one such tiny annoyance employed vile trickery to trap the unstoppable Beast in the Gleipnir. There he might have remained subdued for eternity, were it not for the unpredictable powers of the Continuum Device. Now, freed from both Gleipnir and Vault, far afield from the Mistwood, and much closer to inhabited lands, the beast sets his snout towards new slaughters and the delights of savage destruction — and the paltry fires of civilization will do little to keep this ageless monster at bay.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Pulverize Pierces Magic Immunity",
        "talent_left": "+100% Pulverize Duration"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+25% Trample Attack Multiplier",
        "talent_left": "+4 Uproar Armor Per Stack"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-5s Trample Cooldown",
        "talent_left": "Beast dispells himself when activating Uproar"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+90 Onslaught Damage",
        "talent_left": "+20% Magic Resistance During Trample"
      }
    ]
  }
}