{"abilities":[{"spell":"Герой погружается в землю и прорывается вперёд, оглушая врагов на пути и нанося им урон.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Шипы движутся со скоростью в 2000 ( 3000) единиц, достигая максимального расстояния за 0.18\/0.23\/0.28\/0.33 ( 0.23\/0.3\/0.37\/0.43) секунды.","Sand King мгновенно передвигается к выбранной точке при достижении её шипами.","Sand King обезврежен на всё время после применения Burrowstrike.","При выборе в качестве цели юнита Sand King преследует цель до достижения расстояния, равного дальности применения, и применяет Burrowstrike к нему напрямую. Шипы не попадают сразу же по цели, поэтому от них можно увернутся. Выбор юнита определяет только направление шипов.","Задетые юниты подбрасываются вверх на 350 единиц на базовые 0,52 секунды оглушения.","Когда юниты находятся в воздухе, остальные юниты могут под ними проходить.","Урон применяется при приземлении, а не при получении удара.","Может поражать юнитов на расстоянии до 500\/600\/700\/800 ( 850\/1050\/1250\/1450) единиц (складывается из максимальной дальности применения и радиуса).","Закапывание и появление занимает 0,53 секунды с момента произнесения способности, в течении которой Sand King не может ничего сделать.","Шипы не пройдут максимальное расстояние, если выбрать цель, находящуюся ближе.","При улучшении Burrowstrike применяет ко всем пораженным героям Caustic Finale, но не применяет её на иллюзии. Считает крипов-героев за крипов."],"mana":"110\/120\/130\/140","elements":["Нельзя применять в оцепенении.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/13\/12\/11﻿","name":"Burrowstrike","description":["Анимация применения: 0+0,53","Дальность применения: 350\/450\/550\/650 ( 700\/900\/1100\/1300)","Макс. дистанция прохождения: 350\/450\/550\/650 ( 700\/900\/1100\/1300)","Радиус: 150","Урон: 85\/150\/215\/280","Длительность оглушения: 1.6\/1.8\/2\/2.2"],"hot_key":"Q","legacy_key":"E"},{"spell":"Герой вызывает ужасающую песчаную бурю, которая делает его невидимым и наносит урон врагам. Эффект заканчивается, когда владелец способности выйдет из области действия.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["При применении Sand King мгновенно становится невидимым без задержки.","Задержка используется, если герой вышел из невидимости при атаке или использовании заклинаний и предметов. Но, поскольку применение Sand Storm мгновенно применяет невидимость, то задержка также не используется при повторном использовании способности в активной области.","Sand Storm наносит 10\/20\/30\/40 ( 30\/40\/50\/60) единиц урона с интервалом в 0,5 секунды сразу после применения, нанося урон 0.0015238095238095 раз.","Может нанести до 400\/1000\/1800\/2800 ( 1200\/2000\/3000\/4200) урона одному юниту (до учета снижений), если он оставался в радиусе действия всю длительность.","Замедление скорости передвижения и ослепление, даваемые талантом, предоставляются в виде ауры. Дебафф ауры задерживается на 0.5 секунды."],"mana":"60","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"40\/34\/28\/22","name":"Sand Storm","description":["Анимация применения: 0+0","Радиус: 350\/450\/550\/650","Задержка до невидимости: 0,7","Урон в секунду: 20\/40\/60\/80 ( 60\/80\/100\/120)","Шанс промаха: 0 ( 50%)","Замедление скорости передвижения: 0 ( 50%)","Длительность: 20\/25\/30\/35","Длительность задержки ауры: 0.5"],"hot_key":"W","legacy_key":"R"},{"spell":"Атаки героя наполняют тела жертв ядом, который разрывает их плоть через определённое время либо после смерти. Взрыв замедлит жертву и противников вокруг неё, а также нанесёт всем им урон — но меньше, если жертва ещё жива.","effects":["Способность Пассивная","Действует на Врагов","Урон Магический"],"notes":["Несколько атак по одной и той же цели не складываются и не обновляют длительность.","Урон по области и замедление применятся только в случае, если юнита под действием дебаффа убьет Sand King или его союзники. То есть эффекты не применяются при добивании цели или при завершении длительности.","Если дебафф заканчивается без смерти юнита, то урон по окончанию действия и замедление применятся в области вокруг юнита.","Взрыв сначала применяет дебафф, затем наносит урон.","Замедление от нескольких взрывов не складывается, обновляется лишь длительность.","Дебафф не применяется к союзникам, строениям и вардам."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Caustic Finale","description":["Радиус: 400","Урон при смерти: 90\/130\/170\/220","Урон по окончанию действия: 20\/50\/80\/110","Замедление скорости передвижения: 15%\/20%\/25%\/30%","Длительность эффекта: 6","Длительность замедления: 3"],"hot_key":"E","legacy_key":"L"},{"spell":"После 2 секунд подготовки герой неистово сотрясает землю вокруг себя. Землетрясение наносит урон противникам и замедляет их, увеличиваясь в радиусе с каждым последующим толчком.","effects":["Способность Ненаправленная \/ Произносимая","Действует на Врагов","Урон Магический"],"notes":["При прерывании произнесения заклинание ничего не сделает, потратит ману и уйдет на перезарядку.","При успешном произнесении толчки нельзя ничем прервать - даже смертью Sand King.","Во время толчков Sand King может свободно действовать.","Толчки исходят не от места применения заклинания, а от расположения самого героя.","При смерти Sand King после завершения произнесения толчки не прекращаются.","Толчки возникают с интервалом в 0.5\/0.375\/0.3 ( 0.3\/0.25\/0.21) секунд спустя 0.5\/0.375\/0.3 ( 0.3\/0.25\/0.21) секунду после завершения произнесения. То есть заклинанию нужно 3 секунды, чтобы все толчки после базовой задержки были выпущены.","Может нанести до 660\/880\/1100 ( 1100\/1320\/1540) единиц урон одному юниту при попадании всех толчков (до учета сопротивления).","Замедление применяется к врагам с каждым толчком. Несколько источников замедления не складываются, но обновляют длительность. Замедление на юните может длится до 6 секунд (складывается из длительности толчков и дебаффа).","Каждый толчок сначала применяет дебафф, затем наносит урон."],"mana":"150\/225\/300","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"120\/110\/100","name":"Epicenter","description":["Анимация применения: 0+0","Время подготовки: 2","Радиус за каждый толчок: 275\/325\/375\/425\/475\/525\/575\/625\/675\/725 ( \/775\/825\/875\/925)","Количество толчков: 6\/8\/10 ( 10\/12\/14)","Урон за толчок: 110","Замедление скорости передвижения: 30%","Замедление скорости атаки: 30 ( 80)","Длительность замедления: 3"],"hot_key":"R","legacy_key":"C"}],"bio":"Пески Искрящейся пустыни живые и обладают разумом — огромная пустыня говорит сама с собой, размышляя о том, что многие могут только вообразить. Но когда ей нужно найти способ выйти за свои границы, она освобождает частичку себя и наполняет ей магическую броню, созданную джином Калдином. Это создание называет себя Криксалис, что означает «сердце песка», но другие знают его как Sand King. Sand King принимает форму огромного скорпиона, вдохновленный маленькими, но вездесущими обитателями Искрящейся пустыни; и это настоящее выражение его беспощадного характера. Страж, воин, вестник — всё это обязанности Sand King, неразделимого с пустыней, которая дала ему жизнь.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на броню не дается иллюзиям."],"trivia":["В очень старой версии DotA, существовала ошибка при использовании Epicenter, когда последний импульс наносил колоссальный урон более чем 10,000 очков жизни и убивал любого в зоне досягаемости, за исключением Pudge, максимально одетого на живучесть, который использовался как подопытный для измерения наносимого урона.","Еще одна старая ошибка связанная с использованием Burrowstrike на союзного крипа. Когда крип попадал в радиус действия Burrowstrike, Sand King перемещался в первоначальную позицию крипа, в момент нажатия способности. Но так как это работало лишь на союзных крипов, чаще всего это использовали для быстрого возвращения на базу.","Гейб Ньюэлл признался, что Sand King его любимый герой.","Реплики Sand King имеют несколько отсылок: Реплика героя Играть \"Like the sands through an hourglass, these are the days of defeat\" является отсылкой к фразе в мыльной опере Days of our Lives' - \"Like sands in the hourglass, these are the days of our lives.\" Реплика героя Играть \"All we are is sand in the wind\" является отсылкой к песне Dust in the Wind группы Kansas. Реплика героя Играть \"You were expecting...Sandy Claws?\", скорее всего, отсылка к анимационному фильму-мюзиклу \"Кошмар перед Рождеством\" Тима Бёртона. Реплика героя Играть \"The King is dead. Long live the King.\" это традиционная французская фраза, которая произносится в некоторых странах во время провозглашения нового монарха.. Реплика при использовании руны Иллюзии Играть \"We three Kings of disorient are...\" является отсылкой к рождественскому гимну, текст, и мелодию которого сочинил преподобный Джон Генри Хопкинс (We Three Kings). Реплика героя Играть \"The sand of silence.\" скорее всего, отсылка к песне \"The Sound Of Silence\" дуэта Simon and Garfunkel. Реплика героя Играть \"The King is dead. Long live the King.\" скорее всего, отсылка к традиционной фразе, которая произносится в некоторых странах во время провозглашения нового монарха. Реплика героя Играть \"Lion, you are king of nothing\" может быть отсылкой к фильму \"Король Лев\".","Звуки Играть и Играть во время Sand Storm являются голосом самого Sand King."],"talents":["Sand Storm замедляет и ослепляет жертв на 50%:+50 здоровья в секунду","+4 толчка у Epicenter:+10 к броне","+50 к замедлению атаки от Epicenter:+40 к урону в секунду от Sand Storm","+200 к здоровью:+20 к скорости передвижения"],"tips":["На ранних стадиях игры используйте комбинацию Burrowstrike + Sand Storm вы оглушите противника и нанесёте не малый урон ,а также с инициируете битву.","Используйте комбинацию: Epicenter + Shift + Blink Dagger. Она позволит вам неожиданно ворваться в битву, внесет в ваши действия элемент неожиданности и серьезный урон. В идеале, такой комбинацией начинаются практически все драки для Sand King.","Blink Dagger один из основных предметов для Sand King. Используйте его для быстрого впрыгивания в гущу битвы (так враги точно не собьют применение вашей Особой способности).","Урон от всех волн Epicenter 3-го уровня равняется 1100 единицам, что может с легкостью сокрушить команду противника.","Sand Storm защищает от физических атак, при этом он наносит урон врагам (в том числе невидимым) в радиусе действия способности. Однако, герой не будет неуязвим под этой способностью - враги могут героя увидеть, если у них есть предметы, раскрывающие невидимость.","На 3-ем и 4-ом уровнях Sand Storm является практически постоянной способностью, так как оно не требует много маны и время до повторного ее использования очень маленькое. В придачу, мана и здоровье восстанавливаются во время использования способности.","Удачное применение комбинации Burrowstrike + Epicenter поможет вам разобраться практически с любым врагом.","Sand King произносит Epicenter в течение двух секунд. Если произнесение прервется, вне зависимости от того, кто его прервал, то заклинание все равно потратит ману и появится перезарядка."],"desc":"Sand King — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Burrowstrike, Sand King зарывается в землю и роет туннель вперед, оглушая врагов, находящихся над ним, и нанося им урон. Вторая способность, Sand Storm, позволяет герою закрыться в песчаной буре, становясь невидимым, при этом нанося периодический урон ближайшим целям. Пассивная способность, Caustic Finale, вводят в тело жертвы яд, который разорвет ее тело на части после смерти или по окончанию его действия, нанося урон и замедляя врагов в области рядом с жертвой. Ультимативная способность, Epicenter, посылает толчки в землю, заставляя ее содрогаться. Все враги, попавшие в радиус действия, получат урон и замедлятся. Каждый следующий толчок увеличивает радиус урона. Улучшается с Aghanim's Scepter."}