{"abilities":[{"effects":["Health Cost: 170","Temporary Mana Bonus: 150","Duration: 10"],"notes":["Interrupts the user's channeling spells upon cast.","If the mana bonus would exceed the user's current mana pool, its max mana pool is temporarily increased by the exceeding amount.","At the end of the duration, the user loses any unused mana of the 150 mana bonus. If its maximum mana pool was increased, it goes back to normal if it was exceeded. Only counts actual spent mana. Mana lost in other ways (like Nether Ward, Mana Break or Mana Burn) does not count.","The lost health is not gained back when the gained mana was unused or partly unused.","The 170 health lost upon cast is never lethal. When casting with 170 health or less, the user's health goes down to 1."],"elements":["Ability No Target","Affects Self","Damage Pure (HP Removal)"],"description":"Consume 170 health to temporarily gain 150 mana. Lasts 10 seconds. If the mana gained cannot fit in your mana pool, it creates a buffer of mana that will be used before your mana pool."}],"cost":"770","description":"A ring that feeds on the souls of those who wear it.","trivia":["Soul Ring was the only item not allowed in The International 2013 Solo Championship."],"further":["Ring_of_Regen","Gauntlets_of_Strength","Gauntlets_of_Strength","Recipe"],"tips":["Use Soul Ring right before casting a costly ability. This is especially effective during the laning stage, as it will offset most of your mana costs.","Make sure you are safe before using Soul Ring, as the reduced health can make your hero much more vulnerable.","Against heroes with mana burning abilities, Soul Ring can give you enough mana to get an important spell off in a fight.","When the cooldown goes off (25 seconds) the health regenerated is 62.5, i.e. 37% from the original 170 health consumed, so the value of health used for the Sacrifice ability is 107.5 health, only the 63% of the total used.","If your hero has low health or no means of regenerating health, consider picking up Tranquil Boots too in order to refill health after using the active a lot.","By the same token, this item is very good on strength heroes due to their larger health pools and health regeneration rates. Heroes with increased base health regeneration rates may benefit more from this item as well.","Consider dropping items that increase mana capacity before using Soul Ring and picking them back up afterwards. Dropping those items decreases your mana capacity while current mana percentage remains the same, but Soul Ring still gives the full amount of mana. Picking up the items afterwards increases mana capacity while retaining the same percentage, thus resulting in a net gain of mana. As an added bonus, the extra mana gained through this method does not count as having been gained through the Soul Ring, and as such, will not be lost at the end of the duration even if unused."],"attrs":["Active Sacrifice","Bonus +6 Strength +2.5 Health regeneration","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 120 health, 3.1 health regen, 0.48% magic resistance and 6 attack damage.","For agility heroes, it grants 120 health, 3.1 health regen and 0.48% magic resistance.","For intelligence heroes, it grants 120 health, 3.1 health regen and 0.48% magic resistance."]}