{
  "abilities": [
    {
      "notes": [
        "Can directly be cast on any unit, except for ancient creeps, creep-heroes, buildings, wards, or invulnerable units\n ↓↓ Double-tapping automatically targets self",
        "Creates a planted tree on every 45°th of a 150 radius circle, resulting in 8 trees forming a ring and trapping the targeted unit\n Trees created with Sprout act exactly like the other trees on the map\n They block pathing, vision, and interact with other abilities the same way\n Sprout trees have a different model and are smaller than other trees on the map and they do not have a dying animation\n <span image=\"items\/tango\/full.webp\">[picture:tango]<\/span> Tango heals for twice as long when targeting a Sprout tree",
        "Destroying one tree is enough to allow units to walk in and out of the ring of trees",
        "Sprout grants 250 range flying vision around the targeted point for its duration\n The vision granted is not provided by the trees and remains even after all Sprouted trees are destroyed",
        "Units not controlled by any player do not try to path around the Sprout trees, but simply walk against them as if they are not there\n This effectively causes them to get stuck, until they change directions",
        "TALENT NOTES Both the Sprout miss chance and Sprout leashes talents adds a 200 radius aura to the center of Sprout\n The aura blinds enemies, causing them to miss 200 of their attacks\n Sprout's blind uses uses pseudo-random distribution\n The aura leashes enemies, preventing them from casting certain mobility abilities\n Both debuffs' aura lingers for 0.5 seconds\n SOULBIND Affects both the primary and the secondary targets when directly targeted"
      ],
      "item_behaviour": [],
      "description": "Sprouts a ring of trees around a unit, trapping it in place, and providing vision in a 250 radius.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.35+0.44",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 625\/700\/775\/850",
        "Trees Spawn Radius: 150",
        "Number of Trees: 8",
        "Duration: 3\/4\/5\/6",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Aura Radius:  200",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Miss Chance:  100%",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Aura Linger Duration:  0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Nature%27s_Prophet_Sprout_1.mp3\/revision\/latest?cb=20191216020912",
      "effects": [
        "Ability: Target Point",
        "Affects: "
      ],
      "mana": "11\/10\/9\/8",
      "aghanim": null,
      "name": "Sprout",
      "cooldown": "70\/90\/110\/130",
      "legacy_key": "T",
      "story": "Verdant overgrowth is a common ailment reported by Nature's Prophet's attackers."
    },
    {
      "notes": [
        "Disjoints projectiles upon teleporting",
        "↓↓ Double-tapping automatically targets the team's fountain",
        "Unlike the teleport of <span image=\"items\/town_portal_scroll\/full.webp\">[picture:town_portal_scroll]<\/span> Town Portal Scroll, canceling this one neither puts the ability on cooldown, nor consumes mana",
        "During the cast time, a visual effect is created around Nature's Prophet and at the target location\n These visual effects are visible to everyone",
        "Also plays a sound at the target location, however, this is only audible to enemies when Nature's Prophet is visible to them\n SPELL STEAL This ability's cast point is not modified when acquired"
      ],
      "item_behaviour": [],
      "description": "Teleports to any point on the map.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 3+0",
        "Cast Range: Global"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d4\/Nature%27s_Prophet_Teleportation_1.mp3\/revision\/latest?cb=20191216020913",
      "effects": [
        "Ability: Target Point",
        "Affects: Self"
      ],
      "mana": "62\/48\/34\/20 (TagTalent 0)",
      "aghanim": null,
      "name": "Teleportation",
      "cooldown": "50",
      "legacy_key": "R",
      "story": "The Prophet keeps his sentinel over the forest, protecting it when in need."
    },
    {
      "notes": [
        "Nature's Call can only create as many Treants as there are trees in the targeted area",
        "Destroys all trees in the target area, regardless of how many Treants are created",
        "Treants always spawn at the center of the area",
        "Must have at least 1 tree within its area to be castable\n Targeting an area without trees gives an error message\n However, if trees within the targeted area disappear during the cast time, the ability is not canceled, wasting mana and cooldown",
        "TALENT NOTES Despite the <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent's description, the Treants health and damage multiplier <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent does not multiply the health and damage values by 2.5\n Instead, it adds 825 health and 27\/39\/51\/63 min\/max attack damage to the <span image=\"images\/nature's_prophet_treant.png\">[picture:nature's_prophet_treant]<\/span> Treants\n This effectively increases the health of Treants by 2.5x\n This effectively increases the average attack damage of Treants by 2.64\/2.7\/2.7\/2.7x"
      ],
      "item_behaviour": [],
      "description": "Converts an area of trees into Treants under the command of Nature's Prophet.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.5+1.23",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 750",
        "Radius: 150\/225\/300\/375 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 275\/350\/425\/500)",
        "Number of Treants: 2\/3\/4\/5 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 7\/8\/9\/10)",
        "Treant Duration: 60"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f4\/Nature%27s_Prophet_Nature%27s_Call.mp3\/revision\/latest?cb=20191216020911",
      "effects": [
        "Ability: Target Area",
        "Affects: Trees"
      ],
      "mana": "37 (TagTalent 29)",
      "aghanim": null,
      "name": "Nature's Call",
      "cooldown": "150",
      "legacy_key": "F",
      "story": "Verodicia bestowed the Prophet with the ability to summon the Treant Guard, a mythical sentient army of the wild."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard to be unlocked",
        "Curse of the Oldgrowth's effects are instantly applied within its whole area\n There is no travel time",
        "Checks for trees periodically within 15 radius and adapts the damage and movement speed slow values instantly\n Trees includes <span image=\"images\/nature's_prophet_treant.png\">[picture:nature's_prophet_treant]<\/span> Treants regardless of factions, regular trees and planted trees (e.g\n <span image=\"images\/sprout.webp\">[picture:sprout]<\/span> Sprout)",
        "Deals damage in 1-second intervals, starting immediately upon cast, resulting in 7 instances\n Can deal a minimum 360\/480\/600\/720 damage (before reductions) to the unit trapped by Sprout for the entire duration\n Deals 0 damage per second to affected enemy targets if there are no trees within the radius\n Fully procs on-damage effects if no abilities are on cooldown, such as <span image=\"images\/corrosive_skin.webp\">[picture:corrosive_skin]<\/span> Corrosive Skin, except those which have a minimum damage threshold (e.g\n <span image=\"images\/gravekeeper's_cloak.webp\">[picture:gravekeeper's_cloak]<\/span> Gravekeeper's Cloak)",
        "The debuff exposes the target, but does not provide True Sight over them, and slows their movement speed\n Does not apply the debuff on invisible units and units under <span image=\"items\/smoke_of_deceit\/full.webp\">[picture:smoke_of_deceit]<\/span> Disguise"
      ],
      "item_behaviour": [],
      "description": "Applies a curse on all enemy heroes within 1200 range, displaying them in fog, slowing them, and causing damage over time based on the number of trees within 250 radius. Treants count as trees for this purpose.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.4",
        "Radius: 1200",
        "Tree Search Radius: 250",
        "Damage per Second per Tree: 15",
        "Move Speed Slow per Tree: 7%",
        "Duration: 7"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: No Target",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "mana": "18",
      "aghanim": null,
      "name": "Curse of the Oldgrowth",
      "cooldown": "80",
      "legacy_key": "L",
      "story": "Though powerful, Nature's Prophet's gifts do not include all-sight, and he must rely heavily upon reconnaissance and aid from a long-standing network of stalwart friends."
    },
    {
      "notes": [
        "When ground-targeted, Wrath of Nature automatically jumps on the closest visible enemy",
        "Bounces in 0.25-second intervals, so hitting all targets takes 4.25 seconds",
        "Does not bounce on <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers, invisible units or units in the Fog of War",
        "Can never hit the same unit twice per cast",
        "All bounces together can collectively deal up to 5243.9\/6839.9\/8435.8 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 6611.9\/8207.9\/9803.8) damage\n For how much damage each bounce deals on each level, please refer to the chart below",
        "The caster receives one stack of attack damage for each enemy killed by Wrath of Nature\n To gain a stack, enemies have to die to the damage\n Killing an enemy with the Wrath of Nature debuff does not grant a stack\n Each instance has its own independent duration\n The status buff shows the current amount of damage the stack provides\n There is no stack limit\n For how much regular flat bonus attack damage each bounce of Wrath of Nature grants per kill, please refer to the chart below",
        "SCEPTER NOTES Wrath of Nature now roots and disarms all hit enemies and provides True Sight over them\n The duration starts at 2 and increases by 0.106 seconds per bounce\n Wrath of Nature first applies the debuff, then the damage\n For the root duration increase per bounce from the 1st to the 18th target, please refer to the chart below"
      ],
      "item_behaviour": [],
      "description": "Damaging energy bounces around the map, striking enemies close to the cast point that are in vision. Each enemy hit beyond the first adds damage. Enemies that die under this spell grant you bonus damage for 50 seconds.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.5+0.97",
        "Cast Range: Global",
        "Bounce Distance: Global",
        "Number of Bounces: 18",
        "Damage Increment per Bounce: 10%",
        "Base Damage: 115\/150\/185 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 145\/180\/215)",
        "Attack Damage Bonus per Kill: 6",
        "Attack Damage Bonus Duration: 50",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Min Root Duration:  2",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Max Root Duration:  3.8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7a\/Nature%27s_Prophet_Wrath_of_Nature_1.mp3\/revision\/latest?cb=20191216020919",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "85 (TagTalent 60)",
      "aghanim": null,
      "name": "Wrath of Nature",
      "cooldown": "130\/160\/190",
      "legacy_key": "W",
      "story": "Nature's Prophet calls Verodicia's fury to strike down those who might ravage the wilderness."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 3.6,
    "attrAgility": 22.0
  },
  "description": "Able to teleport to any location on the map at will. Planted as a seed by the goddess Verodicia, and grown from the remnants of her own body, the Nature's Prophet rose on the vernal equinox to defend the verdant world. Gifted with foresight, Nature's Prophet seems to be everywhere at a moment's notice. Trapping foes with a ring of trees Sprouted from the forest floor and Teleporting at will to any location. The trees around him serve as his objects of power; using them, he instantly summons a Sentient Army of violent trees to fight for him, he attacks where enemies least expect. Channeling the goddess' fury, the Prophet strikes at every intruder in the land, bringing both the Curse of the Oldgrowth and the Wrath of Nature down on all who would do harm to Verodicia's creation.  Carry Jungler Pusher Escape Nuker ★★☆",
  "trivia": [
    "Nature's Call was called Force of Nature in DotA.",
    "In DotA, Nature's Prophet's name was Furion, a reference to Malfurion Stormrage from the Warcraft universe. His Dota 2 name had to be changed in order to avoid copyright issues with Blizzard. He is still called Furion by the majority of the player base and is referred to as \"Furion\" in the game files.",
    "Nature's Prophet was originally named \"Tequoia\" in Dota 2, but this was changed for unspecified reasons.",
    "\"Nature's Profit\" is a popular nickname for Nature's Prophet, due to his farming and split-pushing playstyle.",
    "Nature's Prophet's early lore concept made him the father of Anti-Mage and Terrorblade (similar to how he was in DotA), but this idea was later scrapped.",
    "Nature's Prophet's spawning response, Link▶️ \"I speak for the trees.\" is a direct reference and homage to Dr. Seuss' The Lorax.",
    "One of Nature's Prophet's last hitting responses, Link▶️ \"Green is good.\", is a reference to \"greed is good,\" a quote from the 1987 film Street, as well as the Warcraft III cheat code of the same name.",
    "One of Nature's Prophet's Illusion Rune responses, \"Leaves of three, let them be,\" is a traditional rhyme for identifying and avoiding Poison Ivy."
  ],
  "history": "When Verodicia, Goddess of the Woods, had finished filling in the green places, having planted the coiled-up spirit in the seed, having lured the twining waters from deep within the rock, having sworn the sun its full attention to the growing things, she realized that her own time had reached its end, and like one of the leaves whose fate she had imprinted in the seed, she would fall without seeing the fruiting of her dream. It pained her to leave the world bereft, for the sprouts had not yet broken through the soil--and they would be tender and vulnerable to every sort of harm. She found in her seed pouch one last seed that she had missed in the sowing. She spoke a single word into the seed and swallowed it as she fell. Her vast body decomposed throughout the long winter, becoming the humus that would feed the seedlings in the spring. And on the morning of the vernal equinox, before the rest of the forest had begun to wake, that last seed ripened and burst in an instant. From it stepped Nature's Prophet, in full leaf, strong and wise, possessing Verodicia's power to foresee where he would be needed most in defense of the green places--and any who might be fortunate enough to call him an ally.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Removed Teleportation Cooldown",
        "talent_left": "2.5x Treant HP\/Damage"
      },
      {
        "talent_lvl": "20",
        "talent_right": "Sprout Leashes",
        "talent_left": "100% Miss chance for Sprouted units"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+25 Attack Speed",
        "talent_left": "+5 Treants Summoned"
      },
      {
        "talent_lvl": "10",
        "talent_right": "-8s Nature's Call Cooldown",
        "talent_left": "+30 Wrath of Nature Base Damage"
      }
    ]
  }
}