{"abilities":[{"spell":"Undying steals strength from all enemy heroes in an area, dealing base damage as he claims the enemy's strength for himself.","effects":["Ability Target Area","Affects Enemies \/ Self","Damage Magical"],"notes":["Successive casts of Decay fully stack on the targets and on Undying.","Cannot reduce a hero's strength below 0, but Undying always gains the full amount of strength for each hit enemy hero.","Steals strength before applying its damage. The strength loss on the target does not keep the current health percentage, but instead removes 20 health per strength from the current health pool. The strength gain on Undying does not keep the current health percentage either, and instead adds 20 health per strength to the current health pool. Increases\/reduces Undying's\/hit enemies' current health by a total of 80 ( 200). This health bonus does not count as a heal, so it is unaffected by amplifications, and also bypasses Ice Blast and False Promise.","Hit non-strength heroes effectively lose 80 ( 200) health, 0.4 ( 1) health regen, and 0.32% ( 0.8%) magic resistance. Hit strength heroes effectively lose 80 ( 200) health, 0.4 ( 1) health regen, 0.32% ( 0.8%) magic resistance, and 4 ( 10) attack damage. Vice versa, effectively increases Undying's health, health regen, magic resistance and attack damage by the same amount per stack.","Does not steal strength from illusions, but does from hero clones.","When multiple Meepo clones are in the area, only one of them (randomly chosen on each cast) gets his strength stolen. The same applies to Arc Warden and his Tempest Double. The damage still hits all Meepos and all Arc Wardens.","Each status buff of Decay increases Undying's model size by 2%. This has no impact on his collision size.","Despite the visual effects, the stolen strength is gained instantly.","Upon acquiring\/losing Aghanim's Scepter, all stacks of stolen strength adapts immediately. Upon updating the strength, Undying's current health stays the same. However, debuffed enemies keep their current health percentage. Their health also only updates upon gaining\/losing maximum health again, and not instantly.","When Undying dies, he loses all the stolen strength, but the affected enemies do not get theirs back, and vice versa."],"mana":"70\/85\/100\/115","elements":["Cannot be used by illusions.","Does not pierce spell immunity."],"cooldown":"10\/8\/6\/4 ( 8\/6\/4\/2)","name":"Decay","description":["Cast Animation: 0.45+0","Cast Range: 650 ( 800)","Radius: 325","Damage: 20\/50\/80\/110","Strength Steal: 4 ( 10)","Duration: 45 ( 95)"],"hot_key":"Q","legacy_key":"D"},{"spell":"Undying rips health away from all nearby units and uses it to heal an ally, or damage an enemy. Soul Rip can also be used to heal Tombstone.","effects":["Ability Target Unit","Affects Enemies \/ Allies","Damage Magical"],"notes":["Can be cast on Tombstones, but not on any other ward type unit.","When cast on an allied Tombstone, it heals it for 2\/4\/6\/7 health. Always heals for this fixed amount, regardless of unit count.","Can target enemy Tombstone, but does not damage or heal it.","Cannot be cast on Tombstone zombies.","The 1300 search radius is centered around Undying, not the target.","Units within the area are selected randomly and have to pay 18\/22\/26\/30 health as part of the health cost. This health loss is never lethal.","Does not count Undying, the target, wards, buildings, invisible enemies and units in the Fog of War.","Spell immune allies are counted, including the zombies from Tombstone.","Units which require a certain amount of attacks to be killed do not lose health when counted in by Soul Rip.","If there are no valid units within the search radius, the damage or healing equals zero.","The damage or heal are summed up and the target receives them in once instance.","Soul Rip can damage or heal a unit for up to 180\/264\/364\/480 health (before reductions)."],"mana":"80\/95\/110\/125","elements":["Partially blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"24\/18\/12\/6","name":"Soul Rip","description":["Cast Animation: 0.35+0","Cast Range: 750 ( 900)","Search Radius: 1300","Damage\/Heal per Unit: 18\/22\/26\/30","Maximum Units: 10\/12\/14\/16"],"hot_key":"W","legacy_key":"R"},{"spell":"Summons a tombstone at the target point. Zombies will frequently spawn next to every enemy unit in the area around the Tombstone, and attack them. Zombies have the Deathlust ability, which causes their attacks to slow the target, and if the target reaches below a certain amount of health, increases the attack and movement speed of the zombie.","effects":["Ability Target Point","Affects Enemies"],"notes":["Destroys trees within 300 radius around the Tombstone upon cast.","Zombies do not spawn for invisible units or units in the Fog of War.","Zombies do not spawn for wards, buildings, couriers, hidden units and zombies from an enemy Tombstone.","The zombies are uncontrollable and do nothing but attack their set target. However, they can be boosted by allied spells or auras. An exception here is Howl, which does not affect the zombies.","The first wave spawns immediately as the Tombstone is summoned, resulting in 8\/9\/10\/12 possible waves per cast.","When a zombies' target turns invisible, the associated zombies die after 0.1 seconds.","When a zombies' set target dies, the associated zombies die instantly, unless the target was a Meepo. In the case of Meepo clones dying, the zombies just stand around until the Tombstone is gone.","When a zombies' set target runs into the Fog of War, the associated zombies still follow it.","When the Tombstone expires or is killed, all its zombies instantly die.","The zombies can only die to physical attacks (meaning e.g. Counter Helix cannot affect them). It does not matter how much damage an attack actually deals, it only has to successfully hit a zombie in order to count. This means that missed attacks do not deal any damage to zombies.","Illusions are treated as creeps when attacking the Tombstone, so they take four times as many attacks to destroy it as heroes. When attacking zombies, illusions are treated as creeps, not heroes, requiring two attacks to kill them.","When the talent is chosen, a Tombstone of the current level spawns whenever Undying dies. This spawn is independent from the cooldown and does not require mana. The tombstone spawns even when having Reincarnation. The Tombstone lasts its full duration, it is not bound to Undying's death timer and does not disappear when he respawns."],"mana":"120\/130\/140\/150","elements":["Does not pierce spell immunity."],"cooldown":"85\/80\/75\/70","name":"Tombstone","description":["Cast Animation: 0.45+0","Cast Range: 600 ( 750)","Zombie Spawn Radius: 1200","Zombie Spawn Interval: 4\/3.5\/3\/2.5","Hero Attacks to Destroy Tombstone: 4\/5\/6\/7 ( 9\/10\/11\/12)","Non-Hero Attacks to Destroy Tombstone: 16\/20\/24\/28 ( 36\/40\/44\/48)","Hero\/Tower Attacks to Kill Zombie: 1","Other Attacks to Kill Zombie: 2","Tombstone Duration: 30"],"hot_key":"E","legacy_key":"T"},{"spell":"Undying transforms into a horrifying flesh golem that possesses a Plague Aura. This aura slows all enemy units within 375 range and causes them to lose a percentage of their current health per second.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Flesh Golem interrupts Undying's channeling spells upon cast.","Increases Undying maximum health, keeping his current health percentage unchanged.","The damage on enemies is dealt in 0.5 second intervals, starting 0.5 seconds after the debuff is placed, resulting in up to 60 possible instances.","Can deal up to 88.66% of the target's current health as damage over the full duration (before reductions), assuming nothing else affects the target's health.","Since the damage per second is based on a percentage of the target's current health, it can never kill an enemy by itself.","Both, the damage over time and the movement speed slow are provided by the aura.","Plague Aura's debuff lingers for 0.5 seconds.","Multiple instances of the Plague Aura do not stack.","Flesh Golem is fully canceled on death."],"mana":"100","elements":["Can be used by illusions.","Does not pierce spell immunity."],"cooldown":"125","name":"Flesh Golem","description":["Cast Animation: 0+0","Effect Radius: 375","Health Bonus: 400\/1000\/1600","Current Health as Damage per Second: 7%","Movement Speed Slow: 24%\/32%\/40%","Aura Linger Duration: 0.5","Flesh Golem Duration: 30"],"hot_key":"R","legacy_key":"F"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Self"],"notes":["Gained by choosing the right level 25 talent. The ability is shown as a permanent buff in the HUD.","Reincarnation cannot be prevented in any way. If Undying dies with it, it is used.","If Undying has the Aegis of the Immortal, the talent triggers first, if it is ready.","Revives with full health and mana. Spells and items are not refreshed.","Provides 1800\/800 ground vision at the death location during its delay.","The cooldown cannot be altered by anything."],"mana":"0","elements":["Cannot be used by illusions."],"cooldown":"250","name":"Reincarnation","description":["Effect Delay: 5"]},{"spell":"Slows enemy units on attack. If the attacked unit's health goes below the threshold, the zombie receives enhanced movement and attack speed.","effects":["Ability Passive","Affects Enemies"],"notes":["The slow from multiple attacks and multiple zombies fully stacks.","Each stack lasts 2.5 seconds. They do not refresh each other's duration.","The number of current stacks can be seen on the debuff icon (a number is visible on it).","The health of the target is checked in 0.5 second intervals. If their target is below the threshold, the Deathlust Frenzy buff is placed.","The buff lasts for 2.5 seconds, but gets refreshed as long as the target stays below the threshold.","Does not trigger against Familiars."],"mana":"0","elements":["Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Deathlust","description":["Fixed Health Threshold: 100\/200\/300\/400","Percentage Health Threshold: 20%\/25%\/30%\/35%","Threshold Move Speed Bonus: 50%","Threshold Attack Speed Bonus: 75","Move Speed Slow: 7%","Slow Duration: 2.5"]},{"spell":"This creature does not feel the effects of most magical spells.","effects":["Ability Passive","Affects Self"],"notes":["The Tombstone has this ability as well.","The status buff uses the other spell immunity icon."],"mana":"0","elements":["Not disabled by Break."],"cooldown":"0","name":"Spell Immunity","description":["Magic Resistance Bonus: 100%"]}],"bio":"How long has it been since he lost his name? The torn ruin of his mind no longer knows. Dimly he recalls armor and banners and grim-faced kin riding at his side. He remembers a battle: pain and fear as pale hands ripped him from his saddle. He remembers terror as they threw him into the yawning pit of the Dead God alongside his brothers, to hear the Dirge and be consumed into nothingness. In the darkness below, time left them. Thought left them. Sanity left them. Hunger, however, did not. They turned on each other with split fingernails and shattered teeth. Then it came: distant at first, a fragile note at the edge of perception, joined by another, then another, inescapable and unending. The chorus grew into a living wall of sound pulsing in his mind until no other thought survived. With the Dirge consuming him, he opened his arms to the Dead God and welcomed his obliteration. Yet destruction was not what he'd been chosen for. The Dead God demanded war. In the belly of the great nothing, he was granted a new purpose: to spread the Dirge across the land, to rally the sleepless dead against the living. He was to become the Undying, the herald of the Dead God, to rise and fall and rise again whenever his body failed him. To trudge on through death unending, that the Dirge might never end.","trivia":["In DotA, his hero name was Dirge, and his hero title was Undying.","Undying was originally an intelligence hero. He became a strength hero as he got reworked in the 6.58 gameplay patch. All his abilities, but Soul Rip got reworked. His old abilities are explained here.","Undying makes several references to the Left 4 Dead series, saying names of special infected, campaign names, and even the title itself in his dialogue. One notable reference is Undying's line, \"No dead are safe from Blueheart Bob.\"; this phrase is highly similar to the famous Left 4 Dead \"Chicago Ted\" graffiti line (\"No zombie is safe from Chicago Ted\"). Undying refers to Bounty Hunter as a Hunter due to the Hunter in Left 4 Dead being able to ambush players, just like how Bounty Hunter can. Spirit Breaker is referred to as a Charger due to the Charger sprinting at other players and repeatedly stunning them, just like how Spirit Breaker can. Venomancer is referred to as a Spitter for its ability to spit acid at players, similar to Venomancer himself. Alchemist is referred to as a Jockey as the Jockey climbs on players and steers them, similar to how the Alchemist himself steers his Ogre.","Undying also references the Half Life series in a rival line towards Tinker ( \"For Lamarr.\"). Dr. Kleiner, who shares his voice actor with Tinker, has a pet headcrab named Lamarr. Headcrabs are small, parasitic creatures that attach themselves to the head of their victims, after which the victims turn into zombies.","Undying's taunt against Kunkka \"Where is your ex-parrot?\" is a reference to the famous Parrot Sketch from Monty Python's Flying Circus.","Undying's taunt against Invoker \"Carl? Is that you?\" is a reference to the 6.72's leaked changelog (which turned out to be a fake), where Invoker's name \"Kael\" was mistakenly translated into \"Carl\".","A dirge is a sombre song of mourning or grieving, typically performed at a funeral.","Undying's line, \"Shop smart.\" is a reference to the Army of Darkness movie."],"talents":["-2s Decay Cooldown:Gains Reincarnation 250 CD","+5 Tombstone Attacks to Destroy:Tombstone On Death","+50 Decay Duration:+30 Tombstone Zombie Damage","+8 Health Regen:+150 Cast Range"],"desc":"Undying, the Almighty Dirge, is a melee strength hero who serves as a formidable tank and a dangerous spellcaster. His abilities force opponents to either kill him or suffer powerful debuffs in a teamfight. Decay is a spammable ability that steals enemies' Strength in an area, making them more fragile and Undying himself more durable as the fight goes on while also being exceptionally potent during the early laning phase, leaving your opponents with mere scraps of health. Soul Rip can act as both a powerful heal or nuke, redirecting the flow of living energy to a target. By ripping some of the health of his ally or enemy in an area, the target can be healed if an ally, or damaged if an enemy. This is empowered by Tombstone, which acts as a static tank by summoning zombies to slow Undying's foes while active. With the zombies summoned, Soul Rip can perform to its fullest, while Decay weakens Undying's foes. Finally, Undying can transform into a horrific Flesh Golem. This transformation deals constant damage to nearby enemies during teamfights, and increases his survivability to ensure maximum effectiveness in prolonged fights. Monstrous and truly horrifying, Undying finds great pleasure in keeping himself alive and vital, while his adversaries suffer as he delivers death to the field. With powerful abilities that allow him to perform well in large fights, the Dirge may never cease."}