{"abilities":[{"spell":"Undying наносит урон вражеским героям в указанной области и забирает себе часть их силы.","effects":["Способность Направленная на область","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Несколько применений Decay складываются как у целей, так и у самого Undying.","Не может снизить силу героя ниже 0, но Undying всегда получает всю силу за каждого задетого героя.","Крадет силу до нанесения урона. Потеря силы целью не сохраняет процентное соотношение текущего здоровья к максимальному, но мгновенно отнимает 18 единиц здоровья за силу от текущего запаса здоровья. Сила, полученная Undying, также не сохраняет процентное соотношение текущего здоровья к максимальному, но мгновенно добавляет 18 единиц здоровья за силу к текущему запасу здоровья. Всего увеличивает\/уменьшает текущее здоровье Undying\/врагов на 72 ( 180). Получаемое здоровье не считается за лечение, поэтому на него не действует усиления и его не учитывают эффекты от Ice Blast и False Promise.","Герои, чей базовый атрибут не относится к силе, теряют 72 ( 180) единиц здоровья, 0.4 ( 1) регенерации здоровья и 0.32% ( 0.8%) сопротивления магии. Герои силы теряют 90 ( 225) единиц здоровья, 0.5 ( 1.25) регенерации здоровья, 0.4% ( 1%) сопротивления магии и 4 ( 10) единиц урона. И наоборот, увеличивает урон, здоровье, его регенерацию и сопротивление магии Undying на те же значения за применение.","Не крадет силу у иллюзий, но крадет у клонов героя.","Если в области применения несколько клонов Meepo, то только один из них (каждый раз выбирается случайно) теряет силу. То же самое действует на Arc Warden и его Tempest Double. Урон все равно наносится всем Meepo и Arc Warden.","Каждое очко украденной силы увеличивает модель героя на 2%. Эффект не влияет на размер столкновения.","Вопреки визуальным эффектам украденная сила передается мгновенно.","При получении\/выкладывании Aghanim's Scepter все заряды украденной силы мгновенно адаптируются. При обновлении силы текущее здоровье Undying остается прежним. При этом задетые враги сохраняют свое соотношение текущег здоровья к максимальному. Их здоровье обновляется только при повторном получении\/потере максимального запаса здоровья, а не мгновенно.","Если Undying умирает, он теряет всю украденную силу, но эта сила не возвращается к врагам - и наоборот."],"mana":"70\/85\/100\/115","elements":["Не может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"10\/8\/6\/4 ( 8\/6\/4\/2)","name":"Decay","description":["Анимация применения: 0,45+0","Дальность применения: 650 ( 800)","Радиус: 325","Урон: 20\/50\/80\/110","Крадет силы: 4 ( 10)","Длительность: 45 ( 95)"],"hot_key":"Q","legacy_key":"D"},{"spell":"Undying вырывает жизненные силы из всех существ, стоящих рядом, чтобы вылечить союзника или нанести урон противнику. Также этой способностью можно лечить надгробие.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Может лечить Tombstone, но не других юнитов-вардов.","При использовании на союзную Tombstone исцеляет 2\/4\/6\/8 здоровья. Значение лечения фиксированное и не зависит от числа ближайших юнитов.","Может выбрать вражескую Tombstone, но не наносит её урона и не лечит.","Нельзя использовать на Undying Zombie.","Радиус поиска цели в 1300 единиц закреплен за Undying, а не за целью.","Юниты в области выбираются случайно и у них отнимается по 18\/22\/26\/30 единиц здоровья (помеченное как отнимающий здоровье урон). Потеря здоровья никогда не будет смертельной.","Не учитывает Undying, цель, варды, строения, невидимых врагов и юнитов в тумане войны.","Союзники с иммунитетом к заклинаниям учитываются, включая зомби от Tombstone.","Юниты, для убийства которых нужно определенное количество атак, не теряют здоровье при учете Soul Rip.","Если в пределах радиуса поиска не будет подходящих юнитов, то урон или лечение будет равно нулю.","Значения урона или лечения сначала складываются, а затем наносятся одним источником.","Soul Rip может нанести урон или вылечить юниту до 180\/264\/364\/480 единиц здоровья (до учета сопротивления)."],"mana":"80\/95\/110\/125","elements":["Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"24\/18\/12\/6","name":"Soul Rip","description":["Анимация применения: 0,45+0","Дальность применения: 750 ( 900)","Радиус: 1300","Урон\/Лечение за юнита: 18\/22\/26\/30","Максимально юнитов: 10\/12\/14\/16"],"hot_key":"W","legacy_key":"R"},{"spell":"Призывает надгробный камень в указанной точке. Периодически он призывает зомби рядом с каждым врагом в определенной области вокруг себя. Зомби обладают способностью Deathlust, которая замедляет их цели при атаках, а также, если здоровье цели падает ниже определенного уровня, способность увеличивает скорость атаки и передвижения зомби.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Физический"],"notes":["Разрушает деревья в небольшом радиусе вокруг надгробия.","Зомби не появляются около невидимых юнитов или юнитов в тумане войны.","Зомби не появляются около вардов, строений, курьеров, спрятанных юнитов и зомби от вражеской Tombstone.","Зомби неподконтрольны и лишь атакуют заданную цель. При этом их можно ускорить с помощью союзных заклинаний или аур. Исключением является Howl - способность не действует на зомби.","Первая волна зомби появляется непосредственно сразу после вызова Tombstone, создавая до 8\/9\/10\/12 волн.","Если цель стала невидимой, то вызванный ею зомби умирает спустя 0,1 секунды.","Если цель умерла, то вызванный ею зомби мгновенно умирает, если только целью не был Meepo. В случае смерти клонов Meepo зомби будут просто стоять до исчезновения Tombstone.","Если цель скрылась в тумане войны, то вызванный ею зомби будет следовать за ней.","Если время Tombstone истекло или её разрушили, то все зомби мгновенно умрут.","Зомби умирают только от физических атак (то есть Counter Helix на них не действует). Неважно, сколько урона наносит атака, учитывается только успешное попадание по зомби. То есть промахнувшиеся атаки не нанесут урона.","Иллюзии при атаке Tombstone считаются за крипов, поэтому им нужно нанести вдвое больше атак, чем героям. Но при атаке зомби иллюзии считаюся за героев, поэтому им нужно ударить лишь раз.","Невозможно защитить при помощи Magnetic Field.","При выборе таланта при смерти Undying создается Tombstone текущего уровня. Появление этого надгробия не связано с текущей перезарядкой и не требует маны. Надгробие появляется даже если у героя есть воскрешение. Tombstone существует всю свою длительность, не связано с таймером воскрешения Undying и не исчезает при его возрождении."],"mana":"120\/130\/140\/150","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"85\/80\/75\/70","name":"Tombstone","description":["Анимация применения: 0,45+0","Дальность применения: 600 ( 750)","Радиус появления зомби: 1200","Интервал появления зомби: 4\/3.5\/3\/2.5","Атак героя для разрушения Tombstone: 4\/5\/6\/7 ( 9\/10\/11\/12)","Атак не-героя для разрушения Tombstone: 8\/10\/12\/14 ( 18\/20\/22\/24)","Атак героя\/вышки для убийства зомби: 1","Других атак для убийства зомби: 2","Длительность: 30"],"hot_key":"E","legacy_key":"T"},{"spell":"Герой превращается в ужасающего голема из плоти, излучающего чумную ауру. Замедляет всех врагов в радиусе 375 и каждую секунду наносит им урон, зависящий от их текущего здоровья.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["При использовании Flesh Golem прерывает произносимые заклинания Undying.","Увеличивает максимальное здоровье Undying, сохраняя процентное соотношение текущего к максимальному.","Наносит урон врагам с интервалом в 0,5 секунды спустя 0,5 секунды после применения дебаффа, срабатывая до 60 раз.","Может нанести до 88.66% от текущего здоровья цели за всю длительность (до учета снижений), если на её здоровье больше ничего не влияло.","Поскольку периодический урон основан на проценте от текущего здоровья цели, то он сам никогда не сможет убить цель.","И периодический урон, и замедление скорости передвижения предоставлены аурой.","Дебафф от Plague Aura задерживается на 0.5 секунды.","Несколько источников Plague Aura не складываются.","Flesh Golem отменяется при смерти."],"mana":"100","elements":["Может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"125","name":"Flesh Golem","description":["Анимация применения: 0+0","Радиус: 375","Доп. здоровье: 400\/1000\/1600","Урон в секунду от текущего здоровья: 7%","Замедление скорости передвижения: 24%\/32%\/40%","Длительность задержки ауры: 0.5","Длительность: 30"],"hot_key":"R","legacy_key":"F"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Способность дается при выборе правого таланта на 25-ом уровне. Она отображается в виде постоянного баффа в интерфейсе.","Активацию Воскрешения нельзя предотвратить. Если Undying умирает, то способность используется.","Если у Undying есть Aegis of the Immortal, то талант сработает первым если готов к активации.","Возрождает героя с полным запасом здоровья и маны. Заклинания и предметы не обновляются.","В момент задержки дает наземный обзор на месте смерти радиусом 1800\/800 единиц.","На перезарядку нельзя ничем повлиять."],"mana":"0","elements":["Не может использоваться иллюзиями."],"cooldown":"250","name":"Воскрешение","description":["Задержка: 5"]},{"spell":"При атаке замедляет врага. Если здоровье цели опустилось ниже определенной границы, зомби получает дополнительную скорость передвижения и скорость атаки.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Замедление от нескольких атак и зомби полностью складываются.","Каждый заряд длится 2.5 секунды. Они не обновляют длительность друг друга.","Текущее количество зарядов можно увидеть в иконке дебаффа (число видно в иконке)","Здоровье цели проверяется с интервалом в 0,5 секунды. Если здоровье их цели ниже нужного порога, помещается эффект Deathlust Frenzy.","Эффект длится 2.5 секунды, но постоянно обновляется до тех пор, пока здоровье цели находится ниже нужного порога.","Не работает против Гаргулий."],"mana":"0","elements":["Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Deathlust","description":["Граница здоровья для усиления зомби: 100\/200\/300\/400","Процентная граница здоровья для усиления зомби: 20%\/25%\/30%\/35%","Доп. скорость передвижения за границу: 50%","Доп. скорость атаки за границу: 75","Замедление передвижения: 7%","Длительность замедления: 2.5"]},{"spell":"Это существо невосприимчиво к эффектам большинства заклинаний.","effects":["Способность Пассивная","Действует на Себя"],"notes":["У Tombstone также есть эта способность.","Иконка баффа использует иную иконку иммунитета к заклинаниям."],"mana":"0","elements":["Не отключается истощением."],"cooldown":"0","name":"Иммунитет к заклинаниям","description":["Доп. сопротивление магии: 100%"]}],"bio":"Как давно он потерял свое имя? Запустелые руины его разума больше не знают. Он смутно припоминает доспехи, флаги и угрюмого родственника, едущего рядом. Он помнит битву, где боль и страх мертвой хваткой вырвали его из седла. Он помнит тот ужас, когда он вместе с братьями пал в бездну владений Мертвого бога, обреченный на вечное прослушивание погребальной песни и полное изничтожение. В глубокой тьме их покинуло время. Мысли. Разум. Но не голод. Брат восстал против брата, имея только ломаные зубы и ногти. И началось: сначала далекая, едва слышимая нота, за ней другая, затем еще одна, неизбежно и нескончаемо. Этот хор постепенно вырос в сплошную стену звука, пожирающую все остальные мысли, пока не осталось оных. Песнь панихиды поглотила его, и он простер свои руки к Мертвому богу, принявший свою участь. Но ей была отнюдь не смерть. Мертвый бог требовал войны. В желудке великой бездны он узнал свое новое предназначение: распространять погребальную песнь по всей Земле, поднимая мертвецов против еще живых существ. Его новое имя — Undying, глашатай Мертвого бога. Его новая цель — восстать, пасть и восстать вновь, лишь бы песнь смерти не прекращала литься ни на миг.","trivia":["Изначально у Undying основной характеристикой был Интеллект и имел способность Heartstopper Aura, которая сейчас принадлежит герою Necrophos. С очередным обновлением, его способности были переработаны, а характеристика героя стала сила.","Дёрдж называет себя \"Боб Блюхарт\". Вероятно, это отсылка к Left 4 Dead и Chicago Ted. Также, среди реплик можно расслышать ряд отсылок к игре Left 4 Dead 2: например, при приветствии героя Spirit Breaker герой произнесет фразу \"Charger!\", что является отсылкой к мутанту из этой серии игры. Аналогично к Bounty Hunter (Hunter!), Venomancer, (Spitter!), Alchemist (Jockey!). Также при убийстве героя герой может произнести фразу \"Left for dead\".","Обращение Undying к Invoker - отсылка к обновлении баланса версии 6.72, когда имя Invoker \"Каэль\" ошибочно перевели, как Карл. (Реплика: Carl, is that you?)Так же можно считать отсылкой к сериалу The Walking dead.","При убийстве Tinker, Undying говорит \"For Lamarr!\" - отсылка к игре Half-Life 2 и хедкрабу доктора Айзека Кляйнера, по имени Ламарр. И именно герой Tinker был озвучен тем же актером, что и доктор Кляйнер.","При убийстве Alchemist, Undying говорит \"You must be this tall to die\", что является отсылкой к слогану кампании \"Мрачный Карнавал\" из Left 4 Dead 2."],"talents":["-2 сек. перезарядки Decay:Воскрешение с перезарядкой в 250 секунд","+5 ударов для уничтожения Tombstone:+30 к урону у зомби от Tombstone","+50 сек. действия Decay:Призыв Tombstone после смерти","+8 здоровья в секунду:+150 к дальности способностей"],"tips":["Decay хорош даже будучи прокачан всего один раз. Максимально прокачивать его стоит только когда начнете вступать в командные бои.","Используйте Soul Rip только когда вокруг много крипов. Использовать ее против противника более результативно когда тот максимально ослаблен Decay.","Из-за ауры от способности Flesh Golem Вы всегда должны находиться как можно ближе к противникам, вот почему первыми предметами должны быть Vanguard и\/или Hood of Defiance."],"desc":"Undying, всемогущий Дёрдж — это герой с ближним типом атаки, основным атрибутом которого является сила. Герой специализируется как танк и хорошо умеет проявлять себя в битвах. Decay — способность для частого применения. Она наносит урон вражеским героям в указанной области и забирает себе часть их силы. Улучшение с Aghanim's Scepter увеличивает забираемую у противников силу. Soul Rip лечит союзника или наносит урон врагу. Лечение и урон зависит от количества героев, стоящих рядом с Дёрджем. Эта способность хорошо показывает себя в связке с третьей способностью, Tombstone, которая призывает надгробный камень в указанной точке. Периодически он призывает зомби рядом с каждым врагом в определенной области вокруг себя. А это означает, что от большого количества возрастёт значение урона (или лечения) от Soul Rip. Также, зомби обладают способностью Deathlust, которая замедляет их цели при атаках, а также, если здоровье цели падает ниже определенного уровня, способность увеличивает скорость атаки и передвижения зомби. Помимо всего прочего, надгробие хорошо раскрывает свою роль при осаде башен. Ультимативной способностью Flesh Golem Дёрдж превращается в ужасающего голема из плоти, излучающего чумную ауру. Эта аура замедляет всех врагов в радиусе и увеличивает урон, который они получают: чем ближе враг к Undying, тем сильнее урон и замедление. Когда зараженное чумой существо умирает, Undying исцеляется на процент от максимального здоровья жертвы. Из всего вышеперечисленного можно сделать вывод, что Дёрдж может легко сохранять свою жизнь и жизнь союзников, попутно унося вражеские. Обладая мощными способностями, которые позволяют выступать герою выступать в больших схватках, Undying может жить всю игру напролёт."}