{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Tango_Devour.mp3\/revision\/latest?cb=20191227195540",
      "effects": [
        "Cast Range: 165",
        "Health Regen Bonus: 7",
        "Duration (TagAghanimRegular Tree): 16",
        "Duration (TagAghanimPlanted Tree): 32",
        "Shared Tango Duration: 40",
        "Number of Charges: 3"
      ],
      "notes": [
        "When cast on a tree, it destroys the tree instantly and increases the caster's health regeneration. When targeting planted trees, except for Acorn Shot trees, the heal duration is doubled. Successive uses do not stack but refresh the duration instead.",
        "When targeting planted trees, except for Acorn Shot trees, the heal duration is doubled.",
        "Successive uses do not stack but refresh the duration instead.",
        "Can regenerate up to 112 (or 224) health over its full duration. All 3 charges together can regenerate up to 336 (672) health.",
        "All 3 charges together can regenerate up to 336 (672) health.",
        "When targeting an allied hero, it creates a Tango (Shared) in the targeted ally's inventory, instead of healing the user. If the targeted ally's inventory is full, the item is dropped on the ground. Can also be cast on creep-heroes, only giving Spirit Bear a charge, otherwise having no effect. Can also be cast on Meepo Clones and the Tempest Double, but doing so has no effect. Cannot be cast on illusions. A shared Tango disappears 40 seconds after being created. Once created, a countdown appears on the item's icon, visible to everyone, showing the remaining duration on the shared Tango.",
        "If the targeted ally's inventory is full, the item is dropped on the ground.",
        "Can also be cast on creep-heroes, only giving Spirit Bear a charge, otherwise having no effect.",
        "Can also be cast on Meepo Clones and the Tempest Double, but doing so has no effect.",
        "Cannot be cast on illusions.",
        "A shared Tango disappears 40 seconds after being created. Once created, a countdown appears on the item's icon, visible to everyone, showing the remaining duration on the shared Tango.",
        "Once created, a countdown appears on the item's icon, visible to everyone, showing the remaining duration on the shared Tango."
      ],
      "mana": "0",
      "abilityName": "Devour",
      "cooldown": "0",
      "description": "Consumes a target tree to gain 7 health regeneration for 16 seconds. Consuming an Ironwood Tree doubles the heal amount. Comes with 3 charges. Can be used on an allied hero to give them one Tango.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "A full set of Tangos is not shareable. However, it is possible to give allies a charge, Tango (Shared), by casting it on them."
  ],
  "cost": "90",
  "lore": null,
  "consistFrom": null,
  "name": "Tango",
  "description": "Forage to survive on the battlefield.",
  "trivia": [
    "In the original DotA, Tango's full name was \"Ancient Tango of Essifation\".",
    "Tango's active ability was called \"Eat a Tree or Ward\" before July 19, 2017 Patch.",
    "Ancient Knowledge Stone may have inspired the creation of Tango."
  ],
  "upgradeIn": null,
  "tips": [
    "Tangos are a very effective source of combat heal during early-game, as they do not dispel upon taking damage. When an engagement seems even or against you, using a Tango can tilt the balance in your favor.",
    "Although one Tango charge heals much less and does so slower than a Healing Salve, one set of Tangos provides slightly more health per gold spent. Also, the fact that it is not dispelled by damage and its secondary effect of destroying trees makes it more versatile than Healing Salves. So if no quick and strong healing is required, Tangos are usually more valuable.",
    "Since using Tangos on a tree destroys the tree, it can be used to create alternate pathways between some trees, making it easier to escape or chase enemies. Sometimes it is worth it to use a Tango just for this purpose.",
    "Unlike other restoring consumables, it is possible to give allies one charge of the Tangos stack. This allows players to grant lane healing to another hero without having to be there.",
    "Can be also used to control certain heroes by destroying trees. For example, perching Monkey King off the tree he is on, gaining vision by devouring the tree created by Sprout."
  ]
}