{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e6\/Enigma_Malefice.mp3\/revision\/latest?cb=20191216013739",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Первое оглушение срабатывает при применении, затем через каждые 2 секунды.",
        "При каждом срабатывании Malefice сначала наносит урон, затем оглушает.",
        "Может нанести до 120\/180\/240\/300 (TagTalent 280\/420\/560\/700) единиц урона (до учета сопротивления). C увеличивающим урон талантом может нанести 210\/270\/330\/390 урона. С увеличивающим количество срабатываний талантом может нанести 280\/420\/560\/700 урона. С обоими талантами может нанести 490\/630\/770\/910 урона.",
        "C увеличивающим урон талантом может нанести 210\/270\/330\/390 урона.",
        "С увеличивающим количество срабатываний талантом может нанести 280\/420\/560\/700 урона.",
        "С обоими талантами может нанести 490\/630\/770\/910 урона.",
        "Может оглушить суммарно на 1,2\/1,8\/2,4\/3 сек. С увеличивающим длительность оглушения талантом может оглушить суммарно на 151,2\/151,8\/152,4\/153 сек. С увеличивающим количество срабатываний талантом может оглушить суммарно на 2,8\/4,2\/5,6\/7 сек. С обоими талантами может оглушить суммарно на 352,8\/354,2\/355,6\/357 сек.",
        "С увеличивающим длительность оглушения талантом может оглушить суммарно на 151,2\/151,8\/152,4\/153 сек.",
        "С увеличивающим количество срабатываний талантом может оглушить суммарно на 2,8\/4,2\/5,6\/7 сек.",
        "С обоими талантами может оглушить суммарно на 352,8\/354,2\/355,6\/357 сек.",
        "Несколько применений Malefice не складываются, но обновляют длительность. Способность продолжает срабатывать с интервалами первого применения."
      ],
      "mana": "14",
      "item_behaviour": [],
      "name": "Malefice",
      "cooldown": "100\/120\/140\/160",
      "description": "Концентрирует энергию Enigma на цели, отчего та получает урон и оглушение каждые 2 сек.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,6",
        "Дальность применения: 600",
        "Количество оглушений: 3 ( 7)",
        "Интервал между оглушениями: 2",
        "Урон за оглушение: 40\/60\/80\/100 ( 70\/90\/110\/130)",
        "Длительность оглушения за интервал: 0,4\/0,6\/0,8\/1 ( 50,4\/50,6\/50,8\/51)",
        "Длительность: 4 ( 12)"
      ],
      "legacy_key": "F",
      "story": "Чуждые гравитационные силы сжимают саму сущность противников, сковывая любое их движение."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Enigma_Demonic_Conversion.mp3\/revision\/latest?cb=20191216013747",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских существ \/ Союзных существ",
        "Урон: Мгновенное убийство"
      ],
      "notes": [
        "Demonic Conversion убивает выбранного юнита, давая золото и опыт, или добивает, если способность применена на союзных юнитов.",
        "Атака строений или союзных существ не учитывается в качестве атак для размножения, но атака вардов - учитывается. Атака засчитывается при запуске снаряда, а не при его попадании. Эйдолоны размножаются после запуска 7-го снаряда от атаки, не принимая во внимание, была ли атакована подходящая цель или нет (например, строение).",
        "Атака засчитывается при запуске снаряда, а не при его попадании.",
        "Эйдолоны размножаются после запуска 7-го снаряда от атаки, не принимая во внимание, была ли атакована подходящая цель или нет (например, строение).",
        "При размножении здоровье эйдолонов обновляется. Их длительность не обновляется. При этом время жизни разделившихся эйдолонов увеличивается на 2 секунды.",
        "При этом время жизни разделившихся эйдолонов увеличивается на 2 секунды.",
        "Эйдолоны могут размножиться лишь один раз. Эйдолоны, появляющиеся после размножения, делиться не могут.",
        "Нельзя использовать на древних крипов, варды, крипов-героев, призванных существ Necronomicon и нейтральних крипов выше 4 уровня: Вожак волков, Дикокрыл-потрошитель, Кентавр-захватчик, Медведемон-крушитель, Сатир-мучитель, Сосновый налётчик, Тролль-некромант,",
        "Вожак волков, Дикокрыл-потрошитель, Кентавр-захватчик, Медведемон-крушитель, Сатир-мучитель, Сосновый налётчик, Тролль-некромант,",
        "Выбор увеличивающего скорость атаки эйдолонов таланта мгновенно обновит показатели всех уже существующих эйдолонов."
      ],
      "mana": "60\/52\/44\/36",
      "item_behaviour": [],
      "name": "Demonic Conversion",
      "cooldown": "140\/150\/160\/170",
      "description": "Превращает крипа в три подконтрольных фрагмента самого героя — эйдолонов. Они раздваиваются после нескольких атак, при этом полностью восстанавливая здоровье.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,7",
        "Дальность применения: 700",
        "Макс. уровень крипа: 4",
        "Число эйдолонов: 3 ( 9)",
        "Атак для раздвоения: 6",
        "Длительность: 40"
      ],
      "legacy_key": "C",
      "story": "Предвечный может притягивать свои сущности из других измерений, создавая в материальном мире троицу тёмных эйдолонов."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Enigma_Midnight_Pulse.mp3\/revision\/latest?cb=20191216013740",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Урон наносится аурой, дебафф которой задерживается на 0,5 сек.",
        "Midnight Pulse наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 9\/10\/11\/12 раз.",
        "Может нанести до 42,7%\/56,56%\/68,62%\/78,43% от текущего запаса здоровья затронутых существ в виде урона (до учета сопротивления).",
        "Не действует на древних крипов и варды.",
        "Эффекты от нескольких применений Midnight Pulse не складываются",
        "При использовании разрушает деревья в радиусе выбранной области."
      ],
      "mana": "50\/45\/40\/35",
      "item_behaviour": [],
      "name": "Midnight Pulse",
      "cooldown": "50\/80\/110\/140",
      "description": "Наполняет местность тёмным резонансом, который наносит врагам урон, зависящий от их текущего здоровья.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 700",
        "Радиус: 550 ( 580)",
        "Урон от текущего здоровья в секунду: 6%\/8%\/10%\/12%",
        "Длительность: 9\/10\/11\/12",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "D",
      "story": "Часть бытия медленно погружается в пустоту."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Enigma_Black_Hole.mp3\/revision\/latest?cb=20191216013746",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "notes": [
        "Полностью обезвреживает всех пойманных врагов и применяет к ним безмолвие.",
        "Затягивает задетых существ против часовой стрелки к центру со скоростью в 30 единиц, в результате чего существа могут преодолеть расстояние до 120 единиц. Чем ближе существа к центру, тем сильнее они к нему притягиваются; уже находящиеся в центре практически не притягиваются, но продолжают движение по максимальной дистанции.",
        "Чем ближе существа к центру, тем сильнее они к нему притягиваются; уже находящиеся в центре практически не притягиваются, но продолжают движение по максимальной дистанции.",
        "Может затягивать существ на непроходимую территорию и сквозь деревья без их разрушения.",
        "Юнитов под действием Black Hole можно вытянуть из него с помощью определенных заклинаний. Force Staff, Hurricane Pike, Snowball, Dispose и Geomagnetic Grip не могут переместить существ из Black Hole.",
        "Притягивание и обезвреживание предоставлены в виде ауры, которая задерживается на 0,5 секунды или до отмены произнесения, в зависимости от того, что произойдет раньше.",
        "Не действует на варды или постройки. Действует на курьеров.",
        "Дает наземный обзор в радиусе 800 единиц на 4 секунды в выбранной точке.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 4 раз.",
        "Может нанести до 400\/600\/800 (TagTalent + 20% от текущего здоровья) единиц урона (до учета сопротивления). Дополнительный урон наносится тем же источником в том же радиусе и с той же длительностью, что и Black Hole. Дополнительный урон не действует на Рошана, он получает только базовый урон.",
        "Дополнительный урон наносится тем же источником в том же радиусе и с той же длительностью, что и Black Hole.",
        "Дополнительный урон не действует на Рошана, он получает только базовый урон.",
        "С Aghanim's Scepter затягивает существ в радиусе 1000 против часовой стрелки со скоростью , в результате чего максимальное преодолеваемое расстояние становится равным Ошибка выражения: * не хватает операнда. Чем ближе существа к центру, тем сильнее они к нему притягиваются. Однако, в отличие от притяжение внутри самой области Black Hole, это движение по спирали намного слабее, оно больше направлено к центру. Внешнее притяжение создаётся отдельной аурой, которая сохраняется 0,5 секунд или до прекращения произнесения заклинания в зависимости от того, что заканчивается раньше. Это притяжение не обезвреживает цели, а придаёт им скорость в сторону центра Black Hole. Если цель убегает от Black Hole, то она фактически будет замедляться на , а если бежать в сторону центра заклинания, то наоборот — ускоряться на .",
        "Чем ближе существа к центру, тем сильнее они к нему притягиваются.",
        "Однако, в отличие от притяжение внутри самой области Black Hole, это движение по спирали намного слабее, оно больше направлено к центру.",
        "Внешнее притяжение создаётся отдельной аурой, которая сохраняется 0,5 секунд или до прекращения произнесения заклинания в зависимости от того, что заканчивается раньше.",
        "Это притяжение не обезвреживает цели, а придаёт им скорость в сторону центра Black Hole. Если цель убегает от Black Hole, то она фактически будет замедляться на , а если бежать в сторону центра заклинания, то наоборот — ускоряться на ."
      ],
      "mana": "200\/180\/160",
      "item_behaviour": [],
      "name": "Black Hole",
      "cooldown": "300\/400\/500",
      "description": "Образует воронку, всасывающую всех врагов в зоне действия. При этом они не могут двигаться, атаковать и применять способности.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 275",
        "Макс. длительность: 4",
        "Радиус действия внутри: 420",
        "Урон в секунду: 100\/150\/200",
        "Длительность задержки ауры: 0,5",
        "Урон в сек. от макс. здоровья: 5%",
        "Радиус действия снаружи: 1000"
      ],
      "legacy_key": "B",
      "story": "Земля содрогается, когда предвечный создает всеразрушающую чёрную дыру, способную уничтожать миры."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 21.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.0,
    "attrAgility": 14.0
  },
  "description": "Затягивает врагов в чёрную дыру, нанося им урон. Как и загадку, скрытую в его имени, Enigma можно описать лишь как существо из пустоты, создание между плоскостями. Он описывает себя с аспектов других измерения, выполняя ритуал Demonic Conversions, чтобы призвать многочисленных эйдолонов. Земля темнеет под чарами Midnight Pulse - и недоброжелатели ошеломляются невидимой силой Malefice, как только попытаются сбежать от влияния энтропии. Одна из легенд гласит, что Enigma - первая сверхновая звезда. Эта теория становится более правдивой, если увидеть, как Enigma начинает манипулировать космической сингулярностью, управляя материей и временем, и притягивать всех, кроме себя, в сверхплотный центр Black Hole.  Контроль Лес Инициация Осада ★★☆",
  "history": "О происхождении этой сущности неизвестно ровным счётом ничего. С древних времен остались лишь истории и легенды, и большинство из них даже не похожи на правду. По сути, это существо — великая загадка, и известно об нём лишь одно: оно — вселенская сила, поглотитель миров. Оно — дитя пустоты, иногда материальное, иногда — бесплотное. Чудище, живущее вне измерений. Одни говорят, что раньше оно было великим алхимиком, пытавшимся раскрыть секреты вселенной, но проклятым за свою заносчивость. Другие называют его непостижимым древним существом, самой бездной, неясным голосом первозданной тьмы, в которой зиждился первый свет. А самые старые легенды гласят, что это первая взорвавшаяся звезда, разумная чёрная дыра — безжалостное существо c туманными намерениями и разрушительной силой, низвергнувшееся на этот мир."
}