{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/aa\/Moon_Shard_Consume.mp3\/revision\/latest?cb=20191227195508",
      "effects": [
        "Cast Animation: 0+0",
        "Cast Range: Global",
        "Attack Speed Bonus: 60",
        "Base Night Vision Bonus: 200"
      ],
      "notes": [],
      "mana": "0",
      "abilityName": "<span style=\"font-weight:bold; color:#fff; text-shadow:1px 1px 2px #000;;\">Consume<\/span>",
      "cooldown": "0",
      "description": "Consume the Moon Shard to permanently gain 60 attack speed and 200 bonus night vision. Max 1 use.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Night Vision Bonus: 400"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "<span style=\"font-weight:bold; color:#fff; text-shadow:1px 1px 2px #000;;\">Shade Sight<\/span>",
      "cooldown": null,
      "description": "Grants 400 bonus night vision.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Attack speed bonus from multiple Moon Shards fully stacks. The attack speed bonus from the Consume buff fully stack with the item as well."
  ],
  "cost": "4000",
  "lore": null,
  "consistFrom": [
    "Hyperstone",
    "Hyperstone"
  ],
  "name": "Moon Shard",
  "description": "Said to be a tear from the lunar goddess Selemene.",
  "trivia": [
    "Prior to the July 14, 2017 Patch, Moon Shard's active ability, Consume, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."
  ],
  "upgradeIn": null,
  "tips": [
    "The item works very well with illusions especially with mana burn, critical hits and low base attack time.",
    "In games where a player finds themselves with more gold than they can spend, due to having all 6 item slots filled out, it may be worth considering purchasing a Moon Shard to consume immediately.",
    "It may be prudent for players to purchase the Moon Shard as their sixth item, to fill in an inventory slot and gain its full benefits while they farm a seventh item to replace Moon Shard, which only provides half the attack speed and night vision after consumption.",
    "In very extreme late-game scenarios, heroes that have nothing better to do with their gold should consider buying Moon Shards to give to their teammates."
  ]
}
