{"abilities":[{"spell":"Summons a powerful Spirit Bear companion that can equip items. If the bear moves 1100 distance away from the Lone Druid, it cannot attack. Lone Druid suffers 10% of his max health as backlash damage if the Spirit Bear dies. As the bear increases in levels, it can learn the Return, Entangling Claws, and Demolish abilities. Spirit Bear does not benefit from attributes.","effects":["Ability No Target","Affects Self","Damage Pure"],"notes":["For all of the Spirit Bear's stats, see here.","The bear is a creep-hero, making it interact differently with several spells. For detailed interactions follow the link.","On the first cast of Summon Spirit Bear, the bear is actually summoned. On every following cast, it is just healed or revived. This means buffs and debuffs are not dispelled upon re-summoning it. Projectiles are not disjointed either.","The backlash damage is dealt as pure damage from the unit that killed the Spirit Bear. Denying the Spirit Bear causes no damage, unless it is killed by neutral creeps.","The Spirit Bear cannot be resummoned if it has taken damage from a player in the last 3 seconds. Has no minimum damage threshold. Damage is checked before any sort of reduction, so fully blocked damage also prevents resummoning it. If the Spirit Bear dies, it can be resummoned immediately.","The Spirit Bear can use every item, except for placing Observer Wards and Sentry Wards. It can also use runes.","Hand of Midas grants Lone Druid the gold and experience when the Spirit Bear uses it.","The Spirit Bear cannot have illusions of itself, so the Illusion Rune and Manta Style do not spawn illusions of the bear.","When the Spirit Bear is 1100 range away from Lone Druid, it gets disarmed, turns slightly grey and uses different animations. The grey hue and disarm symbol are visible to allies only. The animations are visible to everyone.","Has a cast backswing of 0.57 while in True Form."],"mana":"75","elements":["Pierces spell immunity."],"cooldown":"120","name":"Summon Spirit Bear","description":["Cast Animation: 0.5+0.63","Max Health as Backlash Damage: 10%","Attack Proximity Range: 1100 ( Global)","Duration: Permanent"],"hot_key":"Q","legacy_key":"B"},{"spell":"Links Lone Druid and the Spirit Bear, increasing the attack speed of both and causing damage each one deals to heal the other.","effects":["Ability No Target","Affects Self"],"notes":["Interrupts Lone Druid's channeling spells upon cast.","The buff is always placed on the Spirit Bear as well, no matter where it is. The Spirit Bear has to be alive while Spirit Link is cast in order to be affected by it. This also means that, when the Spirit Bear dies while under the effect of Spirit Link, the buff on the Spirit Bear is fully lost. However, when Lone Druid dies while having Aghanim's Scepter, the buff on the Spirit Bear are not lost.","Buffs the Spirit Bear even when it's invulnerable or hidden.","The heal works like lifesteal, with the difference being the attacking unit does not get healed. Attack damage dealt by the Spirit Bear heals Lone Druid and vice versa. Only heals from attack damage. Spell damage does not trigger the lifesteal.","The visual effect on cast only appears when the Spirit Bear is within 1500 range of Lone Druid."],"mana":"50","elements":["Pierces spell immunity."],"cooldown":"43\/36\/29\/22","name":"Spirit Link","description":["Cast Animation: 0+0","Attack Speed Bonus: 20\/40\/60\/80","Shared Lifesteal: 40%\/50%\/60%\/70%","Duration: 10"],"hot_key":"W","legacy_key":"R"},{"spell":"Lone Druid roars fiercely causing nearby enemies to flee towards their base in terror. Their movement speed is increased by 20%.","effects":["Ability No Target","Affects Enemies"],"notes":["Applies fear on all hit enemies within the radius, forcing them to run towards their team's fountain, while preventing them from acting.","Only affects enemy units controlled by a player. AI-controlled units (lane and neutral creeps) are unaffected.","Shares cooldown with the Spirit Bear's Lua error in Module:Ability_ID at line 44: Could not find Cargo data for \"Savage Roar\".."],"mana":"50","elements":["Does not pierce spell immunity."],"cooldown":"38\/32\/26\/20 ( 26\/20\/14\/8)","name":"Savage Roar","description":["Cast Animation: 0.1+0.57","Radius: 325","Enemy Move Speed Bonus: 20%","Duration: 1.2\/1.6\/2\/2.4"],"hot_key":"E","legacy_key":"E"},{"spell":"Lone Druid learns to morph himself into a raging bear, losing his ranged advantage and some base movement speed, but gaining melee power as well as the Battle Cry ability. He can morph freely between druid and bear form.","effects":["Ability No Target","Affects Self"],"notes":["Despite the lack of cooldown, True Form does proc all on-cast effects like a regular spell.","During the transformation, Lone Druid cannot do anything. Cannot be interrupted.","Reduces Lone Druid's movement speed to 280 and attack range to 150 while giving him melee attack properties. This means items treat him as a melee hero (e.g. Stout Shield, Manta Style, Vladmir's Offering, etc).","True Form persists through Lone Druid's death. If he dies during it, he respawns in True Form.","Changes Lone Druid's model and alters his voice."],"mana":"25","elements":["Partially usable by illusions.","Pierces spell immunity."],"cooldown":"0","name":"True Form","description":["Cast Animation: 0+0","Transformation Time: 1.933","Base Attack Time: 1.5","Armor Bonus: 4\/6\/8","Health Bonus: 300\/600\/900","Move Speed Loss: 45","Attack Range Loss: 400 ( 525)"],"hot_key":"R","legacy_key":"F"},{"spell":"Return to Druid form.","effects":["Ability No Target","Affects Self"],"notes":["Replaces True Form until used.","Despite being a sub-spell, Druid Form does proc all on-cast effects like a regular spell.","During the transformation, Lone Druid cannot do anything. Cannot be interrupted."],"mana":"25","elements":[],"cooldown":"0","name":"Druid Form","description":["Cast Animation: 0+0","Transformation Time: 0.8"],"hot_key":"R","legacy_key":"F"},{"spell":"Adds attack damage and armor to the Lone Druid as well as any nearby units under his control.","effects":["Ability No Target","Affects Self"],"notes":["Battle Cry is only available while True Form is active.","Battle Cry's level is set equal to True Form's level.","Affects all units owned by Lone Druid and his Spirit Bear, not just him and the bear.","Plays a part of the sound at the beginning of the cast."],"mana":"50","elements":["Can be used by illusions.","Pierces spell immunity."],"cooldown":"45 ( 20)","name":"Battle Cry","description":["Cast Animation: 0.5+0.57","Radius: 1000","Attack Damage Bonus: 70\/100\/130","Armor Bonus: 10\/15\/20","Buff Duration: 5"],"hot_key":"D","legacy_key":"C"}],"bio":"Long before the first words of the first histories there rose the druidic Bear Clan. Wise and just they were, and focused in their ways to seek an understanding of the natural order. The arch forces of nature saw this, and so sought the most learned among them. Wise old Sylla, clan justiciar and seer, stepped forward for his kin, and to him was given the Seed with these words: 'When all of the world has dimmed, when civilization has left these lands, when the world is slain and wracked by the endless deserts at the end of ages, plant the Seed.' As he grasped his trust, Sylla felt his years recede and his vitality returned. Vast knowledge burst into his mind. He found himself able to project his very will into reality and, with some concentration, alter his own physical form as well. Yet subtle whispers and cruel ears brought word of the Seed and its power to other peoples, and a terrible war crashed upon the Bear Clan. As his ancestral home burned, Sylla took his burden and fled to the wild places. Ages passed, and time and myth forgot the Bear Clan, forgot Sylla and the Seed, forgot wondrous civilizations that rose and fell in Bear Clan's wake. For millenia Sylla has waited, waited for word from his deities, waited for peace to come to the ever warring realms, waited in exile and in secret for the end of all things and for the conclusion of his sacred commitment, preparing himself always to face and destroy whatever would dare threaten his purpose.","talentsTips":["The attack range talent only affects ranged attacks. Melee attacks are not affected.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Lone Druid's original name was \"Syllabear\", a pun on the name of Syl-lab-le, one of the developers who worked with Guinsoo. Before retiring, he created this hero. It has now been shortened to \"Sylla\".","Lone Druid's design, including sickle and cauldrons, is based on depictions of Celtic druids."],"talents":["Battle Cry Grants Spell Immunity:-0.5 Spirit Bear Attack Time","0 Entangle Cooldown:-25s Battle Cry Cooldown","+10 Spirit Bear Armor:-12s Savage Roar Cooldown","+125 Attack Range:+250 Health"],"desc":"Sylla, the Lone Druid, is an adaptable and versatile ranged or melee agility hero, who summons a Spirit Bear, which has its own set of abilities and can equip items, as his ally. With the help of his Spirit Bear, he can carry, jungle, and push lanes effectively. Because of this, technically speaking, the Spirit Bear and Lone Druid himself are two available heroes at once. The Lone Druid himself is mostly played as the aura giver, while the Spirit Bear is played as the main damage dealer and tank. When he activates his abilities, it will not only buff him but the Spirit Bear as well. Lone Druid is versatile as he can change from a fast ranged warrior to a tough and mighty melee bear himself. Together, they can push lanes and towers quickly, farm neutrals in a cinch, and even take down Roshan by themselves if equipped with the right items. Due to the Spirit Bear not benefiting from attributes, it scales weakly into the later portions of the game, encouraging a midgame-oriented playstyle. However, should the need arise, its six extra usable item slots make Lone Druid a force to be reckoned with far into the lategame."}