{"abilities":[{"spell":"Призывает могучего медведя, который может использовать предметы. Он не может атаковать, если расстояние до владельца больше 1100. Если медведь погибнет, герой получит урон в размере 10% от своего максимального здоровья. По мере повышения уровня медведь получает способности Return, Entangling Claws и Demolish. Сила, ловкость или интеллект от предметов не влияют на медведя.","effects":["Способность Ненаправленная","Действует на Себя","Урон Чистый"],"notes":["Чтобы посмотреть все характеристики Spirit Bear, перейдите сюда.","Медведь - крип-герой, поэтому некоторые способности действуют на него иначе. Для более подробной информации перейдите по ссылке.","При первом использовании Summon Spirit Bear призывается медведь. Каждое следущее использование его просто лечит или воскрешает. То есть баффы и дебаффы не развеиваются при повторном призыве.","Урон по себе при смерти медведя наносит чистый урон, приписываемый юниту, который убил Spirit Bear. Добивание Spirit Bear не наносит урон, если только он не умер от нейтральных крипов.","Spirit Bear нельзя перепризвать к себе, если тот получил урон от игрока в течение последних 3 секунд. Для урона нет минимального порога. Урон проверяется до любого вида сопротивления, поэтому даже полностью заблокированный урон предотвращает призыв к себе. Если Spirit Bear умер, то его можно мгновенно призвать.","Spirit Bear может использовать любой предмет, но не может устанавливать Observer Ward и Sentry Ward. Также может использовать руны.","Hand of Midas дает Lone Druid золото и опыт, когда Spirit Bear его использует.","Spirit Bear не может иметь иллюзий, поэтому Руна иллюзий и Manta Style не создают их.","Когда Spirit Bear отходит от Lone Druid на расстояние, превышающее 1100 единиц, медведь получает обезоруживание, становится серым и использует другие анимации. Серый оттенок и значок обезоруживание видны только союзникам. Анимации видны всем.","В форме True Form способность использует время после применения в 0,57 секунд."],"mana":"75","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"120","name":"Summon Spirit Bear","description":["Анимация применения: 0,5+0,63","Урон по себе при смерти медведя: 10%","Расстояние работы атаки медведя: 1100 ( Глобальная)","Длительность: Бесконечно"],"hot_key":"Q","legacy_key":"B"},{"spell":"Связывает медведя с его владельцем, увеличивая скорость атаки обоих. Урон, наносимый одним, восстанавливает здоровье другому.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["При применении прерывает произносимые заклинания Lone Druid.","Бафф всегда применяется к Spirit Bear, где бы он не находился. Для действия в момент применения медведь должен быть живым. Также, если Spirit Bear умирает под действием эффекта, то бафф медведь теряет. При этом, если Lone Druid умирает при наличии Aghanim's Scepter, то бафф с Spirit Bear не спадает.","Бафф применяется к Spirit Bear даже в неуязвимом или спрятанном состоянии.","Лечение действует как вампиризм с тем исключением, что атакующий юнит не излечивается. Вместо этого атаки Spirit Bear лечат Lone Druid и наоборот. Лечение идет только от урона от атак. Урон заклинаний не активирует вампиризм.","Визуальные эффекты применения появляются только в случае, если Spirit Bear находится в 1500 единицах от Lone Druid."],"mana":"50","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"43\/36\/29\/22","name":"Spirit Link","description":["Анимация применения: 0+0","Доп. скорость атаки: 20\/40\/60\/80","Общий вампиризм: 40%\/50%\/60%\/70%","Длительность: 10"],"hot_key":"W","legacy_key":"R"},{"spell":"Lone Druid издает яростный рев, заставляя врагов в ужасе бежать к своей базе. Их скорость передвижения увеличивается на 20%.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Применяет эффект страха ко всем врагам в радиусе действия, заставляя бежать к их фонтану, предотвращая совершение каких-либо действий.","Действует только на вражеских юнитов, подконтрольных игроку. Не действует на юнитов под контролем ИИ (крипов на линии и нейтральных крипов).","У способности общая перезарядка с способностью Spirit Bear Savage Roar."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"38\/32\/26\/20 ( 26\/20\/14\/8)","name":"Savage Roar","description":["Анимация применения: 0,1+0,57","Радиус: 325","Дополнительная скорость противника: 20%","Длительность: 1,2\/1,6\/2\/2,4"],"hot_key":"E","legacy_key":"E"},{"spell":"Lone Druid приобретает способность превращаться в разъяренного медведя. При этом он переходит из дальнего боя в ближний и передвигается медленнее, однако его атаки становятся сильнее, а сам он получает способность Battle Cry. Герой может превращаться в медведя или обратно когда угодно.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Вопреки отсутствию перезарядки, на True Form срабатывают все эффекты, срабатывающие от применения (как и на обычные способности).","В момент трансформации Lone Druid не может ничего сделать. Также её нельзя прервать.","Уменьшает базовую скорость передвижения Lone Druid до 280, а дальность атаки - до 150, присваивая ему ближний тип атаки. То есть, предметы будут считать его за героя ближнего боя (к примеру Stout Shield, Manta Style, Vladmir's Offering и прочие).","True Form остается после смерти Lone Druid. Если способность была активна на момент смерти, герой возродится в форме True Form.","Меняет модель и голос Lone Druid."],"mana":"25","elements":["Частично используется иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"True Form","description":["Анимация применения: 0+0","Время трансформации: 1,933","Задержка перед атакой: 1,5","Дополнительная броня: 4\/6\/8","Дополнительное здоровье: 300\/600\/900","Уменьшение базовой скорости передвижения: 45","Уменьшение дальности атаки: 400 ( 525)"],"hot_key":"R","legacy_key":"F"},{"spell":"Возвращает в обличье друида.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Заменяет True Form до использования.","Вопреки тому, что эта способность вспомогательная, на Druid Form срабатывают все эффекты, срабатывающие от применения (как и на обычные способности).","В момент трансформации Lone Druid не может ничего сделать. Также её нельзя прервать."],"mana":"25","elements":[],"cooldown":"0","name":"Druid Form","description":["Анимация применения: 0+0","Время трансформации: 0,8"],"hot_key":"R","legacy_key":"F"},{"spell":"Увеличивает урон и броню Lone Druid и всем подконтрольным юнитам вокруг.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Battle Cry доступен только при активной True Form.","Уровень Battle Cry равен уровню True Form.","Действует на всех юнитов под контролем Lone Druid и его Spirit Bear, а не только на героя и медведя.","Проигрывает часть звука в начале использования."],"mana":"50","elements":["Может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"45 ( 20)","name":"Battle Cry","description":["Анимация применения: 0,5+0,57","Радиус: 1000","Дополнительный урон: 70\/100\/130","Дополнительная броня: 10\/15\/20","Длительность: 5"],"hot_key":"D","legacy_key":"C"}],"bio":"Друидский Клан Медведя процветал задолго до первых слов самых ранних исторических сказаний. Мудры и справедливы были его члены, и стремились они понить порядки природы. Высшие силы природы узрели это и призвали самого просвещённого друида к себе. Мудрый старец Силла, судья и провидец клана, выступил из рядов своих соплеменников и получил дар, а вместе с ним наставление: «Когда весь мир угаснет, когда цивилизация покинет эти земли, когда мир будет повержен и испещрён бесграничными пустынями конца времён, посади Семя». Преисполнившись верой, Силла почувствовал, как вес лет на его плечах стал легче, а жизненные силы вернулись в тело. В разум его впиталось непомерное знание. Он стал способен воплощать свою волю в материи и менять свобственную физическую форму усилием воли. Но злые языки и податливые уши донесли весть о Семени и его мощи до других людей, и те обрушились страшной войной на Клан Медведя. Шли годы... Легенды и даже само время позабыли про Клан Медведя, позабыли про Силлу и Семя, позабыли великие цивилизации, расцветшие и сгинувшие после Клана. Тысячи лет Силла ждал: ждал весточки от своих божеств, ждал мира в неизменно воинствующих землях, ждал в отшельничестве и в тайне ото всех, ждал конца сущего и завершения своей священной миссии, всегда готовый уничтожить то, что помешало бы свершить посев.","talentsTips":["Бонус к дальности атаки действует только на дальние атаки Lone Druid. Дальность атаки в состоянии True Form не увеличивается.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Оригинальное имя героя - \"Syllabear\", игра слов от Syl-lab-le, что является отсылкой к одному разработчику, который работал вместе с Guinsoo. Перед уходом, он создал данного героя, и его имя было сокращено до \"Sylla\".","Lone Druid как и Invoker живёт на протяжении столетий . После убийства Invoker он может обронить фразу \"Invoker, you are naught but an ignorant child.\" (Invoker, ты непослушный и необразованный ребёнок)","Из реплик Lone Druid , можно услышать что клан Медведя имеет давние отношения с кланом Дракона (кланом Dragon Knight)","Lone Druid потерял палец по вине Ursa, когда тот был детенышем. Это можно понять по реплике после убийства Ursa \"A pity. Where was the Ulfsaar that took my finger?\" (Видимо речь идёт о пальце на ноге, так как у модели персонажа на руках все пальцы на месте.)","Lone Druid, while on True Form, used to have a second sub-ability called One, it equally distributes the damage taken by Sylla and the Spirit Bear, allowing them to endure more damage and live longer."],"talents":["Battle Cry даёт невосприимчивость к магии:-0,5 к задержке перед атакой Spirit Bear","Entangling Claws без перезарядки:-25 сек. перезарядки Battle Cry","+10 к броне медведя от Spirit Bear:-12 сек. перезарядки Savage Roar","+125 к дальности атаки:+250 к здоровью"],"tips":["Так как у медведя большое количество здоровья, он может выступать в качестве \"танка\" во время атаки нейтральных крипов, башен или Рошана."],"desc":"%"}