{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Radius: 1200",
        "Hero Lifesteal: 20%",
        "Creep Lifesteal: 10%",
        "Mana Regeneration Bonus: 1.75",
        "Attack Damage Bonus: 18%",
        "Armor Bonus: 3",
        "Aura Linger Duration: 0.5"
      ],
      "notes": [
        "Multiple instances of Vladmir's Aura do not stack. This includes the auras of Helm of the Overlord and Wraith Pact. Fully stacks with other sources of Buckler-based items' armor aura and Ring of Basilius-based items' mana regeneration aura.",
        "Fully stacks with other sources of Buckler-based items' armor aura and Ring of Basilius-based items' mana regeneration aura.",
        "Stacks additively with other sources of lifesteal.",
        "Cannot lifesteal off of wards, buildings and allied units.",
        "Grants flat bonus attack damage based on the affected unit's main attack damage. Does not further increase bonus attack damage.",
        "Can regenerate up to 105 mana in one minute.",
        "Affects invulnerable, but not hidden units.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "abilityName": "Vladmir's Aura",
      "cooldown": null,
      "description": "Grants 20% lifesteal, 18% bonus damage, 1.75 mana regeneration, and 3 armor to nearby allies. Lifesteal from creeps is reduced by 50%",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "All of the bonuses from Vladmir's Offering is provided by Vladmir's Aura."
  ],
  "cost": "2450",
  "lore": null,
  "consistFrom": [
    "Buckler",
    "Ring of Basilius",
    "Morbid Mask",
    "Blades of Attack",
    "Recipe"
  ],
  "name": "Vladmir's Offering",
  "description": "An eerie mask that is haunted with the malice of a fallen vampire.",
  "trivia": [
    "The item's name and theme is a reference to Vlad Dracul III and his fictionalized version, Dracula."
  ],
  "upgradeIn": [
    "Wraith Pact",
    "Helm of the Overlord"
  ],
  "tips": [
    "Vladmir's Offering is normally picked up in the early-mid game. Its wide variety of bonuses and useful components makes it an attractive choice for melee heroes.",
    "In the lategame a support should pick it up for the lifesteal and damage auras, as the item slot is usually not worth it on core heroes, who need bigger items.",
    "Vladmir's Offering assists with pushing due to conferring damage and lifesteal to nearby creeps, making them withstand enemy attacks longer, with increased dps.",
    "Since Vladmir's Aura can't be toggled off, its status buff icon is always visible on creeps. Therefore it is possible to detect invisible enemy heroes holding Vladmir's Offering by checking enemy creeps' status buff icons."
  ]
}