{"abilities":[{"spell":"Repeatedly strikes the targeted unit with lightning. Each strike damages nearby enemy units in a small radius. Provides vision of its target.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["When the target avoids the damage by turning invulnerable or hidden, it still deals damage around it.","Provides shared vision over the target.","Strikes the target in 2 second intervals, starting immediately as the debuff is placed, resulting in 4 ( 8) strikes.","Can deal up to 180\/280\/380\/480 damage to a single unit (before reductions). Can deal up to 340\/440\/540\/640 damage when the damage increasing talent is chosen. Can deal up to 360\/560\/760\/960 damage when the number of strikes increasing talent is chosen. Can deal up to 680\/880\/1080\/1280 damage when both talents are chosen.","The debuff persists through death. If the target dies, it continues to apply damage at its death location.","Provides 450 range flying vision for 3.34 seconds at the target's last location when the debuff expires or is removed.","Successive casts on the same unit do not stack, but only refresh the duration.","Choosing the damage upgrading talent immediately upgrades all of Disruptor's currently active Thunder Strike instances.","Choosing the strikes\/duration increasing talent does not update currently active instances."],"mana":"130","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"18\/15\/12\/9","name":"Thunder Strike","description":["Cast Animation: 0.05+0","Cast Range: 800 ( 950)","Damage Radius: 240","Number of Strikes: 4 ( 8)","Damage per Strike: 45\/70\/95\/120 ( 85\/110\/135\/160)","Duration: 6 ( 14)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Teleports the target hero back to where it was 4 seconds ago. Instantly kills illusions.","effects":["Ability Target Unit","Affects Enemy Heroes"],"notes":["Glimpse does not instantly move the target back. A projectile spawns from the target which travels towards the mark. The projectile travels at a speed of 600, or reaches the mark in 1.8 seconds, whichever is faster.","The location at which the target lands after Glimpse is marked with a blue visual effect which is visible to everyone.","The projectile provides 400 range flying vision while traveling, which lingers for 3.34 seconds at the marked location.","Does not move spell immune units, but can move invulnerable and hidden units. Following the general rule of position changing effects, it can cancel e.g. Time Walk or Ball Lightning. While Doppelganger, Sleight of Fist and Activate Fire Remnant reposition the caster, they cannot be interrupted, so it can be dodged with those spells. Can also be dodged with Phantasm, Mirror Image, Manta Style, Snowball, Omnislash, Primal Split, Infest, Assimilate and Supernova.","The target is given a stop command as soon as it is moved back, effectively canceling channeling spells. However, the queued following commands are not canceled.","Does not disjoint projectiles for the target upon teleporting them.","Cannot target creep-heroes."],"mana":"100","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"60\/46\/32\/18 ( 50\/36\/22\/8)","name":"Glimpse","description":["Cast Animation: 0.05+0.83","Cast Range: 600\/1000\/1400\/1800 ( 750\/1150\/1550\/1950)","Backtracked Time: 4"],"hot_key":"W","legacy_key":"D"},{"spell":"After a short formation time, creates a circular barrier of kinetic energy that enemies can't pass.","effects":["Ability Target Area","Affects Enemies"],"notes":["The effect delay is not included in the field's duration. The actual duration starts right after the delay.","The visual and sound effects during the effect delay are visible and audible to everyone.","Stops enemies by slowing them with a slow aura. The aura has a radius of 408 and is centered on the field. The slow gets exponentially stronger towards the visible barrier, which has a 340 radius. This effectively causes enemy units touching the barrier to come to halt. The slow is only present when facing towards the barrier. Units at the barrier facing away from it are not slowed. The aura's effect lingers for 0.5 seconds, resulting in an effective duration of 3.1\/3.7\/4.3\/4.9 ( 7.1\/7.7\/8.3\/8.9) seconds. Since the slow is fluctuating a lot, it is not displayed in the HUD.","Besides preventing enemies from walking in or out of the area, the following movement spells are unable to pass the barrier either: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Sun Ray, God's Rebuke, Force Staff, and Hurricane Pike.","Provides 340 range ground vision at the center of the area for 5.5 seconds upon cast."],"mana":"70","elements":["Does not pierce spell immunity."],"cooldown":"19\/16\/13\/10 ( 15\/12\/9\/6)","name":"Kinetic Field","description":["Cast Animation: 0.05+0","Cast Range: 900 ( 1050)","Field Radius: 340","Effect Delay: 1.2","Aura Linger Duration: 0.5","Duration: 2.6\/3.2\/3.8\/4.4 ( 6.6\/7.2\/7.8\/8.4)"],"hot_key":"E","legacy_key":"E"},{"spell":"Creates a damaging static storm that also silences all enemy units in the area for the duration. The damage starts off weak, but increases in power over the duration.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The silence ( and mute) is provided by an aura, its effects do not linger.","Silences ( and mutes) invulnerable units, but not hidden units.","Deals a total of 20 ( 28) damage instances over 5 ( 7), resulting in 0.25-second instances.","The damage on each instance is determined by the given max damage per second, divided by max instance, then multiplied by the current instance count.","This is how much damage each interval deals (before reductions) on each level: Level 1: 2.5\/5\/7.5\/10\/12.5\/15\/17.5\/20\/22.5\/25\/27.5\/30\/32.5\/35\/37.5\/40\/42.5\/45\/47.5\/50 ( \/52.5\/55\/57.5\/60\/62.5\/65\/67.5\/70) damage Level 2: 3.1\/6.3\/9.4\/12.5\/15.6\/18.8\/21.9\/25\/28.1\/31.3\/34.4\/37.5\/40.6\/43.8\/46.9\/50\/53.1\/56.3\/59.4\/62.5 ( \/65.6\/68.8\/71.9\/75\/78.1\/81.3\/84.4\/87.5) damage Level 3: 3.8\/7.5\/11.3\/15\/18.8\/22.5\/26.3\/30\/33.8\/37.5\/41.3\/45\/48.8\/52.5\/56.3\/60\/63.8\/67.5\/71.3\/75 ( \/78.8\/82.5\/86.3\/90\/93.8\/97.5\/101.3\/105) damage","Can deal up to 525\/656.25\/787.5 ( 1015\/1268.75\/1522.5) damage to a single unit (before reductions).","Provides 450 range flying vision at the center of the area for 5 ( 7) seconds."],"mana":"125\/175\/225","elements":["Does not pierce spell immunity."],"cooldown":"90\/80\/70","name":"Static Storm","description":["Cast Animation: 0.05+0","Cast Range: 800 ( 950)","Storm Radius: 450","Number of Pulses: 20 ( 28)","Maximum Damage per Second: 200\/250\/300","Aura Linger Duration: 0","Duration: 5 ( 7)"],"hot_key":"R","legacy_key":"R"}],"bio":"High on the wind-ravaged steppes of Druud, a gifted young stormcrafter called Disruptor was the first to unlock the secrets of the summer squalls. Constantly under assault from both seasonal storms and encroachment from civilized kingdoms to the South, the upland Oglodi have for centuries struggled to subsist atop the endless tablelands. They are the fractured remnant of a once-great civilization—a fallen tribe, their stormcraft strange and inscrutable, cobbled together from scraps of lost knowledge which even they no longer fully understand. For those on the high plain, weather has become a kind of religion, worshiped as both the giver and taker of life. But the electrical storms that bring life-sustaining rains arrive at a cost, and many are the charred and smoking corpses left in their wake. Although small for his kind, Disruptor is fearless, and driven by an insatiable curiosity. As a youth, while still unblooded and without a stryder, he explored the ruins of the ancestral cities—searching through collapsed and long-moldering libraries, rummaging through rusting manufactories. He took what he needed and returned to his tribe. Adapting a coil of ancient design, he harnessed the power of electrical differential and now calls down the thunder whenever he wishes. Part magic, part craftsmanship, his coils hold in their glowing plates the power of life and death—a power wielded with precision against the landed castes to the South, and any interlopers who cross into ancient Oglodi lands.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","Gold granted from the talent is unreliable gold."],"trivia":["When first released in DotA his hero title was actually \"Far Seer\" which is a hero title belonging to the Orc faction in Warcraft III. His title was changed to Disruptor, since the Far Seer title did not fit him.","In DotA, his name and title is Thrall, the Disruptor. Thrall is best known as the former warchief of the Orcish Horde in the Warcraft universe. His name and title got changed to Disruptor, the Stormcrafter for copyright reasons.","Disruptor's lore reveals that his race is called the Oglodi, while his voicelines confirm that Axe and Warlock are of the same race as he is.","His kill response \"You've been disrupted.\" is a reference to the famous AC-DC song \"Thunderstruck\".","His last hitting response \"So it goes.\" is a reference to a famous quote by Kurt Vonnegut in his book Slaughterhouse-Five, and is meant as a response for when death occurs.","In Disruptors Splash art you can see the silhouette of Nyx Assassin in the background."],"talents":["+4s Kinetic Field Duration:-10s Glimpse Cooldown","+4 Thunder Strike Hits:+180 Gold\/Min","-4s Kinetic Field Cooldown:+150 Cast Range","+40 Thunder Strike Damage:+200 Health"],"desc":"Disruptor, the Stormcrafter, is a ranged intelligence hero who requires good positioning to use his abilities effectively. His signature ability is Kinetic Field, a pseudo-disable that traps enemies within a small area for a long duration. Combined with his Static Storm, Disruptor can act as the initiator for a teamfight, or supplement his teammates' initiation very well. Glimpse is another powerful spell that forces enemies to watch their movements, as Disruptor can easily drag them back to a previous location to be focused down. Thunder Strike provides Disruptor with some reliable single-target damage, but more importantly grants vision on the target to prevent jukes and escapes."}