{"abilities":[{"spell":"Несколько раз бьёт молнией указанное существо. Каждый удар наносит урон жертве и врагам рядом с ней. Раскрывает местоположение цели.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Когда цель избегает урона, становясь неуязвимой или прячась, урон продолжает наносится вокруг неё.","Дает общий обзор на цель.","Бьет по цели с интервалом в 2 секунды сразу после размещения дебаффа, срабатывая 4 ( 8) раз.","Может нанести до 180\/280\/380\/480 единиц урона в одиночную цель (до учета сопротивления). Может нанести до 340\/440\/540\/640 единиц урона при выборе таланта на увеличение продолжительности действия. Может нанести до 360\/560\/760\/960 единиц урона при выборе таланта на дополнительное количество ударов. Может нанести до 680\/880\/1080\/1280 единиц урона при выборе двух талантов.","Дебафф остается после смерти. Если цель умерла, способность продолжает наносить урон по месту её смерти.","Дает летающий обзор в радиусе 400 единиц на 3,34 секунды на последнем месте, где была цель, если дебафф закончился или его убрали.","Несколько применений способности на одного юнита не складываются, но обновляют время действия."],"mana":"130","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"18\/15\/12\/9","name":"Thunder Strike","description":["Анимация применения: 0,05+0","Дальность применения: 800 ( 950)","Радиус: 240","Количество ударов: 4 ( 8)","Урона за удар: 45\/70\/95\/120 ( 85\/110\/135\/160)","Длительность: 6 ( 14)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Возвращает выбранного героя туда, где он был 4 секунды назад. Мгновенно убивает иллюзии.","effects":["Способность Направленная на юнита","Действует на Вражеских героев"],"notes":["Glimpse не сразу возвращает цель обратно. Снаряд появляется от цели и движется в направлении отметки. Снаряд движется со скоростью 600 или достигает отметки за 1,8 секунды в зависимости от того, что произойдет раньше.","Место, куда цель вернется после применения Glimpse, отмечается голубым визуальным эффектом, видимым для всех.","Снаряд при полете дает летающий обзор в 300 единиц, который сохраняется на 3,34 секунды в месте отметки.","Не может возвращать юнитов с иммунитетом к заклинаниям, но может это делать с неуязвимыми и спрятанными юнитами. Следуя основным правилам эффектов, меняющих позицию, способность можно отменить, к примеру, с помощью Time Walk или Ball Lightning. Пока Doppelganger, Sleight of Fist и Activate Fire Remnant меняют позицию применившего, способности нельзя прервать, поэтому с их помощью можно избегать Glimpse. Также можно избежать Glimpse с помощью Phantasm, Mirror Image, Manta Style, Snowball, Primal Split, Infest, Assimilate и Supernova.","Цель получает команду \"стоп\" как только возвращается обратно, таким образом можно отменять произносимые способности. Но очередь команд не отменяется.","Не может выбрать в качестве цели крипов-героев."],"mana":"100","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"60\/46\/32\/18 ( 50\/36\/22\/8)","name":"Glimpse","description":["Анимация применения: 0,05+0,83","Дальность применения: 600\/1000\/1400\/1800 ( 750\/1150\/1550\/1950)","Время возврата: 4"],"hot_key":"W","legacy_key":"D"},{"spell":"С небольшой задержкой создаёт круговой барьер из кинетической энергии, через который не могут проходить противники.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Задержка создания не включена в длительность барьера. Сама длительность начинается сразу после задержки.","Визуальные и звуковые эффекты во время задержки создания барьера видны и слышны всем.","Останавливает врагов замедлением при помощи ауры замедления. Аура работает в радиусе 408 единиц, исходящим из центра поля. Замедление усиливается в геометрической прогрессии до видимого барьера, который имеет радиус 340 единиц. Эта возможность означает то, что вражеские юниты, прикоснувшись к барьеру, остановятся. Замедление работает только в случае столкновения с барьером. Юниты внутри барьера, отвернувшись от него, замедление не получают. Эффект от ауры задерживается на 0.5 секунды, действуя 3.1\/3.7\/4.3\/4.9 ( 7.1\/7.7\/8.3\/8.9) секунд. Поскольку замедление быстро меняет свое значение, оно не отображается в интерфейсе статус-бара.","Способность не дает только выходить или входить в область действия. На принудительное движение нет ограничения, так что юнитов можно с его помощью перемещать в или из области.","Юнитов, затронутых Kinetic Field, нельзя толкать с помощью Force Staff или Hurricane Pike. Это относится к вражеским юнитам, на которых работает аура замедления поля, вне зависимости от того, внутри они или снаружи. При этом враг, не затронутый барьером, может протолкнутся свозь него. Поскольку на магически неуязвимых юнитов эффект не работает, то применение на себя Force Staff или Hurricane Pike для них возможно.","Дает наземный обзор в 325 единиц в центре области на время задержки и на всю длительность поля."],"mana":"70","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"19\/16\/13\/10 ( 16\/13\/10\/7)","name":"Kinetic Field","description":["Анимация применения: 0,05+0","Дальность применения: 900 ( 1050)","Радиус: 340","Задержка создания: 1.2","Длительность задержки ауры: 0.5","Длительность: 2.6\/3.2\/3.8\/4.4 ( 6.6\/7.2\/7.8\/8.4)"],"hot_key":"E","legacy_key":"E"},{"spell":"Создаёт статический шторм, наносящий урон и запрещающий применять способности всем вражеским существам в указанной области. Урон увеличивается со временем действия способности.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Безмолвие действует как аура, действующая до конца шторма.","Обезмолвливает ( и заглушает) неуязвимых юнитов, но не работает на спрятанных юнитов.","Наносит урон с интервалами в 0,25 секунды спустя 0,25 секунды после применения, срабатывая 20 ( 28) раз.","Здесь показано, сколько урона можно нанести с каждым интервалом (до учета сопротивления) на каждом уровне способности: Уровень 1: 2\/5\/7\/10\/12\/15\/17\/20\/22\/25\/27\/30\/32\/35\/37\/40\/42\/45\/47\/50 ( \/52\/55\/57\/60\/62\/65\/67\/70) единиц урона Уровень 2: 3\/6\/9\/12\/15\/18\/21\/25\/28\/31\/34\/37\/40\/43\/46\/50\/53\/56\/59\/62 ( \/65\/68\/71\/75\/78\/81\/84\/87) единиц урона Уровень 3: 3\/7\/11\/15\/18\/22\/26\/30\/33\/37\/41\/45\/48\/52\/56\/60\/63\/67\/71\/75 ( \/78\/82\/86\/90\/93\/97\/101\/105) единиц урона","Может нанести до 520\/648\/780 ( 1008\/1257\/1512) единиц урона в одного юнита (до учета сопротивления)."],"mana":"125\/175\/225","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"90\/80\/70","name":"Static Storm","description":["Анимация применения: 0,05+0","Дальность применения: 800 ( 950)","Радиус шторма: 450","Максимально урона в секунду: 200\/250\/300 ( 280\/350\/420)","Длительность: 5 ( 7)"],"hot_key":"R","legacy_key":"R"}],"bio":"Высоко в нагорьях обветренных степей Друуда один юный одарённый грозодел первым раскрыл секреты летних дождей. Постоянно страдая от сезонных бурь и от набегов цивилизованных королевств с юга, горный народ Оглоди веками выживал на бесконечных плато. Они — слабый отголосок некогда великой цивилизации, падшее племя; их искусство управления погодой сакрально и непостижимо, собрано из крупиц потерянного знания, и даже сами Оглоди не до конца понимают его природу. Для них, жителей высотных степей, погода подобна религии, которая как давала жизнь, так и могла забрать её в любой момент. Грозовые бури приносили животворящий дождь, но забирали жизни, оставляя за собой обугленные дымящиеся трупы. Хоть и невысокий для своего народа, наш герой был бесстрашен и одержим жаждой знаний. Ещё не пролившим своей первой крови и не имеющим собственного скакуна юнцом он изучал руины древних городов, исследовал разрушенные замшелые библиотеки и заржавевшие мастерские. Там он нашел то, что искал, и возвратился к племени. Разобравшись в устройстве древней катушки, он обрёл власть над разностью потенциалов и теперь способен создавать бури по собственному желанию. Отчасти магические, отчасти механические, его катушки содержат в своих пластинах силу жизни и смерти — силу, способную дать отпор низкогорным южным кастам и любому, кто осмелится нарушить границы древних земель Оглоди.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Золото с таланта является ненадёжным."],"trivia":["Оригинальное имя героя — Тралл, что является отсылкой к герою из вселенной Warcraft.","Axe, Disruptor и Warlock произошли из одного племени – Оглоди.","Судя по его репликам, имя его питомца - Стригор."],"talents":["+4 сек. к продолжительности Kinetic Field:-10 сек. перезарядки Glimpse","+4 удара у Thunder Strike:+180 золота в минуту","-3 сек. перезарядки Kinetic Field:+150 к дальности способностей","+40 к урону от Thunder Strike:+200 к здоровью"],"desc":"Disruptor — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Герой обладает обездвиживающими способностями, действующими по области. Способность Thunder Strike позволяет герою ударить противника молнией несколько раз. Glimpse — возвращает героя на место, где он был 4 секунды назад, вернув его, если тот убегает. С помощью способности Kinetic Field герой создает кольцевой барьер, который не позволяет противникам уйти из него. Главной способностью Static Storm, герой вызывает статический шторм. Враги, попавшие в него, не смогут использовать свои способности и будут получать урон."}