{
  "abilities": [
    {
      "effects": [
        "Default Cast Range: 350",
        "Buffer Cast Range: 600",
        "Max Number of Charges: 3",
        "Health Regeneration Bonus: 50",
        "Mana Regeneration Bonus: 30",
        "Duration: 2.5"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "Has no effect when used while having no charges left, only the cooldown gets triggered.",
        "Successive casts on the same target do not stack, but refresh the duration instead.",
        "When casting without the Control key, it always casts on self in one click. When holding the Control key, a target has to be selected.",
        "If the target is more than 600 range away, the caster moves to the target until it is within 350 range before casting. If a cast order is given on a target which is within 600 range already, the caster does not need to move closer and casts it right away.",
        "Can only target heroes (including illusions) and creep-heroes.",
        "Couriers can cast Regenerate, putting the item on its cooldown, but not regenerating the target or wasting a charge.",
        "The owner does not have to face the target to give it a Bottle charge.",
        "Can regenerate up to 125 health and 75 mana over its full duration.",
        "All 3 charges together can regenerate up to 375 health and 225 mana.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan dispels the effect. Does not get dispelled by damage flagged as HP Removal."
      ],
      "elements": [
        "Ability N\/A",
        "Affects Self \/ Allied Heroes"
      ],
      "name": "Regenerate",
      "description": "Consumes a charge to restore 125 health and 75 mana over 2.5 seconds. If the hero is attacked by an enemy hero, tower, or Roshan, the effect is lost. The Bottle automatically refills at the fountain. Hold Control to use on an allied hero."
    },
    {
      "effects": [
        "Cast Range: 100",
        "Max Rune Store Duration: 120"
      ],
      "notes": [
        "While having a Bottle, right-clicking a rune stores it in the bottle, instead of activating it. Runes cannot be stored when the bottle is in the backpack. When the Bottle gets moved from the backpack into the main inventory, it is immediately able to store runes. The Bottle does not need to be empty to store runes. A full Bottle can be used to store runes just as well as an empty or half full one.",
        "A rune stays stored for up to 2 minutes, at which point it gets automatically used. This automatic usage does not interrupt the owner in any way, and does not break invisibility. While having a rune stored, the Regenerate ability activates the rune, instead of regenerating the user. Unlike the automatically activated rune, manually activating it does interrupt the caster and does break invisibility, using Regenerate's behavior. Activating the rune (be it manually or automatically) refills the Bottle to 3 charges. If the owner is dead as 2 minutes pass, the rune disappears without applying its effects, but the Bottle gets refilled normally.",
        "Only heroes and Spirit Bear can store runes. Illusions, clones and couriers cannot.",
        "Only one rune can be stored in a Bottle at a time. Attempting to store another rune into it just directly uses the new targeted rune. However, it is possible to have multiple Bottles in the inventory and store a rune with each of them."
      ],
      "elements": [
        "Ability Passive",
        "Affects Self"
      ],
      "name": "Store Rune",
      "description": "Runes can be stored in the bottle for later use by right-clicking them. Unused runes will automatically activate after 2 minutes. Using a stored rune fully refills the Bottle."
    }
  ],
  "cost": "650",
  "description": "",
  "trivia": [
    "Prior to the February 01, 2018 Patch, Bottle's passive ability, Store Rune, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."
  ],
  "tips": [
    "The Bottle can be used as a quick healing item that can be easily replenished, or to save up a rune for later use. Though it costs significantly more than other consumables, the Bottle does not have limited uses, as it can be refilled at the fountain at any time.",
    "Bottles refill automatically whenever they are in the inventory of a unit which is affected by the team fountain's Rejuvenation Aura. The aura's buff lingers for three seconds, so for a brief time after leaving the fountain, Bottles are still refilled. Use the Bottle repeatedly at the fountain to regenerate faster.",
    "Upon activating an Invisibility Rune, Bottle can be used within the 2 seconds fade time of the invisibility without breaking it, allowing the player to heal up while going invisible."
  ],
  "attrs": [
    "Active Regenerate",
    "Charges 3",
    "Passive Store Rune",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "Bottles are fully sharable. However, a Bottle which currently contains a rune cannot be shared, dropped or moved into the backpack.",
    "The Bottle does not disappear upon using up all charges.",
    "Bottles are automatically replenished when the carrier is affected by the Fountain's Rejuvenation Aura."
  ]
}