{"abilities":[{"effects":["Базовая дальность применения: 350","Дальность применения баффа: 600","Макс. число зарядов: 3","Бонус к регенерации здоровья: 50","Бонус к регенерации маны: 30","Длительность: 2.5"],"notes":["Лечение прерывается, если вы получили урон.","Изначально в Bottle 3 заряда. Когда Bottle используют, она становится заполненной на 2\/3, потом на 1\/3, и в конце концов становится пуста.","Link▶️ Нажав на руны вы помещаете ее в Bottle. Использование Bottle активирует руну.","Пока в Bottle находится руна ее нельзя выкинуть, также нельзя использовать регенерацию здоровья и маны, не активировав руну.","Использование руны полностью наполнит Bottle.","Герой, покинувший фонтан, несколько секунд находится все еще под его действием, у него продолжает восстанавливаться здоровье и мана и он может пополнить пустую\/полупустую бутылку в своем инвентаре. Так например, в течении 2 сек. после телепорта с фонтана, можно использовать заклинания и хлебнуть разок из бутылки для восстановления маны, банка при этом останется полной. Так же можно, сразу после телепорта с фонтана, подобрать или взять у союзника пустую его бутылку, она тут же наполнится, после чего ее можно вернуть.","Если перед использованием бутылки, выложить из инвентаря вещи добавляющие здоровье и ману и подобрать их после окончания регенерации, то количество полученного здоровья\/маны будет заметно больше."],"elements":["Способность Н\/Д","Действует на Себя \/ Союзных героев"],"name":"Regenerate","description":"Тратит один заряд, чтобы постепенно восстанавливать цели 125 здоровья и 75 маны на протяжении 2.5 сек. Восстановление прекращается при получении урона от вражеских героев или Рошана. Заряды можно восполнить возле союзного фонтана. Зажмите Ctrl, чтобы применить на союзника."},{"effects":["Дальность применения: 100","Длительность хранения руны: 120"],"elements":["Способность Пассивная","Действует на Себя"],"name":"Store Rune","description":"В бутыль можно поместить одну руну, чтобы воспользоваться ей позже. Помещённая в бутыль руна задействуется сама спустя 2 минуты. Руны усиления полностью наполняют бутыль, как и руны богатства."}],"cost":"650","description":"","attrs":["Активируемая Regenerate","Зарядов 3","Пассивная Store Rune","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Bottle можно передавать. При этом Bottle с руной нельзя передать, выкинуть или переместить в рюкзак.","Bottle не исчезает при использовании всех зарядов.","Bottle автоматически восстанавливается если носитель попал под воздействие Восстановление от фонтана."]}