{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Leshrac: 400 здоровья и 2 восстановления здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+30 к числу взрывов у Diabolic Edict",
          "talentRight": "Lightning Storm может отскочить дважды"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 к урону от Pulse Nova",
          "talentRight": "+20 к силе"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25 к скорости передвижения",
          "talentRight": "+100 к урону от Lightning Storm"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+40 к радиусу Split Earth",
          "talentRight": "+1,75 маны в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c9\/Leshrac_Split_Earth.mp3\/revision\/latest?cb=20191216015216",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Split Earth уничтожает деревья в области действия.",
        "Split Earth сначала применяет дебафф, затем наносит урон.",
        "Не выделяет задержку визуальным или звуковым индикатором.",
        "С Aghanim's Shard Split Earth применяет эффект в выбранной точке 4 раза. Первое срабатывание всё еще происходит спустя 0,35 сек. после применения. Следующие активируются спустя shard\/\/\/\/ сек. после применения. Визуальный эффект во время задержки между дополнительными срабатываниями виден всем. Радиус каждого срабатывания равен: Уровень 1: 150\/225\/300\/375 (TagTalent 190\/265\/340\/415) Уровень 2: 175\/250\/325\/400 (TagTalent 215\/290\/365\/440) Уровень 3: 200\/275\/350\/425 (TagTalent 240\/315\/390\/465) Уровень 4: 225\/300\/375\/450 (TagTalent 265\/340\/415\/490)",
        "Первое срабатывание всё еще происходит спустя 0,35 сек. после применения. Следующие активируются спустя shard\/\/\/\/ сек. после применения.",
        "Визуальный эффект во время задержки между дополнительными срабатываниями виден всем.",
        "Радиус каждого срабатывания равен: Уровень 1: 150\/225\/300\/375 (TagTalent 190\/265\/340\/415) Уровень 2: 175\/250\/325\/400 (TagTalent 215\/290\/365\/440) Уровень 3: 200\/275\/350\/425 (TagTalent 240\/315\/390\/465) Уровень 4: 225\/300\/375\/450 (TagTalent 265\/340\/415\/490)",
        "Уровень 1: 150\/225\/300\/375 (TagTalent 190\/265\/340\/415)",
        "Уровень 2: 175\/250\/325\/400 (TagTalent 215\/290\/365\/440)",
        "Уровень 3: 200\/275\/350\/425 (TagTalent 240\/315\/390\/465)",
        "Уровень 4: 225\/300\/375\/450 (TagTalent 265\/340\/415\/490)",
        ""
      ],
      "mana": "80\/100\/120\/140",
      "item_behaviour": [],
      "name": "Split Earth",
      "cooldown": "9",
      "description": "Раскалывает землю под врагами. Наносит урон и ненадолго оглушает.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,7+0,67",
        "Дальность применения: 650",
        "Радиус: 150\/175\/200\/225 (TagTalent 190\/215\/240\/265)",
        "Число срабатываний: 1 (TagTalent 4)",
        "Задержка: 0,35",
        "Урон: 120\/180\/240\/300",
        "Длительность оглушения: 2",
        "Увеличение радиуса за срабатывание: 75",
        "Интервал увеличения: 5",
        "Способность применяется в том же самом месте ещё 3 раза с промежутком в секунд. При каждом срабатывании радиус увеличивается на 75. Место повторного срабатывания видят обе команды."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Leshrac_Diabolic_Edict.mp3\/revision\/latest?cb=20191216015221",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Центр радиуса всегда закреплен за текущим месторасположением Leshrac, а не за местом применения.",
        "Случайно выбирает ближайших подходящих существ для каждого взрыва без какого-либо приоритета. Действует на невидимых существ и существ в тумане войны. Если поблизости нет подходящих целей, взрывы появляются случайным образом в квадрате со стороной в 500 единиц. Они не наносят урона.",
        "Действует на невидимых существ и существ в тумане войны.",
        "Если поблизости нет подходящих целей, взрывы появляются случайным образом в квадрате со стороной в 500 единиц. Они не наносят урона.",
        "Создает взрывы с интервалом в 0,25 (TagTalent 0,14) сек. сразу после применения, вызывая 40 (TagTalent 70) взрывов.",
        "Наносит до 280\/560\/840\/1120 (TagTalent 490\/980\/1470\/1960) урона одной цели.",
        "Взрывы продолжают появляться на месте смерти Leshrac.",
        "Повторные применения Diabolic Edict складываются."
      ],
      "mana": "95\/120\/135\/155",
      "item_behaviour": [],
      "name": "Diabolic Edict",
      "cooldown": "22",
      "description": "Окружает героя магическими взрывами, которые наносят чистый урон врагам и постройкам. Чем меньше рядом врагов, тем больше урона они получат. Действует секунд.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,5+0,87",
        "Радиус: 500",
        "Взрывов: 40 (TagTalent 70)",
        "Урон: 7\/14\/21\/28",
        "Длительность: 10"
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Leshrac_Lightning_Storm.mp3\/revision\/latest?cb=20191216015222",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Молния поражает начальную цель после задержки в 0,25 сек. и затем перескакивает между остальными существами с интервалом в 0,25 сек.; для поражения всех целей требуется 1\/1,5\/2\/2,5 (TagTalent 2\/3\/4\/5) сек.",
        "Поскольку у способности есть задержка применения, начальную молнию можно избежать с помощью иммунитета к заклинаниям, неуязвимости или исчезновения. При этом эти эффекты не предотвращают скачки молний.",
        "Не отскакивает от невидимых существ или существ в тумане войны.",
        "Не поражает дважды одну и ту же цель за применение. С талантом 25 уровня может поразить одну цель 2 раза. Однако не может ударить одно существо дважды, если рядом нет других существ. Повторно поражает существо только в том случае, если рядом не осталось других существ, которые не получили ни одного удара молнией.",
        "С талантом 25 уровня может поразить одну цель 2 раза.",
        "Однако не может ударить одно существо дважды, если рядом нет других существ.",
        "Повторно поражает существо только в том случае, если рядом не осталось других существ, которые не получили ни одного удара молнией.",
        "Все отскоки вместе наносят до 360\/780\/1360\/2100 (TagTalent 480\/960\/1600\/2400) урона (до уменьшений). С талантом на увеличение количества отскоков по одной цели все прыжки могут нанести до 720\/1560\/2720\/4200 (TagTalent 960\/1920\/3200\/4800) урона.",
        "С талантом на увеличение количества отскоков по одной цели все прыжки могут нанести до 720\/1560\/2720\/4200 (TagTalent 960\/1920\/3200\/4800) урона.",
        "Lightning Storm сначала наносит урон, затем применяет дебафф.",
        "Модификатор lightning storm - скрытый бафф, требующийся для отскакивания молний."
      ],
      "mana": "80\/100\/120\/140",
      "item_behaviour": [],
      "name": "Lightning Storm",
      "cooldown": "4",
      "description": "Призывает шквал молний, которые бьют и замедляют сначала выбранного противника, а затем и соседних с ним.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+1,04",
        "Дальность применения: 650",
        "Дальность скачков: 475",
        "Число скачков: 4\/6\/8\/10",
        "Задержка: 0,25",
        "Урон: 90\/130\/170\/210 (TagTalent 120\/160\/200\/240)",
        "Замедление передвижения: 75%",
        "Длительность замедления: 0,4\/0,6\/0,8\/1",
        "Число ударов по одной цели: 2",
        "Пытается нанести урон, если враг получил иммунитет к заклинаниям в момент задержки. Замедление остается, если дебафф был применен до иммунитета и не был развеян.",
        "Блокируется только начальной целью."
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/75\/Leshrac_Nihilism_1.mp3\/revision\/latest?cb=20210109164935",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "При применении прерывает произносимые заклинания Leshrac.",
        "Применяет к Leshrac и врагам в радиусе призрачную форму, обезоруживание, иммунитет к атакам и дает 100% сопротивление физическому урону.",
        "Уменьшает общее сопротивление магии большинства героев до 2,5%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления.",
        "Уменьшение сопротивления магии от Nihilism не складывается с остальными эффектами, дающими призрачную форму; приоритет за эффектом с наивысшим значением снижения.",
        "Призрачная форма на врагах предоставлена аурой; её дебафф задерживается на 0,5 сек.",
        "Несколько применений Nihilism не складываются."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Nihilism",
      "cooldown": "25",
      "description": "Придаёт врагам в радиусе 450 бесплотную форму, в которой они не могут атаковать, получают увеличенный на 30% магический урон и замедлены на 30%. Владелец способности ускоряется на такое же значение, но не получает дополнительный магический урон. Действует 4 сек.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 450",
        "Уменьшение сопротивления магии врагов: 30%",
        "Изменение скорости передвижения: 30%",
        "Длительность задержки ауры: 0,5",
        "Длительность: 4",
        "Можно применить во время действия иммунитета к заклинаниям. Но при обнаружении иммунитета бафф мгновенно исчезает. Не действует на врагов с иммунитетом.",
        ""
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Leshrac_Pulse_Nova.mp3\/revision\/latest?cb=20200509130123",
      "effects": [
        "Способность Переключаемая",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Переключение Вкл \/ Выкл Pulse Nova не прерывает произносимые заклинания Leshrac.",
        "Наносит урон с интервалом в 1 секунду сразу после переключения способности. Активация расходует 90 маны. При этом, если у героя при активации будет меньше чем 90 маны, то способность нанесет 1 единицу урона и самостоятельно отключится.",
        "Активация расходует 90 маны.",
        "При этом, если у героя при активации будет меньше чем 90 маны, то способность нанесет 1 единицу урона и самостоятельно отключится.",
        "Действует на невидимых существ и существ в тумане войны.",
        "Безмолвие или обезвреживание Leshrac не отключает Pulse Nova — как и состояние исчезновения."
      ],
      "mana": "70",
      "item_behaviour": [],
      "name": "Pulse Nova",
      "cooldown": "1",
      "description": "Создаёт вокруг героя волны энергии, которые раз в секунду наносят урон вражеским существам поблизости. Каждая волна расходует ману владельца.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 525",
        "Расход маны в секунду: 20\/40\/60",
        "Урон в секунду: 100\/150\/200 (TagTalent 140\/190\/240)",
        "Дарует новую способность: Nihilism."
      ],
      "legacy_key": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 20.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 2.8,
    "attrAgility": 23.0
  },
  "description": "Leshrac — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первая способность, Split Earth, раскалывает землю под врагами. Наносит урон и оглушает. Вторая способность, Diabolic Edict, окружает Leshrac магическими взрывами, которые наносят физический урон врагам и сооружениям. Башни получают больше урона. Чем меньше рядом врагов, тем больше урона они получат. Третья способность, Lightning Storm, Призывает грозовой разряд, ударяющий в выбранного противника и отскакивающий в соседних, замедляя их. Ультимативная способность, Pulse Nova, создает волну энергии вокруг Leshrac, которая раз в секунду наносит повреждения вражеским существам поблизости. Улучшение с Aghanim's Scepter позволяет способности Lightning Storm поражать случайного юнита в радиусе способности каждые 1,75 секунды.",
  "history": "Это существо, также известное как Истерзанная душа, вырвано из сердца самой природы; половина его живёт в одном мире, половина — в другом. Его пронзительный разум ни на мгновение не оставляет без внимания предсмертный кошмар всего сущего. Когда-то он был великим философом, искавшим суть бытия, и проник вглубь природы при помощи хроноптических кристаллов, но чудовищная истина навеки изменила его. Теперь самые тёмные глубины его просвещённого разума озаряются лишь порывами собственной гордости. Как и другие первичные существа, он един с природой, но природа его жутка и низменна. Он один видит всю страшную суть реальности, и презирает тех, кто верит, что космос притаил награду для добросердечных глупцов.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+30 к числу взрывов у Diabolic Edict",
      "talentRight": "Lightning Storm может отскочить дважды"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 к урону от Pulse Nova",
      "talentRight": "+20 к силе"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25 к скорости передвижения",
      "talentRight": "+100 к урону от Lightning Storm"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+40 к радиусу Split Earth",
      "talentRight": "+1,75 маны в секунду"
    }
  ]
}