{"abilities":[{"effects":["Радиус: 1200","Восстановление здоровья: 300","Восстановление маны: 200","Длительность ограничения повторного лечения: 39"],"notes":["При использовании прерывает произносимые заклинания.","При использовании применяет базовое развеивание на владельца, снимая большинство дебаффов.","После развеивания происходит лечение.","Затрагивает каждого союзного юнита, включая иллюзии, неуязвимых и спрятанных юнитов, исключая варды и строения.","Не лечит юнитов, на которых уже подействовал эффект Mend менее 39 секунд назад или Restore от Mekansm менее 65 секунд назад. В этот период юнитам все равно будет даваться мана. В панели эффектов можно посмотреть время окончания бафа для его повторной активации. Если у владельца есть Octarine Core, то длительность запрета равна 28 секундам вместо 39.","Клоны Meepo не могут использовать Mend."],"elements":["Способность Ненаправленная","Действует на Союзников"],"name":"Mend","description":"Восстанавливает 300 здоровья и 200 маны всем союзникам вокруг, а также снимает с владельца большинство отрицательных эффектов."},{"effects":["Радиус: 1200","Доп. регенерация здоровья: 3,5","Доп. броня: 2","Порог усиления бонуса: 20%","Усиление регенерации здоровья: 16","Усиление брони: 10","Длительность задержки ауры: 0,5"],"notes":["Сочетается с другими источниками брони и регенерации здоровья, за исключением Guardian Aura от нескольких Guardian Greaves.","Регенерирует до 210 (960 при усилении) здоровья в минуту.","Не действует на варды, строения и неуязвимых юнитов.","Усиление действует только на героев (включая иллюзии). Юниты не-герои получают только базовые бонусы.","Эффект ауры задерживается на 0,5 секунды."],"elements":["Способность Аура","Действует на Союзников"],"name":"Guardian Aura","description":"Действует на союзников вокруг. Увеличивает их восстановление здоровья на 3,5 и броню на 2. Если уровень здоровья союзного героя ниже 20%, то аура будет действовать на него сильнее, восстанавливая 16 здоровья в секунду и увеличивая броню на 10."}],"cost":"5475","description":"Один из множества священных инструментов, созданных во славу Всезнающего.","further":["Mekansm","Arcane_Boots","Рецепт"],"attrs":["Активируемая Mend","Пассивная Guardian Aura","Бонус +5 к силе +5 к ловкости +5 к интеллекту +5 к броне +250 к мане +17% к скорости передвижения","Можно разобрать? Нет","Можно сообщать? Да"],"info":["Для героев силы, одна пара Guardian Greaves даёт 100 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 5,8 брони, 5 скорости атаки, 17,25% скорости передвижения, 310 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки.","Для героев ловкости, одна пара Guardian Greaves даёт 100 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 5,8 брони, 5 скорости атаки, 17,25% скорости передвижения, 310 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки.","Для героев интеллекта, одна пара Guardian Greaves даёт 100 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 5,8 брони, 5 скорости атаки, 17,25% скорости передвижения, 310 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки. Вместе с аурой предмет дает Ошибка выражения: неопознанный символ пунктуации «,» (Ошибка Lua: Ошибка выражения: не ожидаемый оператор <. при усилении) регенерации здоровья и 7,8 (20,8 при усилении) брони владельцу.","Дополнительная скорость передвижения от нескольких пар сапогов не суммируется.","Складывается с другими бонусами скорости передвижения."]}