{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ee\/Ninja_Gear_Solitary_Disguise.mp3\/revision\/latest?cb=20191227195714",
      "effects": [
        "Радиус развеивания: 1025",
        "Время до невидимости: 0",
        "Доп. скорость передвижения: 20%",
        "Длительность: 35"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца и приказы действия, за исключением обычных приказов движения.",
        "Заклинатель может использовать заклинания и предметы без выхода из невидимости, но атаки её отменят.",
        "Невидимость теряется при завершении времени перед атакой, даже если атака промахнулась.",
        "Раскрытие невидимости не может обнаружить существ под действием Ninja Gear.",
        "Существ можно увидеть только если на них действует Chronosphere или их модели раскрыты способностями, такими как Thirst или Track. Для полного перечня способностей, дающих обзор на модели, смотрите статью Общий обзор. Даже если модели существ стали видны, то они все равно не отображаются на мини-карте.",
        "Для полного перечня способностей, дающих обзор на модели, смотрите статью Общий обзор.",
        "Даже если модели существ стали видны, то они все равно не отображаются на мини-карте.",
        "Существо под действием способности не даёт общий обзор на способности, только если модель существа не была раскрыта другой способностью дающей общий обзор, которая направлена на раскрытие модели существа.",
        "Действует только на самого заклинателя. Другие неуязвимые и сокрытые вражеские герои могут развеять её.",
        "Эффект развеивается только при приближении к вражеским героям (включая клонов Meepo, исключая других клонов и иллюзии), башням или фонтану. Эффект также развеивается при входе на возвышенность у фонтана вражеской команды.",
        "Эффект также развеивается при входе на возвышенность у фонтана вражеской команды."
      ],
      "mana": "0",
      "abilityName": "Solitary Disguise",
      "cooldown": "45",
      "description": "Применяет на владельца эффект предмета Smoke of Deceit.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Ninja Gear",
  "description": "Ценное обмундирование, найденное юным исследователем в обломках и развалинах, парящих в бесконечной пустоте.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}