{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Sand Storm замедляет и ослепляет жертв на 40%",
          "talentRight": "+4 к числу толчков у Epicenter"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 здоровья в секунду",
          "talentRight": "–2 сек. перезарядки Burrowstrike"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+8% к замедлению от Caustic Finale",
          "talentRight": "+30 к урону в секунду от Sand Storm"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+175 к здоровью",
          "talentRight": "+20 к урону толчка от Epicenter"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f0\/Sand_King_Burrowstrike.mp3\/revision\/latest?cb=20191216022824",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Шипы движутся со скоростью в 2000 (TagTalent 3000) единиц, достигая максимального расстояния за 0,2\/0,25\/0,3\/0,35 (TagTalent 0,27\/0,33\/0,4\/0,47) секунды.",
        "Sand King мгновенно передвигается к выбранной точке при достижении её шипами.",
        "Не позволяет избежать снаряды при применении или телепортации.",
        "Sand King обезврежен на всю остаточную анимацию Burrowstrike.",
        "При выборе в качестве цели существа Sand King преследует цель до достижения расстояния, равного дальности применения, и применяет Burrowstrike к нему напрямую. Шипы не попадают сразу же по цели, поэтому от них можно увернутся. Выбор существа лишь определяет направление шипов.",
        "Шипы не попадают сразу же по цели, поэтому от них можно увернутся. Выбор существа лишь определяет направление шипов.",
        "Задетые существа подбрасываются на 350 единиц на базовые 0,52 секунды оглушения.",
        "Пока пораженные существа находятся в воздухе, остальные могут под ними проходить.",
        "Урон наносится при приземлении, а не при поражении.",
        "Задевает существ на расстоянии до 550\/650\/750\/850 (TagTalent 950\/1150\/1350\/1550) единиц (складывается из максимального расстояния и радиуса).",
        "Закапывание и появление занимает 0,53 секунды с момента применения способности, в течение которой Sand King не может ничего сделать.",
        "Шипы не пройдут максимальное расстояние, если выбрать цель, находящуюся ближе.",
        "При улучшении Burrowstrike применяет ко всем пораженным героям Caustic Finale, но не применяет её на иллюзии. Считает крипов-героев за крипов."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "Q",
      "cooldown": "14\/13\/12\/11 (TagTalent 12\/11\/10\/9)",
      "description": "Герой погружается в землю и прорывается вперёд, оглушая врагов на пути и нанося им урон.",
      "spellName": "Burrowstrike",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 400\/500\/600\/700 (TagAghanim 800\/1000\/1200\/1400)",
        "Радиус: 150",
        "Урон: 100\/160\/220\/280",
        "Длительность оглушения: 1,6\/1,8\/2\/2,2",
        "Увеличивает дальность применения этой способности и применяет на всех задетых ею героев эффект Caustic Finale. Не действует на иллюзии.",
        "Пытается нанести урон, если уже задетые враги получили иммунитет к заклинаниям до приземления.",
        "Блокируется при попадании всеми владельцами по всей длине шипов."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Криксалис часто устраивает засады на неприятелей, выжидая их под песком."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Sand_King_Sand_Storm.mp3\/revision\/latest?cb=20191216022822",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "При применении Sand King мгновенно становится невидимым без задержки.",
        "Задержка используется, если герой вышел из невидимости при атаке или использовании заклинаний и предметов. Но, поскольку применение Sand Storm мгновенно применяет невидимость, то задержка также не используется при повторном использовании способности в активной области.",
        "Но, поскольку применение Sand Storm мгновенно применяет невидимость, то задержка также не используется при повторном использовании способности в активной области.",
        "Sand Storm наносит 10\/22,5\/35\/47,5 (TagTalent 25\/37,5\/50\/62,5) урона с интервалом в 0,5 секунды сразу после применения, нанося урон 40\/50\/60\/70 раз.",
        "Наносит до 400\/1125\/2100\/3325 (TagTalent 1000\/1875\/3000\/4375) урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность.",
        "Замедление скорости передвижения и ослепление, даваемые талантом, предоставляются в виде ауры. Дебафф задерживается на 0,5 секунды. Ослепление использует псевдослучайное распределение.",
        "Ослепление использует псевдослучайное распределение."
      ],
      "mana": "75",
      "hotKey": "W",
      "cooldown": "40\/34\/28\/22",
      "description": "Герой вызывает ужасающую песчаную бурю, которая делает его невидимым и наносит урон врагам. Эффект заканчивается, когда владелец способности выйдет из области действия.",
      "spellName": "Sand Storm",
      "params": [
        "Анимация применения: 0+0,5",
        "Радиус: 425\/500\/575\/650",
        "Задержка до невидимости: 0,7",
        "Урон в секунду: 20\/45\/70\/95 (TagTalent 50\/75\/100\/125)",
        "Шанс промаха: 0 (TagTalent 40%)",
        "Замедление скорости передвижения: 0 (TagTalent 40%)",
        "Длительность: 20\/25\/30\/35",
        "Длительность задержки ауры: 0,5",
        "Замедление и ослепление остаются, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Ходит слух, что Криксалис — это всего лишь мираж; его панцирь то появляется, то исчезает среди песчаных бурь Искрящейся пустыни."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Sand_King_Caustic_Finale.mp3\/revision\/latest?cb=20191216022819",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Урон по области нанесется только в случае, если существо под действием дебаффа умрет.",
        "Урон по области нанесется только в случае, если существо умерло из-за врагов. То есть существо не взорвется, если его добьют, оно исчезнет (например, призванное существо или иллюзия) или его убийство никому не приписано (например, от нескольких Meepo).",
        "То есть существо не взорвется, если его добьют, оно исчезнет (например, призванное существо или иллюзия) или его убийство никому не приписано (например, от нескольких Meepo).",
        "Если иллюзия под действием дебаффа умрет, в области нанесется только базовый урон, но не процентный.",
        "Успешные атаки по одной и той же цели не складываются, но обновляют длительность. При этом дебафф не обновляется: все его значения устанавливаются с первым применением.",
        "При этом дебафф не обновляется: все его значения устанавливаются с первым применением.",
        "Дебафф не применяется к союзникам, строениям и вардам."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Атаки героя наполняют тела жертв ядом, который замедляет их передвижение, а при смерти разрывает их плоть.",
      "spellName": "Caustic Finale",
      "params": [
        "Радиус взрыва: 500",
        "Базовый урон: 70\/90\/110\/130",
        "Урон от макс. здоровья: 10%\/14%\/18%\/22%",
        "Замедление скорости передвижения: 10%\/15%\/20%\/25% (TagTalent 18%\/23%\/28%\/33%)",
        "Длительность эффекта: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": "L",
      "story": "Атаки Криксалиса иссушают жертву, отчего её плоть разрывается на куски."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная \/ Произносимая",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При прерывании произнесения заклинание ничего не сделает, потратит ману и уйдет на перезарядку.",
        "При успешном произнесении толчки нельзя ничем прервать - даже смертью Sand King.",
        "Во время толчков Sand King может свободно действовать.",
        "Толчки исходят не от места применения заклинания, а от расположения самого героя.",
        "При смерти Sand King после завершения произнесения толчки не прекращаются.",
        "Толчки возникают с интервалом в 0,5\/0,375\/0,3 (TagTalent 0,3\/0,25\/0,21) секунд спустя 0,5\/0,375\/0,3 (TagTalent 0,3\/0,25\/0,21) секунды после завершения произнесения. То есть заклинанию нужно 3 секунды, чтобы все толчки после базовой задержки были выпущены.",
        "То есть заклинанию нужно 3 секунды, чтобы все толчки после базовой задержки были выпущены.",
        "Наносит до 660\/960\/1300 урона без выбранных талантов (до уменьшений). Наносит до 1100\/1440\/1820 при выборе таланта на дополнительное число толчков. Наносит до 780\/1120\/1500 при выборе таланта на дополнительный урон от толчка. Наносит до 1300\/1680\/2100 при выборе обоих талантов.",
        "Наносит до 1100\/1440\/1820 при выборе таланта на дополнительное число толчков.",
        "Наносит до 780\/1120\/1500 при выборе таланта на дополнительный урон от толчка.",
        "Наносит до 1300\/1680\/2100 при выборе обоих талантов.",
        "Замедление применяется к врагам с каждым толчком. Несколько источников замедления не складываются, но обновляют длительность. Замедление на существе длится до 6 секунд (складывается из длительности толчков и дебаффа).",
        "Замедление на существе длится до 6 секунд (складывается из длительности толчков и дебаффа).",
        "Каждый толчок сначала применяет дебафф, затем наносит урон.",
        "Несколько применений Epicenter складываются, создавая несвязанные друг с другом толчки."
      ],
      "mana": "150\/225\/300",
      "hotKey": "R",
      "cooldown": "120\/110\/100",
      "description": "После подготовки в 2 сек. герой неистово сотрясает землю вокруг себя. Землетрясение наносит урон противникам, замедляет их и увеличивается в радиусе с каждым последующим толчком.",
      "spellName": "Epicenter",
      "params": [
        "Анимация применения: 0+0",
        "Время подготовки: 2",
        "Радиус за толчок: 275\/325\/375\/425\/475\/525\/575\/625\/675\/725 (TagTalent \/775\/825\/875\/925)",
        "Число толчков: 6\/8\/10 (TagTalent 10\/12\/14)",
        "Урон за толчок: 110\/120\/130 (TagTalent 130\/140\/150)",
        "Замедление скорости передвижения: 30%",
        "Замедление скорости атаки: 30",
        "Длительность замедления: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Многие путешественники пропали в зыбучих песках Искрящейся пустыни."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 19.0
  },
  "description": "Sand King — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Burrowstrike, Sand King зарывается в землю и роет туннель вперед, оглушая врагов, находящихся над ним, и нанося им урон. Вторая способность, Sand Storm, позволяет герою закрыться в песчаной буре, становясь невидимым, при этом нанося периодический урон ближайшим целям. Пассивная способность, Caustic Finale, вводят в тело жертвы яд, который разорвет ее тело на части после смерти или по окончанию его действия, нанося урон и замедляя врагов в области рядом с жертвой. Ультимативная способность, Epicenter, посылает толчки в землю, заставляя ее содрогаться. Все враги, попавшие в радиус действия, получат урон и замедлятся. Каждый следующий толчок увеличивает радиус урона. Улучшается с Aghanim's Scepter.",
  "history": "Пески Искрящейся пустыни живы и разумны — эта необозримая пустошь ведёт разговор сама с собой, и думы её необъятны, как и границы. Но когда пустыне нужно обратиться к существам ограниченным, она высвобождает частичку себя и наполняет ею магический панцирь, сотворённый хитроумными калдинскими джиннами. Это создание зовёт себя Криксалис, что означает «Дух песка». Вдохновленный маленькими, но вездесущими обитателями Искрящейся пустыни, он принимает форму огромного скорпиона, и это настоящее отражение его беспощадной природы. Страж, воин, вестник — Криксалис неотделим от бескрайней пустыни, давшей ему жизнь.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Sand Storm замедляет и ослепляет жертв на 40%",
      "talentRight": "+4 к числу толчков у Epicenter"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 здоровья в секунду",
      "talentRight": "–2 сек. перезарядки Burrowstrike"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+8% к замедлению от Caustic Finale",
      "talentRight": "+30 к урону в секунду от Sand Storm"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+175 к здоровью",
      "talentRight": "+20 к урону толчка от Epicenter"
    }
  ]
}