{"abilities":[{"spell":"Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The spikes travel at a speed of 1600.","Hit units are knocked up 350 range for the initial 0.5 seconds of the stun.","While in the air, other units may pass below hit airborne units.","The damage is applied upon landing, not upon getting hit.","While Burrowed, the cast range and travel distance increase to 1225, and the cooldown decreases to 7 seconds.","Impale can hit units up to 825 ( 1350) range away (travel distance + radius).","When Impale hits invisible units, the visual effects below the hit unit are still visible."],"mana":"95\/115\/135\/155","elements":["Does not pierce spell immunity."],"cooldown":"14","name":"Impale","description":["Cast Animation: 0.4+0","Cast Range: 700","Spikes Travel Distance: 700","Spikes Radius: 125","Damage: 80\/140\/200\/260 ( 255\/315\/375\/435)","Stun Duration: 1.6\/2\/2.4\/2.8"],"hot_key":"Q","legacy_key":"E"},{"spell":"Destroys the target hero's mana equal to a multiplier of its Intelligence, and deals damage equal to the mana burned.","effects":["Ability Target Unit","Affects Enemy Heroes","Damage Magical"],"notes":["Applies the damage first, and then the mana loss.","Effectively burns 29%\/33%\/38%\/42% of the target's maximum mana pool if it has no flat mana bonus.","Despite dealing the damage first, the damage is based on how much mana the target actually lost from Mana Burn. This means, when cast on an enemy who has for example 5 mana left, it also deals only 5 damage (before reductions).","Can be cast on creep-heroes, but has no effect on them, since they have no intelligence, wasting mana and cooldown.","While Burrowed, the cast range increases to 1050."],"mana":"100","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"28\/20\/12\/4","name":"Mana Burn","description":["Cast Animation: 0.4+0","Cast Range: 600","Intelligence as Mana Burned: 350%\/400%\/450%\/500%","Mana Burned as Damage: 100%"],"hot_key":"W","legacy_key":"R"},{"spell":"When activated while above ground, Spiked Carapace reflects and negates damage dealt to Nyx Assassin (max once from each source), as well as stunning the source of the damage. Activating Spiked Carapace will not break Vendetta invisibility. While Burrowed, Spiked Carapace instantly stuns nearby enemies when cast.","effects":["Ability No Target","Affects Enemies"],"notes":["Spiked Carapace interrupts Nyx Assassin's channeling spells upon cast.","Can be cast during Vendetta, without breaking the invisibility. Breaks the invisibility of other sources.","Only reflects player based damage directly towards the damage dealer. A unit can only be affected once per buff.","The buff from multiple casts of Spiked Carapace does not stack but gets refreshed instead.","Reflects the same damage type as received.","Reflects incoming damage before all manipulations. However, damage manipulation on the enemy still affects the damage normally.","Reflected physical damage is affected by damage block as well.","Reflected damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.","Fully ignores self-inflicted damage, and damage flagged as HP Removal.","Spiked Carapace has a global range and affects units through the Fog of War or invisibility.","Reflected damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Spiked Carapace first applies the debuff, then the reflected damage.","Does not work against wards, buildings and allied units.","Spiked Carapace fully negates and reflects after all reductions, causing several on-damage effects to not trigger.","Has a higher priority than Aphotic Shield and Living Armor, but lower than False Promise. However, it still reflects and stuns when combined with False Promise.","Although the damage dealt to enemies is equal to the amount of damage blocked, the effects work independently from each other. This means Spiked Carapace always blocks one damage instance, even when the source is spell immune or invulnerable.","When cast while Burrowed, the spell immediately applies its stun to all enemies within a radius. Since Spiked Carapace has no base damage, hit units are not damaged upon cast. Nyx Assassin still receives the cast buff normally, which can still reflect damage and stun enemies. However, the buff does not affect enemy units which have been hit by the stun upon cast. They can normally damage Nyx."],"mana":"40","elements":["Does not pierce spell immunity."],"cooldown":"25\/20\/15\/10","name":"Spiked Carapace","description":["Cast Animation: 0+0","Burrow Stun Radius: 300","Damage Reflected: 100% ( 175%)","Carapace Duration: 2.25","Stun Duration: 0.6\/1.2\/1.8\/2.4"],"hot_key":"E","legacy_key":"D"},{"spell":"Allows Nyx Assassin to become invisible and gain a speed bonus. If Nyx Assassin attacks to break the invisibility, massive bonus damage is dealt with the attack. Applies a break status on the enemy for 4 seconds.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Physical"],"notes":["Vendetta does not interrupt Nyx Assassin's channeling spells upon cast.","The attack out of Vendetta cannot miss.","The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","The attack out of Vendetta first applies the Vendetta damage, then the debuff, then the attack damage.","The invisibility is broken upon reaching the cast point of spells or items, or upon landing an attack.","The damage and debuff are not applied when attacking wards or buildings.","Vendetta allows Nyx to pass through other units, including wards, but not through buildings.","Nyx can pick up, drop or attack items and runes without breaking the invisibility.","The level 25 talent allows Nyx Assassin to path freely through cliffs and trees, on top of the phased movement."],"mana":"140\/200\/260","elements":["Pierces spell immunity."],"cooldown":"70\/60\/50","name":"Vendetta","description":["Cast Animation: 0+0","Fade Time: 0","Damage: 250\/400\/550","Move Speed Bonus: 16%\/18%\/20%","Vendetta Duration: 40\/50\/60","Break Duration: 4"],"hot_key":"R","legacy_key":"V"},{"spell":"Nyx Assassin buries himself beneath the battlefield over a short duration. Once burrowed, Spiked Carapace instantly stuns nearby enemies when cast, the range of Mana Burn and Impale is increased, and Impale's cooldown is decreased. While burrowed, Nyx Assassin is stationary, unable to attack and invisible. His health and mana regeneration are also increased, and he gains damage reduction from all damage sources.","effects":["Ability No Target","Affects Self"],"notes":["Requires Aghanim's Scepter to be unlocked.","Turns Nyx Assassin invisible and disarms as well as roots him, preventing him from moving, attacking and using Blink Dagger.","Can regenerate up to 90% of Nyx Assassin's max health and max mana in one minute.","Can fully regenerate Nyx Assassin's health and mana within 66.67 seconds.","Burrow lasts until unburrowing or using Vendetta.","Nyx Assassin can still be moved by spells while burrowed, without getting unburrowed.","While burrowed, Impale and Mana Mana Burn can be cast without having to face the targeted point or unit, but other targeted spells and items still require facing.","Losing Aghanim's Scepter instantly unburrows Nyx."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Cannot be used by illusions.","Pierces spell immunity."],"cooldown":"0","name":"Burrow","description":["Cast Animation: 1.5+0.1","Fade Time: 0","Max Health\/Mana as Health\/Mana Regen Bonus: 1.5%","Incoming Damage Reduction: 40%","Impale Cast\/Travel Range Increase: 525","Impale Cooldown Reduction: 7","Mana Burn Cast Range Increase: 450","Spiked Carapace Radius: 300"],"hot_key":"D","legacy_key":"F"},{"spell":"Emerge from the burrow.","effects":["Ability No Target"],"notes":["Replaces Burrow until used or death.","Interrupts Nyx Assassin's channeling spells upon cast.","Instantly reverts all bonuses provided by Burrow.","Uses a different sound when unburrowing inside the river."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Unburrow","description":["Cast Animation: 0+0"],"hot_key":"D","legacy_key":"F"}],"bio":"Deep in the Archive of Ultimyr, shelved between scholarly treatises on dragon cladistics and books of untranslatable spells, there is an ancient tome of entomological curiosities. Compiled by scholars, the book describes the telepathic talents of the zealot scarab, a strange species of social insect with abilities unique to all the seven planes. Unlike most grubs of his colony, Nyx Assassin did not arise from metamorphosis with the plodding thoughts and blunted appendages common to the worker caste of his kind. For his was a special transformation, guided by the grace of Nyx. He was the chosen one, selected from the many and anointed with an extract of the queen goddess herself. Not all survive the dark blessing of the queen’s chamber, but he emerged with a penetrating mind, and dagger-like claws–his razor sharp mandibles raking the air while his thoughts projected directly into the minds of those around him. Of all zealot scarabs, he alone was selected for the highest calling. After his metamorphosis, he was reborn, by grace of Nyx, with abilities which shaped him for one thing and one thing only: to kill in the name of his goddess.","talentsTips":["Gold granted from the talent is unreliable gold.","The health talent increases maximum health capacity, and keeps the current health percentage.","The agility talent effectively grants Nyx Assassin 16 armor, 100 attack speed, 5% movement speed and 100 attack damage."],"trivia":["Nyx Assassin's original name was Anub'arak, and he was titled \"Nerubian Assassin\". Both were changed in the transition to Dota 2 due to copyright reasons. Anub'arak is a character of Blizzard's franchise \"Warcraft\", who first appeared in the campaign of Warcraft III: The Frozen Throne. He was the king of the Nerubians, a race of malevolent arachnids who were slain and raised as undead.","Nyx Assassin's fun name in DotA was Anoob'arak."],"talents":["Vendetta Unobstructed Pathing:+100 Agility","+175 Impale Damage:+75% Spiked Carapace Damage","+30 Movement Speed:+325 Health","+90 Gold\/Min:+8% Spell Amplification"],"desc":"Nyx Assassin 19 + 2.5 19 + 2.5 18 + 2.1 Level Base 1 15 25 Health 200 580 1280 1780 Health regen 3.25 5.15 8.65 11.15 Magic res. 25% 26.14% 28.24% 29.74% Mana 75 291 639 891 Mana regen 0 0.9 2.37 3.42 Spell dmg 0% 1.26% 3.32% 4.79% Armor 1 4.04 9.64 13.64 Att\/sec 0.59 0.7 0.91 1.05 Move sp amp. 0% 0.95% 2.7% 3.95% Damage 27‒31 46‒50 81‒85 106‒110 Movement speed 305 Turn rate 0.5 Vision range 1800\/800 Attack range 150 Projectile speed Instant Attack animation 0.46+0.54 Base attack time 1.7 Collision size 24 Legs 6  Gib type Goo"}