{"abilities":[{"spell":"Каменные шипы прорываются из земли перед вами. Враги будут подброшены в воздух, а затем оглушены и получат урон от падения.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Шипы движутся со скоростью в 1600 единиц.","Пораженные юниты подбрасываются вверх на 350 единиц для базового оглушения на 0,5 секунды.","Когда юниты в воздухе, остальные юниты могут под ними проходить.","Урон применяется после приземления, а не до него.","C действующей Burrow дальность применения и прохождения увеличивается до Ошибка выражения: + не хватает операнда единиц, а время перезарядки снижается до Ошибка выражения: - не хватает операнда секунд.","Impale может поражать юнитов на расстоянии до 825 ( 825) единиц (складывается из дальности прохождения и радиуса).","Когда Impale поражает невидимых юнитов, визуальные эффекты под ними остаются видимыми."],"mana":"95\/115\/135\/155","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14","name":"Impale","description":["Анимация применения: 0,4+0","Дальность применения: 700","Дальность прохождения: 700","Радиус: 125","Урон: 80\/140\/200\/260 ( 255\/315\/375\/435)","Длительность оглушения: 1,6\/2\/2,4\/2,8"],"hot_key":"Q","legacy_key":"E"},{"spell":"Выжигает у выбранного героя ману, пропорциональную его интеллекту, и наносит урон, равный выжженной мане.","effects":["Способность Направленная на юнита","Действует на Вражеских героев","Урон Магический"],"notes":["Сначала применяет урон, затем сжигает ману.","В среднем сжигает 29%\/33%\/38%\/42% от максимального запаса маны цели, если у неё нет дополнительной маны.","Несмотря на то, что первым наносится урон, он основывается на том, сколько маны потеряет цель из-за Mana Burn. То есть при применении на врага, у которого, к примеру, осталось 5 единиц маны, способность нанесет только 5 единиц урона (до учета сопротивления).","Можно применять к крипам-героям, но это не даст никакого эффекта, (поскольку у них нет атрибута интеллект), способность потратит ману и уйдет на перезарядку.","С действующей Burrow дальность применения увеличивается до Ошибка выражения: + не хватает операнда единиц."],"mana":"100","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"28\/20\/12\/4","name":"Mana Burn","description":["Анимация применения: 0,4+0","Дальность применения: 600","Множитель интеллекта: 350%\/400%\/450%\/500%","Урона за сожженную ману: 100%"],"hot_key":"W","legacy_key":"R"},{"spell":"Полностью блокирует урон от атаки или способности, по одному разу отражая урон и оглушая каждого, кто пытался его нанести. Не прерывает невидимость от способности Vendetta. Если герой находится под действием Burrow, эта способность мгновенно оглушает всех врагов вокруг.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Чистый"],"notes":["При использовании Spiked Carapace прерывает произносимые способности Nyx Assassin.","Можно использовать при действующей Vendetta без выхода из невидимости, но выводит из других источников невидимости.","Отражает только урон, наносимый игроком, напрямую наносителю урона. Юнит задевается способностью только один раз.","Отражает тот же тип урона, что и получает.","Отражает входящий урон до всех манипуляций. При этом манипуляция урона на врага влияет на урон по-прежнему.","На отражаемый физический урон также действует блокировка урона.","У отражаемого урона есть отметка неотражаемости, препятствующая отражению этого урона от других подобных источников.","Полностью игнорирует наносимый себе урон и урон, отмеченный как отнимающий здоровье.","У Spiked Carapace глобальная дальность и она действует на невидимых юнитов и юнитов в тумане войны.","Отраженный урон не может быть усилен с помощью усиления урона заклинаний и на него не работает вампиризм заклинаний.","Не работает на варды, строения и союзных юнитов.","Spiked Carapace полностью отрицает и отражает урон после всех сопротивлений, что предотвращает срабатывание эффектов, реагирующих на урон.","У способности приоритет выше, чем у Aphotic Shield и Living Armor, но ниже, чем у False Promise. При этом в комбинации с False Promise способность продолжает отражать урон и оглушать цели.","Несмотря на то, что урон, наносимый врагам равен значению заблокированного урона, эффекты работают отдельно друг от друга. То есть Spiked Carapace всегда блокирует один источник наносимого урон, даже если источник обладает иммунитетом к способностям или неуязвим.","С действующим Burrow, способность мгновенно применяет оглушение по всем врагам в радиусе единиц. Поскольку Spiked Carapace не имеет базового урона, пораженные юниты урона также не получат. У Nyx Assassin также остается стандартный бафф, которое может отражать урон и оглушать врагов. При этом бафф не влияет на вражеских юнитов, которые до этого уже были поражены оглушением от способности. Они смогут нанести Nyx Assassin урон как обычно."],"mana":"40","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"25\/20\/15\/10","name":"Spiked Carapace","description":["Анимация применения: 0+0","Радиус с Burrow: 300","Отражаемый урон: 100% ( 175%)","Длительность: 2,25","Длительность оглушения: 0,6\/1,2\/1,8\/2,4"],"hot_key":"E","legacy_key":"D"},{"spell":"Делает героя невидимым и увеличивает его скорость передвижения. Если герой совершит атаку из невидимости, то нанесёт огромный дополнительный урон и наложит на жертву эффект истощения на 4 сек.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Физический"],"notes":["При использовании Vendetta не прерывает произносимые способности Nyx Assassin.","Атака из Vendetta не может промахнутся.","Атака из Vendetta сначала наносит урон способности, затем применяет дебафф, а затем наносит урон от атаки.","Дополнительный урон не добавляется к урону. То есть на урон не влияют Enfeeble или Empower. Также на данный урон не работает вампиризм, на него не может сработать критический или прорубающий удар.","Невидимость заканчивается при достижении способностями или предметами точки применения или достижения атакой цели.","Урон и дебафф не применяется при атаке вардов или строений.","Vendetta позволяет Nyx Assassin проходить сквозь остальных юнитов, включая варды, но исключая строения.","Nyx Assassin может поднимать, выкидывать или атаковать предметы и руны без выхода из невидимости.","Талант на 25 уровне позволяет Nyx Assassin, помимо прохождения сквозь юнитов, свободно проходить по возвышенностям и деревьям."],"mana":"140\/200\/260","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"70\/60\/50","name":"Vendetta","description":["Анимация применения: 0+0","Время до невидимости: 0","Урон: 250\/400\/550","Доп. скорость передвижения: 16%\/18%\/20%","Длительность Vendetta: 40\/50\/60","Длительность истощения: 4"],"hot_key":"R","legacy_key":"V"},{"spell":"Герой торопливо закапывается в землю. В таком виде Spiked Carapace действует на всех окружающих врагов, дальность Mana Burn и Impale увеличивается, а также уменьшается время перезарядки последней. Закопавшийся в землю герой невидим, получает уменьшенный урон, быстрее восстанавливает здоровье и ману, но не может двигаться или атаковать.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Требует наличия Aghanim's Scepter для разблокировки.","Делает Nyx Assassin невидимым, обезоруживает его и применяет к нему оцепенение, предотвращая его передвижение, атаки и использование Blink Dagger.","Burrow длится до использования Unburrow или Vendetta.","Nyx Assassin может быть передвинут с помощью способностей и использовать телепортацию без выкапывания себя.","Nyx Assassin все равно нужно разворачиваться, чтобы применить способности и предметы, даже если модель зарытия (грязевой кучи) визуально не разворачивается.","Потеря Aghanim's Scepter мгновенно выкапывает Nyx Assassin."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Burrow","description":["Анимация применения: 1,5+0,1","Время до невидимости: 0","Макс. здоровья\/маны в регенерацию за секунду: 1,5%","Уменьшение входящего урона: 40%","Увеличение дальности применения\/расстояния Impale: 525","Уменьшение перезарядки Impale: 7","Увеличение дальности применения Mana Burn: 450","Радиус Spiked Carapace: 300"],"hot_key":"D","legacy_key":"F"},{"spell":"Выкопаться из-под земли.","effects":["Способность Ненаправленная"],"notes":["Заменяет Burrow до использования или смерти героя.","При использовании прерывает произносимые способности Nyx Assassin.","Мгновенно убирает все бонусы, предоставленные Burrow.","Использует другой звук, когда герой выкапывается из реки."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Unburrow","description":["Анимация применения: 0+0"],"hot_key":"D","legacy_key":"F"}],"bio":"Глубоко в архивах Ультимира, среди учёных трактатов о кладистике драконов и книгах непереводимых заклинаний, таится древний том с описаниями энтомологических диковин. Составленная учёными книга описывает телепатические способности скарабея-фанатика, странного вида общественных насекомых со способностями, которых нет больше ни у кого во всех семи мирах. В отличие от многих других личинок колонии, этот зародыш не превратился в жука с ограниченным мышлением и затупленными конечностями, положенными рабочей касте его вида. Для него было уготовано особое превращение — благодать самой Никс. Он был избран, один из множества, и помазан экстрактом самой королевы-богини. Мало кто выживал в полумраке королевских покоев, но он проявил проницательный ум. Его бритвенно острые жвалы секли воздух, пока разум проникал в мысли существ вокруг него. Из всех скарабеев-фанатиков только он был удостоен высшего звания. После нового превращения он переродился под благодатью Никс, со способностями, служащими одной лишь цели: убивать во имя богини.","talentsTips":["Золото с таланта является ненадёжным.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на ловкость в общем даёт Nyx Assassin: 16"],"trivia":["В оригинальной DotA, модель и реплики героя были идентичны к герою Ануб'арак (Anub`Arak) из вселенной Warcraft.","Шуточное имя героя - Anoob`arak.","Nyx Assassin и Abaddon презирают друг друга","При убийстве Broodmother можно услышать фразу \"Broodmotherfuh...\". Возможно, герой хотел сказать \"Broodmotherfucker\", что является игрой слов \"Broodmother\" и известного американского сленгового ругательства \"Motherfucker\"."],"talents":["Проход через препятствия в Vendetta:+100 к ловкости","+175 к урону от Impale:+75% к урону от Spiked Carapace","+30 к скорости передвижения:+325 к здоровью","+90 золота в минуту:+8% к урону от способностей"],"tips":["Связка Vendetta + Impale + Mana Burn является очень эффективной для героя. С такой связкой можно быстро убить одного противника.","В начальных этапах игры, даже после этой связки урона может не хватить. Для такой цели, рекомендуется покупать предмет Dagon.","Dagon является одним из основных для героя, и рекомендуется прокачивать предмет (покупкой рецепта)."],"desc":"Nyx Assassin — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Первая способность, Impale, позволяет герою вызвать каменные шипы из под земли, которые подкидывают и оглушают врагов некоторое время, а затем получат урон от падения. Вторая способность, Mana Burn, выжигает у выбранного героя ману, пропорциональную его интеллекту, и наносит урон, равный выжженой мане. Третья способность, Spiked Carapace, отражает и сводит на нет следующую атаку по Nyx Assassin (по одной от каждого источника), оглушая того, кто ее совершил. Эффект способности схож с действием предмета Blade Mail, однако, эта способность еще и оглушает противника, в отличие от предмета. Ультимативная способность, Vendetta, делает Nyx Assassin невидимым и дает ему дополнительную скорость передвижения. Если Nyx Assassin атакует из невидимости, то он наносит огромный дополнительный урон. Улучшение с Aghanim's Scepter добавляет новую способность Burrow с помощью которой Nyx Assasssin закапывается в землю. После этого Spiked Carapace мгновенно оглушает врагов рядом при использовании, дальность применения Mana Burn и Impale увеличивается, а время перезарядки Impale уменьшается. Закопавшийся в землю Nyx Assassin невидим и не может двигаться или атаковать. Также повышается скорость восстановления здоровья и маны, а получаемый урон уменьшается. У этой способности есть подспособность Unburrow позволяющая выкопаться из-под земли."}