{
  "abilities": [
    {
      "notes": [
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Enchantress's magic resistance to 32.5%.",
        "Increases Enchantress's magic resistance to 32.5%.",
        "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+20 Nature's Attendants Heal",
          "talentRight": "+6.5% Impetus Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Enchant Affects Ancients",
          "talentRight": "+65 Untouchable Slow"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+5 Nature's Attendants Wisps",
          "talentRight": "+45 Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Movement Speed",
          "talentRight": "+10% Magic Resistance"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Enchantress_Impetus_1.mp3\/revision\/latest?cb=20191216013613",
      "effects": [
        "Ability Target Unit \/ Autocast",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "The cast range of Impetus is based on the attack range of the caster. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "The distance is calculated as the projectile hits the target. This means moving away from the target causes it to deal more damage on impact, and moving closer decreases the damage.",
        "This means moving away from the target causes it to deal more damage on impact, and moving closer decreases the damage.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "Impetus deals its damage before the attack damage is applied, but still depends on the attack hitting the target.",
        "Impetus does not work against allied units, buildings or wards.",
        "The damage is capped at 1750 distance, which equates to 140\/210\/280\/350 (TagTalent 253.75\/323.75\/393.75\/463.75) damage."
      ],
      "mana": "55",
      "item_behaviour": [],
      "name": "Impetus",
      "cooldown": "6\/4\/2\/0",
      "description": "Places an enchantment on each attack while activated, causing it to deal additional damage based on how far away the target is. The farther the target, the greater the damage dealt.",
      "hot_key": "Q",
      "params": [
        "Cast Range: 575",
        "Distance as Damage: 8%\/12%\/16%\/20% (TagTalent 14.5%\/18.5%\/22.5%\/26.5%)"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Enchantress_Enchant_1.mp3\/revision\/latest?cb=20191216013612",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Casting Enchant on heroes (including clones and the Vengeance Aura illusion) or creep-heroes slows them and applies a basic dispel on them (long sound is played).",
        "Enchant first applies the dispel, then the slow.",
        "Slowed units leave behind a trail of flowers as they move, which is only visible when the unit itself is visible.",
        "Casting Enchant on any other enemy unit which is not a ward or building enchants it (short sound is played). This includes all other illusions. Enchant applies a basic dispel on the target which removes buffs and debuffs. The enchanted creep also gets fully healed and is granted regular flat bonus attack damage. However, its mana does not get restored.",
        "Enchant applies a basic dispel on the target which removes buffs and debuffs.",
        "The enchanted creep also gets fully healed and is granted regular flat bonus attack damage. However, its mana does not get restored.",
        "Cannot be cast on ancient creeps, siege creeps, Necronomicon Warriors and Necronomicon Archers. With the level 20 talent, Enchant can target ancient creeps, but Roshan and creep-heroes tagged as ancient creeps are only slowed. Although Couriers can be targeted, it has no effect on them, wasting the mana and cooldown.",
        "With the level 20 talent, Enchant can target ancient creeps, but Roshan and creep-heroes tagged as ancient creeps are only slowed. Although Couriers can be targeted, it has no effect on them, wasting the mana and cooldown.",
        "Although Couriers can be targeted, it has no effect on them, wasting the mana and cooldown.",
        "Enchanting a new creep instantly kills the previous enchanted creep.",
        "When an enchanted creep's duration ends, it dies instantly. The death is not credited to anyone so that no one gets experience from it."
      ],
      "mana": "40\/50\/60\/70",
      "item_behaviour": [],
      "name": "Enchant",
      "cooldown": "28\/24\/20\/16",
      "description": "Enchantress charms an enemy. If the enemy is a hero, they are slowed. If the enemy is a creep, she brings it under her control, increasing its attack damage and max health.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.67",
        "Cast Range: 500\/550\/600\/650",
        "Hero Move Speed Slow: 55%",
        "Hero Slow Duration: 3.75\/4.5\/5.25\/6",
        "Max Enchanted Creeps: 1",
        "Creep Max Health Bonus: 200\/300\/400\/500",
        "Creep Attack Damage Bonus: 10\/30\/50\/70",
        "Creep Armor Bonus: 2\/4\/6\/8",
        "Enchant Duration: 30\/60\/90\/120",
        "Slow persists if debuff was placed before spell immunity and when not dispelled. Cannot convert spell immune units."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/96\/Enchantress_Nature%27s_Attendants.mp3\/revision\/latest?cb=20191216013606",
      "effects": [
        "Ability No Target (TagAghanim Passive)",
        "Affects Allies"
      ],
      "notes": [
        "Every 0.5 seconds, each wisp chooses a random allied unit to heal. So it is possible to heal up to 8 (TagTalent 13) allies at a time.",
        "The heal targets are chosen completely random, without any priorities. Multiple wisps can randomly select the same unit. Each wisp approaches its chosen target, indicating the wisp is healing the target. However, when choosing the wisps increasing talent, the visual effect does not adapt. The numbers of wisps that can be seen does not increase.",
        "Each wisp approaches its chosen target, indicating the wisp is healing the target.",
        "However, when choosing the wisps increasing talent, the visual effect does not adapt. The numbers of wisps that can be seen does not increase.",
        "Ignores ancient creeps and allies that already are at full health.",
        "Wisps can heal invulnerable units, but not hidden units.",
        "The area of effect is centered around Enchantress' current location, and follows her at all times.",
        "When Enchantress dies, the wisps still continue to heal units nearby her death's location.",
        "Nature's Attendants does not stack with itself. Casting the ability while it is active refreshes the buff.",
        "Can heal a total of 32\/64\/96\/128 health per second or 384\/768\/1152\/1536 health over its full duration. The number of wisps increasing talent can heal a total of 52\/104\/156\/208 health per second or 624\/1248\/1872\/2496 health over its full duration. The bonus heal per wisp talent can heal a total of 192\/224\/256\/288 health per second or 2304\/2688\/3072\/3456 health over its full duration. With both talents, it can heal a total of 312\/364\/416\/468 health per second or 3744\/4368\/4992\/5616 health over its full duration.",
        "The number of wisps increasing talent can heal a total of 52\/104\/156\/208 health per second or 624\/1248\/1872\/2496 health over its full duration.",
        "The bonus heal per wisp talent can heal a total of 192\/224\/256\/288 health per second or 2304\/2688\/3072\/3456 health over its full duration.",
        "With both talents, it can heal a total of 312\/364\/416\/468 health per second or 3744\/4368\/4992\/5616 health over its full duration.",
        "With Aghanim's Shard, the passive wisps can heal up to 12\/24\/36\/48 (TagTalent 72\/84\/96\/108) health per second or 720\/1440\/2160\/2880 (TagTalent 4320\/5040\/5760\/6480) per minute."
      ],
      "mana": "170\/160\/150\/140",
      "item_behaviour": [],
      "name": "Nature's Attendants",
      "cooldown": "35",
      "description": "A cloud of wisps heals Enchantress and any friendly units nearby. Lasts seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0.93",
        "Search Radius: 275",
        "Active Number of Wisps: 8 (TagTalent 13)",
        "Heal per Second per Wisp: 4\/8\/12\/16 (TagTalent 24\/28\/32\/36)",
        "Duration: 12",
        "Passive Number of Wisps: 3",
        "Adds 3 permanent Nature's Attendants that follow Enchantress around.",
        "The Aghanim's Shard upgrade fully works for illusions."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Enchantress_Sproink.mp3\/revision\/latest?cb=20191216013606",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Sproink interrupts Enchantress' channeling abilities upon cast.",
        "Sproink disjoints projectiles upon cast.",
        "Leaps at a speed of 1250 for up to 0.4 seconds.",
        "Always leaps 180° away from the direction Enchantress is facing. Does not lock Enchantress' facing angle during the leap.",
        "Can leap over other units and over impassable terrain.",
        "During Sproink, Enchantress can attack, cast abilities and use items.",
        "0.2 seconds in to the leap, Enchantress performs instant attacks on the furthest 3 enemies within the search radius. This means if the leap gets interrupted before that, the instant attacks do not happen. The instant attacks are only performed if Impetus is learned. With Enchantress' base attack range and Sproink's attack range buffer, the ability has a search radius of 775. The search radius can be further increased by other attack range bonuses. Searches for enemies all around her, meaning it may target enemies behind Enchantress as well. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, and are prevented by disarms. The instant attacks apply the current level of Impetus, regardless of whether it is currently castable or not. The Impetus applied by Sproink do not cost any mana.",
        "This means if the leap gets interrupted before that, the instant attacks do not happen.",
        "The instant attacks are only performed if Impetus is learned.",
        "With Enchantress' base attack range and Sproink's attack range buffer, the ability has a search radius of 775.",
        "The search radius can be further increased by other attack range bonuses.",
        "Searches for enemies all around her, meaning it may target enemies behind Enchantress as well.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, and are prevented by disarms.",
        "The instant attacks apply the current level of Impetus, regardless of whether it is currently castable or not.",
        "The Impetus applied by Sproink do not cost any mana."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Sproink",
      "cooldown": "5",
      "description": "Leaps backward and dodges incoming projectiles, and launches an Impetus attack on the furthest 3 enemy units within Enchantress' attack range + 200.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0",
        "Leap Distance: 500",
        "Leap Duration: 0.4",
        "Impetus Attacks Range Buffer: 200",
        "Number of Impetus Attacks: 3"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Enchantress_Untouchable.mp3\/revision\/latest?cb=20191216013607",
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Untouchable is triggered whenever a unit starts an attack on Enchantress, regardless of distance. This means it does not matter if the attack successfully hits or not, the slow is still applied.",
        "This means it does not matter if the attack successfully hits or not, the slow is still applied.",
        "When the attack was fully executed, then the slow debuff lasts as long as the remaining backswing duration of the attack. Canceling the attack backswing does not affect this duration, so it is not possible to reset the attack speed by canceling it. When switching attack targets, the debuff persists, but does not apply the slow against the new target. The debuff persists until the attack against the new target finishes or gets canceled. This means it is possible to skip the backswing-based slow duration by issuing an attack order (A) on a new target within attack range between each attack. This also means, the debuff does not affect the idle animation in attack animation after the backswing.",
        "Canceling the attack backswing does not affect this duration, so it is not possible to reset the attack speed by canceling it.",
        "When switching attack targets, the debuff persists, but does not apply the slow against the new target.",
        "The debuff persists until the attack against the new target finishes or gets canceled.",
        "This means it is possible to skip the backswing-based slow duration by issuing an attack order (A) on a new target within attack range between each attack.",
        "This also means, the debuff does not affect the idle animation in attack animation after the backswing.",
        "Does not work against buildings, allies, or invulnerable units. Works against vulnerable wards."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Untouchable",
      "cooldown": null,
      "description": "Enchantress beguiles her enemies, slowing their attacks when she is attacked.",
      "hot_key": "R",
      "params": [
        "Attack Speed Slow: 120\/160\/200 (TagTalent 185\/225\/265)",
        "Grants a new ability: Sproink.",
        "Although the debuff is still placed on each attack, it does not slow during Break."
      ],
      "legacy_key": "N",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.7,
    "attrStrength": 17.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 19.0
  },
  "description": "Aiushtha, the Enchantress, is a ranged intelligence hero who uses her abilities to push through lanes and gank with relative ease. Enchantress works well as a jungler in the early game, as it maximizes the effectiveness of her Enchant ability or, harass enemies in lane using Impetus that deals damage based on how far her target is. On first glance, she may be just a support, serving her allies with powerful heals, creep abilities and slows, but as time goes on, her power increases and once she is packed with good items, Enchantress' regular attacks are strong enough to kill most heroes with a couple of attacks if they stand far enough, while avoiding burst attacks with the help of Untouchable. This will make her a potential carry.",
  "history": "Aiushtha appears to be an innocent, carefree creature of the woods, and while this is certainly true, it is hardly the sum of her story. She well understands the suffering of the natural world. She has wandered far, and fared through forests bright and drear, in every clime and every season, gathering friends, sharing news, bringing laughter and healing wherever she goes. For in worlds wracked by war, forests are leveled for the building of ships and siege engines; and even in places of peace, the woods are stripped for the building of homes, and as fuel for countless hearths. Aiushtha hears the pleas of the small creatures, the furtive folk who need green shade and a leafy canopy to thrive. She lends her ears to those who have no other listeners. She carries their stories from the wood to the world, believing that her own good cheer is a kind of Enchantment, that can itself fulfill the promise of a verdant future.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+20 Nature's Attendants Heal",
      "talentRight": "+6.5% Impetus Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Enchant Affects Ancients",
      "talentRight": "+65 Untouchable Slow"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+5 Nature's Attendants Wisps",
      "talentRight": "+45 Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Movement Speed",
      "talentRight": "+10% Magic Resistance"
    }
  ]
}