{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Orchid_Malevolence_Soul_Burn.mp3\/revision\/latest?cb=20191227195517",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not directly amplify damage as it is dealt, but rather saves all damage values and deals 30% of it 5 seconds after cast. This means that the damage can be avoided by becoming spell immune or invulnerable\/hidden at the end of the duration.",
        "This means that the damage can be avoided by becoming spell immune or invulnerable\/hidden at the end of the duration.",
        "The damage is applied as soon as the debuff expires. Dispelling the debuff, however, skips the damage entirely. Recasting Soul Burn on the same target refreshes the duration. Doing this delays the damage further, and gives more time to deal damage to the target. The damage is credited to the last caster of Soul Burn on the target.",
        "Recasting Soul Burn on the same target refreshes the duration.",
        "Doing this delays the damage further, and gives more time to deal damage to the target.",
        "The damage is credited to the last caster of Soul Burn on the target.",
        "Only considers magical, physical and pure damage (after all reductions). Other sources of health loss are ignored.",
        "Shares cooldown with Bloodthorn."
      ],
      "mana": "100",
      "abilityName": "Soul Burn",
      "cooldown": null,
      "description": "Silences the target unit for 5 seconds. At the end of the silence, 30% of the damage received while silenced is inflicted as bonus magical damage.",
      "params": [
        "Cast Range: 900",
        "Damage Amplification: 30%",
        "Duration: 5"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_symbol)^Does not pierce spell immunity\nEffect persists and attempts to deal damage when expiring while spell immune if debuff was placed before spell immunity and when not dispelled."
      ],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 25 attack speed, 240 mana, 5 mana regen and 30 attack damage.",
    "For agility heroes, it grants 25 attack speed, 240 mana, 5 mana regen and 30 attack damage.",
    "For intelligence heroes, it grants 25 attack speed, 240 mana, 5 mana regen and 50 attack damage."
  ],
  "cost": "3475",
  "lore": null,
  "consistFrom": [
    "Oblivion Staff",
    "Oblivion Staff",
    "Recipe"
  ],
  "boughtFrom": "Magical",
  "name": "Orchid Malevolence",
  "description": "A garnet rod constructed from the essence of a fire demon.",
  "trivia": [
    "The item's name is likely a reference to the weapon of the same name that can be acquired in the 2002 video game Otogi: Myth of Demons."
  ],
  "upgradeIn": [
    "Bloodthorn"
  ],
  "bonuses": [
    "+20 Intelligence",
    "+4 Mana regeneration",
    "+30 Attack damage",
    "+25 Attack speed"
  ],
  "tips": null
}