{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e9\/Diffusal_Blade_Inhibit.mp3\/revision\/latest?cb=20191227195409",
      "effects": [
        "Cast Range: 600",
        "Move Speed Slow: 100%",
        "Slow Decay Intervals: 5",
        "Non-Hero Root Duration: 3",
        "Slow Duration: 4"
      ],
      "notes": [
        "The slow decreases in 0.8-second intervals, so it slows for 100%\/80%\/60%\/40%\/20, going one step down every 0.8 seconds.",
        "When cast on non-hero units, the root and slow are applied at the same time, so overall, the slow lasts for 1 second, preventing it from moving and casting certain mobility abilities. Does not provide True Sight over the target.",
        "Does not provide True Sight over the target.",
        "Treats ancient creeps and creep-heroes as heroes."
      ],
      "mana": "0",
      "abilityName": "Inhibit",
      "cooldown": "15",
      "description": "Targets an enemy, slowing it for 3 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Mana Burned per Hit (TagAghanimHero): 40",
        "Mana Burned per Hit (TagAghanimIllusion): 8",
        "Burned Mana as Damage: 100%"
      ],
      "notes": [
        "Burned mana as damage is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to the wielder's attack damage. The attack damage bonus values are not considered by critical strike. However, it is considered by lifesteal and cleave, and it can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to the wielder's attack damage.",
        "The attack damage bonus values are not considered by critical strike.",
        "However, it is considered by lifesteal and cleave, and it can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Effectively increases the wielder's attack damage by 40 against units which have enough mana to burn. Effectively increases the attack damage of an illusion by 8 against units which have enough mana to burn.",
        "Effectively increases the attack damage of an illusion by 8 against units which have enough mana to burn.",
        "Applies the mana loss first, then the damage.",
        "Does not work against allied units when attacking them.",
        "Manabreak from multiple Diffusal Blades does not stack. Fully stacks with other sources of mana break.",
        "Fully stacks with other sources of mana break."
      ],
      "mana": null,
      "abilityName": "Manabreak",
      "cooldown": null,
      "description": "Each attack burns 40 mana from the target, and deals 1 physical damage per burned mana. Burns 8 mana per attack from melee illusions and 8 mana per attack from ranged illusions.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "120 mana and 0.5 mana regeneration.",
    "15 attack speed and 2.5 main armor.",
    "15 and 10 main attack damage to \/ heroes respectively."
  ],
  "cost": "2500",
  "lore": null,
  "consistFrom": [
    "Blade of Alacrity",
    "Robe of the Magi",
    "Recipe"
  ],
  "name": "Diffusal Blade",
  "description": "An enchanted blade that allows the user to cut straight into the enemy's soul.",
  "trivia": [
    "The Manabreak passive used to be called Feedback and got changed at some point without notification.",
    "Since version 7.07, Diffusal Blade can no longer be upgraded."
  ],
  "upgradeIn": null,
  "tips": [
    "Because of the way Manabreak interacts with illusions, Diffusal Blade is most common and most effective on heroes with easy access to them, such as Phantom Lancer."
  ]
}