{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f0\/Sand_King_Burrowstrike.mp3\/revision\/latest?cb=20191216022824",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "Шипы движутся со скоростью в 2000 (3000), достигая максимального расстояния за 0,2\/0,25\/0,3\/0,35 (0,27\/0,33\/0,4\/0,43) сек. Шипы не пройдут максимальное расстояние, если выбрать цель, находящуюся ближе.",
        "Шипы не пройдут максимальное расстояние, если выбрать цель, находящуюся ближе.",
        "Sand King мгновенно передвигается к выбранной точке при достижении её шипами. Не позволяет избежать снаряды при применении или телепортации.",
        "Не позволяет избежать снаряды при применении или телепортации.",
        "Закапывание и появление занимает 0,53 сек. с момента применения способности, в течение которой Sand King обезврежен и не может ничего сделать.",
        "При выборе целью существа Sand King преследует его до достижения расстояния, равного дальности применения, и применяет Burrowstrike к нему напрямую. Шипы не попадают сразу же по цели, поэтому от них можно увернутся. Выбор существа лишь определяет направление шипов.",
        "Шипы не попадают сразу же по цели, поэтому от них можно увернутся. Выбор существа лишь определяет направление шипов.",
        "Задетые существа подбрасываются на 350 единиц на базовые 0,52 секунды оглушения. Пока пораженные существа находятся в воздухе, остальные могут под ними проходить. Урон наносится при приземлении, а не при поражении.",
        "Пока пораженные существа находятся в воздухе, остальные могут под ними проходить.",
        "Урон наносится при приземлении, а не при поражении.",
        "Задевает существ на расстоянии до 550\/650\/750\/850 (950\/1150\/1350\/1450) единиц (складывается из максимального расстояния и радиуса).",
        "С Aghanim's Scepter Burrowstrike применяет ко всем пораженным героям (но не иллюзиям) дебафф Caustic Finale текущего уровня. Считает крипов-героев за крипов. Действуют те же примечания, что и для Caustic Finale. Если Caustic Finale не изучена, то дебафф не применяется.",
        "Действуют те же примечания, что и для Caustic Finale.",
        "Если Caustic Finale не изучена, то дебафф не применяется."
      ],
      "mana": "14\/13\/12\/11 (TagTalent 12\/11\/10\/9)",
      "item_behaviour": [],
      "name": "Burrowstrike",
      "cooldown": "110\/120\/130\/140",
      "description": "Герой погружается в землю и прорывается вперёд, оглушая врагов на пути и нанося им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 400\/500\/600\/700 ( 800\/1000\/1200\/1300)",
        "Радиус: 150",
        "Урон: 100\/160\/220\/280",
        "Длительность оглушения: 1,6\/1,8\/2\/2,2"
      ],
      "legacy_key": "E",
      "story": "Криксалис часто устраивает засады на неприятелей, выжидая их под песком."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Sand_King_Sand_Storm.mp3\/revision\/latest?cb=20191216022822",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "При применении Sand King мгновенно становится невидимым. Задержка используется, если герой вышел из невидимости при атаке или использовании заклинаний и предметов. Но, поскольку применение Sand Storm мгновенно применяет невидимость, то задержка также не используется при повторном использовании способности в активной области.",
        "Задержка используется, если герой вышел из невидимости при атаке или использовании заклинаний и предметов.",
        "Но, поскольку применение Sand Storm мгновенно применяет невидимость, то задержка также не используется при повторном использовании способности в активной области.",
        "Sand Storm наносит 10\/22,5\/35\/47,5 (TagTalent 72,5\/85\/97,5\/110) урона с интервалом в 0,5 секунды сразу после применения, нанося урон 40\/50\/60\/70 раз. Наносит до 400\/1125\/2100\/3325 (TagTalent 2900\/4250\/5850\/7700) урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность.",
        "Наносит до 400\/1125\/2100\/3325 (TagTalent 2900\/4250\/5850\/7700) урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность.",
        "С талантом 25-го уровня к врагам в радиусе Sand Storm применяется ослепление и замедление скорости передвижения в 35%. Эффекты предоставлены аурой; их дебафф задерживается на 0,5 сек. Ослепление использует псевдослучайное распределение.",
        "Эффекты предоставлены аурой; их дебафф задерживается на 0,5 сек.",
        "Ослепление использует псевдослучайное распределение."
      ],
      "mana": "40\/34\/28\/22",
      "item_behaviour": [],
      "name": "Sand Storm",
      "cooldown": "75",
      "description": "Герой вызывает ужасающую песчаную бурю, которая делает его невидимым и наносит урон врагам. Эффект заканчивается, когда владелец способности выйдет из области действия.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0,5",
        "Радиус: 425\/500\/575\/650",
        "Задержка до невидимости: 0,7",
        "Урон в секунду: 20\/45\/70\/95 ( 145\/170\/195\/220)",
        "Длительность: 20\/25\/30\/35",
        "Длительность задержки ауры: 0,5",
        "Шанс промаха: 35%",
        "Замедление скорости передвижения: 35%"
      ],
      "legacy_key": "R",
      "story": "Ходит слух, что Криксалис — это всего лишь мираж; его панцирь то появляется, то исчезает среди песчаных бурь Искрящейся пустыни."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Sand_King_Caustic_Finale.mp3\/revision\/latest?cb=20191216022819",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Урон по области нанесется только в случае, если существо под действием дебаффа умрет от врага. То есть существо не взорвется, если его добьют, оно исчезнет (например, призванное существо или иллюзия) или его убийство никому не приписано (например, клоны Meepo). Если иллюзия под действием дебаффа умрет, в области нанесется только базовый урон, но не процентный.",
        "То есть существо не взорвется, если его добьют, оно исчезнет (например, призванное существо или иллюзия) или его убийство никому не приписано (например, клоны Meepo).",
        "Если иллюзия под действием дебаффа умрет, в области нанесется только базовый урон, но не процентный.",
        "Успешные атаки по одной и той же цели не складываются, но обновляют длительность. При этом дебафф не обновляется; все его значения устанавливаются с первым применением.",
        "При этом дебафф не обновляется; все его значения устанавливаются с первым применением.",
        "Дебафф не применяется к союзникам, строениям и вардам."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Caustic Finale",
      "cooldown": null,
      "description": "Атаки героя наполняют тела жертв ядом, который замедляет их передвижение, а при смерти разрывает их плоть.",
      "hot_key": "E",
      "params": [
        "Радиус взрыва: 500",
        "Базовый урон: 70\/90\/110\/130",
        "Урон от макс. здоровья: 10%\/14%\/18%\/22%",
        "Замедление скорости передвижения: 10%\/15%\/20%\/25% ( 110%\/115%\/120%\/125%)",
        "Длительность эффекта: 5"
      ],
      "legacy_key": "L",
      "story": "Атаки Криксалиса иссушают жертву, отчего её плоть разрывается на куски."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3f\/Sand_King_Epicenter_1.mp3\/revision\/latest?cb=20191216022820",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "При успешном применении толчки нельзя ничем прервать — даже смертью Sand King.",
        "Толчки исходят от Sand King и следуют за ним. Они возникают с интервалом в 0,5\/0,375\/0,3 (TagTalent 0,27\/0,23\/0,2) сек. спустя 0,5\/0,375\/0,3 (TagTalent 0,27\/0,23\/0,2) сек. после применения. То есть заклинанию нужно 3 секунды, чтобы выпустить все толчки и достигнуть максимального радиуса в 725\/825 после задержки.",
        "Они возникают с интервалом в 0,5\/0,375\/0,3 (TagTalent 0,27\/0,23\/0,2) сек. спустя 0,5\/0,375\/0,3 (TagTalent 0,27\/0,23\/0,2) сек. после применения.",
        "То есть заклинанию нужно 3 секунды, чтобы выпустить все толчки и достигнуть максимального радиуса в 725\/825 после задержки.",
        "Наносит до 660\/960\/1300 урона без выбранных талантов (до уменьшений). С талантом на дополнительный урон от толчка наносит до 780\/1120\/1500 урона. С талантом на дополнительное число толчков наносит до 1210\/1560\/1950 урона. С двумя талантами наносит до 1430\/1820\/2250 урона.",
        "С талантом на дополнительный урон от толчка наносит до 780\/1120\/1500 урона.",
        "С талантом на дополнительное число толчков наносит до 1210\/1560\/1950 урона.",
        "С двумя талантами наносит до 1430\/1820\/2250 урона.",
        "Замедление применяется к врагам с каждым толчком и длится до 6 сек. Несколько источников замедления не складываются, но обновляют длительность. Каждый толчок сначала применяет дебафф, затем наносит урон.",
        "Несколько источников замедления не складываются, но обновляют длительность.",
        "Каждый толчок сначала применяет дебафф, затем наносит урон.",
        "Несколько применений Epicenter складываются, создавая несвязанные друг с другом толчки.",
        "С Aghanim's Shard за каждые 700 единиц, преодоленных Sand King, Epicenter пассивно выпускает толчок. Значения урона и замедления равны значениям Epicenter текущего уровня. Расстояние от эффектов телепортации учитывается только в пределах 700 единиц независимо от фактической дальности телепортации. То есть телепортация на большое расстояние выпустит только один толчок и не будет выпускать дополнительные в соответствии с преодаленным расстоянием. Счетчик расстояния не имеет ограничения по времени. Он сбрасывается только после толчка. Если не изучена Epicenter, то толчки неактивны,. При этом счетчик всё равно учивает расстояние; после изучения Epicenter толчок мгновенно выпустится.",
        "Значения урона и замедления равны значениям Epicenter текущего уровня.",
        "Расстояние от эффектов телепортации учитывается только в пределах 700 единиц независимо от фактической дальности телепортации.",
        "То есть телепортация на большое расстояние выпустит только один толчок и не будет выпускать дополнительные в соответствии с преодаленным расстоянием.",
        "Счетчик расстояния не имеет ограничения по времени. Он сбрасывается только после толчка.",
        "Если не изучена Epicenter, то толчки неактивны,.",
        "При этом счетчик всё равно учивает расстояние; после изучения Epicenter толчок мгновенно выпустится."
      ],
      "mana": "120\/110\/100",
      "item_behaviour": [],
      "name": "Epicenter",
      "cooldown": "150\/225\/300",
      "description": "После подготовки в 2 сек. герой неистово сотрясает землю вокруг себя. Землетрясение наносит урон противникам, замедляет их и увеличивается в радиусе с каждым последующим толчком.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 2+0",
        "Радиус за толчок: 500\/525\/550\/575\/600\/625\/650\/675\/700\/725 ( \/750\/775\/800\/825)",
        "Число толчков: 6\/8\/10 ( 11\/13\/15)",
        "Урон за толчок: 110\/120\/130 ( 130\/140\/150)",
        "Замедление скорости передвижения: 30%",
        "Замедление скорости атаки: 30",
        "Длительность замедления: 3",
        "Длительность: 3",
        "Необходимое расстояние для срабатывания толчка: 700",
        "Радиус толчка с Aghanim's Shard: 475"
      ],
      "legacy_key": "C",
      "story": "Многие путешественники пропали в зыбучих песках Искрящейся пустыни."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 19.0
  },
  "description": "Sand Storm замедляет и ослепляет жертв на 35% +5 к числу толчков у Epicenter +100 к радиусу Epicenter –2 сек. перезарядки Burrowstrike +100 к урону от Caustic Finale +125 к радиусу Sand Storm +0,3 сек. оглушения от Burrowstrike +20 к урону в секунду от Sand Storm",
  "history": "Пески Искрящейся пустыни живы и разумны — эта необозримая пустошь ведёт разговор сама с собой, и думы её необъятны, как и границы. Но когда пустыне нужно обратиться к существам ограниченным, она высвобождает частичку себя и наполняет ею магический панцирь, сотворённый хитроумными калдинскими джиннами. Это создание зовёт себя Криксалис, что означает «Дух песка». Вдохновленный маленькими, но вездесущими обитателями Искрящейся пустыни, он принимает форму огромного скорпиона, и это настоящее отражение его беспощадной природы. Страж, воин, вестник — Криксалис неотделим от бескрайней пустыни, давшей ему жизнь."
}