{"abilities":[{"effects":["Cast Range (Tree\/Ally): 165","Cast Range (Ward): 450","Health Regen Bonus: 7.1875","Duration (Tree): 16","Duration (Ward): 32"],"notes":["When cast on trees, enemy Observer Wards and Sentry Wards, it destroys the target and heals the user. When targeting wards or trees placed by Iron Branch or Sprout, the heal duration is doubled. Can regenerate up to 115 (230 when targeting wards, Iron Branch trees, or Sprout trees) health over its full duration. All 3 charges together can regenerate up to 345 (690 when targeting wards, Iron Branch trees, or Sprout trees) health. Successive uses with the same unit do not stack, but refresh the duration instead. Cannot be cast on any other ward than enemy Observer and Sentry Wards. The targeted tree or ward is instantly destroyed upon cast.","When targeting an allied hero, it creates a Tango (Shared) in the targeted ally's inventory, instead of healing the user. If the targeted ally's inventory is full, the item is dropped on the ground. Can also be cast on creep-heroes, only giving Spirit Bear a charge, otherwise having no effect. Can also be cast on Meepo clones and Tempest Doubles, but doing so has no effect. Cannot be cast on illusions."],"elements":["Ability Target Unit","Affects Trees \/ Self"],"name":"Devour","description":"Consumes a target tree to gain 7 health regeneration for 16 seconds. Consuming a ward or Ironwood Tree doubles the heal amount. Comes with 3 charges. Can be used on an allied hero to give them one Tango."}],"cost":"90","description":"Forage to survive on the battlefield.","trivia":["In the original DotA, Tango's full name was \"Ancient Tango of Essifation\".","Tango's active ability was called \"Eat a Tree or Ward\" before July 19, 2017 Patch."],"tips":["Tangos are a very effective source of combat heal in the early-game, as they do not dispel upon taking damage. When an engagement seems even or against you, using a Tango can tilt the balance in your favor.","Although one Tango charge heals way less and slower than a Healing Salve, one set of Tangos provides slightly more HP\/gold value. Also, the fact that it is not dispelled by damage and its side effect of destroying trees makes it more versatile than Healing Salves. So if no quick and strong healing is required, Tangos are usually more valuable.","They can also be cast on Observer and Sentry Wards with doubled healing effects, making them very useful for dewarding.","Since using Tangos on a tree destroys the tree, it can be used to create alternate pathways between some trees, making it easier to escape or chase enemies. Sometimes it is fully worth it to use a Tango just for this purpose.","Unlike other restoring consumables, it is possible to give allies one charge of the Tangos stack. This allows players to grant another lane healing without having to be there. Giving the mid-laner 1 or 2 charges can be a deciding factor for doing well in the lane."],"attrs":["Active Devour","Charges 3","Disassemble? No","Alert allies? No"],"info":["Stacks with itself in inventory, there is no stack limit. The sell-back price adapts based on the number of Tangos in a stack.","A set of Tangos is not shareable. However, it is possible to give allies a Tango (Shared) by casting it on them.","The sell value of the item is based on the number of charges remaining. A single instance has a sell value of 15 gold."]}