{"abilities":[{"effects":["Дальность применения (Дерево\/Союзник): 165","Дальность применения (Вард): 450","Бонус к регенерации здоровья: 7.1875","Длительность (Дерево): 16","Длительность (Вард): 32"],"notes":["Когда применяется на деревья, вражеские Observer Ward и Sentry Ward, разрушает их и лечит использующего. При использовании на варды или деревья от Iron Branch или Sprout длительность лечения удваивается. Восстанавливает здоровье путём регенерации здоровья, лечит 0,72 здоровья каждую 0,1 секунду. (7,1875 здоровья\/сек.) Один заряд Tango восстанавливает до 115 (230 при использовании на варды и деревья от Iron Branch или Sprout) единиц здоровья Один комплект Tango может восстановить вплоть до 345 (690 при использовании на варды и деревья от Iron Branch или Sprout) единиц здоровья здоровья. При использовании нескольких Tango эффект лечения не складывается, но обновляется. Нельзя использовать на любой другой вард, кроме врежеских Observer и Sentry Wards. При применении выбранное дерево или вард мгновенно разрушаются.","Когда используется на союзного героя, создает Tango (не свой) в инвентаре союзника вместо лечения. Если инвентарь союзника полон, предмет выпадает на землю. Может быть использован на крипов-героев, даст 1 заряд Spirit Bear, но с остальными ничего не произойдет. Может быть использован на клонов Meepo и Tempest Double, но без какого-либо эффекта. Нельзя использовать на иллюзии."],"elements":["Способность Направленная на юнита","Действует на Деревья \/ Себя"],"description":"Съедает дерево, увеличивая восстановление здоровья на 7. Действует 16 сек. Если съесть вард или деревце от Iron Branch, то восстановится в два раза больше здоровья. Изначально имеет 3 зарядов. Можно применить на союзного героя, чтобы дать ему один Tango."}],"cost":"90","description":"Натуральная пища для выживания на поле боя.","attrs":["Активная Devour","Зарядов 3","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Складываются друг с другом в инвентаре, без ограничения. Стоимость возврата основывается на количестве Tango в связке.","Набор Tango нельзя передавать. Однако, возможно дать союзникам Tango (не свой) применив его на них.","Стоимость продажи предмета основывается на количестве оставшихся зарядов. Один заряд имеет стоимость в 15 золота."]}