{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Не смотря на описание, можно применить на любое существо.",
        "Развеивает отрицательные эффекты, если цель является владельцем предмета или его союзником. Не применяет развеивание на противников.",
        "Не прерывает произносимые заклинания при использовании.",
        "Применяет на владельца базовое развеивание во время использования.",
        "Толкает владельца со скоростью 1.",
        "Владелец не обезврежен во время толчка, и поэтому он может использовать способности или предметы, атаковать или поворачиваться во время толчка.",
        "Не может протолкнуть владельца через Kinetic Field и Arena Of Blood.",
        "Если владелец связан Soulbind, то он не сможет протолкнуть себя дальше, чем максимальное расстояние связки.",
        "Если владелец привязан с помощью Pounce, то привязка будет моментально уничтожена во время использования предмета. Однако, если владелец будет привязан после использования предмета, то он не сможет протолкнуть себя дальше, чем максимальное расстояние привязки.",
        "Однако, если владелец будет привязан после использования предмета, то он не сможет протолкнуть себя дальше, чем максимальное расстояние привязки.",
        "Может протолкнуть владельца через непроходимые препятствия. Деревья в радиусе 100 вокруг владельца будут разрушены.",
        "Не делит время перезарядки с Force Staff или Hurricane Pike."
      ],
      "mana": "75",
      "abilityName": "Force",
      "cooldown": "8",
      "description": "Развеивает с владельца отрицательные эффекты и толкает его в направлении взгляда на расстоянии 750.",
      "params": [
        "Дальность применения: 750",
        "Дистанция толчка: 750",
        "Длительность толчка: 0,5",
        "Нельзя применить на противников или союзников, имеющих иммунитет к заклинаниям. Можно применить на владельца с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "Speed Unlock",
      "cooldown": null,
      "description": "Снимает с владельца ограничение на скорость передвижения.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Force Boots — полностью передаваемый предмет.",
    "Бонусы к скорости передвижения от нескольких пар ботинок не складываются.",
    "Складывается с другими бонусами скорости передвижения."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "нейтральных крипов",
  "name": "Force Boots",
  "description": "Неуловимые диковинки, которые никому не удалось исследовать, описать и классифицировать.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+115 к скорости передвижения"
  ],
  "tips": null
}