{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Перезарядка телепортации: 40\/30",
        "Уменьшение времени произнесения: 0\/1"
      ],
      "notes": [
        "По умолчанию Town Portal Scroll может выбирать только постройки. Boots of Travel 1-го уровня позволяет выбирать существ не-героев, а 2 уровень позволяет выбирать ещё и союзных героев. Считает духа-медведя за героя. Считает остальных крипов-героев за крипов. Примечания Town Portal Scroll также полностью применимы.",
        "Boots of Travel 1-го уровня позволяет выбирать существ не-героев, а 2 уровень позволяет выбирать ещё и союзных героев.",
        "Считает духа-медведя за героя. Считает остальных крипов-героев за крипов.",
        "Примечания Town Portal Scroll также полностью применимы.",
        "При изначальном снаряжении предметом автоматически продаются все имеющиеся Town Portal Scroll в соответствующей ячейке. После этого, герою выдаётся бесплатный Town Portal Scroll. Также работает для клонов героя. Эти эффекты происходят лишь при первом снаряжении предметом. Повторное снаряжение (например, перемещение из ранца) не повторяет эти эффекты.",
        "После этого, герою выдаётся бесплатный Town Portal Scroll. Также работает для клонов героя.",
        "Эти эффекты происходят лишь при первом снаряжении предметом. Повторное снаряжение (например, перемещение из ранца) не повторяет эти эффекты."
      ],
      "mana": null,
      "abilityName": "Улучшение Town Portal Scroll",
      "cooldown": null,
      "description": "Улучшает свиток телепортации: он позволяет телепортироваться к существам, перезаряжается быстрее и не расходует заряды.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Улучшение предмета усиливает пассивную способность улучшение Town Portal Scroll. Можно улучшить лишь один раз.",
    "Общая стоимость в золоте за каждый уровень равна 2500\/4500 .",
    "Основные бонусы к скорости передвижения от нескольких пар ботинок не складываются.",
    "Складывается со всеми другими бонусами к скорости передвижения.",
    "Наведение с зажатой клавишей Alt покажет состояние телепортов союзников под верхней полосой интерфейса. Иконка отображает текущую перезарядку их телепортов. Если союзник не имеет предмета для телепортации, иконка не отобразится. Если у него есть предмет в ранце, то отобразится серая иконка. Отображение состояния телепорта имеет следующий приоритет: Boots of Travel 2 ➤ Boots of Travel ➤ Town Portal Scroll. Состояние телепорта не отображает другие телепортирующие способности (например Teleportation).",
    "Иконка отображает текущую перезарядку их телепортов. Если союзник не имеет предмета для телепортации, иконка не отобразится. Если у него есть предмет в ранце, то отобразится серая иконка.",
    "Отображение состояния телепорта имеет следующий приоритет: Boots of Travel 2 ➤ Boots of Travel ➤ Town Portal Scroll.",
    "Состояние телепорта не отображает другие телепортирующие способности (например Teleportation)."
  ],
  "cost": "2500",
  "lore": null,
  "consistFrom": [
    "Boots of Speed",
    "Recipe"
  ],
  "name": "Boots of Travel",
  "description": "",
  "trivia": null,
  "upgradeIn": [
    "Boots of Travel 2"
  ],
  "tips": null
}