{
  "abilities": [
    {
      "notes": [
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Bane's magic resistance to 34%.",
        "Increases Bane's magic resistance to 34%.",
        "The armor talent does not benefit illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+5s Fiend's Grip Duration",
          "talentRight": "+150 Brain Sap Damage\/Heal"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 Movement Speed",
          "talentRight": "-3s Nightmare Cooldown"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+5% Fiend's Grip Max Mana Drain",
          "talentRight": "-3s Brain Sap Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+12% Magic Resistance",
          "talentRight": "+5 Armor"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Bane_Enfeeble.mp3\/revision\/latest?cb=20191216011114",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Reduces the target's total attack damage, including attack damage bonuses.",
        "Applies heal reduction, health regen reduction, lifesteal reduction, and spell lifesteal reduction on the target.",
        "The cast time increase affects abilities' cast point. Channeling times are unaffected.",
        "Multiple casts on the same target do not stack the debuff, but only refreshes the duration."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "Q",
      "cooldown": "28\/21\/14\/7",
      "description": "Lowers the enemy's total attack damage, cast speed, and regeneration.",
      "spellName": "Enfeeble",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range: 800\/900\/1000\/1100",
        "Attack Damage Reduction: 45%\/50%\/55%\/60%",
        "Health Restoration Reduction: 45%\/50%\/55%\/60%",
        "Cast Time Increase: 30%",
        "Duration: 8\/9\/10\/11"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/72\/Bane_Brain_Sap.mp3\/revision\/latest?cb=20191216011113",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Pure"
      ],
      "notes": [
        "Despite the visual effects, the heal happens instantly after the damage is dealt, there is no travel time.",
        "The heal amount is based on how much damage the target took from Brain Sap. This means amplifying or reducing the damage affects the heal value. The heal value itself is still subjected to heal manipulation.",
        "This means amplifying or reducing the damage affects the heal value.",
        "The heal value itself is still subjected to heal manipulation.",
        "Aghanim's Shard adds a 550 radius to this ability. The ability must be centered over a unit still. Can target invisible units and units inside the Fog of War. From secondary targets, it can only heal for 18.75\/37.5\/56.25\/75 (TagTalent 56.25\/75\/93.75\/112.5) health.",
        "Can target invisible units and units inside the Fog of War.",
        "From secondary targets, it can only heal for 18.75\/37.5\/56.25\/75 (TagTalent 56.25\/75\/93.75\/112.5) health."
      ],
      "mana": "100\/120\/140\/160",
      "hotKey": "W",
      "cooldown": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "description": "Feasts on the vital energies of an enemy unit, healing Bane and dealing damage.",
      "spellName": "Brain Sap",
      "params": [
        "Cast Animation: 0.2+0.5",
        "Cast Range: 625",
        "Damage: 75\/150\/225\/300 (TagTalent 225\/300\/375\/450)",
        "Damage as Heal: 100%",
        "Radius: 550",
        "Secondary Damage as Heal: 25%",
        "Causes Brain Sap to become a 550 AoE spell. Secondary targets only heal for 25%."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Bane_Nightmare.mp3\/revision\/latest?cb=20191216011117",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Pure"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self.",
        "Applies a sleep on affected units, preventing them from acting.",
        "Nightmare turns affected targets invulnerable for 1 second, preventing affected units from waking up.",
        "Nightmare reduces affected enemy unit's vision to 200.",
        "Deals damage in 1-second intervals, starting 1 second after cast, resulting in up to 4\/5\/6\/7 instances. Can deal up to 20\/75\/150\/245 damage to enemy targets, considering the default duration (before reductions).",
        "Can deal up to 20\/75\/150\/245 damage to enemy targets, considering the default duration (before reductions).",
        "The target wakes up when a unit starts attacking it (including manual casting of active attack modifiers), or when the target takes damage.",
        "The target does not wake up when taking damage from certain sources and under a few rare conditions: Damage dealt by Sleight of Fist, Side Gunner, or Stifling Dagger. Any damage from active attack modifiers, be it a debuff (e.g. Burning Spear), or direct damage (e.g. Tidebringer). Any damage from already launched ranged attacks if the projectiles hit after the invulnerability period.",
        "Damage dealt by Sleight of Fist, Side Gunner, or Stifling Dagger.",
        "Any damage from active attack modifiers, be it a debuff (e.g. Burning Spear), or direct damage (e.g. Tidebringer).",
        "Any damage from already launched ranged attacks if the projectiles hit after the invulnerability period.",
        "Enemy targets do not wake up from Nightmare's own damage per second.",
        "When waking up with an attack, the Nightmare is transferred to the attacking unit at the start of an attack, not when the attack hits.",
        "When Nightmare is transferred, its duration is refreshed, including the 1 second invulnerability.",
        "Nightmare cannot be transferred to spell immune units, or to wards and buildings. So their attacks only wake up Nightmared units.",
        "Bane and illusions of him (be it his own, enemy or allied illusions) can attack Nightmared units without waking the target up, and without the Nightmare transfering to them. This is innate to Bane, and does not apply to other heroes who use this ability (acquired via Spell Steal or Morph).",
        "This is innate to Bane, and does not apply to other heroes who use this ability (acquired via Spell Steal or Morph).",
        "Sleeping units are never automatically attacked, regardless of auto-attack settings. This means that sleeping units are never attacked by lane creeps, neutral creeps, towers and fountains. Player-controlled units can still force an attack order on the target (TagTalent Right Click or A) to transfer the Nightmare to themselves.",
        "This means that sleeping units are never attacked by lane creeps, neutral creeps, towers and fountains.",
        "Player-controlled units can still force an attack order on the target (TagTalent Right Click or A) to transfer the Nightmare to themselves.",
        "As long as a unit is affected by Nightmare from Bane, Nightmare is replaced by the Nightmare End sub-ability which allows Bane to wake the unit up.",
        "Nightmare's invulnerability status effect uses the default invulnerability icon, instead of its own ability icon."
      ],
      "mana": "165",
      "hotKey": "E",
      "cooldown": "24\/21\/18\/15 (TagTalent 21\/18\/15\/12)",
      "description": "Puts the target enemy or friendly Hero to sleep. Sleeping units are awakened when damaged. If the target was directly attacked, the Nightmare passes to the attacking unit. Bane can attack nightmared targets freely. Enemy Units take Pure Damage Per Second while in Nightmare.",
      "spellName": "Nightmare",
      "params": [
        "Cast Animation: 0.4+0.57",
        "Cast Range: 425\/500\/575\/650",
        "Damage per Second: 5\/15\/25\/35",
        "Sleep Duration: 4\/5\/6\/7",
        "Invulnerability Duration: 1",
        "Sleep and invulnerability debuffs persist if placed before spell immunity and when not dispelled.",
        "Blocked when primary target. Blocked upon attacking a unit affected by an enemy Nightmare."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Toggle"
      ],
      "notes": [
        "Replaces Nightmare until there is no Nightmare debuff from Bane active.",
        "Can wake a unit up at any time during a Nightmare, even during the 1 second invulnerability.",
        "Wakes up all units which were put asleep by Nightmare, no matter who put them asleep.",
        "Can be used while stunned, cycloned, slept, taunted, hidden, or during Forced Movement.",
        "Cannot be used while silenced, hexed or prevented from acting. Bane is unable to ⇧ Shift-queue this ability.",
        "Bane is unable to ⇧ Shift-queue this ability."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Ends all ongoing Nightmares.",
      "spellName": "Nightmare End",
      "params": [
        "Cast Animation: 0+0",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f6\/Bane_Fiend%27s_Grip.mp3\/revision\/latest?cb=20191216011115",
      "effects": [
        "Ability Target Unit \/ Channeled",
        "Affects Enemies \/ Self",
        "Damage Pure (TagAghanim Magical)"
      ],
      "notes": [
        "Fiend's Grip fully disables and provides True Sight over the target until the channeling ends. If the target turns invulnerable or hidden, the channeling stops instantly.",
        "If the target turns invulnerable or hidden, the channeling stops instantly.",
        "Deals 40\/60\/80 damage and drains 2.5% mana in 0.5-second intervals, starting immediately as the channeling begins, resulting in up to 12 (TagTalent 22) instances. Can deal up to 480\/720\/960 (TagTalent 880\/1320\/1760) damage (before reductions). Can drain up to 30% (TagTalent 55%) of the target's maximum mana.",
        "Can deal up to 480\/720\/960 (TagTalent 880\/1320\/1760) damage (before reductions).",
        "Can drain up to 30% (TagTalent 55%) of the target's maximum mana.",
        "Applies the damage first on each interval, and then the mana loss.",
        "Unlike other targeted abilities, the caster vision of Fiend's Grip lasts for the entire channel duration (even if it gets canceled), instead of just 2 seconds.",
        "With Aghanim's Scepter, 2 illusions spawn 400 range towards Bane's right and left side, facing towards the target whenever casting Fiend's Grip. The illusions are able to cast abilities, and are automatically ordered to cast Fiend's Grip on the same target, with an instant cast time. The illusions can be given any orders normally, except for item cast orders. Doing so cancels the channeling and kills the illusion. The illusions' Fiend's Grip places a different modifier than the real hero does. This modifier only stuns the target if the real hero's modifier is present. However, as soon as the real hero's modifier disappears, the illusions' modifier continues dealing damage and draining mana in its place. In this case, the damage and mana drain is sourced to the illusion, not to Bane. The illusions have a maximum duration of 20 seconds, hard-capping the maximum time they can spend channeling. Since the illusions are actually casting Fiend's Grip as well, this upgrade does not work for heroes who do not have Fiend's Grip by default (e.g. when acquired via Spell Steal or with Spell Reflection).",
        "The illusions are able to cast abilities, and are automatically ordered to cast Fiend's Grip on the same target, with an instant cast time.",
        "The illusions can be given any orders normally, except for item cast orders. Doing so cancels the channeling and kills the illusion.",
        "The illusions' Fiend's Grip places a different modifier than the real hero does. This modifier only stuns the target if the real hero's modifier is present.",
        "However, as soon as the real hero's modifier disappears, the illusions' modifier continues dealing damage and draining mana in its place.",
        "In this case, the damage and mana drain is sourced to the illusion, not to Bane.",
        "The illusions have a maximum duration of 20 seconds, hard-capping the maximum time they can spend channeling.",
        "Since the illusions are actually casting Fiend's Grip as well, this upgrade does not work for heroes who do not have Fiend's Grip by default (e.g. when acquired via Spell Steal or with Spell Reflection)."
      ],
      "mana": "200\/300\/400",
      "hotKey": "R",
      "cooldown": "120\/110\/100 (TagTalent 75\/65\/55)",
      "description": "Grips an enemy unit, disabling it and causing heavy damage over time, while stealing mana every 0.5 second based on the unit's maximum mana.",
      "spellName": "Fiend's Grip",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: 625",
        "Max Channel Time: 6 (TagTalent 11)",
        "Damage per Second: 80\/120\/160",
        "Max Mana Drain per Second: 5% (TagTalent 10%)",
        "Number of Illusions: 2",
        "Illusion Damage Taken: 700%",
        "Illusion Duration: 20",
        "Reduces Fiend's Grip cooldown by 45 seconds. Fiend's Grip now creates two uncontrollable illusions that are also channeling Fiend's Grip on the target. Illusions takes 700% incoming damage and immediately dies if they are interrupted. Damage does not stack."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 22.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.5,
    "attrAgilityInc": 2.5,
    "attrAgility": 22.0
  },
  "description": "Atropos, the Bane Elemental (or simply Bane), is a ranged intelligence hero whose dark and nightmarish abilities give him prowess as a disabler, ganker, and nuker. Mostly played as a support, his high starting stats make him a menace in lane. Bane possesses four potent single-target spells, which must be used well to make up for his lack of pushing power or area of effect presence. Bane's first spell, Enfeeble, reduces the target's attack damage, health regeneration, and the speed they cast spells, crippling physical damage dealers, tanky brawlers, and spellcasters alike. Brain Sap deals hefty damage to the target and heals Atropos for the same amount, giving Bane a massive presence in small skirmishes. Nightmare puts a unit to sleep, completely disabling it for several seconds. The unit awakes when it is attacked or takes damage, though Bane can freely attack nightmared targets without waking them. Finally, Bane's Fiend's Grip is a channeled spell that completely disables the target, drains its mana and deals high damage over time. Bane's aptitude for incapacitating and debilitating enemies make him an invaluable support to allies—and a nightmare for enemies.",
  "history": "When the gods have nightmares, it is Bane Elemental who brings them. Also known as Atropos, Bane was born from the midnight terrors of the goddess Nyctasha. A force of terror too powerful to be contained by sleep, he surfaced from her slumbers, fed upon her immortality, and stole his vaporous form from her inky blood. He is the essence of fear. Mortals who hear his voice hear their darkest secrets whispered in their ear. He calls to the hidden fear in every Hero's heart. Wakefulness is no protection, for Bane's black blood, continuously dripping, is a tar that traps his enemies in nightmare. In the presence of Bane, every Hero remembers to fear the dark.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+5s Fiend's Grip Duration",
      "talentRight": "+150 Brain Sap Damage\/Heal"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 Movement Speed",
      "talentRight": "-3s Nightmare Cooldown"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+5% Fiend's Grip Max Mana Drain",
      "talentRight": "-3s Brain Sap Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+12% Magic Resistance",
      "talentRight": "+5 Armor"
    }
  ]
}