{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Ward.mp3\/revision\/latest?cb=20141214193617",
      "effects": [
        "Способность Направленная на область"
      ],
      "notes": [
        "Даёт наземный обзор в радиусе 1400 вокруг себя.",
        "Нельзя поставить внутри области фонтана (включая маленькую область перед подъёмом на базу), или в логове Рошана.",
        "Observer Ward нельзя передать курьеру или Spirit Bear с зажатой клавишей Ctrl.",
        "Перед установкой варда отображаются области появления нейтральных крипов, позволяя заблокировать лагеря.",
        "Также отображаются радиусы уже установленных вардов, показывая возможные области пересечения.",
        "При выборе варда, в пространстве и на мини-карте появляется множество индикаторов. Курсор выбора отображает вард с зелёным кругом вокруг него. Круг показывает дальность обзора. Мини-карта подсвечивает жёлтую область, показывая возможное раскрытие области при установке варда в конкретную точку. Жёлтая маркировка учитывает деревья и высоту ландшафта вокруг области.",
        "Курсор выбора отображает вард с зелёным кругом вокруг него. Круг показывает дальность обзора.",
        "Мини-карта подсвечивает жёлтую область, показывая возможное раскрытие области при установке варда в конкретную точку.",
        "Жёлтая маркировка учитывает деревья и высоту ландшафта вокруг области.",
        "Награда за вард увеличивается на 1 золото каждые 15 секунд и на 1 единицу опыта каждые 10 секунд.",
        "Иллюзии и крипы-герои считаются за крипа при атаке варда, поэтому им нужно совершить 8 атак для уничтожения вместо 2 для героев."
      ],
      "mana": null,
      "abilityName": "Plant",
      "cooldown": "1",
      "description": "Устанавливает невидимый тотем наблюдения, который даёт наземный обзор в радиусе 1400. Действует 6 мин. Можно передать один вард союзному герою, зажав клавишу Ctrl.",
      "params": [
        "Дальность применения: 500",
        "Радиус обзора: 1400",
        "Атак для разрушения героем: 2",
        "Атак для разрушения не-героем: 8",
        "Прирост золота в минуту: 4",
        "Прирост опыта в минуту: 6",
        "Длительность: 360"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Н\/Д"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "<div style=\"float:right;\"> \n<\/div>",
      "cooldown": null,
      "description": "Для этой способности нет описания.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складывается c другими Observer Ward и с Sentry Ward в инвентаре без ограничения. Стоимость продажи зависит от их количества. Варды от разных игроков объединяются.",
    "Варды от разных игроков объединяются.",
    "Observer Ward полностью передаваемый предмет.",
    "Observer Ward не даёт True Sight.",
    "Уничтожение Observer Ward отображается в уведомлениях чата для союзников.",
    "Награда в виде золота за Observer Ward даётся тому игроку, который купил и поставил источник True Sight. В случае с Gem of True Sight и Sentry Ward, золото получает игрок, который их купил. Если Gem of True Sight или Sentry Ward были украдены у врага, то золото получает игрок, который имеет украденный Gem of True Sight или Sentry Ward. В случае с Necronomicon Warrior 3-го уровня, золото получает владелец существа. В случае со способностями Lightning Bolt, Thundergod's Wrath и Rocket Flare, золото получает заклинатель. В случае со способностями Chronosphere, Kinetic Field и Aether Remnant, золото получает игрок, уничтоживший вард.",
    "В случае с Gem of True Sight и Sentry Ward, золото получает игрок, который их купил.",
    "Если Gem of True Sight или Sentry Ward были украдены у врага, то золото получает игрок, который имеет украденный Gem of True Sight или Sentry Ward.",
    "В случае с Necronomicon Warrior 3-го уровня, золото получает владелец существа.",
    "В случае со способностями Lightning Bolt, Thundergod's Wrath и Rocket Flare, золото получает заклинатель.",
    "В случае со способностями Chronosphere, Kinetic Field и Aether Remnant, золото получает игрок, уничтоживший вард.",
    "Существам ближнего боя даётся дополнительно 150 к дальности атаки при атаке Observer Ward.",
    "Герой, купивший Observer Ward, может атаковать его в любой момент независимо от того, можно ли добить вард. Observer Ward получает по 10 урона, если его здоровье выше 50.",
    "Observer Ward получает по 10 урона, если его здоровье выше 50."
  ],
  "cost": "0",
  "lore": [
    "Знание о создании вардов — важный навык для творца магических предметов. Рилай проявила талант в их создании и когда-то хотела стать ремесленником.",
    "Несмотря на этот факт, описание предмета сообщает о том, что Observer Ward — растение, которое «часто разводят начинающие волшебники». То есть варды выращивают, а не создают, что противоречит описанию White Sentry."
  ],
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Observer Ward",
  "description": "Вид полуразумного растения, который часто разводят начинающие волшебники.",
  "trivia": null,
  "upgradeIn": [
    "Варды"
  ],
  "bonuses": null,
  "tips": [
    "Observer Ward важен для достижения победы, так как позволяет вам наблюдать за нужными областями и шпионить за врагами, обеспечивая безопасность вам и вашим союзникам. Очень важно ставить варды в ключевых местах и уничтожать вражеские варды."
  ]
}