{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-8s Snowball Cooldown",
          "talentRight": "12% Chance Walrus Punch"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+80% Walrus Punch Crit",
          "talentRight": "-6s Ice Shards Cooldown"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+120 Snowball Damage",
          "talentRight": "+325 Health"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0.4s Walrus Punch Stun Duration",
          "talentRight": "+25 Tag Team Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Tusk_Ice_Shards_1.mp3\/revision\/latest?cb=20191216025612",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile has 100 radius flying vision, and travels at a speed of 1200 until reaching the targeted point. This vision last for 2 seconds at the targeted point upon reaching it.",
        "This vision last for 2 seconds at the targeted point upon reaching it.",
        "Ice Shards are always created in the same formation. The open side of the shards circle is always facing towards Tusk's position upon cast. The shards' formation is a 200 radius circle with one open side. The center of the circle is 200 range before the targeted point. The first shard is always created at the targeted point, in one line with Tusk's position upon cast. The next shards are placed 40° further to the left and the right respectively, up to 6 shards (9 shards would form a full circle). Each shard's collision radius is approximately 67, and the distance between them is about 6, which is too small for any unit to move through. With Aghanim's Shard, 4 additional shards are placed to the left and right side of the last shards at the semi-circle's opening, forming a U-shape. The shape has a width of 200, and has a length of 480. This effectively increases the length of Ice Shards' formation by 280 from the tails of the open circle.",
        "The open side of the shards circle is always facing towards Tusk's position upon cast.",
        "The shards' formation is a 200 radius circle with one open side. The center of the circle is 200 range before the targeted point.",
        "The first shard is always created at the targeted point, in one line with Tusk's position upon cast.",
        "The next shards are placed 40° further to the left and the right respectively, up to 6 shards (9 shards would form a full circle).",
        "Each shard's collision radius is approximately 67, and the distance between them is about 6, which is too small for any unit to move through.",
        "With Aghanim's Shard, 4 additional shards are placed to the left and right side of the last shards at the semi-circle's opening, forming a U-shape. The shape has a width of 200, and has a length of 480. This effectively increases the length of Ice Shards' formation by 280 from the tails of the open circle.",
        "The shape has a width of 200, and has a length of 480.",
        "This effectively increases the length of Ice Shards' formation by 280 from the tails of the open circle.",
        "Non-player-controlled units (i.e. lane creeps) do not try to path around Ice Shards, but simply walk against them as if they are not there. This effectively causes them to get stuck, until they change directions (e.g. when being aggro'd), or until the shards dissipate.",
        "This effectively causes them to get stuck, until they change directions (e.g. when being aggro'd), or until the shards dissipate.",
        "With Aghanim's Shard, two 200 radius auras are created at the centerline of the formation. The first source is placed at the center of the default shards formation, 200 range before the targeted point. The second source is placed 200 range behind the first source, between the additional 4 shards. Since both sources overlap, the auras cover a total length of 600. The damage per second and movement speed slow effects are provided by the auras. The debuff lingers for 0.5 seconds. Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in up to 4 instances. Can deal up to 240\/300\/360\/420 damage (before reductions) to a single unit within the area for the entire duration.",
        "The first source is placed at the center of the default shards formation, 200 range before the targeted point.",
        "The second source is placed 200 range behind the first source, between the additional 4 shards.",
        "Since both sources overlap, the auras cover a total length of 600.",
        "The damage per second and movement speed slow effects are provided by the auras. The debuff lingers for 0.5 seconds.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in up to 4 instances.",
        "Can deal up to 240\/300\/360\/420 damage (before reductions) to a single unit within the area for the entire duration."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Ice Shards",
      "cooldown": "23\/20\/17\/14 (TagTalent 17\/14\/11\/8)",
      "description": "Tusk compresses shards of ice into a ball of frozen energy that damages all enemies it comes in contact with. When the ball reaches its target destination the shards are released, creating a barrier that lasts for 4\/5\/6\/7 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range: 1800",
        "Damage Radius: 200",
        "Shards Spawn Radius: 200",
        "Shards Spawn Angle: 40°",
        "Number of Shards: 7 (TagTalent 11)",
        "Damage: 70\/140\/210\/280",
        "Shards Duration: 4\/5\/6\/7",
        "Damage per Second: 60",
        "Move Speed Slow: 40%",
        "Aura Linger Duration: 0.5",
        "Enemies trapped within an ice shard suffer from 40% slow and take 60 damage per second. Increases Ice Shards depth by 300 units.",
        "Pathing block affects spell immune units. Does not attempt to damage spell immune enemies."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Snowball_1.mp3\/revision\/latest?cb=20191216025616",
      "effects": [
        "Ability Target Unit",
        "Affects Allies \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The Snowball chases the target for up to 3 seconds and travels at a speed of 600\/625\/650\/675. It can travel for up to 1800\/1875\/1950\/2025 range.",
        "It can travel for up to 1800\/1875\/1950\/2025 range.",
        "Snowball destroys trees, and increases its radius by 40 per second up to 240\/280\/320 as it rolls forward.",
        "Tusk can Right Click on allied heroes and clones to gather them into the Snowball at any point, even if they are invisible or invulnerable. Vice versa, allies can also Right Click the Snowball to jump inside as well. Cannot gather allies who have ☐ Disabled Help from Tusk. Allies affected by Flaming Lasso, Black Hole or Chronosphere cannot be gathered. However, attempting to gather in any ally affected by the aforementioned abilities still adds the gathered damage to Snowball.",
        "Vice versa, allies can also Right Click the Snowball to jump inside as well.",
        "Cannot gather allies who have ☐ Disabled Help from Tusk.",
        "Allies affected by Flaming Lasso, Black Hole or Chronosphere cannot be gathered.",
        "However, attempting to gather in any ally affected by the aforementioned abilities still adds the gathered damage to Snowball.",
        "Only gathered allied heroes and clones increase its damage. Can gather summoned units, illusions and creep-heroes, but it does not increase its damage. Cannot gather wards.",
        "Can gather summoned units, illusions and creep-heroes, but it does not increase its damage. Cannot gather wards.",
        "Units inside Snowball are invulnerable, hidden and spell immune. Allies inside the Snowball are also fully disabled. Tusk is muted and disarmed during Snowball. He can cast his abilities, but cannot use items or attack.",
        "Tusk is muted and disarmed during Snowball. He can cast his abilities, but cannot use items or attack.",
        "Tusk cannot be forced out of the Snowball, while other units within can still be forced out by teleporting abilities, without reducing the gathered damage. If he is teleported by Dark Rift while Snowball is rolling, Tusk is forced out and Snowball is fully canceled.",
        "If he is teleported by Dark Rift while Snowball is rolling, Tusk is forced out and Snowball is fully canceled.",
        "When Snowball connects with its target, Tusk is given an attack order on the target, regardless of auto-attack settings.",
        "Snowball first applies the debuff, then the damage.",
        "This is how much damage Snowball deals (before reductions) with a certain amount of heroes including Tusk: 1 Hero: 105\/170\/235\/300 (TagTalent 225\/290\/355\/420) damage. 2 Heroes: 130\/220\/310\/400 (TagTalent 250\/340\/430\/520) damage. 3 Heroes: 155\/270\/385\/500 (TagTalent 275\/390\/505\/620) damage. 4 Heroes: 180\/320\/460\/600 (TagTalent 300\/440\/580\/720) damage. Tusk is not counted, so if no allied heroes are gathered, only the base damage is applied.",
        "1 Hero: 105\/170\/235\/300 (TagTalent 225\/290\/355\/420) damage.",
        "2 Heroes: 130\/220\/310\/400 (TagTalent 250\/340\/430\/520) damage.",
        "3 Heroes: 155\/270\/385\/500 (TagTalent 275\/390\/505\/620) damage.",
        "4 Heroes: 180\/320\/460\/600 (TagTalent 300\/440\/580\/720) damage.",
        "",
        "Tusk is not counted, so if no allied heroes are gathered, only the base damage is applied.",
        "A hidden debuff provides shared vision over the target until the Snowball stops. Does not provide True Sight."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Snowball",
      "cooldown": "21\/19\/17\/15 (TagTalent 13\/11\/9\/7)",
      "description": "Tusk begins rolling into a snowball. Allies within a 350 radius can also be added to the snowball by right-clicking on them, even while the snowball is moving. Once launched, any enemies caught in the snowball's path will be stunned and take damage. Each allied Hero in the snowball will add to its damage.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0.5",
        "Cast Range: 1150",
        "Damage\/Stun Radius: 200",
        "Radius Increase per Second: 40",
        "Gather Radius: 350",
        "Max Stationary Time: 3",
        "Max Chase Duration: 3",
        "Base Damage: 80\/120\/160\/200 (TagTalent 200\/240\/280\/320)",
        "Damage Bonus per Gathered Hero: 25\/50\/75\/100",
        "Snowball Speed: 600\/625\/650\/675",
        "Stun Duration: 0.5\/0.75\/1\/1.25",
        "Cannot target spell immune enemies. Does not attempt to damage or stun spell immune enemies. Can pull spell immune allies inside."
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Snowball until the sub-ability is used, or Snowball reaches its target or expires."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Launch Snowball",
      "cooldown": null,
      "description": "Launch the snowball toward the target.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Tusk_Tag_Team_1.mp3\/revision\/latest?cb=20191216025619",
      "effects": [
        "Ability No Target \/ Aura",
        "Affects Enemies"
      ],
      "notes": [
        "Interrupts Tusk's channeling abilities upon cast.",
        "The debuff lingers for 0.5 seconds.",
        "Attacks triggering Tag Team first place the movement speed slow debuff, then apply the bonus attack damage.",
        "The bonus attack damage only triggers on allied hero attacks (including illusions and clones, excluding creep-heroes), and on any attacks done by units owned by Tusk. The bonus damage is directly added to the unit triggering the aura, and is dealt in one instance together with the attack damage, and counts as attack damage as well. Therefore, it is considered by attack damage based attack modifiers (e.g. lifesteal, critical strike or cleave). Since it is considered as a bonus attack damage source, it neither benefit illusions nor is affected by most percentage-based damage increasing or reducing effects.",
        "The bonus damage is directly added to the unit triggering the aura, and is dealt in one instance together with the attack damage, and counts as attack damage as well.",
        "Therefore, it is considered by attack damage based attack modifiers (e.g. lifesteal, critical strike or cleave).",
        "Since it is considered as a bonus attack damage source, it neither benefit illusions nor is affected by most percentage-based damage increasing or reducing effects.",
        "The movement speed slow from multiple attacks and\/or attack sources fully stacks, with each attack placing a separate debuff."
      ],
      "mana": "70",
      "item_behaviour": [],
      "name": "Tag Team",
      "cooldown": "24\/21\/18\/15",
      "description": "Temporarily applies a negative debuff aura around you, causing enemies that are attacked under it to take bonus physical damage and reduced movement speed. Lasts 5 seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 350",
        "Attack Damage Bonus: 20\/45\/70\/95 (TagTalent 45\/70\/95\/120)",
        "Move Speed Slow: 75%",
        "Slow Duration: 0.4",
        "Aura Duration: 5",
        "Aura Linger Duration: 0.5",
        "Slow persists if debuff was placed before spell immunity."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Walrus_Kick.mp3\/revision\/latest?cb=20191216025621",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Walrus Kick is not an active attack modifier.",
        "Chooses the closest enemy unit within the search radius, kicking them towards the targeted point. Prioritizes heroes, illusions and clones over non-hero units. Treats creep-heroes as heroes. The enemy target does not need to be in front of Tusk, it can be behind him as well, as long as they are within the 250 search radius. If no enemies are within range, the cooldown gets reset and the mana cost refunded. Cannot target or affect ancient creeps.",
        "Prioritizes heroes, illusions and clones over non-hero units. Treats creep-heroes as heroes.",
        "The enemy target does not need to be in front of Tusk, it can be behind him as well, as long as they are within the 250 search radius.",
        "If no enemies are within range, the cooldown gets reset and the mana cost refunded.",
        "Cannot target or affect ancient creeps.",
        "The target is kicked away from Tusk in an arc 1400 range far and 360 range high. Walrus Kick cannot be overridden by any other forced movement.",
        "Walrus Kick cannot be overridden by any other forced movement.",
        "While in the air, other units may pass below the kicked unit.",
        "Upon cast, the stun and movement speed slow are applied at the same time, so the effective movement speed slow duration is 4 seconds.",
        "Walrus Kick first applies the slow debuff, then the knockback debuff, then the damage.",
        "Destroys trees within a 100 radius around the affected unit during the knockback."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Walrus Kick",
      "cooldown": "8",
      "description": "Kicks the closest enemy unit in a targeted direction, stunning and damaging them.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+1.3",
        "Cast Range: Global",
        "Search Radius: 250",
        "Knockback Distance: 1400",
        "Damage: 350",
        "Move Speed Slow: 40%",
        "Slow Duration: 5",
        "Stun Duration: 1"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Tusk_Walrus_PUNCH%21.mp3\/revision\/latest?cb=20191216025622",
      "effects": [
        "Ability Target Unit \/ Autocast (TagAghanim Passive)",
        "Affects Enemies"
      ],
      "notes": [
        "The cast range of Walrus Punch is based on the attack range of the caster. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses. Both Autocast and manually casting it uses Tusk's current attack range.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "Both Autocast and manually casting it uses Tusk's current attack range.",
        "The attack from Walrus PUNCH! cannot miss. Despite being an active attack modifier, Walrus PUNCH! procs all on-cast effects like a regular ability. Can be cast on every enemy unit, except wards, buildings, and allied units. However, when cast on Roshan, only the stun and movement speed slow are applied.",
        "Despite being an active attack modifier, Walrus PUNCH! procs all on-cast effects like a regular ability.",
        "Can be cast on every enemy unit, except wards, buildings, and allied units.",
        "However, when cast on Roshan, only the stun and movement speed slow are applied.",
        "The victim is hurled 650 range (or 1200 range if lethal) into the air during the stun duration. The speed adapts to changed stun duration. Walrus PUNCH! cannot be overridden by any other upward movement effects.",
        "Walrus PUNCH! cannot be overridden by any other upward movement effects.",
        "While in the air, other units may pass below the hurled unit.",
        "Upon cast, the stun and movement speed slow are applied at the same time, so the effective movement speed slow duration is 2\/3\/4.",
        "The punch first applies the knockback debuff, then the slow debuff, then the damage.",
        "Plays a sound as soon as the attack starts. The sound only stops playing upon landing the punch.",
        "With the level 25 talent, Walrus PUNCH! gains a 12% chance to passively proc on regular attacks. These procs are independent from the cooldown, they do not trigger the cooldown and work while on cooldown. They do not cost mana or proc on-cast effects either. Adds an average of 30% (TagTalent 39.6%) damage to every attack. When Walrus PUNCH! procs during a manual cast or Autocast order, the proc takes priority, and it does not go on cooldown or consume mana. The passive procs use pseudo-random distribution.",
        "These procs are independent from the cooldown, they do not trigger the cooldown and work while on cooldown.",
        "They do not cost mana or proc on-cast effects either.",
        "Adds an average of 30% (TagTalent 39.6%) damage to every attack.",
        "When Walrus PUNCH! procs during a manual cast or Autocast order, the proc takes priority, and it does not go on cooldown or consume mana.",
        "The passive procs use pseudo-random distribution."
      ],
      "mana": "50\/75\/100",
      "item_behaviour": [],
      "name": "Walrus PUNCH!",
      "cooldown": "36\/24\/12",
      "description": "Tusk connects with his mighty Walrus Punch, a critical strike so powerful it launches its victim into the air. The victim is slowed upon landing.",
      "hot_key": "R",
      "params": [
        "Self Attack Animation Speed Bonus: 50%",
        "Critical Damage: 350%\/375%\/400% (TagTalent 430%\/455%\/480%)",
        "Move Speed Slow: 40%",
        "Slow Duration: 3\/4\/5",
        "Stun Duration: 1 (TagTalent 1.4)",
        "Proc Chance: 12%",
        "Grants a new ability: Walrus Kick.",
        "The passive proc chance from the talent is not disabled.",
        "The passive proc chance from the talent does not work for illusions."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.9,
    "attrStrength": 23.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Ymir, the Tusk, is a melee strength hero whose array of icy disables makes him a very strong team initiator and ganker. He has a damage nuke and a disable in Ice Shards, which lets him precisely place a barrier in an enemy's path, inhibiting their movement and blocking off their escape path. Should his teammates need help closing the distance to enemies, Tusk can assist them with Snowball, which surrounds Tusk and any nearby allies in a protective shell of snow as he rolls at a target enemy, damaging and stunning everything in its path. Once in a fight, Tusk also has the ability to Tag Team, which allows all nearby allies to slow enemies they attack with physical damage. His ultimate, Walrus PUNCH!, sends a target enemy flying with a mighty uppercut, stunning and disabling them while dealing a critical strike and slowing them upon landing for a moderate amount of time. A strong initiator and powerful brawler, the Terror from the Barrier should never be bet against in a fight, as he can put his foes down for the count with his unique assortment of spells and disables.",
  "history": "It had been a brawl to remember. There stood Ymir, the Tusk, the Terror from the Barrier, the Snowball from Cobalt, the only fighter to have bested the Bristled Bruiser in a fair fight, and now the last man standing in Wolfsden Tavern. What started as a simple bar bet of supremacy ended with four regulars, a blacksmith, and six of the Frost Brigade's best soldiers writhing against the shards and splinters of almost every bottle, mug, and chair in the building. The Tusk boasted and toasted his victory as he emptied his brew. No sooner had the defeated regained consciousness than the cries for double-or-nothing rang out. The Tusk was pleased at the prospect, but none could think of a bet bigger than the one he just conquered. Horrified at the damage to his tavern and desperate to avoid another brawl, the barkeep had an idea. As skilled as he was, Ymir had never taken part in a real battle, never tested himself against the indiscriminate death and chaos of war. He proposed a wager to the fighter: seek out the biggest battle he could find, survive, and win it for whichever side he chose. The stakes? The next round of drinks.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-8s Snowball Cooldown",
      "talentRight": "12% Chance Walrus Punch"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+80% Walrus Punch Crit",
      "talentRight": "-6s Ice Shards Cooldown"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+120 Snowball Damage",
      "talentRight": "+325 Health"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0.4s Walrus Punch Stun Duration",
      "talentRight": "+25 Tag Team Damage"
    }
  ]
}