{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Illusion_spawn.mp3\/revision\/latest?cb=20141201143046",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении создает иллюзию владельца и меняет их местами. Место появления основано на позиции заклинателя при применении: кто-то появляется на месте использования, а оставшийся — на севере, западе, юге или востоке от этой точки. Расстояние между героем и иллюзией составляет 108, если размер столкновения героя равен 24, и 72 — если размер столкновения равен 8. Поскольку порядок появления всегда одинаков, то заклинатель и иллюзия занимают случайную позицию и смотрят в одну сторону.",
        "Место появления основано на позиции заклинателя при применении: кто-то появляется на месте использования, а оставшийся — на севере, западе, юге или востоке от этой точки.",
        "Расстояние между героем и иллюзией составляет 108, если размер столкновения героя равен 24, и 72 — если размер столкновения равен 8.",
        "Поскольку порядок появления всегда одинаков, то заклинатель и иллюзия занимают случайную позицию и смотрят в одну сторону.",
        "Повторное применение не заменит иллюзию от предыдущего применения. Однако иллюзия уничтожится при переносе предмета из активного слота в рюкзак, на землю или в тайник.",
        "Однако иллюзия уничтожится при переносе предмета из активного слота в рюкзак, на землю или в тайник."
      ],
      "mana": null,
      "abilityName": "Create Illusion",
      "cooldown": "30",
      "description": "Создаёт подконтрольную иллюзию владельца предмета.",
      "params": [
        "Число иллюзий: 1",
        "Иллюзия наносит урона: 50%",
        "Иллюзия получает урона: 200%",
        "Длительность: 30"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "Действует на всех существ не-героев под контролем игрока. Включая крипов-героев, клонов, прирученных существ, вардов и Undying Zombie. Не работает на неуязвимости.",
        "Включая крипов-героев, клонов, прирученных существ, вардов и Undying Zombie.",
        "Не работает на неуязвимости.",
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом существа. Дополнительный урон не увеличивается.",
        "Бафф ауры задерживается на 0,5 секунды."
      ],
      "mana": null,
      "abilityName": "Illusion Mastery",
      "cooldown": null,
      "description": "Увеличивает исходящий урон всех иллюзий и подконтрольных существ на 8%.",
      "params": [
        "Радиус: Глобальный",
        "Доп. урон от атаки для иллюзий и существ: 8%",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Illusionist's Cape — полностью передаваемый предмет."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "нейтральных крипов",
  "name": "Illusionist's Cape",
  "description": "Стильный плащ, создатель которого настаивает на названии «Накидка видений» и резко против придуманного его ассистентом бреда про иллюзии.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+14 к силе",
    "+14 к ловкости"
  ],
  "tips": null
}