{
  "abilities": [
    {
      "effects": [
        "Cast Range: 800",
        "Proc Chance: 20%",
        "Proc Cooldown: 1",
        "Search Radius: 900",
        "Max Number of Targets: 5",
        "Damage: 200",
        "Shield Duration: 15"
      ],
      "notes": [
        "Double clicking the item casts it on self.",
        "Successive casts on the same target do not stack, but refresh the duration.",
        "The radius is centered around the shielded unit.",
        "Upon proccing, the proccing unit and 4 random enemy units within the radius are hit. If the damage source is more than 900 range away, then only the 4 random enemies within range will be hit.",
        "Static Charge cannot proc more than once per second.",
        "Does not hit invisible units or units in the Fog of War.",
        "Despite the description, Static Charge can proc on any damage, including from spells, not only on attacks.",
        "Can only proc on damage instances of 5 or greater (after reductions).",
        "Does not trigger on self-inflicted damage, and damage flagged as HP Removal.",
        "All bolts together can deal up to 1000 damage (before reductions).",
        "Static Charge uses pseudo-random distribution."
      ],
      "elements": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "name": "Static Charge",
      "description": "Places a charged shield on a target unit for 15 seconds which has a 20% chance to release a 200 magical damage shocking bolt at a nearby attacker and 4 additional enemies."
    },
    {
      "effects": [
        "Proc Chance: 25%",
        "Bounce Distance: 900",
        "Number of Bounces: 12",
        "Bounce Interval: 0.25",
        "Damage: 170"
      ],
      "notes": [
        "Does not stack with the Chain Lightning of Maelstrom or other Mjollnirs.",
        "When obtaining multiple items with the Chain Lightning ability, only the one that has been continuously the longest in the inventory works.",
        "The lightning bounces in 0.25 second intervals, so hitting max targets takes 2.75 seconds.",
        "Does not bounce on invisible units or units in the Fog of War.",
        "Can never hit the same unit twice per proc.",
        "All bounces together can deal up to 2040 damage (before reductions).",
        "Chain Lightning can proc while a previous chain lightning is still bouncing.",
        "Chain Lightning will not proc if the attacker is dead. However it can proc if the target is dead.",
        "Chain Lightning uses pseudo-random distribution.",
        "Attacks which proc Chain Lightning cannot miss.",
        "The Mjollnir Chain buff is a hidden buff required for the lightning to jump.",
        "Chain Lightning does not use a regular cooldown. It is neither displayed on the item icon when proccing, nor is it affected by cooldown manipulating effects."
      ],
      "elements": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical"
      ],
      "name": "Chain Lightning",
      "description": "Grants a 25% chance on attack to release a bolt of electricity that leaps between 12 targets within a 900 radius, dealing 170 magical damage to each. Lightning proc pierces evasion."
    }
  ],
  "cost": "5600",
  "description": "Thor's magical hammer, made for him by the dwarves Brok and Eitri.",
  "trivia": [
    "Mjölnir is the name of Thor's Hammer in Norse mythology."
  ],
  "further": [
    "Hyperstone",
    "Maelstrom",
    "Recipe"
  ],
  "tips": [
    "Mjollnir is very effective against heroes with illusions like Naga Siren, Spectre and particularly Phantom Lancer and Chaos Knight that can surround you because the lightning goes all around you compared to cleave and the static charge has more chance to be triggered.",
    "This item is very good for pushing, you can apply the Static Charge on a creep to push a lane safely while you jungle and get extra gold.",
    "This is the most effective item to push back mega creeps."
  ],
  "attrs": [
    "Active Static Charge",
    "Passive Chain Lightning",
    "Bonus +75 Attack speed +24 Attack damage",
    "Disassemble? Yes",
    "Alert allies? No"
  ]
}