{"abilities":[{"effects":["Дальность применения: 800","Шанс срабатывания: 20%","Перезарядка срабатывания: 1","Радиус поиска: 900","Максимум целей: 5","Урон: 200","Длительность щита: 15"],"notes":["Двойное нажатие на предмет применит Static Charge на владельца. Несколько применений предмета не складывает урон, но обновляет время действия. Центр Static Charge — сам юнит. Когда юнит под действием способности получает урон, есть шанс высвободить цепь молний, которая ударит источник урона и 4 ближайших к нему вражеских юнитов. Если источник урона находится в радиусе больше, чем 900, щит все равно может сработать и нанести урон по 4 случайным целям. Не может сработать чаще, чем раз в секунду. Не работает на невидимые или находящеся в тумане войны цели. Вопреки описанию, Static Charge может сработать от любого источника урона, включая заклинания. Урон может сработать только в случае нанесения 5 или более единиц урона(с учетом сопротивления). Не срабатывает от нанесения урона себе и от источников снижения здоровья. Все молнии могут нанести до 1000 урона (с учетом сопротивления). Static Charge использует Псевдо-случайное распределение."],"elements":["Способность Направленная на юнита","Действует на Вражеских существ","Урон Магический"],"description":"На 15 сек. окружает выбранное существо заряженным щитом, который с вероятностью в 20% может нанести 200 магического урона атакующему врагу и 4 другим."},{"effects":["Шанс срабатывания: 25%","Дистанция между отскоками: 900","Количество отскоков: 12","Интервал отскоков: 0.25","Урон: 170"],"notes":["Не сочитается с Chain Lightning от Maelstrom или других Mjollnir.","При наличии нескольких предметов со способностью Chain Lightning, только один который дольше находится в инвентаре будет работать.","Молния отскакивает в интервалах в 0.25 секунды, тоесть поражение максимального количества целей займёт 2.75 секунды.","Не отскакивает на невидимых юнитов или юнитов в тумане войны.","Не может ударить одного и того же юнита за одно срабатывание.","Может сработать только на успешных атаках, промахнувшиеся атаки не спровоцируют эффект.","Все отскоки вместе могут нанести до 2040 урона (до уменьшений).","Chain Lightning может сработать в то время когда предыдущая еще отскакивает.","Chain Lightning использует псевдо-случайное распределение.","Бафф Mjollnir Chain спрятан и необходим для отскакивания молний.","Chain Lightning не использует обычную перезарядку. Она не отображается на иконке предмета при срабатывании, и не попадает под влияние эффектов изменяющих перезарядку."],"elements":["Способность Пассивная","Действует на Врагов","Урон Магический"],"description":"Каждая атака с вероятностью в 25% может создать разряд цепной молнии, которая 12 раз перескочит между случайными врагами в радиусе 900, нанося каждому по 170 магического урона. От атаки с цепной молнией нельзя уклониться."}],"cost":"5600","description":"Магический молот Тора, созданный для него гномами по имени Брок и Эйтри.","further":["Hyperstone","Maelstrom","Рецепт"],"attrs":["Активируемая Static Charge","Пассивная Chain Lightning","Бонус +75 к скорости атаки +24 к урону","Можно разобрать? Да","Можно сообщать? Нет"]}