{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Rod_of_Atos_Cripple_1.mp3\/revision\/latest?cb=20191227195522",
      "effects": [
        "Cast Range: 1100",
        "Root Duration: 2"
      ],
      "notes": [
        "The projectile travel at a speed of 1900.",
        "Roots the targets, preventing them from moving and casting certain mobility abilities. Provides True Sight over the affected target.",
        "Provides True Sight over the affected target.",
        "Successive casts on the same target do not stack but refresh the duration instead.",
        "Shares cooldown with other Rod of Atos-based items."
      ],
      "mana": "50",
      "abilityName": "Cripple",
      "cooldown": "18",
      "description": "Roots the target for 2 seconds.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "240 health and 1.2 health regeneration.",
    "288 mana and 1.2 mana regeneration.",
    "12 attack speed and 2 main armor.",
    "12, 12 and 24 main attack damage to all \/ \/ heroes respectively."
  ],
  "cost": "2750",
  "lore": null,
  "consistFrom": [
    "Staff of Wizardry",
    "Crown",
    "Crown",
    "Recipe"
  ],
  "name": "Rod of Atos",
  "description": "Atos, the Lord of Blight, has his essence stored in this deceptively simple wand.",
  "trivia": [
    "The particle effects of Cripple include runes resembling the Elvish scripts from The Lord of the Rings, a novel by J.R.R. Tolkien (specifically the alphabet bee or umbar in Tengwar).",
    "The item is sometimes referred to as the \"Rod of Aui\", after pro player Aui_2000, who popularized buying the item on many heroes."
  ],
  "upgradeIn": [
    "Gleipnir"
  ],
  "tips": [
    "Root is a great disable to make a melee hero unable to reach his target and attack and later to force them to use their Black King Bar while out of position.",
    "Combine it with an Hurricane Pike to push away your target then root him for preventing your enemy from attacking or escaping.",
    "The item can be used for ganking, chasing survivors after a team fight, or to escape.",
    "The very long cast range makes the Rod of Atos an effective item to disable an enemy Linken's Sphere from afar, although it requires the projectile to connect."
  ]
}