{
  "abilities": [
    {
      "notes": [
        "Талант на вампиризм заклинаний аддитивно складывается с другими источниками вампиризма заклинаний. Лечит на 2,4 % от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.",
        "Лечит на 2,4 % от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Здоровье\/урон чумных тотемов больше в 2,6 раза",
          "talentRight": "+640 к радиусу Poison Nova"
        },
        {
          "talentLvl": "20",
          "talentLeft": "–1,5 сек. перезарядки Plague Ward",
          "talentRight": "+5 сек. действия Poison Nova"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+8% замедления от Poison Sting",
          "talentRight": "+12% к вампиризму заклинаниями"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+100 к дальности атаки",
          "talentRight": "-6 сек. перезарядки Venomous Gale"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Venomancer_Venomous_Gale_1.mp3\/revision\/latest?cb=20191216030202",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Шар летит со скоростью 1200; требуется 0.71 (TagTalent 1.04) сек., чтобы он достиг максимальной дистанции.",
        "Поражает существ на расстоянии до 975 (TagTalent 127) единиц (складывается из дальности прохождения и радиуса).",
        "Замедление уменьшается со временем. Пораженным существам возвращается 1% от их скорости передвижения с интервалом в 0,3 секунды спустя 0,3 секунды после применения дебаффа.",
        "Существо под действием этой способности могут добить союзники, если уровень его здоровья опустится ниже 25%.",
        "После нанесения базового урона способность наносит периодический урон с интервалом в 3 сек., срабатывая 6 раз.",
        "Venomous Gale наносит до 125\/300\/475\/650 единиц урона одному существу до уменьшений.",
        "Дебаффы от нескольких применений не складываются, но обновляют длительность. То есть базовый урон вновь не наносится, поскольку он связан с фактом применения дебаффа, а не с обновлением.",
        "То есть базовый урон вновь не наносится, поскольку он связан с фактом применения дебаффа, а не с обновлением.",
        "Снаряд дает летающий обзор радиусом в 280 единиц, пока летит.",
        "C Aghanim's Shard способность создает 2 Plague Ward вокруг каждого задетого вражеского героя (включая клонов, но исключая иллюзии). Созданные варды связаны с уровнем Plague Ward. Они не появятся, если способность не была изучена. Варды размещаются в 100 единицах от пораженного вражеского героя напротив друг друга.",
        "Созданные варды связаны с уровнем Plague Ward. Они не появятся, если способность не была изучена.",
        "Варды размещаются в 100 единицах от пораженного вражеского героя напротив друг друга."
      ],
      "mana": "125",
      "hotKey": "Q",
      "cooldown": "21\/20\/19\/18 (TagTalent 15\/14\/13\/12)",
      "description": "Выплевывает в указанном направлении ядовитый шар, который наносит урон всем задетым врагам и отравляет их. Пораженные цели медленнее передвигаются, а также получают урон каждые 3 секунды действия способности.",
      "spellName": "Venomous Gale",
      "params": [
        "Анимация применения: 0+0,57",
        "Дальность применения: 800 (TagTalent 1200)",
        "Макс. дальность прохождения: 850 (TagTalent 1250)",
        "Радиус: 125",
        "Урон от попадания: 50\/75\/100\/125",
        "Число срабатываний: 5",
        "Периодический урон: 15\/45\/75\/105",
        "Замедление скорости передвижения: 50%",
        "Длительность: 15",
        "Число чумных тотемов: 2",
        "Создаёт 2 чумных тотема, когда снаряд Venomous Gale попадает по вражескому герою. Увеличивает дальность применения на 400.",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Смесь различных жал, ядов и токсинов, найденных в лесах острова Джиди, обычно выживших не оставляет."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический Отнимающий здоровье"
      ],
      "notes": [
        "Урон от Poison Sting отмечен как эффект, отнимающий здоровье, поэтому на него не реагируют эффекты, срабатывающие от урона.",
        "Урон наносится с интервалом в 1 секунду сразу после размещения дебаффа, срабатывая 6\/9\/12\/15 раз.",
        "Дебаффы от нескольких атак не складываются, но обновляют длительность.",
        "Наносит до 36\/126\/264\/450 (18\/63\/132\/225 если применяется Plague Ward) единиц урона (до уменьшений)."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Добавляет в обычные атаки героя яд, который наносит периодический урон и снижает скорость передвижения жертвы.",
      "spellName": "Poison Sting",
      "params": [
        "Урон в секунду: 6\/14\/22\/30",
        "Замедление скорости передвижения: 8%\/10%\/12%\/14% (TagTalent 16%\/18%\/20%\/22%)",
        "Длительность: 6\/9\/12\/15",
        "Когда Venomancer находится под эффектом истощения, Plague Wards не могут применять с атаками Poison Sting."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Лисейл перенял парализующий токсин существа, вызвавшего его трансформацию."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Venomancer_Plague_Ward.mp3\/revision\/latest?cb=20191216030158",
      "effects": [
        "Способность Направленная на точку"
      ],
      "notes": [
        "Plague Ward автоматически атакует врагов в его радиусе атаки, используя стандартные правила автоатаки. Можно вручную дать вардам цель для атаки, просто щелкнув правой кнопкой мыши по врагу в радиусе атаки. Также можно остановить атаку, отдав команду \"стоп\" (работает только в случае отключенной опции автоатаки).",
        "Можно вручную дать вардам цель для атаки, просто щелкнув правой кнопкой мыши по врагу в радиусе атаки.",
        "Также можно остановить атаку, отдав команду \"стоп\" (работает только в случае отключенной опции автоатаки).",
        "Атаки Plague Ward применяют Poison Sting к врагам. Дебафф складывается с дебаффом от атак Venomancer, но их эффекты - нет. То есть варды размещают отдельный дебафф Poison Sting на атакуемого врага и не обновляют дебафф от атак Venomancer. При этом дебафф, примененный вардом, отключается (не наносит урона или не замедляет), если на враг уже под действием дебаффа от Venomancer.",
        "То есть варды размещают отдельный дебафф Poison Sting на атакуемого врага и не обновляют дебафф от атак Venomancer.",
        "При этом дебафф, примененный вардом, отключается (не наносит урона или не замедляет), если на враг уже под действием дебаффа от Venomancer.",
        "Источником урона от Poison Sting вардов является Venomancer, а не сами варды.",
        "Приоритет в качестве целей для атак у Plague Ward ниже, чем у существ и героев, поэтому башни и крипы на линии атакуют их в последнюю очередь.",
        "Варды получают иммунитет к заклинаниям в качестве баффа, поэтому враги могут проверить бафф и вывести ‼ Сообщение (Alt+ Нажатие ЛКМ) в чат оставшееся время жизни варда.",
        "Урон от вардов не снижается способностями, блокирующими урон."
      ],
      "mana": "20",
      "hotKey": "E",
      "cooldown": "5 (TagTalent 2,4)",
      "description": "Призывает чумной тотем, атакующий вражеских существ и сооружения. Тотем невосприимчив к магии. Он имеет текущий уровень способности Poison Sting, нанося 50% от её урона.",
      "spellName": "Plague Ward",
      "params": [
        "Анимация применения: 0+0,63",
        "Дальность применения: 850",
        "Длительность: 40"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Сочетание давних талантов травника и новообретённых умений в приготовлении ядов становится живым воплощением чумы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/49\/Venomancer_Poison_Nova_1.mp3\/revision\/latest?cb=20191216030159",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Venomancer.",
        "Кольцо распространяется со скоростью 500 единиц.",
        "Poison Nova поражает существ на расстоянии до 885 (TagTalent 1525) единиц (складывается из дальности прохождения и ширины).",
        "Несмотря на то, что у способности есть ширина, существа между кольцом и Venomancer все равно задеваются, даже если не находятся в пределах 255 ширины кольца яда.",
        "Наносит урон с интервалом в 1 секунду сразу после размещения дебаффа, срабатывая 21 (TagTalent 26) раз.",
        "Poison Nova никогда не сможет убить существо. Здоровье существ от этого урона никогда не опустится ниже 1.",
        "Наносит до 840\/1365\/1890 (TagTalent 1040\/1690\/2340) (TagTalent 1575\/2100\/2625, 1950\/2600\/3250) урона одному существу (до уменьшений).",
        "Дебаффы от нескольких применений не складываются, но обновляют длительность."
      ],
      "mana": "200\/300\/400",
      "hotKey": "R",
      "cooldown": "140\/120\/100 (TagTalent 140\/120\/60)",
      "description": "Герой распыляет яд на врагов вокруг. От этого яда жертвы постепенно теряют здоровье, но не могут умереть.",
      "spellName": "Poison Nova",
      "params": [
        "Анимация применения: 0+0,87",
        "Радиус: 630 (TagTalent 1270)",
        "Ширина: 255",
        "Урон в секунду: 40\/65\/90 (TagAghanim 75\/100\/125)",
        "Длительность: 20 (TagTalent 25)",
        "Увеличивает урон и уменьшает перезарядку.",
        "Применяет дебафф к врагам с иммунитетом к заклинаниям. Не наносит урон врагам с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Отравлять обидчиков пагубным ядом — обычное дело для обитателей Кислотных джунглей; Лисейл помог этому бедствию выйти за пределы острова Джиди."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 19.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 3.2,
    "attrAgility": 26.0
  },
  "description": "Venomancer — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Venomous Gale, выплевывает ядовитый шар, который отравляет врагов, в результате чего они получают как мгновенный, так и периодический урон, а их скорость передвижения и атаки снижается. Пассивная способность, Poison Sting, добавляет к обычным атакам яд, который снижает скорость передвижения. Вторая способность, Plague Ward, призывает Plague Ward, атакующий вражеских существ и сооружения. Вард получает текущий уровень вашей способности Poison Sting, нанося 50% от полного урона. Ультимативная способность, Poison Nova, рассеивает вокруг себя кольцо яда, постепенно наносящего урон. Эффект этой способности не может опустить здоровье существа ниже единицы. Улучшение с Aghanim's Scepter увеличивает урон и длительность, а также уменьшает время перезарядки ультимативной способности.",
  "history": "В Кислотных джунглях острова Джиди всякая ползучая, летучая или ходячая тварь содержит в себе яд — он бурлит в венах и пузырится в желудках, и ядовитые звери прыгают с одного токсичного дерева на другое по лианам брызжущим разъедающей кислотой. Но даже во всём этом ядовитом безумии одно существо считается гораздо опаснее всех местных обитателей. Много лет назад залив Фраджи на своей лодчонке пересёк травник по имени Лисейл. Он прибыл на опасный остров в поисках полезных экстрактов, добываемых из корней и коры местной флоры, но нашёл лишь жестокую судьбу. Зайдя на десять километров вглубь джунглей, Лисейл набрёл на искомый эпифит. Только растение оказалось замаскированным ящером, который сразу укусил потянувшуюся к нему руку. Травник отчаянно бросился делать из местных растений антидот, благо знаний хватало: нужно лишь смешать яд свежезадушенной рептилии с нектаром броненосной орхидеи. За считанные мгновения до полного паралича Лисейл ввел себе антидот через шип орхидеи и впал в кому. Семнадцать лет спустя что-то зашевелилось под многолетним слоем перегноя — но то был уже не травник Лисейл. То был Лисейл-смертоносец, веномант. Его сознание хоть и сохранилось, но необратимо исказилось, а старая плоть перегнила в новую материю — живую ткань, в которой смешались яд той рептилии и токсичная оболочка броненосной орхидеи. Так родился новый повелитель Кислотных джунглей, которого в скором времени уважали и боялись даже самые свирепые хищники. Но небольшой остров оказался недостаточно велик для веноманта — отголоски человеческих страстей повели Лисейла прочь, на поиски новых смертоносных токсинов и достойных жертв.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Здоровье\/урон чумных тотемов больше в 2,6 раза",
      "talentRight": "+640 к радиусу Poison Nova"
    },
    {
      "talentLvl": "20",
      "talentLeft": "–1,5 сек. перезарядки Plague Ward",
      "talentRight": "+5 сек. действия Poison Nova"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+8% замедления от Poison Sting",
      "talentRight": "+12% к вампиризму заклинаниями"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+100 к дальности атаки",
      "talentRight": "-6 сек. перезарядки Venomous Gale"
    }
  ]
}