{"abilities":[{"spell":"Summons a rising torrent that, after a short delay, hurls enemy units into the sky, stunning, dealing damage and slowing movement speed.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The total delay is 2 seconds at all levels (cast time + effect delay).","Torrent can be cast without having to face towards the targeted area.","Units tossed in the air are stunned and still able to be attacked.","While in the air, other units may pass below hit airborne units.","The stun and slow are applied at the same time, so overall, the slow lasts for 3.35\/4.1\/4.85\/5.6 seconds.","The knockup itself lasts 1.53 seconds, so hit units are on the ground for the remaining 0.07 seconds of the stun.","After casting, a visual effect appears at the targeted area and a sound effect plays for the delay period. These effects are visible and audible to allies only.","Deals 9.375\/18.75\/28.125\/37.5 ( 24.375\/33.75\/43.125\/52.5) damage in 0.2 second intervals, starting 0.2 seconds after the effect delay, resulting in 8 damage instances.","Provides 350 radius ground vision over the targeted area upon cast for 3.13 seconds."],"mana":"90\/100\/110\/120","elements":["Does not pierce spell immunity."],"cooldown":"16\/14\/12\/10","name":"Torrent","description":["Cast Animation: 0.4+0","Cast Range: 1500","Effect Radius: 225 ( 325)","Effect Delay: 1.6","Total Damage: 75\/150\/225\/300 ( 195\/270\/345\/420)","Move Speed Slow: 35%","Slow Duration: 1.75\/2.5\/3.25\/4","Stun Duration: 1.6","Knockup Duration: 1.53"],"hot_key":"Q","legacy_key":"E"},{"spell":"Kunkka's legendary sword grants increased damage and cleaves a large area of effect in front of him for a single strike.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Physical"],"notes":["Upon leveling Tidebringer the first time, it has autocast active by default.","Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","The complete area is shaped like an isosceles trapezoid in front of Kunkka.","Battle Fury's and Quelling Blade's Quell fully work for Kunkka, with and without Tidebringer.","Fully stacks with other sources of cleave. Each source of cleave is completely independent.","The particle effects on hit enemies are visible on invisible enemies and through the Fog of War.","Cannot target allied units, but applies the bonus damage when attacking while on autocast and off cooldown, without cleaving or going on cooldown.","Does not work against wards and buildings.","Plays an audio effect (only heard by Kunkka) when going off cooldown.","Shows a visual effect on the sword whenever it is ready (visible to allies and enemies)."],"mana":"0","elements":["Cannot be used by illusions.","Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"13\/10\/7\/4","name":"Tidebringer","description":["Cast Range: 150","Starting Radius: 150","Distance: 650\/800\/950\/1100","End Radius: 500\/550\/600\/650","Cleave Damage: 165% ( 225%)","Attack Damage Bonus: 25\/50\/75\/100"],"hot_key":"W","legacy_key":"D"},{"spell":"Targets a friendly or enemy Hero, marks their position with an X, and returns them to it after several seconds. Kunkka can trigger the return at any time during the duration. Lasts twice as long on allied heroes.","effects":["Ability Target Unit","Affects Enemy Heroes \/ Allied Heroes"],"notes":["The target is given a stop command as soon as it is teleported back, effectively canceling channeling spells.","Does not disjoint projectiles for the target upon getting teleported back.","Marks the target's current location with a red X. This X is visible to enemies only when they have vision over the unit, or the X itself.","The affected unit leaves behind a red dotted line while walking, showing which direction it went. These lines stop drawing for the enemies if the unit is not visible. However, already drawn lines stay visible. Once the unit turns visible again, a straight line of red lines is drawn towards their last known location. These red lines ignore the actual path the unit took. They simply draw from its current to its previously last known location.","Multiple instances of X Marks the Spot on the same target do not stack. Only the duration gets visually refreshed. Although refreshed, the return timer is unaffected, so that the unit still returns based on the first cast. Every cast creates its own X below the target. If the modifier expires, it returns to the X of the first cast. If any of the casters use the Return sub-spell, the unit returns to the X that caster created. Once the unit returned to any of the X's, all other instances get completely canceled, although not visually.","Despite the visual effects, the target does not return to the X after dying and respawning during it.","When the target is invulnerable, it does not get returned to the X, causing the spell to get wasted.","Provides 300 radius ground vision around the X mark for 5.94 seconds."],"mana":"50","elements":["Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"26\/20\/14\/8","name":"X Marks the Spot","description":["Cast Animation: 0.4+0","Cast Range: 400\/600\/800\/1000","Enemy Duration: 4","Allies Duration: 8"],"hot_key":"E","legacy_key":"X"},{"spell":"Returns the marked hero to the X.","effects":["Ability No Target","Affects Enemy Heroes \/ Allied Heroes"],"notes":["Replaces X Marks the Spot until the X disappears on the target.","Despite being a sub-spell, Return does proc all on-cast effects like a regular spell."],"mana":"0","elements":["Partially pierces spell immunity."],"cooldown":"1","name":"Return","description":["Cast Animation: 0.4+0"],"hot_key":"E","legacy_key":"X"},{"spell":"Summons a ghostly ship that sails through the battle before smashing apart, damaging and stunning all enemies caught near the wreckage. Allied heroes touched by the Ghostship are given a swig of The Admiral's Rum, receiving bonus movement speed and a delayed reaction to incoming damage.","effects":["Ability Target Point","Affects Enemies \/ Allied Heroes","Damage Magical"],"notes":["Ghostship travels at a speed of 650, reaching the crash site in 3.08 ( 1.54) seconds.","The ship spawns 2000 range away from the targeted point, from the opposite direction where Kunkka is facing, and crashes at the targeted point. When having Aghanim's Scepter, the ship spawns on Kunkka's location and travels 1000 range towards the targeted direction. This means when not upgraded, the targeting determines the ship direction and crash location, but when upgraded, the targeting only determines the ship direction.","The ship first applies the damage, then the debuff.","A visual indicator appears at the location, showing the ship's destination point and radius. The indicator is only visible to allies.","The Ghost Ship Damage Absorb buff applies to allied heroes that come within 425 range of the ship at any time during its travel.","Once the absorb buff expires, the Ghost Ship Damage Delay buff is placed, which lasts 10 seconds. This buff deals 5% of the previously reduced damage as damage in 1 second intervals until all the reduced damage is returned.","The delayed damage dealt after the Rum wears off is flagged as HP Removal. It does not interact with any on-damage effects. Therefore, the delayed damage cannot be avoided by anything. However, it is not lethal.","The Rum does not reduce damage for units under the effect of any damage negating effect.","Rums from multiple casts do not stack, but refresh the duration instead. This delays the Rum wear-off buff.","The Rum buff and Rum hangover buff do not interact with each other when having both (by recasting while having the hangover buff).","The ship provides 300 radius flying vision around itself as it travels. This vision does not last.","When having Aghanim's Scepter, the ship pulls enemy heroes along its travel path towards the crash site. Any enemy hero that gets within 200 radius of the ship gets the Ghost Ship Loaded debuff. This debuff prevents the hero from getting re-affected by the cast, unless it dies, respawns and gets within range again. Together with the loaded debuff, it also receives the Ghost Ship Knockback debuff, which drags the hero along with the ship. The hero gets dragged to the center of the ship and along with it towards the crash site. The drag does not disable units. They can still turn, attack and use items. Channeling abilities or items are not interrupted by it. Only heroes are dragged (including illusions). Non-hero units are not affected by the drag. Treats creep-heroes as creeps. Any tree within a 100 radius of the dragged heroes gets destroyed during the drag.","When choosing the fleet talent on level 25, 3 ships spawn at the same location, traveling towards the same destination. The ships spawn in 2.8 second intervals, starting immediately on cast, so that the last ship spawns 5.6 seconds after cast. The ships's spawn location is set upon cast and does not adapt to the caster's current position as they spawn. Acquiring Aghanim's Scepter during the fleet upgrades the not-yet-spawned ships, so that they spawn closer to the destination point and drag enemy heroes along."],"mana":"125\/175\/225","elements":["Cannot be used by illusions.","Partially pierces spell immunity."],"cooldown":"60\/50\/40","name":"Ghostship","description":["Cast Animation: 0.3+0","Cast Range: 1000","Ship Radius: 425","Drag Radius: 0 ( 200)","Travel Distance: 2000 ( 1000)","Number of Ships: 1 ( 3)","Ship Spawn Interval: 2.8","Impact Damage: 400\/500\/600","Rum Move Speed Bonus: 10%","Rum Damage Reduction: 40%\/45%\/50%","Rum Duration: 10","Rum Hangover Duration: 10","Stun Duration: 1.4"],"hot_key":"R","legacy_key":"T"}],"bio":"As Admiral of the mighty Claddish Navy, Kunkka was charged with protecting the isles of his homeland when the Demons of the Cataract made a concerted grab at the lands of men. After years of small sorties, and increasingly bold and devastating attacks, the Demon Fleet flung all its carnivorous ships at the Trembling Isle. Desperate, the Suicide-Mages of Cladd committed their ultimate rite, summoning a host of ancestral spirits to protect the fleet. Against the Demons, this was just barely enough to turn the tide. As Kunkka watched the Demons take his ships down one by one, he had the satisfaction of wearing away their fleet with his ancestral magic. But at the battle's peak, something in the clash of demons, men and atavistic spirits must have stirred a fourth power that had been slumbering in the depths. The waves rose up in towering spouts around the few remaining ships, and Maelrawn the Tentacular appeared amid the fray. His tendrils wove among the ships, drawing demon and human craft together, churning the water and wind into a raging chaos. What happened in the crucible of that storm, none may truly say. The Cataract roars off into the void, deserted by its former denizens. Kunkka is now Admiral of but one ship, a ghostly rig which endlessly replays the final seconds of its destruction. Whether he died in that crash is anyone's guess. Not even Tidehunter, who summoned Maelrawn, knows for sure.","talentsTips":["The armor talent does not benefit illusions.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The strength talent effectively grants Kunkka 500 health, 2.5 health regen, 2% magic resistance and 25 attack damage."],"trivia":["Kunkka was named in honour of the artist who made numerous pieces of loading screen art for DotA and Dota 2.","Kunkka's official alternate\/fun names were \"Daelin Proudmoore\", \"CoCo\", and \"Captain Obvious\". Daelin Proudmoore was a campaign boss in Warcraft III: The Frozen Throne; his hero model is borrowed by Kunkka in DotA.","In his DotA biography, it is stated that some people called him \"Jack Sparrow,\" but it was never seen as his name in-game. Jack Sparrow is the name of the main character in the Pirates of the Carribean movie franchise.","His rival hero taunts against Slardar, Death Prophet, and Doom, and his allied lines for Windranger and Ancient Apparition, all come from Samuel Taylor Coleridge's poem, The Rime of the Ancient Mariner.","His battle begin line \"Rough seas ahead, crew. Strap me to the mizzen when I give the word.\" is likely a reference to The Odyssey, where Odysseus commands his crew to strap him to the mast so he could hear the Sirens sing."],"talents":["+60% Tidebringer Cleave:Ghostship Fleet","+25 Strength:+100 Torrent AoE","+120 Torrent Damage:+12 Health Regen","+6 Armor:+40 Damage"],"desc":"Kunkka, the Admiral, is a versatile melee strength hero built with an arsenal of powerful area-of-effect (AoE) spells. Two of his active spells are nukes that have long delay times, but can disable and disrupt the enemies' position. He is mostly played as a carry, initiator, or even as a ganking support. Kunkka is known for his Tidebringer sword, giving him the ability to cleave a large area around him with heavy potential damage on his next attack, which refreshes at a given period of time. Torrent calls upon the element of water to rise and burst out, dealing damage, disabling them up high, and slowing them on impact. There's a delay on this ability before it activates, so Kunkka must be wise in using this ability. X Marks the Spot targets any hero or Kunkka himself to be marked on their current position, and after a given time delay, instantly returns to the marked spot. Useful in setting up tricky spells, escape prevention, or even saving allies, X Marks the Spot makes the Admiral a great battle strategist. His ultimate lets him summon a Ghostship, which travels on ground, until it crashes a set distance away, stunning and damaging enemies on that location – potentially crippling the enemy team. The Ghostship also bolsters allies with Kunkka's Rum, granting them bonus movement speed and temporary numbness to damage. Capable of inflicting high burst damage with his spells, controlling their position while being able to survive the mayhem when his spells are used properly, Kunkka is a mighty offensive team fighter, built with strong physical and magical damage output, who can indeed turn the tide of a battle."}