{"abilities":[{"spell":"После небольшой задержки создаёт мощный поток воды, который подбрасывает врагов в воздух, оглушает их, наносит урон, а затем снижает скорость их передвижения.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Общая задержка на всех уровнях составляет 2","Torrent можно использовать, не поворачиваясь в сторону выбранной области.","Подброшенные в воздух юниты оглушаются и их всё так же можно атаковать.","Когда юниты в воздухе, остальные юниты могут под ними проходить","Оглушение и замедление применяются одновременно, в итоге замедление будет длится 3.35\/4.1\/4.85\/5.6 секунд.","Само подбрасывание длится 1.53 секунды, поэтому пораженные юниты будут находится на земле оставшиеся 0.07 секунды оглушения.","После применения в выбранной области появляется визуальных эффект, а во время задержки проигрывается звуковой эффект. Эти эффекты видны и слышны только союзникам.","Наносит 9.375\/18.75\/28.125\/37.5 урона с интервалом в 0,2 секунды спустя 0,2 секунды после задержки, срабатывая 8 раз.","При использовании дает наземный обзор в радиусе 350 единиц в выбранной области на 3,13 секунды."],"mana":"90\/100\/110\/120","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/14\/12\/10","name":"Torrent","description":["Анимация применения: 0,4+0","Дальность применения: 1500","Радиус: 225 ( 325)","Задержка: 1.6","Урон: 75\/150\/225\/300 ( 195\/270\/345\/420)","Замедление скорости передвижения: 35%","Длительность замедления: 1.75\/2.5\/3.25\/4","Длительность оглушения: 1.6","Длительность подбрасывания: 1.53"],"hot_key":"Q","legacy_key":"E"},{"spell":"Своим легендарным мечом адмирал бьёт врагов в большой площади перед собой, нанося увеличенный урон.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Физический"],"notes":["При изучении Tidebringer способность по умолчанию включает автоприменение.","Прорубающий урон нельзя усилить с помощью усиления урона заклинаний и он не может использовать вампиризм заклинаний.","Прорубающий урон уменьшается блокировкой урона.","Область поражения выглядит как равнобедренная трапеция, исходящая от героя.","В отличии от других источников прорубания, прорубающий урон Tidebringer не увеличивается Quell Battle Fury. На обычные атаки Kunkka также не действует Quell, если только изученная Tidebringer не поставлена на автоприменение и не находится на перезарядке. Quell от Quelling Blade действует на атаки Kunkka как с, так и без Tidebringer.","Сочетается с другими источниками прорубания. Каждый источник действует независимо от другого.","Эффекты частиц на пораженных врагах видны на невидимых врагах и врагах в тумане войны.","Не действует на варды и строения.","При завершении перезарядки проигрывает звуковой эффект (слышимый только Kunkka).","При готовности на мече отображается визуальный эффект (видимый и союзникам, и врагам)."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"13\/10\/7\/4","name":"Tidebringer","description":["Дальность применения: 150","Начальный радиус: 150","Дистанция: 650\/800\/950\/1100","Конечный радиус: 500\/550\/600\/650","Прорубающий урон: 165% ( 225%)","Дополнительный урон: 25\/50\/75\/100"],"hot_key":"W","legacy_key":"D"},{"spell":"Помечает место расположения дружественного или вражеского героя крестом и через несколько секунд или по нажатию кнопки возвращает его на это самое место. На союзниках длится вдвое дольше.","effects":["Способность Направленная на юнита","Действует на Вражеских героев \/ Союзных героев"],"notes":["При возврате цель получает команду \"стоп\", которая отменяет произносимые заклинания. При этом поставленные в очередь команды не отменяются.","Отмечает текущее положение цели красной X. Отметка видна врагам только если у них есть обзор на юнита или на сам крест.","Помеченный юнит при движении оставляет за собой красную пунктирную линию, показывая направление движения. Линия не отображается для врагов, если юнита не видно. При этом уже нарисованная линия отображаться будет. Как только юнит становится видимым, то линия немедленно рисует путь до последнего известного положения. В этом случае линия игнорирует пройденный юнитом путь. Она просто проводит прямую от последнего известного до текущего расположения.","Несколько использований X Marks the Spot на одну и ту же цель не складываются. Длительность способности обновляется лишь визуально. Обновление не влияет на таймер возврата, поэтому возврат юнита основывается на первом применении. Каждое использование создает под целью отдельный крест. Если у модификатора завершается длительность, то возврат произойдет к первому. Если любой из заклинателей использует вспомогательное заклинание Return, то возврат произойдет к созданной им отметке. Как только происходит возврат к любой отметке, то все остальные применения отменяются, хоть визуально это и не отображается.","Вопреки визуальным эффектам цель под действием способности не возвращается к кресту после смерти и воскрешения.","Если цель неуязвима, то возврат не произойдет, а способность уйдет на перезарядку.","Дает наземный обзор в радиусе 300 единиц вокруг креста на 5,94 секунды."],"mana":"50","elements":["Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"26\/20\/14\/8","name":"X Marks the Spot","description":["Анимация применения: 0,4+0","Дальность применения: 400\/600\/800\/1000","Длительность на противниках: 4","Длительность на союзниках: 8"],"hot_key":"E","legacy_key":"X"},{"spell":"Возвращает выбранного героя к кресту.","effects":["Способность Ненаправленная","Действует на Вражеских героев \/ Союзных героев"],"notes":["Заменяет X Marks the Spot до исчезновения креста под целью.","Несмотря на то, что эта способность - вспомогательная, на неё, как и на обычное заклинание, срабатывают все эффекты, реагирующие на заклинания."],"mana":"0","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"1","name":"Return","description":["Анимация применения: 0,4+0"],"hot_key":"E","legacy_key":"X"},{"spell":"Вызывает призрачный корабль, который прорывается сквозь битву и разбивается, оглушая врагов и нанося им урон. Все союзники, задетые кораблем, оказываются под ливнем рома, получая дополнительную скорость передвижения и замедленную реакцию на урон.","effects":["Способность Направленная на точку","Действует на Врагов \/ Союзных героев","Урон Магический"],"notes":["Корабль движется со скоростью 650 единиц, достигая места крушения за 3.08 ( 1.54) секунд.","Корабль появляется позади Kunkka в 2000 единиц от выбранной точки и распадается в ней. С Aghanim's Scepter корабль появляется на месте Kunkka и движется 1000 единиц в выбранном направлении. То есть без улучшения выбор точки определяет направление и место крушения, а улучшение - только направление.","Корабль сначала наносит урон, затем применяет дебафф.","В выбранной точке появляется визуальный индикатор, отображающий пункт назначения корабля и радиус. Индикатор виден только союзникам.","Бафф Ghost Ship Damage Absorb применяется к союзным героям, оказавшимся в любой момент на пути корабля на расстоянии в 425 единиц. Бафф наносит 5% от сниженного ранее урона с интервалом в 1 секунду до возврата всего сниженного урона.","Отложенный урон, наносимый после завершения эффекта \"Похмелье от рома\", помечен как отнимающий здоровье. Он не взаимодействует с эффектами, реагирующими на урон. Отложенный урон никак нельзя избежать. При этом он не может быть смертельным.","Ром не уменьшает урон для юнитов под действием эффекта от любого источника отрицания урона.","Бафф от нескольких использований не складывается, но обновляет длительность и откладывает нанесение урона.","Одновременно действующие баффы \"Адмиральский ром\" и \"Похмелье от рома\" не взаимодействуют друг с другом.","Корабль дает вокруг себя летающий обзор в радиусе 300 в момент движения.","C Aghanim's Scepter корабль притягивает вражеских героев на пути к месту крушения. Любой вражеский герой в радиусе 200 единиц от корабля получает дебафф Ghost Ship Loaded. Этот дебафф предотвращает повторное попадание героя под использование способности, если только он не умрет, воскреснет и снова окажется в радиусе действия. Вместе с дебаффом \"Все на борт!\" герой также получает дебафф Ghost Ship Knockback, который утягивает его вместе с кораблем. Героя притягивается в центр корабля и остается там до его крушения. Перетаскивание не обезвреживает юнитов. Они могут поворачиваться, атаковать и использовать предметы. Произносимые способности и предметы не прерываются. Корабль тащит только героев (включая иллюзии). На юнитов не-героев перетаскивание не действует. Считает крипов-героев за крипов. Деревья в радиусе 100 единиц от захваченных героев во время движения корабля разрушаются.","При выборе таланта 25-го уровня на флот кораблей, 3 корабля появляются в одной и той же месте и движутся в одну и ту же точку. Корабли появляются с интервалом в 2.8 секунды сразу после применения, так что все корабли появятся за 5.6 секунд. Место появления кораблей устанавливается при применении и не адаптируется под текущую позицию заклинателя. Получение Aghanim's Scepter во время призыва флота действует только на непоявившиеся корабли, поэтому они будут появлять уже ближе к месту крушения и захватывать вражеских героев."],"mana":"125\/175\/225","elements":["Не может использоваться иллюзиями.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"60\/50\/40","name":"Ghostship","description":["Анимация применения: 0,3+0","Дальность применения: 1000","Радиус корабля: 425","Радиус захвата: 0 ( 200)","Дистанция прохождения: 2000 ( 1000)","Число кораблей: 1 ( 3)","Интервал появления кораблей: 2.8","Урон: 400\/500\/600","Ускорение передвижения: 10%","Уменьшение урона: 40%\/45%\/50%","Длительность эффекта: 10","Длительность оглушения: 1.4"],"hot_key":"R","legacy_key":"T"}],"bio":"Адмирала могущественного кладдского флота Кункку отправили защищать родные острова, когда демоны Катаракты объединились и начали захватывать земли людей. Несколько лет гремели небольшие стычки, перераставшие в смелые и масштабные нападения, и вот весь флот кровожадных демонов направился к Дрожащему острову. В отчаянии маги-фаталисты Кладда провели свой последний ритуал, отдав свои жизни и призвав тысячи древних духов на защиту своего флота, но даже это едва ли изменило течение битвы. Пока кладдские корабли тонули один за другим, адмирал отдувался на вражеских — топя судна магией своих предков. Однако в разгаре битвы между людьми, демонами и призраками далекого прошлого что-то подняло с глубин доселе дремавшую четвёртую силу. Морские потоки взмыли над немногими целыми кораблями, и в сердце боя появился Мэльрон Щупальцеликий. Его склизкие конечности расшвыривали корабли, разбивая кладдские фрегаты о судна Катаракты и смешивая волны и потоки ветра в бушующий хаос. Никто не может точно сказать, чем закончилось то столкновение. Катаракта с демоническими воплями затянулась обратно в пустоту, брошенная своими обитателями. Кункка же стал адмиралом, чей флот — единственное призрачное судно, которое бесконечно повторяет последние секунды своей жизни. Но пережил ли ту бурю сам адмирал? Этого не знает даже Левиафан — тот, кто призвал Мэльрона.","talentsTips":["Талант на броню не дается иллюзиям.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на силу в общем даёт Kunkka: 500"],"trivia":["Альтернативно-шутливые имена Kunkka -\"CoCo\", \"Daelin Proudmoore\" и \"Captain Obvious\". В русский версии, известен как Капитан Очевидность.","В первоначальной биографии героя упоминалось что иногда люди звали его \"Jack Sparrow\", прямо как капитана из известного кино-фентези \"Pirates of the Caribbean\", но в игре это имя не встречается.","Герой был назван в честь художника под ником Kunkka, сделавшего экраны загрузки карты DotA.","Реплика при убийстве Windranger Играть \"Sweetly sweetly blew the breeze, on me alone it blew\" является отсылкой на поэму английского поэта Сэмюэла Колриджа \"Сказание о старом мореходе\"."],"talents":["+60% к прорубающему урону у Tidebringer:Флот призрачных кораблей от Ghostship","+25 к силе:+100 к радиусу Torrent","+120 к урону от Torrent:+12 здоровья в секунду","+6 к броне:+40 к урону"],"tips":["Tidebringer — одна из основных ваших способностей, ее следует изучить до максимума как можно быстрее. Старайтесь как можно больше увеличить свой урон, тогда Tidebringer будет наносить больше повреждений.","С помощью Torrent можно инициировать сражение или обезвредить врагов если понадобится.","Если вас окружили или зажали в деревьях так, что вы не можете выбраться, используйте Torrent на врагов, и пройдите под ними, пока они находятся в воздухе. Часть урона наносится сразу при срабатывании, оставшаяся часть наносится в течении некоторого времени, пока подброшенные существа находятся в воздухе. Оглушает на 1.53 секунды на всех уровнях.","X Marks the Spot поможет попасть Torrent, если у вас есть трудности с прицеливанием. Так же прокачанный на 2 X Marks the Spot будет гарантировать попадание Torrent, так что подумайте о прокачке его на 3 и 4.","Ghostship ненадолго откладывает половину урона нанесенного союзникам и отлично подходит для коротких стычек. Отображается индикатор, отображающий союзникам зону поражения корабля. Корабль движется со скоростью 650 единиц.","На линии лучше стоять в паре с другими героями ганкерами или support-героями вроде Crystal Maiden или Vengeful Spirit. Их способности позволят проворачивать комбинации с вашим Torrent убивая или отгоняя врагов.","Если видите, что враги собрались в группу, то спровоцируйте драку своей связкой Torrent + Ghostship. Или если драка уже началась выберите подходящий момент для использования способностей.","Можете использовать X Marks the Spot на себя и применить Town Portal Scroll для перемещения к фонтану. Находясь на базе, вы можете восстановить здоровье, забрать предметы, заполнить Bottle и по истечении времени действия способности вернетесь назад.","Ghostship всегда появляется на фиксированном расстоянии за спиной у героя и имеет фиксированное расстояния движения. Расстояние и место куда врежется корабль можно увидеть наведя курсор на способность."],"desc":"Kunkka — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Torrent, создает мощный поток воды, который подбрасывает врагов в небо, оглушает их, а затем наносит урон и снижает скорость их передвижения. Пассивная способность, Tidebringer, увеличивает урон героя на один удар и рубит врагов на большой площади перед ним. Вторая способность, X Marks the Spot, помечает место расположения дружественного или вражеского героя крестом и через несколько секунд или по нажатию Return возвращает его на это самое место. Ультимативная способность, Ghostship, вызывает призрачный корабль, который прорывается сквозь битву, а затем разбивается, оглушает вражеских юнитов и наносит им урон. Все союзники, задетые кораблем, оказываются под ливнем рома, получая дополнительную скорость передвижения и сопротивление к 50% урона."}