{"abilities":[{"spell":"Phoenix несется вперед по дуге, замедляя всех врагов на своем пути и нанося им урон, а затем возвращается на исходную позицию. Если Phoenix применяет Supernova, то способность прерывается.","effects":["Способность Направленная на точку","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Расход в 15% от текущего здоровья относится к способностям, отнимающим здоровье.","Phoenix летит по траектории эллипса, который вытянут по длине на 1400 ( 2800) и по ширине на 500. В итоге полное прохождение пути составляет 3154.41 ( 5834.85) единиц, которое Phoenix пересекает за 2 ( 3) секунды. То есть, Phoenix летит со средней скоростью в 1577.21 ( 2917.43) единиц. Скорость полета не имеет фиксированного значения. Phoenix начинает полет со скоростью в 0 единиц, ускоряясь до достижения половины максимального расстояния, затем замедляется при достижении максимального расстояния, и затем повторяет эти действия на обратном пути.","Phoenix всегда начинает полет по часовой стрелке, поражая юнитов сначала с левой стороны. Юниты, находящиеся ровно в середине арки, образованной эллипсом, не получают урон.","Способность можно прервать, если герой получил оглушение, попал в ураган, был проклят, усыплен или на него воздействовал один из источников принудительного движения. Оцепенение и провокация полет не прерывают.","Phoenix может атаковать, использовать способности и предметы при полете (включая произносимые способности).","В момент полета Phoenix не нужно поворачиваться для использование направленных способностей или предметов.","Способность наносит урон с интервалами в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 4 раз.","Может нанести до 40\/120\/200\/280 единиц урона в одиночного юнита (до учета сопротивления)."],"mana":"0","elements":["Нельзя применять в оцепенении.","Блокируется иммунитетом к заклинаниям."],"cooldown":"36","name":"Icarus Dive","description":["Анимация применения: 0,2+0","Дальность применения: Глобальная","Расход своего здоровья: 15%","Радиус: 200","Дальность полета: 1400 ( 2800)","Ширина: 500","Продолжительность полета: 2 ( 3)","Урон в секунду: 10\/30\/50\/70","Замедление скорости передвижения: 19%\/22%\/25%\/28%","Длительность замедления и урона: 4"],"hot_key":"Q","legacy_key":"D"},{"spell":"Мгновенно прерывает полет.","effects":["Способность Ненаправленная"],"notes":["Заменяет Icarus Dive до окончания полета.","При использовании прерывает произносимые Phoenix способности."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Stop Icarus Dive","description":["Анимация применения: 0+0"],"hot_key":"Q","legacy_key":"D"},{"spell":"Призывает 4 огненных духа, которые кружатся вокруг героя. Каждого из них по отдельности можно выпустить в указанную точку. Долетев до неё, дух подожжёт всех противников вокруг себя, нанося им периодический урон и уменьшая их скорость атаки.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Расход в 20% от текущего здоровья относится к способностям, отнимающим здоровье.","При использовании прерывает произносимые Phoenix способности.","Горение, вызываемое духами, не складывается. Попадание по одним и тем же юнитам несколько раз просто обновит время действия дебаффа.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 4 раз.","Каждый дух может нанести до 80\/160\/240\/320 ( 240\/320\/400\/480) единиц урона одиночному юниту (до учета сопротивления). Все духи вместе могут нанести до 320\/640\/960\/1280 ( 960\/1280\/1600\/1920) единиц урона одиночному юниту (до учета сопротивления)."],"mana":"80\/90\/100\/110","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"45\/40\/35\/30","name":"Fire Spirits","description":["Анимация применения: 0,01+0","Расход своего здоровья: 20%","Радиус: 175","Урон в секунду: 20\/40\/60\/80 ( 60\/80\/100\/120)","Замедление скорости атаки: 80\/100\/120\/140","Длительность замедления и урона: 4","Длительность духов: 20"],"hot_key":"W","legacy_key":"F"},{"spell":"Каждого духа можно выпустить независимо от других в указанную область. При столкновении с врагами он наносит им периодический урон и значительно снижает скорость атаки. Дает обзор места попадания на 1 секунду.","effects":["Способность Направленная на область"],"notes":["Заменяет Fire Spirits до того, пока все духи не будут выпущены.","Запущенные духи движутся к цели со скоростью 900.","Можно запускать духов в любую сторону без необходимости разворота в ту сторону Phoenix, пока действуют Icarus Dive и Sun Ray.","Fire Spirits дают наземный обзор в радиусе 175 единиц на 1 секунду после попадания на выбранную область."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Launch Fire Spirit","description":["Анимация применения: 0,01+0","Дальность применения: 1400"],"hot_key":"W","legacy_key":"F"},{"spell":"Phoenix использует силу внутреннего огня и выпускает огромный луч света за счет собственной жизненной энергии. Луч наносит урон врагам, отнимает часть их здоровья и исцеляет союзников на половину этого значения. Пока луч горит, урон от него возрастает вплоть до двойного.","effects":["Способность Направленная на точку","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Расход в 6% в секунду от текущего здоровья относится к способностям, отнимающим здоровье. Тратит 1.2% от текущего здоровья с интервалом в 0,2 секунды спустя 0,2 секунды после применения, в итоге тратя здоровье 30 раз за 6 секунд. В итоге общий расход здоровья составляет 30.38% от базового текущего уровня здоровья Phoenix за полные 6 секунд применения.","Для лучшего понимания скорость поворот при использовании Sun Ray определяется как градусы в секунду, а не в радиантах за 0,03 секунды. 25 градусов в секунду эквивалентно скорости поворота в 0.013.","Дает наземный обзор в 175 единиц по всей длине луча на все время действия.","Способность можно прервать, если Phoenix получил оглушение, безмолвие, попал в ураган, был проклят или усыплен. Оцепенение и принудительное движение способность не прерывают.","Duel и Savage Roar могут прервать способность, но при этом провокация от Berserker's Call и Winter's Curse этого не делает. Но при этом, пока действует провокация, Phoenix не может менять свое положение с помощью Toggle Movement или вручную прервать действие с помощью Stop Sun Ray.","Sun Ray устанавливает скорость передвижения Phoenix равной 0 (имеет приоритет над ускорением) и обезоруживает на все время действия, поэтому герой не может двигаться или атаковать.","Phoenix может использовать предметы и способности, пока действует Sun Ray(включая произносимые способности). Применение Icarus Dive также не прервет способность.","Пока действует Sun Ray, Phoenix не нужно поворачиваться для использование направленных способностей или предметов.","Sun Ray неактивен, пока длится полет от Icarus Dive, поэтому его нельзя использовать в полете.","Наносит урон или лечит с интервалом в 0,2 секунды спустя 0,2 секунды после применения, нанося или излечивая 30 единиц каждому юниту. Изначально луч наносит 14\/20\/26\/32 + 1.5%\/3.25%\/5%\/6.75% ( 3.5%\/5.25%\/7%\/8.75%) от максимального здоровья юнитов под действием способности в качестве урона в секунду. За каждые прошедшие 0,02 секунды урон увеличивается на 0.467\/0.667\/0.867\/1.067 + 0.1%\/0.1%\/0.2%\/0.2% ( 0.1%\/0.2%\/0.2%\/0.3%) от их максимального здоровья. За 6 секунд урон составит 28\/40\/52\/64 + 3%\/6.5%\/10%\/13.5% ( 7%\/10.5%\/14%\/17.5%) от их максимального запаса здоровья в секунду. И на этом луч закончится. Изначально луч излечивает 7\/10\/13\/16 + 0.625%\/1.25%\/1.875%\/2.5% от максимального запаса здоровья юнитов под действием способности в секунду. За каждые прошедшие 0,2 секунды лечение увеличивается на 0.233\/0.333\/0.433\/0.533 + 0%\/0%\/0.1%\/0.1% от их максимального здоровья. За 6 секунд лечение составит 14\/20\/26\/32 + 1.25%\/2.5%\/3.75%\/5% от их максимального здоровья в секунду. И на этом луч закончится.","Может нанести до 126\/180\/234\/288 + 13.5%\/29.25%\/45%\/60.75% ( 31.5%\/47.25%\/63%\/78.75%) от максимального запаса здоровья в качестве урон, если на врага способность действовала все время.","Может вылечить до 63\/90\/117\/144 + 5.625%\/11.25%\/16.875%\/22.5% от максимального запаса здоровья в случае, если союзник оставался под лучом все время действия.","Не работает на курьеров."],"mana":"100","elements":["Нельзя применять в оцепенении.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"26","name":"Sun Ray","description":["Анимация применения: 0,01+0,5","Дальность применения: 1300","Расход своего здоровья в секунду: 6%","Длина луча: 1250","Ширина луча: 130","Базовый урон в секунду: 14\/20\/26\/32","Макс. здоровья в урон в секунду: 1.5%\/3.25%\/5%\/6.75% ( 3.5%\/5.25%\/7%\/8.75%)","Базовое лечение в секунду: 7\/10\/13\/16","Здоровье в лечение в секунду: 0.625%\/1.25%\/1.875%\/2.5%","Скорость поворота в градусах в секунду: 25","Длительность луча: 6"],"hot_key":"E","legacy_key":"R"},{"spell":"Включает медленное передвижение вперед во время действия Sun Ray.","effects":["Способность Переключаемая","Действует на Себя"],"notes":["Эта способность становится активна только при наличии действуещего баффа от Sun Ray.","При использовании прерывает произносимые Phoenix способности.","Phoenix движется в сторону луча с фиксированной скоростью в 250 единиц. Замедление и эффекты, влияющие на скорость передвижения, никак не влияют на неё.","Phoenix может проходить через преграды и разрушать деревья на своем пути."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Toggle Movement","description":["Анимация применения: 0+0"],"hot_key":"D","legacy_key":"E"},{"spell":"Немедленно останавливает Sun Ray.","effects":["Способность Ненаправленная"],"notes":["Заменяет Sun Ray до конца действия луча.","При использовании прерывает произносимые Phoenix способности."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Stop Sun Ray","description":["Анимация применения: 0+0"],"hot_key":"E","legacy_key":"R"},{"spell":"Phoenix прекращает свою текущую жизнь ради шанса переродиться. Он превращается в горящее солнце, которое могут уничтожить вражеские герои. Солнце обжигает врагов в большом радиусе, а спустя 6 секунд взрывается, оглушая всех окружающих врагов. Phoenix появляется на месте взрыва с полным запасом здоровья, маны и без кулдаунов на других способностях.","effects":["Способность Ненаправленная ( Направленная на юнита)","Действует на Врагов \/ Союзных героев","Урон Магический"],"notes":["Способность превращает ночь в день на время действия. У неё выше приоритет, чем у ночи, вызванной Dark Ascension и Eclipse.","Позволяет избежать снаряды и применяет сильное развеивание при использовании. Также развеивает Fire Spirits.","При применении сбрасывает перезарядку способностей Phoenix и восстанавливает герою ману. Не сбрасывает перезарядку предметов и ультимейтов. Если солнце уцелело, то в конце действия также восстанавливается здоровье Phoenix.","Во время действия Supernova Phoenix спрятан, неуязвим, обезоружен, заглушен и на него действует оцепенение. Все заклинания Phoenix также становятся неактивными до перерождения, поэтому их нельзя применить. С улучшением Aghanim's Scepter во время действия можно использовать Sun Ray. Но, поскольку на Phoenix действует оцепенение, то вспомогательную способность Toggle Movement использовать нельзя. При этом герой может поворачивать луч.","Только атаки от героев (включая клонов, но исключая иллюзии) наносят урон солнцу.","Урон наносится в виде ауры, дебафф от него задерживается на 0.5 секунды. Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая до 0.5 раз. Может нанести до 360\/540\/720 единиц урона одному юниту (до учета снижений), если он оставался в радиусе действия всю длительность.","Солнце можно добить, если у него остается менее половины здоровья. Это действие также добьет Phoenix (и находящегося внутри союзника).","Разрушает деревья в радиусе 500 единиц вокруг места использования.","Aghanim's Scepter превращает эту способность в направленную на одиночную цель с дальностью применения в 500 единиц. Дальность применения действует только на выбор юнита в радиусе дальности. Солнце продолжает появляться в месте нахождения Phoenix. Может выбирать в качестве целей только союзных героев (включая иллюзии) и себя (двойное нажатие применит способность на себя). Внутри солнца союзник не может отдавать приказы, помимо тех эффектов, которые применяются на Phoenix. Если солнце уцелело, то здоровье и мана союзника будут восполнены и все способности, кроме ультимейта и предметов, будут обновлены. Уничтожение солнца приписывает смерть героев тому, кто его разрушил. Если солнце разрушили, но у Phoenix была возможность реинкарнировать, то здоровье, мана и способности союзника не изменятся. Если солнце разрушили, а у союзника внутри была возможность реинкарнировать, то он воскреснет после смерти Phoenix."],"mana":"200","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"110","name":"Supernova","description":["Анимация применения: 0,01+0,5","Дальность применения: 0 ( 500)","Радиус: 1300","Атак героев для уничтожения ядра: 5\/8\/11 ( 8\/11\/14) ( 7\/10\/13, 10\/13\/16)","Урон в секунду: 60\/90\/120","Длительность оглушения: 2\/2.5\/3 ( 3.25\/3.75\/4.25)","Длительность задержки ауры: 0.5","Длительность: 6"],"hot_key":"R","legacy_key":"V"}],"bio":"Первому солнцу Хранителя, единственной точке разумного света в изначальной тьме, было предначертано принести тепло в холодную пустоту. Бесчисленными миллиардами лет этот ослепительный луч собирал свою неизмеримую энергию, и однажды расцвёл в разрушительном взрыве сверхновой звезды. Из этого огня появились новые лучи, звёздные потомки своего родителя, что устремились в океан тьмы и стали созвездиями. Со временем и они стали сверхновыми, пробуждая новый свет. Так продолжался цикл рождения и перерождения — пока не стало мерцать и сиять всё небо, созданное тяжёлым трудом Титанов. Из этой кузницы и явилась в мир сущий одно особенное для простых смертных светило. Его, как и многих предков, извергли в безграничный космос, дабы оно нашло своё место среди небесных братьев и сестёр. Но птенца захватил интерес к тому, что гаснущие предки согревали во тьме, и в течение многих лет он познавал мир. Он узнал, что среди целых и разрушенных миров скоро образуется замкнутый центр, где всевозможные силы сойдутся в противостоянии, несущем вселенское значение. И узнал, что в той битве потребуется нечто большее, чем далёкие лучи умирающего солнца. И потому звёздное дитя приняло земную форму, чтобы в путешествиях нести тепло всем нуждающимся и, возможно, исполнить свою звёздную судьбу.","talentsTips":["Золото с таланта является ненадёжным.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["В DotA, имя Phoenix было Icarus.","Phoenix, как и Io, не имеет диалогов и реплик. Однако, их реакция, как правило, передается через звуки, которые соответствуют музыкальным паттернам, которые в свою очередь получились от форм человеческой речи. Например, они выражают счастье, производя звуки в мажорном ключе; когда сердятся, они производят резкий, диссонирующий звук аккорда; и когда выражают боль - \"кричат\".","Phoenix был секретным боссом в оригинальной DotA 6.69, а затем он был добавлен как герой в 6.70 версии.","Феникс атакует два раза обычными ударами за время полёта Icarus Dive."],"talents":["+2% к урону от макс. здоровья у Sun Ray:+3 удара на уничтожение Supernova","+1,25 сек. оглушения Supernova:+1400 к дальности Icarus Dive","+500 к здоровью:+40 к урону в секунду от Fire Spirits","+8% к урону от способностей:+90 золота в минуту"],"desc":"Phoenix — это герой с дальним типом атаки, основной характеристикой которого является сила. Его первая способность, Icarus Dive, несет Phoenix по дуге, замедляя всех врагов на своем пути и нанося им урон, а затем возвращается на исходную позицию. Полет можно остановить, использовав Stop Icarus Dive. Вторая способность, Fire Spirits, призывает 4 духа, которые кружатся вокруг Phoenix. Каждого духа можно выпустить независимо от других в указанную область. При столкновении с врагами наносит им периодический урон и значительно снижает скорость атаки. Третьей способность, Sun Ray, Phoenix выпускает огромный луч света за счет собственной здоровья. Луч наносит урон врагам, отнимает часть их здоровья и исцеляет союзников на половину этого значения. Пока луч горит, урон от него возрастает вплоть до двойного. Использовав Toggle Movement во время действия Sun Ray, Phoenix начнет лететь вперед. Способность также можно остановить, использовав Stop Sun Ray. Ультимативная способность, Supernova, превращает Phoenix в горящее солнце, которое могут уничтожить вражеские герои. Солнце обжигает врагов в большом радиусе, а спустя время взрывается, оглушая всех окружающих врагов. Phoenix появляется на месте взрыва с полным запасом здоровья, маны и без кулдаунов на других способностях. Улучшение с Aghanim's Scepter позволяет Phoenix использовать Supernova на союзном герое, забирая обоих в солнце для последующего перерождения. Не сбрасывает время перезарядки ультов."}