{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cb\/Armlet_of_Mordiggian_activate.mp3\/revision\/latest?cb=20141214001359",
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя",
        "Урон Чистый Отнимающий здоровье"
      ],
      "notes": [
        "Не прерывает произносимые заклинания владельца при переключении.",
        "При включении, мгновенно дает урон от атаки и начинает отнимать 6 здоровья в интервалах в 0.11 секунды.",
        "Дает 4.17 силы в интервалах в 0.1 секунды, так что необходимо 0.6 секунды для получения полного бонуса к силе.",
        "Броня дается после 0.6 секуды, и не мгновенно.",
        "Выключение и последующее включение при низком здоровье даёт в итоге 500 здоровья (470 при учёте потери здоровья).",
        "Не отнимает здоровье если герой неуязвим или спрятан.",
        "Потеря здоровья не может опустить здоровье использовавшего ниже 1. Не отключается по достижению 1 единицы здоровья.",
        "Учитывая пассивную регенерацию здоровья и регенерацию получаемую от силы, эффективно стоит 43.6 здоровья в секунду.",
        "При отключении, все бонусы мгновенно исчезают. Но, здоровье использовавшего не может упасть ниже 1 единицы здоровья.",
        "Unholy Strength не остается после смерти использовавшего. Если она была активна при смерти, герой появится с выключенным предметом.",
        "Несколько Unholy Strength не сочетаются. Если включить несколько таких предметов, выключение любого предмета уберет бафф Unholy Strength.",
        "Если включить несколько таких предметов, выключение любого предмета уберет бафф Unholy Strength."
      ],
      "mana": null,
      "abilityName": "Unholy Strength",
      "cooldown": "0",
      "description": "На время действия увеличивает урон на 31, силу на 25 и броню на 4, но отнимает 54 здоровья в секунду. Вы не можете умереть ни от потери здоровья во время действия способности, ни от спада бонуса к силе после её отключения.",
      "params": [
        "Бонус к урону: 31",
        "Бонус к силе: 25",
        "Бонус к броне: 4",
        "Потеря здоровья в секунду: 54"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Бонусы к урону от атаки, скорости атаки, броне и регенерации здоровья от нескольких Armlet of Mordiggian не складываются.",
    "Один Armlet of Mordiggian дает следующее: Когда выключен, дает в итоге 5 регенерации здоровья, 5 брони, 25 скорости атаки и 15 урона от атаки. Когда включен, дает в итоге 500 здоровья, 9 брони, 25 скорости атаки и 46 (71 героям силы) урона от атаки.",
    "Когда выключен, дает в итоге 5 регенерации здоровья, 5 брони, 25 скорости атаки и 15 урона от атаки.",
    "Когда включен, дает в итоге 500 здоровья, 9 брони, 25 скорости атаки и 46 (71 героям силы) урона от атаки."
  ],
  "cost": "2475",
  "lore": null,
  "consistFrom": [
    "Helm of Iron Will",
    "Gloves of Haste",
    "Blades of Attack",
    "Recipe"
  ],
  "boughtFrom": "Оружие",
  "name": "Armlet of Mordiggian",
  "description": "",
  "trivia": [],
  "upgradeIn": null,
  "bonuses": [
    "+5 к регенерации здоровья",
    "+5 к броне",
    "+15 к урону",
    "+25 к скорости атаки"
  ],
  "tips": []
}