{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "The bonuses are only granted once, no matter how many abilities are on cooldown.",
        "The item's modifier periodically checks all the cooldowns of the equipped unit and grants the bonus accordingly. This means as soon as the cooldowns get reset, the bonus disappears as well. It has no set duration.",
        "This means as soon as the cooldowns get reset, the bonus disappears as well. It has no set duration.",
        "Only reacts on ability cooldowns, including passive abilities. Ignores item cooldowns. Only reacts on currently active abilities. Ignores hidden abilities (e.g. Invoker, Rubick, Morphling). Only reacts on the cooldown system. Does not react on the custom systems of e.g. Counter Helix. Does not react on charge-based abilities' replenish time. Does not react on the fade delay indicator of Cloak and Dagger.",
        "Only reacts on currently active abilities. Ignores hidden abilities (e.g. Invoker, Rubick, Morphling).",
        "Only reacts on the cooldown system. Does not react on the custom systems of e.g. Counter Helix.",
        "Does not react on charge-based abilities' replenish time.",
        "Does not react on the fade delay indicator of Cloak and Dagger."
      ],
      "mana": null,
      "abilityName": "Quicksilver",
      "cooldown": null,
      "description": "Grants you a bonus 5% movement speed and 15 attack speed anytime one of your abilities are on cooldown.",
      "params": [
        "Move Speed Bonus: 5%",
        "Attack Speed Bonus: 15"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Quicksilver Amulets are fully sharable."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Quicksilver Amulet",
  "description": "An enchanted talisman brimming with a mysterious substance.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+5% Movement Speed",
    "+10 Attack Speed",
    "+30% Attack Animation Speed",
    "+30% Projectile Speed"
  ],
  "tips": null
}