{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Бонусный урон наносит отдельным источником и считает уроном от заклинаний. Это означает, что на него не будут взаимодействовать с другими эффектами от атак. Это также означает, что урон будет полностью работать с усилением урона заклинаний и вампиризмом заклинаний",
        "Это означает, что на него не будут взаимодействовать с другими эффектами от атак.",
        "Это также означает, что урон будет полностью работать с усилением урона заклинаний и вампиризмом заклинаний",
        "Успешные атаки с Ballista не накапливают дебафф, но обновляют его длительность и отталкивают.",
        "Атаки сперва применяют дебафф, потом наносят собственный урон.",
        "Цель не обезвреживается во время отталкивания, поэтому она может использовать заклинания или предметы, атаковать и поворачиваться. Это значит что отталкивание также не отменяет произнесение заклинаний цели.",
        "Это значит что отталкивание также не отменяет произнесение заклинаний цели."
      ],
      "mana": null,
      "abilityName": "Knockback",
      "cooldown": null,
      "description": "Каждая атака отталкивает врага на расстояние в 50 и наносит 50 чистого урона.",
      "params": [
        "Дистанция толчка: 50",
        "Длительность толчка: 0,2",
        "Доп. урон: 50"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Ballista — полностью передаваемый предмет.",
    "Суммируется со всеми другими бонусами дальности атаки.",
    "Также влияет на дальность применения активных модификаторов атаки."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "нейтральных крипов",
  "name": "Ballista",
  "description": "Любящая рука мастера сделает чудо даже из самого простого орудия.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+250 к дальности атаки (дальний бой)"
  ],
  "tips": null
}