{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/ca\/Infused_Raindrop_Magical_Damage_Block.mp3\/revision\/latest?cb=20191227195443",
      "effects": [
        "Граница минимального урона: 75",
        "Блокируемый магический урон: 120",
        "Количество зарядов: 6"
      ],
      "notes": [
        "Срабатывает только на магический урон, равный или превышающий 75 (до уменьшений), урон нанесённый самому себе и урон полученный от союзников. При срабатывании блокирует до 120 урона (до уменьшений). Также игнорирует все виды усиления урона, включая усиление урона заклинаний. Имеет наивысший приоритет в группе заклинаний, отрицающих урон, блокируя урон первым. Имеет наивысший приоритет, чем Dispersion и Blade Mail, то есть предмет заблокирует урон до отражения. Имеет более низкий приоритет, чем Mana Shield, то есть щит уменьшает урон до того, как его заблокирует Infused Raindrops.",
        "При срабатывании блокирует до 120 урона (до уменьшений).",
        "Также игнорирует все виды усиления урона, включая усиление урона заклинаний.",
        "Имеет наивысший приоритет в группе заклинаний, отрицающих урон, блокируя урон первым.",
        "Имеет наивысший приоритет, чем Dispersion и Blade Mail, то есть предмет заблокирует урон до отражения.",
        "Имеет более низкий приоритет, чем Mana Shield, то есть щит уменьшает урон до того, как его заблокирует Infused Raindrops.",
        "Если у героя несколько Infused Raindrops, то при срабатывании заряд будут терять все предметы, но блокировать урон — только один.",
        "Не поглощает урон и не расходует заряды при перезарядке."
      ],
      "mana": null,
      "abilityName": "Magical Damage Block",
      "cooldown": null,
      "description": "Теряет один заряд и блокирует до 120 магического урона. Срабатывает, только если урон был больше 75. Изначально имеет 6 зарядов и пропадает вместе с последним из них.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "225",
  "lore": null,
  "consistFrom": null,
  "name": "Infused Raindrops",
  "description": "Стихийная защита от магических атак.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}