{"abilities":[{"effects":["Cast Range: 600","Gold Bonus: 160","Experience Bonus Multiplier: 185%"],"notes":["Upon cast, kills the target unit instantly and grants the caster 160 reliable gold and 185% of the target's experience bounty.","The target's default bounties are not granted. This means that no hero nearby gains the default gold and experience from the death.","Despite the visual effects, the gold and experience are granted instantly.","Deals damage equal to the target's current health to kill it. This damage fully ignores any form of reduction or amplification. This means that it triggers most on-damage events like (neutral or lane) creep aggro.","Cannot be cast on wards, buildings, ancient creeps, or Necronomicon summons."],"elements":["Ability Target Unit","Affects Enemy Units","Damage Instant Kill"],"description":"Kills a non-hero target for 160 gold and 1.85x experience. Cannot be used on Ancient Creeps."}],"cost":"2250","description":"Preserved through unknown magical means, the Hand of Midas is a weapon of greed, sacrificing animals to line the owner's pockets.","trivia":["Midas is based on Midas, a figure from Greek mythology who turned all he touched to gold."],"further":["Gloves_of_Haste","Recipe"],"tips":["The earlier Hand of Midas is purchased, the more cost effective it will be over the course of a match. Assuming it is always used when off cooldown, Hand of Midas increases the user's GPM by 106.67, meaning it takes a minimum of 21 minutes to pay for itself, or 15 minutes for the recipe (from the point on it was first used). This means you need to use Hand of Midas 14 times to pay for itself, or 11 times for just the recipe.","Hand of Midas is an important item if you want to increase your level quickly and unlock talents, especially if you rely on your talents to counter enemy heroes in late game. For example, Wraith King's level 20 talent removes the mana cost for Reincarnation, which is useful if he is facing mana burning enemies like Anti-Mage.","To get the most out of the 1.85x experience bonus, use Transmute on: Large neutral creeps (175.75 + 3.515 every 7.5 minutes experience) - Centaur Conqueror, Satyr Tormenter, Hellbear Smasher, Wildwing Ripper, Dark Troll Summoner Ranged creeps (127.65 experience) Siege creeps (162.8 experience)"],"attrs":["Active Transmute","Bonus +40 Attack speed","Disassemble? No","Alert allies? No"]}