{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/97\/Sentry_Ward_Plant.mp3\/revision\/latest?cb=20191227195528",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Даёт наземный обзор вокруг себя в радиусе 150 c длительностью в 12 секунд.",
        "Нельзя поставить внутри области фонтана (включая маленькую область перед подъёмом на базу), или в логове Рошана.",
        "Зажатая клавиша Ctrl позволяет владельцу передать союзнику один вард, вместо всей связки.",
        "Sentry Ward нельзя передать курьеру или Spirit Bear с зажатой клавишей Ctrl.",
        "Перед установкой варда отображаются области появления нейтральных крипов, позволяя заблокировать лагеря.",
        "Также отображаются радиусы уже установленных Sentry Ward, показывая возможные области пересечения.",
        "Иллюзии и крипы-герои считаются за крипа при атаке варда, поэтому им нужно совершить 8 атак для уничтожения вместо 2 для героев."
      ],
      "mana": null,
      "abilityName": "Plant",
      "cooldown": "1",
      "description": "Устанавливает невидимый тотем всевидения, раскрывающий невидимость вражеских существ и вардов в радиусе 1000, если они в зоне вашей видимости. Действует 8 мин. Не даёт наземный обзор. Можно передать один вард союзному герою, зажав клавишу Ctrl.",
      "params": [
        "Дальность применения: 500",
        "Атак героя для разрушения: 2",
        "Атак не-героя для разрушения: 8",
        "Длительность: 480"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "True Sight распространяется по всей его области, ему ничто не препятствует.",
        "Эффект True Sight распространяется аурой, действующей на врагов. Её негативный эффект задерживается на 0,5 секунды.",
        "Нельзя обнаружить существ под эффектами Shadow Dance, Smoke of Deceit и мины Techies под действием Minefield Sign улучшенным Aghanim's Scepter.",
        "Зажатие клавиши Alt показывает радиус True Sight всех союзных Sentry Ward."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Даёт владельцу и его союзникам возможность видеть невидимых существ и варды в радиусе Sentry Ward.",
      "params": [
        "Радиус: 1000",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Н\/Д"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "<div style=\"float:right;\"> \n<\/div>",
      "cooldown": null,
      "description": "Для этой способности нет описания.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складывается с другими Sentry Ward и с Observer Ward в инвентаре без ограничения. Стоимость продажи зависит от их количества. Варды от разных игроков объединяются.",
    "Варды от разных игроков объединяются.",
    "Sentry Ward полностью передаваемый предмет.",
    "Уничтожение Sentry Ward отображается в уведомлениях чата для союзников.",
    "Существам ближнего боя даётся дополнительно 150 к дальности атаки при атаке Sentry Ward.",
    "Герой, купивший Sentry Ward, может атаковать его в любой момент независимо от того, можно ли добить вард. Sentry Ward получает по 10 урона, если его здоровье выше 50.",
    "Sentry Ward получает по 10 урона, если его здоровье выше 50."
  ],
  "cost": "75",
  "lore": [
    "Знание о создании вардов — важный навык для творца магических предметов. Рилай проявила талант в их создании и когда-то хотела стать ремесленником.",
    "Несмотря на этот факт, описание предмета сообщает о том, что Sentry Ward — растение, которое «первоначально выращивалось в саду». То есть варды выращивают, а не создают, что противоречит описанию White Sentry."
  ],
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Sentry Ward",
  "description": "Вид растения, который когда-то выращивался в саду трусливого короля.",
  "trivia": null,
  "upgradeIn": [
    "Варды"
  ],
  "bonuses": null,
  "tips": [
    "Sentry Ward лучше использовать в схватке с героями, которые часто полагаются на невидимость (или используют невидимость для побега), особенно против Riki, Bounty Hunter и Weaver. Sentry Ward установленный рядом с башней, отлично помогает против ганкающих невидимых героев или помогает совершить неожиданный ганк на невидимого врага.",
    "Sentry Ward установленный рядом с башней, отлично помогает против ганкающих невидимых героев или помогает совершить неожиданный ганк на невидимого врага.",
    "У Sentry Ward большой радиус обнаружения, что делает его полезным для наблюдения за невидимыми героями в ключевых местах, если у вас есть обзор над этой областью.",
    "В основном Sentry Ward используют для обнаружения вражеских вардов, так как вражеские варды способны обнаружить варды вашей команды. При уничтожении вражеских вардов, Sentry Ward лучше всего расположить так, чтобы его True Sight достигал несколько самых популярных месторасположений вардов. Данным методом, вы с большей вероятностью обнаружите вражеские варды. Если вам известно местоположение вражеского варда, то лучше всего расположить Sentry Ward так, чтобы противник не обнаружил его, например, между деревьями. Если враг поставил Sentry Ward, чтобы найти ваш, то их вард попросту может не задеть его своим радиусом.",
    "При уничтожении вражеских вардов, Sentry Ward лучше всего расположить так, чтобы его True Sight достигал несколько самых популярных месторасположений вардов. Данным методом, вы с большей вероятностью обнаружите вражеские варды.",
    "Если вам известно местоположение вражеского варда, то лучше всего расположить Sentry Ward так, чтобы противник не обнаружил его, например, между деревьями. Если враг поставил Sentry Ward, чтобы найти ваш, то их вард попросту может не задеть его своим радиусом.",
    "Подобно Observer Ward, Sentry Ward также могут использоваться, чтобы заблокировать лагеря нейтральных крипов."
  ]
}