{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cd\/Urn_of_Shadows.mp3\/revision\/latest?cb=20141214195232",
      "effects": [
        "Дальность применения: 950",
        "Радиус получения заряда: 1400",
        "Бонус к регенерации здоровья союзника: 30",
        "Урон врагу в секунду: 25",
        "Длительность лечения\/урона: 8"
      ],
      "notes": [
        "↓↓ Двойное нажатие использует предмет на себя.",
        "Несколько применений на одну цель не складываются, но обновляется длительность. Бафф и дебафф независимы и сочетаются друг с другом, хотя лечение отменяется как только произойдёт тик урона.",
        "Бафф и дебафф независимы и сочетаются друг с другом, хотя лечение отменяется как только произойдёт тик урона.",
        "Лечение и дебафф от Urn of Shadows и Spirit Vessel не сочетаются, модификаторы Spirit Vessel перекрывают модификаторы от Urn of Shadows. При попытке применить бафф\/дебафф от Urn of Shadows, предмет уходит на перезарядку без потери зарядов.",
        "При попытке применить бафф\/дебафф от Urn of Shadows, предмет уходит на перезарядку без потери зарядов.",
        "Может восстановить до 240 здоровья за полную длительность.",
        "Наносит 25 урона в 1-секундных интервалах, начиная с 1 секунды после применения, что приводит к 8 тикам урона. Может нанести в общем 200 урона цели (до уменьшений).",
        "Может нанести в общем 200 урона цели (до уменьшений).",
        "Урон свыше 0 от любого игрока (включая союзников, исключая себя) или Рошана развеет эффект лечения, но не эффект урона. Не развеивается уроном с пометкой «отнимающий здоровье».",
        "Не развеивается уроном с пометкой «отнимающий здоровье».",
        "Можно применять только на героев (включая иллюзии и клонов) и крипов-героев.",
        "Если не осталось зарядов, то Soul Release получит 2 заряда от следующей смерти героя, вместо 1. Заряды Soul Release не собираются клонами, иллюзиями и крипами-героями.",
        "Заряды Soul Release не собираются клонами, иллюзиями и крипами-героями.",
        "При наличии нескольких Urn of Shadows и\/или Spirit Vessel получать заряды будет тот предмет, который занимает высшую ячейку в инвентаре. Наивысший приоритет имеет верхняя левая ячейка инвентаря, правая нижняя имеет наименьший приоритет. Не может получать заряды находясь в ранце. Если несколько героев в команде имеют Urn of Shadows, то заряды получит тот герой, который ближе к умершему вражескому герою. Делит перезарядку с Spirit Vessel. Все текущие заряды переносятся при улучшении предметов основанных на Urn of Shadows.",
        "Наивысший приоритет имеет верхняя левая ячейка инвентаря, правая нижняя имеет наименьший приоритет.",
        "Не может получать заряды находясь в ранце.",
        "Если несколько героев в команде имеют Urn of Shadows, то заряды получит тот герой, который ближе к умершему вражескому герою.",
        "Делит перезарядку с Spirit Vessel.",
        "Все текущие заряды переносятся при улучшении предметов основанных на Urn of Shadows."
      ],
      "mana": "0",
      "abilityName": "Soul Release",
      "cooldown": "7",
      "description": "Эффект зависит от выбранной цели: либо увеличивает восстановление здоровья союзника на 30, либо наносит противнику 25 урона в секунду. Действует 8 сек. Получает заряды каждый раз, когда в радиусе 1400 умирает вражеский герой. Заряд получит только один, ближайший к умершему герою предмет.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "880",
  "lore": null,
  "consistFrom": [
    "Sage's Mask",
    "Circlet",
    "Ring of Protection",
    "Recipe"
  ],
  "name": "Urn of Shadows",
  "description": "Содержит пепел могучих демонов.",
  "trivia": null,
  "upgradeIn": [
    "Spirit Vessel"
  ],
  "tips": null
}