{"abilities":[{"spell":"Enchantress beguiles her enemies, slowing their attacks when she is attacked.","effects":["Ability Passive","Affects Enemies"],"notes":["Untouchable is triggered whenever a unit starts an attack on Enchantress, regardless of distance. This means it does not matter if the attack successfully hits or not, the slow is still applied.","When the attack was fully executed, then the slow debuff lasts as long as the remaining backswing duration of the attack. Canceling the attack backswing does not affect this duration, so it is not possible to the reset attack speed by canceling it. When switching attack targets, the debuff persists, but does not apply the slow against the new target. The debuff persists until the attack against the new target finishes or gets canceled. This means it is possible to skip the backswing-based slow duration by issuing an attack order on a new target within attack range between each attack.","Does not work against wards, buildings and allies."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Untouchable","description":["Attack Speed Slow: 20\/70\/120\/170 ( 120\/170\/220\/270)"],"hot_key":"Q","legacy_key":"N"},{"spell":"Enchantress charms an enemy. If the enemy is a hero, they are slowed. If the enemy is a creep, she brings it under her control. If cast on a creep already under her control, she refreshes its enchant duration.","effects":["Ability Target Unit","Affects Enemy Units \/ Enemy Heroes"],"notes":["Casting Enchant on heroes (including clones and the Vengeance Aura illusion) or creep-heroes slows them and applies a basic dispel on them (long sound is played).","Enchant first applies the dispel, then the slow.","Casting Enchant on any other enemy unit which is not a ward or building converts it (short sound is played). This includes regular illusions. Can convert allied unit which is already enchanted (e.g. enchanted by Morphling). When converting, applies a basic dispel on the target which removes buffs and debuffs.","Cannot be cast on ancient creeps and siege creeps. If the level 20 talent is chosen, ancient creeps can be converted, but Roshan and creep-heroes tagged as ancient creeps are only slowed. If the level 20 talent is chosen, couriers can be targeted, but it has no effect on them, wasting the mana and cooldown.","There is no limit to how many creeps can be converted. The current default cooldown, cast time and duration allow up to 2\/3\/6\/10 creeps.","When recast on an enchanted creep, its duration gets set back to 26\/44\/62\/80 seconds. This also goes for other enchanted summoned units. For example, Necronomicon units last seconds by default, but Enchant sets it to 26\/44\/62\/80 seconds when recast. The duration of summons is not set to 26\/44\/62\/80 upon converting them. It only sets it upon re-casting it on them a second time.","When a converted creep's duration ends, it dies instantly. The death is not credited to anyone so that no one gets experience from it."],"mana":"40\/50\/60\/70","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"20\/16\/12\/8","name":"Enchant","description":["Cast Animation: 0.3+0.67","Cast Range: 700","Move Speed Slow: 55%","Slow Duration: 3.75\/4.5\/5.25\/6","Enchant Duration: 26\/44\/62\/80"],"hot_key":"W","legacy_key":"C"},{"spell":"A cloud of wisps heals Enchantress and any friendly units nearby. Lasts 11 seconds.","effects":["Ability No Target","Affects Allies"],"notes":["Every second, each wisp chooses a random allied unit to heal. So it is possible to heal up to 4\/6\/8\/10 ( 12\/14\/16\/18) allies at a time.","The heal targets are chosen completely random, without any priorities. Multiple wisps can randomly select the same unit. Each wisp will approach its chosen target, indicating the wisp is healing the target. However, when choosing the wisps increasing talent, the visual effect does not adapt. The numbers of wisps can be seen does not increase.","Ignores ancient creeps and allies that already are at full health.","Wisps can heal invulnerable units, but not hidden units.","The area of effect is centered around Enchantress' current location, not where the spell was cast.","When Enchantress dies, the wisps still continue to heal units nearby her death's location.","Nature's Attendants does not stack with itself. Casting the ability while it is active refreshes the buff.","Can heal a total of 28\/54\/88\/130 health per second. Can heal a total of 84\/126\/176\/234 health per second if the number of wisps increasing talent is chosen. Can heal a total of 128\/204\/288\/380 health per second if heal per wisp talent is chosen. Can heal a total of 384\/476\/576\/684 health per second if both talents are chosen.","Can heal a total of 308\/594\/968\/1430 health over its full duration. Can heal a total of 924\/1386\/1936\/2574 health over its full duration if the number of wisps increasing talent is chosen. Can heal a total of 1408\/2244\/3168\/4180 health over its full duration if heal per wisp talent is chosen. Can heal a total of 4224\/5236\/6336\/7524 health over its full duration if both talents are chosen."],"mana":"170\/160\/150\/140","elements":["Pierces spell immunity."],"cooldown":"35","name":"Nature's Attendants","description":["Cast Animation: 0.3+0.93","Search Radius: 275","Number of Wisps: 4\/6\/8\/10 ( 12\/14\/16\/18)","Heal per Second per Wisp: 7\/9\/11\/13 ( 32\/34\/36\/38)","Duration: 11"],"hot_key":"E","legacy_key":"R"},{"spell":"Places an enchantment on each attack while activated, causing it to deal additional damage based on how far away the target is. The farther the target, the greater the damage dealt.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Pure"],"notes":["The distance is calculated as the projectile hits the target. This means moving away from the target causes it to deal more damage on impact, and moving closer decreases the damage.","The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","Impetus deals its damage before the attack damage is applied, but still depends on the attack hitting the target.","The damage is capped at 1750 distance, which equates to 245\/350\/455 ( 385\/490\/595) damage.","Works against everything except for wards and buildings.","The attack range bonus of Aghanim's Scepter is granted only if Impetus is learned.","Enchantress' attack acquisition range stays at 800 even after acquiring Aghanim's Scepter."],"mana":"40\/55\/70","elements":["Can be disjointed.","Not disabled by Break.","Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"0","name":"Impetus","description":["Cast Range: 575 ( 765)","Distance as Damage: 14%\/20%\/26% ( 22%\/28%\/34%)","Attack Range Bonus: 0 ( 190)"],"hot_key":"R","legacy_key":"T"}],"bio":"Aiushtha appears to be an innocent, carefree creature of the woods, and while this is certainly true, it is hardly the sum of her story. She well understands the suffering of the natural world. She has wandered far, and fared through forests bright and drear, in every clime and every season, gathering friends, sharing news, bringing laughter and healing wherever she goes. For in worlds wracked by war, forests are leveled for the building of ships and siege engines; and even in places of peace, the woods are stripped for the building of homes, and as fuel for countless hearths. Aiushtha hears the pleas of the small creatures, the furtive folk who need green shade and a leafy canopy to thrive. She lends her ears to those who have no other listeners. She carries their stories from the wood to the world, believing that her own good cheer is a kind of Enchantment, that can itself fulfill the promise of a verdant future.","talentsTips":["The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Enchantress's magic resistance to 36.25%.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Unlike most heroes, Enchantress's attack projectiles actually use the model of her equipped cosmetic weapon.","Enchantress' alternate\/fun name in DotA was Bambi, referencing the classic Disney animated film of the same name.","Enchantress' phrases \"Light of foot, light of heart!\", \"With skipping grace\", and \"Oh do not run too fast for I will but bespeak thy grave and die\" derive from Andrew Marvell's poem \"The Nymph Complaining for the Death of her Fawn\".","Enchantress' line \"I guess the good do die young.\" is a reference to the 1977 song by Billy Joel \"Only the Good die young\".","The line \"Ready or not, here I come!\" is a reference to the traditional announcement at the start of the childhood game of Hide and Seek, and possibly a reference to the song Ready or Not Here I Come (Can't Hide from Love) originally created by the Delfonics."],"talents":["+25 Nature's Attendants Heal:+8% Impetus Damage","Enchant Affects Ancients:+100 Untouchable Slow","+8 Nature's Attendants Wisps:+50 Damage","+20 Movement Speed:+15% Magic Resistance"],"desc":"Aiushtha the Enchantress is a ranged intelligence hero who uses her abilities to push through lanes and gank with relative ease. Enchantress works well as a jungler in the early game, as it maximizes the effectiveness of her Enchant and Untouchable abilities. On first glance, she may be just a support, serving her allies with powerful heals, creep abilities and slows, but as time goes on, her power increases and once she has her ultimate, Enchantress' regular attacks are strong enough to kill most heroes with a couple of attacks, if they stand far enough, and make her a potential carry."}