{"abilities":[{"spell":"Enchantress зачаровывает противников, атакующих ее, снижая скорость их атаки на 4 секунды.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Замедление срабатывает при начале атаки по Enchantress независимо от расстояния. При этом не важно, прошла ли успешно атака или нет, замедление все равно сработает.","Замедление также работает до тех пор, пока длится анимация завершения атаки. Отмена анимации завершения атаки не отменит замедления и не вернет скорость атаки. При смене цели атаки дебафф сохраняется, но не добавляет замедление к новой атаке по новой цели. Дебафф остается до завершения или отмены атаки по новой цели. То есть можно пропустить замедление, работающее на анимацию завершения атаки, меняя цель атаки в пределах дальности атаки героя перед каждой атакой.","Способность не работает на варды и строения."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Untouchable","description":["Замедление скорости атаки: 20\/70\/120\/170 ( 120\/170\/220\/270)"],"hot_key":"Q","legacy_key":"N"},{"spell":"Очаровывает врага, забирая его под свой контроль (если это крип) или замедляя его передвижение (если это герой). Повторное применение обновляет длительность чар.","effects":["Способность Направленная на юнита","Действует на Вражеских существ \/ Вражеских героев"],"notes":["Применение Enchant на героев (включая клонов и иллюзию Vengeance Aura) или крипов-героев замедляет их и применяет на них базовое развеивание (при этом проигрывая длительный звук).","Применение Enchant на остальных вражеских юнитов, которые не относятся к вардам или строениям, приручает их (проигрывая короткий звук). Это действует и на иллюзии. Может повторно приручить союзного юнита (например, прирученного Morphling). При приручении применяет к цели базовое развеивание, которое снимает положительные и отрицательные эффекты.","Не применяется к древним крипам и катапультам. С выбранным на 20 уровне талантом можно приручать древних крипов, но Рошан и крипы-герои, которые также относятся к древним крипам, лишь замедляются. С талантом на 20 уровне курьера можно выбрать целью для приручения, но способность на него не сработает, потратит ману и уйдет в перезарядку.","У способности нет лимита на прирученных крипов. Учитывая стандартное время перезарядки, время применения и длительность способности, их может быть до штук.","Повторное применение на крипов под способностью Enchant обновит их время жизни до 26\/44\/62\/80 секунд. Это распространяется и на приручение призываемых существ. К примеру, юниты Necronomicon живут секунд, но Enchant обновит время жизни юнитов до 26\/44\/62\/80 секунд при повторном приручении. Способность при первом приручении не устанавливает время жизни юнитов равным 26\/44\/62\/80 секундам. Это работает только на их повторное приручение.","Если приручение закончило свое действие, юниты сразу умирают. Эта смерть никому не зачитывается, поэтому опыт никто не получает."],"mana":"40\/50\/60\/70","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/16\/12\/8","name":"Enchant","description":["Анимация применения: 0,3+0,67","Дальность применения: 700","Замедление передвижения: 55%","Длительность замедления: 3.75\/4.5\/5.25\/6","Длительность очарования: 26\/44\/62\/80"],"hot_key":"W","legacy_key":"C"},{"spell":"Призывает рой духов-целителей, которые лечат героя и всех ближайших союзников в течение 11 секунд.","effects":["Способность Ненаправленная","Действует на Союзников"],"notes":["Каждую секунду духи выбирают случайного союзного юнита для лечения. Способность может лечить до 4\/6\/8\/10 ( 12\/14\/16\/18) союзников одновременно.","Цели для лечения выбираются совершенно случайно без каких-либо приоритетов. Несколько духов могут случайно выбрать целью для лечения одного и того же юнита. При лечении каждый дух приближается к выбранной цели. Но при выборе таланта на увеличение числа духов визуальный эффект не адаптируется.","Способность игнорирует древних крипов и союзников, если у них полный показатель здоровья.","Духи могут лечить неуязвимых юнитов, но не лечат спрятанных.","Центр площади действия способности закреплена за местоположением Enchantress, а не за местом, где способность была применена.","При смерти Enchantress духи продолжают лечить юнитов, находящихся недалеко от места её смерти.","Несколько применений Nature's Attendants не складываются. При повторном применении с действующей способностью длительность баффа обновится.","Может лечить до 28\/54\/88\/130 здоровья в секунду. Лечит до 84\/126\/176\/234 здоровья в секунду, если был выбран талант на дополнительное количество духов. Лечит до 128\/204\/288\/380 здоровья в секунду, если был выбран талант на дополнительное лечение от духов. Лечит до 384\/476\/576\/684 здоровья в секунду, если были выбраны оба таланта.","Может вылечить до 308\/594\/968\/1430 здоровья за все время действия способности. Вылечит до 924\/1386\/1936\/2574 здоровья, если выбран талант на дополнительное количество духов. Вылечит до 1408\/2244\/3168\/4180 здоровья, если выбран талант на дополнительное лечение от духов. Вылечит до 4224\/5236\/6336\/7524 здоровья, если выбраны оба таланта."],"mana":"170\/160\/150\/140","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"35","name":"Nature's Attendants","description":["Анимация применения: 0,3+0,93","Радиус поиска: 275","Количество духов: 4\/6\/8\/10 ( 12\/14\/16\/18)","Лечения в секунду за духа: 7\/9\/11\/13 ( 32\/34\/36\/38)","Длительность: 11"],"hot_key":"E","legacy_key":"R"},{"spell":"Пока способность активна — усиливает каждую атаку, добавляя к ней урон, зависящий от того, как далеко находится цель. Чем она дальше, тем больше урон.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Чистый"],"notes":["Дистанция рассчитывается в тот момент, когда снаряд достигнет цель. То есть, увеличение расстояния от цели увеличит урон от способности, а уменьшение - снизит.","Урон от Impetus наносит отдельный урон, так что на него не действуют любые эффекты от модификаторов атаки.","Урон от Impetus наносится раньше, чем урон с руки, но все равно зависит от попадания атаки по цели.","Увеличение урона ограничено расстоянием в 1750 единиц, что соответствует 245\/350\/455 ( 385\/490\/595) единицам урона.","Действует на все цели, кроме вардов и строений.","Бонус к урону от дальности, даваемый Aghanim's Scepter, работает только при изученой способности.","Дальность атаки с помощью способности после приобретения Aghanim's Scepter равна 800."],"mana":"40\/55\/70","elements":["Можно избежать.","Не отключается истощением.","Не блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Impetus","description":["Дальность применения: 575 ( 740)","Дистанции в урон: 14%\/20%\/26% ( 22%\/28%\/34%)","Бонус к дальности атаки: 0 ( 190)"],"hot_key":"R","legacy_key":"T"}],"bio":"Аюшта кажется невинным и беззаботным лесным существом, и пусть это первое впечатление не обманчиво, оно едва ли раскрывает её натуру. Аюшта прекрасно понимает, отчего страдает природа. Она прошла многими тропами, приветливыми и угрюмыми лесами, бывала во всех краях в любое время года — и всюду искала дружбы, несла вести, смех и исцеление. Иначе никак: где разразилась война, там лес идёт на суда и осадные орудия, а в мирных местах деревья вырубают, чтобы строить дома и топить бесчисленные очаги. Аюшта внимает мольбам беззащитных существ, которые так нуждаются в лиственной тени и зелёном крове. Она прислушивается к тем, до кого никому нет дела, и несёт их истории по всему миру, уверенная в том, что её доброе слово — словно чары, от которых наш мир расцветёт.","talentsTips":["Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.","Талант на сопротивление магии увеличивает сопротивление магии Enchantress до 36.25%.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["В ранних версиях игры Untouchable была ультимативной способностью, a Impetus — обычной. Около 2007 года их поменяли местами.","Альтернативным именем Enchantress было имя Bambi, по имени героя мультфильма «Бэмби».","После обновления 6.83, у Enchantress самая большая начальная скорость передвижения в Dota 2. Это единственный герой, который, не имея дополнительных предметов, может двигаться быстрее крипов."],"talents":["+25 к лечению от Nature's Attendants:+8% к урону от Impetus","Enchant действует на древних крипов:+100 к замедлению от Untouchable","+8 светлячков от Nature's Attendants:+50 к урону","+25 к скорости передвижения:+15% к сопротивлению магии"],"desc":"Enchantress — это герой с дальним типом атаки, основной характеристикой которого является интеллект. В ранней игре Enchantress является хорошим героем-лесовиком, а ближе к середине и поздней этапам игры - может стать хорошим Carry-героем, который способен наносить большое количество урона. Пассивная способность Untouchable дает возможность герою замедлять атаки противников, которые ее атакуют. Способность Enchant позволяет очаровывать крипа, захватывая его под свой контроль. Если целью является вражеский герой, то способность замедлит его скорость передвижения. Способностью Nature's Attendants герой вызывает духов-целителей вокруг себя, которые лечат героя и всех ближайших дружественных героев. Главная способность героя - Impetus - усиливает каждую атаку, добавляя к ней урон, зависящий от того, как далеко находится цель. Чем она дальше, тем сильнее урон."}