{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Medallion_of_Courage.mp3\/revision\/latest?cb=20141214195424",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Нельзя использовать на себя.",
        "Делит перезарядку с Solar Crest.",
        "Дебафф на владельце и бафф на союзнике\/дебафф на противнике не связаны друг с другом. Развеивание одного эффекта не развеивает тут же другой.",
        "На существо может одновременно действовать и бафф, и дебафф, но не несколько баффов\/дебаффов одновременно. То есть два героя могут использовать предметы друг на друга, а дебаффы просто обновятся. При использовании друг на друга двумя союзными героям, каждый получит независящие друг от друга бафф и дебафф. При этом бафф и дебафф сочетается с эффектом от Solar Crest.",
        "То есть два героя могут использовать предметы друг на друга, а дебаффы просто обновятся.",
        "При использовании друг на друга двумя союзными героям, каждый получит независящие друг от друга бафф и дебафф.",
        "При этом бафф и дебафф сочетается с эффектом от Solar Crest.",
        "Можно использовать на любое существо, за исключением вардов и строений."
      ],
      "mana": null,
      "abilityName": "Valor",
      "cooldown": "7",
      "description": "Если использовать на союзника, увеличит его броню на 5, но заберёт её у владельца. Если использовать на врага, снизит броню на 5 и у владельца, и у жертвы. Не действует на невосприимчивых к заклинаниям противников.",
      "params": [
        "Дальность применения: 1000",
        "Снижение брони владельцу: 5",
        "Снижение брони врагу: 5",
        "Доп. броня союзнику: 5",
        "Длительность: 7",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя использовать на врагов с иммунитетом."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Medallion of Courage не перенимает пассивное снижение брони от Blight Stone.",
    "Medallion of Courage проходит сквозь пассивную Linken's Sphere Рошана"
  ],
  "cost": "1025",
  "lore": null,
  "consistFrom": [
    "Chainmail",
    "Sage's Mask",
    "Blight Stone"
  ],
  "boughtFrom": "Поддержка",
  "name": "Medallion of Courage",
  "description": "Его носитель не боится сражений.",
  "trivia": null,
  "upgradeIn": [
    "Solar Crest"
  ],
  "bonuses": [
    "+1,25 к регенерации маны",
    "+5 к броне"
  ],
  "tips": null
}