{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ec\/Glimmer_Cape_Glimmer.mp3\/revision\/latest?cb=20191227195421",
      "effects": [
        "Cast Range: 600",
        "Fade Time: 0.5",
        "Magic Resistance Bonus: 50%",
        "Duration: 5"
      ],
      "notes": [
        "Does not interrupt the caster's or the target's channeling abilities upon cast. Does not have to face the targeted ally to cast Glimmer on them. ↓↓ Double-tapping automatically target self. Can be cast on Couriers and creeps. Cannot be cast on invulnerable units, wards or buildings.",
        "Does not have to face the targeted ally to cast Glimmer on them.",
        "↓↓ Double-tapping automatically target self.",
        "Can be cast on Couriers and creeps.",
        "Cannot be cast on invulnerable units, wards or buildings.",
        "Places a buff on an allied unit. As long as this buff is present, the unit keeps on turning invisible.",
        "During the fade time, the unit can still cast abilities, use items and perform attacks.",
        "While invisible, the unit can turn and pick up or drop items without breaking the invisibility. The unit is also phased, meaning other units can walk through it without getting blocked.",
        "The magic resistance is only applied when fully invisible. It is not applied during the fade time.",
        "Increases most heroes' total magic resistance to 62.5%. With the bonus magic resistance provided by the item, this is further increased to 70%.",
        "With the bonus magic resistance provided by the item, this is further increased to 70%."
      ],
      "mana": "90",
      "abilityName": "Glimmer",
      "cooldown": "14",
      "description": "After a 0.5 second delay, grants invisibility and 50% magic resistance to you or a target allied unit for 5 seconds. Can be cast while channelling.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks multiplicatively with other sources of magic resistance. Increases most heroes' total magic resistance to 40%.",
    "Increases most heroes' total magic resistance to 40%."
  ],
  "cost": "1950",
  "lore": null,
  "consistFrom": [
    "Shadow Amulet",
    "Cloak",
    "Recipe"
  ],
  "name": "Glimmer Cape",
  "description": "The stolen cape of a master illusionist.",
  "trivia": [
    "The game files contain an unused Glimmer Cape modifier, modifier_item_glimmer_cape_building_limit, which gets placed on buildings that were recently affected by Glimmer Cape.",
    "The modifier lasts for 180 seconds, is undispelable and prevents buildings from getting targeted by Glimmer Cape, as indicated by an unused HUD error message.",
    "This suggests that at one point in development, likely for patch 7.23, buildings were once considered to be eligible targets, just like Couriers and creeps were made targetable by Glimmer Cape."
  ],
  "upgradeIn": null,
  "tips": [
    "You can use the Glimmer Cape while teleporting away. This helps the wearer against disables which will interrupt the channeling."
  ]
}