{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Shadow_Amulet_Fade.mp3\/revision\/latest?cb=20191227195530",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников"
      ],
      "notes": [
        "Не прерывает произнесение заклинания у игрока при применении, ни при использовании на себя, ни при использовании на союзников.",
        "Если цель находится на расстоянии более 850 единиц, то владелец предмета перемещается в сторону цели до тех пор, пока между ними не окажется расстояние в 600 единиц. Если приказ на применение был дан на цель, которая уже находится в пределах 850 единиц, то владелец не перемещаться к цели и сразу же использует предмет.",
        "Если приказ на применение был дан на цель, которая уже находится в пределах 850 единиц, то владелец не перемещаться к цели и сразу же использует предмет.",
        "Владельцу не нужно поворачиваться к цели, чтобы использовать Shadow Amulet. Не прерывает произнесение заклинаний у цели.",
        "Во время ухода в невидимость, существо всё ещё может использовать способности, предметы и совершать атаки.",
        "После ухода в невидимость, существо останавливается и перестаёт атаковать, но не прекращает применять заклинание.",
        "Во время невидимости, существо может поворачиваться в разные стороны, подбирать и выкладывать предметы без потери невидимости.",
        "Во время невидимости, существо игнорирует столкновения, поэтому другие существа могут проходить сквозь него, не сталкиваясь с ним.",
        "Невидимость пропадает, если окончилось время применения заклинания, предмета или при выполнении атаки.",
        "Также невидимость пропадает при принудительном движении, кроме тех случаев, когда движение происходит только вверх."
      ],
      "mana": null,
      "abilityName": "Fade",
      "cooldown": "7 \/ 0",
      "description": "Накладывает на героя или выбранного союзника невидимость, которая действует, пока цель стоит на месте. Цель входит в невидимость за 1,25 сек. и мгновенно выходит из неё при передвижении. Не начинает перезаряжаться, если применить на себя.",
      "params": [
        "Стандартная дальность применения: 600",
        "Полная дальность применения: 850",
        "Время до невидимости: 1,25"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1000",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Разное",
  "name": "Shadow Amulet",
  "description": "Маленький талисман, затеняющий взор ваших врагов, но требующий абсолютной неподвижности.",
  "trivia": null,
  "upgradeIn": [
    "Glimmer Cape",
    "Shadow Blade"
  ],
  "bonuses": null,
  "tips": null
}