{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки.",
        "Талант на силу в общем даёт Timbersaw: 320 здоровья, 1,6 регенерации здоровья и 16 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1125 к дальности Timber Chain",
          "talentRight": "+10% к уменьшению атрибутов от Whirling Death"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−12% перезарядки заклинаний",
          "talentRight": "+16 к силе"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+6 к максимуму эффектов и длительности Reactive Armor",
          "talentRight": "+8% к урону от заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1,5 маны в секунду",
          "talentRight": "+200 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ec\/Timbersaw_Whirling_Death_1.mp3\/revision\/latest?cb=20191216025155",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Timbersaw.",
        "Whirling Death сначала применяет дебафф, затем наносит урон.",
        "Снижает общее значение основного атрибута задетых вражеских героев, включая бонусы. Снижение не обновляется, если цель получила или потеряла атрибут после применения дебаффа.",
        "Снижение не обновляется, если цель получила или потеряла атрибут после применения дебаффа.",
        "До нанесения урона способность сначала снижает текущее здоровье на 20 за каждую убранную единицу силы.",
        "При потере дебаффа враги сначала восстанавливают только 19 единиц здоровья за потерянную единицу силу, а затем получают обратно свои атрибуты.",
        "Не влияет на текущий процент соотношения маны задетых существ при возврате интеллекта.",
        "Не снижает значение атрибута до нуля.",
        "Дебаффы от нескольких применений складываются, накладывая каждый раз отдельный дебафф.",
        "Снижение атрибутов действует на иллюзии, клонов Meepo и Tempest Double."
      ],
      "mana": "80",
      "hotKey": "Q",
      "cooldown": "6 (TagTalent 5,28)",
      "description": "Герой вращает смертельно острые лезвия, нанося врагам вокруг урон, разрушая деревья и ненадолго снижая часть основного атрибута жертв. Способность наносит дополнительный урон за каждое срубаемое дерево.",
      "spellName": "Whirling Death",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 325",
        "Урон: 80\/120\/160\/200",
        "Доп. урон за дерево: 12\/18\/24\/30",
        "Снижение основного атрибута: 13%\/14%\/15%\/16% (TagTalent 23%\/24%\/25%\/26%)",
        "Длительность эффекта: 12\/13\/14\/15",
        "Снижение атрибутов остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "На случай, если Риззака окружат лозы и растения из его кошмаров, у него приготовлена экстренная система обороны пилами."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/81\/Timbersaw_Timber_Chain_1.mp3\/revision\/latest?cb=20191216025152",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя \/ Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Цепь летит со скоростью в 2200\/2400\/2600\/2800 единиц и всегда продолжает движение до достижения максимального расстояния или зацепления за дерево.",
        "Цепляется за дерево, находящееся на расстоянии до 850\/1000\/160\/1300 (TagTalent 1975\/2125\/1285\/2425) единиц (складывается из максимальной дальности прохождения и радиуса поиска дерева).",
        "Выбранное дерево разрушится после завершения притягивания.",
        "Может затянуть Timbersaw на непроходимую территорию и сквозь деревья.",
        "Timbersaw перестает притягиваться, если его обезвредят во время притягивания Timber Chain.",
        "Если Timbersaw обезвредят до начала притягивания цепью, то она переместит его на очень маленькое расстояние. Этого расстояния достаточно для нанесения урона существам вокруг героя или действия эффектов, учитывающих расстояние (например, Rupture).",
        "Этого расстояния достаточно для нанесения урона существам вокруг героя или действия эффектов, учитывающих расстояние (например, Rupture).",
        "Timbersaw может использовать способности и предметы, но не может атаковать пока притягивается.",
        "Клешня цепи дает наземный обзор в радиусе 100 единиц во время полета и наземный обзор в радиусе 400 единиц при достижении максимального расстояния или зацеплении за дерево.",
        "Если Timbersaw умирает во время притягивания и мгновенно воскрешается (например, после выкупа), то способность продолжит перемещать его по всей карте к выбранному дереву."
      ],
      "mana": "60\/70\/80\/90",
      "hotKey": "W",
      "cooldown": "4 (TagTalent 3,52)",
      "description": "Герой выпускает цепь, которая притягивает его к первому дереву на своём пути. Любой враг, задетый героем, получит урон.",
      "spellName": "Timber Chain",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 800\/950\/110\/1250 (TagTalent 1925\/2075\/1235\/2375)",
        "Макс. дальность прохождения: 800\/950\/110\/1250 (TagTalent 1925\/2075\/1235\/2375)",
        "Радиус поиска дерева: 50",
        "Радиус урона: 225",
        "Урон: 100\/140\/180\/220",
        "Воздействие оцепенения после применения не прервет зацепление и притягивание Timbersaw."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Никогда не знаешь, когда придется сбегать от злобной растительности."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Срабатывает только при попадании атаки по Timbersaw вне зависимости от расстояния. То есть способность не срабатывает от промахнувшихся атак.",
        "Вторичные атаки от Moon Glaives, Split Shot и Flak Cannon не активируют Reactive Armor.",
        "Срабатывает от вторичных атак других источников мгновенных атак.",
        "Срабатывает от атак любых существ независимо от принадлежности к команде или их типа (включая варды и постройки).",
        "Каждая успешная атака по Timbersaw дает ему 1 накопление. Оно добавляется сразу до нанесения урона.",
        "У каждого эффекта собственная длительность, не связанная с другими. Число накоплений отображается в иконке баффа.",
        "Каждый эффект за свою длительность восстанавливает до 7\/10,8\/15,4\/20,8 здоровья.",
        "Здесь указано, сколько регенерации здоровья дает Reactive Armor с определенным количеством зарядов на каждом уровне (включая талант на дополнительные заряды). Уровень 1: 0,7\/1,4\/2,1\/2,8\/3,5\/4,2\/4,9\/5,6\/6,3\/7\/7,7\/8,4 Уровень 2: 0,9\/1,8\/2,7\/3,6\/4,5\/5,4\/6,3\/7,2\/8,1\/9\/9,9\/10,8\/11,7\/12,6\/13,5\/14,4\/15,3\/16,2 Уровень 3: 1,1\/2,2\/3,3\/4,4\/5,5\/6,6\/7,7\/8,8\/9,9\/11\/12,1\/13,2\/14,3\/15,4\/16,5\/17,6\/18,7\/19,8\/20,9\/22\/23,1\/24,2\/25,3\/26,4 Уровень 4: 1,3\/2,6\/3,9\/5,2\/6,5\/7,8\/9,1\/10,4\/11,7\/13\/14,3\/15,6\/16,9\/18,2\/19,5\/20,8\/22,1\/23,4\/24,7\/26\/27,3\/28,6\/29,9\/31,2\/32,5\/33,8\/35,1\/36,4\/37,7\/39",
        "Уровень 1: 0,7\/1,4\/2,1\/2,8\/3,5\/4,2\/4,9\/5,6\/6,3\/7\/7,7\/8,4",
        "Уровень 2: 0,9\/1,8\/2,7\/3,6\/4,5\/5,4\/6,3\/7,2\/8,1\/9\/9,9\/10,8\/11,7\/12,6\/13,5\/14,4\/15,3\/16,2",
        "Уровень 3: 1,1\/2,2\/3,3\/4,4\/5,5\/6,6\/7,7\/8,8\/9,9\/11\/12,1\/13,2\/14,3\/15,4\/16,5\/17,6\/18,7\/19,8\/20,9\/22\/23,1\/24,2\/25,3\/26,4",
        "Уровень 4: 1,3\/2,6\/3,9\/5,2\/6,5\/7,8\/9,1\/10,4\/11,7\/13\/14,3\/15,6\/16,9\/18,2\/19,5\/20,8\/22,1\/23,4\/24,7\/26\/27,3\/28,6\/29,9\/31,2\/32,5\/33,8\/35,1\/36,4\/37,7\/39",
        "Здесь указано, сколько брони дает Reactive Armor с определенным количеством зарядов на каждом уровне (включая талант на дополнительные заряды). Уровень 1: 0,9\/1,8\/2,7\/3,6\/4,5\/5,4\/6,3\/7,2\/8,1\/9\/9,9\/10,8 Уровень 2: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14\/15\/16\/17\/18 Уровень 3: 1,1\/2,2\/3,3\/4,4\/5,5\/6,6\/7,7\/8,8\/9,9\/11\/12,1\/13,2\/14,3\/15,4\/16,5\/17,6\/18,7\/19,8\/20,9\/22\/23,1\/24,2\/25,3\/26,4 Уровень 4: 1,2\/2,4\/3,6\/4,8\/6\/7,2\/8,4\/9,6\/10,8\/12\/13,2\/14,4\/15,6\/16,8\/18\/19,2\/20,4\/21,6\/22,8\/24\/25,2\/26,4\/27,6\/28,8\/30\/31,2\/32,4\/33,6\/34,8\/36",
        "Уровень 1: 0,9\/1,8\/2,7\/3,6\/4,5\/5,4\/6,3\/7,2\/8,1\/9\/9,9\/10,8",
        "Уровень 2: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14\/15\/16\/17\/18",
        "Уровень 3: 1,1\/2,2\/3,3\/4,4\/5,5\/6,6\/7,7\/8,8\/9,9\/11\/12,1\/13,2\/14,3\/15,4\/16,5\/17,6\/18,7\/19,8\/20,9\/22\/23,1\/24,2\/25,3\/26,4",
        "Уровень 4: 1,2\/2,4\/3,6\/4,8\/6\/7,2\/8,4\/9,6\/10,8\/12\/13,2\/14,4\/15,6\/16,8\/18\/19,2\/20,4\/21,6\/22,8\/24\/25,2\/26,4\/27,6\/28,8\/30\/31,2\/32,4\/33,6\/34,8\/36",
        "Число зарядов также показывается с помощью купола, закрывающего Timbersaw. Также до закрытия купола в выхлопах из трубы появляется пламя. У купола 4 части, которые выдвигаются по мере получения новых 4-х зарядов (1-4, 5-8, 9-12, 13-16). Купол вновь откроется при потере части накопленных зарядов.",
        "У купола 4 части, которые выдвигаются по мере получения новых 4-х зарядов (1-4, 5-8, 9-12, 13-16). Купол вновь откроется при потере части накопленных зарядов."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Каждый раз, когда кто-то атакует героя, его броня и восстановление здоровья увеличиваются.",
      "spellName": "Reactive Armor",
      "params": [
        "Максимум эффектов: 6\/12\/18\/24 (TagTalent 12\/18\/24\/30)",
        "Доп. броня от эффекта: 0,9\/1\/1,1\/1,2",
        "Доп. восстановление здоровья от эффекта: 0,7\/0,9\/1,1\/1,3",
        "Длительность одного эффекта: 10\/12\/14\/16 (TagTalent 16\/18\/20\/22)",
        "Предотвращает получение новых накоплений. Уже существующие по-прежнему дают регенерацию здоровья и броню. Если истощение применено атакой, способность сначала среагирует на неё и лишь затем отключится.",
        "Иллюзии получают заряды и регенерацию здоровья от них, но не броню."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Пил-костюм был сконструирован так, что он моментально реагирует на малейшее прикосновение, укрепляя защиту."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Timbersaw_Chakram_1.mp3\/revision\/latest?cb=20191216025147",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Чистый"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. Доступна в режиме Ability Draft.",
        "Если Aghanim's Scepter приобретается до изучения Chakram, то эта способность будет 1-го уровня.",
        "Уровень этой способности равен уровню основной.",
        "Эта пила действует так же, как и основная. Две пилы работают независимо друг от друга.",
        "При этом пилы имеют общий дебафф замедления, поэтому дебаффы от них не складываются, но обновляют длительность друг друга.",
        "Также обезоруживает Timbersaw при активации."
      ],
      "mana": "80\/140\/200",
      "hotKey": "D",
      "cooldown": "8 (TagTalent 7,04)",
      "description": "Запускает в указанное место запасную пилу, которая вращается, наносит урон врагам и замедляет их передвижение. Замедление действует всё сильнее за каждые 5% потерянного здоровья. Пила наносит чистый урон и срезает все деревья на своем пути. Пока способность активна, вы не можете атаковать и постепенно теряете ману.",
      "spellName": "Second Chakram",
      "params": [
        "Анимация применения: 0,15+0",
        "Дальность применения: 1200",
        "Радиус: 200",
        "Моментальный урон: 100\/140\/180",
        "Урон в секунду: 70\/95\/120",
        "Замедление скорости передвижения за потерю 5% от макс. здоровья: 5%",
        "Расход маны в секунду: 16\/23\/30",
        "Длительность задержки ауры: 0,5",
        "Длительность моментального замедления: 0,5",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Режь-режь-режь-режь-режь-режь-режь-режь-режь-режь-режь!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d0\/Timbersaw_Return_Chakram.mp3\/revision\/latest?cb=20191216025151",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Second Chakram до возвращения голубой пилы к Timbersaw.",
        "При использовании не прерывает произносимые способности Timbersaw."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Возвращает пилу от способности Chakram к герою.",
      "spellName": "Return Chakram (Aghanim's Scepter)",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Timbersaw_Flamethrower_1.mp3\/revision\/latest?cb=20210103154315",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "При применении прервает произносимые заклинания Timbersaw.",
        "Область поражения выглядит как конус.",
        "Применяет в области дебафф огня с интервалом в 0,1 секунды сразу после применения, срабатывая 71 раз.",
        "Дебафф наносит 45 урона с интервалом в 0,5 секунды сразу после размещения, срабатывая минимум 7 раз. Срабатывает до 21 раз, если враг оставался в пламени всю длительность.",
        "Срабатывает до 21 раз, если враг оставался в пламени всю длительность.",
        "Наносит минимум до 315 урона (153 строениям), учитывая минимальную длительность (до уменьшений). Наносит до 945 урона, если враг оставался в пламени всю длительность (до уменьшений). Наносит до 405 урона строениям.",
        "Наносит до 945 урона, если враг оставался в пламени всю длительность (до уменьшений).",
        "Наносит до 405 урона строениям.",
        "Любое дерево в области эффекта загорается и затем разрушается спустя 5 сек.",
        "Во время действия дает наземный обзор в радиусе 175 на расстоянии 400 перед Timbersaw."
      ],
      "mana": "100",
      "hotKey": "F",
      "cooldown": "18 (TagTalent 15.84)",
      "description": "Герой 7 сек. выпускает перед собой пламя шириной 275 и длиной 400. Оно наносит врагам 90 урона в секунду и замедляет их на 30%. Наносит постройкам 40% урона. Выйдя из пламени, враги горят ещё 3 секунды.",
      "spellName": "Flamethrower",
      "params": [
        "Анимация применения: 0+0",
        "Начальный радиус: 0",
        "Длина: 400",
        "Конечный радиус: 275",
        "Урон в секунду: 90",
        "Замедление скорости передвижения: 30%",
        "Задержка разрушения деревьев: 5",
        "Длительность дебаффа: 3",
        "Длительность: 7",
        "Урон по постройкам: 40%"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Timbersaw_Chakram_1.mp3\/revision\/latest?cb=20191216025147",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Чистый"
      ],
      "notes": [
        "Chakram движется со скоростью 900. Обезоруживает Timbersaw после запуска пилы и до её возвращения. При движении к выбранной точке пила наносит моментальный урон и замедляет вражеских существ, оказавшихся на пути. При достижении выбранной области Chakram начинает расходовать ману, наносить периодический урон и применять ауру замедления. Расходует 8\/11,5\/15 маны с интервалом в 0,5 секунды спустя 0,5 секунды после достижения выбранной области. Наносит 25\/37,5\/50 единиц урона (до уменьшений) с интервалом в 0,5 секунды спустя 0,5 секунды после достижения выбранной области. Chakram перестает расходовать ману и наносить урон, как только начинает возвращаться к владельцу. При возвращении Chakram снова наносит моментальный урон и замедляет вражеских существ, оказавшихся на пути, вновь применяя дебафф. Замедление от прохождения (в любом направлении) длится 0,5 сек. Дебафф замедления от ауры при нахождении в пиле задерживается на 0,5 сек. Дебафф замедления от прохождения и нахождения одинаковы. При этом дебафф прохождения можно развеять, а нахождения - нет. Пролетающая пила сначала наносит моментальный урон, затем применяет дебафф.",
        "Обезоруживает Timbersaw после запуска пилы и до её возвращения.",
        "При движении к выбранной точке пила наносит моментальный урон и замедляет вражеских существ, оказавшихся на пути.",
        "При достижении выбранной области Chakram начинает расходовать ману, наносить периодический урон и применять ауру замедления.",
        "Расходует 8\/11,5\/15 маны с интервалом в 0,5 секунды спустя 0,5 секунды после достижения выбранной области.",
        "Наносит 25\/37,5\/50 единиц урона (до уменьшений) с интервалом в 0,5 секунды спустя 0,5 секунды после достижения выбранной области.",
        "Chakram перестает расходовать ману и наносить урон, как только начинает возвращаться к владельцу.",
        "При возвращении Chakram снова наносит моментальный урон и замедляет вражеских существ, оказавшихся на пути, вновь применяя дебафф.",
        "Замедление от прохождения (в любом направлении) длится 0,5 сек. Дебафф замедления от ауры при нахождении в пиле задерживается на 0,5 сек.",
        "Дебафф замедления от прохождения и нахождения одинаковы. При этом дебафф прохождения можно развеять, а нахождения - нет.",
        "Пролетающая пила сначала наносит моментальный урон, затем применяет дебафф.",
        "Пила вернется к Timbersaw при использовании Return Chakram или автоматически, если пила будет более чем в 2000 единицах от героя.",
        "Первые 5% замедления скорости передвижения применяются на 100–96% здоровья, поэтому 100% замедление будет между 1% и 5% здоровья.",
        "Моментальный урон поражает одно и того же существо только 2 раза за применение: в момент движения пилы к выбранной точке и при её возврате.",
        "Наносит урон до дебаффа.",
        "Замедление от нескольких пил (оранжевой и голубой или нескольких оранжевых\/голубых) не складывается.",
        "Пила дает летающий обзор в радиусе 300 единиц, пока вращается на месте в выбранной области (но не в момент движения)."
      ],
      "mana": "80\/140\/200",
      "hotKey": "R",
      "cooldown": "8 (TagTalent 7,04)",
      "description": "Запускает в указанное место пилу, которая вращается, наносит урон врагам и замедляет их передвижение. Замедление усиливается за каждые 5% потерянного здоровья. Пила наносит чистый урон и срезает все деревья на своём пути. Пока способность действует, её владелец не может атаковать и постепенно теряет ману.",
      "spellName": "Chakram",
      "params": [
        "Анимация применения: 0,15+0",
        "Дальность применения: 1200",
        "Радиус: 200",
        "Моментальный урон: 100\/140\/180",
        "Урон в секунду: 50\/75\/100 (TagAghanim 70\/95\/120)",
        "Замедление скорости передвижения за потерю 5% от макс. здоровья: 5%",
        "Расход маны в секунду: 16\/23\/30",
        "Длительность задержки ауры: 0,5",
        "Длительность моментального замедления: 0,5",
        "Дарует новую способность: Second Chakram.",
        "Дарует новую способность: Flamethrower.",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Универсальное оружие для изничтожения флоры."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d0\/Timbersaw_Return_Chakram.mp3\/revision\/latest?cb=20191216025151",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Chakram до полного возвращения оранжевого Chakram к Timbersaw.",
        "При использовании не прерывает произносимые способности Timbersaw."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Возвращает пилу от способности Chakram к герою.",
      "spellName": "Return Chakram",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 24.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Timbersaw — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Whirling Death, вращает смертельно острые лезвия, нанося врагам урон и разрушая деревья в области вокруг себя. Вражеские герои, получившие урон, дополнительно потеряют определенное значение своей основной характеристики. Способность наносит чистый урон. Вторая способность, Timber Chain, выпускает гарпун, который цепляется за первое попавшееся дерево и притягивает героя к этому дереву. Любой враг, оказавшийся на пути, получит урон. Данной способностью герой притягивается к дальнему дереву, при этом нанося урон противникам, оказавшимся на пути. Пассивная способность, Reactive Armor, получает дополнительную броню и ускоренный реген здоровья, каждый раз, когда кто-то атакует Timbersaw. Ультимативная способность, Chakram, запускает лезвие вашей пилы в указанное место, где оно начинает вращаться, нанося урон врагам вокруг себя. Враги, атакованные пилой, будут передвигаться медленнее за каждые 5% потерянного здоровья. Лезвие наносит чистый урон и срезает деревья на своем пути до цели и при обратном движении. Timbersaw теряет возможность атаковать и теряет ману, пока способность активна. Улучшение с Aghanim's Scepter добавляет второй Second Chakram.",
  "history": "Риззрак никак не мог забыть тех криков. Он лихорадочно крутил гайки и винты, строил, вырезал, ковал. Сон покинул его в угоду работе. Прошли уже месяцы с того момента, как он закрылся в мастерской своего дядюшки, и освобождение было близко как никогда. Почесав спину, Риззрак на мгновение закрыл глаза, и тут же перед ними предстали цветы, покачивающиеся на тихих волнах Бухты прорицаний за мгновения до того, как они обратятся облаком пыльцы, забивающей лёгкие и отбирающей жизни. Риззрак встрепенулся и заработал с ещё большим рвением. Часами мастерскую наполнял ритмичный визг шлифовального бруска: то Риззрак натачивал лезвия своих огромных пил, а в его разуме была только одна картина — как лозы удушали его соседей и опутывали дома. Потоп в Бухте прорицаний был ничем в сравнении с тем, что пустило корни в стены города. Риззрак думал, что пил-костюм сделает его сильнее, и эта мысль была последним рубежом перед поглощавшим разум страхом. Ветви, щепки и кровь. Когда город пал, Риззрак бежал от деревьев, что ходили, сражались и убивали. Деревья разбили ворота и заполонили город. Деревья разрушали последние укрепления Бухты прорицаний и преследовали немногих выживших. В абсолютной тишине мастерской раздавался грохот: Риззрак вытянул из костюма толстую цепь и дрожащими руками проверял каждое звено и клешню на её конце. Пил-костюм был готов. Всё ещё дрожа, он запустил обвешанный лезвиями механизм. Его обуял страх — страх перед тем, что его ждало и с чем ему предстоит сразиться, чтобы вернуть разуму покой. Запуская костюм, Риззрак знал, что он должен взглянуть своему страху в глаза, как и знал, что это совсем ему не понравится.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1125 к дальности Timber Chain",
      "talentRight": "+10% к уменьшению атрибутов от Whirling Death"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−12% перезарядки заклинаний",
      "talentRight": "+16 к силе"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+6 к максимуму эффектов и длительности Reactive Armor",
      "talentRight": "+8% к урону от заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1,5 маны в секунду",
      "talentRight": "+200 к здоровью"
    }
  ]
}