{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Necrophos_Death_Pulse.mp3\/revision\/latest?cb=20191216020945",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "notes": [
        "При применении Death Pulse прерывает произносимые заклинания Necrophos.",
        "Волна летит со скоростью 400 единиц.",
        "Действует на невидимых существ и существ в тумане войны. Не действует на неуязвимых и спрятанных существ. Действует на курьеров: лечит союзного курьера, но не наносит урон вражескому.",
        "Не действует на неуязвимых и спрятанных существ.",
        "Действует на курьеров: лечит союзного курьера, но не наносит урон вражескому.",
        "Во время действия Ghost Shroud лечит Necrophos на следующие значения на каждом уровне: Уровень 1: 58,3\/84,8\/111,3\/137,8 (TagTalent 92,22\/118,72\/145,22\/171,72) Уровень 2: 61,6\/89,6\/117,6\/145,6 (TagTalent 97,44\/125,44\/153,44\/181,44) Уровень 3: 64,9\/94,4\/123,9\/153,4 (TagTalent 102,66\/132,16\/161,66\/191,16) Уровень 4: 68,2\/99,2\/130,2\/161,2 (TagTalent 107,88\/138,88\/169,88\/200,88)",
        "Уровень 1: 58,3\/84,8\/111,3\/137,8 (TagTalent 92,22\/118,72\/145,22\/171,72)",
        "Уровень 2: 61,6\/89,6\/117,6\/145,6 (TagTalent 97,44\/125,44\/153,44\/181,44)",
        "Уровень 3: 64,9\/94,4\/123,9\/153,4 (TagTalent 102,66\/132,16\/161,66\/191,16)",
        "Уровень 4: 68,2\/99,2\/130,2\/161,2 (TagTalent 107,88\/138,88\/169,88\/200,88)",
        ""
      ],
      "mana": "8\/7\/6\/5 (TagTalent 5,5\/4,5\/3,5\/2,5)",
      "item_behaviour": [],
      "name": "Death Pulse",
      "cooldown": "100\/130\/160\/190",
      "description": "Герой выпускает вокруг себя волну смерти, которая наносит урон врагам и исцеляет союзников.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,77",
        "Радиус: 500",
        "Скорость снаряда: 400",
        "Урон: 100\/160\/220\/280",
        "Лечение: 55\/80\/105\/130 ( 87\/112\/137\/162)"
      ],
      "legacy_key": "D",
      "story": "Ротунд'йер не тратит души несчастных чумных понапрасну."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Necrophos_Ghost_Shroud.mp3\/revision\/latest?cb=20191216020946",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Necrophos.",
        "Применяет к Necrophos призрачную форму, обезоруживая его, делая его неуязвимым к атакам и давая 100% сопротивление к физическому урону.",
        "Снижает общее сопротивление магии Necrophos до 6,25%, учитывая его базовое сопротивление в 25% и не учитывая другие источники сопротивления. Сочетается мультипликативно с другими источниками сопротивления магии.",
        "Сочетается мультипликативно с другими источниками сопротивления магии.",
        "Уменьшение сопротивления магии не сочетается с уменьшениями других призрачных форм, будет действовать уменьшение с наибольшим значением.",
        "Применяет усиление лечения, регенерации здоровья, восстановления и регенерации маны, но не усиление вампиризма или вампиризма заклинаний.",
        "Замедление представлено в виде ауры. Дебафф задерживается на 0,5 сек."
      ],
      "mana": "28\/24\/20\/16 (TagTalent 10)",
      "item_behaviour": [],
      "name": "Ghost Shroud",
      "cooldown": "50",
      "description": "Герой открывает связь с миром усопших, замедляя врагов вокруг. В этой форме он не может атаковать, получает повышенный магический урон, но защищён от физических атак и быстрее восстанавливает свои здоровье и ману.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус замедления: 750",
        "Замедление передвижения врага: 6%\/12%\/18%\/24% ( 30%\/36%\/42%\/48%)",
        "Усиление восстановления: 45%\/55%\/65%\/75% ( 60%\/70%\/80%\/90%)",
        "Доп. магический урон: 25%",
        "Длительность задержки ауры: 0,5",
        "Длительность: 3\/3,5\/4\/4,5"
      ],
      "legacy_key": "T",
      "story": "Душами падших Ротунд'йер стирает грань жизни и смерти."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "Дебафф от Heartstopper Aura задерживается на 0,5 сек.",
        "Потеря здоровья от Heartstopper Aura — это отнимающий здоровье урон, поэтому на него не срабатывают любые эффекты, реагирующие на урон. Урон можно увеличить понижением сопротивления магии цели, но на него не действует усиление урона заклинаний.",
        "Урон можно увеличить понижением сопротивления магии цели, но на него не действует усиление урона заклинаний.",
        "Наносит 0,12%\/0,24%\/0,36%\/0,48% (TagTalent 0,22%\/0,34%\/0,46%\/0,58%) от максимального здоровья существа в качестве урона с интервалом в 0,2, начиная спустя 0,2 секунды после изучения способности. Выбор увеличивающего потерю здоровья в секунду таланта не увеличит урон по противникам, если они уже находятся под действием ауры. Для обновления значений им нужно потерять эффект ауры и снова его получить.",
        "Выбор увеличивающего потерю здоровья в секунду таланта не увеличит урон по противникам, если они уже находятся под действием ауры. Для обновления значений им нужно потерять эффект ауры и снова его получить.",
        "Иконка дебаффа показывается врагам в случае, если у затронутого существа есть обзор на Necrophos. Однако цифры урона видны всегда.",
        "Однако цифры урона видны всегда.",
        "Не действует на древних крипов.",
        "Necrophos получает заряд за каждое совершенное убийство, включая добивание союзных существ, но исключая убийство иллюзий и Tempest Double. Каждый заряд действует независимо от других. Они не обновляются при появлении нового, но делят между собой иконку в строке эффектов. Текущее число зарядов видно в иконке. Каждый заряд восстанавливает до 32\/40\/48\/56 (TagTalent 40\/50\/60\/70) единиц здоровья и маны за всю длительность. Убийство героя добавляет сразу 6 зарядов, которые восстанавливают до 192\/240\/288\/336 (TagTalent 240\/300\/360\/420) здоровья и маны за всю длительность.",
        "Каждый заряд действует независимо от других. Они не обновляются при появлении нового, но делят между собой иконку в строке эффектов. Текущее число зарядов видно в иконке.",
        "Каждый заряд восстанавливает до 32\/40\/48\/56 (TagTalent 40\/50\/60\/70) единиц здоровья и маны за всю длительность.",
        "Убийство героя добавляет сразу 6 зарядов, которые восстанавливают до 192\/240\/288\/336 (TagTalent 240\/300\/360\/420) здоровья и маны за всю длительность.",
        "Во время действия Ghost Shroud восстанавливает Necrophos следующие значения на каждом уровне: Уровень 1: 5,8\/7,25\/8,7\/10,15 (TagTalent 6,4\/8\/9,6\/11,2) за эффект, 17\/22\/26\/30 (TagTalent 19\/24\/29\/34) здоровья и маны. Уровень 2: 6,2\/7,75\/9,3\/10,85 (TagTalent 6,8\/8,5\/10,2\/11,9) за эффект, 22\/27\/33\/38 (TagTalent 24\/30\/36\/42) здоровья и маны. Уровень 3: 6,6\/8,25\/9,9\/11,55 (TagTalent 7,2\/9\/10,8\/12,6) за эффект, 26\/33\/40\/46 (TagTalent 29\/36\/43\/50) здоровья и маны. Уровень 4: 7\/8,75\/10,5\/12,25 (TagTalent 7,6\/9,5\/11,4\/13,3) за эффект, 32\/39\/47\/55 (TagTalent 34\/43\/51\/60) здоровья и маны.",
        "Уровень 1: 5,8\/7,25\/8,7\/10,15 (TagTalent 6,4\/8\/9,6\/11,2) за эффект, 17\/22\/26\/30 (TagTalent 19\/24\/29\/34) здоровья и маны.",
        "Уровень 2: 6,2\/7,75\/9,3\/10,85 (TagTalent 6,8\/8,5\/10,2\/11,9) за эффект, 22\/27\/33\/38 (TagTalent 24\/30\/36\/42) здоровья и маны.",
        "Уровень 3: 6,6\/8,25\/9,9\/11,55 (TagTalent 7,2\/9\/10,8\/12,6) за эффект, 26\/33\/40\/46 (TagTalent 29\/36\/43\/50) здоровья и маны.",
        "Уровень 4: 7\/8,75\/10,5\/12,25 (TagTalent 7,6\/9,5\/11,4\/13,3) за эффект, 32\/39\/47\/55 (TagTalent 34\/43\/51\/60) здоровья и маны.",
        "",
        "Снижающий восстановления здоровья у жертв талант лишь добавляет к Heartstopper Aura эффект уменьшения восстановления здоровья, но не уменьшение лечения, уменьшение вампиризма или уменьшение вампиризма заклинаний.",
        "С Aghanim's Scepter Heartstopper Aura наносит 0,24%\/0,48%\/0,72%\/0,96% (TagTalent 0,44%\/0,68%\/0,92%\/1,16%) от максимального здоровья существа в качестве урона с интервалом в 0,2 секунды, пока активна Ghost Shroud. Подводя итог, наносит 1,2%\/2,4%\/3,6%\/4,8% (TagTalent 2,2%\/3,4%\/4,6%\/5,8%) от максимального здоровья существа каждую секунду, пока Necrophos находится под действием Ghost Shroud.",
        "С Aghanim's Scepter Heartstopper Aura наносит 0,24%\/0,48%\/0,72%\/0,96% (TagTalent 0,44%\/0,68%\/0,92%\/1,16%) от максимального здоровья существа в качестве урона с интервалом в 0,2 секунды, пока активна Ghost Shroud.",
        "Подводя итог, наносит 1,2%\/2,4%\/3,6%\/4,8% (TagTalent 2,2%\/3,4%\/4,6%\/5,8%) от максимального здоровья существа каждую секунду, пока Necrophos находится под действием Ghost Shroud."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Heartstopper Aura",
      "cooldown": null,
      "description": "Герой останавливает сердца врагов вокруг, отчего они постепенно теряют часть максимального здоровья. Также на 0,5 сек. ускоряет восстановление здоровья и маны за каждое убитое существо.",
      "hot_key": "E",
      "params": [
        "Радиус: 800",
        "Уменьшение макс. здоровья в секунду: 0,6%\/1,2%\/1,8%\/2,4% ( 1,1%\/1,7%\/2,3%\/2,9%)",
        "Множитель урона от Ghost Shroud: 1 ( 2)",
        "Зарядов за убийство героя: 6",
        "Зарядов за убийство не-героя: 1",
        "Восстановление здоровья за убийство: 4\/5\/6\/7",
        "Восстановление маны за убийство: 4\/5\/6\/7",
        "Длительность заряда: 8 ( 10)",
        "Длительность задержки ауры: 0,5",
        "Уменьшение регенерации здоровья: 32%"
      ],
      "legacy_key": "I",
      "story": "Дерзнувших приблизиться к Ротунд`йеру окутывает дух мора и чумы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Necrophos_Death_Seeker.mp3\/revision\/latest?cb=20210101213914",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Врагов"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Нельзя применить на себя.",
        "Снаряд летит со скоростью 900.",
        "Death Seeker сначала накладывает дебафф, затем применяет Death Pulse.",
        "Делает цель бесплотной, обезоруживая её и давая иммунитет к атакам и 100% физическое сопротивление. Уменьшение сопротивления магии не сочетается с уменьшениями других призрачных форм, будет действовать уменьшение с наибольшим значением. Снижает сопротивление магии большинства героев до 6,25%. Сочетается мультипликативно с другими источниками сопротивления магии.",
        "Уменьшение сопротивления магии не сочетается с уменьшениями других призрачных форм, будет действовать уменьшение с наибольшим значением.",
        "Снижает сопротивление магии большинства героев до 6,25%.",
        "Сочетается мультипликативно с другими источниками сопротивления магии.",
        "Применяет Death Pulse текущего уровня. Действуют те же примечания, что и для Death Pulse. Если Death Pulse не изучена, то при применении снаряд не выпустится, мана потратится и начнется перезарядка. Если цель при попадании снаряда неуязвима или спрятана, то Death Pulse не выпустится. Death Pulse наносит 125\/200\/275\/350 урона каждому врагу, который попал в целевой радиус.",
        "Если Death Pulse не изучена, то при применении снаряд не выпустится, мана потратится и начнется перезарядка.",
        "Если цель при попадании снаряда неуязвима или спрятана, то Death Pulse не выпустится.",
        "Death Pulse наносит 125\/200\/275\/350 урона каждому врагу, который попал в целевой радиус."
      ],
      "mana": "16",
      "item_behaviour": [],
      "name": "Death Seeker",
      "cooldown": "125",
      "description": "Выпускает в выбранного врага или союзника один быстрый и большой снаряд способности Death Pulse, который делает цель бесплотной и, если это враг, уменьшает её сопротивление магии. Долетев до цели, снаряд применит Death Pulse вокруг неё.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,67",
        "Дальность применения: 900",
        "Уменьшение сопротивления магии: 25%",
        "Длительность: 2,5"
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a9\/Necrophos_Reaper%27s_Scythe.mp3\/revision\/latest?cb=20191216020948",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "notes": [
        "Может быть использовано на иллюзии и крипов-героев.",
        "Урон рассчитывается и наносится в конце действия оглушения.",
        "Наносит достаточно урона для убийства героя (до уменьшений), если у цели максимум 41%\/44%\/47% от её здоровья. C Death Seeker Reaper's Scythe deals наносит достаточно урона для убийства героя, если у цели осталось 51%\/56%\/59% от её здорвовья.",
        "C Death Seeker Reaper's Scythe deals наносит достаточно урона для убийства героя, если у цели осталось 51%\/56%\/59% от её здорвовья.",
        "Убийство под эффектом этой способности засчитывает как убийство, совершенное Necrophos. Если выбранное существо было убито союзником, то убийство не считается за добивание — убийцей будет Necrophos. Имеет приоритет ниже, чем у Ice Blast. Если выбранная цель умирает от раскола Ice Blast, убийство не будет приписано Necrophos, если только он не оказался причиной, из-за которой произошел взрыв цели. Имеет приоритет выше, чем Winter's Curse. Если на цель действуют оба эффекта, то убийство будет засчитано Necrophos.",
        "Если выбранное существо было убито союзником, то убийство не считается за добивание — убийцей будет Necrophos.",
        "Имеет приоритет ниже, чем у Ice Blast. Если выбранная цель умирает от раскола Ice Blast, убийство не будет приписано Necrophos, если только он не оказался причиной, из-за которой произошел взрыв цели.",
        "Имеет приоритет выше, чем Winter's Curse. Если на цель действуют оба эффекта, то убийство будет засчитано Necrophos.",
        "Necrophos получает постоянный эффект, если убийство было засчитано ему. Получает эффект, даже если цель имела возможность воскреснуть. Не получает эффект от иллюзии, крипов-героев и копии Tempest Double. Число эффектов показано на иконке баффа. Текущий бонус к восстановлению здоровья и маны указан в описании этого эффекта.",
        "Получает эффект, даже если цель имела возможность воскреснуть. Не получает эффект от иллюзии, крипов-героев и копии Tempest Double.",
        "Число эффектов показано на иконке баффа. Текущий бонус к восстановлению здоровья и маны указан в описании этого эффекта.",
        "При повышении уровня Reaper's Scythe все накопленные эффекты адаптируются под новые значения.",
        "Длительность оглушения не взаимодействует с сопротивлением эффектам."
      ],
      "mana": "110",
      "item_behaviour": [],
      "name": "Reaper's Scythe",
      "cooldown": "250\/375\/500",
      "description": "Оглушает выбранного вражеского героя, а затем наносит ему урон, пропорциональный отсутствующему у него здоровью. Убийство врага под действием этой способности засчитывается её владельцу и навсегда увеличивает ему восстановление здоровья и маны.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,45+1,5",
        "Дальность применения: 600 ( 700)",
        "Урон за единицу здоровья: 0,7\/0,8\/0,9",
        "Доп.восстановление здоровья: 2\/4\/6",
        "Доп.восстановление маны: 1\/2\/3",
        "Длительность оглушения: 1,5"
      ],
      "legacy_key": "R",
      "story": "Смерть и страдания, витающие в воздухе, усиливают чумную магию Ротунд'йера."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Одновременно лечит союзников и наносит урон врагам Necrophos всюду несёт благополучие друзьям и смерть — врагам. Излечивая союзников и нанося противникам урон каждым пульсом смерти, он изничтожает врагов одним лишь своим присутствием. Также Necrophos может воззвать к помощи самого жнеца, который надолго задержит жертву в мире ином.  Керри Быстрый урон Стойкость Контроль ★☆☆",
  "history": "В годы ужасной чумы один безвестный монах с дурными наклонностями по имени Ротунд'йер неожиданно для себя занял пост кардинала: все другие претенденты на должность скоропостижно скончались. В то время как другие братья-монахи облегчали участь больных, новоиспечённый кардинал заседал в Соборе Румуска, обещая умирающим богачам духовное вознаграждение, коли те передадут свои земли их ордену. Со временем чума угасла, оставив лишь пару неуступчивых очагов, а на деяния Ротунд'йера обратила внимание высшая власть. Бывшего кардинала обвинили в ереси и отрядили ухаживать за чумными, где его медленно и мучительно пожрала бы болезнь. Но судьи не учли, что чума стала Ротунд'йеру родной. Хворь вошла в тело монаха — но не убила, а стала кормить его силы и превратила в сущего чумного мага, Епископа мора. Теперь он ходит по земле, распространяя свою эпидемию, и мощь его растёт с каждой деревней, сгинувшей в его губительном присутствии."
}