{
  "abilities": [
    {
      "notes": [
        "Талант на уклонение мультипликативно сочетается с другими источниками уклонения."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+6 к числу эффектов Refraction",
          "talentRight": "1 сек. оглушения от атаки из Meld"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-3 к броне врага от Meld",
          "talentRight": "Meld развеивает отрицательные эффекты"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+160 к урону от Psionic Trap",
          "talentRight": "+15% к уклонению"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости передвижения",
          "talentRight": "+15 к скорости атаки"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Templar_Assassin_Refraction_1.mp3\/revision\/latest?cb=20191216025003",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Refraction прерывает произносимые способности Templar Assassin.",
        "Применяет 2 баффа к Templar Assassin: \"Refraction - Урон\" и \"Refraction - Поглощение\". Один бафф дает заряды для дополнительного урона, другой - заряды для блокировки урона.",
        "Число оставшихся зарядов видно в иконке баффа. Баффы и визуальные эффекты от способности видны всем.",
        "Дополнительный урон добавляется как обычный дополнительный урон и виден в интерфейсе. Потеря заряда дополнительного урона происходит при успешном попадании снаряда атаки в цель. Атака, которая промахнулась или которую избежали, не учитывается. Не теряет заряды и не применяет дополнительный урон при атаке союзников. При использовании Refraction во время полета снаряда атаки дополнительный урон к нему не применяется, но при этом один заряд при попадании будет потрачен.",
        "Потеря заряда дополнительного урона происходит при успешном попадании снаряда атаки в цель. Атака, которая промахнулась или которую избежали, не учитывается.",
        "Не теряет заряды и не применяет дополнительный урон при атаке союзников.",
        "При использовании Refraction во время полета снаряда атаки дополнительный урон к нему не применяется, но при этом один заряд при попадании будет потрачен.",
        "Поглощение урона отрицает урон, то есть отдельные эффекты, реагирующие на урон, не будут срабатывать. У способности приоритет выше, чем у Aphotic Shield и Living Armor, но ниже, чем у False Promise. При этом способность продолжит терять заряды при использовании с False Promise. Урон ниже 5 (после уменьшений) игнорируется способностью. Он не блокируется, но и не тратит заряды для блокировки. Refraction отрицает все 3 типа урона. Способность не отрицает урон, отмеченный как отнимающий здоровье.",
        "У способности приоритет выше, чем у Aphotic Shield и Living Armor, но ниже, чем у False Promise. При этом способность продолжит терять заряды при использовании с False Promise.",
        "Урон ниже 5 (после уменьшений) игнорируется способностью. Он не блокируется, но и не тратит заряды для блокировки.",
        "Refraction отрицает все 3 типа урона. Способность не отрицает урон, отмеченный как отнимающий здоровье."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "17",
      "description": "Герой становятся неуловимым, избегая любого урона и нанося больше урона атаками. Эти эффекты действуют ограниченное число раз и считаются раздельно.",
      "spellName": "Refraction",
      "params": [
        "Анимация применения: 0+0",
        "Число эффектов: 3\/4\/5\/6 (TagTalent 9\/10\/11\/12)",
        "Дополнительный урон: 25\/50\/75\/100",
        "Длительность: 17"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Используя свою псионическую вуаль, Ланайя подчиняет законы природы своей воле."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Templar_Assassin_Meld_1.mp3\/revision\/latest?cb=20191216025015",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Физический"
      ],
      "notes": [
        "При использовании Meld прерывает произносимые способности Templar Assassin.",
        "Мгновенно применяет к Templar Assassin невидимость и отдает герою приказ \"стоп\".",
        "Невидимость теряется при завершении анимации применения заклинаний или предметов, при попадании атаки или при перемещении. Принудительное движение также учитывается и отменяет Meld при горизонтальном перемещении. Вертикальное перемещение и эффекты телепортации не отменяют способность. После запуска снаряда атаки Templar Assassin может выполнить любое действие без потери невидимости. Но если снаряд промахнулся (уклонение, ослепление или избегание), невидимость теряется в момент промаха.",
        "Принудительное движение также учитывается и отменяет Meld при горизонтальном перемещении. Вертикальное перемещение и эффекты телепортации не отменяют способность.",
        "После запуска снаряда атаки Templar Assassin может выполнить любое действие без потери невидимости.",
        "Но если снаряд промахнулся (уклонение, ослепление или избегание), невидимость теряется в момент промаха.",
        "Позволяет другим существам проходить сквозь Templar Assassin.",
        "Templar Assassin может поднимать, выкидывать или атаковать предметы без выхода из невидимости, учитывая то, что она не может двигаться во время действий. Она также может поворачиваться без потери невидимости.",
        "Она также может поворачиваться без потери невидимости.",
        "Следующая атака Templar Assassin, направленная на существо, нанесет дополнительный урон и применит снижение брони (TagTalent и оглушающий удар). При этом не обязательно совершать первую атаку из Meld. Если какая-то из следующих атак поражает первой другую цель (например, она телепортируется), вместо неё затронется новая цель.",
        "При этом не обязательно совершать первую атаку из Meld. Если какая-то из следующих атак поражает первой другую цель (например, она телепортируется), вместо неё затронется новая цель.",
        "Дополнительный урон наносится отдельным источником и считается за урон от атаки. Поскольку он наносится отдельно, то не активирует критический удар, вампиризм или Psi Blades.",
        "Поскольку он наносится отдельно, то не активирует критический удар, вампиризм или Psi Blades.",
        "Meld сначала применяет дебафф снижения брони, затем урон от атаки героя, а затем урон от способности (TagTalent и и оглушающий удар).",
        "Ни дополнительный урон, ни снижение брони от Meld не действуют на строения.",
        "Дебафф снижения брони от нескольких применений складывается.",
        "С выбранным талантом способность при использовании применяет базовое развеивание к Templar Assassin.",
        "Талант 25-го урона добавляет к атакам Meld эффект оглушающего удара. Сочетается с другими источниками оглушающего удара."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "12\/10\/8\/6",
      "description": "Герой становится невидимым до тех пор, пока не сдвинется с места. Если прервать невидимость атакой по врагу, она нанесёт дополнительный урон и на 12 сек. уменьшит броню жертвы.",
      "spellName": "Meld",
      "params": [
        "Анимация применения: 0+0,53",
        "Время до невидимости: 0",
        "Урон: 50\/100\/150\/200",
        "Снижение брони: 5\/6\/7\/8 (TagTalent 8\/9\/10\/11)",
        "Длительность дебаффа: 12",
        "Длительность невидимости: Бесконечная",
        "Длительность оглушения: 0 (TagTalent 1)",
        "Снаряд атаки от Meld можно избежать."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Ланайя так же уклончива, как и её договор с Сокрытым храмом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Templar_Assassin_Psi_Blades.mp3\/revision\/latest?cb=20191216025000",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Psi Blades увеличивают общую дальность атаки Templar Assassin до 200\/260\/320\/380 единиц.",
        "Без целей для Psi Blades Templar Assassin использует только базовую дальность атаки в 140 единиц, но продолжает считаться за героя дальнего боя.",
        "Дальность пробития рассчитывается от позиции атакуемой цели, а не от позиции Templar Assassin. Поэтому с максимальной дальности атаки она задевает существ на расстоянии до 790\/890\/990\/1090 единиц.",
        "Область поражения представляет собой прямоугольник шириной в 90 и длиной, равной дальности пробития.",
        "Пробивающий урон рассчитывается от урона героя (после всех уменьшений). То есть пробивающий урон может быть увеличен с помощью снижения брони основной цели. Также пробивающий урон увеличивается с увеличением урона Templar Assassin от модификаторов атаки (например, критического или оглушающего удара).",
        "То есть пробивающий урон может быть увеличен с помощью снижения брони основной цели.",
        "Также пробивающий урон увеличивается с увеличением урона Templar Assassin от модификаторов атаки (например, критического или оглушающего удара).",
        "Модификаторы атаки применяются только к главной цели.",
        "Позиция Templar Assassin проверяется при попадании снаряда в цель, а не при запуске.",
        "Вопреки визуальным эффектам, Psi Blades не наносит пробивающий урон при атаке строений.",
        "Psi Blades применяет пробивающий урон при атаке союзников или вардов. Не срабатывает при атаке вардов, убиваемых за определенное число ударов.",
        "Пробивающий урон поражает невидимых существ, но не варды или строения."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Псионические клинки героя насквозь пробивают цель атаки, нанося полный урон тем, кто стоит позади неё. Также способность увеличивает дальность атаки героя.",
      "spellName": "Psi Blades",
      "params": [
        "Дальность пробития: 590\/630\/670\/710",
        "Ширина пробивающего урона: 90",
        "Доп. дальность атаки: 60\/120\/180\/240",
        "Урон от пробития: 100%"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Ее кинжалы пронзают как плоть, так и разум, расширяя ее понимание таинства реальности."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Templar_Assassin_Psionic_Trap.mp3\/revision\/latest?cb=20191216025002",
      "effects": [
        "Способность Направленная на точку"
      ],
      "notes": [
        "Ловушки замедляют врагов только при активации, а не из-за разрушения с помощью атак или превышения максимального числа ловушек.",
        "Psionic Trap не блокирует лагери нейтральных крипов."
      ],
      "mana": "15",
      "hotKey": "R",
      "cooldown": "11\/8\/5",
      "description": "Герой ставит невидимую ловушку, которая отслеживает передвижение врагов и постепенно накапливает энергию. По команде ловушка срабатывает, замедляя противников в зоне действия как минимум на 30%. Через 4 сек. ловушка наберёт максимальную мощь, и её активация замедлит жертв на 60% и нанесёт им урон.",
      "spellName": "Psionic Trap",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 2000",
        "Максимально ловушек: 5\/8\/11",
        "Время до невидимости ловушек: 2",
        "Длительность ловушек: Бесконечно",
        "Дарует новую способность: Psionic Projection. Позволяет после небольшой подготовки телепортироваться к любой ловушке от Psionic Trap."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Сокрытый храм не даст никому скрыться от ока его стража."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Templar_Assassin_Trap.mp3\/revision\/latest?cb=20191216025009",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Trap разблокируется при изучении Psionic Trap.",
        "При использовании не прерывает произносимые способности Templar Assassin.",
        "Нельзя использовать без установленных ловушек (выдает ошибку \"Вы не установили ловушки\").",
        "Замедление начинается со значения в 30% и увеличивается на 0.75% с интервалом в 0,1 секунды, замедляя на указанные значения с каждой секундой после размещения: 0 секунд: 30% замедления 1 секунда: 37.5% замедления 2 секунды: 45% замедления 3 секунды: 52.5% замедления 4 секунды: 60% замедления",
        "0 секунд: 30% замедления",
        "1 секунда: 37.5% замедления",
        "2 секунды: 45% замедления",
        "3 секунды: 52.5% замедления",
        "4 секунды: 60% замедления",
        "Урон наносится только при полностью заряженной ловушке При полном заряде ловушка один раз меняет свой вид. Внешнее кольцо при установке черное и становится белым при накоплении заряда.",
        "При полном заряде ловушка один раз меняет свой вид. Внешнее кольцо при установке черное и становится белым при накоплении заряда.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 5 раз.",
        "Наносит до 250\/300\/350 (TagTalent 1050\/1100\/1150) урона одному существу (до уменьшений).",
        "Источником урона является заклинатель, а не ловушка.",
        "Значение урона всегда учитывает текущий уровнь способности при срабатывании и не устанавливается при её создании.",
        "Несколько дебаффов не складываются, но обновляют длительность. При обновлении значения замедление и урон учитывают длительность заряда ловушки.",
        "При обновлении значения замедление и урон учитывают длительность заряда ловушки."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Приводит в действие ближайшую ловушку, замедляя врагов в зоне ее действия.",
      "spellName": "Trap",
      "params": [
        "Анимация применения: 0+0",
        "Радиус поиска ловушки: Глобальный",
        "Радиус замедления: 400",
        "Урон в секунду: 50\/60\/70 (TagTalent 210\/220\/230)",
        "Мин. замедление скорости передвижения: 30%",
        "Макс. замедление скорости передвижения: 60%",
        "Время накопление заряда: 4",
        "Длительность замедления: 5",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a5\/Templar_Assassin_Psionic_Projection.mp3\/revision\/latest?cb=20191216025000",
      "effects": [
        "Способность Направленная на точку \/ Произносимая",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. Доступна в режиме Ability Draft.",
        "Телепортирует к ближайшей от выбранной точки ловушке. После телепортации ловушка взрывается. Действуют те же примечания, что и для Trap.",
        "Действуют те же примечания, что и для Trap.",
        "Применение без установленных ловушек ничего не активирует, лишь расходует ману и запускает перезарядку."
      ],
      "mana": "100",
      "hotKey": "F",
      "cooldown": "15",
      "description": "После небольшой подготовки телепортирует героя к любой ловушке от Psionic Trap, приводя её в действие по прибытии. Не раскрывает невидимость от способности Meld.",
      "spellName": "Psionic Projection",
      "params": [
        "Анимация применения: 0.2+0",
        "Дальность применения: Глобальная",
        "Радиус замедления: 400",
        "Время применения: 1",
        "Урон в секунду: 50\/60\/70 (TagTalent 210\/220\/230)",
        "Мин. замедление скорости передвижения: 30%",
        "Мин. замедление скорости передвижения: 60%",
        "Время накопление заряда: 4",
        "Длительность замедления: 5",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "В награду за свои услуги Ланайя получила доступ к секретам, которые открывают новые грани её псионического таланта."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Psionic_Trap_explode.mp3\/revision\/latest?cb=20141201231841",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "Это заклинание самой ловушки, которое позволяет Templar Assassin взрывать ближайшие ловушки без потери первой.",
        "На способность распространяются те же примечания, что и для Trap Templar Assasin."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Приводит в действие ближайшую ловушку, замедляя врагов в зоне ее действия.",
      "spellName": "Trap",
      "params": [
        "Анимация применения: 0+0",
        "Радиус замедления: 400",
        "Урон в секунду: 50\/60\/70 (TagTalent 210\/220\/230)",
        "Мин. замедление скорости передвижения: 30%",
        "Макс. замедление скорости передвижения: 60%",
        "Время накопление заряда: 4",
        "Длительность замедления: 5",
        "Замедление остается и пытается нанести урон, если дебафф был применен до неуязвимости к магии и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 19.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.2,
    "attrAgility": 23.0
  },
  "description": "Templar Assassin — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Refraction, окружает себя псионическими чарами, которые блокируют урон, наносимый ей во время действия заклинания, а также усиливают ее атаки. Вторая способность, Meld, делает Templar Assassin невидимой до тех пор, пока не сдвинется с места. Если эффект невидимости снимается ударом по врагу, Ланайя нанесет ему дополнительный урон и уменьшит его броню. Пассивная способность, Psi Blades, пробивает врагов насквозь, нанося полный урон тем, кто стоит позади основной цели. Также способность увеличивает радиус атаки Ланайи. Ультимативной способностью, Psionic Trap, Templar Assassin ставит невидимую ловушку, которая незаметно отслеживает передвижение противника. По команде Trap ловушка срабатывает, замедляя противников в зоне действия. Ловушки накапливают энергию, усиливая силу замедления на 7,5% за каждую секунду, но не более 60%. Ловушка также нанесёт урон врагу, если она была заряжена полностью. Способность Trap приводит в действие ближайшую ловушку.",
  "history": "Ланайя нашла своё призвание на пути любопытства и познания. Эта обладательница проницательного ума потратила юные годы на тщательное изучение законов природы. Она зачитывалась гримуарами по магии и алхимии, проводила эксперименты, описанные на обугленных страницах Фиолетовых архивов, запоминала наблюдения учёных смышленого народца. Тихая и скрытная от природы, она всё больше развивала эти свои навыки, ведь новые знания находились всё труднее. Будь она чуть менее скромной, и гильдии знали бы её как вора-ученого. Но исследования заводили её во всё более дальние и тёмные места. Надеясь разгадать тайны вселенной, она смогла открыть скрытую дверь самого мироздания: вход в самый тайный из храмов. Сущности по ту сторону портала, казалось, ждали её. Тайны, что они открыли Ланайе, были просто ничем по сравнению с ответами, которые они дали ей в обмен на служение. Ланайя поклялась охранять секреты, но, что важнее, теперь она могла утолять свою нестерпимую жажду знаний. И тухнущие взгляды повергнутых врагов тоже понемногу открывают ей тайны мироздания.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+6 к числу эффектов Refraction",
      "talentRight": "1 сек. оглушения от атаки из Meld"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-3 к броне врага от Meld",
      "talentRight": "Meld развеивает отрицательные эффекты"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+160 к урону от Psionic Trap",
      "talentRight": "+15% к уклонению"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости передвижения",
      "talentRight": "+15 к скорости атаки"
    }
  ]
}