{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Riki: 160 здоровья и 0,8 восстановления здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+175 к радиусу Smoke Screen",
          "talentRight": "−4 сек. перезарядки Tricks of the Trade"
        },
        {
          "talentLvl": "20",
          "talentLeft": "–4 сек. восстановления заряда Blink Strike",
          "talentRight": "+0,5 к урону за ловкость у атак в спину"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−4 сек. перезарядки Smoke Screen",
          "talentRight": "+8% к скорости передвижения от Cloak and Dagger"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости атаки",
          "talentRight": "+8 к силе"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Riki_Smoke_Screen.mp3\/revision\/latest?cb=20191216022340",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Все эффекты предоставлены аурой. Дебафф задерживается на 0,5 сек.",
        "Несмотря на то, что дебафф задерживается на существах, его эффекты не будут действовать на неуязвимые цели.",
        "Можно использовать во время Tricks of the Trade без прерывания, пока выбранная точка находится в предела дальности применения. Во время Tricks of the Trade анимация применения и остаточная анимация равны 0, а применение не требует поворота в сторону выбранной точки. Применение способности прерывается, но эффекты продолжают действовать. В этом случае приказы через ⇧ Shift-очередь окончательно отменят Trick of the Trade.",
        "Во время Tricks of the Trade анимация применения и остаточная анимация равны 0, а применение не требует поворота в сторону выбранной точки.",
        "Применение способности прерывается, но эффекты продолжают действовать.",
        "В этом случае приказы через ⇧ Shift-очередь окончательно отменят Trick of the Trade.",
        "Ослепление Smoke Screen использует псевдослучайное распределение."
      ],
      "mana": "90",
      "item_behaviour": [],
      "name": "Smoke Screen",
      "cooldown": "20\/17\/14\/11 (TagTalent 16\/13\/10\/7)",
      "description": "Бросает дымовую бомбу, которая не позволяет врагам применять способности и заставляет их промахиваться атаками.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 550",
        "Радиус: 300\/325\/350\/375 (TagTalent 475\/500\/525\/550)",
        "Шанс промаха: 20%\/35%\/50%\/65%",
        "Длительность задержки ауры: 0,5",
        "Длительность: 6",
        "Несмотря на то, что дебафф задерживается, если был применен до иммунитета к заклинаниям, его эффекты не будут действовать на врагов."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Riki_Blink_Strike.mp3\/revision\/latest?cb=20191216022336",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При изучении Blink Strike герой сразу получает все 2 заряда.",
        "Дополнительный урон не связан с атакой Riki и мгновенно наносится цели.",
        "Всегда перемещает Riki за спину цели. Не позволяет избежать снаряды при телепортации.",
        "Не позволяет избежать снаряды при телепортации.",
        "Riki получает приказ атаковать цель, если она — противник. Можно использовать на союзников без нанесения им урона.",
        "Можно использовать на союзников без нанесения им урона.",
        "При выборе врага Riki получает скрытый бафф. Этот бафф применяет к его следующей атаке гарантированный урон со спины от Cloak and Dagger независимо от угла, под которым Riki находится к врагу. То есть когда цель начнет разворачиваться до поражения атакой Riki, к атаке все равно применится урон со спины. Бафф длится до совершения атаки или 1 секунду, в зависимости от того, что произойдет раньше. Бафф используется при начале атаки, а не при попадании её по цели, поэтому отмена или промах атаки отменяет бафф. Длительность в 1 секунду позволяет Riki использовать повторно гарантированную атаку со спины по другим существам, а не по цели Blink Strike, если та была достаточно быстра.",
        "Этот бафф применяет к его следующей атаке гарантированный урон со спины от Cloak and Dagger независимо от угла, под которым Riki находится к врагу.",
        "То есть когда цель начнет разворачиваться до поражения атакой Riki, к атаке все равно применится урон со спины.",
        "Бафф длится до совершения атаки или 1 секунду, в зависимости от того, что произойдет раньше.",
        "Бафф используется при начале атаки, а не при попадании её по цели, поэтому отмена или промах атаки отменяет бафф.",
        "Длительность в 1 секунду позволяет Riki использовать повторно гарантированную атаку со спины по другим существам, а не по цели Blink Strike, если та была достаточно быстра.",
        "Нельзя использовать на курьеров."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Blink Strike",
      "cooldown": "0,1",
      "description": "Герой телепортируется за спину цели и, если это враг, наносит ему урон.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 600\/700\/800\/900",
        "Урон: 40\/60\/80\/100",
        "Доп. скорость анимации атаки: 50%",
        "Число зарядов: 2",
        "Время восстановления заряда: 25\/20\/15\/10 (TagTalent 21\/16\/11\/6)"
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d5\/Riki_Tricks_of_the_Trade.mp3\/revision\/latest?cb=20191216022342",
      "effects": [
        "Способность Направленная на область (TagAghanim Направленная на существо) \/ Произносимая",
        "Действует на Себя \/ Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "При использовании Tricks of the Trade позволяет избегать снаряды.",
        "Некоторые предметы, которые не прерывают произносимые способности (например, Shadow Blade или Shiva's Guard), отменяют действие Tricks of the Trade.",
        "Riki неуязвим, спрятан и сквозь него могут проходить другие существа, пока действует Tricks of the Trade.",
        "Заставляет Riki совершать мгновенные атаки по 1 (2) случайным вражеским существам в радиусе действия с интервалом в 0,67 сек. сразу после использования, срабатывая до 4 раз. На мгновенные атаки могут сработать любые модификаторы атаки (включая Cloak and Dagger, не учитывающую угол поворота к цели) или эффекты, срабатывающие при атаке (как и на обычные атаки). У атак нет эффекта True Strike, но они игнорируют обезоруживание. Мгновенные атаки не выводят из невидимости от Cloak and Dagger и Smoke of Deceit, хоть визуально способность уходит на перезарядку.",
        "На мгновенные атаки могут сработать любые модификаторы атаки (включая Cloak and Dagger, не учитывающую угол поворота к цели) или эффекты, срабатывающие при атаке (как и на обычные атаки). У атак нет эффекта True Strike, но они игнорируют обезоруживание.",
        "Мгновенные атаки не выводят из невидимости от Cloak and Dagger и Smoke of Deceit, хоть визуально способность уходит на перезарядку.",
        "Не задевает невидимых существ, но поражает существ в тумане войны.",
        "Визуальные эффекты, отмечающие радиус атаки Tricks of the Trade, видны как союзникам, так и врагам. Радиус всегда закреплен за Riki и следует за ним, даже если его передвинут (например, с помощью Glimpse). При этом круг на земле, отмеченный визуальными эффектами, не следует за Riki и остается на месте применения.",
        "Радиус всегда закреплен за Riki и следует за ним, даже если его передвинут (например, с помощью Glimpse).",
        "При этом круг на земле, отмеченный визуальными эффектами, не следует за Riki и остается на месте применения.",
        "После завершения максимальной длительности Riki появляется в центре круга. ↓↓ Двойное нажатие автоматически перемещает Riki к выбранной области в пределах дальности применения. Он вновь появляется в центре.",
        "↓↓ Двойное нажатие автоматически перемещает Riki к выбранной области в пределах дальности применения. Он вновь появляется в центре.",
        "Во время действия можно использовать Smoke Screen без прерывания произнесения, пока выбранная точка находится в предела дальности применения. Во время Tricks of the Trade анимация применения и остаточная анимация Smoke Screen равны 0, а применение не требует поворота в сторону выбранной точки. Применение способности прерывается, но эффекты продолжают действовать. В этом случае приказы через ⇧ Shift-очередь окончательно отменят Trick of the Trade.",
        "Во время Tricks of the Trade анимация применения и остаточная анимация Smoke Screen равны 0, а применение не требует поворота в сторону выбранной точки.",
        "Применение способности прерывается, но эффекты продолжают действовать.",
        "В этом случае приказы через ⇧ Shift-очередь окончательно отменят Trick of the Trade.",
        "С Aghanim's Scepter Trick of the Trade одновременно атакует 2 врагов, совершая до 8 атак с тем же интервалом и за ту же длительность. Можно применить на союзного героя, включая иллюзии и клонов, но исключая крипов-героев. Riki и все эффекты способности следуют за союзным героем. Сам Riki остается спрятанным. То есть ауры Riki на длительность способности распространяются вокруг союзного героя. Не завершается при смерти цели. Способность продолжается в месте смерти союзника. Она остается связанной с союзником, поэтому при его воскрешении способность вернется к нему.",
        "Можно применить на союзного героя, включая иллюзии и клонов, но исключая крипов-героев.",
        "Riki и все эффекты способности следуют за союзным героем. Сам Riki остается спрятанным. То есть ауры Riki на длительность способности распространяются вокруг союзного героя.",
        "То есть ауры Riki на длительность способности распространяются вокруг союзного героя.",
        "Не завершается при смерти цели. Способность продолжается в месте смерти союзника. Она остается связанной с союзником, поэтому при его воскрешении способность вернется к нему."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Tricks of the Trade",
      "cooldown": "21\/18\/15\/12 (TagTalent 17\/14\/11\/8)",
      "description": "Герой пропадает из нашего мира и периодически атакует в спину случайное вражеское существо в области действия.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 400 (TagAghanim 700)",
        "Макс. длительность: 2",
        "Радиус: 450",
        "Целей атаки: 1 (TagAghanim 2)",
        "Число атак: 4 (TagAghanim 5)",
        "Доп. ловкость: 55%\/70%\/85%\/100%",
        "Урон от атаки: 40%",
        "Увеличивает дальность применения и позволяет спрятаться на время действия в союзного героя."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Riki_Sleeping_Dart_1.mp3\/revision\/latest?cb=20210103151321",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Снаряд летит со скоростью 1600.",
        "Цель проснется после получения 200 урона. Счетчик начинает учитывать урон во время длительности сна. Учитывает урон после всех уменьшений.",
        "Счетчик начинает учитывать урон во время длительности сна. Учитывает урон после всех уменьшений.",
        "Урон и замедление применяются после потери дебафф сна, истечении длительности или превышении порога урона. Дебафф сначала применяет замедление скорости передвижения, затем наносит урон.",
        "Дебафф сначала применяет замедление скорости передвижения, затем наносит урон."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Sleeping Dart",
      "cooldown": "12",
      "description": "Герой стреляет дротиком в выбранного врага. Враг проснётся через 4 сек. или получив 200 урона. Проснувшись, цель получает 120 урона и 4 сек. передвигается на 30% медленнее.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 1000",
        "Урон: 120",
        "Урон для пробуждения: 200",
        "Замедление скорости передвижения: 30%",
        "Длительность замедления: 4",
        "Длительность сна: 4",
        "Блокируется при попадании.",
        ""
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/90\/Riki_Cloak_and_Dagger.mp3\/revision\/latest?cb=20191216022338",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя \/ Врагов",
        "Урон Физический"
      ],
      "notes": [
        "В невидимости Riki не атакует автоматически врагов.",
        "После возрождения или воскрешения Riki мгновенно становится невидимым.",
        "Использование способностей и предметов не прерывает невидимость.",
        "Иконка способности показывает время перезарядки всякий раз, когда герой выходит из невидимости. Но у отсчета лишь визуальное назначение. То есть использование Refresher Orb не обновит способность. Также на отсчет не влияет уменьшение перезарядки от Octarine Core и Руна волшебства. Time Dilation и Chakra Magic визуально действуют на перезарядку, но не влияют на задержку до невидимости.",
        "То есть использование Refresher Orb не обновит способность.",
        "Также на отсчет не влияет уменьшение перезарядки от Octarine Core и Руна волшебства.",
        "Time Dilation и Chakra Magic визуально действуют на перезарядку, но не влияют на задержку до невидимости.",
        "Урон со спины применяется при атаке и добивании союзников.",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, он может быть критическим или прорубающим. На урон также не действуют бонусы или снижения, основанные на процентах, но он может быть уменьшен снижениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, он может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или снижения, основанные на процентах, но он может быть уменьшен снижениями, использующими фиксированное значение.",
        "Звуковой эффект способности проигрывается до начала атаки, но урон применяется после попадания.",
        "Талант на дополнительную скорость передвижения действует только в невидимости — когда способность не на перезарядке."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Cloak and Dagger",
      "cooldown": null,
      "description": "Герой уходит в тень, становясь невидимым. Каждая его атака со спины наносит дополнительный урон, который зависит от ловкости. Если атаковать врага, невидимость пропадёт.",
      "hot_key": "E",
      "params": [
        "Задержка до невидимости: 4\/3\/2",
        "Угол спины: 105°",
        "Урон за единицу ловкости: 1,4\/1,8\/2,2 (TagTalent 1,9\/2,3\/2,7)",
        "Доп. скорость передвижения: 8%",
        "Дарует новую способность: Sleeping Dart.",
        "Невидимость действует на иллюзии. Иллюзии проигрывают звук при ударе в спину, но не наносят дополнительный урон."
      ],
      "legacy_key": "K",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 18.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.3,
    "attrAgilityInc": 1.4,
    "attrAgility": 18.0
  },
  "description": "Riki — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Smoke Screen, бросает дымовую бомбу, замедляя скорость передвижения вражеских существ в зоне охвата, не позволяя им колдовать и заставляя их промахиваться в большинстве случаев. Вторая способность, Blink Strike, Телепортируется за спину выбранного юнита и наносит дополнительный урон, если это вражеский юнит. Третья способность, Tricks of the Trade, Riki пропадает из нашего мира, атакуя со спины случайных противников в радиусе вокруг себя. Ультимативная пассивная способность, Cloak and Dagger, Riki скрывается в тени, становясь невидимым. Если Riki атакует со спины, то он наносит дополнительный урон, зависящий от его текущей ловкости.",
  "history": "Он родился средним сыном в великой династии Талин. В то время как его старшего брата готовили к трону, а младшего окружали удовольствиями и заботой, середнячок оказался прирожденным невидимкой. Всю свою жизнь он оттачивал это искусство, и именно оно спасло его в тот роковой день, когда его народ предали, а родных убили. Не выжил никто из царской семьи — кроме незаметной, ловкой и хитрой тени в клубах дыма. Внезапно нападая и бесшумно взрезая глотки врагов, сирота сбежал с монарших владений. Ныне свободный от престола, бесшумный убийца предоставляет иные услуги. Он оставляет врагов безмолвными навечно и оттачивает своё мастерство, надеясь когда-нибудь отомстить тем, кто убил его семью и лишил его прав наследника.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+175 к радиусу Smoke Screen",
      "talentRight": "−4 сек. перезарядки Tricks of the Trade"
    },
    {
      "talentLvl": "20",
      "talentLeft": "–4 сек. восстановления заряда Blink Strike",
      "talentRight": "+0,5 к урону за ловкость у атак в спину"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−4 сек. перезарядки Smoke Screen",
      "talentRight": "+8% к скорости передвижения от Cloak and Dagger"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости атаки",
      "talentRight": "+8 к силе"
    }
  ]
}