{
  "abilities": [
    {
      "spell": "Tethers Io to an allied unit, granting bonus movement speed to both. When Io restores health or mana, tethered units target gains a larger portion of that amount. The tether breaks when the allied unit moves too far away, or Io cancels the tether.",
      "effects": [
        "Ability Target Unit",
        "Affects Allies"
      ],
      "notes": [
        "Has a Break Tether sub-ability that lets Io break the tether while connected with an ally.",
        "Tethering a unit that is 700 units or further away causes Io to latch on and pull itself to the target. Pulls Io at a speed of 1000, until coming within 300 range of the target. Can pull Io over impassable terrain. Destroys trees within 350 radius around Io right after the pull. If Io breaks the tether while getting pulled to the tethered target, the pull immediately stops. The pull gets interrupted when Io is hit by another spell which applies Forced Movement, but not when Io is disabled. If the distance between Io and the target gets greater than 900 (or 2150 during the pull), the Tether breaks.",
        "When the distance between Io and the tethered target gets greater than 700, the link's visual appearance changes.",
        "Tether has no set duration. It breaks only when exceeding the break distances, when Io or the target die, when Io gets assimilated or when using the sub-spell.",
        "The movement speed bonus is only applied to the tethered ally, while Io's movement speed is periodically set equal to the target's speed. This means Io completely ignores movement speed slows and bonuses, but effectively get slowed or sped up when the tethered allied does. Hastes have priority over Tether. Pounce and Kinetic Field have priority over it as well, so that Io does not ignore them.",
        "The tethered unit benefits from Overcharge, Relocate, and from Io regenerating or replenishing health and mana. Tethered units still benefit from all those effects even when turning invulnerable or when hidden. The health and mana regeneration is only applied to the tethered unit if Io's respective pool is not full. Healing effects like Mekansm are applied to the tethered unit depending on how much health was replenished on Io. Mana restoring effects like Arcane Boots are applied fully to the tethered unit if 1 or more mana was replenished on Io.",
        "If Io is tethered to an invisible unit, enemies can only see a fake link leading to the invisible unit's last known location.",
        "When the level 15 talent is chosen, the tethered ally's spells receive their Aghanim's Scepter upgrades until the Tether breaks. Io does not require an Aghanim's Scepter for the talent to work. Does not work for heroes who cannot drop their scepters.",
        "When the level 25 talent is chosen, Io performs instant attacks on every enemy the tethered ally attacks. The attacks are performed as soon as the ally launches their attack (including instant attacks). It does not matter whether the attack actually hits or not. Does not perform attacks when the tethered target also has this talent (i.e. an illusion of Io). The instant attacks of Io can proc every attack modifier normally. The attacks have no True Strike, but completely ignore disarms."
      ],
      "mana": "40",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "12",
      "name": "Tether",
      "description": [
        "Cast Animation: 0+0",
        "Cast Range: 1800",
        "Tether Break Distance: 900",
        "Tether Pull Distance: 700",
        "Tether Break Distance During Pull: 2150",
        "Heal\/Restore Transfer: 105%\/120%\/135%\/150%",
        "Target Move Speed Bonus: 5%\/8%\/11%\/14%"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Break the link to the tethered unit.",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Tether until the Tether is broken.",
        "Interrupts Io's channeling spells upon cast."
      ],
      "mana": "0",
      "elements": [
        "Does not proc any on-cast effects when cast."
      ],
      "cooldown": "1",
      "name": "Break Tether",
      "description": [
        "Cast Animation: 0+0"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Summon five particle spirits that dance in a circle around Io. If a particle collides with an enemy hero, it explodes, damaging and slowing all enemy units in an area around it. Creeps take minor damage from touching a particle spirit, but do not cause them to explode. When its duration ends, any remaining Spirits explode.",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Interrupts Io's channeling spells upon cast.",
        "Upon use, this spell gets replaced by a sub-spell which allows moving the spirits in or out.",
        "5 spirits are summoned over the course of four seconds so that the distance between each spirit is equal. The first spirit is always spawned to the north of Io, with the following spirits spawning in one second interval behind the previous spirit. The spirits expand automatically to their maximum distance upon cast. The spirits always rotate clockwise and are locked to Io's location, following it wherever it goes. Moving the spirits in or out does not break their formatting. They always rotate in a circle and keep equal distance from each other.",
        "The spirits complete a revolution every ~2.3 seconds regardless of distance from Io. Their angular velocity is constant, meaning their speed increases the further away they are from the caster. This means the first created spirit can rotate at least 8 times around Io.",
        "When a non-hero unit comes within the 110 collision radius of the spirits, it takes the collision damage.",
        "When a hero comes within collision radius, the spirit explodes, dealing the explosion damage and slowing enemies within a 360 radius.",
        "Spirits do not collide with and explode on invulnerable or hidden heroes.",
        "Remaining spirits detonate simultaneously at the end of the duration or if recast, dealing the explosion damage and applying the slow around them.",
        "Spirits provide 150 radius flying vision for 3 seconds at the location where they collided with a hero. They do not provide vision when exploding caused by expiring or recasting.",
        "The spirits are invisible to the enemy if Io is invisible.",
        "Can deal up to 100\/200\/300\/400 ( 475\/575\/675\/775) damage to a single unit when all 5 spirits explode on a target (before reductions).",
        "Treats creep-heroes as heroes and illusions as creeps."
      ],
      "mana": "120\/130\/140\/150",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "26\/24\/22\/20",
      "name": "Spirits",
      "description": [
        "Cast Animation: 0+0",
        "Collision Radius: 110",
        "Explosion Radius: 360",
        "Collision Damage: 10\/18\/26\/34",
        "Explosion Damage: 20\/40\/60\/80 ( 95\/115\/135\/155)",
        "Explosion Movement Speed Slow: 20%\/40%\/60%\/80%",
        "Slow Duration: 0.3",
        "Spirits Duration: 19"
      ],
      "hot_key": "W",
      "legacy_key": "W"
    },
    {
      "spell": "Calls the spirits in and out.",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "This ability replaces Spirits until all spirits are gone.",
        "Does not interrupts Io's channeling spells upon cast.",
        "Moves the spirits in or out at a speed of 250. It takes 2.4 seconds to move the spirits from max to min distance and vice versa."
      ],
      "mana": "0",
      "elements": [
        "Does not proc any on-cast effects when cast."
      ],
      "cooldown": "1.5",
      "name": "Spirits Movement",
      "description": [
        "Cast Animation: 0+0",
        "Minimum Distance: 100",
        "Maximum Distance: 700"
      ],
      "hot_key": "W",
      "legacy_key": "W"
    },
    {
      "spell": "Io gains bonus attack speed and damage reduction, at the cost of draining a percentage of its current health and mana per second. If Io is tethered to an ally, that unit also gains the bonuses.",
      "effects": [
        "Ability Toggle",
        "Affects Self \/ Allies",
        "Damage Pure (HP Removal)"
      ],
      "notes": [
        "Overcharge does not interrupt Io's channeling spells upon cast.",
        "Can be toggled off while on cooldown.",
        "A tethered ally is affected by the damage reduction and attack speed, but only Io's health and mana get drained.",
        "Drains 1.2% of current health and mana in 0.2 second intervals.",
        "Io and the tethered ally's effective health are increased by 5%\/11%\/18%\/25%. This quickly diminishes for Io because of the health loss."
      ],
      "mana": "0",
      "elements": [
        "Does not proc any on-cast effects when cast.",
        "Pierces spell immunity."
      ],
      "cooldown": "2",
      "name": "Overcharge",
      "description": [
        "Cast Animation: 0+0",
        "Current Health & Mana Cost per Second: 6%",
        "Attack Speed Bonus: 40\/50\/60\/70",
        "Damage Reduction: 5%\/10%\/15%\/20%"
      ],
      "hot_key": "E",
      "legacy_key": "V"
    },
    {
      "spell": "Teleports Io and any tethered ally to any location. After the spell expires Io and any tethered ally will return to their original location. Double-click to teleport to your team's base fountain.",
      "effects": [
        "Ability Target Point \/ Channeled",
        "Affects Self \/ Allied Heroes"
      ],
      "notes": [
        "Double-clicking the ability automatically targets the team's fountain area.",
        "Can be cast while Io is rooted, but the teleport does not happen when still rooted after the delay.",
        "Disabling the tethered ally of Io does not prevent the ally from getting teleported if Io successfully does so.",
        "Enemies get a notification on their minimap during the teleport delay, showing them where Relocate was targeted. Creates a visual effect at the targeted point during the teleport delay, which is visible to everyone. Creates a visual effect at Io's position before the teleport happens, which also is visible to everyone.",
        "Relocate interrupts channeling spells and every current order of Io and the tethered ally both on initial teleport, and when going back.",
        "Disjoints projectiles for Io upon teleporting to the targeted point, but does not disjoint upon teleporting back. Does not disjoint projectiles for the teleported ally, neither upon teleporting to the target point, nor upon teleporting back.",
        "Io may break its tether at any time to prevent bringing an ally back.",
        "Can only teleport heroes, illusions and creep-heroes.",
        "Teleports invulnerable and hidden targets.",
        "Destroys trees within 300 radius around Io upon both teleports.",
        "The Disablehelp option prevents Io from relocating the respective ally."
      ],
      "mana": "100",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "130\/110\/90 ( 70\/50\/30)",
      "name": "Relocate",
      "description": [
        "Cast Animation: 0+0.53",
        "Cast Range: Global",
        "Channel Time: 2.7\/2.35\/2",
        "Duration: 12"
      ],
      "hot_key": "R",
      "legacy_key": "R"
    }
  ],
  "bio": "Io is everywhere, and in all things. Denounced by enemies as the great unmaker, worshiped by scholars as the twinkling of a divine eye, this strange Wisp of life-force occupies all planes at once, the merest fraction of its being crossing into physical existence at any one moment. Like the great twin riders Dark and Light, and yet another ancient traveler whose true history is lost to the ages, Io the Wisp is a Fundamental of the universe, a force older than time, a wanderer from realms far beyond mortal understanding. Io is nothing less than the sum of all attractive and repulsive forces within the material field, a sentient manifestation of the charge that bind existence together. It is only in the controlled warping of these electrical waylines that Io's presence can be experienced on the physical plane. A benevolent, cooperative force, Io bonds its strange magnetism to others so that the power of allies might be enhanced. Its motives inscrutable, its strength unimaginable, Io moves through the physical plane, the perfect expression of the mysteries of the universe.",
  "talentsTips": [
    "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.",
    "Gold granted from the talent is unreliable gold."
  ],
  "trivia": [
    "Io is the name of a priestess of Hera in Greek Mythology. She was seduced by Zeus and subsequently incurred Hera's wrath. Io is also the name of one of four Galilean moons of Jupiter, which was named after the same character in Greek Mythology.",
    "Io's fun names in DotA were Weird Ball and Santelmo. Santelmo may refer to St. Elmo's Fire, a weather phenomenon that creates sparks of bright energy similar to that of lightning, mostly occurring from sharply pointed structures.",
    "Enigma, Chaos Knight, Keeper of the Light, and Io together represent the four fundamental forces of the universe with Io representing the strong nuclear force, as alluded to in its lore as the force that binds all matter together, as well as its abilities which mostly rely on being bound to a partner to achieve maximum effect.",
    "Io connects to a unit with its tentacle when getting closer, despite of allied or enemy."
  ],
  "talents": [
    "Attack Tethered Ally's Target:-60s Relocate Cooldown",
    "+16 Health Regen:+150 Gold\/Min",
    "Tether Grants Scepter Bonus:+75 Spirits Hero Damage",
    "+45 Damage:+20% XP Gain"
  ],
  "desc": "Io the Wisp is a ranged strength hero who works best as part of a communicative team. With its support-oriented skill set, Io can share its healing and buffs through Tether and Overcharge, harass enemy heroes out of the lane with Spirits, and materialize itself and an ally anywhere on the map with Relocate."
}