{"abilities":[{"spell":"Связывает героя с союзным существом, увеличивая скорость передвижения обоих. Когда владелец способности восстанавливает здоровье или ману, их в приумноженном количестве получает и привязанное существо. Связь разорвётся, если отменить способность вручную или если расстояние до цели окажется слишком большим.","effects":["Способность Направленная на юнита","Действует на Союзников"],"notes":["Под-способностью Break Tether можно разорвать связь.","Если Io попытается связаться с союзником на расстоянии в 700 единиц или больше, то его притянет к нему. Io притягивается со скоростью в 1000 единиц, пока не окажется на расстоянии в 300 от цели. Может притягиваться на непроходимую территорию. После притягивания уничтожает все деревья в радиусе 350 от Io. Если Io разрывает связь во время притягивания, то оно мгновенно прервется. Притягивание прерывается, если на Io подействует оглушение, проклятие, исчезновение, страх, гипноз или оцепенение. Принудительное движение также отменяет притягивание, но при завершении движения, а не при применении. Провокация, привязка и безмолвие притягивание не прерывают. Если расстояние между Io и целью превысит 900 (или 2150 во время притягивания), то Tether разорвется.","Если расстояние между Io и целью становится больше 700, то визуально связь меняется.","Длительность Tether не ограничена. Она разорвется лишь в случае, если будет превышена дистанция прерывания, использована вспомогательная способность, Io спрятали с помощью Assimilate или если заклинатель или выбранная им цель умрет.","Доп. скорость передвижения применяется только к союзнику, в то время как значение скорости Io периодически приравнивается к скорости цели. То есть Io игнорирует бонусы к скорости передвижения, но замедляется или ускоряется из-за союзника. У ускорения приоритет выше, чем у Tether. У Pounce и Kinetic Field также наивысший приоритет, поэтому Io не игнорирует их эффекты.","На привязанного юнита действуют Overcharge, Relocate и регенерация и восстановление здоровья и маны, действующие на Io. Юниты продолжают получать бонусы от всех эффектов в невидимом или спрятанном состоянии. Регенерация здоровья и маны действует даже если здоровье или мана Io полные. Эффекты лечения, схожие с Mekansm, применяются на связанного юнита в зависимости от того, сколько здоровья восстановил Io. Эффекты восстановления маны, схожие с Arcane Boots, так же применяются на связанного юнита.","Если Io связывается с невидимым юнитом, то враги увидят фальшивую связь, соединенную с последним известным расположением невидимого юнита.","При выборе таланта на 20 уровне, заклинания союзника получают улучшения от Aghanim's Scepter до разрыва связи. Для действия таланта Io не требуется наличие Aghanim's Scepter. Не действует на героев, которые не могут выкинуть Aghanim's Scepter.","При выборе таланта на 25 уровне, Io совершает мгновенные атаки по каждому врагу, которого атакует связанный союзник. Атака совершается в тот момент, когда союзник запускает свою (включая мгновенные атаки). Неважно, попала ли атака или нет. Не атакует, если у связанной цели также есть этот талант (т.е. цель - иллюзия Io). На мгновенные атаки Io могут сработать любые модификаторы атаки. У этих атак нет эффекта True Strike, но они игнорируют обезоруживание."],"mana":"40","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"12","name":"Tether","description":["Анимация применения: 0+0","Дальность применения: 1800","Дистанция прерывания связи: 900","Дистанция притягивания: 700","Дистанция прерывания связи при притягивании: 2150","Множитель восстановления: 60%\/90%\/120%\/150%","Доп. скорость передвижения: 5%\/8%\/11%\/14%"],"hot_key":"Q","legacy_key":"T"},{"spell":"Разрывает связь.","effects":["Способность Ненаправленная"],"notes":["Заменяет Tether, когда Io связан.","При использовании прерывает произносимые заклинания Io.","Уходит на 0,25-секундную перезарядку при использовании Tether, поэтому связь нельзя разорвать мгновенно."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"1","name":"Break Tether","description":["Анимация применения: 0+0"],"hot_key":"Q","legacy_key":"T"},{"spell":"Призывает пять духов, которые кружатся вокруг героя. При столкновении с вражеским героем дух взрывается, нанося урон всем существам в области вокруг взрыва. При столкновении с крипом дух наносит немного урона, но не взрывается. После окончания действия заклинания духи взрываются.","effects":["Способность Ненаправленная ( Пассивная)","Действует на Врагов","Урон Магический"],"notes":["При использовании прерывает произносимые заклинания Io.","При применении заклинание заменяется вспомогательным, позволяющим приближать или отдалять духов.","5 духов призываются в течении четырех секунд (с интервалом в 0,8 секунды), поэтому расстоянии между ними одинаковое. Первый дух появляется на севере от Io, следующие - с интервалом в 1 секунду. Духи автоматически появляются на максимальной дистанции. Духи всегда крутятся по часовой стрелке и следуют за расположением Io. Приближение или отдаление духов не разрушает их порядок расположения. Они всегда движутся по кругу и сохраняют равное расстояние между собой.","Духи проходят весь круг за 2,7 секунды независимо от дистанции от Io. Их угловая скорость постоянна, поэтому они будут ускоряться при отдалении от заклинателя. То есть первый созданный дух может облететь Io 7 раз.","Если юнит не-герой оказывается в пределах 110 радиуса столкновения духов, то он получает урон от столкновения.","Если юнит-герой оказывается в пределах радиуса столкновения духов, то дух взрывается ( и замедляет врагов) в радиусе 360 единиц.","Духи не сталкиваются и не взрываются с невидимыми или спрятанными героями.","Оставшиеся духи одновременно взорвутся при истечении длительности или при повторном использовании, нанося урон от взрыва и применяя вокруг себя замедление.","Духи дают летающий обзор на 3 секунды в радиусе 150 единиц при столкновении с героем Они не дают обзор, если взорвались из-за истечения длительности или повторного применения.","Духи не видны врагам, если сам Io находится в невидимости.","Может нанести до 100\/200\/300\/400 ( 1433.3333333333\/1533.3333333333\/1633.3333333333\/1733.3333333333) единиц урона одному юниту, если все 5 духов взорвутся у цели (до учета сопротивления).","Считает крипов-героев за героев, а иллюзии - за крипов.","Приобретение Aghanim's Scepter убирает необходимость применения Spirits, постоянно призывая духов вокруг Io. При получении Aghanim's Scepter с духами от применения способности последние исчезают без взрыва. При потере Aghanim's Scepter появившиеся духи не исчезают до столкновения с врагом или смерти Io. Вопреки описанию, духи продолжают появляться с интервалом в 0,8 секунды, а не 1 секунды. Вспомогательная способность всё также доступна для использования. Сама способность Spirits скрыта."],"mana":"120\/130\/140\/150","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"26\/24\/22\/20","name":"Spirits","description":["Анимация применения: 0+0","Радиус столкновения: 110","Радиус взрыва: 360","Урон при столкновении: 10\/18\/26\/34","Урон при взрыве: 20\/40\/60\/80 ( 286.66666666667\/306.66666666667\/326.66666666667\/346.66666666667)","Замедление скорости передвижения при взрыве: 0 ( 90%)","Длительность замедления: 0","Длительность: 19"],"hot_key":"W","legacy_key":"W"},{"spell":"Призывает или отправляет духов.","effects":["Способность Ненаправленная"],"notes":["Способность заменяет Spirits до исчезновения всех духов.","Не прерывает произносимые заклинания Io.","Передвигает духов ближе или дальше к герою со скоростью в 250 единиц. Требуется 2 секунды для достижения максимальной дистанции (и наоборот)."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Spirits Movement","description":["Анимация применения: 0+0","Минимальная дистанция: 200","Максимальная дистанция: 700"],"hot_key":"W","legacy_key":"W"},{"spell":"Герой повышает свои скорость атаки и сопротивляемость урону. Связанное с владельцем способности существо также получает эти бонусы.","effects":["Способность Переключаемая","Действует на Себя \/ Союзников"],"notes":["Overcharge прерывает произносимые заклинания Io.","Связанный с героем союзник будет получать дополнительную скорость атаки и сопротивление к урону.","Эффективное здоровье Io и связанного с ним союзника увеличиваются на 5%\/11%\/18%\/25%."],"mana":"40\/60\/80\/100","elements":["Не провоцирует эффекты своим применением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"18","name":"Overcharge","description":["Анимация применения: 0+0","Бонус к скорости атаки: 50\/80\/110\/140","Снижение получаемого урона: 5%\/10%\/15%\/20%","Длительность: 8"],"hot_key":"E","legacy_key":"V"},{"spell":"Телепортирует героя и связанного с ним союзника в любую точку карты. Спустя некоторое время герой вернётся туда, откуда он телепортировался, также перенеся связанного с собой союзника. Двойное нажатие отправит героя к своему фонтану.","effects":["Способность Направленная на точку","Действует на Себя \/ Союзных героев"],"notes":["Двойное нажатие автоматически отправит героя к своему фонтану.","Если при применении Io будет оглушен, проклят или на него подействует сон или ураган, то Relocate отменится. Можно использовать, если на Io действует оцепенение, но телепортация не произойдет, если оцепенение продолжится после задержки. Обезвреживание связанного союзника Io не прервет телепортацию, если применение успешно завершено. Возвращение нельзя прервать.","Враги видят во время задержки индикатор на мини-карте, показывающий выбранную точку для телепортации. Создает визуальный эффект в выбранной точке во время задержки телепортации, видный всем. Создает визуальный эффект на позиции Io до телепортации, который также виден всем.","Relocate прерывает произносимые заклинания и текущие приказы Io и связанного союзника как при телепортации, так и при возвращении.","Io может разорвать связь в любой момент, чтобы предотвратить возвращение героя вместе с ним.","Может телепортировать только героев, иллюзии и крипов-героев.","Телепортирует неуязвимые и спрятанные цели.","При телепортации разрушает деревья в радиусе 300 единиц.","Вы можете отключить помощь, чтобы Io не мог использовать эту способность на вас."],"mana":"175","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"90\/75\/60 ( 60\/45\/30)","name":"Relocate","description":["Анимация применения: 0+0,53","Дальность применения: Глобальная","Время применения: 3.5\/3.25\/3","Длительность: 12"],"hot_key":"R","legacy_key":"R"}],"bio":"Ио — непостижимое проявление жизненной силы, присутствующее везде и во всём, и для врагов оно оказывается великим разрушителем, а для учёных мужей — блеском божественного ока. Сущность эта находится одновременно на всех уровнях бытия, а её малейшие частицы воплощаются в физическом мире в каждое отдельно взятое мгновение. Подобно великим всадникам-близнецам, Тьме и Свету, а также древнему путнику, чьё истинное происхождение затеряно в веках, — это предвечная сущность вселенной, сила старше самого времени, пришелец из миров за гранью понимания смертных. Ио есть совокупность всех материальных сил притяжения и отторжения, разумное проявление связующей реальность энергии. Присутствие его в материальном мире осязается лишь в контролируемых искривлениях векторов этих сил. Сущность эта по своей природе благожелательна, и передаёт свой непостижимый магнетизм союзникам, делая их сильнее и выносливее. Что движет этой невообразимой силой — неведомо, а её движение по физическому миру — прекрасное напоминание, что вселенная полна загадок и тайн.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Золото с таланта является ненадёжным.","Талант на броню не дается иллюзиям."],"trivia":["Этот герой целиком состоит из частиц (particles), грубо говоря, Io - один большой спецэффект.","Io, как и Phoenix, не имеет диалогов и реплик. Однако, их реакция, как правило, передается через звуки, которые соответствуют музыкальным паттернам, которые в свою очередь получились от форм человеческой речи. Например, они выражают счастье, производя звуки в мажорном ключе; когда сердятся, они производят резкий, диссонирующий звук аккорда; и когда выражают боль - \"кричат\"","В оригинальной Dota, имя героя было Guardian Wisp. В Dota 2, он был переименован в Wisp, однако затем в Io. Несмотря на это, некоторые герои по прежнему называют героя Wisp.","Puck понимает то, что говорит Io.","Puck утверждает что Io знаком со сферами Invoker."],"talents":["Атака вместе с целью Tether:-30 сек. перезарядки Relocate","+15 к броне:+75 к урону героям от Spirits","+8 здоровья в секунду:Духи от Spirits замедляют врагов","+45 к урону:+90 золота в минуту"],"desc":"Io — это герой с дальним типом атаки, основной характеристикой которого является сила. Его первая способность Tether связывает Io и союзного юнита, увеличивая скорость передвижения обоих. Когда Io пополняет здоровье или ману, привязанный герой тоже восстанавливается, но на 50% больше. Связь разрывается, если вы с целью разойдетесь слишком далеко друг от друга, или если Io отменит заклинание. Вторая способность Spirits призывает пять духов, которые кружатся вокруг героя нанося урон всем вокруг. При попадании во вражеского героя, замедляют его на 0,3 секунды. Третья способность Overcharge увеличивает скорость атаки героя и сопротивляемость любому урону. Связанный с вами герой получает такой же бонус. Основная способность Relocate телепортирует Io и любого связанного с ним героя в любую точку карты. После телепортации Io и связанный с ним герой вернутся на первоначальное место спустя 12 секунд."}