{
  "abilities": [
    {
      "notes": [
        "The targeting reticule must be centered over an enemy unit",
        "The projectile travels at a speed of 1000 and has 225 radius flying vision\n This vision does not last",
        "Turning invulnerable or hidden does not prevent it from affecting the area around the target",
        "Storm Hammer first applies the dispel, then the damage, then the debuff",
        "Sven's sword emits some particles during the cast time, visible to everyone",
        "SCEPTER NOTES Sven is now moved along with the projectile at the same speed\n While being moved, Sven is untargetable, invulnerable, hidden and is prevented from acting\n Does not disjoints projectiles\n Autocast on disables being moved with the ability projectile\n Sven stops moving along with the projectile in the following conditions: When Storm Hammer is disjointed\n Upon Sven's death\n If the distance between Sven and the target exceeds 2200\n If the movement is interrupted (e.g\n with teleport), Sven is also no longer disabled, untargetable and invulnerable\n The ability upgrade is determined if Sven has <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter equipped during its cast point\n Therefore, losing Aghanim's Scepter while being moved does not stop Sven from being moved along with the projectile",
        "SCEPTER NOTES Storm Hammer can now also be cast on invulnerable enemies\n Although the damage and stun do not affect invulnerable units, the basic dispel does\n This means if the source of invulnerability is dispellable, Storm Hammer may fully affect the target, since the dispel is applied first\n The dispel is applied on all hit enemies within 255 radius along with the primary target"
      ],
      "item_behaviour": [],
      "description": "Sven unleashes his magical gauntlet that deals damage and stuns enemy units in a small area around the target.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 600 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 950)",
        "Effect Radius: 255",
        "Damage: 95\/170\/245\/320",
        "Stun Duration: 1.4\/1.6\/1.8\/2 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2.65\/2.85\/3.05\/3.25)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Sven_Storm_Hammer_1.mp3\/revision\/latest?cb=20191216024629",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies ",
        "Damage: Magical"
      ],
      "mana": "18\/16\/14\/12",
      "aghanim": null,
      "name": "Storm Hammer",
      "cooldown": "110\/115\/120\/125",
      "legacy_key": "T",
      "story": "The Rogue Knight's iron gauntlet, taken from the school of his father, strikes his foes to their core."
    },
    {
      "notes": [
        "Cleave damage has the following properties: It counts as spell damage\n However, it has the following flags: No-spell-lifesteal flag, preventing its damage from utilizing spell lifesteal\n No-spell-amplification flag, preventing its damage from being amplified with spell damage amplification\n Cleave damage depends on the attack damage value of the cleaving unit, not on how much their primary attack target took\n It is reduced by damage block",
        "The complete cleave area is shaped like an isocseles trapezoid in front of the attacking unit\n Multiple sources of cleave fully stack and work independently\n Does not cleave upon attacking wards, buildings or allied units\n <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers, wards and buildings are unaffected by cleave\n Despite the visual effect, the cleave damage is applied instantly in the whole area"
      ],
      "item_behaviour": [],
      "description": "Sven strikes with great force, cleaving all nearby enemy units with his attack.",
      "hot_key": "W",
      "params": [
        "Starting Radius: 150",
        "Distance: 700",
        "End Radius: 360",
        "Cleave Damage: 25%\/50%\/75%\/100% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 50%\/75%\/100%\/125%)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Sven_Great_Cleave.mp3\/revision\/latest?cb=20191216024628",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Great Cleave",
      "cooldown": null,
      "legacy_key": "C",
      "story": "The Vigil Knights still seek to reclaim the stolen Outcast Blade from Sven, a weapon capable of cutting wide swaths through lesser warriors."
    },
    {
      "notes": [
        "Interrupts Sven's channeling abilities upon cast",
        "Only affects allied heroes, including clones, illusions and creep-heroes",
        "Leveling up the ability or the armor bonus increasing or movement speed bonus increasing <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talents do not update already existing Warcry buffs",
        "SHARD NOTES Adds a passive component to Warcry, with the active effects still present\n Warcry now passively affects all allies, including creeps, within 1200 radius and the aura buff lingers for 0.5 seconds\n Does not affect buildings and wards\n Neither affects invulnerable nor hidden allies as well\n However, it fully affects ally <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers\n While active, Warcry grants Sven a total of 12\/15\/18\/21 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 22\/25\/28\/31) bonus armor"
      ],
      "item_behaviour": [],
      "description": "Sven's Warcry heartens his allied heroes for battle, increasing their armor and movement speed. Lasts 9 seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation: <span image=\"images\/instant_cast_time.png\">[picture:instant_cast_time]<\/span> 0+0",
        "Effect Radius: 700",
        "Move Speed Bonus: 10%\/14%\/18%\/22% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 18%\/22%\/26%\/30%)",
        "Armor Bonus: 6\/9\/12\/15 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 16\/19\/22\/25)",
        "Duration: 9 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 12)",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Aura Radius:  1200",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Aura Armor Bonus:  6",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Aura Linger Duration:  0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f1\/Sven_Warcry.mp3\/revision\/latest?cb=20191216024631",
      "effects": [
        "Ability: No Target",
        "Affects: Allies"
      ],
      "mana": "32\/28\/24\/20",
      "aghanim": null,
      "name": "Warcry",
      "cooldown": "30\/35\/40\/45",
      "legacy_key": "W",
      "story": "Calling a few lines from the Vigil Codex fortifies Sven's obedience to his rogue code. So poetic!"
    },
    {
      "notes": [
        "Grants flat bonus attack damage based on Sven's main attack damage\n Does not further increase bonus attack damage\n Sven's current main attack damage is periodically checked and the bonuses are adapted instantly",
        "Leveling up the ability and the damage increasing <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent do not update an already existing God's Strength buff"
      ],
      "item_behaviour": [],
      "description": "Sven channels his rogue strength, granting bonus damage for 35 seconds.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0",
        "Attack Damage Bonus: 120%\/160%\/200% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 170%\/210%\/250%)",
        "Duration: 35"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Sven_God%27s_Strength.mp3\/revision\/latest?cb=20191216024643",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "105\/100\/95 (TagTalent 90\/85\/80)",
      "aghanim": null,
      "name": "God's Strength",
      "cooldown": "100\/150\/200",
      "legacy_key": "R",
      "story": "With the strength that shattered the Sacred Helm, the Rogue Knight stands unopposed in melee combat."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 22.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.3,
    "attrAgilityInc": 2.2,
    "attrAgility": 21.0
  },
  "description": "Cleaves down enemies with his incredible strength. The Rogue Knight lives by two creeds: Honor, as ordained by his own personal code, and Solitude. Always eager to charge into a fight. Using his iron gauntlet, he launches a Storm Hammer, stunning grouped enemies as he transports himself into battle, then closes in to cut them down with Great Cleave. Letting out a truly frightening Warcry, he ignites and calls upon God's Strength, a few swings of his gargantuan sword are often more than enough to slay on his hapless foes.  Carry Disabler Initiator Durable Nuker ★☆☆",
  "trivia": [
    "Sven is named after Danish bodybuilder and actor Sven-Ole Thorsen. In earlier versions of DotA, Sven had the fun name \"Arnold Schwarzenegger\".",
    "In earlier versions of DotA, Sven had the fun name \"Arnold Schwarzenegger\".",
    "The phrases \" Link▶️ Twas only a flesh wound\" and \" Link▶️ It was but a scratch\" are references to the Black Knight from Monty Python and the Holy Grail.",
    "The phrases \" Link▶️ Blame the host\" and \" Link▶️ Bad host\" are references to the original Warcraft III DotA gameplay when game stability depended on the quality of internet connection on the host player.",
    "Storm Hammer was named Storm Bolt in the early beta phases and was renamed into Storm Hammer at one point. It is also its original name in DotA 1 and reflected in one of Sven's cast responses in Dota 2, where he is referring to it as Link▶️ \"Storm Bolt\". Rubick also has the same response when stealing Storm Hammer.",
    "Rubick also has the same response when stealing Storm Hammer."
  ],
  "history": "Sven is the bastard son of a Vigil Knight, born of a Pallid Meranth, raised in the Shadeshore Ruins. With his father executed for violating the Vigil Codex, and his mother shunned by her wild race, Sven believes that honor is to be found in no social order, but only in himself. After tending his mother through a lingering death, he offered himself as a novice to the Vigil Knights, never revealing his identity. For thirteen years he studied in his father's school, mastering the rigid code that declared his existence an abomination. Then, on the day that should have been his In-Swearing, he seized the Outcast Blade, shattered the Sacred Helm, and burned the Codex in the Vigil's Holy Flame. He strode from Vigil Keep, forever solitary, following his private code to the last strict rune. Still a knight, yes...but a rogue knight. He answers only to himself.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+50% God's Strength Damage",
        "talent_left": "+1.25s Storm Hammer Stun Duration"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+8% Warcry Movement Speed",
        "talent_left": "+10 Warcry Armor"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-15s God's Strength Cooldown",
        "talent_left": "+25% Great Cleave Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+3s Warcry Duration",
        "talent_left": "+15 Attack Speed"
      }
    ]
  }
}