{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Doom до 40%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+150% к прорубанию",
          "talentRight": "+2,4% к урону горения от Infernal Blade"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+15% к доп. скорости от Scorched Earth",
          "talentRight": "+30 к урону в секунду от Doom"
        },
        {
          "talentLvl": "15",
          "talentLeft": "Devour можно применять на древних крипов",
          "talentRight": "-10 сек. перезарядки Scorched Earth"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к урону от Scorched Earth",
          "talentRight": "+12% к сопротивлению магии"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Devour.mp3\/revision\/latest?cb=20140424030129",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Вражеских существ",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Целью могут быть все нейтральные крипы и призываемые существа, за исключением курьеров, древних крипов и крипов-героев. При выборе соответствующего таланта целью могут стать древние крипы (исключая курьеров и Рошана).",
        "При выборе соответствующего таланта целью могут стать древние крипы (исключая курьеров и Рошана).",
        "Выбранный крип мгновенно умирает, при этом герой получит награду и опыт как будто он совершил последний удар.",
        "Автоприменение разрешает перенимать заклинания нейтральных крипов. Оно не заставляет Doom автоматически применять способность. Может получать способности от нейтральных крипов. Способности других существ не передаются. Заклинания приобретаются мгновенно при пожирании нейтрального крипа. Способности используют то же время применения, что было у поглощенного существа, однако задержка на применение зависит от заклинания (смотрите эту статью). Способности, перенятые от нейтральных крипов, сохраняются даже после смерти Doom до момента, пока герой не поглотит другого нейтрального крипа со способностями с включенным автоприменение. Если использовать заклинание с автоприменением на крипе без способностей, перенятые ранее способности сохранятся. Когда Doom пожирает Древнего дракона, то он получает Fireball и Splash Attack, но не Dragonhide Aura. В режиме Ability Draft герой при пожирании крипа получает только его пассивные способности, но не активные. Перезарядка Devour не может быть сброшена с помощью Rearm.",
        "Может получать способности от нейтральных крипов. Способности других существ не передаются. Заклинания приобретаются мгновенно при пожирании нейтрального крипа.",
        "Способности используют то же время применения, что было у поглощенного существа, однако задержка на применение зависит от заклинания (смотрите эту статью).",
        "Способности, перенятые от нейтральных крипов, сохраняются даже после смерти Doom до момента, пока герой не поглотит другого нейтрального крипа со способностями с включенным автоприменение.",
        "Если использовать заклинание с автоприменением на крипе без способностей, перенятые ранее способности сохранятся.",
        "Когда Doom пожирает Древнего дракона, то он получает Fireball и Splash Attack, но не Dragonhide Aura.",
        "В режиме Ability Draft герой при пожирании крипа получает только его пассивные способности, но не активные. Перезарядка Devour не может быть сброшена с помощью Rearm.",
        "Бонусное золото является ненадёжным и предоставляется по истечению срока действия баффа. Если герой умрет во время переваривания, то он не получит дополнительное золото.",
        "Модификаторы от нескольких применений складываются."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "Q",
      "cooldown": "60",
      "description": "Пожирает вражеского или нейтрального крипа, перенимая его способности. Если автоматическое применение выключено, способности не перенимаются. Даёт дополнительное восстановление здоровья до окончания перезарядки способности.",
      "spellName": "Devour",
      "params": [
        "Анимация применения: 0,3+0,93",
        "Дальность применения: 300",
        "Дополнительное золото: 60\/120\/180\/240",
        "Макс. уровень крипа: 4\/5\/6\/6",
        "Длительность переваривания: 60"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Обжорство и жадность Люцифера неистощимы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Scorched_Earth.mp3\/revision\/latest?cb=20141128213544",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Scorched Earth прерывает произносимые способности Doom.",
        "Центр радиуса способности закреплен за Doom всю длительность.",
        "Скорость передвижения предоставлена аурой, задерживающейся на 15 секунды.",
        "Урон не связан с аурой.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая до 15 раз.",
        "Может нанести до 225\/450\/675\/900 (TagTalent 375\/600\/825\/1050) урона одному врагу, если он оставался в радиусе действия всю длительность (до уменьшений).",
        "Несколько применений Scorched Earth не складываются. Активация способности просто обновит бафф.",
        "Выбор увеличивающего урон способности таланта мгновенно увеличит урон от текущего применения, но поднятие уровня способности урон не увеличивает.",
        "Выбор увеличивающего скорость передвижения таланта на дополнительную скорость передвижения не увеличит скорость передвижения от текущего применения."
      ],
      "mana": "60\/70\/80\/90",
      "hotKey": "W",
      "cooldown": "50\/45\/40\/35 (TagTalent 40\/35\/30\/25)",
      "description": "Устилает пламенем землю вокруг героя, увеличивая его скорость передвижения, а также нанося урон противникам.",
      "spellName": "Scorched Earth",
      "params": [
        "Анимация применения: 0+0,5",
        "Радиус: 600",
        "Урон в секунду: 15\/30\/45\/60 (TagTalent 25\/40\/55\/70)",
        "Доп. скорость передвижения: 9%\/11%\/13%\/15% (TagTalent 29%\/31%\/33%\/35%)",
        "Длительность задержки ауры: 0,5",
        "Длительность: 15",
        "Действует на героя через иммунитет к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Падший оставляет за собой страшные разрушения — пламя, питающее его, не щадит никого."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Infernal_Blade.mp3\/revision\/latest?cb=20151218155526",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Не срабатывает при мгновенных атаках.",
        "Не действует на Рошана.",
        "Infernal Blade не работает против союзных существ, построек или вардов.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая раз.",
        "Может нанести до 64\/80\/96\/112 + 5%\/10%\/15%\/20% (TagTalent 14,6%\/19,6%\/24,6%\/29,6%) от максимального здоровья цели (до уменьшений).",
        "Несколько применений на одну и ту же цель сочетаются и действуют независимо друг от друга. Выбор увеличивающего урон способности таланта или повышение уровня способности не увеличит урон от уже наложенного эффекта.",
        "Выбор увеличивающего урон способности таланта или повышение уровня способности не увеличит урон от уже наложенного эффекта.",
        "Оглушение представлено оглушающим ударом, сочетающимся с другими способностями, использующими этот эффект. Сначала применяется оглушение, затем накладывается горение, после чего наносится урон от атаки.",
        "Сначала применяется оглушение, затем накладывается горение, после чего наносится урон от атаки.",
        "При улучшении с Aghanim's Shard, увеличивает урон на 150 и длительность оглушения до 1,8, если уровень жертвы равен 3\/6\/9\/12\/15\/18\/21\/24\/25\/26\/27\/28\/29\/30. Работает также против существ, не являющихся героями. Следующие существа будут получать дополнительность оглушение и урон: Гигантский волк, Древний гранитный голем, Древний громозавр, Древний дракон, Древний дракончик, Древний охотник-вожак, Крип-мечник, Огр-чародей, Паучок, Призрак, Рукотворный дух, Сатир-мучитель, Тролль-некромант, Холмовой тролль, Штормовая гарпия,",
        "Работает также против существ, не являющихся героями. Следующие существа будут получать дополнительность оглушение и урон: Гигантский волк, Древний гранитный голем, Древний громозавр, Древний дракон, Древний дракончик, Древний охотник-вожак, Крип-мечник, Огр-чародей, Паучок, Призрак, Рукотворный дух, Сатир-мучитель, Тролль-некромант, Холмовой тролль, Штормовая гарпия,"
      ],
      "mana": "40",
      "hotKey": "E",
      "cooldown": "16\/12\/8\/4",
      "description": "\"Поджигает жертву своим пламенным мечом, поджигая её и оглушая на 0,6 сек. Цель горит 4 сек. и каждую секунду получает урон, равный 16\/20\/24\/28 + 1,25%\/2,5%\/3,75%\/5% от максимального запаса здоровья.",
      "spellName": "Infernal Blade",
      "params": [
        "Дальность применения: 200",
        "Начальный урон: 16\/20\/24\/28",
        "Сжигание от максимального здоровья: 1,25%\/2,5%\/3,75%\/5% (TagTalent 3,65%\/4,9%\/6,15%\/7,4%)",
        "Длительность горения: 4",
        "Длительность оглушения: 0,6 (TagTalent 1,2)",
        "Кратность уровня: 3",
        "Дополнительный урон при кратности уровня: 150",
        "Дополнительная длительность оглушения при кратности уровня: 0,6",
        "Увеличивает длительность оглушения от Infernal Blade с до 0,6 секунды. Если уровень жертвы кратен или выше 24, длительность оглушения увеличится ещё на 1,2 секунды, а урон — на 150.",
        "Пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Люцифер рад поделиться клеймом, полученным после изгнания."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5e\/Doom_ability.mp3\/revision\/latest?cb=20141128213550",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "При использовании применяет к цели базовое развеивание, снимая большинство действующих баффов.",
        "Обезмолвивает и заглушает цель, предотвращая применение заклинаний и использование предметов.",
        "Нельзя применить на древних крипов. Можно применить на крипов-героев и иллюзии. В случае, если существо одновременно и крип-герой, и древний крип, то приоритет отдается второму типу, не позволяя выбрать существо целью ультимейта.",
        "В случае, если существо одновременно и крип-герой, и древний крип, то приоритет отдается второму типу, не позволяя выбрать существо целью ультимейта.",
        "Наносит урон с интервалом в 1 секунду сразу после применения, срабатывая 16 (TagTalent 22) раз.",
        "Может нанести до 480\/720\/960 (TagTalent 660\/990\/1320) без взятия талантов (до уменьшений). При выборе увеличивающего урон таланта, может нанести до 960\/1200\/1440 (TagTalent 1320\/1650\/1980) урона.",
        "При выборе увеличивающего урон таланта, может нанести до 960\/1200\/1440 (TagTalent 1320\/1650\/1980) урона.",
        "Повышение уровня способности не обновит урон уже действующей способности, но выбор таланта на дополнительный урон способность улучшает. Однако взятие увеличивающего урон таланта обновит значение наносимого урона.",
        "Однако взятие увеличивающего урон таланта обновит значение наносимого урона.",
        "Союзники могут добить героев под действием Doom, если уровень их здоровья опустится ниже 25%.",
        "Несколько применений на одно и то же существо не складываются, но обновляют длительность.",
        "При улучшении с Aghanim's Scepter, накладывает на жертву истощение, отключая её пассивные способности."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "145",
      "description": "Вражеского героя настигает жуткая участь, отчего тот получает периодический урон и не может применять способности или использовать предметы.",
      "spellName": "Doom",
      "params": [
        "Анимация применения: 0,5+0,4",
        "Дальность применения: 550",
        "Урон в секунду: 30\/45\/60 (TagTalent 60\/75\/90)",
        "Длительность: 16 (TagAghanim 22)",
        "Способность накладывает истощение и действует на 6 секунд дольше."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "По ком прозвонил колокол Вашундола, за тем последует неминуемый рок."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 24.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 0.9,
    "attrAgility": 11.0
  },
  "description": "Doom — это герой с ближним типом атаки, основным атрибутом которого является сила. Он имеет четыре способности, каждая из которых - активная. Его первая способность, Devour, пожирает вражеского или нейтрального крипа, перенимая способности, которыми он обладал и получая за его переваривание дополнительное золото и бонус к регенерации здоровья. Например, если целью заклинания будет Кентавр-захватчик, то герой получит его способность War Stomp. Вторая способность, Scorched Earth, поджигает землю вокруг героя, нанося урон всем врагам в области действия, в то время как сам герой получает бонус к скорости передвижения. Третья способность, Infernal Blade, кратковременно оглушает и поджигает врага, нанося урон в процентах от максимального здоровья цели. Улучшение с Aghanim's Scepter позволяет отключить большинство пассивных способностей, увеличивает длительность горения и оглушения. Ультимативная способность, Doom, проклинает вражеского героя, в результате чего тот получает периодический урон и теряет возможность использовать способности или предметы.",
  "history": "Он — тот, кто горит, но не сгорает, пожирает, но не насыщается, убивает, но остается безнаказанным. Падший ангел несёт погибель всем, кто осмелится противостоять ему, срезая души остриём своего пламенного меча. Когда-то Люцифер был уважаемым генералом из мира за гранью света, но однажды не преклонил колени и был обвинён в грехе — неповиновении. Шесть раз пробил его имя великий колокол Вашундола. Шестьдесят и ещё шесть раз его крылья клеймили, покуда от них не остались лишь дымящиеся культи. Бескрылый, он потерял свою связь со светом и со страшным воплем пал оземь, оставив в пустыне кратер. Покинув Рай навеки, теперь он нападает на любого без повода и без пощады. Из всех живых существ лишь он волен ходить по семи тёмным владениям. Движимый непреложными стремлениями, искажённый невообразимыми способностями, он всегда несёт с собой свой собственный ад. Люцифер не покорится никому, и когда-нибудь мир будет принадлежать ему.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+150% к прорубанию",
      "talentRight": "+2,4% к урону горения от Infernal Blade"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+15% к доп. скорости от Scorched Earth",
      "talentRight": "+30 к урону в секунду от Doom"
    },
    {
      "talentLvl": "15",
      "talentLeft": "Devour можно применять на древних крипов",
      "talentRight": "-10 сек. перезарядки Scorched Earth"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к урону от Scorched Earth",
      "talentRight": "+12% к сопротивлению магии"
    }
  ]
}