{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fe\/Book_of_Shadows_Shadows.mp3\/revision\/latest?cb=20210120232104",
      "effects": [
        "Дальность применения: 700",
        "Длительность: 4"
      ],
      "notes": [
        "При применении применяет базовое развеивание на цель. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "На время длительности накладывает безмолвие, заглушение и бессилие на цель.",
        "Во время Shadows, цель сквозная и невосприимчива к атакам. Цель всё ещё можно выбирать, однако, нацеленные команды мгновенно отменяются на расстоянии применения. Не предотвращает от отражения заклинаний обратно к цели. Не позволяет избегать снаряды.",
        "Цель всё ещё можно выбирать, однако, нацеленные команды мгновенно отменяются на расстоянии применения.",
        "Не предотвращает от отражения заклинаний обратно к цели.",
        "Не позволяет избегать снаряды.",
        "Почти каждое заклинание считает цель, как будь-то она невидима. Заклинания, которые не считают цель невидимой: Heat-Seeking Missile, Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism и Thundergod's Wrath. В отличии от случая с невидимостью, жуки, фантомы и нетленные зомби не умирают мгновенно при применении Shadows на цель.",
        "Heat-Seeking Missile, Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism и Thundergod's Wrath.",
        "В отличии от случая с невидимостью, жуки, фантомы и нетленные зомби не умирают мгновенно при применении Shadows на цель."
      ],
      "mana": "0",
      "abilityName": "Shadows",
      "cooldown": "8",
      "description": "Целью может быть союзник, враг или сам владелец. Выбранное существо 4 секунды нельзя выбрать целью, оно не может применять способности, использовать предметы или атаковать. Применяет нормальное развеивание.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "260 здоровья и 1,3 восстановления здоровья.",
    "156 маны и 0,65 восстановления маны.",
    "13 скорости атаки и 2,17 основной брони.",
    "13 основного урона от атаки всем \/ \/ героям."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Book of Shadows",
  "description": "Невозможный фолиант, полный нечитаемых рассказов, рождённых из непостижимых мыслей.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}