{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "When a hero has an upgrade available, the item's and the upgraded spell's tooltip states what exactly is upgraded.",
        "Single target spells with Aghanim's Scepter upgrades that are reflected by Spell Reflection depend on whether the reflecting hero has Aghanim's Scepter, not the original caster of the reflected spell."
      ],
      "mana": null,
      "abilityName": "Ability Upgrade",
      "cooldown": null,
      "description": "Upgrades the ultimate, and some abilities, of all heroes.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Aghanim's Blessing only provides the ability upgrades from Aghanim's Scepter. It does not provide the attribute bonuses.",
    "A hero may only consume Aghanim's Blessing once. Alchemist's infused Aghanim's Scepter works separately, fully stacking with Aghanim's Blessing.",
    "Alchemist's infused Aghanim's Scepter works separately, fully stacking with Aghanim's Blessing.",
    "On his third death, Roshan either drops Aghanim's Blessing or a Refresher Shard as a third item, resulting in a 50% chance for either. On his fourth death and onwards, Roshan always drops Aghanim's Blessing as a fourth item. Unlike a bought one, the Aghanim's Blessing dropped by Roshan cannot be sold. Just like Cheese and Refresher Shard, Aghanim's Blessing dropped by Roshan is sharable and can be used by allied and enemy heroes.",
    "On his fourth death and onwards, Roshan always drops Aghanim's Blessing as a fourth item.",
    "Unlike a bought one, the Aghanim's Blessing dropped by Roshan cannot be sold.",
    "Just like Cheese and Refresher Shard, Aghanim's Blessing dropped by Roshan is sharable and can be used by allied and enemy heroes."
  ],
  "cost": "5800",
  "lore": null,
  "consistFrom": [
    "Aghanim's Scepter",
    "Recipe"
  ],
  "boughtFrom": "Magical",
  "name": "Aghanim's Blessing",
  "description": "The scepter of a wizard with demigod-like powers.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": null,
  "tips": null
}