{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The strength talent effectively grants Dazzle 400 health and 2 health regeneration."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+0.5 Bad Juju Armor Reduction",
          "talentRight": "-32% Poison Touch Slow"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 Poison Touch DPS",
          "talentRight": "+250 Heal On Shallow Grave End"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+60 Attack Speed",
          "talentRight": "+20 Strength"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1.75 Mana Regen",
          "talentRight": "+50 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/47\/Dazzle_Poison_Touch_1.mp3\/revision\/latest?cb=20191216012353",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Physical (TagAghanim Instant Kill)"
      ],
      "notes": [
        "Poison Touch's projectiles travel at a speed of 1300.",
        "With the starting radius, distance, and end radius, Poison Touch can hit units up to 1000 range away. The complete area is shaped like a cone in front of Dazzle. The area starts in front of Dazzle, and not at the primary target's position.",
        "The complete area is shaped like a cone in front of Dazzle.",
        "The area starts in front of Dazzle, and not at the primary target's position.",
        "Targets within the cone area are not chosen randomly. It chooses the closest valid targets to the primary target within the cone.",
        "Deals damage in 1-second intervals, starting immediately, resulting in 5\/6\/7\/8 damage instances when not refreshed.",
        "Can deal up to 80\/168\/280\/416 (TagTalent 280\/408\/560\/736) damage to each target when not refreshed (before reductions).",
        "The duration gets refreshed whenever Dazzle lands an attack on the debuffed unit. Missed attacks do not refresh it. Refreshing it also increases the movement speed slow value by 2%\/2.5%\/3%\/3.5% each time. This has no stack limit.",
        "Refreshing it also increases the movement speed slow value by 2%\/2.5%\/3%\/3.5% each time. This has no stack limit.",
        "This is how much movement speed one instance of Poison Touch reduces when refreshed 8 times on each level: Level 1: 18%\/20%\/22%\/24%\/26%\/28%\/30%\/32% (TagTalent 50%\/52%\/54%\/56%\/58%\/60%\/62%\/64%) movement speed. Level 2: 20.5%\/23%\/25.5%\/28%\/30.5%\/33%\/35.5%\/38% (TagTalent 52.5%\/55%\/57.5%\/60%\/62.5%\/65%\/67.5%\/70%) movement speed. Level 3: 23%\/26%\/29%\/32%\/35%\/38%\/41%\/44% (TagTalent 55%\/58%\/61%\/64%\/67%\/70%\/73%\/76%) movement speed. Level 4: 25.5%\/29%\/32.5%\/36%\/39.5%\/43%\/46.5%\/50% (TagTalent 57.5%\/61%\/64.5%\/68%\/71.5%\/75%\/78.5%\/82%) movement speed.",
        "Level 1: 18%\/20%\/22%\/24%\/26%\/28%\/30%\/32% (TagTalent 50%\/52%\/54%\/56%\/58%\/60%\/62%\/64%) movement speed.",
        "Level 2: 20.5%\/23%\/25.5%\/28%\/30.5%\/33%\/35.5%\/38% (TagTalent 52.5%\/55%\/57.5%\/60%\/62.5%\/65%\/67.5%\/70%) movement speed.",
        "Level 3: 23%\/26%\/29%\/32%\/35%\/38%\/41%\/44% (TagTalent 55%\/58%\/61%\/64%\/67%\/70%\/73%\/76%) movement speed.",
        "Level 4: 25.5%\/29%\/32.5%\/36%\/39.5%\/43%\/46.5%\/50% (TagTalent 57.5%\/61%\/64.5%\/68%\/71.5%\/75%\/78.5%\/82%) movement speed.",
        "",
        "Multiple instances of Poison Touch fully stack.",
        "Bad Juju effectively reduces cooldown to: Level 1: 19.98\/17.76\/15.54\/13.32 Level 2: 16.74\/14.88\/13.02\/11.16 Level 3: 13.5\/12\/10.5\/9",
        "Level 1: 19.98\/17.76\/15.54\/13.32",
        "Level 2: 16.74\/14.88\/13.02\/11.16",
        "Level 3: 13.5\/12\/10.5\/9",
        "",
        "With Aghanim's Shard, enemies are hexed on projectile impact, setting their base movement speed to 100, silencing, muting and disarming them. The hex is only applied once upon projectile impact. It is not applied upon refreshing the debuff with attacks. The main debuff and the hex are applied at the same time, so after the hex the target is still slowed for 2.75\/3.75\/4.75\/5.75 seconds. Poison Touch first applies its main debuff, then the hex debuff.",
        "The hex is only applied once upon projectile impact. It is not applied upon refreshing the debuff with attacks.",
        "The main debuff and the hex are applied at the same time, so after the hex the target is still slowed for 2.75\/3.75\/4.75\/5.75 seconds.",
        "Poison Touch first applies its main debuff, then the hex debuff."
      ],
      "mana": "110\/120\/130\/140",
      "item_behaviour": [],
      "name": "Poison Touch",
      "cooldown": "27\/24\/21\/18",
      "description": "Releases a cone of poison that strikes multiple enemy units. Deals damage over time and slows the targets. Anytime the targets get attacked by Dazzle, the debuff duration is refreshed and slow is increased.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.57",
        "Cast Range: 500\/600\/700\/800",
        "Starting Radius: 200",
        "Max Distance: 500",
        "End Radius: 300",
        "Number of Targets: 2\/4\/6\/8",
        "Damage per Second: 16\/28\/40\/52 (TagTalent 56\/68\/80\/92)",
        "Base Move Speed Slow: 16%\/18%\/20%\/22% (TagTalent 48%\/50%\/52%\/54%)",
        "Move Speed Slow Increase per Refresh: 2%\/2.5%\/3%\/3.5%",
        "Duration: 4\/5\/6\/7",
        "Hex Set Move Speed: 100",
        "Hex Duration: 1.25",
        "Causes Poison Touch to hex affected targets for 1.25 seconds.",
        "Slow persists and deals damage if debuff was placed before spell immunity and when not dispelled.",
        "Blocked upon cast fully only when primary target."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9d\/Dazzle_Shallow_Grave.mp3\/revision\/latest?cb=20191216012356",
      "effects": [
        "Ability Target Unit",
        "Affects Allied Heroes"
      ],
      "notes": [
        "Prevents the target from dying by setting its minimum health to 1. This means the target cannot die to damage, not even damage flagged as HP removal, so that it prevents the target from dying to False Promise's delayed damage. Does not protect the target against Culling Blade's kill threshold, or Wraith Delay expiring. Stops Ice Blast from shattering the target when graved while below the shatter threshold.",
        "This means the target cannot die to damage, not even damage flagged as HP removal, so that it prevents the target from dying to False Promise's delayed damage.",
        "Does not protect the target against Culling Blade's kill threshold, or Wraith Delay expiring.",
        "Stops Ice Blast from shattering the target when graved while below the shatter threshold.",
        "Damage taken is technically not reduced, so any damage event still registers the full damage.",
        "Can be cast on illusions and creep-heroes. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "With the level 20 talent, losing the buff in any way heals the target for 250 health.",
        "Bad Juju effectively reduces cooldown to: Level 1: 26.64\/22.2\/17.76\/13.32 Level 2: 22.32\/18.6\/14.88\/11.16 Level 3: 18\/15\/12\/9",
        "Level 1: 26.64\/22.2\/17.76\/13.32",
        "Level 2: 22.32\/18.6\/14.88\/11.16",
        "Level 3: 18\/15\/12\/9",
        ""
      ],
      "mana": "120\/130\/140\/150",
      "item_behaviour": [],
      "name": "Shallow Grave",
      "cooldown": "36\/30\/24\/18",
      "description": "An ally blessed with Shallow Grave, no matter how close to death, cannot die while under its protection.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 700\/800\/900\/1000",
        "Duration: 4\/4.5\/5\/5.5",
        "Heal: 250"
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Dazzle_Shadow_Wave.mp3\/revision\/latest?cb=20191216012355",
      "effects": [
        "Ability Target Unit",
        "Affects Allies \/ Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Shadow Wave has no bounce delay, so all targets are healed at the same time.",
        "Shadow Wave has the following priorites: Hurt allied heroes ➤ hurt allied non-hero units (includes illusions) ➤ allied heroes ➤ non-hero units. The lower the health of nearby allies, the higher their priority. This means the lowest health units get healed first. If multiple units meet the exact same criteria (e.g. only full health non-hero units are within range), it chooses between them randomly.",
        "The lower the health of nearby allies, the higher their priority. This means the lowest health units get healed first.",
        "If multiple units meet the exact same criteria (e.g. only full health non-hero units are within range), it chooses between them randomly.",
        "Regardless of the target, Dazzle is always healed without counting towards the number of bounces, effectively healing 4\/5\/6\/7 units. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Can heal and damage up to 320\/500\/720\/980 (TagTalent 720\/1000\/1320\/1680) health when all bounces hit (before reductions). The damage radius is centered around each healed unit. An enemy unit can get damaged by all healed units per cast.",
        "The damage radius is centered around each healed unit. An enemy unit can get damaged by all healed units per cast.",
        "Bad Juju effectively reduces cooldown to: Level 1: 10.36\/8.88\/7.4\/5.92 Level 2: 8.68\/7.44\/6.2\/4.96 Level 3: 7\/6\/5\/4",
        "Level 1: 10.36\/8.88\/7.4\/5.92",
        "Level 2: 8.68\/7.44\/6.2\/4.96",
        "Level 3: 7\/6\/5\/4",
        "",
        "With Aghanim's Scepter, Shadow Wave applies a basic dispel on Dazzle and all healed allies."
      ],
      "mana": "90\/100\/110\/120",
      "item_behaviour": [],
      "name": "Shadow Wave",
      "cooldown": "14\/12\/10\/8",
      "description": "Sends out a bolt of power that arcs between allies, healing them while damaging any units standing nearby. Dazzle is always healed by Shadow Wave.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0.57",
        "Cast Range: 800",
        "Damage Radius: 185",
        "Bounce Distance: 475",
        "Number of Bounces: 3\/4\/5\/6",
        "Heal: 80\/100\/120\/140 (TagAghanim 180\/200\/220\/240)",
        "Damage: 80\/100\/120\/140 (TagAghanim 180\/200\/220\/240)",
        "Causes Shadow Wave to dispel allies. Increases heal by +100 and damage by +100"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Dazzle_Bad_Juju_1.mp3\/revision\/latest?cb=20191216012358",
      "effects": [
        "Ability Passive",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Multiple sources of percentage-based cooldown reductions do not stack. The highest value takes priority.",
        "Reduces enemies' armor before the triggering ability takes effect.",
        "Does not trigger on active item abilities, on abilities with 0 cooldown, or on abilities which do not trigger on-cast effects.",
        "Places one debuff on enemies. This debuff gets stronger when it gets refreshed with successive casts. A number on the icon shows how many times the debuff was refreshed, including the first cast.",
        "A number on the icon shows how many times the debuff was refreshed, including the first cast.",
        "Affects invisible units and units in the Fog of War. Does not affect invulnerable or hidden enemies. Does not affect Roshan.",
        "Does not affect Roshan."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Bad Juju",
      "cooldown": null,
      "description": "Passively reduces cooldowns on your abilities and items. Anytime you cast a spell, all nearby enemies will have their armor reduced. Debuff stacks and refreshes duration.",
      "hot_key": "R",
      "params": [
        "Cooldown Reduction: 26%\/38%\/50%",
        "Debuff Radius: 1200",
        "Armor Reduction per Cast: 2\/2.25\/2.5 (TagTalent 2.5\/2.75\/3)",
        "Duration: 8"
      ],
      "legacy_key": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 18.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 1.7,
    "attrAgility": 20.0
  },
  "description": "Dazzle, the Shadow Priest, is a ranged intelligence hero who conjures dazzling dark light to heal his allies and prevent their deaths. His Shadow Wave is a low-cooldown nuke and chain healing ability, dealing more damage to nearby enemies for each ally the wave heals. Shallow Grave makes an ally temporarily unkillable, allowing Dazzle's teammates to survive impossible situations. Poison Touch is a spammable ability that slows its target and deals damage over time. His ultimate, Bad Juju, allows for all of his spells and items to be used more frequently, while also causing his spells to temporarily reduce his enemies' armor.",
  "history": "Each young acolyte to the Dezun order must complete a series of rites before becoming a shadow priest. The final rite, the rite of shades, is a harrowing spiritual journey through the Nothl Realm, an unpredictable domain from which not all visitants return. Of those who do, some return mad. Others return with strange aptitudes. But all who go there are changed by their experiences. Driven by the need for enlightenment, Dazzle was the youngest of his tribe ever to request the sacred ritual. At first the order refused him, saying he was too young. But Dazzle was not to be dissuaded. Sensing something special in the headstrong young acolyte, the elders relented. Dazzle drank down the sacred potion and sat by the fire while the rest of his tribe danced through the night. In this ethereal dimension of the Nothl Realm, the properties of light and dark are inverted. Thus his brilliant healing light, beautiful to our eye, is actually a sinister kind of evil; and the darkest deeds are done in a dazzling glow. The elders' intuition was prophetic: Dazzle returned to his people as a Shadow Priest like none seen before, with the power to heal as well as to destroy. Now he uses his gift to cut down his enemies and mend his friends.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+0.5 Bad Juju Armor Reduction",
      "talentRight": "-32% Poison Touch Slow"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 Poison Touch DPS",
      "talentRight": "+250 Heal On Shallow Grave End"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+60 Attack Speed",
      "talentRight": "+20 Strength"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1.75 Mana Regen",
      "talentRight": "+50 Damage"
    }
  ]
}