{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Havoc_Hammer_Havoc.mp3\/revision\/latest?cb=20200116232657",
      "effects": [
        "Радиус: 400",
        "Дальность отталкивания: 250",
        "Базовый урон: 275",
        "Своей силы в урон: 100%",
        "Замедление скорости передвижения: 50%",
        "Замедление скорости атаки: 50",
        "Длительность отталкивания: 0,3",
        "Длительность замедления: 3"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания владельца.",
        "Отталкивает существ со скоростью 833,33. Дальность отталкивания всегда равна 250, независимо от расстояния от владельца до существа.",
        "Существа во время отталкивания не обезвреживаются, поэтому могут свободно поворачиваться, атаковать и использовать заклинания и предметы. Произносимые заклинания не прерываются.",
        "Может оттолкнуть существ на непроходимую территорию. После приземления существ любые деревья в радиусе 100 от них разрушаются.",
        "Дебаффы замедления и отбрасывания применяются одновременно, поэтому непосредственно замедление будет эффективно лишь 2,7 секунды.",
        "Havoc сначала применяет отталкивание, затем замедление, а затем наносит урон."
      ],
      "mana": null,
      "abilityName": "Havoc",
      "cooldown": null,
      "description": "Отталкивает врагов, находящихся на расстоянии 400 от владельца. Жертвы получают магический урон, равный 275 + силе владельца, помноженной на 1, и на 0,3 сек. замедляются на 50%.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Havoc Hammer",
  "description": "Нейтральные предметы 4 разряда Один и тот же предмет может упасть единожды на каждую команду. Каждой команде может выпасть максимум 5 предметов на разряд. Каждой команде может выпасть только один расходуемый предмет на разряд. Шанс выпадения с древних крипов в 3 раза выше. Активное Havoc Бонус ? +18 к силе +30 к урону Передаваемый Сообщ. исп. ? Шанс выпадения 10% ( 30%) Доступность ? 36:40 МИН+ Рецепт",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}