{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Hand_of_Midas_Transmute.mp3\/revision\/latest?cb=20191227195428",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских существ",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "При использовании мгновенно убивает выбранное существо и дает владельцу 160 ненадёжного золота и 210% от опыта, даваемого за убийство цели.",
        "Обычные награды в этом случае не даются, поэтому за смерть существа ни один герой поблизости не получит ни обычного опыта, ни золота.",
        "Вопреки визуальным эффектам золото и опыт даются мгновенно.",
        "Для убийства наносит урон, равный текущему здоровью цели. Этот урон игнорируется любыми видами уменьшений или усилений. То есть урон активирует большинство эффектов, реагирующих на урон, таких как провокация (нейтральных или линейных) крипов.",
        "То есть урон активирует большинство эффектов, реагирующих на урон, таких как провокация (нейтральных или линейных) крипов.",
        "Нельзя применить на варды, строения, древних крипов и призываемых Necronomicon существ."
      ],
      "mana": null,
      "abilityName": "Transmute",
      "cooldown": "90",
      "description": "Убивает выбранную цель (но не героя), давая за неё 160 золота и в 2,1 раза больше опыта. Не действует на древних крипов.",
      "params": [
        "Дальность применения: 600",
        "Дополнительное золото: 160",
        "Дополнительный опыт: 210%"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2200",
  "lore": null,
  "consistFrom": [
    "Gloves of Haste",
    "Recipe"
  ],
  "boughtFrom": "Аксессуары",
  "name": "Hand of Midas",
  "description": "Эта перчатка, сохранившаяся благодаря неведомой магии, служит жадности владельца, наполняя его карманы золотом в обмен на жизни животных.",
  "trivia": [
    "Название предмета взято из греческой мифологии: Мидас обладал силой, обращавшей всё, к чему он прикасался, в золото."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+40 к скорости атаки"
  ],
  "tips": null
}