{
  "abilities": [
    {
      "notes": [
        "The strength talent effectively grants Weaver 180 health and 0.9 health regeneration."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 Geminate Attack",
          "talentRight": "2 Shukuchi Charges"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0.5 Swarm Armor Reduction",
          "talentRight": "+90 Geminate Attack Damage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+2 Swarm Attacks to Kill",
          "talentRight": "+20 Mana Break"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+9 Strength",
          "talentRight": "+50 Shukuchi Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Weaver_The_Swarm_1.mp3\/revision\/latest?cb=20191216030509",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "The Swarm spawn within a 300 radius randomly around Weaver and moves forward at a speed of 750, taking 4 seconds to reach the maximum distance. The Beetles are not attackable when traveling as a swarm. They can be attackable only after latching onto targets. They provide flying vision while traveling forwards, and while latched onto their targets. They have the highest priority for auto-attack behaviors, together with Phantoms. With the maximum travel distance, spawn radius, and latch radius, the Beetles can latch on units 3400 range away.",
        "The Beetles are not attackable when traveling as a swarm. They can be attackable only after latching onto targets.",
        "They provide flying vision while traveling forwards, and while latched onto their targets.",
        "They have the highest priority for auto-attack behaviors, together with Phantoms.",
        "With the maximum travel distance, spawn radius, and latch radius, the Beetles can latch on units 3400 range away.",
        "The Beetle latches 64 range in front of any enemy unit that comes within 100 radius, unless another Beetle has already latched onto it. This means that multiple casts do not affect the same unit more than once, and its duration cannot be refreshed. Can latch on invulnerable units, but not invisible or hidden units. The Beetle and its latched target have the following interactions: When the latched target turns invisible, while not under True Sight, the Beetle dies instantly. However, with Aghanim's Shard, Beetles can latch on invisible units (ignoring True Sight Immunity), and provide True Sight over them. When the latched target is hidden, the Beetle is still latched onto the target and not removed. The Beetle dies instantly while entering Chronosphere. Beetles that die instantly in the aforementioned situations above are not credited to anyone.",
        "This means that multiple casts do not affect the same unit more than once, and its duration cannot be refreshed.",
        "Can latch on invulnerable units, but not invisible or hidden units.",
        "The Beetle and its latched target have the following interactions: When the latched target turns invisible, while not under True Sight, the Beetle dies instantly. However, with Aghanim's Shard, Beetles can latch on invisible units (ignoring True Sight Immunity), and provide True Sight over them. When the latched target is hidden, the Beetle is still latched onto the target and not removed.",
        "When the latched target turns invisible, while not under True Sight, the Beetle dies instantly.",
        "However, with Aghanim's Shard, Beetles can latch on invisible units (ignoring True Sight Immunity), and provide True Sight over them.",
        "When the latched target is hidden, the Beetle is still latched onto the target and not removed.",
        "The Beetle dies instantly while entering Chronosphere.",
        "Beetles that die instantly in the aforementioned situations above are not credited to anyone.",
        "The Swarm deals damage in 1.15\/1.0\/0.85\/0.7-second intervals, starting immediately when it is latched on a unit, this results in 14\/17\/19\/23 possible attacks. Although the Beetles are latched to their targets, the damage is sourced to Weaver, not the Beetles. Therefore, the damage is affected by outgoing damage manipulation and spell lifesteal. Can deal up to 252\/340\/418\/552 damage to each latched enemy (before reductions).",
        "Although the Beetles are latched to their targets, the damage is sourced to Weaver, not the Beetles.",
        "Therefore, the damage is affected by outgoing damage manipulation and spell lifesteal.",
        "Can deal up to 252\/340\/418\/552 damage to each latched enemy (before reductions).",
        "The armor reduction is bound to the Beetle and it is independent from the damage. The armor reduction fully affects ethereal units, but not invulnerable units. Can reduce up to 14\/17\/19\/23 (TagTalent 21\/25.5\/28.5\/34.5) armor per unit.",
        "The armor reduction fully affects ethereal units, but not invulnerable units.",
        "Can reduce up to 14\/17\/19\/23 (TagTalent 21\/25.5\/28.5\/34.5) armor per unit.",
        "On each interval, The Swarm first applies the armor reduction, then the damage."
      ],
      "mana": "110",
      "item_behaviour": [],
      "name": "The Swarm",
      "cooldown": "44\/36\/28\/20 (TagTalent 42\/34\/26\/18)",
      "description": "Weaver launches a swarm of 12 young Weavers that latch on any enemy unit in their path, attacking and reducing armor until it is killed.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 3000",
        "Max Travel Distance: 3000",
        "Beetles Spawn Radius: 300",
        "Beetles Latch Radius: 100",
        "Number of Beetles: 12",
        "Non-Hero Attacks to Destroy: 8 (TagTalent 10)",
        "Hero Attacks to Destroy: 4 (TagTalent 5)",
        "Tick Interval: 1.15\/1.0\/0.85\/0.7",
        "Damage per Tick: 18\/20\/22\/24",
        "Armor Reduction per Tick: 1 (TagTalent 1.5)",
        "Beetle Duration: 16",
        "Reduces cooldown by 2 seconds. Causes The Swarm to latch onto and reveal invisible units.",
        "Turning spell immune does not remove already attached beetles."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Weaver_Shukuchi.mp3\/revision\/latest?cb=20191216030508",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Shukuchi does not interrupt Weaver's channeling abilities upon cast.",
        "Disjoints projectiles upon cast, if the enemy has no True Sight on Weaver.",
        "Shukuchi can only damage the same unit once per cast.",
        "During the fade time, Weaver can cast abilities, use items and perform attacks without breaking the invisibility.",
        "The invisibility is broken upon reaching the cast point of abilities or items, or upon landing an attack. Missed attacks do not break it. Weaver can pick up, drop or attack items without breaking the invisibility.",
        "Weaver can pick up, drop or attack items without breaking the invisibility.",
        "Grants haste and phased movement while fully invisible, meaning he cannot be slowed while affected. Unlike other phased movement sources, Shukuchi turns Weaver phased instantly upon cast, instead of after the fade time.",
        "Unlike other phased movement sources, Shukuchi turns Weaver phased instantly upon cast, instead of after the fade time."
      ],
      "mana": "60",
      "item_behaviour": [],
      "name": "Shukuchi",
      "cooldown": "12\/10\/8\/6 (TagTalent 0)",
      "description": "Weaver shifts out of visibility, gaining max movement speed --doing harm to any enemies it passes through.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0",
        "Fade Time: 0.25",
        "Damage Radius: 175",
        "Damage: 100\/125\/150\/175 (TagTalent 150\/175\/200\/225)",
        "Haste Speed: 550",
        "Duration: 4",
        "Number of Charges: 2",
        "Charge Replenish Time: 12\/10\/8\/6"
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Weaver_Geminate_Attack.mp3\/revision\/latest?cb=20191216030516",
      "effects": [
        "Ability Target Unit \/ Autocast",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "Upon leveling Geminate Attack the first time, it has Autocast on by default. Despite being an active ability, Geminate Attack can trigger while silenced, if set to Autocast.",
        "Despite being an active ability, Geminate Attack can trigger while silenced, if set to Autocast.",
        "Causes Weaver to perform 1 (TagTalent 2) instant attack(s) on the attacked target 0.25 seconds after releasing the leading attack. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms. They do not break Smoke of Deceit's invisibility as well.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "They do not break Smoke of Deceit's invisibility as well.",
        "The bonus damage is only applied to the extra attacks. The attack that triggers Geminate Attack does not deal more damage. Weaver has to be alive for these extra attacks to happen. There is no range limit for these extra attacks, they launch regardless of how far away the target is currently at. Even if the initial attack damage kills the target before Geminate Attack triggers, the extra attacks are still released, hitting the dead target.",
        "Weaver has to be alive for these extra attacks to happen.",
        "There is no range limit for these extra attacks, they launch regardless of how far away the target is currently at.",
        "Even if the initial attack damage kills the target before Geminate Attack triggers, the extra attacks are still released, hitting the dead target.",
        "Works against enemy buildings, Couriers and wards, except for Observer and Sentry Wards.",
        "With Aghanim's Shard, Geminate Attacks targets every enemy unit affected that have Beetles latched within 1200 range of the primary attack target. Geminate Attack fully works for allied Beetles (e.g. when acquired via Morph) that latched on their targets as well. Unlike the instant attacks on the primary target, these instant attacks on secondary targets do not trigger attack modifiers or on-hit effects. They do not have True Strike, but completely ignore disarms as well. These Geminate Attacks on secondary targets are launched simultaneously with the extra attacks on the primary attack target.",
        "Geminate Attack fully works for allied Beetles (e.g. when acquired via Morph) that latched on their targets as well.",
        "Unlike the instant attacks on the primary target, these instant attacks on secondary targets do not trigger attack modifiers or on-hit effects. They do not have True Strike, but completely ignore disarms as well.",
        "These Geminate Attacks on secondary targets are launched simultaneously with the extra attacks on the primary attack target."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Geminate Attack",
      "cooldown": null,
      "description": "Allows Weaver to dispatch two attacks at once.",
      "hot_key": "E",
      "params": [
        "Effect Delay: 0.25",
        "Number of Extra Attacks: 1 (TagTalent 2)",
        "Attack Damage Bonus: 10\/25\/40\/55 (TagTalent 100\/115\/130\/145)",
        "The Swarm Targets Search Radius: 1200",
        "Causes Geminate attack to launch on other enemies within 1200 range of the target that have Beetles attached to them.",
        "Despite being an active ability, Geminate Attack is disabled by Break.",
        "Geminate Attack is always toggled on for illusions, but they cannot trigger it."
      ],
      "legacy_key": "K",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Weaver_Time_Lapse.mp3\/revision\/latest?cb=20191216030512",
      "effects": [
        "Ability No Target (TagAghanim Target Unit)",
        "Affects Self (TagAghanim Allied Heroes)"
      ],
      "notes": [
        "Weaver is ordered to stop right after getting moved back, this automatically cancels the cast backswing of Time Lapse. However, ⇧ Shift-queue commands are not canceled.",
        "However, ⇧ Shift-queue commands are not canceled.",
        "Time Lapse disjoints projectiles and applies a strong dispel upon cast. Only affects Weaver's position, health, mana, and status debuffs. Buffs are not removed.",
        "Only affects Weaver's position, health, mana, and status debuffs. Buffs are not removed.",
        "Sets Weaver's or the target ally's health back to what it was 5 seconds ago. This ability neither deals damage nor heals. Therefore, it does not interact with any on-damage effects. When cast right after respawning, the caster's health, mana and position are set to what they were before the death. This means that it does not kill the caster when cast immediately after respawning.",
        "This ability neither deals damage nor heals. Therefore, it does not interact with any on-damage effects.",
        "When cast right after respawning, the caster's health, mana and position are set to what they were before the death.",
        "This means that it does not kill the caster when cast immediately after respawning.",
        "With Aghanim's Scepter, Time Lapse turns into a unit-targeted ability, applying all the effects on the target. ↓↓ Double-tapping automatically targets self. Can only target heroes, including clones and illusions, excluding creep-heroes. However, unit-targeting does not order the target to stop, so their channeling abilities are not canceled. The 0.53 cast backswing is only used when cast on allies, since self-casting automatically cancels the backswing. When cast on allies right after respawning, their health, mana and position are not set back to what they were before the death. This means allies cannot be sent back to their death location after respawning, unlike how Weaver can when self-casting.",
        "↓↓ Double-tapping automatically targets self.",
        "Can only target heroes, including clones and illusions, excluding creep-heroes.",
        "However, unit-targeting does not order the target to stop, so their channeling abilities are not canceled.",
        "The 0.53 cast backswing is only used when cast on allies, since self-casting automatically cancels the backswing.",
        "When cast on allies right after respawning, their health, mana and position are not set back to what they were before the death.",
        "This means allies cannot be sent back to their death location after respawning, unlike how Weaver can when self-casting."
      ],
      "mana": "150\/75\/0",
      "item_behaviour": [],
      "name": "Time Lapse",
      "cooldown": "70\/55\/40 (TagTalent 20)",
      "description": "Weaver warps backward to whatever position it was in five seconds earlier--regaining the HP and mana from that time. No effect on cooldown, gold or experience.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.53",
        "Lapsed Time: 5",
        "Cast Range: 500",
        "Reduces cooldown, and allows Weaver to cast Time Lapse on an ally."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Grants Weaver's attacks Mana Break, causing his attacks to burn the target's mana and deal damage based on the burned mana.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, but it is not considered by crit or cleave.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Effectively increases Weaver's attack damage by 16 against units which have enough mana to burn. Effectively increases the attack damage of Weaver's illusions by 8 against units which have enough mana to burn.",
        "Effectively increases the attack damage of Weaver's illusions by 8 against units which have enough mana to burn.",
        "Applies the mana loss first, and then the damage.",
        "Does not work against allied units when attacking them.",
        "Fully stacks with other sources of Mana Break."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Mana Break",
      "cooldown": null,
      "description": "There is no description for this ability.",
      "hot_key": null,
      "params": [
        "Mana Burned per Hit: 20",
        "Illusion Mana Burned per Hit: 10",
        "Burned Mana as Damage: 80%",
        "The amount of mana burned is reduced for illusions."
      ],
      "legacy_key": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 16.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.1,
    "attrAgility": 17.0
  },
  "description": "Skitskurr, the Weaver, is a ranged agility hero, renowned for being one of the hardest heroes in the game to properly lock down and kill, despite his extreme fragility. This is mainly due to his low-cooldown Shukuchi ability, which provides him both max movement speed and invisibility when used, making him highly effective at chasing enemies as well as escaping from battle. Additionally, his ultimate, Time Lapse, is another survival tool, allowing Weaver to regain the position and health points he had precisely 5 seconds prior to activation. His exceptional ability to maneuver around the battle, seeking the most fragile enemy heroes, is bolstered by his last two abilities. The Swarm is a wave of insects projected in front of Weaver that latch onto any visible enemy they come across. Until they are killed off, they will gradually inflict damage over time, reduce enemy armor, and perhaps most importantly, provide vision to Weaver. Finally, Geminate Attack allows Weaver to passively launch an additional attack every few seconds, making his offensive all the more potent. Not a hero capable of standing on the front lines, Weaver is nonetheless a huge threat against a team that has little ability to prevent his extreme maneuverability.",
  "history": "The fabric of creation needs constant care, lest it grow tattered; for when it unravels, whole worlds come undone. It is the work of the Weavers to keep the fabric tight, to repair worn spots in the mesh of reality. They also defend from the things that gnaw and lay their eggs in frayed regions, whose young can quickly devour an entire universe if the Weavers let their attention lapse. Skitskurr was a master Weaver, charged with keeping one small patch of creation tightly woven and unfaded. But the job was not enough to satisfy. It nagged him that the original work of creation all lay in the past; the Loom had done its work and travelled on. He wanted to create rather than merely maintain—to weave worlds of his own devising. He began making small changes to his domain, but the thrill of creation proved addictive, and his strokes became bolder, pulling against the pattern that the Loom had woven. The guardians came, with their scissors, and Weaver's world was pared off, snipped from the cosmic tapestry, which they rewove without him in it. Skitskurr found himself alone, apart from his kind, a state that would have been torment for any other Weaver. But Skitskurr rejoiced, for now he was free. Free to create for himself, to begin anew. The raw materials he needed to weave a new reality were all around him. All he had to do was tear apart this old world at the seams.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 Geminate Attack",
      "talentRight": "2 Shukuchi Charges"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0.5 Swarm Armor Reduction",
      "talentRight": "+90 Geminate Attack Damage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+2 Swarm Attacks to Kill",
      "talentRight": "+20 Mana Break"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+9 Strength",
      "talentRight": "+50 Shukuchi Damage"
    }
  ]
}