{"abilities":[{"spell":"Hurls a deadly shuriken at an enemy unit, dealing damage and mini-stunning the target. The shuriken will bounce between any Tracked units who are within a 1200 radius of each other.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The shuriken travels at a speed of 1000.","The shuriken first applies the damage, then the debuff.","The initial target does not have to be Tracked for the shuriken to bounce.","Can only bounce to each unit once.","Cannot bounce to, but can bounce off of invulnerable or hidden units.","When upgraded by Aghanim's Scepter, the shuriken bounces on each tracked enemies a second time. It first jumps on all tracked units it didn't jump to yet. If no such enemies are found, it jumps to tracked enemies it jumped onto already. Cannot bounce on the same unit twice in a row, so if used against a lone tracked target, it is only hit once.","Choosing the damage upgrading talent immediately upgrades all of Bounty Hunter's currently flying shurikens."],"mana":"150","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"10","name":"Shuriken Toss","description":["Cast Animation: 0.3+0.43","Cast Range: 400","Bounce Search Radius: 1200","Damage: 150\/225\/300\/375 ( 225\/300\/375\/450)","Stun Duration: 0.1 ( 0.75)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Bounty Hunter plans his next hit, dealing bonus damage and stealing some unreliable gold.","effects":["Ability Passive","Affects Enemies"],"notes":["When off cooldown, Bounty Hunter's weapons emit particle effects.","Checks its cooldown on attack begin, not on attack hit. This means Jinada does not apply when it went off cooldown during the attack animation.","The bonus damage is granted as an attack damage bonus whenever the ability goes off cooldown, and is removed when going on cooldown.","Only steals unreliable gold, removing it from the target and adding it to his own unreliable gold. Bounty Hunter gains exactly how much the target loses.","Only steals gold when attacking enemy heroes, including clones, excluding illusions.","When attacking any other unit (including buildings and wards), only the damage is applied, triggering the cooldown.","Does not work against allies, neither the gold steal, nor the damage bonus."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"12\/9\/6\/3","name":"Jinada","description":["Attack Damage Bonus: 80\/110\/140\/170","Gold Stolen: 12\/18\/24\/30 ( 102\/108\/114\/120)"],"hot_key":"W","legacy_key":"J"},{"spell":"Bounty Hunter becomes invisible and gains the ability to move through other units until he attacks or uses an ability. If he breaks the invisibility with an attack, that attack will slow the target's movement speed.","effects":["Ability No Target","Affects Self \/ Enemies"],"notes":["Does not interrupt Bounty Hunter's channeling spells upon cast.","The attack first applies its own damage, and then the Shadow Walk debuff.","During the fade time, Bounty Hunter can cast spells, use items and perform attacks without breaking the invisibility. Those attacks apply the Shadow Walk slow as well.","The invisibility is broken upon reaching the cast point of spells or items, or upon landing an attack. Missed attacks do not break it. Casting Track does not break the invisibility of Shadow Walk.","Shadow Walk allows Bounty Hunter to pass through other units, including wards, but not through buildings.","Bounty Hunter can pick up, drop or attack items without breaking the invisibility."],"mana":"65","elements":["Pierces spell immunity."],"cooldown":"15","name":"Shadow Walk","description":["Cast Animation: 0+0","Fade Time: 1\/0.75\/0.5\/0.25","Movement Speed Slow: 14%\/20%\/26%\/32%","Invisibility Duration: 20\/25\/30\/35","Slow Duration: 4"],"hot_key":"E","legacy_key":"W"},{"spell":"Tracks an enemy hero, granting True Sight of the target, and information on how much gold it is carrying. You move fast when near the tracked unit and deal critical strikes when attacking it. If the target dies, Bounty Hunter and nearby heroes collect a bonus bounty of gold. Casting Track does not take you out of invisibility.","effects":["Ability Target Unit","Affects Enemy Heroes"],"notes":["Despite the visual effect, the Track debuff is applied instantly on the target.","Provides shared vision and True Sight over the target.","Grants the gold to Bounty Hunter and his allies around the target as reliable gold when the target dies, no matter how it dies.","Track can be cast on illusions and Tempest Doubles, but does not grant any gold when they die.","When multiple Meepos are tracked and one of them dies, each Meepo grants the Track gold around them.","Allies only get the bonus gold if they are within 1200 range of the tracked hero while alive. Bounty Hunter himself gets the gold regardless of distance, even while dead.","The move speed is provided by an aura on the target. Its buff lingers for 0.5 seconds. Multiple instances of the aura do not stack.","The visual effects and sound of Track are only visible and audible to Bounty Hunter and his allies. However, the debuff is visible to everyone.","The visual effects on Bounty Hunter given by the move speed buff is visible to everyone as well.","The debuff icon on the target shows how much gold it currently has.","Alt-clicking the debuff also announces their current gold in the chat."],"mana":"65","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"4","name":"Track","description":["Cast Animation: 0.3+0.43","Cast Range: 1000","Allied Gold Radius: 1200","Self Speed Radius: 900","Self Move Speed Bonus: 16%\/18%\/20%","Self Critical Strike Against Target: 140%\/160%\/180%","Self Bonus Gold: 150\/250\/350 ( 450\/550\/650)","Allies Bonus Gold: 40\/80\/120 ( 340\/380\/420)","Aura Linger Duration: 0.5","Duration: 30"],"hot_key":"R","legacy_key":"R"}],"bio":"When the hunted tell tales of Gondar the Bounty Hunter, none are sure of which are true. In whispered tones they say he was abandoned as a kit, learning his skill in tracking as a matter of simple survival. Others hear he was an orphan of war, taken in by the great Soruq the Hunter to learn the master's skill with a blade as they plumbed the dark forests for big game. Still others believe he was a lowly street urchin raised among a guild of cutpurses and thieves, trained in the arts of stealth and misdirection. Around campfires in the wild countryside his quarry speaks the rumors of Gondar's work, growing ever more fearful: they say it was he who tracked down the tyrant King Goff years after the mad regent went into hiding, delivering his head and scepter as proof. That it was he who infiltrated the rebel camps at Highseat, finally bringing the legendary thief White Cape to be judged for his crimes. And that it was he who ended the career of Soruq the Hunter, condemned as a criminal for killing the Prince's prized hellkite. The tales of Gondar's incredible skill stretch on, with each daring feat more unbelievable than the last, each target more elusive. For the right price, the hunted know, anyone can be found. For the right price, even the mightiest may find fear in the shadows.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","The evasion talent stacks multiplicatively with other sources of evasion."],"trivia":["In DotA, Gondar shared the same hero model and dialogue as Akama, a playable Broken Draenei hero in the campaign of Warcraft III: Frozen Throne, and later an NPC in World of Warcraft.","Gondar's line, \"No job is too big, no fee is too big.\" is a direct quote from the movie Ghostbusters.","Gondar's line, \"Dead or Alive you're coming with me.\" is the same line used multiple times by the main protagonist of the movie \"Robocop\".","Bounty Hunter's line, \"You can run but you can't hide.\" is the same line from the movie \"Liar Liar.\""],"talents":["+300 Track Gold:50% Evasion","+90 Jinada Gold Steal:+75 Shuriken Toss Damage","+350 Health:+50 Attack Speed","+25% XP Gain:+20 Movement Speed"],"desc":"Gondar the Bounty Hunter is a melee agility hero that excels at hunting, chasing down and killing single targets. His skill set allows him to roam and gank very effectively, as his Shadow Walk allows him to sneak up to unsuspecting targets to initiate. Shadow Walk is also an effective escape and mobility spell, as he can run from dangerous situations and roam invisibly around the map to keep the enemy guessing even if they have Observer Wards active. His ability to deal medium amounts of damage with Jinada, interrupt their Town Portal Scrolls with Shuriken Toss, and keep perfect tabs on their location and movements with Track all make him a powerful and ruthless ganker who is all but impossible to escape once he has his sights locked in. Bounty Hunter's ability to roam, scout and get important kills for his team while bolstering their gold gain with Track can secure his team a strong gold advantage, and give his foes no safe place to hide."}