{"abilities":[{"spell":"Запускает во врага смертельный сюрикен, наносящий урон и ненадолго оглушающий цель. Сюрикен будет отскакивать между помеченными способностью Track противниками в радиусе 1200 друг от друга.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Скорость полета сюрикена - 1000.","Сюрикен сначала наносит урон, затем применяет дебафф.","При применении на основную цель без Track сюрикен все равно будет отскакивать на вторичные цели.","Может отскочить от каждого юнита только один раз.","Не может перескочить, но отскакивает от неуязвимых или спрятанных юнитов.","При улучшении с помощью Aghanim's Scepter сюрикен отскакивает от каждого помеченного врага дважды. В первый раз перескакивает между всеми помеченными юнитами, от которых сюрикен еще не отскакивал. Если подходящих врагов не найдено, то сюрикен начинает отскоки по тем врагам, по которым способность уже срабатывала. Не может отскочить от одного и того же юнита два раза подряд, поэтому, если способность используется на юнита без помеченных союзников, то сюрикен поразит его только один раз.","Выбор таланта, увеличивающего урон, мгновенно улучшит все запущенные сюрикены Bounty Hunter."],"mana":"150","elements":["Можно избежать.","Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"9","name":"Shuriken Toss","description":["Анимация применения: 0,3+0,43","Дальность применения: 400","Радиус отскакивания: 1200","Урон: 150\/225\/300\/375 ( 225\/300\/375\/450)","Длительность оглушения: 0,1 ( 0,75)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Герой тщательно продумывает следующую атаку, нанося дополнительный урон и воруя ненадёжное золото жертвы.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Если способность не на перезарядке, то оружие Bounty Hunter испускает эффекты частиц.","Проверяет наличие перезарядки при начале атаке, а не при её попадании. То есть Jinada не применяется, если она была на перезарядке в момент анимации атаки.","Дополнительный урон дается в виде бонуса, пока способность не на перезарядке, и отнимается при начале перезарядки.","Крадет только ненадежное золото, отнимая его у цели и добавляя в качестве ненадежного владельцу способности. Bounty Hunter получает ровно столько, сколько теряет цель.","Крадет золото только при атаке вражеских героев, включая клонов, но исключая иллюзии.","При атаке любых других юнитов (включая строения и варды) наносится только дополнительный урон, а сама способность уходит на перезарядку.","Не действует на союзников: не крадет золото и не наносит дополнительный урон."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"12\/9\/6\/3","name":"Jinada","description":["Дополнительный урон: 80\/110\/140\/170","Крадёт золота: 12\/20\/28\/36 ( 102\/110\/118\/126)"],"hot_key":"W","legacy_key":"J"},{"spell":"Герой становится невидимым и получает возможность проходить сквозь существ до тех пор, пока не применит другую способность или не нанесёт удар. Атака из невидимости замедлит жертву.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов"],"notes":["Не прерывает произнесение заклинаний.","Атака сначала наносит урон, затем применяет дебафф Shadow Walk.","Пока длится время до невидимости, Bounty Hunter может использовать заклинания, предметы и совершать атаку без выхода из невидимости. Также эта атака применит замедление от Shadow Walk.","Невидимость прерывается при наступлении у заклинаний или предметов задержки применения или при попадании атаки. Промахнувшиеся атаки невидимость не прерывают. Использование Track не выводит из невидимости от Shadow Walk.","Shadow Walk позволяет Bounty Hunter проходить сквозь других юнитов, включая варды, но исключая строения.","Bounty Hunter может поднимать, выкидывать или атаковать предметы без выхода из невидимости."],"mana":"65","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"15","name":"Shadow Walk","description":["Анимация применения: 0+0","Время до невидимости: 1\/0,75\/0,5\/0,25","Замедление скорости передвижения: 14%\/20%\/26%\/32%","Длительность: 20\/25\/30\/35","Длительность замедления: 4"],"hot_key":"E","legacy_key":"W"},{"spell":"Помечает вражеского героя, раскрывая его невидимость и показывая его запас золота. Владелец способности получает дополнительную скорость передвижения около цели и наносит ей критический урон. Если она умрёт, союзники неподалёку и сам владелец способности получат дополнительную награду в виде золота. Применение этой способности не снимает невидимость.","effects":["Способность Направленная на юнита","Действует на Вражеских героев"],"notes":["Вопреки визуальным эффектам дебафф Track мгновенно применяется к цели.","Дает общий обзор и эффект True Sight на цель.","Bounty Hunter и его союзники вокруг цели получат надежное золото вне зависимости от того, как цель этого заклинания умерла.","Track можно применить к иллюзиям или Tempest Double, но их смерть не приносит золото.","При смерти одного из Meepo золото дается за каждого отмеченного.","Союзники получат дополнительное золото только если они были живы и находились в 1200 единицах от отмеченного героя. Сам Bounty Hunter получает золото в любом случае независимо от расстояния до цели и собственной смерти.","Дополнительная скорость передвижения предоставлена аурой цели. Её бафф задерживается на 40\/80\/120 секунды. Несколько источников ауры не складываются.","Визуальные эффекты и звук Track видны и слышны только Bounty Hunter и его союзникам. При этом дебафф виден всем.","Иконка дебаффа показывает текущее количество золота у цели.","Alt-клик по дебаффу также пишет текущее количество золота в чат."],"mana":"65","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"4","name":"Track","description":["Анимация применения: 0,3+0,43","Дальность применения: 1200","Радиус получения золота союзниками: 1200","Радиус доп. скорости: 900","Доп. скорость передвижения: 16%\/18%\/20%","Критический удар заклинателя по цели: 140%\/170%\/200%","Доп. золото себе: 150\/250\/350 ( 450\/550\/650)","Дополнительное золото союзникам: 40\/80\/120 ( 340\/380\/420)","Длительность задержки ауры: 0,5","Длительность: 30"],"hot_key":"R","legacy_key":"R"}],"bio":"Жертвы рассказывают многое об охотнике за головами по имени Гондар — и никто не знает, что из этого правда. Кто-то шепчет о том, что его бросили ещё котёнком, и ему пришлось научиться охоте, лишь чтобы выжить. Другие слышали, что война лишила беднягу семьи, и того взял под крыло великий охотник Сорук, который научил сироту обращаться с клинками и вместе с ним прочёсывал тёмные рощи, выходя на большую охоту. А некоторые считают, что Гондар был обычным уличным оборванцем, взращённым в гильдии карманников и воров, где он и научился скрываться и запутывать следы. Его жертвы собираются вокруг костров в диких землях и делятся слухами, всё больше страшась головореза: например, поговаривают, что это он выследил короля Гоффа — безумного тирана, годами скрывавшегося от правосудия, — и в доказательство принёс его голову и скипетр. И что он проник в лагерь повстанцев на Хайсите, схватил там легендарного вора по прозвищу Белый плащ и доставил его до суда. А ещё — что именно он положил конец охотнику Соруку, которого объявили вне закона за убийство лучшего бугая принца. Так и расходятся истории о невероятных способностях Гондара, в которых одна авантюра невероятнее другой, а неуловимых целей будто бы не существует. Жертвы знают: за хорошую цену выследить можно кого угодно. За хорошую цену даже за самыми могущественными явится смерть из тени.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на уклонение мультипликативно сочетается с другими источниками уклонения."],"trivia":["В DotA, модель и реплики героя были идентичны Акаме, играбельной расы из игры Warcraft III: The Frozen Throne, и позже как персонаж из игры World of Warcraft.","Реплика при начале битвы \"No job is too big, no fee is too big.\" является отсылкой к цитате Билла Мюррея из фильма \"Охотники за привидениями\".","Реплика \"Dead or Alive you're coming with me.\" это та же самая фраза которую несколько раз использовал главный герой фильма \"Robocop\".","Слово Jinada является китайским переводом японского термина Ninjutsu, в котором говорится тактики партизанской войны."],"talents":["+300 золота от Track:+50% к уклонению","+90 к краже золота от Jinada:+75 к урону от Shuriken Toss","+350 к здоровью:+50 к скорости атаки","+25% к получаемому опыту:+20 к скорости передвижения"],"desc":"Bounty Hunter — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Shuriken Toss, запускает смертельный сюрикен во вражеского юнита, нанося урон и оглушая цель. Сюрикен будет отскакивать между помеченными способностью Track юнитами, которые находятся в радиусе друг от друга. Вторая способность, Jinada, даёт Bounty Hunter возможность наносить удары с увеличенным уроном, а также красть золото у вражеских героев. Третья способность, Shadow Walk, позволяет герою уходить в невидимость, при этом получая возможность проходить сквозь крипов и героев до тех пор, пока он не нанесет удар или не использует способность. Если он выходит из невидимости атакуя, то замедляет скорость передвижения ударенного противника. Ультимативная способность, Track, отслеживает вражеского героя, раскрывая его невидимость и показывая количество золота у него, а также увеличивает скорость передвижения Bounty Hunter и его урон по цели. Если цель умирает, Bounty Hunter и ближайшие дружественные герои получают награду в виде золота."}