{"abilities":[{"spell":"Creates multiple images of Naga Siren under her control.","effects":["Ability No Target","Affects Self"],"notes":["Mirror Image disjoints projectiles upon cast.","Naga Siren is invulnerable, hidden and spell immune during the split time.","Applies a basic dispel on Naga Siren upon cast.","Resets all current attack and spell targeting orders from other units on Naga Siren.","After the split time, Naga Siren reappears with her illusions. The reappear locations are based on Naga Siren's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point. This means when spawning 3 illusions, the formation is T-shaped and when spawning 4 illusions, it is shaped like a plus. The distance in between each is 72 range. Though the formation is always the same, Naga Siren and her illusions take a random position in the formation and have all the same facing angle.","Orders the caster to stop after the split time, canceling all queued orders, and orders given during the split time.","Recasting Mirror Image replaces the illusions from the previous cast, no matter under whose control they are."],"mana":"70\/85\/100\/115","elements":[],"cooldown":"45\/40\/35\/30","name":"Mirror Image","description":["Cast Animation: 0.65+0","Split Time: 0.3","Number of Illusions: 3 ( 4)","Illusion Damage Dealt: 25%\/30%\/35%\/40% ( 35%\/40%\/45%\/50%)","Illusion Damage Taken: 350%","Illusion Duration: 26"],"hot_key":"Q","legacy_key":"R"},{"spell":"Interrupts the target and traps them in place, preventing movement or blinking.","effects":["Ability Target Unit","Affects Enemies"],"notes":["The net travels at a speed of 1500.","Roots the target, preventing it from moving and casting certain mobility spells. Provides True Sight over the target.","All illusions owned by Naga Siren within 900 range of the target also cast a fake Ensnare. They play the whole cast animation and release their fake net at the same time the real net is released. When illusions currently are not having any order and are standing still, they turn to face the target and cast the fake net. When illusions are moving or attacking, they continue to do so and do not turn to face the target. They still play the cast animation, overriding their move or attack animations. When canceling the cast, the illusions still play the full cast animation, but do not release the fake net. The fake nets do not interact with anything and do not root."],"mana":"70\/80\/90\/100","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"14 ( 7)","name":"Ensnare","description":["Cast Animation: 0.6+0.5","Cast Range: 650","Duration: 2\/3\/4\/5"],"hot_key":"W","legacy_key":"E"},{"spell":"The Naga Siren and her images have a chance on attack to hit all nearby units with a damaging wave of water that lowers armor for 4 seconds.","effects":["Ability Passive","Affects Enemies","Damage Magical"],"notes":["When proccing, Rip Tide first applies the debuff, then the Rip Tide damage, and then the attack damage.","When an enemy is hit by multiple Rip Tides, the armor reduction does not stack, but gets refreshed instead.","Rip Tide uses pseudo-random distribution."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Rip Tide","description":["Proc Chance: 17%","Radius: 300","Damage: 30\/40\/50\/60","Armor Reduction: 2\/4\/6\/8 ( 8\/10\/12\/14)","Duration: 4"],"hot_key":"E","legacy_key":"D"},{"spell":"All enemies in range of the Naga Siren are put into a magical stasis where they cannot act or be attacked. Using Song of the Siren again will end the duration early.","effects":["Ability No Target \/ Aura","Affects Enemies ( Allies)"],"notes":["Applies a sleep on affected units, preventing them from acting, until woken up.","Affected units are invulnerable while sleeping.","The area of the song follows Naga Siren, so if she moves far enough away from affected units, they wake up.","Song of the Siren cannot be interrupted. Only Naga Siren herself or her death can stop it. However, silencing Naga Siren prevents her from manually stopping the song.","The sleep is provided by an aura. Its debuff lingers for 0.4 seconds.","Does not affect Roshan, wards, and invulnerable or hidden units. Does affect buildings.","The health regeneration from the Aghanim's Scepter upgrade is provided by an aura as well, which also lingers for 0.4 seconds. The heal affects every ally. However, despite placing the buff on allied buildings, they do not get healed. Can regenerate up to 74% of a unit's max health over its full duration. Can fully regenerate a unit's health within 10 seconds."],"mana":"150\/175\/200","elements":["Partially pierces spell immunity."],"cooldown":"160\/120\/80","name":"Song of the Siren","description":["Cast Animation: 1+0.3","Radius: 1000\/1200\/1400","Maximum Health as Health Regen Bonus: 0 ( 10%)","Aura Linger Duration: 0.4","Duration: 7"],"hot_key":"R","legacy_key":"G"},{"spell":"Release enemy units from your song so they can be targeted again.","effects":["Ability No Target"],"notes":["Replaces Song of the Siren until the sub-spell is used or the song ends.","Song of the Siren End interrupts Naga Siren's channeling spells on cast.","Goes into a 1-second cooldown right after Song of the Siren is cast.","When used, enemies wake up ( and allies stop regenerating) after the aura's linger duration."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"1","name":"Song of the Siren End","description":["Cast Animation: 0+0.97"],"hot_key":"R","legacy_key":"G"}],"bio":"Among the high-sworn of the Slithereen Guard there is a solemn vow oft repeated before battle: No Slithereen may fail. In truth, these words are equal parts oath and enforceable covenant, for those who fall short of their duty are banished from the order. To fail is to be other than Slithereen. Once most highly esteemed of her race, Slithice for many years commanded a battalion of her fellows, using her formidable voice as her greatest weapon. Powerful, sinuous, serpentine, she led her deadly Guard in defense of the Deep Ones, and the great wealth of the sunken cities. But in the final battle of Crey, her forces were driven back by a marauding army of levianths intent on finding tribute for their god Maelrawn. After the long and bloody onslaught, as the bodies were cleared from the sunken halls, a single jeweled chalice was found missing from the trove. Of her hundred Guard, only a handful survived, but their bravery and sacrifice were of little consequence. What mattered was that treasure was taken. Honor destroyed. And so Naga Siren was cast out. Banished to search for the stolen chalice. Though she might add a hundred times her weight to the golden trove, she is doomed to live apart until that day she returns that which was taken. For no amount of gold is equal in honor to the honor she lost.","talentsTips":["The strength talent effectively grants Naga Siren 280 health, 1.4 health regen and 1.12% magic resistance.","The agility talent effectively grants Naga Siren 1.92 armor, 12 attack speed, 0.6% movement speed and 12 attack damage.","The evasion talent stacks multiplicatively with other sources of evasion."],"trivia":["The DotA Naga Siren from Warcraft universe sports the same weapons as Slithice, the only difference being that the DotA version had one weapon, and four arms, while the Dota 2 has two weapons and two arms.","Song of the Siren's sound is based on this voice line of Naga Siren. Whether there is an extended version of that line or if the rest of the song was manually put together is unknown."],"talents":["-6 Rip Tide Armor:30% Evasion","+1 Mirror Image Illusion:-7s Ensnare Cooldown","+14 Strength:+12 Agility","+10% Mirror Image Damage:+20 Movement Speed"],"desc":"Naga Siren 22 + 2.8 21 + 3.7 21 + 2 Level Base 1 15 25 Health 200 640 1420 1980 Health regen 1.5 3.7 7.62 10.42 Magic res. 25% 26.32% 28.67% 30.35% Mana 75 327 663 903 Mana regen 0 1.05 2.45 3.45 Spell dmg 0% 1.47% 3.43% 4.83% Armor 3 6.36 14.65 20.57 Att\/sec 0.59 0.71 1.02 1.23 Move sp amp. 0% 1.05% 3.64% 5.49% Damage 23‒25 44‒46 95‒97 132‒134 Movement speed 320 Attack speed 100 Turn rate 0.5 Vision range 1800\/800 Attack range 150 Projectile speed Instant Attack animation 0.5+0.5 Base attack time 1.7 Collision size 8 Legs 0  Gib type Default"}