{"abilities":[{"spell":"Создает три иллюзии Naga Siren под ее контролем.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Mirror Image позволяет при использовании избегать снаряды.","Пока Naga Siren создает копии, она неуязвима, скрыта и обладает иммунитетом к заклинаниям.","При использовании к герою применяется базовое развеивание.","Сбрасывает все текущие атаки и направленные способности от остальных юнитов по Naga Siren.","После задержки Naga Siren появляется со своими иллюзиями. Место появления основано на позиции Naga Siren на момент использования способности, при этом один юнит всегда будет находится на месте использования, а остальные - находится вокруг него. То есть при появлении 3 иллюзий их расположение напоминает букву \"Т\", а при появлении 4 - знак плюса. Расстояние между каждым юнитом - 72 единицы. Поскольку расположение всегда одинаково, то Naga Siren и её иллюзии получают случайное расположение и обладают одинаковым углом разворота.","Повторное использование Mirror Image заменяет иллюзии от предыдущего использования и не важно, под чьим контролем они находятся."],"mana":"70\/85\/100\/115","elements":[],"cooldown":"45\/40\/35\/30","name":"Mirror Image","description":["Анимация применения: 0,65+0","Задержка: 0,3","Число иллюзий: 3 ( 4)","Иллюзии наносят урона: 25%\/30%\/35%\/40% ( 35%\/40%\/45%\/50%)","Иллюзии получают урона: 400%","Длительность иллюзий: 26"],"hot_key":"Q","legacy_key":"R"},{"spell":"Прерывает действия цели, а также опутывает ее сетью, не давая двигаться и телепортироваться.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Сеть летит со скоростью в 1500 единиц.","Применяет оцепенение к цели, предотвращая её передвижение и использование способностей для перемещения. Дает эффект True Sight на цель.","Все иллюзии, принадлежащие Naga Siren, также используют фальшивую Ensnare на цель, находящуюся в 900 единицах от них. Они проигрывают ту же анимацию использования и выпускают свои сети одновременно с настоящей. Когда у иллюзий нет никаких приказов и они просто стоят, то иллюзии развернутся лицом к цели и выпустят фальшивые сети. Когда иллюзии передвигаются или атакуют, то они продолжают свои действия без разворота к цели. У них проиграется анимация использования, перекрывающая их анимации движения или атаки. При отмене использования иллюзии все равно проигрывают полную анимацию, но не выпускают сети. Фальшивые сети ни с чем не взаимодействуют и не применяют оцепенение."],"mana":"70\/80\/90\/100","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14 ( 7)","name":"Ensnare","description":["Анимация применения: 0,6+0,5","Дальность применения: 650","Длительность: 2\/3\/4\/5"],"hot_key":"W","legacy_key":"E"},{"spell":"Герой и все его иллюзии имеют шанс обдать врагов рядом с собой мощной волной воды, нанеся им урон и снижая их броню на 4 сек.","effects":["Способность Пассивная","Действует на Врагов","Урон Магический"],"notes":["При срабатывании Rip Tide сначала применяет дебафф, затем наносит урон, а затем наносится урон от атаки.","Если юнит попадает в область действия нескольких Rip Tide, то снижение брони от них не складывается, но обновляется длительность.","Rip Tide использует псевдослучайное распределение."],"mana":"0","elements":["Может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Rip Tide","description":["Шанс срабатывания: 17%","Радиус: 300","Урон: 30\/40\/50\/60","Снижение брони: 2\/4\/6\/8 ( 8\/10\/12\/14)","Длительность: 4"],"hot_key":"E","legacy_key":"D"},{"spell":"Все враги в определённой области вокруг героя впадают в магический сон, в котором они не могут ничего делать, но их нельзя атаковать. Повторное применение способности завершит заклинание преждевременно.","effects":["Способность Ненаправленная \/ Аура","Действует на Врагов ( Союзников)"],"notes":["Применяет к затронутым юнитам сон, предотвращая их действия до пробуждения.","Враги под действием этой способности неуязвимы и не могут получить урон из какого бы то ни было источника.","Область действия заклинания передвигается за Naga Siren, так что если она уйдет достаточно далеко, то юниты проснутся.","Song of the Siren нельзя прервать. Только сама Naga Siren или её смерть могут завершить заклинание. При этом действующее на Naga Siren безмолвие не позволит ей отменить вручную песню.","Сон распространяется в виде ауры. Её дебафф задерживается на 0.4 секунды.","Не действует на Рошана, варды, неуязвимых или спрятанных юнитов. Действует на строения.","Лечение, даваемое улучшением от Aghanim's Scepter, также распространяется в виде ауры, которая задерживается на 0,5 секунды. Лечение представлено в виде регенерации здоровья, излечивая 1% от максимального запаса здоровья с интервалом в 0,1 секунды. Может излечить до 74% от максимального запаса здоровья юнита, если он остается в радиусе действия на всю длительность (складывается из длительности и задержки баффа). Лечение применяется ко всем союзным юнитам. При этом, вопреки размещению баффа на союзные строения, они не исцеляются."],"mana":"150\/175\/200","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"160\/120\/80","name":"Song of the Siren","description":["Анимация применения: 1+0,3","Радиус: 1000\/1200\/1400","Регенерация здоровья в секунду: 0 ( 10%)","Длительность задержки ауры: 0.4","Длительность: 7"],"hot_key":"R","legacy_key":"G"},{"spell":"Пробудить врагов ото сна, что снова сделает их уязвимыми.","effects":["Способность Ненаправленная"],"notes":["Заменяет Song of the Siren до использования вспомогательного заклинания или завершения песни.","При использовании Song of the Siren End прерывает произносимые способности Naga Siren.","Уходит на 1-секундную перезарядку сразу после использования Song of the Siren.","Не пробуждает затронутых врагов мгновенно. Вместо этого способность убирает ауру, которая заставила врагов заснуть, поэтому дебафф задерживается на 0,5 секунды."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"1","name":"Song of the Siren End","description":["Анимация применения: 0+0,97"],"hot_key":"R","legacy_key":"G"}],"bio":"Присяга самых именитых змееногих стражей, торжественно произносящаяся перед битвой, гласит: «Змееногий не ошибется». По правде говоря, это можно назвать и клятвой, и заветом, ведь не исполнившие долг исключаются из ордена навеки. Ошибка — удел кого угодно, но не змееногих. Незабываемый голос опытной военачальницы Слизис, когда-то глубоко уважаемой своей расой, служит ей оружием. Сильная, гибкая, змееподобная, она вела смертоносных стражей на защиту обитателей глубин и великих богатств затонувших городов. Но в последней битве при Крее её войска отбросила армия левиантов-мародёров, искавших подаяние для своего бога Мэльрона. После долгой и кровавой битвы, когда тела убирали из затонувших коридоров, обнаружилось, что из сокровищницы пропала драгоценная чаша. Из сотни стражников выжило лишь несколько, но их жертвенность и храбрость мало что значили. Было важно лишь украденное сокровище. Обесчещенную Слизис изгнали с позором и направили на поиски украденной чаши. Даже если бывшая стражница сможет положить в сокровищницу в сотни раз больше, она обречена жить вдали от своего народа до того дня, когда вернёт похищенное. Ведь никакое золото не сравнится с потерянной честью.","talentsTips":["Талант на силу в общем даёт Naga Siren: 280 здоровья, 1,4 регенерации здоровья и 1,12% сопротивления магии.","Талант на ловкость в общем даёт Naga Siren: 1,92 брони, 12 скорости атаки, 0,6% скорости передвижения и 12 урона от атаки.","Талант на уклонение мультипликативно сочетается с другими источниками уклонения."],"trivia":["В DotA Naga Siren из вселенной Warcraft использует такое же оружие, как и Slithice, но в DotA у неё один клинок и четыре руки, когда в DotA 2 у неё два меча и две руки.","В биографии героя есть отсылка к подводному богу Мэльруну, которого когда-то вызвал Tidehunter. Он также был причастен к разрушению целого флота Kunkka. Именно поэтому Kunkka и ненавидит Tidehunter."],"talents":["+6 к снижению брони от Rip Tide:+30% к уклонению","+1 иллюзия от Mirror Image:-7 сек. перезарядки Ensnare","+14 к силе:+12 к ловкости","+10% к урону Mirror Image:+20 к скорости передвижения"],"tips":["Способность Song of the Siren отлично подходит для инициирования битвы. Пока враги будут находиться в состоянии сна, союзники могут подойти к ним вплотную, что позволит им лучше с ними справится. Данная тактика хорошо подходит в паре с Enigma. Пока враги спят, Enigma может подойти к ним вплотную и после сна - применить Black Hole Данную способность также можно использовать для отступления. В этом случае, инициатором в команде должен быть другой герой, и в случае поражения битвы, можно использовать данную способность чтобы спастись.","Rip Tide наносит урон всем врагам и волна создается как в самом герое так и в каждой иллюзии. В данном случае, можно отправить пару иллюзии в лес, а самому герою стоять дальше на линии - таким образом, этой способностью можно зарабатывать золото эффективней, однако нужно помнить о здоровье и длительности жизни иллюзии.","Время создания иллюзии от Mirror Image очень малое, однако, данной трансформацией можно уклониться от большинства снарядов противника.","Есть одна хорошая связка двух героев: Naga Siren и Undying. Naga Siren применяет Song of the Siren и пока враги спят, Undying применяет Tombstone - таким образом, возле них начинает создаваться зомби, и пока они спят, количество зомби может быть очень большим, что будет очень полезным в командном бое."],"desc":"Naga Siren — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Mirror Image, создает три иллюзии Naga Siren, которыми можно управлять. Вторая способность, Ensnare, опутывает цель сетью, прерывает действия цели, не давая двигаться и телепортироваться. Пассивная способность, Rip Tide, даёт шанс Naga Siren и всем её иллюзиям обдать окружающих их врагов мощной волной, которая снижает их броню и наносит урон. Ультимативная способность, Song of the Siren, позволяет усыпить магическим сном всех врагов рядом с Naga Siren, в котором они не могут ничего делать или быть атакованными. Song of the Siren End преждевременно завершит заклинание. Улучшение с Aghanim's Scepter позволяет Song of the Siren восстанавливать 10% здоровья союзников в секунду."}