{"abilities":[{"effects":["Split Time: 0.1","Number of Illusions: 2","Illusion Damage Dealt (Melee): 33%","Illusion Damage Dealt (Ranged): 28%","Illusion Damage Taken (Melee): 350%","Illusion Damage Taken (Ranged): 400%","Illusion Duration: 20"],"notes":["Has 30 seconds cooldown for melee heroes and 45 seconds cooldown for ranged heroes.","The user is invulnerable, hidden and spell immune during the split time.","Disjoints projectiles upon cast.","Applies a basic dispel on the owner upon cast.","Resets all current attack and spell targeting orders from other units on the owner.","After the split time, the caster reappears with their illusions. The reappear locations are based on the caster's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point. The distance in between each is 108 range if the hero has a collision size of 24, and 72 if the collision size is 8. Though the formation is always the same, the caster and their illusions take a random position in the formation and have all the same facing angle.","Orders the user to stop after the split time, canceling all queued orders, and orders given during the split time.","Provides 1000 radius ground vision for a second upon cast.","Recasting this replaces the illusions from the previous cast which are currently under the owner's control."],"elements":["Ability No Target","Affects Self"],"description":"Creates 2 images of your hero that last 20 seconds. Melee images deal 33% damage and take 350% damage, while Ranged images deal 28% and take 400% damage. Cooldown increased by 15 seconds on ranged heroes."}],"cost":"4700","description":"An axe made of reflective materials that causes confusion amongst enemy ranks.","further":["Yasha","Ultimate_Orb","Recipe"],"tips":["The Manta Style is not effective on ranged heroes excepted with heroes with attack modifiers that works on illusions like Luna Moon Glaives bounce, Drow Ranger's high agility and Morphling which mostly buy stats items that benefits illusions.","Doesn't work with Lone Druid's Spirit Bear.","The illusions can be used to scout to secure your farming, prepare a gank, or before attacking Roshan. They are useful to deward and destroy Techies' mines but they don't get True Sight from Gem.","The active of the Manta Style applies a basic dispel, so it can replace a Linken's Sphere against a Bloodthorn or Rod of Atos.","The illusions are good against a hero carrying a Skull Basher, they will have 2\/3 chances to bash your illusion."],"attrs":["Active Mirror Image","Bonus +10 Strength +26 Agility +10 Intelligence +12 Attack speed +20 Movement speed","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 200 health, 1 health regen, 0.8% magic resistance, 4.16 armor, 38 attack speed, 1.3% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 10 attack damage.","For agility heroes, it grants 200 health, 1 health regen, 0.8% magic resistance, 4.16 armor, 38 attack speed, 1.3% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 26 attack damage.","For intelligence heroes, it grants 200 health, 1 health regen, 0.8% magic resistance, 4.16 armor, 38 attack speed, 1.3% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 10 attack damage.","Movement speed bonuses from multiple Yasha-based items ( Yasha, Sange and Yasha, Yasha and Kaya, Manta Style, Trident) do not stack."]}