{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Доп. дальность атаки: 350",
        "Урон: 225"
      ],
      "notes": [
        "Дополнительная дальность атаки даётся только героям дальнего боя. Атаки ближнего боя лишь наносят дополнительный урон.",
        "Бонусный урон считается бонусным условным уроном от атаки и является магическим уроном. Хоть значения бонусного урона от атаки не отображаются в интерфейсе, он все равно учитывается и напрямую добавляется к урону от атаки существа. Не учитывается вампиризмом, критическим ударом или прорубанием. Может быть уменьшен только прямыми снижениями (например, барьером магического урона). Так как он считается бонусным уроном от атаки, на него не действуют процентные бонусы или снижения урона от атаки.",
        "Хоть значения бонусного урона от атаки не отображаются в интерфейсе, он все равно учитывается и напрямую добавляется к урону от атаки существа.",
        "Не учитывается вампиризмом, критическим ударом или прорубанием.",
        "Может быть уменьшен только прямыми снижениями (например, барьером магического урона).",
        "Так как он считается бонусным уроном от атаки, на него не действуют процентные бонусы или снижения урона от атаки.",
        "Срабатывает на любые цели, но урон и True Strike не применяются, если цель — постройка.",
        "Certain Strike не может промахнуться.",
        "Не работает для клонов."
      ],
      "mana": null,
      "abilityName": "Certain Strike",
      "cooldown": null,
      "description": "Следующая атака нанесёт 225 дополнительного магического урона, а если владелец сражается в дальнем бою, то её дальность увеличится на 350. Этой атакой нельзя промахнуться.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Enchanted Quiver",
  "description": "Изящный дар, благословлённый богиней охоты.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}