{
  "abilities": [
    {
      "notes": [
        "The pull duration always takes 0.3\/0.4\/0.5\/0.6 seconds, no matter how far or close the units are from the center, so the pull speed varies. Affected units are fully disabled during the pull. Can pull units over impassable terrain",
        "Fully affects invisible and invulnerable units (except for units affected by cyclone from items), but not hidden units. Does not affect ancient creeps",
        "The damage is applied upon losing the debuff, dispeling the debuff causes the damage to be applied earlier",
        "Destroys trees within 150 radius at the targeted point upon cast"
      ],
      "item_behaviour": [],
      "description": "Dark Seer creates a vacuum over the target area that sucks in enemy units, disrupting them and dealing damage.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.4+0.4",
        "Cast Range:  450\/500\/550\/600",
        "Effect Radius: 400\/450\/500\/550 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 500\/550\/600\/650)",
        "Damage: 100\/150\/200\/250",
        "Pull Duration: 0.3\/0.4\/0.5\/0.6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Dark_Seer_Vacuum.mp3\/revision\/latest?cb=20191216012246",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "60\/50\/40\/30",
      "aghanim": null,
      "name": "Vacuum",
      "cooldown": "60\/90\/120\/150",
      "legacy_key": "C",
      "story": "Ish'Kafel modifies the center of gravity to a place of his choosing."
    },
    {
      "notes": [
        "Ion Shell can be cast on both enemy and ally units, but damaging only enemy units. The affected unit with the shell itself is not damaged. The damage affects invisible enemies within the radius, However, the visual effects do not appear. Cannot be cast on  Couriers. ↓↓ Double-tapping automatically targets self. Cannot be cast on allies who have ☐ Disabled Help from Dark Seer",
        "Successive casts on the same unit do not stack, but refresh the duration and update the damage to the current level instead. When two opposing heroes cast it on the same target, the modifier updates and start damaging the enemies of the latest caster. However, the modifier status does not update. Whether it is treated as a buff or debuff is determined upon the first cast, and not updated on refresh",
        "Deals 4.5\/7.5\/10.5\/13.5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 12\/15\/18\/21) damage in 0.15-second intervals, starting 0.15 seconds after the cast, resulting in 140\/160\/180\/200 damage instances",
        "Can deal up to 630\/1200\/1890\/2700 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1680\/2400\/3240\/4200) damage to a single unit (before reductions), if the enemy unit stays within range for the full duration",
        "TALENT NOTES All Ion Shell <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talents does not instantly update the current active instances. The max health increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent increases the max health of the targeted ally by 250, keeping the current health percentage the same. Acquiring the Ion Shell charges <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent instantly grants 1 extra charge"
      ],
      "item_behaviour": [],
      "description": "Surrounds the target unit with a bristling shield that damages enemy units in an area around it.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.4+0.7",
        "Cast Range:  800",
        "Damage Radius: 275 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 325)",
        "Damage per Second: 30\/50\/70\/90 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 80\/100\/120\/140)",
        "Duration: 21\/24\/27\/30",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Max Health Bonus:  250"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/81\/Dark_Seer_Ion_Shell.mp3\/revision\/latest?cb=20191216012241",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Allies",
        "Damage: Magical"
      ],
      "mana": "9 (TagTalent 0)",
      "aghanim": null,
      "name": "Ion Shell",
      "cooldown": "9",
      "legacy_key": "E",
      "story": "The Dark Seer slices holes into the 'Land Behind the Wall,' causing prismatic energy to seep forth."
    },
    {
      "notes": [
        "↓↓ Double-tapping automatically targets self",
        "Applies haste and grants phased movement on the target, meaning it cannot be slowed while affected",
        "Fully affects  Couriers",
        "SHARD NOTES The Surged target now creates a 150 radius trail on the its current location in 0.5-second intervals. Autocast on disables this effect. Deals 35 damage in 0.5-second intervals (before reductions), starting 0.5 seconds after the debuff is applied, resulting in 14 damage instances. Can deal up to 490 damage to a single unit when the affected unit stays in range for the full duration. When the Surged target dies, the already existing trail on the ground still stays for the remaining duration. Acquiring  Aghanim's Shard does not update the current active instance",
        "TALENT NOTES The area of effect <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent turns Surge into a 350 radius area-targeted ability, so that it cannot directly target units anymore. ↓↓ Double-tapping now centers the radius around Dark Seer"
      ],
      "item_behaviour": [],
      "description": "Charges a target friendly unit with power, giving it a brief burst of movement speed and removes unit collisions. Allows the unit to reach maximum movement speed and cannot be slowed.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.4+0.57",
        "Cast Range:  600",
        "Haste Speed: 550",
        "Duration: 3\/4\/5\/6",
        "Trail Radius:  150",
        "Trail Move Speed Slow:  50%",
        "Trail Damage per Instance:  35",
        "Trail Duration:  7",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Radius:  350"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Dark_Seer_Surge.mp3\/revision\/latest?cb=20191216012245",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies ",
        "Damage: "
      ],
      "mana": "18\/15\/12\/9",
      "aghanim": null,
      "name": "Surge",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "R",
      "story": "Ish'Kafel once used his speed of mind to navigate the maze between the walls."
    },
    {
      "notes": [
        "Requires  Aghanim's Scepter to be unlocked",
        "Grants Dark Seer's attacks True Strike when not on cooldown. The cooldown triggers upon successfully landing an attack on an enemy",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal",
        "Constantly checks the distance Dark Seer moves and calculates the damage, knockback distance, knockback duration, and stun duration accordingly. For every 10 distance moved, the damage increases by 4.444, knockback distance by 3.333, knockback duration by 0.011, and stun duration by 0.023",
        "Teleporting effects (e.g.  Blink) may only add up to 600 range to the distance counter, no matter how big the actual teleported distance was. Does not consider upward movement distances. The distance counter never resets, so it is possible to perform multiple full power punches in a row, with the help of cooldown resetting sources",
        "These are the damage, knockback distance, and stun duration values at certain distances moved in the last 3 seconds (before reductions): 0 distance moved: 50 damage, 50 knockback distance, 0.1s knockback duration, 0.2s stun duration. 180 distance moved: 130 damage, 110 knockback distance, 0.305s knockback duration, 0.61s stun duration. 360 distance moved: 210 damage, 170 knockback distance, 0.51s knockback duration, 1.02s stun duration. 540 distance moved: 290 damage, 230 knockback distance, 0.715s knockback duration, 1.43s stun duration. 720 distance moved: 370 damage, 290 knockback distance, 0.92s knockback duration, 1.84s stun duration. 900 distance moved: 450 damage, 350 knockback distance, 1.125s knockback duration, 2.25s stun duration.",
        "Normal Punch first applies the stun, then the damage, then the knockback, then the attack damage",
        "If  Wall of Replica is not learned, the illusion deals 80% damage by default",
        "The illusion is spawned 350 range behind the enemy's determined landing position, 0.25 seconds after Normal Punch was delivered. The illusion can be controlled normally and is initially ordered to attack the punched target. Successive punches can create multiple illusions. The illusion has a EXPR 2 * IllusionLVL bounty",
        "The punch particle and sound effects upgrade when the distance counter is at 300, and upgrade again when at 900"
      ],
      "item_behaviour": [],
      "description": "Passive cooldown attack. Causes Dark Seer's next attack on a hero to have True Strike, knock an illusion out of the victim, damaging and stunning them based on how far Dark Seer has moved in the past 3 seconds. Max power is reached after 900 distance moved.",
      "hot_key": "?",
      "params": [
        "Recent Movement Time Window: 3",
        "Distance Required for Max Values: 900",
        "Min Knockback Distance: 50",
        "Max Knockback Distance: 350",
        "Min Damage: 50",
        "Max Damage: 450",
        "Min Stun Duration: 0.2",
        "Max Stun Duration: 2.25",
        "Number of Illusions: 1",
        "Illusion Damage Dealt: 70%\/85%\/100% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 90%\/105%\/120%)",
        "Illusion Damage Taken: 200%",
        "Illusion Spawn Delay: 0.25",
        "Illusion Duration: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Dark_Seer_Normal_Punch_1.mp3\/revision\/latest?cb=20201224202126",
      "effects": [
        "Ability: Passive",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "mana": "9",
      "aghanim": null,
      "name": "Normal Punch",
      "cooldown": "0",
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "The values of the wall are set upon cast and do not update upon leveling the ability up after having placed the wall",
        "A wall can only create one illusion per player. There cannot be more than one illusion per player per wall. This means when there are multiple walls up (with multiple casts), each wall only creates one illusion for each enemy. This also means that when an enemy has multiple heroes ( Meepo Clones and the  Tempest Double), they are still limited to one illusion per wall. Even if the illusion gets  Enchanted, the wall still cannot create another illusion until the previous one dies. When the illusion dies, the wall can create a new illusion of that hero as soon as it comes in range",
        "Only creates illusions of real heroes. Does not create illusions of illusions pathing through the wall. Can create illusions of Divided We Stand and Tempest Double as well, but not of  Wukong's Command clones. Can create the illusions of invulnerable enemies, but not hidden ones. The slow, however, is not placed on invulnerable units",
        "Upon spawning, the illusions are automatically ordered to attack the heroes they are based on",
        "Illusions created by Wall of Replica have a static 5  and 5XP bounty which does not scale with levels",
        "The illusions' duration is based on the remaining duration of the wall from which they originate",
        "The illusion spawns 108 range away from the hero if the hero has a collision size of 24, and 72 if the collision size is 8. It appears either north, east, south, or west from the target",
        "Wall of Replica illusions are visually distinguishable for the enemies",
        "The movement speed slow is applied constantly within the wall's area. When walls overlap with each, their slows do not stack"
      ],
      "item_behaviour": [],
      "description": "Raises a wall of warping light that slows and creates replicas of any enemy hero who crosses it. Enemy replicas serve at the Dark Seer's will. Replicas last until they are destroyed, or until the wall's duration ends.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.2+0.73",
        "Cast Range:  1300",
        "Number of Walls: 1",
        "Wall Length: 1300",
        "Wall Width: 50",
        "Move Speed Slow: 50%\/60%\/70%",
        "Illusion Damage Dealt: 70%\/85%\/100% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 90%\/105%\/120%)",
        "Illusion Damage Taken: 200%",
        "Duration: 30",
        "Slow Duration: 1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/14\/Dark_Seer_Wall_of_Replica.mp3\/revision\/latest?cb=20191216012247",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemy Heroes"
      ],
      "mana": "100 (TagTalent 60)",
      "aghanim": null,
      "name": "Wall of Replica",
      "cooldown": "125\/250\/375",
      "legacy_key": "W",
      "story": "The Dark Seer, while unable to return to his natural realm, can channel part of the prismatic wall with powerful strength of mind, sowing confusion amongst enemy ranks."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.8,
    "attrAgility": 19.0
  },
  "description": "Pulls and manipulates his enemies' positions. A cunning tactician, the Dark Seer excels at manipulating positions of his enemies. Vacuuming and Punching foes into the attacks of his allies, drawing them into the prismatic thorns of his Ion Shell. Armed only with his intellect, he Surges across the land to survey every point of conflict. At strategic locations Ish'Kafel places his Wall of Replica, sowing confusion amongst enemy ranks as an army of duplicates emerge to do battle against their own likenesses.  Initiator Jungler Escape Disabler ★☆☆",
  "trivia": [
    "Dark Seer's response, \"Speed is the heart of battle.\" is an indirect quote of Chinese military strategist Sun Tzu, who said \"Quickness is the essence of war.\"",
    "Dark Seer's response, Link▶️ \"No, I will not calm my beard.\" is a response to Beastmaster's and Clockwerk's rival hero taunts, both voiced by Sam A. Mowry.",
    "Dark Seer's Vacuum's lore is based on the military term, center of gravity, which is a concept developed by Carl Von Clausewitz, a Prussian military theorist, in his work On War.",
    "Normal Punch makes numerous references to the anime One Punch Man. The name of the ability references the protagonist's move \"Consecutive Normal Punches\". The particle effects include a giant red fist striking the enemy, which looks like the fists of the protagonist. The particle effect generally has an anime-style theme to it, with the static lines and whirls, the haloes, and the japanese floating texts, which are the japanese equivalents of \"Pow!\".",
    "The name of the ability references the protagonist's move \"Consecutive Normal Punches\".",
    "The particle effects include a giant red fist striking the enemy, which looks like the fists of the protagonist.",
    "The particle effect generally has an anime-style theme to it, with the static lines and whirls, the haloes, and the japanese floating texts, which are the japanese equivalents of \"Pow!\".",
    "The effect of Normal Punch punching an illusion out of the body may be a reference to the scene in Doctor Strange in which Doctor Strange's \"astral form\" is getting separated from his physical form.[1]"
  ],
  "history": "Fast when he needs to be, and a cunning strategist, Ish'Kafel the Dark Seer requires no edged weapons to vanquish his enemies, relying instead on the strength of his powerful mind. His talent lies in his ability to maneuver the fight to his advantage. Hailing from a place he calls 'The Land behind the wall,' Dark Seer remains an outsider here—a warrior from a realm beyond the veil of this reality. Once a great general among his people, and a valiant defender of the god-king Damathryx, Dark Seer's army was wiped out by a much larger force in the final days of the Great Boundaries War. Facing certain defeat, he made one last desperate act: he led the enemy forces into the maze between the walls. At the last moment, just before capture, he crossed over—then sealed the walls forever in an explosive release of dark energy. When the dust settled, he saw that he had saved his people but found himself blinking at the sun of a different world, with no way to return. Now he is committed to proving his worth as a military strategist, and vows to show that he's the greatest tactician this strange new world has ever seen.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "2 Ion Shell Charges",
        "talent_left": "350 AoE Surge"
      },
      {
        "talent_lvl": "20",
        "talent_right": "-40s Wall of Replica Cooldown",
        "talent_left": "+50 Ion Shell Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+100 Vacuum AoE",
        "talent_left": "+250 Ion Shell Max Health"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+20% Wall of Replica Illusion Damage",
        "talent_left": "+50 Ion Shell Radius"
      }
    ]
  }
}