{"abilities":[{"spell":"Morphling dissolves into liquid and surges forward, damaging enemy units in his path. Morphling is invulnerable during Waveform.","effects":["Ability Target Point","Affects Enemies \/ Self","Damage Magical"],"notes":["Surges with a speed of 1250 and disjoints projectiles upon cast.","Morphling is invulnerable, and his model cannot be selected with the mouse during Waveform. However, Morphling can be selected by clicking the hero icon with the mouse.","Can hit units up to 1200 ( 1550) distance away (travel distance + radius).","Morphling can turn, attack, cast abilities, and use items during Waveform.","Does not travel the full distance, when targeting closer than the max distance.","When the level 20 talent is chosen, Morphling performs instant attacks on every enemy hit by Waveform. These instant attacks can proc every attack modifier normally. The attacks have no True Strike, but completely ignore disarms."],"mana":"150\/155\/160\/165","elements":["Cannot be cast while rooted or leashed.","Partially pierces spell immunity."],"cooldown":"20\/17\/14\/11 ( 0)","name":"Waveform","description":["Cast Animation: 0.25+0","Cast Range: 1000 ( 1350)","Max Travel Distance: 1000 ( 1350)","Damage Radius: 200","Damage: 75\/150\/225\/300","Number of Charges: 0 ( 2)","Charge Replenish Time: 0 ( 17\/15\/13\/11)"],"hot_key":"Q","legacy_key":"W"},{"spell":"Launches a surge of water toward an enemy unit, dealing base damage plus additional damage based on Morphling's agility times a multiplier. If Morphling's agility is 50% higher than strength, the maximum damage is dealt.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Adaptive Strike (Agility) and Adaptive Strike (Strength) are linked abilities; leveling up one automatically levels up the other as well.","Casting this puts the other Adaptive Strike on a fixed 3 second cooldown. Can be reset with cooldown refreshing effects.","The projectile travels at a speed of 1150.","The damage multiplier values are not fixed. They adapt linearly in smooth intervals depending on the difference between Morphling's agility and strength.","The values change with each percent difference between agility and strength, even when it is just a minimal change.","The multiplier also count bonus attributes, not only base attributes.","When the current agility is 50% higher than the strength, the damage multiplier is at its maximum at 1\/1.5\/2\/2.5.","When the current strength is 50% higher than the agility, the damage multiplier is at its minimum at 0.5.","Checks Morphling's attributes upon projectile impact.","When choosing the level 25 talent, the spell launches three additional projectiles towards random visible valid targets within the range. The search range is based on the cast range, plus the buffer, resulting in a search range of 900\/1000\/1100\/1200. Cannot target the primary target with the additional projectiles, so when no other targets are nearby, nothing happens. The secondary targets are chosen randomly within the area. There are no priorities. The projectiles cannot choose both the same target. Since the additional projectiles use the spell's cast range, cast range increasing effects increase their range as well."],"mana":"80","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"10","name":"Adaptive Strike (Agility)","description":["Cast Animation: 0.25+0.67","Cast Range: 600\/700\/800\/900","Secondary Target Range Buffer: 300","Number of Targets: 1 ( 4)","Base Damage: 70\/80\/90\/100","Min Bonus Damage Agility Multiplier: 0.5","Max Bonus Damage Agility Multiplier: 1\/1.5\/2\/2.5","Adaptive Strike (Strength) Downtime: 3"],"hot_key":"W","legacy_key":"E"},{"spell":"Launches a surge of water toward an enemy unit, stunning and knocking back the target based on Morphling's strength. If his strength is 50% higher than his agility, the maximum stun\/knockback is dealt.","effects":["Ability Target Unit","Affects Enemies"],"notes":["Adaptive Strike (Strength) and Adaptive Strike (Agility) are linked abilities; leveling up one automatically levels up the other as well.","Casting this puts the other Adaptive Strike on a fixed 3 second cooldown. Can be reset with cooldown refreshing effects.","The projectile travels at a speed of 1150.","The knockback and stun values are not fixed. They adapt linearly in smooth intervals depending on the difference between Morphling's strength and agility.","The values change with each percent difference between strength and agility, even when it is just a minimal change.","The knockback and stun values also count bonus attributes, not only base attributes.","When the current strength is 50% higher than the agility, the knockback distance and stun duration are at their maximum at 500 and 1.5\/2\/2.5\/3 respectively.","When the current agility is 50% higher than the strength, the knockback distance and stun duration are at their minimum at 100 and 0.5 respectively.","Knocks the target back at a speed of 1000, resulting in a knockback duration of 0.1-0.5.","Checks Morphling's stats upon projectile impact.","When choosing the level 25 talent, the spell launches three additional projectiles towards random visible valid targets within the range. The search range is based on the cast range, plus the buffer, resulting in a search range of 900\/1000\/1100\/1200. Cannot target the primary target with the additional projectiles, so when no other targets are nearby, nothing happens. The secondary targets are chosen randomly within the area. There are no priorities. The projectiles cannot choose both the same target. Since the additional projectiles use the spell's cast range, cast range increasing effects increase their range as well."],"mana":"80","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"10","name":"Adaptive Strike (Strength)","description":["Cast Animation: 0.25+0.67","Cast Range: 600\/700\/800\/900","Secondary Target Range Buffer: 300","Number of Targets: 1 ( 4)","Min Knockback Distance: 100","Max Knockback Distance: 500","Min Stun Duration: 0.5","Max Stun Duration: 1.5\/2\/2.5\/3","Adaptive Strike (Agility) Downtime: 3"],"hot_key":"E","legacy_key":"T"},{"spell":"Morphling shifts its form, pulling points from Strength and pouring them into Agility. The process is reversible. Additional points in Attribute Shift increase the rate of stat change. Passively grants bonus Agility.","effects":["Ability Toggle","Affects Self"],"notes":["Attribute Shift (Agility Gain) and Attribute Shift (Strength Gain) are linked abilities; leveling up one automatically levels up the other as well.","Attribute Shift does not interrupt Morphling's channeling spells upon toggling.","Converts 1\/4\/10\/25 attribute points per second, resulting in the following changes per second: Agility: Morphling gains\/loses 0.16\/0.64\/1.6\/4 armor, 0.05%\/0.2%\/0.5%\/1.25% movement speed, 1\/4\/10\/25 attack speed, and 1\/4\/10\/25 attack damage. Strength: Morphling gains\/loses 20\/80\/200\/500 maximum health, 0.1\/0.4\/1\/2.5 health regen, and 0.08%\/0.32%\/0.8%\/2% magic resistance. The strength bonus\/loss does not keep the current health percentage, but instead adds\/removes 20 health per strength to\/from the current health pool. This health bonus does not bypass Ice Blast or False Promise, and it does not count as heal for the latter. However, for other amplifications and reductions, only the part that exceeds the current health percentage is affected.","Attribute Shift continues to convert attributes even if Morphling is disabled, but cannot be toggled while disabled. Toggling one Attribute Shift ability on automatically toggles the other off. If Attribute Shift cannot convert anymore due to lack of attribute points, it stays toggled, but the process is paused until it can continue.","Can only convert Morphling's base agility and strength. Bonus attributes cannot be converted. The passively added strength and agility are not added to the base attributes, and can therefore not be converted either.","Shifted attributes are permanent and not reverted on death.","The passive agility bonus effectively grants Morphling 0.64\/0.8\/0.96\/1.12 armor, 0.2%\/0.25%\/0.3%\/0.35% movement speed, and 4\/5\/6\/7 attack speed and attack damage.","The passive strength bonus effectively grants Morphling 80\/100\/120\/140 health and 0.4\/0.5\/0.6\/0.7 health regen."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Can be used by illusions.","Pierces spell immunity."],"cooldown":"0","name":"Attribute Shift (Agility Gain)","description":["Cast Animation: 0+0","Shift Rate: 1\/0.25\/0.1\/0.04","Points per Shift: 1","Bonus Agility: 4\/5\/6\/7"],"hot_key":"D","legacy_key":"D"},{"spell":"Morphling shifts its form, pulling points from Agility and pouring them into Strength. The process is reversible. Additional points in Attribute Shift increase the rate of stat change. Passively grants bonus Strength.","effects":["Ability Toggle","Affects Self"],"notes":["Same notes as for Attribute Shift (Agility Gain) apply."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Can be used by illusions.","Pierces spell immunity."],"cooldown":"0","name":"Attribute Shift (Strength Gain)","description":["Cast Animation: 0+0","Shift Rate: 1\/0.25\/0.1\/0.04","Points per Shift: 1","Bonus Strength: 4\/5\/6\/7"],"hot_key":"F","legacy_key":"F"},{"spell":"Morphling changes his form to match the targeted enemy, gaining their basic abilities. Can be toggled for the duration of the ability.","effects":["Ability Target Unit","Affects Self"],"notes":["Does not replace Morphling with a clone of the target. Morph only copies the target's model (including the cosmetic items they wear). This means he is still registered as Morphling, so that innate passive abilities of the target are not gained. For example, when morphing into Faceless Void, Morphling still gets frozen by Chronosphere. This also means that Morphling can still be killed normally in the morphed form, since it is still him and not a separate clone or illusion. Buffs and debuffs Morphling receives during it stay on him upon unmorphing. Most channeling abilities are interrupted upon unmorphing, except for Phase Shift, Upheaval, and item abilities.","Also copies the target's attribute values, primary attribute, movement speed, attack range and range type. This means when targeting a melee strength hero, Morphling becomes a melee strength hero for the duration. Only copies the target's base attributes. Bonus attributes from abilities and items are not copied. Talent bonuses are generally not copied either. All other base stats (e.g. attack values, armor, magic resistance, etc) are not copied either","Morphling keeps his current health and mana percentages upon morphing. He does not copy the target's current health\/mana. Upon unmorphing, Morphling's health and mana are set back to what they were before he morphed.","Removes Morphling's abilities and replaces them with the target's non-ultimate abilities, including their passive abilities. This includes every sub-spell and even Aghanim's Scepter abilities, except for blue Chakram, since that one is bound to the ultimate. This also includes spells Invoker had invoked, or any non-ultimate Rubick had stolen upon morphing into them.","Morphling keeps his own items during Morph, he does not copy the target's items. This means when Morphling has Aghanim's Scepter, it upgrades every upgradable spell Morphling copies with Morph. Since talents are not copied, any talent the target has which upgrades their abilities is not applied to Morphling's copied spells.","Can only be cast on enemy heroes, including illusions and clones. Cannot be cast on creep-heroes. When cast on illusions, it copies the hero who owns the illusion, and not the hero the illusion is based on. This means when targeting e.g. Disruption illusions, Morphling turns into Shadow Demon, and not the hero Disruption was cast on. When the talent is chosen, can also target allied heroes, with the same rules as above. However, it cannot target Morphling itself or illusions under Morphling's control. When an enemy Enchants one of his illusions, it is still treated as an own illusion and can still not be targeted.","The cooldown reduction stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction.","The mana loss reduction stacks additively with all other sources of mana loss reduction."],"mana":"50","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"160\/100\/40","name":"Morph","description":["Cast Animation: 0.25+0.1","Cast Range: 1000","Cast Range Bonus: 0 ( 600)","Cooldown Reduction: 0% ( 35%)","Mana Loss Reduction: 0% ( 50%)","Duration: 20 ( 40)"],"hot_key":"R","legacy_key":"R"},{"spell":"Morphling switches into his replication, instantly taking its position.","effects":["Ability No Target","Affects Self"],"notes":["Takes Morphling's ultimate ability slot during Morph, until it expires. The legacy key equals to the ultimate legacy key of the target Morphling morphed into.","Morph Replicate interrupts Morphling's channeling spells upon cast.","Casting this does not end Morph. Instead, it shifts Morphling back to his original form. When used again, it shifts Morphling back into the target. Goes on cooldown whenever forms get shifted.","Whenever Morphling shifts back into the target, he re-copies all their abilities. This means if the target leveled up their spells, Morphling now copies the new level as well. This also means if the target got new spells (e.g. Invoker invoked new spells), Morphling copies the new spells."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"1","name":"Morph Replicate","description":["Cast Animation: 0+0"],"hot_key":"R","legacy_key":"?"}],"bio":"For dark eons the comet circled. Held in thrall to a distant sun, bound by gravity’s inexorable pull, the massive ball of ice careened through the blackness between worlds, made strange by its dark journey. On the eve of the ancient war of the Vloy, it punched down through the sky and lit a glowing trail across the night, a sign both armies took for an omen. The frozen ball melted in a flash of boiling heat, as below two forces enjoined in battle across the border of a narrow river. Thus freed from its icy stasis, the Morphling was born into conflict, an elemental power at one with the tides of the ocean, capricious and unconstrained. He entered the fight, instinctively taking the form of the first general who dared set foot across the water, and then struck him dead. As the motley warriors clashed, he shifted from form to form throughout the battle, instantly absorbing the ways of these strange creatures--now a footsoldier, now an archer, now the cavalryman--until, by the time the last soldier fell, Morphling had played every part. The battle's end was his beginning.","talentsTips":["The agility talent effectively grants Morphling 1.6 armor, 10 attack speed, 0.5% movement speed and 10 attack damage."],"trivia":["In DotA, Morphling was the only hero without a hero name, being named \"Morphling the Morphling\".","The attack response \"Wave of mutilation!\" is a direct reference to a Pixies song of the same name."],"talents":["+3 Multishot Adaptive Strike:2 Waveform Charges","Waveform Attacks Targets:Morph Targets Allies","+30 Attack Speed:+20s Morph Duration","+350 Waveform Range:+10 Agility"],"desc":"Morphling is a ranged agility hero that has many flexible abilities, item builds and is leveled as a very strong hard carry. He relies strongly on his attributes, and is an effective ganker. Unlike other agility carries that rely on physical attacks, he relies on his powerful abilities to initiate and shift into a state from which he can make a kill. Waveform lets him surge directly forward to a location, damaging enemies on his path, working both as a nuke or an escape. Adaptive Strike is an interesting scaling two-part ability that blasts enemies with magical water, either stunning and knocking back or dealing damage. Its power is based on either agility or strength. Attribute Shift allows him to edit his physical being, switching it from Agility or Strength, transforming him into a strong damage dealer or a tank. His ultimate, Morph, transforms him into a copy of an enemy using their stats and basic abilities."}