{"abilities":[{"spell":"Герой принимает жидкую форму и устремляется вперёд, нанося урон всем врагам на своём пути. Во время применения способности герой неуязвим.","effects":["Способность Направленная на точку","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Morphling пролетает со скоростью в 1250 единиц и способность можно использовать для избегания снарядов.","Morphling неуязвим и его модель нельзя выделить мышкой во время Waveform. Однако Morphling можно выбрать нажатием на иконку героя.","Может поражать юнитов на расстоянии до 1200 ( 1550) единиц (максимальная дистанция + радиус).","Morphling может поворачиваться, атаковать, использовать способности и предметы во время Waveform.","Не проходит полную дистанцию, если выбрать точку ближе максимального расстояния.","При выборе таланта на 20-ом уровне Morphling проводит мгновенную атаку по каждому задетому врагу. На эти мгновенные атаки может сработать любой модификатор атаки. Эти атаки не обладают эффектом True Strike, но они игнорируют обезоруживание."],"mana":"140\/155\/160\/165","elements":["Нельзя применять в оцепенении.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"17\/15\/13\/11 ( 0)","name":"Waveform","description":["Анимация применения: 0,25+0","Дальность применения: 1000 ( 1350)","Макс. дистанция прохождения: 1000 ( 1350)","Радиус урона: 200","Урон: 75\/150\/225\/300","Количество зарядов: 0 ( 2)","Время восстановления заряда: 0 ( 17\/15\/13\/11)"],"hot_key":"Q","legacy_key":"W"},{"spell":"Запускает во вражеское существо поток воды, нанося ему урон. Помимо базового урона наносится дополнительный, зависящий от ловкости героя. Способность нанесёт максимальный урон, если ловкость героя на 50% выше его силы.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Adaptive Strike (Ловкость) и Adaptive Strike (Сила) - связанные способности; при улучшении одной улучшается другая.","Снаряд летит со скоростью в 1150 единиц.","Множитель урона не фиксирован и плавно увеличивается в зависимости от разницы между текущими значениями силы и ловкости Morphling.","Значения меняются с каждым процентом разницы между ловкостью и силой, даже если разница между ними минимальна.","Множитель также учитывает дополнительные атрибуты, а не только базовые.","Когда текущая ловкость на 50% больше силы, множитель урона устанавливается на максимальное значение в 1\/1,5\/2\/2,5.","Когда текущая сила на 50% больше ловкости, множитель урона устанавливается на минимальное значение в 0,5.","Проверяет атрибуты Morphling в момент попадания снаряда.","При выборе таланта на 25 уровне заклинание дополнительно запускает 3 снаряда в случайные видимые подходящие цели в радиусе дальности применения. Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 900\/1000\/1100\/1200 единиц. Не может выбрать повторно первичную цель, поэтому при отсутствии подходящих целей ничего не произойдет. Вторичные цели выбираются случайно в области и для них нет приоритета. Снаряды не могут выбрать одну и ту же цель. Поскольку снаряды используют дальность применения способности, то на них также действуют эффекты, увеличивающие дальность применения."],"mana":"80","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"10","name":"Adaptive Strike (Ловкость)","description":["Анимация применения: 0,25+0,67","Дальность применения: 600\/700\/800\/900","Доп. расстояние для поиска вторичной цели: 300","Число целей: 1 ( 4)","Базовый урон: 100","Мин. множитель ловкости: 0,5","Макс. множитель ловкости: 1\/1,5\/2\/2,5"],"hot_key":"W","legacy_key":"E"},{"spell":"Запускает во вражеское существо поток воды, оглушая и отталкивая его назад в зависимости от силы героя. Длительность оглушения будет максимальной, если сила героя на 50% выше его ловкости.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Adaptive Strike (Ловкость) и Adaptive Strike (Сила) - связанные способности; при улучшении одной улучшается вторая.","Снаряд летит со скоростью в 1150 единиц.","Значения отбрасывания и оглушения не фиксированы и плавно увеличиваются в зависимости от разницы между текущими значениями силы и ловкости Morphling.","Значения меняются с каждым процентом разницы между ловкостью и силой, даже если разница между ними минимальна.","Отбрасывание и оглушение также учитывают дополнительные атрибуты, а не только базовые.","Когда текущая сила на 50% больше ловкости, дистанция отбрасывания и длительность оглушения устанавливаются на их максимальное значение в 500 и 1.5\/2\/2,5\/3 соответственно.","Когда текущая ловкость на 50% больше силы, дистанция отбрасывания и длительность оглушения устанавливаются на их минимальное значение в 100 и 0.5 соответственно.","Отбрасывает цель назад со скоростью в 1000 единиц за 0.1-0.5 секунды.","Проверяет атрибуты Morphling в момент попадания снаряда.","При выборе таланта на 25 уровне заклинание дополнительно запускает 3 снаряда в случайные видимые подходящие цели в радиусе дальности применения. Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 900\/1000\/1100\/1200 единиц. Не может выбрать повторно первичную цель, поэтому при отсутствии подходящих целей ничего не произойдет. Вторичные цели выбираются случайно в области и для них нет приоритета. Снаряды не могут выбрать одну и ту же цель. Поскольку снаряды используют дальность применения способности, то на них также действуют эффекты, увеличивающие дальность применения."],"mana":"80","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"10","name":"Adaptive Strike (Сила)","description":["Анимация применения: 0,25+0,67","Дальность применения: 600\/700\/800\/900","Доп. расстояние для поиска вторичной цели: 300","Число целей: 1 ( 4)","Мин. расстояние отбрасывания: 100","Макс. расстояние отбрасывания: 500","Мин. длительность оглушения: 0.5","Макс. длительность оглушения: 1.5\/2\/2,5\/3"],"hot_key":"E","legacy_key":"D"},{"spell":"Герой меняет свою форму, превращая очки силы в очки ловкости. Этот процесс обратим. С уровнем растёт скорость превращения. Также даёт постоянный бонус к ловкости.","effects":["Способность Переключаемая","Действует на Себя"],"notes":["Attribute Shift (Ловкость) и Attribute Shift (Сила) - связанные способности; при улучшении одной улучшается другая.","Attribute Shift не прерывает произносимые заклинания Morphling при переключении.","Преобразовывает 1\/4\/10\/25 очков атрибута в секунду, в результате чего в секунду: Ловкость: Morphling получает\/теряет 0.16\/0.64\/1.6\/4 единиц брони, 0.05%\/0.2%\/0.5%\/1.25% скорости передвижения и 1\/4\/10\/25 скорости атаки и урона. Сила: Morphling получает\/теряет 20\/80\/200\/500 единиц здоровья и 0.1\/0.4\/1\/2.5 усиления регенерации здоровья. Дополнительное здоровье или его потеря не сохраняют текущее соотношение здоровья, но взамен добавляет\/отнимает 20 здоровья за единицу силы к\/от текущего запаса здоровья. Это дополнительное здоровье не считается за лечение, поэтому на него не действует усиления, но при этом под действием Ice Blast герой не может перекачать очки в силу или усилить лечение с помощью False Promise.","Attribute Shift продолжает перекачивать атрибуты даже если Morphling обезврежен, но при этом способность нельзя переключать в обезвреженном состоянии. Включение одной способности Attribute Shift автоматически выключит другую. Если Attribute Shift не может перекачивать очки атрибутов, поскольку они закончились, то она останется включенной, но процесс будет приостановлен до появления свободных очков.","Может перекачивать только базовые атрибуты Morphling. Дополнительные атрибуты не перекачиваются. Пассивно получаемые сила и ловкость не добавляются к базовым, и потому не могут быть перекачаны.","Перекачанные атрибуты постоянны и не возвращаются при смерти.","Пассивная дополнительная ловкость в среднем дает Morphling 0.64\/0.8\/0.96\/1.12 брони, 0.2%\/0.25%\/0.3%\/0.35% скорости передвижения, 4\/5\/6\/7 скорости атаки и урона от атаки.","Пассивная дополнительная сила в среднем дает Morphling 80\/100\/120\/140 здоровья и 0.4\/0.5\/0.6\/0.7 регенерации здоровья."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Attribute Shift (Ловкость)","description":["Анимация применения: 0+0","Скорость обмена: 1\/0.25\/0.1\/0.04","Очков атрибута за обмен: 1","Дополнительная ловкость: 4\/5\/6\/7"],"hot_key":"D","legacy_key":"F"},{"spell":"Герой меняет свою форму, превращая очки ловкости в очки силы. Этот процесс обратим. С уровнем растёт скорость превращения. Также даёт постоянный бонус к силе.","effects":["Способность Переключаемая","Действует на Себя"],"notes":["Примечания те же, что и для Attribute Shift (Ловкость)."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Attribute Shift (Сила)","description":["Анимация применения: 0+0","Скорость обмена: 1\/0.25\/0.1\/0.04","Скорость обмена: 1","Дополнительная сила: 4\/5\/6\/7"],"hot_key":"F","legacy_key":"T"},{"spell":"Герой изменяет свою форму по образу и подобию выбранного противника, получая его основные способности.","effects":["Способность Направленная на юнита","Действует на Себя"],"notes":["При использовании применяет к Morphling базовое развеивание.","Не заменяет Morphling клоном цели. Morph лишь копирует модель цели (включая надетые на неё косметические предметы). То есть герой продолжает считаться Morphling, поэтому он не получает встроенные пассивные способности цели. К примеру при превращении в Faceless Void Morphling все равно будет застывать в Chronosphere. Также это означает, что Morphling может умереть как обычно, будучи превращенным, поскольку эта форма продолжает считаться им самим, а не отдельным клоном или иллюзией. Большинство баффов и дебаффов, полученных Morphling в превращении, остаются при нем при развоплощении. Большинство произносимых способностей прервутся при развоплощении, за исключением Phase Shift, Upheaval и способностей предметов.","Также способность копирует значения атрибутов цели, базовые характеристики, скорость передвижения, тип и дальность атаки. То есть при выборе героя ближнего боя с атрибутом силы Morphling будет этим героем всю длительность. Копирует только базовые атрибуты цели. Дополнительные атрибуты от способностей и предметов не копируются. Также не копирует бонусы от талантов. Также не копирует остальные базовые характеристики (показатели урона, брони, сопротивления магии и прочие).","Morphling сохраняет при превращении текущее соотношение здоровье и маны в процентах и не копирует текущее здоровье\/ману цели. При развоплощении здоровье и мана Morphling устанавливаются на значения, которые были до превращения.","Убирает способности Morphling и заменяет их на все способности цели (включая пассивные), кроме ультимативной. В способности входят вспомогательные заклинания и даже способности, даваемые Aghanim's Scepter, за исключением голубого Chakram, поскольку данная способность - часть ультимативной. Сюда также входят созданные заклинания Invoker или любые украденные Rubick неультимативные заклинания при превращении в него.","При использовании Morph у Morphling остаются все его предметы, поскольку он не копирует предметы цели. То есть в случае, когда у Morphling есть Aghanim's Scepter, то данный предмет улучшит каждую скопированную улучшаемую способность. Поскольку таланты не копируются, то улучшения, даваемые ими, не действуют на скопированные Morphling способности.","Можно использовать только на вражеских героев, включая иллюзии и клонов. Нельзя использовать на крипов-героев. При использовании на иллюзиии способность копирует того героя, кому иллюзия принадлежит, а не того, с кого она скопирована. То есть когда выбирается, к примеру, иллюзия, созданная Disruption, то Morphling превращается в Shadow Demon, а не в героя, с которого была сделана иллюзия. При выборе таланта способность можно использовать и на союзных героев с теми же условиями. При этом Morph нельзя использовать на самого Morphling или любую иллюзию под его контролем. При приручении с помощью Enchant одной из его иллюзий врагом её все равно нельзя выбрать, поскольку иллюзия продолжает считаться подконтрольной Morphling."],"mana":"50","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"160\/100\/40","name":"Morph","description":["Анимация применения: 0,25+0,1","Дальность применения: 1000","Длительность: 20 ( 40)"],"hot_key":"R","legacy_key":"R"},{"spell":"Morphling моментально оказывается на месте своей копии.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Заменяет слот под ультимативную способность Morphling на все время действия Morph. Классическая клавиша для способности будет установлена той же клавишей, которая назначена для ультимейта цели, выбранной для превращения.","При использовании Morph Replicate прерывает произносимые способности Morphling.","Вопреки тому, что эта способность - вспомогательное заклинание, на неё срабатывают все эффекты, срабатывающие от применения. Сюда же входят способности, уникальные для цели, выбранной для превращения - Static Field и Aftershock.","Использование не завершает действие Morph. При этом способность возвращает Morphling к его оригинальной форме. При повторном использовании Morph Replicate снова превращает Morphling в выбранную ранее цель. Уходит на перезарядку при завершении превращения. При повторном превращении Morphling в цель уровни скопированных способностей обновляются под их уровень у цели."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"1","name":"Morph Replicate","description":["Анимация применения: 0+0"],"hot_key":"R","legacy_key":"?"}],"bio":"Многие века космос бороздила ледяная комета. Громадный шар, прикованный к дальней звезде неумолимыми силами гравитации, мчался сквозь тьму меж мирами, обретая в своём путешествии необычайные свойства. Однажды, в канун войны за Влой, комета рухнула со звёздного неба, оставив в ночи светящийся след, принятый обеими армиями как знак судьбы. Ледяной шар стремительно таял во вспышке кипящей жары, а две стороны схлестнулись в схватке по берегам узкой речонки. Тогда-то, вырвавшись из ледяного сна, был рождён Морфлинг — элементаль, обладающий силой стихии столь же капризной и необузданной, как сам океан. Он инстинктивно принял облик первого же генерала, отваживавшегося ступить в воду, и сразив того намертво, вступил в бой. Пока глупые солдатики бились друг с другом, элементаль перемещался по полю битвы, меняя форму одну за другой. Он мгновенно поглощал образы странных существ — то пехотинца, то лучника, то кавалериста, — и к тому мгновению, когда пал последний солдат, элементаль сыграл каждую роль. Конец этой битвы стал его началом.","talentsTips":["Талант на ловкость в общем даёт Morphling: 1,6"],"trivia":["В DotA, Morphling был единственным персонажем, не имеющим имени героя.","Одна из фраз Morphling, воспроизводящаяся при атаке \"Играть Wave of mutilation!\" является прямой отсылкой к музыкальной группе Pixies и их песне с тем же названием."],"talents":["+3 цели Adaptive Strike:2 заряда Waveform","Атаки во время Waveform:Morph действует на союзников","+30 к скорости атаки:+20 сек. к длительности Morph","+350 к дальности Waveform:+10 к ловкости"],"tips":["Во время использования Waveform герой может использовать другие способности или предметы (например, Town Portal Scroll, чтобы уйти от погони).","Урон от способности Adaptive Strike (Ловкость) зависит от показателей характеристик героя. Если ловкости на 50% больше, чем силы, то будет нанесен максимальный урон.","Длительность оглушения от способности Adaptive Strike (Сила) зависит от показателей характеристик героя. Если силы на 50% больше, чем ловкости, то будет применено максимальное оглушение."],"desc":"Morphling — это герой с дальним типом атаки, основной характеристикой которого является Ловкость. Первая способность, Waveform, растворяет Morphling и устремляется вперед, нанося повреждения всем врагам на своем пути. Во время использования способности герой неуязвим. Вторая и третья способности, Adaptive Strike (Ловкость) и Adaptive Strike (Сила), запускают во врага мощный поток воды, нанося цели урон или оглушая её, что частично зависит от силы и ловкости Morphling соответственно. Четвертая и пятая способности, Attribute Shift (Ловкость) и Attribute Shift (Сила), позволяют Morphling менять свою форму, превращая очки силы в очки ловкости и наоборот. Процесс обратим. Дополнительные уровни увеличат количество обмениваемых очков. Пассивно получает перманентный бонус к ловкости или силе. Ультимативная способность, Morph, превращает Morphling в копию указанного вражеского (при прокачке соответствующего таланта - также и союзного) героя, которая использует обычные способности скопированного героя."}