{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+6 к числу шаров от Mortimer Kisses",
          "talentRight": "3 цели атаки у Lil' Shredder"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20% к замедлению от Mortimer Kisses",
          "talentRight": "Lil' Shredder наносит урон от атак"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+75 к урону от Scatterblast",
          "talentRight": "Firesnap Cookie излечивает 200 здоровья"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1 сек. замедления от Scatterblast",
          "talentRight": "+200 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Snapfire_Scatterblast_1.mp3\/revision\/latest?cb=20191215162240",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Scatterblast летит со скоростью 3000, преодолевая расстояние за 0,73 сек.",
        "Scatterblast сначала оглушает и отталкивает, затем наносит урон, а затем замедляет скорость передвижения.",
        "Повышение уровня или выбор таланта, увеличивающего урон, не влияют на уже запущенную способность.",
        "Поражает существ на расстоянии до 1200 (складывается из дальности прохождения и конечного радиуса).",
        "Область поражения выглядит как конус.",
        "Наносит в упор 120\/225\/330\/435 (TagTalent 232,5\/337,5\/442,5\/547,5) урона существам.",
        "С Aghanim's Shard Scatterblast наносит в упор 245\/350\/455\/560 (TagTalent 357,5\/462,5\/567,5\/672,5) урона. Также при выстреле в упор оглушает на 0,3 сек. и отталкивает врагов на 250 единиц. Оттолкнутые враги разрушают те деревья, с которыми столкнулись.",
        "Также при выстреле в упор оглушает на 0,3 сек. и отталкивает врагов на 250 единиц.",
        "Оттолкнутые враги разрушают те деревья, с которыми столкнулись."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10",
      "description": "Герой стреляет из дробовика по конической области действия, нанося врагам урон и замедляя их. Выстрел в упор наносит на 50% урона больше.",
      "spellName": "Scatterblast",
      "params": [
        "Анимация применения: 0,4+0,83",
        "Дальность применения: 800",
        "Начальный радиус: 225",
        "Дальность прохождения: 800",
        "Конечный радиус: 400",
        "Дальность выстрела в упор: 450",
        "Урон: 80\/150\/220\/290 (TagTalent 155\/225\/295\/365)",
        "Доп. урон в упор: 50%",
        "Замедление скорости передвижения: 100%",
        "Замедление скорости атаки: 100",
        "Длительность замедления: 1",
        "Доп. урон при выстреле в упор: 125",
        "Дальность отталкивания при выстреле в упор: 250",
        "Длительность отталкивания при выстреле в упор: 0,3",
        "Длительность оглушения при выстреле в упор: 2",
        "Способность отталкивает существ, находящихся в упор к герою, на расстояние в 250, нанося им 125 дополнительного урона и оглушая их на 2 секунды.",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Snapfire_Firesnap_Cookie_1.mp3\/revision\/latest?cb=20191215162224",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически выбирает себя. При применении на себя у способности отсутствует остаточная анимация.",
        "При применении на себя у способности отсутствует остаточная анимация.",
        "Снаряд летит со скоростью 1000.",
        "Нельзя применить на существ, произносящих заклинание. Если союзник начал произнесение после запуска печеньки, то при попадании снаряд ничего не сделает. Это распространяется и на применение на себя. Может выбрать, но не перемещает существ под действием Chronosphere и Black Hole; снаряд при попадании ничего не делает.",
        "Если союзник начал произнесение после запуска печеньки, то при попадании снаряд ничего не сделает. Это распространяется и на применение на себя.",
        "Может выбрать, но не перемещает существ под действием Chronosphere и Black Hole; снаряд при попадании ничего не делает.",
        "Цель при попадании снаряда прыгает на расстояние 425 на высоту 257. Пока она в воздухе, остальные существа могут под ней проходить.",
        "Во время прыжка цель обезврежена: не может двигаться, поворачиваться, атаковать и использовать заклинания или предметы. Может перемещать над другими существами или над непроходимой территорией.",
        "Может перемещать над другими существами или над непроходимой территорией.",
        "Firesnap Cookie сначала лечит, затем наносит урон, а затем применяет оглушение. Талант, добавляющий лечение, мгновенно улучшает все запущенные печеньки и излечивает цели при попадании. Урон по области и оглушение применяются после потери баффа прыжка. То есть, если прыжок прервали, то эффекты применятся раньше.",
        "Талант, добавляющий лечение, мгновенно улучшает все запущенные печеньки и излечивает цели при попадании.",
        "Урон по области и оглушение применяются после потери баффа прыжка. То есть, если прыжок прервали, то эффекты применятся раньше.",
        "Разрушает деревья в радиусе 100 после приземления."
      ],
      "mana": "110",
      "hotKey": "W",
      "cooldown": "21\/19\/17\/15",
      "description": "Герой скармливает бодрящую печеньку Мортимеру или союзнику, отчего тот совершает прыжок на небольшое расстояние, оглушая врагов в области приземления и нанося им урон.",
      "spellName": "Firesnap Cookie",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 700",
        "Анимация применения на себя: 0,3",
        "Радиус приземления: 300",
        "Дальность прыжка: 425",
        "Урон от приземления: 70\/140\/210\/280",
        "Длительность прыжка: 0,5",
        "Длительность оглушения: 1,6\/1,8\/2\/2,2",
        "Лечение: 200",
        "Можно применить на союзников с иммунитетом к заклинаниям. Не действует на врагов с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Snapfire_Lil%27_Shredder_1.mp3\/revision\/latest?cb=20191215162230",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Дальность применения Lil' Shredder рассчитывается от дальности атаки заклинателя. Вместе с бонусом от способности дальность применения Lil' Shredder для Snapfire равна 575\/650\/725\/800. Дальность может быть увеличена иными бонусами к дальности атаки и на неё также действует бонусы к дальности применения.",
        "Вместе с бонусом от способности дальность применения Lil' Shredder для Snapfire равна 575\/650\/725\/800.",
        "Дальность может быть увеличена иными бонусами к дальности атаки и на неё также действует бонусы к дальности применения.",
        "При применении прерывает произносимые заклинания Snapfire.",
        "Приравнивает базовое время атаки к 1, а урон — к значению способности. То есть способность игнорирует бонусы и уменьшения урона, если только не выбран талант «Lil' Shredder наносит урон от атак».",
        "То есть способность игнорирует бонусы и уменьшения урона, если только не выбран талант «Lil' Shredder наносит урон от атак».",
        "Заряды расходуются при атаках, даже если они промахнулись.",
        "Число зарядов видно в иконке баффа.",
        "Lil' Shredder накладывает отдельный дебафф на цель. Последующие атаки увеличивают его счетчик. Число в иконке показывает количество накоплений. Оно видно всем. Поскольку используется один дебафф, то каждая атака сбрасывает длительность накоплений.",
        "Число в иконке показывает количество накоплений. Оно видно всем.",
        "Поскольку используется один дебафф, то каждая атака сбрасывает длительность накоплений.",
        "Снижение брони применяется к любой атакуемой цели, включая постройки и союзников.",
        "Наносит до 120\/270\/420\/570 урона за 6 атак (до уменьшений).",
        "Атаки сначала применяют дебафф, затем наносят урон.",
        "Несколько применений не складываются, но обновляют длительность, бонус к дальности атаки и сбрасывают число атак. Увеличение уровня Lil' Shredder или выбор таланта «Lil' Shredder наносит урон от атак» при активированной способности не изменяет урон.",
        "Увеличение уровня Lil' Shredder или выбор таланта «Lil' Shredder наносит урон от атак» при активированной способности не изменяет урон.",
        "Талант на дополнительные цели атаки позволяет Snapfire с активной Lil' Shredder совершать мгновенные атаки по случайным целям в пределах дальности атаки. На эти мгновенные атаки может сработать любой модификатор атаки или эффект, срабатывающий при ударе. У них нет эффекта True Strike и на них действует обезоруживание. Вторичные цели выбираются случайно в области, для них нет приоритетов.",
        "На эти мгновенные атаки может сработать любой модификатор атаки или эффект, срабатывающий при ударе. У них нет эффекта True Strike и на них действует обезоруживание.",
        "Вторичные цели выбираются случайно в области, для них нет приоритетов.",
        "Если Snapfire обезоружена, то выстрелы не совершаются."
      ],
      "mana": "50\/65\/80\/95",
      "hotKey": "E",
      "cooldown": "24\/20\/16\/12",
      "description": "Герой разогревает свою турель и совершает 6 выстрелов-атак с фиксированным уроном. Каждый выстрел уменьшает броню жертвы. Во время действия дальность атаки увеличивается.",
      "spellName": "Lil' Shredder",
      "params": [
        "Анимация применения: 0+0",
        "Доп. дальность атаки: 75\/150\/225\/300",
        "Доп. скорость атаки: 300",
        "Базовое время атаки: 1",
        "Фиксированный урон: 20\/45\/70\/95 (TagTalent 0)",
        "Число атак: 6",
        "Снижение брони за атаку: 1",
        "Длительность дебаффа: 5",
        "Длительность: 6",
        "Доп. цели: 2",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4c\/Snapfire_Gobble_Up_1.mp3\/revision\/latest?cb=20200527011842",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. В режиме Ability Draft Gobble Up можно разблокировать игроку, выбравшему Mortimer Kisses.",
        "В режиме Ability Draft Gobble Up можно разблокировать игроку, выбравшему Mortimer Kisses.",
        "Может выбрать целью любое существо, за исключением вражеских героев и крипов-героев. Нельзя использовать на союзников, которые отключили помощь от Snapfire.",
        "Нельзя использовать на союзников, которые отключили помощь от Snapfire.",
        "При применении позволяет цели избежать снарядов.",
        "Выбранное существо в животике неуязвимо, спрятано, обезмолвлено, заглушено и обезоружено.",
        "Во время Gobble Up существо периодически перемещается к текущему положению Snapfire; перемещение нельзя прервать. То есть ауры существа распространяются вокруг Snapfire до выплевывания.",
        "То есть ауры существа распространяются вокруг Snapfire до выплевывания.",
        "Если существо не запустили, оно автоматически выпускается спустя 3 сек. Если цель не герой или клон, то оно мгновенно умирает после выхода. Выбранные существа не-герои также меняют владельца на заклинателя, поэтому их смерть засчитывается за добивание.",
        "Если цель не герой или клон, то оно мгновенно умирает после выхода.",
        "Выбранные существа не-герои также меняют владельца на заклинателя, поэтому их смерть засчитывается за добивание.",
        "Поглощение существа отключает эту способность и активирует Spit Out. Способность остается неактивной до выхода существа, истечения длительности, использования вспомогательной способности или смерти заклинателя.",
        "Способность остается неактивной до выхода существа, истечения длительности, использования вспомогательной способности или смерти заклинателя."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "40",
      "description": "Проглатывает крипа или союзного героя, чтобы затем плюнуть им во врагов. Цель может сидеть в животике не более 3 секунд.",
      "spellName": "Gobble Up",
      "params": [
        "Анимация применения: 0,3+1,27",
        "Дальность применения: 150",
        "Максимальная длительность: 3",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Snapfire_Mortimer_Kisses_1.mp3\/revision\/latest?cb=20191215162234",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "Способность остается неактивной до использования Gobble Up и вновь отключается после выхода существа из животика любым путем.",
        "Поглощенное существо считается за снаряд и движется к выбранной точке. Во время полета существо оглушено, неуязвимо и спрятано.",
        "Во время полета существо оглушено, неуязвимо и спрятано.",
        "Минимальное время полёта 0,8 секунды, максимальное — 2 секунды. Пока цель находится в воздухе, другие существа могут проходить под ней.",
        "Если существо не герой или клон, то при приземлении оно мгновенно умирает.",
        "При приземлении существо наносит урон и оставляет под собой огненную лужу. Она длится 3 сек. Урон от попадания равен урону от Mortimer Kisses текущего уровня. Лужа применяет дебафф к врагам с интервалом в 0,5 секунды сразу после создания, срабатывая 7 раз. Дебафф длится 1 сек. и наносит 50 урона с интервалом в 0,5 секунды сразу после применения, срабатывая 3 раз. Наносит до 610\/690\/770 урона, учитывая урон от попадания и нахождение врага в луже всю длительность. Несколько дебаффов не складываются. Поскольку Spit Out и Mortimer Kisses используют один и тот же модификатор, то они не складываются, а приоритет идет за первым примененным дебаффом.",
        "Урон от попадания равен урону от Mortimer Kisses текущего уровня.",
        "Лужа применяет дебафф к врагам с интервалом в 0,5 секунды сразу после создания, срабатывая 7 раз.",
        "Дебафф длится 1 сек. и наносит 50 урона с интервалом в 0,5 секунды сразу после применения, срабатывая 3 раз.",
        "Наносит до 610\/690\/770 урона, учитывая урон от попадания и нахождение врага в луже всю длительность.",
        "Несколько дебаффов не складываются.",
        "Поскольку Spit Out и Mortimer Kisses используют один и тот же модификатор, то они не складываются, а приоритет идет за первым примененным дебаффом.",
        "Попадание сначала наносит урон, затем оглушает.",
        "Во время полета снаряд дает летающий обзор в радиусе 500. Обзор задерживается в области падения на 3,5 секунды.",
        "При приземлении разрушает деревья в выбранной области."
      ],
      "mana": "150",
      "hotKey": "F",
      "cooldown": "0",
      "description": "Выплёвывает сидевшее в животике существо, нанося урон и оглушая противников в большой области. Под существом образуется лужа огненной слюны, которая замедляет врагов и наносит им периодический урон.",
      "spellName": "Spit Out",
      "params": [
        "Анимация применения: 0,3+1,04",
        "Дальность применения: 3000",
        "Радиус плевка: 400",
        "Урон в секунду от лужи: 100",
        "Замедление скорости передвижения: 25%",
        "Время действия лужи: 3",
        "Длительность дебаффа: 1",
        "Длительность оглушения: 1,5",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян.",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Snapfire_Mortimer_Kisses_1.mp3\/revision\/latest?cb=20191215162234",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Минимальное время передвижения снаряда — 0,8, максимальное — 2 секунды, его скорость — 1300. То есть на расстоянии 1625 скорость адаптируется к меньшим значениям, а начиная с 2600 единиц — к большим.",
        "То есть на расстоянии 1625 скорость адаптируется к меньшим значениям, а начиная с 2600 единиц — к большим.",
        "Для лучшего понимания скорость поворота во время Mortimer Kisses указывается в градусах в секунду вместо радианов в 0,03 секунды. 75° градусов в секунду равны скорости поворота в 0,039.",
        "75° градусов в секунду равны скорости поворота в 0,039.",
        "Moritmer Kisses отменяется, если Snapfire оглушена, обезмолвлена, проклята, спит, находится под действием урагана, страха или гипноза. Провокация предотвращает выбор области, но не отменяет заклинание. Также Mortimer Kisses можно прервать, отдав любой приказ, кроме передвижения.",
        "Провокация предотвращает выбор области, но не отменяет заклинание.",
        "Также Mortimer Kisses можно прервать, отдав любой приказ, кроме передвижения.",
        "Место падения шаров можно изменить с помощью приказа на передвижение (TagTalent Нажатие ПКМ). Выбор точки вне минимального\/максимального расстояния запустит шары с учетом этих значений в направлении цели. Хотя скорость поворота снижается, но шары запускаются в выбранную приказом точку, а не в направлении, куда смотрит герой.",
        "Выбор точки вне минимального\/максимального расстояния запустит шары с учетом этих значений в направлении цели.",
        "Хотя скорость поворота снижается, но шары запускаются в выбранную приказом точку, а не в направлении, куда смотрит герой.",
        "Во время Mortimer Kisses Snapfire обезоружена. Приказы на атаку похожи на приказы движения во время обезоруживания, поэтому щелчок правой кнопкой мыши по врагу лишь выберет новую точку для шара.",
        "Место падения каждого шара выделяется красным кругом, видимым только союзникам.",
        "Выпускает шары с интервалом 0,75 (TagTalent 0,429) сек. сразу после применения, выпуская 8 (TagTalent 14) шаров.",
        "Каждый шар наносит урон и оставляет огненную лужу. Лужа длится 3 сек. Лужи применяют дебафф к врагам с интервалом в 0,5 секунды сразу после создания, срабатывая 7 раз. Дебафф длится 1 сек. и наносит 25\/37,5\/50 урона с интервалом в 0,5 секунды сразу после применения, срабатывая 3 раз. Несколько дебаффов не складываются.",
        "Лужи применяют дебафф к врагам с интервалом в 0,5 секунды сразу после создания, срабатывая 7 раз.",
        "Дебафф длится 1 сек. и наносит 25\/37,5\/50 урона с интервалом в 0,5 секунды сразу после применения, срабатывая 3 раз.",
        "Несколько дебаффов не складываются.",
        "Один шар наносит до 385\/577,5\/770 урона, учитывая попадание и нахождение существа в луже всю её длительность.",
        "Дает летающий обзор в радиусе 275 в выбранной для шаров области, длящийся до прекращения их запуска.",
        "Во время полета снаряды дают летающий обзор в радиусе 500. Обзор задерживается на 3,5 секунды в месте падения.",
        "Повышение уровня способности не улучшает уже запускаемые шары. При этом огненные лужи улучшаются и применяют обновленный дебафф. Уже действующие дебаффы не обновляются.",
        "При этом огненные лужи улучшаются и применяют обновленный дебафф.",
        "Уже действующие дебаффы не обновляются.",
        "Выбор таланта, увеличивающего замедление, мгновенно улучшает все огненные лужи. Уже действующие дебаффы не обновляются.",
        "Уже действующие дебаффы не обновляются."
      ],
      "mana": "125\/150\/175",
      "hotKey": "R",
      "cooldown": "110",
      "description": "Верный питомец выпускает несколько шаров лавы на расстояние от 600 в течение 6 сек. Шары наносят урон при попадании и создают огненные лужи, которые замедляют и наносят периодический урон. Во время действия герой имеет уменьшенную скорость поворота. Каждый шар можно выпустить нажатием правой кнопки мыши.",
      "spellName": "Mortimer Kisses",
      "params": [
        "Анимация применения: 0,5+0,73",
        "Дальность применения: 3000",
        "Мин. расстояние: 600",
        "Макс. расстояние: 3000",
        "Радиус попадания: 275",
        "Скорость поворота (TagTalentградусов\/сек.): 75°",
        "Число снарядов: 8 (TagTalent 14)",
        "Урон: 160\/240\/320",
        "Урон в секунду от дебаффа: 50\/75\/100",
        "Замедление скорости передвижения: 15%\/20%\/25% (TagTalent 35%\/40%\/45%)",
        "Длительность: 6",
        "Время действия лужи: 3",
        "Длительность дебаффа: 1",
        "Дарует новую способность: Gobble Up.",
        "Дебафф остается, если был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 20.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 1.9,
    "attrAgility": 16.0
  },
  "description": "Беатрикс, Snapfire — это герой с дальним типом атаки и основным атрибутом сила. Имеет четыре способности, каждая из которых — активная. Первой, Scatterblast, пороховница выстреливает из пушки по конической области действия, замедляя врагов и нанося им урон. Урон увеличится на 50 % при выстреле в упор. Вторая способность Firesnap Cookie позволяет герою скормить бодрящей печенькой союзника или собственного питомца, отчего тот отпрыгнет на небольшое расстояние и в области приземления оглушит врагов и нанесёт им урон. Третья способность Lil' Shredder даст Беатрикс 6 быстрых атак с фиксированным уроном, которые замедляют скорость атаки врага при попадании. На время действия способности увеличивается дальность атаки. Ультимативной способностью, Mortimer Kisses, питомец старушки в течение 6 секунд начинает выплёвывать огненные шары, наносящие большой урон. При контакте с землёй шары создают огненные лужицы, которые замедляют скорость передвижения врагов и наносят периодический урон. На время действия способности герой не может сдвинуться с места и имеет замедленную скорость поворота, а шар можно выпустить на расстояние не меньше 600 единиц от местоположения героя. Точку приземления шара можно выбрать нажатием правой кнопки мыши. Способность можно прервать.",
  "history": "Путешествуя по пустынным дорогам и оазисам Нанарака, засушливого преддверия в чужеземье, истощённые и отчаянно цепляющиеся за жизнь люди всегда рады увидеть Беатрикс Пороховницу и её драконью жабу Мортимера. Пережив многих собратьев по ремеслу благодаря острому уму и верной руке, Беатриша прославилась не только как непревзойдённая оружейница, но и как мудрая и жизнерадостная дама почтенного возраста, пекущая самое лакомое на свете пороховое печенье. Потому-то Чужеземье и усыпано костьми бандитов и негодников, вздумавших провести добродушную старушку.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+6 к числу шаров от Mortimer Kisses",
      "talentRight": "3 цели атаки у Lil' Shredder"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20% к замедлению от Mortimer Kisses",
      "talentRight": "Lil' Shredder наносит урон от атак"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+75 к урону от Scatterblast",
      "talentRight": "Firesnap Cookie излечивает 200 здоровья"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1 сек. замедления от Scatterblast",
      "talentRight": "+200 к здоровью"
    }
  ]
}