{"abilities":[{"spell":"Templar Assassin becomes highly elusive, avoiding damage and gaining a bonus to her damage. The damage and avoidance effects are separate, and have a limited number of instances.","effects":["Ability No Target","Affects Self"],"notes":["Refraction interrupts Templar Assassin's channeling spells upon cast.","Places 2 buffs on Templar Assassin, named \"Damage\" and \"Absorb\". One buff grants instances of damage block and the other instances of bonus attack damage.","The numbers of left instances are visible on the buff icons. The buffs and the visual effects of the ability are visible to everyone.","The bonus damage is added as regular attack damage bonus, which is visible in the HUD. Loses a bonus damage instance when the attack projectile successfully lands on the target. Missed or disjointed attacks do not count. Does not lose instances upon attacking allies, but the damage is still applied. When casting Refraction while an attack projectile is traveling, the projectile does not get the bonus damage, but still uses up one instance upon landing.","The damage absorb fully negates damage, causing several on-damage effects to not trigger. Has a higher priority than Aphotic Shield and Living Armor, but lower than False Promise. However, it still loses a charge when combined with the latter. Damage below 5 (after reductions) is completely ignored. It is neither blocked, nor wastes any block instances. Refraction negates all 3 damage types. It does not negate damage flagged as HP Removal."],"mana":"100","elements":["Pierces spell immunity."],"cooldown":"17","name":"Refraction","description":["Cast Animation: 0+0","Number of Instances: 3\/4\/5\/6 ( 7\/8\/9\/10)","Attack Damage Bonus: 25\/50\/75\/100","Duration: 17"],"hot_key":"Q","legacy_key":"R"},{"spell":"Templar Assassin conceals herself, becoming invisible as long as she remains still. If Meld's invisibility is broken by attacking an enemy, Lanaya will deal bonus damage to the enemy and reduce their armor for 12 seconds.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Physical"],"notes":["Meld interrupts Templar Assassin's channeling spells upon cast.","Turns Templar Assassin instantly invisible and orders her to stop.","Invisibility is lost upon reaching the cast point of spells or items, upon landing an attack, or upon moving. Forced movement also counts, and cancels Meld if moved horizontally. Vertical movement, and Teleporting effects do not cancel it. After an attack projectile has been launched, Templar Assassin can perform any action without losing the invisibility. However, when the projectile misses (evasion, blind or disjoint), the invisibility is lost at the moment it misses.","Turns Templar Assassin phased, so that other units may pass through her.","Templar Assassin can pick up, drop or attack items without breaking the invisibility, considering she does not move while doing so. She also can turn without breaking the invisibility.","The next attack of Templar Assassin which connects with a unit applies the damage and armor reduction ( and the bash). This does not necessarily have to be the first attack out of Meld. If somehow a following attack hits another target first (e.g. it teleports away), the new target is affected instead.","The bonus damage is dealt in a separate damage instance, and counts as attack damage. Since it is applied separately, it does not trigger crits, lifesteal, or Psi Blades.","Meld first applies its armor debuff, then Templar Assassin's attack damage, and then the Meld damage ( and then the bash).","Neither the bonus damage nor the armor reduction from Meld affect buildings.","Multiple instances of the armor reduction debuff fully stack.","When the talent is chosen, applies a basic dispel on Templar Assassin upon cast.","The level 25 talent adds a bash to the Meld attack. Stacks with other bashes."],"mana":"50","elements":["Can be disjointed.","Pierces spell immunity."],"cooldown":"6","name":"Meld","description":["Cast Animation: 0+0.53","Fade Time: 0","Damage: 50\/100\/150\/200","Armor Reduction: 2\/4\/6\/8 ( 6\/8\/10\/12)","Debuff Duration: 12","Invis Duration: Permanent","Bash Duration: 0 ( 1.5)"],"hot_key":"W","legacy_key":"D"},{"spell":"Templar Assassin's psi blades slice through the attacked unit, splitting and damaging enemy units directly behind it, while gaining bonus attack range.","effects":["Ability Passive","Affects Enemies","Damage Pure"],"notes":["Psi Blades increases Templar Assassin's total attack range to 200\/260\/320\/380.","With no points in Psi Blades, Templar Assassin has an attack range of only 140, but still counts as a ranged hero.","The spill range is based on the attack target's position, not on Templar Assassin's. So from max attack range, she can hit units up to 790\/890\/990\/1090 range away.","The affected area has a rectangular shape, with a width of 75 and with the spill range as length.","Spill damage is based on her attack damage after all reductions. This means the spill damage can be increased by reducing the armor of the primary target. It can also be increased by increasing Templar Assassin's attack damage with attack modifiers like crits or bashes.","Attack modifiers are only applied to the primary target.","Templar Assassin's position is checked as the projectile hits the target, not upon launching.","Despite the visual effects, Psi Blades do not spill damage when attacking buildings.","Psi Blades spill damage when attacking allies or wards.","Spill damage hits invisible units, but does not hit wards or buildings."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Psi Blades","description":["Spill Range: 590\/630\/670\/710","Spill Width: 75","Attack Range Bonus: 60\/120\/180\/240","Attack Damage Spilled: 100%"],"hot_key":"E","legacy_key":"B"},{"spell":"Templar Assassin places mystical traps that invisibly monitor enemy movement. When sprung at her command, they exert a slowing influence of 30% in the area. Traps charge up to slow after seconds. Deals bonus damage when fully charged.","effects":["Ability Target Point"],"notes":["The traps only slow enemies when they get triggered, not when they are destroyed by attacks, or by exceeding the maximum allowed traps count.","Psionic Traps do not block neutral creep camps."],"mana":"15","elements":[],"cooldown":"11\/8\/5","name":"Psionic Trap","description":["Cast Animation: 0.3+0","Cast Range: 2000","Maximum Traps: 5\/8\/11","Trap Fade Time: 2","Trap Duration: Permanent"],"hot_key":"R","legacy_key":"C"},{"spell":"Springs the nearest trap, slowing nearby enemies.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Trap is unlocked when Psionic Trap is learned.","Does not interrupt Templar Assassin's channeling spells upon cast.","Cannot be cast when the caster has no traps present.","The slow starts at 30% and increases by 0.75% in 0.1 second intervals, resulting in the following amounts on each second after placement: 0 Seconds: 30% slow 1 Second: 37.5% slow 2 Seconds: 45% slow 3 Seconds: 52.5% slow 4 Seconds: 60% slow","The damage is only applied when the trap is fully charged. The trap visually changes once fully charges. Its outer ring starts black and turns white once fully charged.","Deals damage in 1 second intervals, starting 1 second after the debuff is placed, resulting in 5 damage instances.","Can deal up to 250\/300\/350 ( 450\/500\/550) damage to a single unit (before reductions).","The source of the damage is the caster, and not the trap itself.","The damage values are always based on the current level upon triggering the trap, and are not set upon spawning the trap.","Multiple instances of the debuff do not stack, but get refreshed instead. When refreshed, the slow and damage get updated based on how long that trap was charged."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Does not pierce spell immunity."],"cooldown":"0.5","name":"Trap","description":["Cast Animation: 0+0","Trap Search Radius: Global","Slow Radius: 400","Damage per Second: 50\/60\/70 ( 90\/100\/110)","Min Move Speed Slow: 30%","Max Move Speed Slow: 60%","Trap Charge Time: 4","Slow Duration: 5"],"hot_key":"D","legacy_key":"T"},{"spell":"Springs the trap, slowing nearby enemies.","effects":["Ability No Target","Affects Enemies"],"notes":["This is cast from the trap itself, allowing Templar Assassin to trigger traps from afar without having to trigger nearby traps first.","Same notes as for Trap on Templar Assasin apply."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Does not pierce spell immunity."],"cooldown":"0.5","name":"Trap","description":["Cast Animation: 0+0","Slow Radius: 400","Damage per Second: 50\/60\/70 ( 90\/100\/110)","Min Move Speed Slow: 30%","Max Move Speed Slow: 60%","Trap Charge Time: 4","Slow Duration: 5"],"hot_key":"Q","legacy_key":"T"}],"bio":"Lanaya, the Templar Assassin, came to her calling by a path of curious inquiry. Possessed of a scientific bent, she spent her early years engaged in meticulous study of nature's laws--peering into grimoires of magic and alchemy, recreating experiments from charred fragments of the Violet Archives, and memorizing observations of the Keen recordkeepers. Already quiet and secretive by nature, the difficulty of acquiring these objects further reinforced her skills of stealth. Had she been less retiring, she might have become notorious among the guilds as a thief-scholar. Instead her investigations led her into far more obscure corners. As she devoted her furtive talents to unlocking the secrets of the universe, she instead unlocked a secret door that exists in nature itself: the entryway to the most Hidden Temple. The intelligences that waited beyond that portal, proved to be expecting her, and whatever mysteries they revealed in the moment of their discovery was nothing compared to the answers they held out to Lanaya should she continue in their service. She swore to protect the mysteries, but more to the point, in service to the Hidden Temple she satisfies her endless craving for understanding. In the eyes of each foe she expunges, a bit more of the mystery is revealed.","talentsTips":["The evasion talent stacks multiplicatively with other sources of evasion."],"trivia":["In DotA, Templar Assassin makes numerous references to the game Starcraft, another famous RTS game by Blizzard. Her ability to manipulate psionic energy, the psi blades she wields, and the mention of her master being originally from Aiur in her DotA biography all apply to the Protoss, one of the three main races of the game.","Although Templar Assassin is a ranged hero, she has a 140 base attack range. This means her attack range is the shortest of all heroes, as melee heroes have an attack range of 150.","Templar Assassin's rare response upon snapping a trap, \"It's a trap!\" is a reference based on Star Wars' Admiral Ackbar's quote from \"Return of the Jedi.\"","The response \"My body is a temple for which I will kill.\" is a reference to the bible verse John 2:19-22."],"talents":["+4 Refraction Instances:1.5s Meld Hit Bash","-4 Meld Armor Reduction:Meld Dispels","+200 Psionic Trap Damage:+25 Movement Speed","15% Evasion:+25 Attack Speed"],"desc":"Lanaya the Templar Assassin is a very short-ranged agility hero capable of dealing huge bursts of physical damage to swathes of enemies with expert positioning and timing. Unlike most physical damage dealers, Lanaya reaches her damage potential quite early and then scales up from that point with carry items, letting her gank with impunity throughout the mid-game, and her short attack range increases from being comparable to that of a melee hero to a ranged hero with short reach as she levels Psi Blades."}