{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+250 к золоту от Track",
          "talentRight": "2 заряда Shuriken Toss"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+50 к похищению золота от Jinada",
          "talentRight": "Track даёт наземный обзор в радиусе 600"
        },
        {
          "talentLvl": "15",
          "talentLeft": "50% ускорения от Track для союзников",
          "talentRight": "+50 к урону от Shuriken Toss"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+40 к урону от Jinada",
          "talentRight": "+2 сек. замедления от Shadow Walk"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/32\/Bounty_Hunter_Shuriken_Toss_1.mp3\/revision\/latest?cb=20191216011325",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета сюрикена — 1000.",
        "Сюрикен сначала наносит урон, затем применяет дебафф.",
        "Для того чтобы сюрикен отскакивал, изначальная цель не обязана иметь дебафф Track. Может отскочить к каждому существу только один раз. Не может перескочить, но отскакивает от неуязвимых или спрятанных существ.",
        "Может отскочить к каждому существу только один раз.",
        "Не может перескочить, но отскакивает от неуязвимых или спрятанных существ.",
        "Количество урона, которое наносит Shuriken Toss целям с дебаффом от Track на каждом уровне: 1 уровень: 112\/168\/224\/280 (TagTalent 182\/238\/294\/350) урона. 2 уровень: 136\/204\/272\/340 (TagTalent 221\/289\/357\/425) урона. 3 уровень: 160\/240\/320\/400 (TagTalent 260\/340\/420\/500) урона.",
        "1 уровень: 112\/168\/224\/280 (TagTalent 182\/238\/294\/350) урона.",
        "2 уровень: 136\/204\/272\/340 (TagTalent 221\/289\/357\/425) урона.",
        "3 уровень: 160\/240\/320\/400 (TagTalent 260\/340\/420\/500) урона.",
        "",
        "Талант на увеличение урона мгновенно улучшает все сюрикены Bounty Hunter летящие в данный момент.",
        "С Aghanim's Scepter, Shuriken Toss при столкновении применяет на цель Jinada текущего уровня. Действуют все примечания к Jinada. Если она не изучена, то она не будет применена. Не использует мгновенные атаки для применения Jinada. Эффекты применяются самой Shuriken Toss. Jinada от Shuriken Toss является независимой от Jinada применяемой атаками, не зависимо от перезарядки, и работает даже когда герой мёртв. Урон от Jinada применяется отдельно в виде урона заклинаний, он подвергается усилению урона заклинаний и работает с вампиризмом заклинаний.",
        "Действуют все примечания к Jinada. Если она не изучена, то она не будет применена.",
        "Не использует мгновенные атаки для применения Jinada. Эффекты применяются самой Shuriken Toss.",
        "Jinada от Shuriken Toss является независимой от Jinada применяемой атаками, не зависимо от перезарядки, и работает даже когда герой мёртв.",
        "Урон от Jinada применяется отдельно в виде урона заклинаний, он подвергается усилению урона заклинаний и работает с вампиризмом заклинаний."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "Q",
      "cooldown": "5 (TagTalent 0)",
      "description": "Запускает во врага смертельный сюрикен, наносящий урон и ненадолго оглушающий цель. Сюрикен будет отскакивать между помеченными способностью Track противниками в радиусе 1200 друг от друга.",
      "spellName": "Shuriken Toss",
      "params": [
        "Анимация применения: 0,3+0,43",
        "Дальность применения: 375\/425\/475\/525 (TagAghanim 700)",
        "Радиус отскакивания: 1200",
        "Урон: 80\/120\/160\/200 (TagTalent 130\/170\/210\/250)",
        "Длительность оглушения: 0,1",
        "Количество зарядов: 2",
        "Время восстановления заряда: 5",
        "Уменьшает перезарядку, увеличивает дальность применения и добавляет к сюрикену эффект способности Jinada.",
        "Нельзя применить к существам с иммунитетом к заклинаниям. Не оглушает и не пытается нанести урон существам с иммунитетом. Может отскакивать и перескакивать на существ с иммунитетом.",
        "Блокируется как основной, так и вторичной целью. При блокировке продолжает отскакивать.",
        "Могут избежать как основная, так и вторичная цели. При избегании отскоки прекращаются."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Bounty_Hunter_Jinada.mp3\/revision\/latest?cb=20191216011329",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов"
      ],
      "notes": [
        "Если способность не на перезарядке, то оружие Bounty Hunter испускает эффекты частиц.",
        "Проверяет наличие перезарядки при начале атаке, а не при её попадании. То есть Jinada не применяется, если она была на перезарядке в момент анимации атаки.",
        "То есть Jinada не применяется, если она была на перезарядке в момент анимации атаки.",
        "Дополнительный урон дается в виде бонуса, пока способность не на перезарядке, и отнимается при начале перезарядки.",
        "Крадет только ненадёжное золото, отнимая его у цели и добавляя в качестве ненадежного владельцу способности. Bounty Hunter получает ровно столько, сколько теряет цель.",
        "Bounty Hunter получает ровно столько, сколько теряет цель.",
        "Крадет золото только при атаке вражеских героев, включая клонов, но исключая иллюзии.",
        "При атаке любых других существ (включая постройки и варды) наносится только дополнительный урон, а сама способность уходит на перезарядку.",
        "Не действует на союзников: не крадет золото и не наносит дополнительный урон."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Герой тщательно продумывает следующую атаку, нанося дополнительный урон и воруя ненадёжное золото жертвы.",
      "spellName": "Jinada",
      "params": [
        "Дополнительный урон: 60\/100\/140\/180 (TagTalent 100\/140\/180\/220)",
        "Крадёт золота: 12\/20\/28\/36 (TagTalent 62\/70\/78\/86)",
        "Не смотря на то, что это активируемая способность, Jinada отключается истощением. Не останавливает срабатывание Jinada от Shuriken Toss",
        "Jinada всегда включена для иллюзий, но они не могут использовать её. Иллюзии получают постоянный эффект частиц на оружие."
      ],
      "itemBehaviour": [],
      "legacyKey": "J",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Bounty_Hunter_Shadow_Walk.mp3\/revision\/latest?cb=20191216011331",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "Не прерывает произнесение заклинаний.",
        "Атака сначала наносит урон, затем применяет дебафф Shadow Walk.",
        "Пока длится время до невидимости, Bounty Hunter может использовать заклинания, предметы и совершать атаку без выхода из невидимости. Также эта атака применит замедление от Shadow Walk.",
        "Также эта атака применит замедление от Shadow Walk.",
        "Невидимость прерывается при наступлении у заклинаний или предметов задержки применения или при попадании атаки. Промахнувшиеся атаки невидимость не прерывают. Использование Track не выводит из невидимости от Shadow Walk.",
        "Использование Track не выводит из невидимости от Shadow Walk.",
        "Shadow Walk позволяет Bounty Hunter проходить сквозь других существ, включая варды, но исключая постройки.",
        "Bounty Hunter может поднимать, выкидывать или атаковать предметы без выхода из невидимости."
      ],
      "mana": "65",
      "hotKey": "E",
      "cooldown": "15 (TagTalent 10)",
      "description": "Герой становится невидимым и получает возможность проходить сквозь существ до тех пор, пока не применит другую способность или не нанесёт удар. Атака из невидимости замедлит жертву.",
      "spellName": "Shadow Walk",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 1\/0,75\/0,5\/0,25",
        "Замедление скорости передвижения: 16%\/24%\/32%\/40%",
        "Длительность: 20\/25\/30\/35",
        "Длительность замедления: 4 (TagTalent 6)",
        "Снижение входящего урона: 35%",
        "Длительность оглушения: 1",
        "Уменьшает получаемый в невидимости урон на 35%. Атака из невидимости оглушает цель на 1 секунду. Уменьшает перезарядку на 5 секунд."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Bounty_Hunter_Track.mp3\/revision\/latest?cb=20191216011326",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев \/ Союзных героев"
      ],
      "notes": [
        "Вопреки визуальным эффектам дебафф Track мгновенно применяется к цели.",
        "Разоблачает и раскрывает невидимость цели и наземного обзора вокруг неё. Талант добавляющий наземный обзор мгновенно обновляет все существующие дебаффы Track.",
        "Талант добавляющий наземный обзор мгновенно обновляет все существующие дебаффы Track.",
        "Даёт ненадёжное золото Bounty Hunter и его союзникам вокруг цели после её смерти, как цель умрёт не имеет значения. Союзники получают дополнительное золото только если они на расстоянии в 1200 единиц от отмеченного героя и живы. Сам же Bounty Hunter получает золото независимо от расстояния, даже будучи мёртвым.",
        "Союзники получают дополнительное золото только если они на расстоянии в 1200 единиц от отмеченного героя и живы. Сам же Bounty Hunter получает золото независимо от расстояния, даже будучи мёртвым.",
        "Track можно применять к иллюзиям и Tempest Double, но их смерть не приносит золото.",
        "Если отмечены несколько Meepo и один из них умрает, то бонусное золото от Track даётся вокруг каждого Meepo.",
        "Дополнительная скорость передвижения предоставлена аурой цели. Её бафф задерживается на 0,5 сек. Несколько источников ауры не складываются. Талант на скорость передвижения союзникам мгновенно обновляет все существующие дебаффы Track. Аура не действует на неуязвимых или спрятанных существ.",
        "Талант на скорость передвижения союзникам мгновенно обновляет все существующие дебаффы Track.",
        "Аура не действует на неуязвимых или спрятанных существ.",
        "Визуальные эффекты и звук Track видны и слышны только Bounty Hunter и его союзникам. При этом дебафф виден всем.",
        "Визуальные эффекты от баффа скорости передвижения также видны всем.",
        "Иконка дебаффа отображает текущее количество золота у цели.",
        "Alt+ Нажатие ЛКМ по дебаффу сообщает в чат текущее количество золота отмеченного героя."
      ],
      "mana": "60",
      "hotKey": "R",
      "cooldown": "4",
      "description": "Помечает вражеского героя, раскрывая его невидимость и показывая его запас золота. Владелец способности получает дополнительную скорость передвижения около цели и наносит ей критический урон. Если она умрёт, союзники неподалёку и сам владелец способности получат дополнительную награду в виде золота. Применение этой способности не снимает невидимость.",
      "spellName": "Track",
      "params": [
        "Анимация применения: 0,3+0,43",
        "Дальность применения: 1000",
        "Радиус: 1200",
        "Доп. скорость передвижения себе: 16%\/20%\/24%",
        "Критический удар заклинателя по цели: 140%\/170%\/200%",
        "Доп. золото себе: 130\/225\/320 (TagTalent 380\/475\/570)",
        "Дополнительное золото союзникам: 40\/80\/120 (TagTalent 290\/330\/370)",
        "Множитель урона Shuriken Toss: 1,4\/1,7\/2",
        "Длительность задержки ауры: 0,5",
        "Длительность: 30",
        "Бонус к скорости передвижения союзников: 8%\/10%\/12%",
        "Радиус видимости: 600"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 20.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.6,
    "attrAgility": 21.0
  },
  "description": "Bounty Hunter — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Shuriken Toss, запускает смертельный сюрикен во вражеское существо, нанося урон и оглушая цель. Сюрикен будет отскакивать между помеченными способностью Track существами, которые находятся в радиусе друг от друга. Вторая способность, Jinada, даёт Bounty Hunter возможность наносить удары с увеличенным уроном, а также красть золото у вражеских героев. Третья способность, Shadow Walk, позволяет герою уходить в невидимость, при этом получая возможность проходить сквозь крипов и героев до тех пор, пока он не нанесет удар или не использует способность. Если он выходит из невидимости атакуя, то замедляет скорость передвижения ударенного противника. Ультимативная способность, Track, отслеживает вражеского героя, раскрывая его невидимость и показывая количество золота у него, а также увеличивает скорость передвижения Bounty Hunter и его урон по цели. Если цель умирает, Bounty Hunter и ближайшие дружественные герои получают награду в виде золота.",
  "history": "Жертвы рассказывают многое об охотнике за головами по имени Гондар — и никто не знает, что из этого правда. Кто-то шепчет о том, что его бросили ещё котёнком, и ему пришлось научиться охоте, лишь чтобы выжить. Другие слышали, что война лишила беднягу семьи, и того взял под крыло великий охотник Сорук, который научил сироту обращаться с клинками и вместе с ним прочёсывал тёмные рощи, выходя на большую охоту. А некоторые считают, что Гондар был обычным уличным оборванцем, взращённым в гильдии карманников и воров, где он и научился скрываться и запутывать следы. Его жертвы собираются вокруг костров в диких землях и делятся слухами, всё больше страшась головореза: например, поговаривают, что это он выследил короля Гоффа — безумного тирана, годами скрывавшегося от правосудия, — и в доказательство принёс его голову и скипетр. И что он проник в лагерь повстанцев на Хайсите, схватил там легендарного вора по прозвищу Белый плащ и доставил его до суда. А ещё — что именно он положил конец охотнику Соруку, которого объявили вне закона за убийство лучшего бугая принца. Так и расходятся истории о невероятных способностях Гондара, в которых одна авантюра невероятнее другой, а неуловимых целей будто бы не существует. Жертвы знают: за хорошую цену выследить можно кого угодно. За хорошую цену даже за самыми могущественными явится смерть из тени.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+250 к золоту от Track",
      "talentRight": "2 заряда Shuriken Toss"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+50 к похищению золота от Jinada",
      "talentRight": "Track даёт наземный обзор в радиусе 600"
    },
    {
      "talentLvl": "15",
      "talentLeft": "50% ускорения от Track для союзников",
      "talentRight": "+50 к урону от Shuriken Toss"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+40 к урону от Jinada",
      "talentRight": "+2 сек. замедления от Shadow Walk"
    }
  ]
}