{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Smoke_of_Deceit.mp3\/revision\/latest?cb=20141214193046",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца и приказы действия, за исключением обычных приказов движения.",
        "Заклинатель может использовать заклинания и предметы без выхода из невидимости, но атаки её отменят.",
        "Невидимость теряется при завершении времени перед атакой, даже если атака промахнулась.",
        "Невидимые существа могут подбирать и выкладывать предметы без отмены невидимости.",
        "True Sight не может обнаружить существ под действием Smoke of Deceit.",
        "Существ можно увидеть только если на них действует Chronosphere или их модели видны из-за Thirst или Track. Для полного перечня способностей, дающих обзор на модели, смотрите статью Общий обзор. Даже если модели существ стали видны, то на мини-карте они все равно не отображаются.",
        "Для полного перечня способностей, дающих обзор на модели, смотрите статью Общий обзор.",
        "Даже если модели существ стали видны, то на мини-карте они все равно не отображаются.",
        "Эффект развеивается только при приближении вражеских героев (включая клонов героев, исключая иллюзии) или башен."
      ],
      "mana": null,
      "abilityName": "Solitary Disguise",
      "cooldown": "45",
      "description": "Применяет на владельца эффект предмета Smoke of Deceit.",
      "params": [
        "Радиус развеивания: 1025",
        "Время до невидимости: 0",
        "Доп. скорость передвижения: 15%",
        "Длительность: 35"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Ninja Gear — полностью передаваемый предмет.",
    "Бонусы к скорости передвижения от нескольких Ninja Gear полностью сочетаются."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "нейтральных крипов",
  "name": "Ninja Gear",
  "description": "Ценное обмундирование, найденное юным исследователем в обломках и развалинах, парящих в бесконечной пустоте.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+20 к ловкости",
    "+30 к скорости передвижения"
  ],
  "tips": null
}