{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Снижение перезарядки сканирования: 50%",
        "Доп. дальность атаки (TagAghanimдальний бой): 100",
        "Доп. дальность применения: 100",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Дополнительная дальность атаки даётся только существам дальнего боя.",
        "Также влияет на дальность применения активных модификаторов атаки.",
        "Бафф ауры задерживается на 0,5 секунды.",
        "Действует только на подконтрольных игроку существ. Не подконтрольные игроку существа (например, линейные крипы) не попадают под влияние.",
        "Не действует на неуязвимых существ.",
        "Уменьшение перезарядки сканирования территории даётся аурой, а не самим предметом. Это значит, что использование сканирования в момент, когда никто не повержен действию ауры (например, если владелец предмета неуязвим и не имеет союзников поблизости), перезарядка не уменьшится. При применении позволяет перезарядке сканирования пропустить первые 105 секунд. Перезарядка сканирования уменьшается даже когда активировавший игрок не находится под влиянием ауры, до тех пор пока под влиянием другой союзник.",
        "Это значит, что использование сканирования в момент, когда никто не повержен действию ауры (например, если владелец предмета неуязвим и не имеет союзников поблизости), перезарядка не уменьшится.",
        "При применении позволяет перезарядке сканирования пропустить первые 105 секунд.",
        "Перезарядка сканирования уменьшается даже когда активировавший игрок не находится под влиянием ауры, до тех пор пока под влиянием другой союзник.",
        "Несколько Prescient Aura не сочетаются. Это значит, что второй Telescope не усилит уменьшение перезарядки.",
        "Это значит, что второй Telescope не усилит уменьшение перезарядки."
      ],
      "mana": null,
      "abilityName": "Prescient Aura",
      "cooldown": null,
      "description": "Снижает перезарядку сканирования на 50%. Увеличивает дальность атаки и применения способностей союзников в радиусе 1200.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Telescope",
  "description": "Полезное устройство, которое может приблизить что-нибудь далёкое",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}