{
  "abilities": [
    {
      "notes": [
        "Талант на уклонение мультипликативно складывается с другими источниками уклонения.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на \/ \/ все атрибуты в общем даёт Terrorblade: 160 здоровья, 0,8 восстановления здоровья, 1,33 брони, 8 скорости атаки, 96 маны, 0,4 восстановления маны и 8 урона от атаки."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+20 сек. действия Metamorphosis",
          "talentRight": "−34 сек. перезарядки Sunder"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+8 сек. к жизни иллюзий от Conjure Image",
          "talentRight": "+8 ко всем атрибутам"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к скорости атаки",
          "talentRight": "+275 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+16% к уклонению",
          "talentRight": "+2 сек. действия Reflection"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Terrorblade_Reflection.mp3\/revision\/latest?cb=20191216025058",
      "effects": [
        "Способность Направленная на область",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "При использовании замедляет всех вражеских видимых героев (включая клонов, исключая иллюзии и крипов-героев) в области и создает их иллюзии.",
        "Двойники неуязвимы, невыделяемы и неподконтрольны герою.",
        "Скорость передвижения двойников - 550 и они могут свободно проходить через препятствия. Также они дают обзор, равный обзору их целей.",
        "Иллюзии появляются в 108 единицах от целей, если размер столкновения героя равен 24, и в 72 единицах, если размер равен 8. Они возникают с одной из четырех сторон от целей.",
        "Иллюзии пытаются атаковать свои цели. Если они не смогут атаковать, то будут двигаться за целям, пока вновь не появится возможность.",
        "Иллюзии не теряют цель, если она стала невидимой, спрятанной или вошла в туман войны. При этом для атаки им нужен обзор.",
        "Иллюзии неуязвимы к любым способностям, даже тем, которые поражают неуязвимых существ.",
        "Как и остальные иллюзии, двойники распространяют ауры и используют пассивные способности, доступные иллюзиям.",
        "Дебаффы замедления и иллюзий связаны друг с другом. Развеивание замедления уничтожает все иллюзии, связанные с существом.",
        "Замедление от нескольких применений не складывается, но создает дополнительные иллюзии для каждого вражеского героя в радиусе. Несмотря на то, что длительности замедления обновляется, каждое использование создает отдельную иллюзию со своей собственной длительностью, поэтому длительность предыдущих иллюзий не обновляется.",
        "Несмотря на то, что длительности замедления обновляется, каждое использование создает отдельную иллюзию со своей собственной длительностью, поэтому длительность предыдущих иллюзий не обновляется.",
        "В форме Metamorphosis остаточная анимация равна 1,66 секунды."
      ],
      "mana": "35\/40\/45\/50",
      "item_behaviour": [],
      "name": "Reflection",
      "cooldown": "28\/24\/20\/16",
      "description": "Создаёт неуязвимых тёмных двойников всех вражеских героев в указанной области. Каждый двойник атакует свою цель и уменьшает её скорость передвижения.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,87",
        "Дальность применения: 700",
        "Радиус: 475",
        "Замедление скорости передвижения: 15%\/20%\/25%\/30%",
        "Урон иллюзий: 55%\/70%\/85%\/100%",
        "Длительность: 5",
        "Замедление и иллюзии остаются, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/37\/Terrorblade_Conjure_Image.mp3\/revision\/latest?cb=20191216025101",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Для врагов созданные иллюзии визуально отличаются от настоящего Terrorblade.",
        "Иллюзия появляется в 108 единицах от Terrorblade с одной из четырех сторон.",
        "Учитывая базовую перезарядку и анимацию применения, могут одновременно существовать 3 иллюзии.",
        "В форме Metamorphosis остаточная анимация равна 0,7 секунды."
      ],
      "mana": "70\/75\/80\/85",
      "item_behaviour": [],
      "name": "Conjure Image",
      "cooldown": "16",
      "description": "Создает иллюзию героя, которая наносит урон.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,15+0,77",
        "Число иллюзий: 1",
        "Урон иллюзии: 30%\/40%\/50%\/60%",
        "Урон по иллюзии: 320%",
        "Время жизни иллюзии: 34 (TagTalent 42)"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7e\/Terrorblade_Metamorphosis.mp3\/revision\/latest?cb=20191216025103",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Во время трансформации Terrorblade не может ничего сделать; её нельзя прервать. Бездействие также применяется к иллюзиям.",
        "Дополнительный урон добавляется к базовому урону Terrorblade и его иллюзий.",
        "Увеличивает базовый урон Terrorblade до 67‒73\/82‒88\/97‒103\/112‒118, а дальность атаки — до 490\/510\/530\/550 (TagTalent 510\/530\/550\/570) единиц.",
        "Также дает ему свойства существа дальнего боя, поэтому все предметы с разницей в значениях для ближнего и дальнего боя (например, Manta Style) будут использовать значения дальнего боя.",
        "Снаряды от атак Terrorblade летят со скоростью в 900.",
        "Аура действует только на иллюзии под контролем Terrorblade (включая неуязвимых и спрятанные), исключая иллюзии от Reflection.",
        "Бафф от ауры трансформации задерживается на 1 сек.",
        "В форме Terrorblade не оставляет за собой следы.",
        "Metamorphosis отменяется при смерти."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Metamorphosis",
      "cooldown": "155",
      "description": "Герой и все его иллюзии в радиусе 1200 превращаются в могущественных демонов, сражающихся в дальнем бою.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Время трансформации: 0,35",
        "Радиус ауры: 1200",
        "Дополнительный урон: 15\/30\/45\/60",
        "Доп. дальность атаки: 340\/360\/380\/400 (TagTalent 360\/380\/400\/420)",
        "Длительность задержки ауры: 1",
        "Длительность: 40\/44\/48\/52"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Terrorblade_Demon_Zeal.mp3\/revision\/latest?cb=20210103155910",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Расход 20% текущего здоровья — это отнимающий здоровье урон.",
        "Дает 100 к скорости передвижения и 100 к скорости атаки, если герой не в форме Metamorphosis.",
        "Бафф постоянно проверяет наличие баффа Metamorphosis и мгновенно адаптирует значения."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Demon Zeal",
      "cooldown": "14",
      "description": "Герой расходует 20% от своего текущего здоровья, чтобы получить +50 к скорости передвижения и +50 к скорости атаки на 7 сек. Бонус на 100% больше, если герой сражается в ближнем бою. Перезарядка: 14 секунд.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Расход текущего здоровья: 20%",
        "Доп. скорость передвижения: 50",
        "Доп. скорость атаки: 50",
        "Бонус в ближнем бою: 100%",
        "Длительность: 7",
        ""
      ],
      "legacy_key": "Z",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Terrorblade_Terror_Wave_1.mp3\/revision\/latest?cb=20191216025104",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "При применении в обычной форме применяет к Terrorblade Metamorphosis текущего уровня на 10 сек. При применении во время действия Metamorphosis увеличивает длительность формы на то же значение. То есть при нескольких применениях Terror Wave она продолжит увеличивать длительность. Если Metamorphosis не изучена, то герой не превращается.",
        "При применении во время действия Metamorphosis увеличивает длительность формы на то же значение.",
        "То есть при нескольких применениях Terror Wave она продолжит увеличивать длительность.",
        "Если Metamorphosis не изучена, то герой не превращается.",
        "Волна распространяется из текущего местоположения спустя 0,6 сек. после применения.",
        "Волна распространяется со скоростью 1000 единиц, достигая максимального расстояния за 1,6 сек.",
        "Волна распространяется узким кольцом, поэтому ее можно избежать, телепортировавшись в направлении Terrorblade.",
        "Страх от Terror Wave заставляет затронутых врагов бежать от заклинателя, а не в направлении фонтана команды.",
        "Звук применения глобален и слышен врагам сквозь туман войны.",
        "Вопреки описанию страх действует на всех существ, а не только на героев."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Terror Wave",
      "cooldown": "90",
      "description": "Выпускает круговую волну, заставляющую задетых вражеских героев бежать в страхе, и дарует владельцу способности демоническую форму от Metamorphosis на 10 сек.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 1600",
        "Задержка эффекта: 0,6",
        "Длительность Metamorphosis: 10",
        "Длительность страха: 2,5",
        ""
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/47\/Terrorblade_Sunder.mp3\/revision\/latest?cb=20191216025059",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев \/ Вражеских героев"
      ],
      "notes": [
        "Sunder можно применить как к вражеским, так и к союзным героям, включая иллюзии.",
        "Terrorblade и его цель всегда остаются минимум с 35%\/30%\/25% от их максимального запаса здоровья. Например, если у них будет по 5% здоровья до использования Sunder, после использования их здоровье будет составлять 35%\/30%\/25%.",
        "Например, если у них будет по 5% здоровья до использования Sunder, после использования их здоровье будет составлять 35%\/30%\/25%.",
        "Sunder напрямую влияет на здоровье Terrorblade и его цели, поэтому игнорирует эффекты, реагирующие на урон (например, Ice Blast, Borrowed Time и Blade Mail).",
        "В форме Metamorphosis остаточная анимация равна 0,8 секунды."
      ],
      "mana": "150\/100\/50",
      "item_behaviour": [],
      "name": "Sunder",
      "cooldown": "120\/80\/40 (TagTalent 86\/46\/6)",
      "description": "Меняет местами жизненные силы героя и его цели. Некоторая часть здоровья остаётся на месте.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,35+0,83",
        "Дальность применения: 475",
        "Мин. здоровье после обмена: 35%\/30%\/25%",
        "Дарует новую способность: Terror Wave.",
        "Дарует новую способность: Demon Zeal.",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя применить на врагов с иммунитетом. При отражении проходит сквозь иммунитет."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.7,
    "attrStrength": 16.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 4.8,
    "attrAgility": 22.0
  },
  "description": "Terrorblade — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Первая способность, Reflection, создает неуязвимых тёмных двойников всех вражеских героев в небольшой области. Эти двойники атакуют цели и ненадолго уменьшают их скорость передвижения. Вторая способность, Conjure Image, создает иллюзию Terrorblade. Третья способность, Metamorphosis, превращает Terrorblade в могущественного демона с дальним типом атаки. Ультимативная способность, Sunder, вырывает душу из Terrorblade и его цели, меняя их местами вместе с частью жизненной силы. Некоторая часть здоровья остается на месте.",
  "history": "Этот демон-мародёр обрёл славу закоренелого преступника даже среди других адских тварей. Он был невиданным бунтарём, обворовал самих Владык-демонов, отверг все установленные обряды, призванные его смирить, и преступил все законы семи кругов Ада. За это ему преподали урок: даже в преисподней есть собственный ад. После короткого, сурового суда в окружении мириады мертвецов его наконец отправили в Колодец душ — скрытое измерение, куда демоны заключают себе подобных. Но это далеко не обычная тюрьма. Колодец душ — тёмное зеркало реальности, в котором демоны обречены взирать на искривлённое отражение собственной души. Однако заключённый и не думал страдать: он подчинил себе это отражение, яростного и вороватого демона невообразимой силы. Укротив своё тёмное начало, демон разрушил фрактальные стены темницы и вырвался на свободу, дабы вселять страх во всё мироздание.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+20 сек. действия Metamorphosis",
      "talentRight": "−34 сек. перезарядки Sunder"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+8 сек. к жизни иллюзий от Conjure Image",
      "talentRight": "+8 ко всем атрибутам"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к скорости атаки",
      "talentRight": "+275 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+16% к уклонению",
      "talentRight": "+2 сек. действия Reflection"
    }
  ]
}