{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Surge применяется по области радиусом 350",
          "talentRight": "Параллельная Стена"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+50 к урону от Ion Shell",
          "talentRight": "−40 сек. перезарядки Wall of Replica"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+75 к радиусу Ion Shell",
          "talentRight": "+100 к радиусу Vacuum"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+6 к броне",
          "talentRight": "+20% к урону иллюзий от Wall of Replica"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Vacuum.mp3\/revision\/latest?cb=20141212143650",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Втягивание всегда происходит за 0,3\/0,4\/0,5\/0,6 секунды, поэтому не имеет значения, как далеко или близко существа находятся от центра способности, скорость втягивания будет варьироваться.",
        "Урон наносится после потери дебаффа, то есть развеивание дебаффа нанесет урон раньше.",
        "Существа под действием способности обезврежены на всё время действия стягивания.",
        "Может затянуть существ на непроходимую территорию.",
        "Действует на невидимых и неуязвимых существ (за исключением Cyclone Eul's Scepter of Divinity), но не на спрятанных.",
        "Не действует на древних крипов и крипов-героев.",
        "При использовании Vacuum разрушает деревья на расстоянии 275 в выбранной точке после наложения дебаффа на врагов."
      ],
      "mana": "60\/90\/120\/150",
      "item_behaviour": [],
      "name": "Vacuum",
      "cooldown": "60\/50\/40\/30",
      "description": "Герой создаёт в выбранной области вакуум, который втягивает в себя врагов и наносит им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Дальность применения: 450\/500\/550\/600",
        "Радиус: 400\/450\/500\/550 (TagTalent 475\/525\/575\/625)",
        "Урон: 100\/150\/200\/250",
        "Длительность втягивания: 0,3\/0,4\/0,5\/0,6",
        "Пытается нанести урон, если враги применили иммунитет к заклинаниям до окончания втягивания."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Ion_Shell.mp3\/revision\/latest?cb=20141212143635",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Щит можно повесить на вражеских и союзных существ; урон наносится только вражеским. Существо с щитом не получает от него урон. Действует на невидимых существ, если они подойдут к щиту достаточно близко, но визуальные эффекты работать на них не будут. Нельзя применить на крипов-героев или курьеров. ↓↓ Двойное нажатие автоматически применяет на владельца способности.",
        "Действует на невидимых существ, если они подойдут к щиту достаточно близко, но визуальные эффекты работать на них не будут.",
        "Нельзя применить на крипов-героев или курьеров.",
        "↓↓ Двойное нажатие автоматически применяет на владельца способности.",
        "Несколько применений щита на одно и то же существо не складываются, но обновляют длительность и улучшают урон до текущего уровня способности. Если два героя из разных команд одновременно применяют щит на одну и ту же цель, то модификатор обновится и начнет наносить урон врагам последнего заклинателя. При этом статус модификатора не обновляется. Его состояние (бафф или дебафф) определяется при первом применении и не обновляется при повторном.",
        "Если два героя из разных команд одновременно применяют щит на одну и ту же цель, то модификатор обновится и начнет наносить урон врагам последнего заклинателя.",
        "При этом статус модификатора не обновляется. Его состояние (бафф или дебафф) определяется при первом применении и не обновляется при повторном.",
        "Наносит 4,5\/7,5\/10,5\/13,5 (TagTalent 12\/15\/18\/21) урона с интервалом в 0,15 секунду спустя 0,15 секунды после применения, срабатывая 166,7 (TagTalent 300) раз.",
        "Может нанести до 750\/1250\/1750\/2250 (TagTalent 2000\/2500\/3000\/3500) единиц урона в одиночную цель (до уменьшений), если цель будет стоять в радиусе урона все время действия.",
        "При улучшении с Aghanim's Scepter может нанести до 1350\/2250\/3150\/4050 (TagTalent 3600\/4500\/5400\/6300) урона одной цели (до учёта сопротивления магии, если противник будет под воздействием способности всю её длительность. Получение увеличивающего урон таланта немедленно улучшает все действующие щиты Ion Shell.",
        "При улучшении с Aghanim's Scepter может нанести до 1350\/2250\/3150\/4050 (TagTalent 3600\/4500\/5400\/6300) урона одной цели (до учёта сопротивления магии, если противник будет под воздействием способности всю её длительность.",
        "Получение увеличивающего урон таланта немедленно улучшает все действующие щиты Ion Shell."
      ],
      "mana": "100\/110\/120\/130",
      "item_behaviour": [],
      "name": "Ion Shell",
      "cooldown": "9 (TagTalent 0)",
      "description": "Окружает выбранную цель колючим щитом, наносящим урон всем врагам вокруг.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,7",
        "Дальность применения: 600",
        "Радиус урона: 275 (TagTalent 295)",
        "Урон в секунду: 30\/50\/70\/90 (TagTalent 80\/100\/120\/140)",
        "Длительность: 25 (TagAghanim 45)",
        "Увеличение здоровья: 300",
        "Количество зарядов: 2",
        "Время восполнения заряда: 9",
        "Заменяет перезарядку 2 зарядами. Способность действует на 20 секунд дольше и увеличивает здоровье цели на 300.",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя применить на врагов с иммунитетом. Щит остается, если был применен до иммунитета и не был развеян."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/75\/Surge.mp3\/revision\/latest?cb=20141212143641",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на область)",
        "Действует на Союзников"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически применяет на владельца способности.",
        "Применяет на цель ускорение, поэтому цель нельзя замедлить, пока эффект не спадёт.",
        "Также позволяет цели проходить сквозь других существ.",
        "Талант превращает Surge в заклинание, применяемое по области, поэтому способность больше нельзя применить напрямую на существо. Применение на портрет продолжает выбирать Dark Seer, считая его центром области. Однако ↓↓ Двойное нажатие продолжает работать только на Dark Seer. Союзники рядом с Dark Seer не получат эффект этой способности.",
        "Применение на портрет продолжает выбирать Dark Seer, считая его центром области.",
        "Однако ↓↓ Двойное нажатие продолжает работать только на Dark Seer. Союзники рядом с Dark Seer не получат эффект этой способности."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Surge",
      "cooldown": "19\/16\/13\/10",
      "description": "Заряжает дружественное существо энергией, ненадолго увеличивающей скорость передвижения и позволяющей проходить сквозь существ. Цель достигает стандартного максимума скорости, и её невозможно замедлить.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: 600",
        "Скорость: 550",
        "Длительность: 3\/4\/5\/6",
        "Радиус применения: 350"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Dark_Seer_Normal_Punch_1.mp3\/revision\/latest?cb=20201224202126",
      "effects": [
        "Способность Пассивная",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Перезарядка активируется только при успешном попадании по вражескому герою. При промахе способность не уходит на перезарядку.",
        "Урон от этой способности наносится отдельным источником урона, также он считается уроном заклинаний. Это значит, что на урон от этой способности не будут действовать модификаторы атаки. Также это значит, что на урон от этой способности будут действовать усиление урона от заклинаний и вампиризм заклинаний.",
        "Это значит, что на урон от этой способности не будут действовать модификаторы атаки.",
        "Также это значит, что на урон от этой способности будут действовать усиление урона от заклинаний и вампиризм заклинаний.",
        "Постоянно проверяет расстояние, преодолённое Dark Seer, и считает урон, расстояние толчка, длительность толчка и длительность оглушения соответственно. Каждые 10 единиц расстояния урон увеличивается на 2,667, расстояние толчка на 3,333, длительность толчка на 0,011, длительность оглушения на 0,023. Эффекты телепортации (включая Blink) могут добавить не более 600 единиц к преодоленному расстоянию вне зависимости от реальной дальности телепортации. Счётчик расстояния никогда не обнуляется, то есть можно ударить противника несколько раз полностью заряженными ударами при помощи сброса перезарядки.",
        "Каждые 10 единиц расстояния урон увеличивается на 2,667, расстояние толчка на 3,333, длительность толчка на 0,011, длительность оглушения на 0,023.",
        "Эффекты телепортации (включая Blink) могут добавить не более 600 единиц к преодоленному расстоянию вне зависимости от реальной дальности телепортации.",
        "Счётчик расстояния никогда не обнуляется, то есть можно ударить противника несколько раз полностью заряженными ударами при помощи сброса перезарядки.",
        "Далее приведён урон, дальность толчка, длительность толчка, длительность оглушения за расстояние, преодолённое за 3 до применения способности (до учёта сопротивления магии): Преодолённое расстояние 0: 10 урона, 50 дальность толчка, 0,1 сек. длительность толчка, 0,2 сек. длительность оглушения. Преодолённое расстояние 180: 58 урона, 110 дальность толчка, 0,305 сек. длительность толчка, 0,61 сек. длительность оглушения. Преодолённое расстояние 360: 106 урона, 170 дальность толчка, 0,51 сек. длительность толчка, 1,02 сек. длительность оглушения. Преодолённое расстояние 540: 154 урона, 230 дальность толчка, 0,715 сек. длительность толчка, 1,43 сек. длительность оглушения. Преодолённое расстояние 720: 202 урона, 290 дальность толчка, 0,92 сек. длительность толчка, 1,84 сек. длительность оглушения. Преодолённое расстояние 900: 250 урона, 350 дальность толчка, 1,125 сек. длительность толчка, 2,25 сек. длительность оглушения.",
        "Преодолённое расстояние 0: 10 урона, 50 дальность толчка, 0,1 сек. длительность толчка, 0,2 сек. длительность оглушения.",
        "Преодолённое расстояние 180: 58 урона, 110 дальность толчка, 0,305 сек. длительность толчка, 0,61 сек. длительность оглушения.",
        "Преодолённое расстояние 360: 106 урона, 170 дальность толчка, 0,51 сек. длительность толчка, 1,02 сек. длительность оглушения.",
        "Преодолённое расстояние 540: 154 урона, 230 дальность толчка, 0,715 сек. длительность толчка, 1,43 сек. длительность оглушения.",
        "Преодолённое расстояние 720: 202 урона, 290 дальность толчка, 0,92 сек. длительность толчка, 1,84 сек. длительность оглушения.",
        "Преодолённое расстояние 900: 250 урона, 350 дальность толчка, 1,125 сек. длительность толчка, 2,25 сек. длительность оглушения.",
        "",
        "Normal Punch сначала применяет оглушение, затем урон, затем обрасывание. После этого наносится урон от атаки.",
        "Иллюзия появляется на расстоянии 350 позади места приземления противнка спустя 0,7 секунд после применения Normal Punch. Иллюзия полностью контролируема. При появлении ей отдаётся приказ атаковать ударенного противника.",
        "Иллюзия полностью контролируема. При появлении ей отдаётся приказ атаковать ударенного противника.",
        "Эффекта удара и звуковые эффекты улучшаются, если преодоленное расстояние достигает отметки 300 и 900 единиц."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Normal Punch",
      "cooldown": null,
      "description": "Дарует Normal Punch. Пассивная способность с перезарядкой. Следующая атака по вражескому герою создаст его иллюзию, оглушит, нанесёт дополнительный урон и оттолкнёт. Сила эффекта зависит от того, какое расстояние герой преодолел за 3 секунды до атаки. При расстоянии в 900 достигается максимальный эффект: 3 секунды оглушения, 250 урона и толчок на расстояние в 350. Иллюзия живёт 5. Перезарядка: 14.",
      "hot_key": null,
      "params": [
        "Время: 3",
        "Расстояние для макс. эффекта: 900",
        "Мин. расстояние толчка: 50",
        "Макс. расстояние толчка: 350",
        "Мин. урон: 10",
        "Макс. урон: 250",
        "Мин. длительность оглушения: 0,2",
        "Макс длительность оглушения: 2,25",
        "Количество иллюзий: 1",
        "Наносимый иллюзией урон: 80%",
        "Получаемый иллюзией урон: 200%",
        "Задердка перед появлением иллюзии: 0,7",
        "Длительность иллюзии: 5",
        ""
      ],
      "legacy_key": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e2\/Wall_of_Replica.mp3\/revision\/latest?cb=20141212143710",
      "effects": [
        "Способность Направленная на точку \/ Направленная по вектору",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Значения для стены устанавливаются при создании и не обновляются при поднятии уровня заклинания во время действия способности.",
        "Стена создает только одну иллюзию для каждого игрока. То есть, при нескольких стенах (от таланта или нескольких использований) каждая из них создает отдельную иллюзию врага. Также для врагов с несколькими героями (клоны Divided We Stand и Tempest Double) количество иллюзий ограничено одной за каждую стену. Даже если иллюзия будет приручена Enchant, то стена не создаст новую для данного героя.",
        "То есть, при нескольких стенах (от таланта или нескольких использований) каждая из них создает отдельную иллюзию врага.",
        "Также для врагов с несколькими героями (клоны Divided We Stand и Tempest Double) количество иллюзий ограничено одной за каждую стену.",
        "Даже если иллюзия будет приручена Enchant, то стена не создаст новую для данного героя.",
        "Создает иллюзии только из героев. Не создает иллюзии с иллюзий. Может создать иллюзии клонов Divided We Stand и Tempest Double, но не Wukong's Command. Создает иллюзии неуязвимых врагов, но не спрятанных. К неуязвимым замедление не применяется.",
        "Может создать иллюзии клонов Divided We Stand и Tempest Double, но не Wukong's Command.",
        "Создает иллюзии неуязвимых врагов, но не спрятанных. К неуязвимым замедление не применяется.",
        "При появлении иллюзия автоматически получает приказ атаковать героя, создавшего её.",
        "При смерти иллюзии стена может создать новую как только герой появится в радиусе действия.",
        "Убийство иллюзии от Wall of Replica даёт фиксированные 5 золота и очков опыта, которые не увеличиваются с повышением уровня способности.",
        "Время жизни иллюзий основано на оставшейся длительности стены, из которой они были созданы.",
        "Иллюзии появляются в 108 единицах от героя, если размер столкновения равен 24 единицам и в 72, если размер столкновения равен 8. Иллюзия появляется с одной из сторон(сверху, слева, снизу или справа).",
        "Иллюзии от Wall of Replica визуально различимы для врагов.",
        "Замедление постоянно применяется по всей области стены. Если стены накладываются друг на друга, то их замедления не складываются.",
        "При выборе таланта на создание параллельной стены, вторая стена располагается позади первой стены на расстоянии 600 единиц."
      ],
      "mana": "125\/250\/375",
      "item_behaviour": [],
      "name": "Wall of Replica",
      "cooldown": "100 (TagTalent 60)",
      "description": "Создает стену преломленного света, которая наносит урон и создает копии любого вражеского героя, проходящего сквозь нее. Копии врага служат Dark Seer. Копии пропадут, если их уничтожить или если закончится время действия стены.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0,73",
        "Дальность применения: 1300",
        "Количество стен: 1 (TagTalent 2)",
        "Длина стены: 1300 (TagAghanim 2600)",
        "Ширина стены: 50",
        "Расстояние до параллельной стены: 600",
        "Замедление скорости передвижения: 50%\/60%\/70%",
        "Иллюзии наносят урона: 70%\/85%\/100%",
        "Иллюзии получают урона: 200%",
        "Длительность: 45",
        "Длительность замедления: 1",
        "Дарует новую способность: Normal Punch.",
        "Создает иллюзии врагов с иммунитетом к заклинаниям, но не замедляет их."
      ],
      "legacy_key": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.1,
    "attrStrength": 20.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 1.8,
    "attrAgility": 18.0
  },
  "description": "Dark Seer — это герой с ближним типом атаки, основным атрибутом которого является интеллект. Первой способностью, Vacuum, герой создает вакуум в выбранной области, который втягивает в себя врагов и наносит им урон. Вторая способность, Ion Shell, окружает выбранную цель колючим щитом, наносящим урон всем врагам вокруг. Третьей способностью, Surge, герой увеличить скорость передвижения себя или союзника до максимума на некоторое время. Ультимативной способностью, Wall of Replica, герой создает стену, которая наносит урон и создает копии любого вражеского героя, проходящего сквозь нее. Копии врага служат Dark Seer. Копии пропадут, если их уничтожить или если закончится время действия стены. Улучшение с Aghanim's Scepter увеличивает урон, наносимый иллюзиями.",
  "history": "Стремительный в час нужды стратег Иш'Кафэль — расчётливый провидец, что обходится в бою без острых мечей: если нужно уничтожить противника, он полагается на мощь своего разума, мастерски направляя сражение в нужное русло. Сей воин пришёл из измерения вне граней реальности, которое он сам называет «миром за стеной». Когда-то Иш'Кафэль был великим военачальником своего народа и храбрым защитником святого короля Даматрикса, но в последние дни Великой войны Пределов его войско пало под натиском превосходящих сил. Поражение было неминуемо, но стратег совершил отчаянный поступок: он завёл армию врага в лабиринт меж стен. В последний миг Иш'Кафэль выскользнул из окружения и выпустил сокрушительную волну тёмной энергии, навеки заточив преследователей в лабиринте. Когда пыль улеглась, стратег увидел, что спас свой народ, однако сам он очутился под светилом иного мира, неспособный вернуться домой. Теперь Иш'Кафэль неуклонно проявляет свой военный гений, поклявшись показать себя величайшим тактиком из всех, что видел этот странный новый мир.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Surge применяется по области радиусом 350",
      "talentRight": "Параллельная Стена"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+50 к урону от Ion Shell",
      "talentRight": "−40 сек. перезарядки Wall of Replica"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+75 к радиусу Ion Shell",
      "talentRight": "+100 к радиусу Vacuum"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+6 к броне",
      "talentRight": "+20% к урону иллюзий от Wall of Replica"
    }
  ]
}