{
  "abilities": [
    {
      "notes": [
        "Талант на уклонение мультипликативно сочетается с другими источниками уклонения.",
        "Талант на броню не дается иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Surge применяется по области радиусом 400",
          "talentRight": "Параллельная Стена"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+60 к урону от Ion Shell",
          "talentRight": "+8 к броне"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 к радиусу Ion Shell",
          "talentRight": "+10 здоровья в секунду"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+60 к радиусу Vacuum",
          "talentRight": "+10% к уклонению"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Vacuum.mp3\/revision\/latest?cb=20141212143650",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Втягивание всегда происходит за 0.3\/0.4\/0.5\/0.6 секунды, поэтому не имеет значения, как далеко или близко существа находятся от центра способности, скорость втягивания будет варьироваться.",
        "Урон наносится после после потери дебаффа, то есть развеивание дебаффа нанесет урон раньше.",
        "Юниты под действием способностью обезврежены на всё время действия стягивания.",
        "Может затянуть существ на непроходимую территорию.",
        "Действует на невидимых и неуязвимых существ (за исключением Cyclone Eul's Scepter of Divinity), но не на спрятанных.",
        "Не действует на древних крипов и крипов-героев.",
        "При использовании Vacuum разрушает деревья на расстоянии 275 в выбранной точке после наложения дебаффа на врагов."
      ],
      "mana": "100\/130\/160\/190",
      "hotKey": "Q",
      "cooldown": "60\/50\/40\/30 (TagTalent 12)",
      "description": "Герой создаёт в выбранной области вакуум, который втягивает в себя врагов и наносит им урон.",
      "spellName": "Vacuum",
      "params": [
        "Анимация применения: 0,4+0,7",
        "Дальность применения: 450\/500\/550\/600",
        "Радиус: 400\/450\/500\/550 (TagTalent 500\/550\/600\/650)",
        "Урон: 50\/100\/150\/200",
        "Длительность втягивания: 0.3\/0.4\/0.5\/0.6",
        "Уменьшает перезарядку",
        "Пытается нанести урон, если враги применили иммунитет к заклинаниям до окончания втягивания."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Ишь-Кафэль создает центр притяжения в указанном месте."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Ion_Shell.mp3\/revision\/latest?cb=20141212143635",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Щит можно повесить на вражеских и союзных существ; урон наносится только вражеским. Существо с щитом не получает от него урон.",
        "Несколько применений щита на одного и того же юнита не складываются, но обновляют длительность и улучшают урон до текущего уровня способности. Если два героя из разных команд одновременно применяют щит на одну и ту же цель, то модификатор обновится и начнет наносить урон врагам последнего заклинателя. При этом статус модификатора не одновляется. Его состояние (бафф или дебафф) определяется при первом применении и не обновляется при повторном.",
        "Если два героя из разных команд одновременно применяют щит на одну и ту же цель, то модификатор обновится и начнет наносить урон врагам последнего заклинателя.",
        "При этом статус модификатора не одновляется. Его состояние (бафф или дебафф) определяется при первом применении и не обновляется при повторном.",
        "Наносит 2,4\/4,6\/6,8\/9 (TagTalent 8,4\/10,6\/12,8\/15) урона с интервалом в 0,1 секунду спустя 0,1 секунды после применения, срабатывая 250 раз.",
        "Может нанести до 600\/1150\/1700\/2250 (TagTalent 2100\/2650\/3200\/3750) единиц урона в одиночную цель (до уменьшений), если цель будет стоять в радиусе урона все время действия.",
        "Действует на невидимых существ, если они подойдут к щиту достаточно близко, но визуальные эффекты работать на них не будут.",
        "Нельзя применить на крипов-героев или курьеров.",
        "Выбор таланат на дополнительный урон мгновенно улучшит все активные модификаторы Ion Shell Dark Seer."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "W",
      "cooldown": "9",
      "description": "Окружает выбранную цель колючим щитом, наносящим урон всем врагам вокруг.",
      "spellName": "Ion Shell",
      "params": [
        "Анимация применения: 0,4+0,7",
        "Дальность применения: 600",
        "Радиус урона: 250",
        "Урон в секунду: 24\/46\/68\/90 (TagTalent 84\/106\/128\/150)",
        "Длительность: 25",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя применить на врагов с иммунитетом. Щит остается, если был применен до иммунитета и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Dark Seer создает дыры в «мир за стеной», заставляя призматическую энергию просачиваться наружу."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/75\/Surge.mp3\/revision\/latest?cb=20141212143641",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на область)",
        "Действует на Союзников"
      ],
      "notes": [
        "Применяет на цель ускорение, поэтому цель нельзя замедлить, пока эффект не спадет.",
        "Также позволяет цели проходить сквозь других юнитов и убирает ограничение скорости передвижения.",
        "Талант превращает Surge в заклинание, применяемое по области, поэтому способность больше нельзя применить напрямую на юнита. Применение на себя продолжает выбирать Dark Seer, считая его центром области.",
        "Применение на себя продолжает выбирать Dark Seer, считая его центром области."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "19\/16\/13\/10",
      "description": "Заряжает дружественное существо энергией, ненадолго увеличивающей скорость передвижения и позволяющей проходить сквозь существ. Цель может превысить стандартный максимум скорости, и её невозможно замедлить.",
      "spellName": "Surge",
      "params": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: 600",
        "Радиус применения: 0 (TagTalent 400)",
        "Доп. скорость передвижения: 250",
        "Длительность: 3\/4\/5\/6"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Однажды Ишь-Кафэль использовал скорость своего разума, чтобы преодолеть лабиринт между стенами."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e2\/Wall_of_Replica.mp3\/revision\/latest?cb=20141212143710",
      "effects": [
        "Способность Направленная на точку \/ Направленная по вектору",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Значения для стены устанавливаются при создании и не обновляются при поднятии уровня заклинания во время действия способности. При этом бонус от Aghanim's Scepter применяется мгновенно.",
        "При этом бонус от Aghanim's Scepter применяется мгновенно.",
        "Стена создает только одну иллюзию для каждого игрока. То есть, при нескольких стенах (от таланта или нескольких использований) каждая из них создает отдельную иллюзию врага. Также для врагов с несколькими героями (клоны Divided We Stand и Tempest Double) количество иллюзий ограничено одной за каждую стену. Даже если иллюзия будет приручена Enchant, то стена не создаст новую для данного героя.",
        "То есть, при нескольких стенах (от таланта или нескольких использований) каждая из них создает отдельную иллюзию врага.",
        "Также для врагов с несколькими героями (клоны Divided We Stand и Tempest Double) количество иллюзий ограничено одной за каждую стену.",
        "Даже если иллюзия будет приручена Enchant, то стена не создаст новую для данного героя.",
        "Создает иллюзии только из героев. Не создает иллюзии с иллюзий. Может создать иллюзии клонов Divided We Stand и Tempest Double, но не Wukong's Command. Создает иллюзии неуязвимых врагов, но не спрятанных. К неуязвимым замедление не применяется.",
        "Может создать иллюзии клонов Divided We Stand и Tempest Double, но не Wukong's Command.",
        "Создает иллюзии неуязвимых врагов, но не спрятанных. К неуязвимым замедление не применяется.",
        "При появлении иллюзия автоматически получает приказ атаковать героя, создавшего её.",
        "При смерти иллюзии стена может создать новую как только герой появится в радиусе действия.",
        "Убийство иллюзии от Wall of Replica дает фиксированные 5 золота и очков опыта, которые не увеличиваются с повышением уровня способности.",
        "Время жизни иллюзий основано на оставшейся длительности стены, из которой они были созданы.",
        "Иллюзии появляются в 108 единицах от героя, если область столкновения равна 24 единицам и в 72, если область столкновения равна 8. Иллюзия появляется с одной из сторон(сверху, слева, снизу или справа).",
        "Иллюзии от Wall of Replica визуально различимы для врагов.",
        "Замедление постоянно применяется по всей области стены. Если стены накладываются друг на друга, то их замедления не складываются.",
        "При выборе таланта на создание параллельной стены, вторая стена располагается позади первой стены на расстоянии 600 единиц."
      ],
      "mana": "125\/250\/375",
      "hotKey": "R",
      "cooldown": "100",
      "description": "Создает стену преломленного света, которая наносит урон и создает копии любого вражеского героя, проходящего сквозь нее. Копии врага служат Dark Seer. Копии пропадут, если их уничтожить или если закончится время действия стены.",
      "spellName": "Wall of Replica",
      "params": [
        "Анимация применения: 0,2+0,73",
        "Дальность применения: 1300",
        "Количество стен: 1 (TagTalent 2)",
        "Длина стены: 1300 (TagAghanim 2600)",
        "Ширина стены: 50",
        "Расстояние до параллельной стены: 600",
        "Замедление скорости передвижения: 50%\/60%\/70%",
        "Иллюзии наносят урона: 70%\/85%\/100%",
        "Иллюзии получают урона: 200%",
        "Длительность: 45",
        "Длительность замедления: 0.75",
        "Увеличивает длину стены.",
        "Создает иллюзии врагов с иммунитетом к заклинаниям, но не замедляет их."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Пусть Иш'Кафель и не в состоянии вернуться домой, силой своего разума он может призвать отрывок призматической стены, вызывая смятение в рядах врагов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.1,
    "attrStrength": 20.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 1.8,
    "attrAgility": 12.0
  },
  "description": "Dark Seer — это герой с ближним типом атаки, основной характеристикой которого является интеллект. Первой способностью, Vacuum, герой создает вакуум в выбранной области, который втягивает в себя врагов и наносит им урон. Вторая способность, Ion Shell, окружает выбранную цель колючим щитом, наносящим урон всем врагам вокруг. Третьей способностью, Surge, герой увеличить скорость передвижения себя или союзника до максимума на некоторое время. Ультимативной способностью, Wall of Replica, герой создает стену, которая наносит урон и создает копии любого вражеского героя, проходящего сквозь нее. Копии врага служат Dark Seer. Копии пропадут, если их уничтожить или если закончится время действия стены. Улучшение с Aghanim's Scepter увеличивает урон, наносимый иллюзиями.",
  "history": "Стремительный в час нужды стратег Иш'Кафэль — расчётливый провидец, что обходится в бою без острых мечей: если нужно уничтожить противника, он полагается на мощь своего разума, мастерски направляя сражение в нужное русло. Сей воин пришёл из измерения вне граней реальности, которое он сам называет «миром за стеной». Когда-то Иш'Кафэль был великим военачальником своего народа и храбрым защитником святого короля Даматрикса, но в последние дни Великой войны Пределов его войско пало под натиском превосходящих сил. Поражение было неминуемо, но стратег совершил отчаянный поступок: он завёл армию врага в лабиринт меж стен. В последний миг Иш'Кафэль выскользнул из окружения и выпустил сокрушительную волну тёмной энергии, навеки заточив преследователей в лабиринте. Когда пыль улеглась, стратег увидел, что спас свой народ, однако сам он очутился под светилом иного мира, неспособный вернуться домой. Теперь Иш'Кафэль неуклонно проявляет свой военный гений, поклявшись показать себя величайшим тактиком из всех, что видел этот странный новый мир.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Surge применяется по области радиусом 400",
      "talentRight": "Параллельная Стена"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+60 к урону от Ion Shell",
      "talentRight": "+8 к броне"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 к радиусу Ion Shell",
      "talentRight": "+10 здоровья в секунду"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+60 к радиусу Vacuum",
      "talentRight": "+10% к уклонению"
    }
  ]
}