{"abilities":[{"spell":"Visage вытягивает скорость передвижения и атаки цели, прибавляя эти показатели к своим.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя"],"notes":["Замедление и бонус к скорости действуют отдельно друг от друга. Grave Chill не вытягивает скорость буквально. То есть скорость передвижения Visage увеличивается на 32%, когда скорость цели снижается на 32%, и каждый показатель основывается на собственном значении скорости передвижения. То же самое относится и к скорости атаки. Скорость атаки Visage увеличивается на 64, когда скорость атаки цели снижается на 64. Также потеря баффа или дебаффа одним не означает их потерю у другого.","Бафф для гаргулий - не аура. Он размещается в виде отдельного баффа для каждой гаргульи вместе с их собственной длительностью. То есть после применения гаргульи могут удаляться от Visage и при этом сохранять бафф. Также при развеивании баффа с Visage у гаргулий он не исчезает, но его можно развеять с них по отдельности.","Цель получает только один дебафф вне зависимости от того, сколько гаргулий, помимо Visage, получили бафф.","Дает бафф неуязвимым юнитам, поэтому гаргульи в форме Stone Form также его получают."],"mana":"90","elements":["Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/14\/12\/10","name":"Grave Chill","description":["Анимация применения: 0,2+0,57","Дальность применения: 625 ( 725)","Радиус аура для гаргулий: 1200","Высасываемая скорость передвижения: 32%","Высасываемая скорость атаки: 64","Длительность: 3\/4\/5\/6"],"hot_key":"Q","legacy_key":"G"},{"spell":"Visage получает по заряду каждый раз, когда урон, нанесенный героям неподалеку, превышает 110. При высвобождении наносит урон выбранной цели, увеличивающийся с каждым полученным зарядом.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Снаряд Soul Assumption летит со скоростью в 1000 единиц.","Каждое получение героям урона сохраняется 6 секунд или до использования способности. Когда общее количество учтенного урона превышает границу, то к способности добавляется заряд.","Для получения максимального количества зарядов требуется за 6 секунд зафиксировать 330\/440\/550\/660 единиц урона.","Учитывает только тот урон, который наносится игроками (включая их призываемых существ или Рошана).","Учитывает только урон, полученный героями (исключая иллюзии и крипов-героев).","Не учитывает наносимый себе урон или урон меньше 2 единиц или превышающий 3000 единиц (после учета сопротивления).","Текущее количество зарядов отображается в виде желтых делений над Visage. Они видны только Visage и его союзникам.","Визуальное оформление снаряда также отображает количество зарядов, раскрывая то, сколько примерно урона нанесет снаряд.","При использовании Soul Assumption её урон фиксируется, а заряды считаются потраченными при запуске снаряда.","С 0\/1\/2\/3\/4\/5\/6 зарядами Soul Assumption может нанести 20\/85\/150\/215\/280\/345\/410 ( 20\/105\/190\/275\/360\/445\/530) единиц урона по цели (до учета сопротивления).","При выборе таланта на 15-ом уровне заклинание запускает второй снаряд в случайную видимую подходящую цель в радиусе применения. Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цель на расстоянии до 1200 ( 1300) единиц. Не может отметить основную цель вторым снарядом, поэтому, если поблизости нет других целей, ничего не произойдет. У героев и иллюзий приоритет выше, чем у остальных юнитов. Считает крипов-героев за крипов. Поскольку талант использует дальность применения заклинания, то эффекты увеличения дальности действия увеличивают дальность второго снаряда."],"mana":"170\/160\/150\/140","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"4","name":"Soul Assumption","description":["Анимация применения: 0,2+0,57","Дальность применения: 900 ( 1000)","Радиус сбора зарядов: 1375","Доп. расстояние для поиска вторичной цели:: 300","Количество целей: 1 ( 2)","Урон для заряда: 110","Максимально зарядов: 3\/4\/5\/6","Базовый урон: 20","Урон за заряд: 65 ( 85)","Срок действия заряда: 6"],"hot_key":"W","legacy_key":"C"},{"spell":"Visage создаёт слоистый барьер, который защищает его от всех типов урона, включая чистый. Если герой получает урон от игрока, один слой исчезает, и затем восстанавливается спустя определенное время.","effects":["Способность Пассивная \/ Аура","Действует на Себя"],"notes":["Уменьшение урона снижает урон от всех трех типов урона за исключением урона, отмеченного как отнимающий здоровье.","Снижает урон только в случае, если он превышает 40 (после учета всех сопротивлений). Урон ниже этого значения способностью игнорируется.","Реагирует только на урон, наносимый игроками, за исключением наносимого себе.","Здесь указано, сколько уменьшения урона дает каждый слой на каждом уровне: Уровень 1: 8%\/16%\/24%\/32% общего уменьшения урона. Уровень 2: 12%\/24%\/36%\/48% общего уменьшения урона. Уровень 3: 16%\/32%\/48%\/64% общего уменьшения урона. Уровень 4: 20%\/40%\/60%\/80% общего уменьшения урона.","Аура влияет на всех гаргулий под контролем Visage. Аура дает им уменьшение урона, основанное на текущем количестве зарядов у Visage.","Бафф от ауры задерживается на 0.5 секунды."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Gravekeeper's Cloak","description":["Радиус ауры: 1200","Максимум слоев: 4","Сопротивление за слой: 8%\/12%\/16%\/20%","Минимальный порог урона: 40","Время восстановления слоя: 6\/5\/4\/3 ( 4\/3\/2\/1)","Длительность задержки ауры: 0.5"],"hot_key":"E","legacy_key":"V"},{"spell":"Призывает двух слепых гаргулий, которые будут сражаться на стороне Visage. Гаргульи имеют высокую силу атаки, но, атакуя, расходуют заряды урона, которые медленно восстанавливаются. Гаргульи имеют способность Stone Form, которая позволяет им превращаться в камень, оглушая врагов при приземлении. В форме камня гаргульи неуязвимы и быстро восстанавливают здоровье. За убийство гаргулий враг получает значительную награду.","effects":["Способность Ненаправленная","Урон Физический"],"notes":["При использовании Summon Familiars прерывает произносимые способности Visage.","Использование способности заменяет существующих гаргулий вновь призванными.","Гаргульи призываются в 200 единицах перед Visage с расстоянием между ними в 120 единиц. Visage считается за центр расположения.","Гаргульи не активируют и не получают урон от Proximity Mines.","Урон, здоровье и броня обновляются только при повторном призыве, а не при повышении уровня способности. Уровень Stone Form также обновляется только при повторном призыве.","Гаргульи - крипы-герои и древние крипы, поэтому некоторые заклинания взаимодействуют с ними иначе."],"mana":"150","elements":[],"cooldown":"160\/145\/130","name":"Summon Familiars","description":["Анимация применения: 0+0","Количество гаргулий: 2 ( 3) ( 3, 4)","Длительность гаргулей: Бесконечно"],"hot_key":"R","legacy_key":"T"},{"spell":"После небольшой задержки гаргулья обращается в камень и падает на землю, оглушая врагов в небольшой области и нанося им урон. По приземлении она становится неуязвимой и очень быстро восстанавливает здоровье. Через 6 сек. гаргулья возвращается в обычное состояние.","effects":["Способность Ненаправленная"],"notes":["При использовании Stone Form не прерывает произносимые способности Visage.","Способность неактивна, если ни у одной из гаргулий нет возможности активировать Stone Form. Способность уходит на перезарядку, равную меньшему значению Stone Form у гаргулий. Перезарядка не может ничем снижена; она периодически проверяет наличие активной Stone Form. То есть при повторном призыве гаргулий вспомогательная способность будет мгновенно готова.","При использовании отдает приказ ближайшей гаргульи автоматически войти в форму Stone Form.","Несмотря на то, что при ручном использовании на способность гаргулий Stone Form реагируют эффекты, срабатывающие от применения, на способность героя эти эффекты не реагируют, поскольку она - вспомогательная.","Можно использовать при оглушении, сне, исчезновении, действии урагана, провокации или принудительного движения.","Нельзя использовать при безмолвии, проклятии или действии эффектов, предотвращающих действия. Нельзя поставить в очередь действий."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Stone Form","description":["Анимация применения: 0+0"],"hot_key":"D","legacy_key":"F"},{"spell":"После небольшой задержки гаргулья обращается в каменную форму и падает на землю, оглушая врагов в небольшой области и нанося им урон. По приземлении она станет неуязвимой и очень быстро восстановит здоровье и заряды урона. Через 6 секунд гаргулья вернется в обычное состояние.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя"],"notes":["Во время эффекта задержки, гаргульи обездвижены и разоружены, что предотвращает их движение и атаку.","После эффекта задержки регенерация здоровья гаргулий сильно возрастает, а сами юниты становятся неуязвимыми и обезвреженными.","Оглушение и урон по области применяются сразу же после задержки эффекта.","Расположение области оглушения и урона определяется при посадке, а не при использовании способности.","После приземления деревья вокруг гаргулий разрушаются.","Stone Form сначала применяет дебафф, затем наносит урон.","Когда гаргулья умирает во время задержки эффекта, область урона и оглушения не применяется, но визуальные эффекты всё равно появляются.","Длительность окаменения показывается жёлтыми цифрами над гаргульей. Эти цифры видны только Visage."],"mana":"0","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14","name":"Stone Form","description":["Анимация применения: 0+0","Радиус эффекта: 350","Задержка эффекта: 0,55","Доп. регенерация здоровья: 150\/175\/200","Базовый урон: 60\/100\/140","Длительность оглушения: 1\/1,25\/1,5","Длительность окаменения: 6"],"hot_key":"Q","legacy_key":"F"}],"bio":"Над входом в Узкий лабиринт восседают жуткие фигуры насмешливых гаргулий, и путь навеки попавших в этот мир лежит под их пристальным взглядом. Звери и птицы, люди и чудища — все существа, что умирают или проникают в мир иной, обязательно минуют их пост. Отделённый от тела дух, решив однажды пройти сквозь смертную завесу, уже не может вернуться обратно. Но если случается так, что силой или хитростью некая беспокойная душа покидает ад или небеса, то ужасающая гаргулья — воплощённая форма вечного духа по имени Некро'лик — отправляется за беглецом, чтобы вернуть его. Беспощадный и безупречный, неподвластный смерти и усталости, каменный страж без сожаления и остановки преследует добычу, охотно уничтожая любого, кто приютит беглеца. Тот, кто следит за порядком в загробном мире, не знает покоя, и хотя мертвых иногда воскрешают, он найдёт и вернёт каждого на своё место.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["При убийстве Keeper of the Light, Visage может сказать такую фразу Играть «You shall not pass!», что является отсылкой к фразе Гэндальфа в фильме «Властелин Колец: Братство Кольца». Данная фраза и фразы Keeper of the Light говорят о схожести героя к персонажу Гэндальфа.","Согласно биографии, Visage и Razor являются сторожами в Узком Лабиринте.","Судя по биографии и репликам, Visage — отсылка к существу из греческой мифологии Харону. Поскольку именно Харон выполнял функцию «перевозки душ» в царство Аида, и нечто схожее совершает Visage. Что касается фамильяров, то это, возможно, отсылка к Керам. Существам, помогавшим умерщвлять смертных на поле боя. А Razor это отсылка к Церберу — трёхглавому псу, охраняющему выход из царства Аида. Иными словами, Узкий Лабиринт — это интерпретация царства Аида. Играть Once a mortal passes beyond the veil, they may never return."],"talents":["+1 Гаргулья:-2 сек. к перезарядке Gravekeeper's Cloak","+50 к скорости передвижения Гаргулий:+20 к урону за заряд Soul Assumption","Soul Assumption наносит урон по двум целям:+40% к получаемому опыту","+30 к урону:+100 к дальности способностей"],"tips":["Soul Assumption: Количество душ увеличивается на 1 за каждые 110 единиц урона полученные героями в радиусе 1375 от Visage. Счётчик душ увеличивается уроном от 2 до 3000, нанесенным героем или Рошаном, и не увеличивается нанесённым уроном по себе или уроном Soul Assumption. Каждая душа, по мере того, когда она появилась, исчезнет через 6 секунд после её получения, если её не использовать. От снаряда нельзя уклониться невидимостью и телепортацией или использованием Blink Dagger. Когда использована способность, запускает снаряд в цель, урон которого будет рассчитываться от 20+60 * (кол. душ). Когда она летит, снаряд движется со скоростью 1000.","Summon Familiars: Гаргульи не получают урон от Battle Fury, Psi Blades. Остальные же работают только на окружающих рядом или позади их."],"desc":"Visage — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность героя Grave Chill вытягивает скорость передвижения и атаки цели, прибавляя эти показатели к своим. Второй способностью Soul Assumption Visage наносит цели урон, зависящий от числа накопленных душ. Каждый раз, когда нанесённый всем юнитам вокруг урон превышает определённую границу, Visage накапливает одну душу. Пассивной способностью Gravekeeper's Cloak Visage создаёт барьер, который защищает его как от физического, так и от магического урона. Ультимативной способностью Summon Familiars Visage призывает двух гаргулий, которые будут сражаться на стороне Visage. Гаргульи имеют способность Stone Form, которая позволяет им превращаться в камень, оглушая врагов при приземлении. В форме камня гаргульи неуязвимы и быстро восстанавливают своё здоровье Улучшение с Aghanim's Scepter позволяет призывать трех гаргулий."}