{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+280 к лечению от Hand of God",
          "talentRight": "+3 заряда Holy Persuasion, +3 к максимуму существ."
        },
        {
          "talentLvl": "20",
          "talentLeft": "+800 к мин. здоровью крипов от Holy Persuasion",
          "talentRight": "-24 сек. перезарядки Hand of God"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+12% к замедлению от Penitence",
          "talentRight": "+16 к доп. урону от атак у Holy Persuasion"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+175 к здоровью",
          "talentRight": "+175 к дальности заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Penitence.mp3\/revision\/latest?cb=20141207200310",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1400 единиц.",
        "Любой союзный юнит, атакующий врага, получает бафф скорости. Бафф дается при начале атаки.",
        "После получения бафф остается на всю длительность, поэтому его можно использовать при атаке других целей.",
        "Бафф скорости дается любому союзному юниту, включая строения и варды."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "Q",
      "cooldown": "14\/13\/12\/11",
      "description": "Заставляет вражеское существо передвигаться медленнее, а союзников — атаковать его быстрее.",
      "spellName": "Penitence",
      "params": [
        "Анимация применения: 0,3+0,77",
        "Дальность применения: 800 (TagTalent 975)",
        "Замедление скорости передвижения цели: 18%\/24%\/30%\/36% (TagTalent 30%\/36%\/42%\/48%)",
        "Доп. скорость атаки союзникам: 30\/60\/90\/120",
        "Длительность дебаффа: 5\/6\/7\/8",
        "Длительность баффа: 2",
        "Замедление и увеличение скорости атаки остаются, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется при использовании."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Пусть рыцарь веры и не способен подчинять вражеских героев, как свою животную паству, сила его убеждения вполне может пошатнуть решимость противника."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e7\/Holy_Persuasion.mp3\/revision\/latest?cb=20141207200246",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских существ",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Применяет на цель базовое развеивание, снимая положительные и отрицательные эффекты.",
        "Если новый приручаемый крип превысит максимальное количество подчиненных крипов, самый ранний из прирученных (включая древних крипов) умрет. Если при приручении древнего крипа превышено максимальное количество крипов, самый ранний из древних крипов умрет. Смерть крипов никому не засчитывается, поэтому опыт за них никто не получает.",
        "Если при приручении древнего крипа превышено максимальное количество крипов, самый ранний из древних крипов умрет.",
        "Смерть крипов никому не засчитывается, поэтому опыт за них никто не получает.",
        "Может подчинить любого крипа в пределах доступного уровня, включая призываемых существ, но исключая Рошана, катапульты и крипов-героев.",
        "Если максимальный запас здоровья крипа ниже значения способности, текущее здоровье и показатель максимального увеличивается до значения способности. Увеличение здоровья не считается за лечение, оно просто меняет значение здоровья юнита. Здоровье у уже подчиненных крипов не увеличивается с поднятием уровня способности или выбором таланта на поднятие значения минимального здоровья.",
        "Увеличение здоровья не считается за лечение, оно просто меняет значение здоровья юнита.",
        "Здоровье у уже подчиненных крипов не увеличивается с поднятием уровня способности или выбором таланта на поднятие значения минимального здоровья.",
        "Восстанавливает всю ману крипа.",
        "Улучшение от Aghanim's Scepter позволяет подчинять древнего крипа за каждый уровень Hand of God. Древние крипы учитываются в общее количество подчиняемых крипов, поэтому улучшение не позволит иметь больше крипов, чем позволяет способность. Можно применить на древних крипов без изученного Hand of God, но способность не сработает, потратит ману и уйдет на перезарядку. Талант не увеличивает количество древних крипов, которых Chen может приручить.",
        "Древние крипы учитываются в общее количество подчиняемых крипов, поэтому улучшение не позволит иметь больше крипов, чем позволяет способность.",
        "Можно применить на древних крипов без изученного Hand of God, но способность не сработает, потратит ману и уйдет на перезарядку.",
        "Талант не увеличивает количество древних крипов, которых Chen может приручить.",
        "Может телепортировать только крипов, подчинённых этой способностью. Не телепортирует других существ под контролем Chen. При телепортации позволяет избежать снарядов. Не может выбрать целью неуязвимых или спрятанных союзников, но телепортирует их, если они получат эффекты после применения способности. Место появления основано на положении Chen при телепортации, союзник появляется в 120 единицах на севере, западе, юге или востоке от героя. Самый первый союзник появляется возле Chen в случайном месте, остальные союзники появляются против часовой стрелки. Если Chen умер при завершении длительности баффа, то телепортация не произойдет. Урон, превышающий 0 (до учета снижений), от любого игрока (включая союзников, но исключая себя) или Рошана, развеивает эффект. Отдает цели команду \"стоп\" после телепортации, отменяя её произносимые способности и текущие приказы действия. В отличии от необходимости выбора союзника напрямую для телепортации, применение на себя выбирает неуязвимых и спрятанных юнитов.",
        "При телепортации позволяет избежать снарядов.",
        "Не может выбрать целью неуязвимых или спрятанных союзников, но телепортирует их, если они получат эффекты после применения способности.",
        "Место появления основано на положении Chen при телепортации, союзник появляется в 120 единицах на севере, западе, юге или востоке от героя.",
        "Самый первый союзник появляется возле Chen в случайном месте, остальные союзники появляются против часовой стрелки.",
        "Если Chen умер при завершении длительности баффа, то телепортация не произойдет.",
        "Урон, превышающий 0 (до учета снижений), от любого игрока (включая союзников, но исключая себя) или Рошана, развеивает эффект.",
        "Отдает цели команду \"стоп\" после телепортации, отменяя её произносимые способности и текущие приказы действия.",
        "В отличии от необходимости выбора союзника напрямую для телепортации, применение на себя выбирает неуязвимых и спрятанных юнитов."
      ],
      "mana": "90\/110\/130\/150",
      "hotKey": "W",
      "cooldown": "15 (TagTalent 0)",
      "description": "Подчиняет вражеского или нейтрального крипа, увеличивая его скорость передвижения и урон. Если его максимальный запас здоровья ниже определённого порога, то здоровье существа увеличится до этого значения.",
      "spellName": "Holy Persuasion",
      "params": [
        "Анимация применения: 0,3+0,77",
        "Дальность применения: 600 (TagTalent 775)",
        "Дальность применения телепортации: Глобальная",
        "Максимум существ: 1\/2\/3\/4 (TagTalent 4\/5\/6\/7)",
        "Минимальное базовое здоровье: 700\/800\/900\/1000 (TagTalent 1500\/1600\/1700\/1800)",
        "Доп. скорость передвижения: 10\/15\/20\/25",
        "Доп. урон: 8\/16\/24\/32 (TagTalent 24\/32\/40\/48)",
        "Макс. уровень приручаемых крипов: 3\/4\/5\/6",
        "Задержка до телепортации: 6",
        "Число зарядов: 0 (TagTalent 3)",
        "Время восстановления: 0 (TagTalent 15)",
        "Позволяет приручать древних крипов в количестве, равном уровню ульта."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Пусть они и не рыцари, пастырь обращает диких зверей в единоверцев так же, как когда-то был обращён сам."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Chen_Divine_Favor.mp3\/revision\/latest?cb=20191216012059",
      "effects": [
        "Способность Аура (TagAghanim Направленная на существо)",
        "Действует на Союзников"
      ],
      "notes": [
        "Аура действует только на союзных героев (включая иллюзии и клонов, исключая крипов-героев) и юнитов, подконтрольных Chen.",
        "Бафф ауры задерживается на 0 секунды.",
        "К регенерации здоровья также применяется усиление лечения.",
        "Аура восстанавливает до 75\/150\/225\/300 здоровья в минуту, (79,5\/165\/256,5\/354 с учётом усиление лечения от Divine Favor).",
        "При улучшении с Aghanim's Shard, получает активную способность. Пассивный компонент способности всё ещё присутствует. Может телепортировать любое союзное существо, подконтрольного крипа и линейных крипов. Не может быть применена на себя. Не может выбрать целью неуязвимых или спрятанных союзников, но телепортирует их, если они получат эффекты после применения способности. Не развеивается при получении урона, в отличие от способности Holy Persuasion. Сам же эффект можно развеять нормальным развеиванием. После телепортации существо появляется перед союзным фонтаном. Отдает цели команду \"стоп\" после телепортации, отменяя её произносимые способности и текущие приказы действия. При телепортации позволяет избежать снарядов.",
        "Может телепортировать любое союзное существо, подконтрольного крипа и линейных крипов. Не может быть применена на себя.",
        "Не может выбрать целью неуязвимых или спрятанных союзников, но телепортирует их, если они получат эффекты после применения способности.",
        "Не развеивается при получении урона, в отличие от способности Holy Persuasion. Сам же эффект можно развеять нормальным развеиванием.",
        "После телепортации существо появляется перед союзным фонтаном.",
        "Отдает цели команду \"стоп\" после телепортации, отменяя её произносимые способности и текущие приказы действия.",
        "При телепортации позволяет избежать снарядов."
      ],
      "mana": "0 (TagTalent 200)",
      "hotKey": "E",
      "cooldown": "0 (TagTalent 35)",
      "description": "Дарует герою пассивную ауру, которая увеличивает восстановление здоровья и всё получаемое лечение.",
      "spellName": "Divine Favor",
      "params": [
        "Дальность применения телепортации: 0 (TagTalent 500)",
        "Радиус ауры: 1200",
        "Доп. восстановление здоровья: 1,25\/2,5\/3,75\/5",
        "Усиление лечения: 6%\/10%\/14%\/18%",
        "Длительность задержки ауры: 0.5",
        "Задержка до телепортации: 0 (TagTalent 6)",
        "Позволяет применить способность на союзника, чтобы телепортировать его к фонтану после задержки в 6 секунд. Нельзя применять на союзников, невосприимчивых к магии. Дальность применения: 500"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Заразный фанатизм Чена привлекает сторонников и наполняет их силой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f6\/Hand_of_God.mp3\/revision\/latest?cb=20141207200225",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Все существа под контролем Chen получают лечение, включая его иллюзии, призываемых существ и прирученных или подчиненных юнитов.",
        "Не лечит любых союзных существ не-героев или иллюзий за исключением клонов героев.",
        "Может вылечить союзников, если они неуязвимы или спрятаны.",
        "Фраза героя, проигрываемая при использование, слышна всем союзникам, но не врагам."
      ],
      "mana": "250\/350\/450",
      "hotKey": "R",
      "cooldown": "160\/140\/120 (TagTalent 136\/116\/96)",
      "description": "Лечит всех союзных героев и подконтрольных крипов.",
      "spellName": "Hand of God",
      "params": [
        "Анимация применения: 0,3+0,93",
        "Дальность: Глобальная",
        "Лечение: 250\/425\/600 (TagTalent 530\/705\/880)",
        "Макс. древних крипов: 0 (TagAghanim 1\/2\/3)"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Используя ментальную связь со своими рабами, рыцарь веры поддерживает здоровье и хорошее самочувствие всех, кто разделяет его фанатизм."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 25.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 3.2,
    "attrAgilityInc": 2.1,
    "attrAgility": 15.0
  },
  "description": "Chen — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Игра за данного героя уникальна, требует внимания и взаимодействия с союзниками. Первая способность, Penitence, накладывает на противника заклинание, которое замедляет его скорость передвижения, а также увеличивает скорость атаки союзников по нему. Способностью Divine Favor увеличивает восстановление здоровья, всё получаемое лечение и урон от атак союзника. Holy Persuasion - способность, позволяющая переманить любого лесного или вражеского крипа на свою сторону и управлять им; это позволяет герою на первом уровне отправляться в лес и получать там опыт; при использовании на союзного героя или подчинённого крипа телепортирует его к себе, что позволяет спасти союзника или устроить засаду врагам. Ультимативной способностью, Hand of God, герой излечивает всех союзников на карте на определённое количество здоровья.",
  "history": "Рождённый в безбожных Хажадальских пустошах, Чен вырос среди разбойных племён, скрывающихся от остального мира в сияющих песках пустыни. Пользуясь древним знанием о приручении животных, его народ разводил локати — низкорослых подземных драконов, выжигающих в песке стеклянные туннели, дважды в год наполнявшиеся дождевой водой. Из-за постоянного голода и жажды племена постоянно враждовали между собой. И однажды Чен совершил непростительную ошибку, напав не на тот караван. В той жестокой схватке его клан был повержен. Облачённые в доспехи рыцари Покрова в два счёта расправились с порабощёнными локати, что нападали и умирали один за другим. Вслед за драконами пали и члены клана. Чен боролся, бился и дрался не на жизнь, а на смерть... Но ему была уготована иная участь. Поверженный, он стоял на коленях и смиренно ждал казни. Восхищённый храбростью юнца, палач убрал свой клинок. Ему пообещали даровать жизнь, если он примет веру. Чен со всей душой ухватился за эту возможность. Он присоединился к рыцарям и в кровавых проповедях заслужил себе доспехи. Теперь же с непоколебимой верой и превосходным умением приручать животных он выискивает неверных и вершит над ними последний суд.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+280 к лечению от Hand of God",
      "talentRight": "+3 заряда Holy Persuasion, +3 к максимуму существ."
    },
    {
      "talentLvl": "20",
      "talentLeft": "+800 к мин. здоровью крипов от Holy Persuasion",
      "talentRight": "-24 сек. перезарядки Hand of God"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+12% к замедлению от Penitence",
      "talentRight": "+16 к доп. урону от атак у Holy Persuasion"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+175 к здоровью",
      "talentRight": "+175 к дальности заклинаний"
    }
  ]
}