{
  "abilities": [
    {
      "notes": [
        "Снаряд летит со скоростью 1650 ищет врагов или деревья за спиной цели в пределах 46° от места, откуда он был запущен\n Если Windranger меняет местоположение после применения, то координаты Shackleshot учитывают не текущее местоположение, а то, откуда была запущена способность\n Область поиска представляет собой треугольник с высотой 575\n Две стороны треугольника равны 624,66, основание — 488,15",
        "Приоритет существ в качестве вторичной цели выше, чем приоритет деревьев\n Вторичной целью является самое дальнее существо или дерево\n Если основная цель умрёт раньше, чем её достигнет снаряд, он все равно зацепит и оглушит вторичное существо\n Может задеть невидимых существ и существ в тумане войны",
        "Если цель не связывается, то способность кратковременно оглушает её на 0,75 сек\n (используя базовый дебафф «Оглушение»)\n Если цель привязана к существу, они оба будут оглушены на 2\/2,6\/3,2\/3,8 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2,8\/3,4\/4\/4,6) сек\n (используя дебафф Shackle Shot)\n Оглушение сохраняется, если одно из существ преждевременно умерло или дерево разрушилось\n Оглушение сохраняется, если одно из существ освобождается от оглушения раньше",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Увеличивающий длительность оглушения <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> талант влияет только на длительность оглушения при успехе, но не при неудаче"
      ],
      "item_behaviour": [],
      "description": "Связывает цель с находящимся позади неё врагом или деревом. Если цель не будет с чем-либо связана, длительность оглушения сократится до 0,75 сек.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,15+0,45",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 800",
        "Радиус связки: 575",
        "Угол поиска связки: 46°",
        "Максимальное кол-во целей: 2",
        "Оглушение при успехе: 2\/2,6\/3,2\/3,8 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2,8\/3,4\/4\/4,6)",
        "Оглушение при неудаче: 0,75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Windranger_Shackleshot_1.mp3\/revision\/latest?cb=20191216030602",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "16\/14\/12\/10 (TagTalent 14\/12\/10\/8)",
      "aghanim": null,
      "name": "Shackleshot",
      "cooldown": "70\/80\/90\/100",
      "legacy_key": "E",
      "story": "Мастерство владения луком позволяет Лиралей выпустить стрелу с толстой верёвкой, которая не даст жертве вырваться."
    },
    {
      "notes": [
        "Стрела летит со скоростью 3000, достигая максимального расстояния за 0,87 сек\n Даёт летающий обзор в радиусе 400 во время полёта\n Обзор задерживается в конечной точке на 3,34 секунды\n Наносит урон существу на расстоянии до 2725 (складывается из дальности прохождения и радиуса урона)\n Уничтожает деревья в радиусе 50 во время полёта\n Попадание в дерево не снижает урон",
        "Макс\n урон наносится после 1 сек\n произнесения\n За каждые тик сервера произнесения урон увеличивается на 5\/8,33\/11,67\/15\n Звук натягивания тетивы лука во время произнесения слышен только союзникам",
        "За каждого задетого врага урон стрелы уменьшается на 20% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 5%)\n О том, сколько урона нанесёт стрела при полном произнесении, а также с <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> талантом на снижение урона за попадание по существу (до уменьшения), обратитесь к таблице ниже\n Чтобы урон стрелы достиг 1, ей нужно поразить 23\/25\/27\/28 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 98\/108\/115\/120) существ"
      ],
      "item_behaviour": [],
      "description": "Герой заряжает лук, чтобы совершить мощный выстрел. Стрела наносит урон врагам. Урон увеличивается по мере зарядки, которая длится не более 1 сек., и снижается с каждым задетым врагом.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 2600",
        "Дальность прохождения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 2600",
        "Радиус урона: 125",
        "Макс\n время произнесения: 1",
        "Макс\n урон: 150\/250\/350\/450",
        "Уменьшение урона за попадание по существу: 20% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 5%)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Windranger_Powershot_1.mp3\/revision\/latest?cb=20191216030558",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "12\/11\/10\/9",
      "aghanim": null,
      "name": "Powershot",
      "cooldown": "90\/100\/110\/120",
      "legacy_key": "R",
      "story": "В ранние годы своих тренировок Лиралей научилась стрелять мощными стрелами, которые на пути к своей цели пробивают даже деревья."
    },
    {
      "notes": [
        "При применении прерывает произносимые заклинания Windranger",
        "Даёт Windranger 100% уклонения на всю длительность",
        "Замедление и ослепление предоставляются аурой, исходящей от Windranger\n Её дебафф задерживается на 2,5 сек\n Сочетается аддиктивно с другими источниками ослепления\n Ослепление использует псевдослучайное распределение",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Windrun теперь даёт сквозное передвижение и невидимость на всю длительность способности\n Windranger может использовать способности и предметы и атаковать, не выходя из невидимости\n Визуальные эффекты от применения способностей и атак остаются, показывая источник снарядов\n Для противников местоположение Windranger будет отображаться кругом под персонажем, если она использовала автоатаку\n Получение <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter не обновит текущее действие заклинания\n Невидимость предоставляется вторым баффом, поэтому его развеивание предотвращает возврат Windranger в невидимое состояние\n Windranger может подбирать и выбрасывать предметы не выходя из невидимости",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Талант «Windrun нельзя развеять» делает способность неразвеивающейся\n Её можно развеять только смертью"
      ],
      "item_behaviour": [],
      "description": "Увеличивает скорость передвижения героя и позволяет ему уворачиваться от всех физических атак, при этом замедляя передвижение врагов поблизости.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус замедления: 325 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 550)",
        "Уклонение: 100%",
        "Доп\n скорость передвижения: 60%",
        "Замедление скорости передвижения врагов: 15%\/20%\/25%\/30% (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 35%\/40%\/45%\/50%)",
        "Длительность задержки ауры: 2,5",
        "Длительность: 3\/4\/5\/6",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Время до невидимости:  0,2",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Ослепление:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0a\/Windranger_Windrun.mp3\/revision\/latest?cb=20191216030607",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов"
      ],
      "mana": "15\/14\/13\/12 (TagTalent 12\/11\/10\/9)",
      "aghanim": null,
      "name": "Windrun",
      "cooldown": "50",
      "legacy_key": "W",
      "story": "Лиралей зачаровывает порывы ветра, и они отражают удары по ней."
    },
    {
      "notes": [
        "Повторное применение Gale Force во время активного предыдущего применения немедленно его прекратит",
        "Эффект предоставляется аурой, эффект которой задерживается на 0,5 сек",
        "Толкает врагов в области действия со скоростью 240 в выбранном направлении\n За всю длительность действия и с учётом задержки ауры может толкнуть противников на расстояние в 840",
        "Толкание не препятствует врагам полностью, они могут продолжать двигаться",
        "Не толкает противников, которые уже находятся под действием источником обезвреживающего принудительного передвижения",
        "Не толкает противников на непроходимую территорию"
      ],
      "item_behaviour": [],
      "description": "Призывает могучий порыв ветра, который толкает в выбранном направлении всех врагов в области действия. Векторное применение. Дальность применения: 1000. Расход маны: 150. Перезарядка: 30 сек.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,47",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1500",
        "Радиус: 1000",
        "Скорость ветра: 240",
        "Длительность: 3",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Windranger_Gale_Force.mp3\/revision\/latest?cb=20210829210057",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов"
      ],
      "mana": "30",
      "aghanim": null,
      "name": "Gale Force",
      "cooldown": "150",
      "legacy_key": "G",
      "story": "Лиралей наконец научилась взывать к мощи, принадлежащей ей по праву рождения."
    },
    {
      "notes": [
        "Дальность применения Focus Fire всегда равна дальности атаки заклинателя\n Дальность применения можно увеличить при помощи бонусов к дальности атаки\n Бонус к дальности применения работать не будут\n При этом не учитывается неограниченная дальность от активной способности <span image=\"items\/hurricane_pike\/full.webp\">[picture:hurricane_pike]<\/span> Hurricane Pike",
        "При применении отдает команду Windranger атаковать цель",
        "Focus Fire позволяет Windranger двигаться при атаке выбранной цели",
        "Windranger автоматически атакует цель Focus Fire, если существо будет в пределах дальности, если только герой не получил приказ, отличный от передвижения или атаки\n Атаки можно приостановить приказом «стоп» (S) или «удерживать позицию» (H)\n После остановки герой больше не будет атаковать во время передвижения\n Для продолжения нужно отдать новый приказ на атаку (<span image=\"images\/keyboard_white_mouse_right.png\">[picture:keyboard_white_mouse_right]<\/span> Нажатие ПКМ или A)",
        "При атаке цели уменьшает только основной и бонусный урон Windranger\n EXPR (Основной урон + Бонусный урон) × 70% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 86%) Бонусный условный урон от атаки (например, <span image=\"items\/monkey_king_bar\/full.webp\">[picture:monkey_king_bar]<\/span> Monkey King Bar и <span image=\"images\/diffusal_blade_1.png\">[picture:diffusal_blade_1]<\/span> Diffusal Blade) не изменяется",
        "Windranger может переключаться между целями без потери баффа Focus Fire",
        "При смене цели скорость атаки и урон адаптируются сразу после начала атаки",
        "Использование на несколько существ дает скорость атаки и снижение урона только при атаке последней цели",
        "Focus Fire преждевременно заканчивается, если Windranger умирает, но сохраняется, если умирает цель способности",
        "Можно применить на любое вражеское существо, включая постройки, но исключая варды, неуязвимых и спрятанных существ",
        "Уменьшающий перезарядку Focus Fire при убийстве цели <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> талант позволяет уменьшить перезарядку Focus Fire на 20 секунд от текущей перезарядки, если цель умирает\n Перезарядка уменьшается только в том случае, если убитая цель является героем (или клоном), исключая иллюзии и крипов-героев\n Не имеет значения, каким образом умерла цель или кто является убийцей, перезарядка уменьшается всегда\n Эффект может сработать несколько раз за одно применение, например, если цель воскресла, выкупилась или являлась вновь призванной копией <span image=\"images\/arc_warden_tempest_double_minimap.png\">[picture:arc_warden_tempest_double_minimap]<\/span> Tempest Double\n ПРИМЕЧАНИЯ К SOULBIND Никак не действует на вторичную цель"
      ],
      "item_behaviour": [],
      "description": "Герой призывает вихрь, увеличивающий скорость его атаки по выбранному вражескому существу или строению на 350\/425\/500. Весь урон от этих атак будет уменьшен, за исключением урона от эффектов предметов.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: <span image=\"images\/attack_range_symbol.png\">[picture:attack_range_symbol]<\/span> 600",
        "Доп\n скорость атаки: 350\/425\/500",
        "Снижение урона: 30% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 14%)",
        "Длительность: 20",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Снижение перезарядки при убийстве жертвы:  20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Windranger_Focus_Fire.mp3\/revision\/latest?cb=20191216030555",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Себя"
      ],
      "mana": "70\/50\/30",
      "aghanim": null,
      "name": "Focus Fire",
      "cooldown": "75\/100\/125",
      "legacy_key": "F",
      "story": "Способность Лиралей обрушить на оппонента шквал стрел — пусть и в ущерб точности — просто бесподобна."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.4,
    "attrAgility": 17.0
  },
  "description": "Осыпает одну цель стремительным градом стрел Проворная и ловкая Windranger всегда поджидает подходящего момента для нападения. Она постоянно в движении — даже когда расчищает путь смертоносным выстрелом или связывает врагов, чтобы нашпиговать их стрелами.  Керри Поддержка Контроль Побег Быстрый урон ★★☆",
  "history": "Западные леса крепко хранят свои секреты. Один из них — Лиралей, непревзойдённая лучница лесов, любимая крестница ветра. Это сейчас её прозвали ветрокрылой — но семья Лиралей поглибла во время ночного шторма: буря разрушила дом до основания, открыв его жителей всем ветрам. Лишь новорождённая выжила среди развалин, пронизанных смертью и разрушением. Когда шторм стих, ветер услышал плачущего в траве везучего младенца. Он пожалел ребёнка и перенёс его на порог дома в соседней деревне. Следующие годы ветер то и дело навещал девочку, наблюдая со стороны, как она оттачивает свои навыки. Теперь, после многих лет тренировок, стрелы Лиралей неизменно попадают точно в цель. Она двигается с ослепительной скоростью, будто бы подгоняемая ветром, а враги её гибнут в шквале стрел, словно их наказывает сама природа."
}