{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на силу в общем даёт Dragon Knight: 400 здоровья, 2 регенерации здоровья и 20 урона от атаки.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,6 сек. оглушения от Dragon Tail",
          "talentRight": "Бонусы от Dragon Blood в 1,8 раза больше"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 к силе",
          "talentRight": "-15% перезарядки заклинаний"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+350 к здоровью",
          "talentRight": "+25 к урону"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+24% к снижению урона врагов от Breathe Fire",
          "talentRight": "+2 маны в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/60\/Breathe_Fire.mp3\/revision\/latest?cb=20141125001729",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Breathe Fire летит со скоростью в 1050 единиц.",
        "Может поражать существ на расстоянии до 1000 единиц (складывается из дистанции прохождения и конечного радиуса).",
        "Площадь поражения представляет собой конус.",
        "Снижает весь урон пораженных существ, включая урон, даваемый атрибутами.",
        "Breathe Fire сначала наносит урон, затем применяет дебафф.",
        "В форме Elder Dragon Form остаточная анимация равна 0,53 секунды."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "Q",
      "cooldown": "14\/13\/12\/11 (TagTalent 11,9\/11,05\/10,2\/9,35)",
      "description": "Извергает огненное дыхание на вражеских юнитов в линии перед Dragon Knight, поджигая их и уменьшая урон от их атак.",
      "spellName": "Breathe Fire",
      "params": [
        "Анимация применения: 0,2+0,47",
        "Дальность применения: 600",
        "Начальный радиус: 150",
        "Дистанция прохождения: 750",
        "Конечный радиус: 250",
        "Урон: 90\/170\/240\/300",
        "Снижение урона: 25% (TagTalent 49%)",
        "Длительность снижения урона: 11",
        "Снижение урона от атак остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян. Может выбрать целью существ с иммунитетом, выпуская в их сторону огонь."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Визитная карточка рыцаря Дейвиона — огненное дыхание, жертвам которого не припомнит счета даже сам дракон Слайрак."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Dragon_Tail.mp3\/revision\/latest?cb=20141125001736",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "В форме Elder Dragon Form дальность применения равна 400 и способность использует снаряд вместо мгновенного применения. Скорость полета снаряда - 1600.",
        "Скорость полета снаряда - 1600.",
        "Dragon Tail сначала наносит урон, затем применяет дебафф.",
        "В человеческой форме способность не использует снаряд, поэтому её нельзя избежать."
      ],
      "mana": "100",
      "hotKey": "W",
      "cooldown": "12\/11\/10\/9 (TagTalent 10,2\/9,35\/8,5\/7,65)",
      "description": "Dragon Knight поражает своим щитом врага в радиусе ближнего боя, оглушая его и нанося небольшой урон. Когда рыцарь находится в форме дракона, он может применять заклинание с расстояния в 400 единиц.",
      "spellName": "Dragon Tail",
      "params": [
        "Анимация применения: 0+0,5",
        "Дальность применения: 150",
        "Урон: 25\/50\/75\/100",
        "Длительность оглушения: 2,5\/2,75\/3\/3,25 (TagTalent 4,1\/4,35\/4,6\/4,85)",
        "Снаряд, используемый в форме от Elder Dragon Form, можно избежать."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Комбинируя способности дракона и навыки рыцаря, Дейвион становится опасным противником в ближнем бою."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Восстанавливает до 240\/480\/720\/960 (TagTalent 432\/864\/1296\/1728) здоровья за одну минуту."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Текущая в жилах Dragon Knight кровь дракона улучшает его регенерацию здоровья и броню.",
      "spellName": "Dragon Blood",
      "params": [
        "Восстановление здоровья: 4\/8\/12\/16 (TagTalent 7,2\/14,4\/21,6\/28,8)",
        "Дополнительная броня: 3\/6\/9\/12 (TagTalent 5,4\/10,8\/16,2\/21,6)",
        "Иллюзии получают регенерацию здоровья, но не броню."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Кровь Слайрака все еще течет в венах Дейвиона, делая его намного выносливее других рыцарей."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Dragon_Knight_Fireball.mp3\/revision\/latest?cb=20201225162937",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует купленый Aghanim's Shard.",
        "Доступно только во время Elder Dragon Form.",
        "Наносит 40 урона сразу после применения и каждые 0.5 сек., всего 21 раз.",
        "Can deal up to 840 damage to a single unit (before reductions).",
        "Multiple instances of Fireball on the same area stack, with each cast dealing damage to units within range."
      ],
      "mana": "100",
      "hotKey": "D",
      "cooldown": "20 (TagTalent 17)",
      "description": "Provided to Elder Dragon Form. Ignites a 450 AoE area for 10 seconds, dealing 80 damage per second to enemies in it.",
      "spellName": "Fireball",
      "params": [
        "Анимация применения: 0.2+0.53"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/56\/Elder_Dragon_Form.mp3\/revision\/latest?cb=20141125001742",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический \/ Физический"
      ],
      "notes": [
        "Уровень 4 доступен только с Aghanim's Scepter. У способности остается 3 уровня для изучения, а предмет автоматически повышает её уровень на 1.",
        "Увеличивает скорость передвижения Dragon Knight до 335, дальность атаки — до 500, а сопротивление магии — до 25%\/25%\/25% (TagTalent \/55%).",
        "Также дает Dragon Knight снаряды дальней атаки. Его снаряды летят со скоростью в 900 единиц.",
        "На 4 уровне дает герою свободное перемещение, позволяя пролетать над непроходимой территорией, существами, строениями и деревьями.",
        "1-й уровень способности превращает его в зеленого дракона, 2-й уровень — в красного, 3-й уровень — в синего, 4-й — в черного. Черный дракон на 30% больше остальных.",
        "Черный дракон на 30% больше остальных.",
        "Elder Dragon Form отменяется при смерти. Бафф Dragon Form скрытый, отображаются только 3 модификатора атаки.",
        "Несколько использований Elder Dragon Form обновит длительность и форму, подстраиваясь под текущий уровень способности.",
        "В форме Elder Dragon Form Dragon Knight получает следующие модификаторы атаки с неразвеиваемыми баффами:",
        "Corrosive Breath: (Доступен с 1-го уровня Elder Dragon Form) Применяет дебафф, наносящий урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 5 раз. С 2-го уровня дебафф применяется ко всем врагам в максимальном радиусе урона по области. Может нанести до 100\/100\/100 (TagTalent \/150) урона существу (до уменьшений). Не действует на варды, но действует на союзных существ. Corrosive Breath действует на строения, поэтому его также можно использовать для добивания союзных башен. Но при этом строения получают дебафф только при непосредственной атаке по ним. Несколько атак не складываются, но обновляют время действия дебаффа. В случае, если атака промахнулась или её избежали, дебафф не применяется в радиусе действия.",
        "Применяет дебафф, наносящий урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 5 раз.",
        "С 2-го уровня дебафф применяется ко всем врагам в максимальном радиусе урона по области.",
        "Может нанести до 100\/100\/100 (TagTalent \/150) урона существу (до уменьшений).",
        "Не действует на варды, но действует на союзных существ.",
        "Corrosive Breath действует на строения, поэтому его также можно использовать для добивания союзных башен. Но при этом строения получают дебафф только при непосредственной атаке по ним.",
        "Несколько атак не складываются, но обновляют время действия дебаффа.",
        "В случае, если атака промахнулась или её избежали, дебафф не применяется в радиусе действия.",
        "Splash Attack: (Доступен с 2-го уровня Elder Dragon Form) В случае, если атака промахнулась или её избежали, то урон по области не срабатывает. Урон по области физический, поэтому на него действует блокировка урона. Не действует на варды или строения.",
        "В случае, если атака промахнулась или её избежали, то урон по области не срабатывает.",
        "Урон по области физический, поэтому на него действует блокировка урона.",
        "Не действует на варды или строения.",
        "Frost Breath: (Доступен с 3-го уровня Elder Dragon Form) Не действует на варды, строения или союзных существ. Несколько атак не складываются, но обновляют время действия дебаффа. Атаки сначала применяют дебафф, затем наносят урон. Урон по области также применяется после дебаффа. В случае, если атака промахнулась или её избежали, замедление не применяется в радиусе действия.",
        "Не действует на варды, строения или союзных существ.",
        "Несколько атак не складываются, но обновляют время действия дебаффа.",
        "Атаки сначала применяют дебафф, затем наносят урон. Урон по области также применяется после дебаффа.",
        "В случае, если атака промахнулась или её избежали, замедление не применяется в радиусе действия."
      ],
      "mana": "50",
      "hotKey": "R",
      "cooldown": "115 (TagTalent 97.75)",
      "description": "Герой обращается в одного из трёх могучих древних драконов, отчего быстрее передвигается, может дальше применять Dragon Tail и получает особые эффекты атаки: Уровень 1 Зелёный дракон с ядовитой атакой. Атаки отравляют цель, нанося ей 20 урона в секунду. Яд действует 5 секунд и наносит урон постройкам. Уровень 2 Красный дракон с массовой атакой. Атаки наносят 75%\/75%\/75%\/115% урона всем врагам в радиусе 300 от цели. Отравляет всех задетых врагов. Уровень 3 Синий дракон с леденящей атакой. На 3 секунды замедляет всех жертв массовой атаки, снижая их скорость передвижения на 40%, а скорость атаки — на 40. Отравляет всех задетых врагов.",
      "spellName": "Elder Dragon Form",
      "params": [
        "Анимация применения: 0+0,5",
        "Доп. дальность атаки: 350",
        "Доп. скорость передвижения: 25",
        "Доп. сопротивление магии: 0%\/0%\/0% (TagAghanim \/40%)",
        "Доп. дальность применения Dragon Tail: 250",
        "Длительность: 60",
        "Corrosive Breath: урон в секунду: 20\/20\/20 (TagAghanim \/30)",
        "Corrosive Breath: длительность дебаффа: 5",
        "Splash: радиус атаки: 300",
        "Splash: урон от атаки: 75%\/75%\/75% (TagAghanim \/115%)",
        "Frost Breath: радиус: 300",
        "Frost Breath: замедление скорости передвижения: 0%\/0%\/40% (TagAghanim \/60%)",
        "Frost Breath: замедление скорости атаки: 0\/0\/40 (TagAghanim \/60)",
        "Frost Breath: длительность дебаффа: 3",
        "Поднимает уровень способности на 1. Добавляет четвёртый уровень с чёрным драконом: он увеличивает сопротивление магии и замедление, усиливает урон от яда по области, а также дарует свободное перемещение.",
        "Corrosive Breath и Frost Breath не проходят сквозь иммунитет к заклинаниям. Splash проходит сквозь иммунитет. Corrosive Breath пытается нанести урон врагам с иммунитетом, если был применен до иммунитета и не был развеян.",
        "Дебафф Corrosive Breath, примененный иллюзией, не наносит урона."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Сила дракона, дремлющая внутри Дейвиона, вырывается наружу, совмещая мощь легендарного рыцаря с могуществом легендарного дракона."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 21.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 2.0,
    "attrAgility": 19.0
  },
  "description": "Dragon Knight — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Breathe Fire, Dragon Knight извергает огненное дыхание на вражеских юнитов в линии перед Dragon Knight, поджигая их и уменьшая урон от их атак. Вторая способность, Dragon Tail, поражает щитом врага в радиусе ближнего боя, оглушая его и нанося небольшой урон. Когда рыцарь находится в форме дракона, он может применять заклинание на большем расстоянии. Пассивная способность, Dragon Blood, увеличивает показатель брони героя и скорость восстановления здоровья. Ультимативная способность, Elder Dragon Form, превращает в одного из трех могущественных древних драконов, увеличивая свой урон, скорость передвижения и дальность применения Dragon Tail, а также получает новые способности.",
  "history": "Много лет рыцарь Дэйвион выслеживал легендарного древнего дракона, но когда наконец предстал перед своим врагом, страшно разочаровался: ужасающий Слайрак состарился и ослабел, его крылья были потрепаны, плоть прогнила, клыки отупели, а огненное дыхание было не страшнее коробка отсыревших спичек. Не видя чести в его убийстве, молодой рыцарь хотел уйти и позволить старому врагу спокойно умереть. Но в его мысли проник голос: Слайрак прошептал, что рыцарь окажет ему честь, позволив умереть в бою. Рыцарь согласился, и был вознагражден за проявленное милосердие: как только он вонзил свой меч в грудь дракона, тот воткнул свой коготь ему в горло. Когда их кровь смешалась, Слайрак передал ему свою стойкость и мудрость веков. Смерть дракона скрепила их союз. Так и родился Dragon Knight. Древние силы дремлют в рыцаре, просыпаясь, когда он зовет их себе на помощь; или, возможно, это дракон взывает к рыцарю…",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,6 сек. оглушения от Dragon Tail",
      "talentRight": "Бонусы от Dragon Blood в 1,8 раза больше"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 к силе",
      "talentRight": "-15% перезарядки заклинаний"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+350 к здоровью",
      "talentRight": "+25 к урону"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+24% к снижению урона врагов от Breathe Fire",
      "talentRight": "+2 маны в секунду"
    }
  ]
}