{
  "abilities": [
    {
      "notes": [
        "The attack range talent also affects the cast range of Glaives of Wisdom.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Last Word Mutes",
          "talentRight": "+15% Glaives of Wisdom Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+1.2x Last Word Int Multiplier",
          "talentRight": "+400 Health"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+8% Arcane Curse Slow",
          "talentRight": "+100 Attack Range"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Attack Speed",
          "talentRight": "+15 Arcane Curse Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Silencer_Arcane_Curse_1.mp3\/revision\/latest?cb=20191216023209",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Whenever an affected unit casts an ability, the duration is increased by 3. This effect has no stack limit. Fully ignores toggle abilities, active attack modifiers and the abilities listed here.",
        "Fully ignores toggle abilities, active attack modifiers and the abilities listed here.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 6 + 3 \/ penalty instances. Can deal up to 96\/144\/192\/240 + 48\/72\/96\/120 \/ penalty (TagTalent 186\/234\/282\/330 + 93\/117\/141\/165 \/ penalty) damage to a single unit (before reductions).",
        "Can deal up to 96\/144\/192\/240 + 48\/72\/96\/120 \/ penalty (TagTalent 186\/234\/282\/330 + 93\/117\/141\/165 \/ penalty) damage to a single unit (before reductions).",
        "If the affected unit is also being silenced (by any effect), the damage and movement slow is doubled. Also, Arcane Curse's duration is increased by 1s whenever it deals damage. This effectively prolongs the debuff, or \"pause\" its duration, as long as the affected unit remains silenced. In this case, the debuff can deal 32\/48\/64\/80 (TagTalent 62\/78\/94\/110) damage per second.",
        "This effectively prolongs the debuff, or \"pause\" its duration, as long as the affected unit remains silenced.",
        "In this case, the debuff can deal 32\/48\/64\/80 (TagTalent 62\/78\/94\/110) damage per second.",
        "Successive casts of Arcane Curse fully stack, always placing an independent debuff.",
        "The sound effect played on every damage instance is only audible to the affected unit's player."
      ],
      "mana": "125\/130\/135\/140",
      "hotKey": "Q",
      "cooldown": "20\/18\/16\/14",
      "description": "Curses the target area, causing enemy heroes to take damage and slowing their movement speed. Anytime affected enemies cast a spell, the duration is increased.",
      "spellName": "Arcane Curse",
      "params": [
        "Cast Animation: 0.3+0.37",
        "Cast Range: 1000",
        "Radius: 425",
        "Damage per Second: 16\/24\/32\/40 (TagTalent 31\/39\/47\/55)",
        "Move Speed Slow: 9%\/12%\/15%\/18% (TagTalent 17%\/20%\/23%\/26%)",
        "Base Duration: 6",
        "Penalty Duration: 3",
        "Silenced Damage Multiplier: 2",
        "Slow persists and attempts to damage if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Nortrom's lack of incantations is less of a problem for him than it is for his adversaries."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c6\/Silencer_Glaives_of_Wisdom_1.mp3\/revision\/latest?cb=20191216023203",
      "effects": [
        "Ability Target Unit \/ Autocast",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "The cast range of Glaves of Wisdom is based on the attack range of the caster. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses. The level 15 talent bonus attack range talent increases the cast range to 700.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "The level 15 talent bonus attack range talent increases the cast range to 700.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "Deals its damage before the attack damage is applied, but still depends on the attack hitting the target.",
        "Glaives of Wisdom does not work against allied units, couriers, buildings or wards.",
        "Checks Silencer's intelligence upon projectile hit, so changes in his intelligence while the projectile flies affect its damage. Steals intelligence before applying its damage, so it does affect Glaives of Wisdom's damage right away.",
        "Steals intelligence before applying its damage, so it does affect Glaives of Wisdom's damage right away.",
        "Cannot reduce enemy intelligence below 0, but Silencer always gains the full amount of intelligence, no matter how much the target has left. Cannot steal intelligence from illusions or from Meepo Clones, but can steal from Tempest Doubles. The target effectively loses 12\/12\/24\/36 mana and 0.05\/0.05\/0.1\/0.15 mana regeneration (and 1\/1\/2\/3 attack damage if it is an intelligence hero). Vice versa, effectively increases Silencer's mana, mana regeneration, and attack damage by the same amount per cast. Also reduces the target's current mana by 12 per stolen intelligence, instead of keeping the current mana percentage. Effectively removes 12\/12\/24\/36 current mana from the target. This lost mana is returned upon the debuff expiring. Unlike the target, Silencer keeps his current mana percentage upon gaining and losing the intelligence.",
        "Cannot steal intelligence from illusions or from Meepo Clones, but can steal from Tempest Doubles.",
        "The target effectively loses 12\/12\/24\/36 mana and 0.05\/0.05\/0.1\/0.15 mana regeneration (and 1\/1\/2\/3 attack damage if it is an intelligence hero).",
        "Vice versa, effectively increases Silencer's mana, mana regeneration, and attack damage by the same amount per cast.",
        "Also reduces the target's current mana by 12 per stolen intelligence, instead of keeping the current mana percentage.",
        "Effectively removes 12\/12\/24\/36 current mana from the target. This lost mana is returned upon the debuff expiring.",
        "Unlike the target, Silencer keeps his current mana percentage upon gaining and losing the intelligence.",
        "Each attack places a new hidden modifier buff\/debuff on both Silencer and the target. This means their durations are independent from each other. The counter modifiers on both Silencer and his targets show how much intelligence they gained or lost. Upon death, the dying hero's intelligence restores back to its normal values, while the other party keeps the changed intelligence values for the remaining duration.",
        "The counter modifiers on both Silencer and his targets show how much intelligence they gained or lost.",
        "Upon death, the dying hero's intelligence restores back to its normal values, while the other party keeps the changed intelligence values for the remaining duration.",
        "Permanently stolen intelligence is directly removed from the enemy's base intelligence and added to Silencer's base intelligence. It does not matter how an enemy hero within the radius dies, Silencer always steals its intelligence. Silencer also always steals intelligence when he deals the killing blow on an enemy hero, regardless of distance. However, Silencer needs to be alive as the kill happens to steal the intelligence. Cannot steal intelligence from illusions or hero clones. When killing Meepo or his clones, only the main Meepo gets intelligence stolen. Cannot reduce enemy base intelligence below 1. Silencer also does not gain intelligence from heroes that are at 1 intelligence. Enemy heroes effectively lose 24 mana and 0.1 mana regeneration (and 2 attack damage if it is an intelligence hero). Vice versa, effectively increases Silencer's mana, mana regeneration, and attack damage by the same amount per stack. The permanent intelligence steal is not retroactive, it cannot gain charges from kills and deaths before Glaives of Wisdom is learned.",
        "It does not matter how an enemy hero within the radius dies, Silencer always steals its intelligence.",
        "Silencer also always steals intelligence when he deals the killing blow on an enemy hero, regardless of distance.",
        "However, Silencer needs to be alive as the kill happens to steal the intelligence.",
        "Cannot steal intelligence from illusions or hero clones. When killing Meepo or his clones, only the main Meepo gets intelligence stolen.",
        "Cannot reduce enemy base intelligence below 1. Silencer also does not gain intelligence from heroes that are at 1 intelligence.",
        "Enemy heroes effectively lose 24 mana and 0.1 mana regeneration (and 2 attack damage if it is an intelligence hero).",
        "Vice versa, effectively increases Silencer's mana, mana regeneration, and attack damage by the same amount per stack.",
        "The permanent intelligence steal is not retroactive, it cannot gain charges from kills and deaths before Glaives of Wisdom is learned.",
        "With Aghanim's Shard, the Glaives of Wisdom bounces towards the closest enemy unit within 600 range of the attack target. The bouncing glaive travels at the same speed as the leading attack's projectile, and is affected by projectile speed changing effects as well. Does not perform instant attacks. The projectile is entirely spell-based. This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them. Their damage counts as spell damage, however, they ignore outgoing spell damage amplification and cannot spell lifesteal. The glaives deal damage based on the damage amount calculated for the leading attack. Attack damage amount is calculated upon attack begin. This means it works with Critical Strike and Quell, since these are included in the initial damage calculations. This also means that it does not matter how much damage the attack actually did to the target, since that part is being calculated on projectile hit. It also means that other conditional attack damage bonuses like a Javelin proc are not included, since these happen later as well. The bouncing glaive still applies the intelligence-based damage separately, and steals intelligence of its target as well, if it is a hero. Does not bounce off of or towards allied units, couriers, wards or buildings.",
        "The bouncing glaive travels at the same speed as the leading attack's projectile, and is affected by projectile speed changing effects as well.",
        "Does not perform instant attacks. The projectile is entirely spell-based.",
        "This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them.",
        "Their damage counts as spell damage, however, they ignore outgoing spell damage amplification and cannot spell lifesteal.",
        "The glaives deal damage based on the damage amount calculated for the leading attack. Attack damage amount is calculated upon attack begin.",
        "This means it works with Critical Strike and Quell, since these are included in the initial damage calculations.",
        "This also means that it does not matter how much damage the attack actually did to the target, since that part is being calculated on projectile hit.",
        "It also means that other conditional attack damage bonuses like a Javelin proc are not included, since these happen later as well.",
        "The bouncing glaive still applies the intelligence-based damage separately, and steals intelligence of its target as well, if it is a hero.",
        "Does not bounce off of or towards allied units, couriers, wards or buildings."
      ],
      "mana": "15",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Silencer enchants his glaives with his wisdom, dealing additional damage based on his Intelligence. Silencer temporarily steals his target's intelligence with each hit.",
      "spellName": "Glaives of Wisdom",
      "params": [
        "Cast Range: 600 (TagTalent 700)",
        "Permanent Intelligence Steal Radius: 925",
        "Permanent Intelligence Steal: 2",
        "Intelligence as Damage: 15%\/35%\/55%\/75% (TagTalent 30%\/50%\/70%\/90%)",
        "Temporary Intelligence Steal: 1\/1\/2\/3",
        "Temporary Steal Duration: 10\/20\/30\/40",
        "Bounce Search Radius: 600",
        "Number of Bounces: 1",
        "Bounce Attack Damage as Damage: 50%",
        "Causes Glaives to bounce once towards the closest enemy unit, dealing 50% of Silencer's attack damage. Bounce range is 600.",
        "When disjointed by the primary attack target, it does not bounce. When disjointed by a secondary target, the disjointing unit is not registered as hit, meaning the attack can immediately bounce on it again if within range. A disjointed bounce still counts towards the max bounces.",
        "Illusions cannot steal intelligence. Although the status buff is copied by illusions, the stolen intelligence is not copied."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Although lacking in traditional incantations, Nortrom's pedigree of the Aeol Drias gives him uncanny wisdom, which he applies to physical combat."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/56\/Silencer_Last_Word.mp3\/revision\/latest?cb=20191216023207",
      "effects": [
        "Ability Target Unit (TagAghanim Target Area)",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "When the target casts an ability during the 4 seconds initial debuff duration, the target gets damaged, then silenced, and then the cast ability takes effect. Although the silence happens first, the ability's effects are already queued up, therefore the silence does not prevent the target from casting the ability. However death does stop the ability, meaning if the damage from Last Word is enough to kill the target, the cast ability does not go off. This also means that damage negating spells like Refraction and abilities that provide spell immunity do not block Last Word's damage.",
        "Although the silence happens first, the ability's effects are already queued up, therefore the silence does not prevent the target from casting the ability.",
        "However death does stop the ability, meaning if the damage from Last Word is enough to kill the target, the cast ability does not go off.",
        "This also means that damage negating spells like Refraction and abilities that provide spell immunity do not block Last Word's damage.",
        "Does not trigger on toggle abilities, active attack modifiers and the abilities listed here. Triggers on channeling abilities, but waits for the channeling to stop first. With Phase Shift, Last Word only applies its effects when the ability is canceled by the player prematurely. This means if Phase Shift expires on its own, Last Word's damage and silence are not applied.",
        "Triggers on channeling abilities, but waits for the channeling to stop first.",
        "With Phase Shift, Last Word only applies its effects when the ability is canceled by the player prematurely.",
        "This means if Phase Shift expires on its own, Last Word's damage and silence are not applied.",
        "When the initial debuff expires, it still damages and silences the target. Last Word first applies the debuff, then the damage.",
        "Last Word first applies the debuff, then the damage.",
        "If the target has no intelligence, only the base damage is applied.",
        "The initial debuff provides shared vision over the target for its duration.",
        "With Aghanim's Scepter, Last Word turns into an area-targeted ability, so that it cannot directly target units anymore. Can target invisible units and units inside the Fog of War.",
        "Can target invisible units and units inside the Fog of War."
      ],
      "mana": "100\/105\/110\/115",
      "hotKey": "E",
      "cooldown": "22\/18\/14\/10",
      "description": "Enchants a target, providing vision of them and causing them to be damaged and silenced and muted\/\/\/ if they cast a spell or if the enchantment timer expires. Deals extra damage based on the difference in intelligence between Silencer and the target.",
      "spellName": "Last Word",
      "params": [
        "Cast Animation: 0.3+0.47",
        "Cast Range: 900",
        "Base Damage: 120\/160\/200\/240",
        "Intelligence Difference Multiplier: 1.5\/2\/2.5\/3 (TagTalent 2.7\/3.2\/3.7\/4.2)",
        "Initial Debuff Duration: 4",
        "Silence Duration: 3\/4\/5\/6",
        "Mute Duration: 3\/4\/5\/6",
        "Radius: 650",
        "Causes Last Word to become an AoE ability.",
        "Does not attempt to damage or silence if initial debuff was placed before spell immunity and when not dispelled. Silence persists if silence debuff was placed before spell immunity and when not dispelled.",
        "Blocked upon cast. Not blocked when upgraded."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Nortrom ensures that spells uttered by his opponents will be their last."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/14\/Silencer_Global_Silence_1.mp3\/revision\/latest?cb=20191216023205",
      "effects": [
        "Ability No Target",
        "Affects Enemies"
      ],
      "notes": [
        "The silence affects spell immune, invisible and invulnerable creeps, summons and heroes. Does not affect hidden units.",
        "The sound effect of Global Silence which plays on each enemy's hero has the highest sound priority in the game. This means it heavily tones down other game sounds for enemies, making it basically the only sound they can hear during the silence.",
        "This means it heavily tones down other game sounds for enemies, making it basically the only sound they can hear during the silence."
      ],
      "mana": "300\/450\/600",
      "hotKey": "R",
      "cooldown": "130\/115\/100",
      "description": "Silencer stops all sound, preventing enemy heroes and units on the map from casting spells.",
      "spellName": "Global Silence",
      "params": [
        "Cast Animation: 0.3+0.37",
        "Radius: Global",
        "Duration: 4.5\/5.25\/6"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "With a shock to the ground, all magic and sound pauses, and Nortrom fulfills his prophecy."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 19.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 2.4,
    "attrAgility": 22.0
  },
  "description": "Nortrom, the Silencer, is a ranged intelligence hero who can be played as a support, carry, or initiator. He is one of the few intelligence heroes that truly benefit from intelligence items and is effective against heroes that rely mostly on spells, as he can silence them while stealing their intelligence and adding it to his own. He is a notorious anti-caster hero who can disrupt the magical abilities of his enemies and cripple spellcasters throughout the game. Arcane Curse slows and causes enemies to lose health for a set duration, but increases with each spell the enemy casts, forcing them to either wait and cast no spell until it expires, or cast spells and prolong the debuff and thus take more damage. Last Word places a curse on Nortrom's target that damages and silences for a long duration if the target casts a spell. If the target does not cast a spell before the curse duration ends the effects are the same. Glaives of Wisdom is an active attack modifier that deals a percentage of Nortrom's intelligence as pure damage, as well as steal intelligence with every attack. On top of that, the glaives also allow him to permanently steal the intelligence of enemy heroes that die near him or are directly killed by him, adding it to his own. This rewards his presence in teamfights, also making his glaives ever stronger as the battle goes on. Nortrom's ultimate, Global Silence, silences all enemy units on the map for a few seconds. A well-timed Global Silence can be used to save yourself or an ally, initiate a teamfight, or ruin the enemy's initiation.",
  "history": "Part of the seventh and final generation of a carefully designed pedigree, Nortrom was bred by the ancient order of the Aeol Drias to be the greatest magic user the world had ever seen. He was the prophesied one, the culmination of two-hundred years of careful pairings, a war-mage who would bring glory to the order, and destruction to their sworn enemies, The Knights of the Fold. Raised with other young mages in a hidden cantonment among the hills of the Hazhadal barrens, the order's preceptors waited for Nortrom's abilities to manifest. While the other students honed their talents with fire, or ice, or incantatory spells, Nortrom sat silent and talentless, unable to cast so much as a hex. As the day of final testing approached, he still hadn't found his magic. In disgust, the preceptors berated him, while the children laughed. \"You are no mage,\" the head of the order declared. Still, Nortrom did not slink away. He entered the day of testing and faced down the young mages who had mocked him. And then his preceptors learned a valuable lesson: a lack of magic can be the greatest magic of all. Nortrom silenced the young mages one by one and defeated them in single combat, until he alone stood as champion of the Aeol Drias, in fulfillment of the prophecy.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Last Word Mutes",
      "talentRight": "+15% Glaives of Wisdom Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+1.2x Last Word Int Multiplier",
      "talentRight": "+400 Health"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+8% Arcane Curse Slow",
      "talentRight": "+100 Attack Range"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Attack Speed",
      "talentRight": "+15 Arcane Curse Damage"
    }
  ]
}