{
  "abilities": [
    {
      "notes": [
        "Талант на ловкость в общем даёт Vengeful Spirit: 1,67 брони, 10 скорости атаки и 10 урона от атаки.",
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Vengeful Spirit до 32,5%."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Magic Missile проходит сквозь защиту от магии",
          "talentRight": "+16% к базовому урону от Vengeance Aura"
        },
        {
          "talentLvl": "20",
          "talentLeft": "–15 сек. перезарядки Nether Swap",
          "talentRight": "+200 к урону от Magic Missile"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−2,75 сек. перезарядки Magic Missile",
          "talentRight": "−2 к броне врагов от Wave of Terror"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 к ловкости",
          "talentRight": "+12% к сопротивлению магии"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Vengeful_Spirit_Magic_Missile_1.mp3\/revision\/latest?cb=20191216030141",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета снаряда - 900.",
        "Снаряд сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "100\/110\/120\/130",
      "item_behaviour": [],
      "name": "Magic Missile",
      "cooldown": "12\/11\/10\/9 (TagTalent 9,25\/8,25\/7,25\/6,25)",
      "description": "Выпускает во врага магический снаряд, который оглушает и наносит урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 575\/600\/625\/650",
        "Урон: 90\/180\/270\/360 (TagTalent 290\/380\/470\/560)",
        "Длительность оглушения: 1,4\/1,5\/1,6\/1,7",
        "Не может выбрать целью или воздействовать на существ под действием иммунитета к заклинаниям. (TagTalent Может выбрать целью и воздействовать на существ с иммунитетом.)",
        "Блокируется при попадании."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Vengeful_Spirit_Wave_of_Terror.mp3\/revision\/latest?cb=20191216030144",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Волна распространяется со скоростью в 2000 единиц; требуется 0,7 секунды, чтобы преодолеть всё расстояние.",
        "Поражает существ на расстоянии до 1725 единиц (складывается из дистанции прохождения и радиуса).",
        "Волна дает летающий обзор в радиусе 350 единиц в момент полета, который остается на 4 секунды. Обзор начинается в 100 единицах от Vengeful Spirit и охватывает расстояние до 2000 единиц (складывается из начального расстояния, дистанции прохождения и радиуса обзора).",
        "Обзор начинается в 100 единицах от Vengeful Spirit и охватывает расстояние до 2000 единиц (складывается из начального расстояния, дистанции прохождения и радиуса обзора).",
        "Дебаффы от нескольких применений не складываются, но обновляют длительность.",
        "Волна сначала применяет дебафф, затем наносит урон.",
        "Не действует на курьеров.",
        "С Aghanim's Shard уменьшает базовый урон и урон, даваемый основным атрибутом затронутых существ. Дополнительный урон не уменьшается. Уменьшение урона от атаки мгновенно адаптируется к любым изменениям базового урона героя. Vengeful Spirit получает бафф за каждого задетого вражеского героя. Несколько применений складываются. В отличии от дебаффа, бафф увеличивает базовый урон Vengeful Spirit, а не добавляется в качестве дополнительного. Значение полученного бонуса равно значению потерянного целью при получении дебаффа урона . В отличии от дебаффа значение урона устанавливается при получении баффа и не адаптируется к изменениям. Дебафф уменьшает урон каждого задетого существа. При этом Vengeful Spirit получает бафф только от затронутых героев, включая клонов, но исключая иллюзии и крипов-героев.",
        "Уменьшение урона от атаки мгновенно адаптируется к любым изменениям базового урона героя.",
        "Vengeful Spirit получает бафф за каждого задетого вражеского героя. Несколько применений складываются.",
        "В отличии от дебаффа, бафф увеличивает базовый урон Vengeful Spirit, а не добавляется в качестве дополнительного.",
        "Значение полученного бонуса равно значению потерянного целью при получении дебаффа урона .",
        "В отличии от дебаффа значение урона устанавливается при получении баффа и не адаптируется к изменениям.",
        "Дебафф уменьшает урон каждого задетого существа.",
        "При этом Vengeful Spirit получает бафф только от затронутых героев, включая клонов, но исключая иллюзии и крипов-героев."
      ],
      "mana": "25\/30\/35\/40",
      "item_behaviour": [],
      "name": "Wave of Terror",
      "cooldown": "16\/14\/12\/10",
      "description": "Герой издаёт жуткий клич, ослабляя броню врагов и раскрывая туман войны.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 1400",
        "Дальность прохождения волны: 1400",
        "Радиус: 325",
        "Урон: 70\/90\/110\/130",
        "Снижение брони: 3\/4\/5\/6 (TagTalent 5\/6\/7\/8)",
        "Длительность: 8",
        "Кража урона: 20%",
        "Кража основной брони: 20%",
        "Способность крадёт 20% от базовых урона и брони вражеских героев на время её действия."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзников (TagAghanim Себя)"
      ],
      "notes": [
        "Бафф ауры задерживается на 0,5 секунды.",
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом затронутых существ. Дополнительный урон не увеличивается.",
        "Аура действует на неуязвимых, но не на спрятанных союзников.",
        "С Aghanim's Scepter иллюзия появляется в 108 единицах от места смерти Vengeful Spirit. Она появляется на севере, востоке, юге или западе от этой точки. Это сильная иллюзия: ее нельзя мгновенно убить способностями, обычно убивающими иллюзии. Иллюзия всегда появляется с полным запасом маны и здоровья и готовыми к применению способностями вне зависимости от их статуса у самой Vengeful Spirit. При появлении у иллюзии нет отсчета времени жизни. Она исчезнет при возрождении Vengeful Spirit. Иллюзия появлятся с каждой смертью, включая временную во время воскрешения. Для врагов созданная иллюзия визуально отличается от настоящей Vengeful Spirit. В отличии от других иллюзий за неё не дают золота. Иллюзию нельзя приручить с помощью Enchant; вместо этого она замедлится.",
        "Это сильная иллюзия: ее нельзя мгновенно убить способностями, обычно убивающими иллюзии.",
        "Иллюзия всегда появляется с полным запасом маны и здоровья и готовыми к применению способностями вне зависимости от их статуса у самой Vengeful Spirit.",
        "При появлении у иллюзии нет отсчета времени жизни. Она исчезнет при возрождении Vengeful Spirit.",
        "Иллюзия появлятся с каждой смертью, включая временную во время воскрешения.",
        "Для врагов созданная иллюзия визуально отличается от настоящей Vengeful Spirit.",
        "В отличии от других иллюзий за неё не дают золота.",
        "Иллюзию нельзя приручить с помощью Enchant; вместо этого она замедлится.",
        "С Aghanim's Scepter Vengeful Spirit может получать опыт даже во время смерти. В мертвом состоянии герой периодически перемещается к своей иллюзии. Также герой возрождается на месте иллюзии, а не на фонтане. При этом данный эффект требует живой иллюзии. Если иллюзия мертва, то герой не получает опыта и не перемещается к ней.",
        "В мертвом состоянии герой периодически перемещается к своей иллюзии.",
        "Также герой возрождается на месте иллюзии, а не на фонтане.",
        "При этом данный эффект требует живой иллюзии. Если иллюзия мертва, то герой не получает опыта и не перемещается к ней."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Vengeance Aura",
      "cooldown": null,
      "description": "Герой своим присутствием увеличивает дальность атаки и основной атрибут союзников неподалёку. Не увеличивает дальность атаки в ближнем бою. Если владелец способности погибнет, после него останется сильная иллюзия, которая существует, пока герой не воскреснет.",
      "hot_key": "E",
      "params": [
        "Радиус: 1200",
        "Доп. базовый урон: 11%\/18%\/25%\/32% (TagTalent 27%\/34%\/41%\/48%)",
        "Длительность задержки ауры: 0,5",
        "Число иллюзий при смерти: 1",
        "Урон иллюзии: 100%",
        "Урон по иллюзии: 100%",
        "Доп. скорость передвижения иллюзии: 25%",
        "После смерти на месте героя появляется сильная иллюзия, которая может применять все способности, наносит 100% урона, получает 100% урона и передвигается на 25% быстрее. Если иллюзия жива в момент возрождения героя, он займёт её место. Опыт, зарабатываемый иллюзией, передаётся её владельцу.",
        "Иллюзии распространяют ауру. При смерти они не вызывают сильные иллюзии."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Vengeful_Spirit_Nether_Swap.mp3\/revision\/latest?cb=20191216030143",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Героев"
      ],
      "notes": [
        "Цель получает приказ «стоп» после телепортации, прерывая произносимые заклинания.",
        "Не позволяет избегать снаряды ни заклинателю, ни цели.",
        "Разрушает деревья в радиусе 300 единиц вокруг Vengeful Spirit и цели Nether Swap.",
        "Можно применять на иллюзии и Spirit Bear.",
        "Можно применять на неуязвимых существ."
      ],
      "mana": "100\/150\/200",
      "item_behaviour": [],
      "name": "Nether Swap",
      "cooldown": "50\/40\/30 (TagTalent 35\/25\/15)",
      "description": "Мгновенно меняется местами с союзным или вражеским героем. Останавливает прерываемые способности.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 800\/950\/1100"
      ],
      "legacy_key": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 19.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.2,
    "attrAgility": 20.0
  },
  "description": "Vengeful Spirit — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Ее первая способность, Magic Missile, выпускает во врага магический снаряд, который оглушает и наносит урон. Второй способностью, Wave of Terror, Vengeful Spirit издает дьявольский клич, который ослабляет броню врагов и раскрывает туман войны. Пассивная способность, Vengeance Aura, увеличивает урон ближайших союзников. Так же при смерти героя на ее месте появится иллюзия Vengerful Spirit наносящая 100% урона героя и 150% получаемого,после возврождения героя — дух исчезнет. Ультимативная способность Nether Swap, позволяет меняеться местами с союзным или вражеским героем, так же способность сбивает анимации способностей вражеский персонажей. Улучшение с Aghanim's Scepter применяет страх на врагов вокруг места появления Vengerful Spirit после обмена местами с выбранным существом.",
  "history": "Даже самые сдержанные cкайрасы — это раздражительные от природы создания, готовые отомстить за самое мелкое оскорбление. Но Шенделезара — это месть во плоти. Некогда гордая и свирепая скайраска, Шенделезара должна была унаследовать Жуткое гнездо, но предательство сестры лишило её законного права. Попавшись в расставленные убийцей сети, Шенделезара смогла выбраться, лишь пожертвовав своими крыльями и испытав страшное унижение: ей пришлось ковылять пешком. Она знала, что без крыльев cкайрасы никогда не примут её правление и что на самом высоком насесте Жуткого гнезда, до которого можно лишь долететь, её сестра была в безопасности. Не желая жить бескрылой калекой и жаждя мести больше, чем власти, павшая принцесса заключила сделку с богиней Скриок: она пожертвовала своё истерзанное тело и обрела форму вечного духа, живущего местью и обладающего жуткой мощью в материальном мире. Она добьётся отмщения — даже если крыльев ей уже не вернуть.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Magic Missile проходит сквозь защиту от магии",
      "talentRight": "+16% к базовому урону от Vengeance Aura"
    },
    {
      "talentLvl": "20",
      "talentLeft": "–15 сек. перезарядки Nether Swap",
      "talentRight": "+200 к урону от Magic Missile"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−2,75 сек. перезарядки Magic Missile",
      "talentRight": "−2 к броне врагов от Wave of Terror"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 к ловкости",
      "talentRight": "+12% к сопротивлению магии"
    }
  ]
}