{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
        "Талант на сопротивление магии увеличивает сопротивление магии Vengeful Spirit до 34%.",
        "Талант на ловкость в общем даёт Vengeful Spirit: 2 брони, 12 скорости атаки и 12 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Magic Missile проходит сквозь защиту от магии",
          "talentRight": "+16% к базовому урону от Vengeance Aura"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+125 к дальности атаки от Vengeance Aura",
          "talentRight": "+200 к урону от Magic Missile"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-2.75 сек. перезарядки Magic Missile",
          "talentRight": "+12 к ловкости"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-1 к броне врагов от Wave of Terror",
          "talentRight": "+12% к сопротивлению магии"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Vengeful_Spirit_Magic_Missile_1.mp3\/revision\/latest?cb=20191216030141",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета снаряда - 900.",
        "Снаряд сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "Q",
      "cooldown": "12\/11\/10\/9 (TagTalent 9,25\/8,25\/7,25\/6,25)",
      "description": "Выпускает во врага магический снаряд, который оглушает и наносит урон.",
      "spellName": "Magic Missile",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 550",
        "Урон: 90\/180\/270\/360 (TagTalent 290\/380\/470\/560)",
        "Длительность оглушения: 1,4\/1,5\/1,6\/1,7",
        "Не может выбрать целью или воздействовать на существ под действием иммунитета к заклинаниям. (TagTalent Может выбрать целью и воздействовать на существ с иммунитетом.)",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Простейший скайрасский приём — магический снаряд — основной инструмент мести Шендел."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Vengeful_Spirit_Wave_of_Terror.mp3\/revision\/latest?cb=20191216030144",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Волна распространяется со скоростью в 2000 единиц; требуется 0,7 секунды, чтобы преодолеть всё расстояние.",
        "Поражает существ на расстоянии до 1700 единиц (складывается из дистанции прохождения и радиуса).",
        "Волна дает летающий обзор в радиусе 350 единиц в момент полета, который остается на 4 секунды. Обзор начинается в 100 единицах от Vengeful Spirit и охватывает расстояние до 2000 единиц (складывается из начального расстояния, дистанции прохождения и радиуса обзора).",
        "Обзор начинается в 100 единицах от Vengeful Spirit и охватывает расстояние до 2000 единиц (складывается из начального расстояния, дистанции прохождения и радиуса обзора).",
        "Дебаффы от нескольких применений не складываются, но обновляют длительность.",
        "Волна сначала применяет дебафф, затем наносит урон.",
        "Не действует на курьеров."
      ],
      "mana": "25\/30\/35\/40",
      "hotKey": "W",
      "cooldown": "16\/14\/12\/10",
      "description": "Герой издаёт жуткий клич, ослабляя броню врагов и раскрывая туман войны.",
      "spellName": "Wave of Terror",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 1400",
        "Дистанция прохождения волны: 1400",
        "Радиус: 300",
        "Урон: 60\/80\/100\/120",
        "Снижение брони: 3\/4\/5\/6 (TagTalent 4\/5\/6\/7)",
        "Длительность: 8"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Душераздирающий голос Шендел предупреждает о её приближении."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "Бафф ауры задерживается на 70%\/80%\/90%\/100% секунды.",
        "Иллюзия появляется в 108 единицах от места смерти Vengeful Spirit. Она появляется на севере, востоке, юге или западе от этой точки.",
        "Иллюзия всегда появляется с полным запасом маны и здоровья и готовыми к применению способностями вне зависимости от их статуса у самой Vengeful Spirit.",
        "При появлении у иллюзии нет отсчета времени жизни. Она исчезнет при возрождении Vengeful Spirit.",
        "Иллюзия появляется с каждой смертью, включая смерть при наличии воскрешения.",
        "Для врагов созданная иллюзия визуально отличается от настоящей Vengeful Spirit.",
        "Талант 25 уровня позволяет иллюзии использовать заклинания, но не предметы. Благодаря улучшению за смерть иллюзии не дают золота. Также улучшенную иллюзию больше нельзя переманить с помощью Enchant.",
        "Благодаря улучшению за смерть иллюзии не дают золота.",
        "Также улучшенную иллюзию больше нельзя переманить с помощью Enchant.",
        "Аура действует на неуязвимых союзников."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой своим присутствием увеличивает дальность атаки и основной атрибут союзников неподалёку. Не увеличивает дальность атаки в ближнем бою. Если владелец способности погибнет, после него останется сильная иллюзия, которая существует, пока герой не воскреснет.",
      "spellName": "Vengeance Aura",
      "params": [
        "Радиус: 1200",
        "Доп. дальность атаки для героев дальнего боя: 50\/75\/100\/125 (TagTalent 175\/200\/225\/250)",
        "Бонус к основному атрибуту: 4\/7\/10\/13",
        "Число иллюзий при смерти: 1",
        "Урон иллюзии: 70%\/80%\/90%\/100%",
        "Урон по иллюзии: 150%",
        "Длительность задержки ауры: 0,5",
        "Иллюзии распространяют ауру. При смерти они не вызывают сильные иллюзии."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Отнюдь не все разделяют всепоглощающую жажду мести, однако чрезмерный фанатизм воодушевляет на подвиги."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Nether_Swap.mp3\/revision\/latest?cb=20141201161255",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Героев"
      ],
      "notes": [
        "Цель получает приказ «стоп» после телепортации, прерывая произносимые заклинания.",
        "Не позволяет избегать снаряды ни заклинателю, ни цели.",
        "Разрушает деревья в радиусе 300 единиц вокруг Vengeful Spirit и цели Nether Swap.",
        "Можно применять на иллюзии и Spirit Bear.",
        "Можно применять на неуязвимых существ.",
        "Aghanim's Scepter применяет страх на всех врагов вокруг новой локации Vengeful Spirit, заставляя их бежать к фонтану своей команды, при этом запрещая любые действия."
      ],
      "mana": "100\/150\/200",
      "hotKey": "R",
      "cooldown": "0,25",
      "description": "Мгновенно меняется местами с союзным или вражеским героем. Останавливает прерываемые способности.",
      "spellName": "Nether Swap",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 700\/850\/1000",
        "Радиус страха: 0 (TagAghanim 700)",
        "Длительность страха: 0 (TagAghanim 2)",
        "Число зарядов: 2",
        "Время восстановления заряда: 90\/80\/70",
        "Накладывает страх на врагов, оказавшихся рядом с владельцем способности после её применения.",
        "Может выбрать и действовать на существ с иммунитетом к заклинаниям. Страх блокируется иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Мученичество — совсем не большое воздаяние за месть."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 19.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.8,
    "attrAgility": 20.0
  },
  "description": "Vengeful Spirit — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Magic Missile, выпускает во врага магический снаряд, который оглушает и наносит урон. Второй способностью, Wave of Terror, Vengeful Spirit издает дьявольский клич, который ослабляет броню врагов и раскрывает туман войны. Пассивная способность, Vengeance Aura, увеличивает урон ближайших союзников. Так же при смерти героя на ее месте появится иллюзия Vengerful Spirit наносящая 100% урона героя и 150% получаемого,после возврождения героя — дух исчезнет. Ультимативная способность Nether Swap, позволяет меняеться местами с союзным или вражеским героем, так же способность сбивает анимации способностей вражеский персонажей. Улучшение с Aghanim's Scepter применяет страх на врагов вокруг места появления Vengerful Spirit после обмена местами с выбранным существом.",
  "history": "Даже самые сдержанные cкайрасы — это раздражительные от природы создания, готовые отомстить за самое мелкое оскорбление. Но Шенделезара — это месть во плоти. Некогда гордая и свирепая скайраска, Шенделезара должна была унаследовать Жуткое гнездо, но предательство сестры лишило её законного права. Попавшись в расставленные убийцей сети, Шенделезара смогла выбраться, лишь пожертвовав своими крыльями и испытав страшное унижение: ей пришлось ковылять пешком. Она знала, что без крыльев cкайрасы никогда не примут её правление и что на самом высоком насесте Жуткого гнезда, до которого можно лишь долететь, её сестра была в безопасности. Не желая жить бескрылой калекой и жаждя мести больше, чем власти, павшая принцесса заключила сделку с богиней Скриок: она пожертвовала своё истерзанное тело и обрела форму вечного духа, живущего местью и обладающего жуткой мощью в материальном мире. Она добьётся отмщения — даже если крыльев ей уже не вернуть.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Magic Missile проходит сквозь защиту от магии",
      "talentRight": "+16% к базовому урону от Vengeance Aura"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+125 к дальности атаки от Vengeance Aura",
      "talentRight": "+200 к урону от Magic Missile"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-2.75 сек. перезарядки Magic Missile",
      "talentRight": "+12 к ловкости"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-1 к броне врагов от Wave of Terror",
      "talentRight": "+12% к сопротивлению магии"
    }
  ]
}