{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Silver_Edge_Shadow_Walk_1.mp3\/revision\/latest?cb=20191227195534",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Physical"
      ],
      "notes": [
        "The attack out of Silver Edge's Shadow Walk cannot miss.",
        "Does not interrupt the user's channeling spells upon cast.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, and is considered by cleave, but not by crit. It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, and is considered by cleave, but not by crit.",
        "It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "The bonus damage is not applied when attacking wards and buildings out of the invisibility.",
        "Applies a break on the target when attacking from invisibility, disabling passive abilities.",
        "Places the debuff before the attack damage is applied, but still relies on the attack (or projectile) to hit.",
        "The invisibility is lost upon reaching the cast point of spells, or upon finishing an attack (for ranged heroes upon projectile launch).",
        "Unlike Shadow Blade, Silver Edge does not apply the damage if an attack hits during the fade time.",
        "Allows the user to pass through other units, including wards, but not through buildings.",
        "The user can pick up and drop items without breaking the invisibility.",
        "Shares cooldown with Shadow Blade."
      ],
      "mana": "75",
      "abilityName": "Shadow Walk",
      "cooldown": "18",
      "description": "Makes you invisible for 14 seconds, or until you attack or cast a spell. While invisible, you move 25% faster and can move through units. Attacking to end the invisibility will deal 175 bonus physical damage to the target, and disable their passive abilities for 4.",
      "params": [
        "Fade Time: 0.3",
        "Damage: 175",
        "Move Speed Bonus: 25%",
        "Invisibility Duration: 14",
        "Break Duration: 4",
        "Applies damage on spell immune enemies. Does not apply debuff on spell immune enemies."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 45 attack speed, 120 mana, 3.5 mana regen and 40 attack damage.",
    "For agility heroes, it grants 45 attack speed, 120 mana, 3.5 mana regen and 40 attack damage.",
    "For intelligence heroes, it grants 45 attack speed, 120 mana, 3.5 mana regen and 50 attack damage."
  ],
  "cost": "5600",
  "lore": null,
  "consistFrom": [
    "Shadow Blade",
    "Oblivion Staff",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Silver Edge",
  "description": "Once used to slay an unjust king, only to have the kingdom erupt into civil war in the aftermath.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 Intelligence",
    "+3 Mana Regeneration",
    "+40 Attack Damage",
    "+45 Attack Speed"
  ],
  "tips": [
    "Be aware that the Break mechanic has no effect on your opponents' items. If they have a Daedalus or Butterfly, for example, they will still receive the full benefits of these items.",
    "Consider purchasing this item if the enemy has troubling passives such as Blur, Berserker's Blood, Fury Swipes, Bristleback, Untouchable, and Dispersion.",
    "Remember that abilities using stacks (such as Reactive Armor, Necromastery and Fury Swipes) are only prevented from gaining or placing new stacks. If the target already has existing stacks (on themselves or on their target), their passive can still function until the stacks expire (such as Reactive Armor's regeneration\/armor and Fury Swipes' additional damage)."
  ]
}