{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на вампиризм заклинаний аддитивно складывается с другими источниками вампиризма заклинаний. Лечит на 2,6 % от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.",
        "Лечит на 2,6 % от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+24 к урону за эффект Warpath",
          "talentRight": "+13% к вампиризму заклинаниями"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 к дополнительному урону от Quill Spray",
          "talentRight": "+20 здоровья в секунду"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 к скорости атаки",
          "talentRight": "+200 к здоровью"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+2 маны в секунду",
          "talentRight": "+15 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/dc\/Viscous_Nasal_Goo.mp3\/revision\/latest?cb=20141125225419",
      "effects": [
        "Способность Направленная на существо (TagAghanim Ненаправленная)",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1000.",
        "Накладывает один дебафф на цель. Каждое последующее использование делает дебафф сильнее. Число в иконке показывает количество обновлений дебаффа, включая первое использование.",
        "Число в иконке показывает количество обновлений дебаффа, включая первое использование.",
        "Здесь показано на сколько уменьшаются броня и скорость передвижения от определенного количества стаков Viscous Nasal Goo на каждом уровне: Уровень 1: 3,5\/5\/6,5\/8\/9,5\/11\/12,5\/14 брони и 23 %\/26 %\/29 %\/32 %\/35 %\/38 %\/41 %\/44 % скорости передвижения. Уровень 2: 4\/6\/8\/10\/12\/14\/16\/18 брони и 26 %\/32 %\/38 %\/44 %\/50 %\/56 %\/62 %\/68 % скорости передвижения. Уровень 3: 4,5\/7\/9,5\/12\/14,5\/17\/19,5\/22 брони и 29 %\/38 %\/47 %\/56 %\/65 %\/74 %\/83 %\/92 % скорости передвижения. Уровень 4: 5\/8\/11\/14\/17\/20\/23\/26 брони и 32 %\/44 %\/56 %\/68 %\/80 %\/92 %\/104 %\/116 % скорости передвижения.",
        "Уровень 1: 3,5\/5\/6,5\/8\/9,5\/11\/12,5\/14 брони и 23 %\/26 %\/29 %\/32 %\/35 %\/38 %\/41 %\/44 % скорости передвижения.",
        "Уровень 2: 4\/6\/8\/10\/12\/14\/16\/18 брони и 26 %\/32 %\/38 %\/44 %\/50 %\/56 %\/62 %\/68 % скорости передвижения.",
        "Уровень 3: 4,5\/7\/9,5\/12\/14,5\/17\/19,5\/22 брони и 29 %\/38 %\/47 %\/56 %\/65 %\/74 %\/83 %\/92 % скорости передвижения.",
        "Уровень 4: 5\/8\/11\/14\/17\/20\/23\/26 брони и 32 %\/44 %\/56 %\/68 %\/80 %\/92 %\/104 %\/116 % скорости передвижения.",
        "",
        "Считает крипов-героев за героев.",
        "С улучшением от Aghanim's Scepter, Viscous Nasal Goo использует то же время применения и те же избегаемые снаряды, но другую анимацию применения. Не выбирает целями невидимых, неуязвимых и спрятаных юнитов или юнитов в тумане войны.",
        "Не выбирает целями невидимых, неуязвимых и спрятаных юнитов или юнитов в тумане войны."
      ],
      "mana": "12\/16\/20\/24",
      "hotKey": "Q",
      "cooldown": "1,75",
      "description": "Обильно сморкается на жертву, снижая ее броню и скорость передвижения. Эффекты от действия способности складываются, а время действия обновляется с каждым повторным применением.",
      "spellName": "Viscous Nasal Goo",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 600 (TagAghanim 0)",
        "Максимум эффектов: 4 (TagAghanim 8)",
        "Базовое снижение брони: 2",
        "Снижение брони за каждый эффект: 1,5\/2\/2,5\/3",
        "Базовое замедление скорости передвижения: 20%",
        "Замедление за каждый эффект: 3%\/6%\/9%\/12%",
        "Длительность на героях: 5",
        "Длительность на крипах: 10",
        "Радиус: 900",
        "Делает способность ненаправленной, от чего она применяется на всех врагов вокруг героя. Так же убирает задержку перед применением.",
        "Замедление и снижение брони остаются, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокирует при попадании. Не блокируется при улучшении."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Простуду, подхваченную в снегах, Bristleback делает своим преимуществом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Quill_Spray.mp3\/revision\/latest?cb=20141125225401",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "При использовании прерывает произносимые способности Bristleback.",
        "Выпускаемые иглы имеют скорость в 2400 и достигают максимума радиуса за 0.29 секунды.",
        "Иглы разлетаются не в форме кольца. Они действуют на каждого врага в пределах расширяющейся области, поэтому их нельзя избежать, блинканувшись к Bristleback.",
        "Центром эффекта является место применения, он не следует за Bristleback.",
        "Накладывает дебафф на каждого врага и с каждым следующим применением добавляет один заряд дебаффа каждому ранее задетому. Первый дебафф отображает число зарядов в иконке статус-бара. Дебафф зарядов - скрытый. Длительность зарядов не связана друг с другом. Успешные применения не обновляют предыдущие заряды. Учитывая текущую перезарядку и длительность эффекта, то способность складывает заряды до 5 раз. Чтобы достигнуть максимального урона, необходимы срабатывания игл от Bristleback. Максимальный урон достигается за 20\/18\/17\/15 (TagTalent 12\/12\/11\/10) эффектов. Для его достижения нужно 15\/13\/12\/10 (TagTalent 7\/7\/6\/5) пассивных срабатываний игл (без учета уменьшения перезарядки).",
        "Первый дебафф отображает число зарядов в иконке статус-бара. Дебафф зарядов - скрытый.",
        "Длительность зарядов не связана друг с другом. Успешные применения не обновляют предыдущие заряды.",
        "Учитывая текущую перезарядку и длительность эффекта, то способность складывает заряды до 5 раз. Чтобы достигнуть максимального урона, необходимы срабатывания игл от Bristleback.",
        "Максимальный урон достигается за 20\/18\/17\/15 (TagTalent 12\/12\/11\/10) эффектов. Для его достижения нужно 15\/13\/12\/10 (TagTalent 7\/7\/6\/5) пассивных срабатываний игл (без учета уменьшения перезарядки).",
        "Сначала проверяет количество зарядов на юнитах, затем наносит урон, основанный на этом значении, а затем увеличивает число зарядов. То есть первое использование наносит только базовый урон.",
        "Сначала проверяет количество зарядов на юнитах, затем наносит урон, основанный на этом значении, а затем увеличивает число зарядов. То есть первое использование наносит только базовый урон.",
        "И базовый урон от игл, и дополнительный урон, и максимальный урон можно увеличить с помощью усиления урона заклинананий.",
        "И базовый урон от игл, и дополнительный урон, и максимальный урон можно увеличить с помощью усиления урона заклинананий.",
        "Здесь указано, сколько урона нанесет Quill Spray с определенным числом зарядов на каждом уровне (до учета сопротивления): Уровень 1: 25 \/ 53 \/ 81 \/ 109 \/ 137 \/ 165 \/ 193 \/ 221 \/ 249 \/ 277 \/ 305 \/ 333 \/ 361 \/ 389 \/ 417 \/ 445 \/ 473 \/ 501 \/ 529 \/ 550 (TagTalent 25 \/ 73 \/ 121 \/ 169 \/ 217 \/ 265 \/ 313 \/ 361 \/ 409 \/ 457 \/ 505 \/ 550) Уровень 2: 45 \/ 75 \/ 105 \/ 135 \/ 165 \/ 195 \/ 225 \/ 255 \/ 285 \/ 315 \/ 345 \/ 375 \/ 405 \/ 435 \/ 465 \/ 495 \/ 525 \/ 550 (TagTalent 45 \/ 95 \/ 145 \/ 195 \/ 245 \/ 295 \/ 345 \/ 395 \/ 445 \/ 495 \/ 545 \/ 550) Уровень 3: 65 \/ 97 \/ 129 \/ 161 \/ 193 \/ 225 \/ 257 \/ 289 \/ 321 \/ 353 \/ 385 \/ 417 \/ 449 \/ 481 \/ 513 \/ 545 \/ 550 (TagTalent 65 \/ 117 \/ 169 \/ 221 \/ 273 \/ 325 \/ 377 \/ 429 \/ 481 \/ 533 \/ 550) Уровень 4: 85 \/ 119 \/ 153 \/ 187 \/ 221 \/ 255 \/ 289 \/ 323 \/ 357 \/ 391 \/ 425 \/ 459 \/ 493 \/ 527 \/ 550 (TagTalent 85 \/ 139 \/ 193 \/ 247 \/ 301 \/ 355 \/ 409 \/ 463 \/ 517 \/ 550)",
        "Уровень 1: 25 \/ 53 \/ 81 \/ 109 \/ 137 \/ 165 \/ 193 \/ 221 \/ 249 \/ 277 \/ 305 \/ 333 \/ 361 \/ 389 \/ 417 \/ 445 \/ 473 \/ 501 \/ 529 \/ 550 (TagTalent 25 \/ 73 \/ 121 \/ 169 \/ 217 \/ 265 \/ 313 \/ 361 \/ 409 \/ 457 \/ 505 \/ 550)",
        "Уровень 2: 45 \/ 75 \/ 105 \/ 135 \/ 165 \/ 195 \/ 225 \/ 255 \/ 285 \/ 315 \/ 345 \/ 375 \/ 405 \/ 435 \/ 465 \/ 495 \/ 525 \/ 550 (TagTalent 45 \/ 95 \/ 145 \/ 195 \/ 245 \/ 295 \/ 345 \/ 395 \/ 445 \/ 495 \/ 545 \/ 550)",
        "Уровень 3: 65 \/ 97 \/ 129 \/ 161 \/ 193 \/ 225 \/ 257 \/ 289 \/ 321 \/ 353 \/ 385 \/ 417 \/ 449 \/ 481 \/ 513 \/ 545 \/ 550 (TagTalent 65 \/ 117 \/ 169 \/ 221 \/ 273 \/ 325 \/ 377 \/ 429 \/ 481 \/ 533 \/ 550)",
        "Уровень 4: 85 \/ 119 \/ 153 \/ 187 \/ 221 \/ 255 \/ 289 \/ 323 \/ 357 \/ 391 \/ 425 \/ 459 \/ 493 \/ 527 \/ 550 (TagTalent 85 \/ 139 \/ 193 \/ 247 \/ 301 \/ 355 \/ 409 \/ 463 \/ 517 \/ 550)"
      ],
      "mana": "35",
      "hotKey": "W",
      "cooldown": "3",
      "description": "Выпускает во все стороны иглы, нанося урон всем врагам вокруг себя. Жертвы получают дополнительный урон за каждое попадание иглами за последние 14 секунд.",
      "spellName": "Quill Spray",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 700",
        "Базовый урон: 25\/45\/65\/85",
        "Доп. урон за каждый эффект: 28\/30\/32\/34 (TagTalent 48\/50\/52\/54)",
        "Максимальный урон: 550",
        "Длительность одного эффекта: 14"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Честь вышибалы весьма остра. Как и его шипы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/37\/Bristleback_ability.mp3\/revision\/latest?cb=20140420150230",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Визуальный эффект и звук проигрываются с каждым получением урона спиной. Получение урона боком проигрывает только визуальный эффект.",
        "Bristleback получает меньше урона от всех типов урона за исключением помеченного как отнимающий здоровье. При получении урона со спины эффективное здоровье Bristleback увеличивается на 19%\/32%\/47%\/67%. При получении урона с боков эффективное здоровье Bristleback увеличивается на 9%\/14%\/19%\/25%.",
        "При получении урона со спины эффективное здоровье Bristleback увеличивается на 19%\/32%\/47%\/67%.",
        "При получении урона с боков эффективное здоровье Bristleback увеличивается на 9%\/14%\/19%\/25%.",
        "Проверяет текущее положение источника урона и сопоставляет его с углом поворота Bristleback к каждому источнику. То есть периодический урон будет снижен только если его источник находится в пределах градусов. Урон от Death Ward, Proximity Mines снижается, если герой отворачивается от них, поскольку они и являются источниками урона.",
        "То есть периодический урон будет снижен только если его источник находится в пределах градусов.",
        "Урон от Death Ward, Proximity Mines снижается, если герой отворачивается от них, поскольку они и являются источниками урона.",
        "Пассивная Quill Spray срабатывает, когда спина (но не бока) Bristleback впитывает 210 единиц урона (после всех сопротивлений). У счетчика урона нет лимита по времени. Он сбрасывается только после выпускания пассивных игл. Любой превышающий урон полностью игнорируется, а это означает, что если противник нанесет, например, 420 единиц урона за один раз, пассивная способность сработает лишь единожды. Не учитывает урон, отмеченный как отнимающий здоровье или неотражаемый. Пассивные иглы не срабатывают, если Quill Spray не изучена. Срабатывание Quill Spray не расходует ману, не имеет перезарядки и не связано с перезарядкой активируемой Quill Spray.",
        "У счетчика урона нет лимита по времени. Он сбрасывается только после выпускания пассивных игл.",
        "Любой превышающий урон полностью игнорируется, а это означает, что если противник нанесет, например, 420 единиц урона за один раз, пассивная способность сработает лишь единожды.",
        "Не учитывает урон, отмеченный как отнимающий здоровье или неотражаемый.",
        "Пассивные иглы не срабатывают, если Quill Spray не изучена.",
        "Срабатывание Quill Spray не расходует ману, не имеет перезарядки и не связано с перезарядкой активируемой Quill Spray."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой получает меньше урона от атак со спины и с боков. При получении 210 урона со спины применяется способность Quill Spray текущего уровня.",
      "spellName": "Bristleback",
      "params": [
        "Угол спины: 70°",
        "Угол боков: 110°",
        "Снижение урона от атак в спину: 16%\/24%\/32%\/40%",
        "Снижение урона от атак с боков: 8%\/12%\/16%\/20%",
        "Предел урона: 210",
        "Иллюзии получают эффект снижения урона, но не пассивное срабатывание Quill Spray."
      ],
      "itemBehaviour": [],
      "legacyKey": "K",
      "story": "Иногда бывает полезно повернуться спиной к врагу во время битвы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Bristleback_Hairball.mp3\/revision\/latest?cb=20201224013124",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Снаряд летит со скоростью 1200.",
        "Эффект от Viscous Nasal Goo и Quill Sprays основан на их текущем уровне. Если эти способности не изучены, то Hairball не будет их использовать. Уровень проверяется при попадании снаряда.",
        "Если эти способности не изучены, то Hairball не будет их использовать.",
        "Уровень проверяется при попадании снаряда.",
        "Когда снаряд достигает центра области, все враги в радиусе поражения становятся целью Viscsous Nasal Goo. В то же время используется первый Quill Spray. Второй применяется спустя 0,1 секунды. Обе способности работают идентично своему обычному применению.",
        "В то же время используется первый Quill Spray. Второй применяется спустя 0,1 секунды.",
        "Обе способности работают идентично своему обычному применению.",
        "Так как скорость Quill Spray больше скорости Viscous Nasal Goo, то первые иглы всегда будут задевать врага быстрее, чем это сделает Viscous Nasal Goo, то есть они не будут получать бонуса от снижения брони противника.",
        "Использование Hairball даёт только один эффект Warpath."
      ],
      "mana": "100",
      "hotKey": "D",
      "cooldown": "20",
      "description": "Отхаркивает в указанную область комок игл. Приземлившись, он лопается и применяет на всех врагов в радиусе 700 один эффект Viscous Nasal Goo и 2 Quill Spray.",
      "spellName": "Hairball",
      "params": [
        "Анимация применения: 0,1+0,64",
        "Дальность применения: 1500",
        "Радиус: 700",
        "Число эффектов Quill Sprays: 2",
        "Интервал между срабатываниями Quill Spray: 0,1",
        "Число эффектов Viscous Nasal Goo: 1",
        "Viscous Nasal Goo не может выбрать своей целью невосприимчивого к магии противника. Quill Spray проходит через иммунитет к заклинаниям.",
        "Viscous Nasal Goo может быть заблокирован. Quill Spray не может быть заблокирован.",
        "Viscous Nasal Goo можно избежать"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Использование предметов не будет активировать Warpath.",
        "С каждым зарядом размер Bristleback и количество летающий вокруг него частиц увеличивается.",
        "Складывается до 5\/7\/9 раз, давая герою до 125\/210\/315 (TagTalent 245\/378\/531) урона от атаки и 15%\/28%\/45% к скорости передвижения.",
        "Длительность зарядов не связана друг с другом. Успешные применения не обновляют предыдущие заряды. Только первый дебафф отображается в интерфейсе. Он показывает число зарядов в иконке.",
        "Только первый дебафф отображается в интерфейсе. Он показывает число зарядов в иконке.",
        "Пассивное срабатывание Quill Spray от Bristleback не активирует Warpath."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Герой нагоняет на себя ярость каждый раз, когда использует способность, повышая свои скорость передвижения и урон.",
      "spellName": "Warpath",
      "params": [
        "Макс. количество эффектов: 5\/7\/9",
        "Доп. урон за каждый эффект: 25\/30\/35 (TagTalent 49\/54\/59)",
        "Доп. скорость за каждый эффект: 3%\/4%\/5%",
        "Длительность одного эффекта: 14",
        "Предотвращает получение новых зарядов. Уже полученные продолжают давать дополнительную скорость передвижения и урон.",
        "Всякий раз когда Bristleback получает эффект Warpath, иллюзии также получают этот эффект. Иллюзии не получают бонус к урону."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "«Держи себя в руках», — часто наставляла его мама. Но в битве ярость всегда к месту."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 22.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 2.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 17.0
  },
  "description": "Bristleback, или Ригварл — это герой с ближним типом атаки, основным атрибутом которого является сила. Герой известен своим набором синергичных, упрощенных, и в то же время эффективных заклинаний с низкими затратами маны и временем перезарядки. Хотя каждое произнесение его заклинаний само по себе имеет относительно слабую силу, их применения имеют кумулятивный эффект, что делает Bristleback тем более смертоносным, чем дольше он остается живым в бою; это напрямую отражается в его ультимативной способности, Warpath, которая увеличивает скорость передвижения и урон от атак героя в зависимости от количества заклинаний, которые он недавно использовал. Герой может по нарастанию замедлять своих врагов и уменьшать их броню с помощью Viscous Nasal Goo и поражать их шквалом Quill Spray, что делает его эффективным преследователем при ганках. Из-за его низкого прироста силы он, на первый взгляд, кажется менее живучим, чем большинство героев класса сила, но его фирменная пассивная способность Bristleback существенно снижает весь урон, который герой получает с боков и особенно со спины, что делает его очень сложной целью для убийства, если он отвернут от своих врагов.",
  "history": "Ригварл никогда не поворачивался спиной в бою и славился битвами с самыми крепкими и гадкими задирами, до которых только доходили руки. Любимец пьяных толп стал участвовать в подпольных боях, что проводились в каждой придорожной таверне между Сломом и Эльзе, и однажды умелого бойца заприметил один трактирщик, искавший вышибалу в бар. За скромную выпивку Ригварл стал собирать с посетителей плату, следить за порядком и время от времени ломать пару конечностей особо несговорчивым клиентам (а одному членистоногому бедняге однажды сломал целых пять). Но одной праздной ночью хмельной удар разделили Ригварл и его собственная печёнка: он нашёл равного себе бойца. «Не нравятся мне ваши бивни, уважаемый», — пробормотал он заплетающимся языком кряжистому детине с севера, которому пора было заплатить. И началось побоище века! В драку бросилась дюжина посетителей. Не уцелел ни один стул. А закончилось всё невероятно: клиент ушёл, не заплатив за выпивку. За несколько недель раны вышибалы затянулись, а иглы отросли, но удар по чести он простить не мог. Счёт Ригварл оплатил из своего кармана, поклявшись выследить северянина и взыскать с него полную плату. После этого он занялся тренировками, чего никогда раньше не делал, и неожиданно для себя сделал поразительное открытие. С улыбкой расправив иглы, он решил: иногда всё же стоит показывать обидчику спину.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+24 к урону за эффект Warpath",
      "talentRight": "+13% к вампиризму заклинаниями"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 к дополнительному урону от Quill Spray",
      "talentRight": "+20 здоровья в секунду"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 к скорости атаки",
      "talentRight": "+200 к здоровью"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+2 маны в секунду",
      "talentRight": "+15 к урону"
    }
  ]
}