{
  "abilities": [
    {
      "notes": [
        "The agility talent effectively grants Slark 1.33 armor, 8 attack speed, and 8 attack damage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+65s Essence Shift Duration",
          "talentRight": "+1s Shadow Dance Duration"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0.8s Pounce Leash",
          "talentRight": "+1 Agility Gained per Essence Shift Attack"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+50 Shadow Dance Attack Speed",
          "talentRight": "+70 Dark Pact Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8 Agility",
          "talentRight": "-1s Dark Pact Cooldown"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/52\/Slark_Dark_Pact_1.mp3\/revision\/latest?cb=20191216023918",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self",
        "Damage Magical"
      ],
      "notes": [
        "Dark Pact interrupts Slark's channeling abilities upon cast.",
        "Deals 7.5\/15\/22.5\/30 (TagTalent 14.5\/22\/29.5\/37) damage within a 325 radius in 0.1-second intervals, starting 1.5 seconds after cast for a total of 10 instances.",
        "Slark takes 2.25\/4.5\/6.75\/9 (TagTalent 4.35\/6.6\/8.85\/11.1) damage in the same intervals, resulting in 22.5\/45\/67.5\/90 (TagTalent 43.5\/66\/88.5\/111) total damage. Applies a strong dispel on Slark in the same intervals, before each of its damage instances. The self-inflicted damage can be reduced or amplified, but can never kill Slark.",
        "Applies a strong dispel on Slark in the same intervals, before each of its damage instances.",
        "The self-inflicted damage can be reduced or amplified, but can never kill Slark.",
        "The visual effects and sounds during the 1.5 seconds delay is only visible and audible to allies.",
        "The visual effects of the damaging pulses are visible even when Slark is invisible.",
        "Dark Pact ends 2.5 seconds after cast, but ends instantly when Slark dies.",
        "Re-casting Dark Pact during the effect delay cancels the previous cast and starts a new one instead."
      ],
      "mana": "75",
      "hotKey": "Q",
      "cooldown": "9\/8\/7\/6 (TagTalent 8\/7\/6\/5)",
      "description": "After a short delay, Slark sacrifices some of his life blood, purging most negative debuffs and dealing damage to enemy units around him and to himself. Slark only takes 30% of the damage.",
      "spellName": "Dark Pact",
      "params": [
        "Cast Animation: 0+0",
        "Damage Radius: 325",
        "Effect Delay: 1.5",
        "Total Damage: 75\/150\/225\/300 (TagTalent 145\/220\/295\/370)",
        "Self Damage Percentage: 30%"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Slithereen are capable of quickly regrowing appendages, in case of critical injury, to save their own lives."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Slark_Pounce_1.mp3\/revision\/latest?cb=20191216023921",
      "effects": [
        "Ability No Target",
        "Affects Enemy Heroes \/ Self"
      ],
      "notes": [
        "Slark leaps forward at a speed of 933.33 (TagTalent 1599.99) for up to 0.75 seconds.",
        "Always jumps for the full distance, unless an enemy hero gets within 95 radius of Slark during the jump.",
        "Leashes the hit enemy hero, preventing them from casting certain mobility spells.",
        "With the max distance and latch radius, Pounce can latch on enemy heroes up to 795 range away.",
        "Slark can turn and cast abilities and items during Pounce, but cannot attack.",
        "Pounce can latch on invisible units, but not on invulnerable, hidden units, or on illusions.",
        "When latching on a unit, Slark is automatically ordered to attack the target.",
        "The more the leash gets stretched, the slower the affected unit can walk away from the center, eventually coming to a full stop. It directly affects the target's movement speed.",
        "If cast before getting leashed, the following abilities are not able to break the leash: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, and Hurricane Pike when targeting an enemy.",
        "Every other position changing effect, can break the leash when stretching it beyond the max radius. Force Staff and an allied-targeted Hurricane Pike instantly break the leash when cast, regardless of the max radius.",
        "Force Staff and an allied-targeted Hurricane Pike instantly break the leash when cast, regardless of the max radius.",
        "When the leash expires while a position changing effect is ongoing, it instantly cancels the position changing effect. This goes for the following abilities: Flamebreak, Primal Roar, Power Cogs, Hookshot, Vacuum, Gust, Boulder Smash, Rolling Boulder, Geomagnetic Grip, Deafening Blast, Tether, Blinding Light, Adaptive Strike (Strength), Blast Off!, Charge of Darkness, Greater Bash, Timber Chain, Walrus PUNCH!, Force Staff and Hurricane Pike.",
        "This goes for the following abilities: Flamebreak, Primal Roar, Power Cogs, Hookshot, Vacuum, Gust, Boulder Smash, Rolling Boulder, Geomagnetic Grip, Deafening Blast, Tether, Blinding Light, Adaptive Strike (Strength), Blast Off!, Charge of Darkness, Greater Bash, Timber Chain, Walrus PUNCH!, Force Staff and Hurricane Pike.",
        "Pounce destroys trees within 100 radius around Slark upon landing.",
        "Pounce cannot be cast during Pounce. During the leap, Pounce is on an unrefreshable cooldown which is bound to the leap buff."
      ],
      "mana": "75",
      "hotKey": "W",
      "cooldown": "20\/16\/12\/8 (TagTalent 0)",
      "description": "Slark leaps forward, grabbing the first hero he connects with. That unit is leashed, and can only move a limited distance away from Slark's landing position.",
      "spellName": "Pounce",
      "params": [
        "Cast Animation: 0+0.53",
        "Leap Distance: 700 (TagAghanim 1200)",
        "Latch Radius: 95",
        "Leash Radius: 400",
        "Leash Duration: 2.5\/2.75\/3\/3.25 (TagTalent 3.3\/3.55\/3.8\/4.05)",
        "Number of Charges: 2",
        "Charge Replenish Time: 10",
        "Provides 2 charges and increases pounce range.",
        "Leash persists if debuff was placed before spell immunity and when not dispelled. Leash can be dispelled by spell immunity only.",
        "Getting rooted during the leap does not cancel the leap."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Time in the Dark Reef made Slark a dangerous assassin; aggressive and fearless."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemy Heroes \/ Self"
      ],
      "notes": [
        "Essence Shift steals 1 of \/ \/ all attributes before the attack damage is applied. With the level 20 talent, Essence Shift steals an extra point in agility for a total of 2.",
        "With the level 20 talent, Essence Shift steals an extra point in agility for a total of 2.",
        "Effective stats loss per stack of Essence Shift: 1 attack damage, 20 health, 0.1 health regeneration, 0.17 armor, 1 attack speed, 12 mana, 0.05 mana regeneration. Effectively grants Slark 0.5 armor, 3 attack speed, and 3 attack damage per stack.",
        "Effectively grants Slark 0.5 armor, 3 attack speed, and 3 attack damage per stack.",
        "Essence Shift cannot reduce any attribute below 0. However, Slark continues to gain agility, both temporarily and permanently, even when the attacked hero has no more attributes left to steal.",
        "Successive attacks do not refresh the duration of all stolen or lost attributes. Each stack has its own duration. The status buff and debuff icon show the number of current stacks and show the duration of the last stack.",
        "The status buff and debuff icon show the number of current stacks and show the duration of the last stack.",
        "When Slark dies, he loses all temporarily stolen attributes, but the affected enemies do not get theirs back, and vice versa.",
        "Cannot steal attributes from illusions. Cannot steal permanent attributes from Tempest Double, but can steal from Meepo Clones. Can steal attributes from allies.",
        "Cannot steal permanent attributes from Tempest Double, but can steal from Meepo Clones.",
        "Can steal attributes from allies.",
        "To permanently steal agility, an enemy hero has to die within 300 range of Slark while having the Essence Shift debuff. Alternatively, Slark also steals agility when he kills a debuffed enemy hero from any distance.",
        "Alternatively, Slark also steals agility when he kills a debuffed enemy hero from any distance."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Slark steals the life essence of enemy heroes with his attacks, draining each of their attributes and converting them to bonus Agility. If Slark kills an affected enemy hero, he permanently steals 1 Agility.",
      "spellName": "Essence Shift",
      "params": [
        "Permanent Steal Radius: 300",
        "Permanent Agility Steal: 1",
        "All Attributes Lost per Attack: 1",
        "Agility Gained per Attack: 3 (TagTalent 4)",
        "Duration: 15\/30\/60\/100 (TagTalent 80\/95\/125\/165)",
        "Prevents gaining new stacks. Already existing stacks still provide bonus agility. Does not prevent permanently stealing agility."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "With each strike at his adversaries, Slark's knowledge of their weaknesses improves."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Target Area",
        "Affects Allies"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked. In Ability Draft, Depth Shroud can be unlocked by the player that drafted Shadow Dance.",
        "In Ability Draft, Depth Shroud can be unlocked by the player that drafted Shadow Dance.",
        "Applies the Depth Shroud modifier based on Shadow Dance's current level on allies within the area. If Shadow Dance is not learned, nothing happens upon cast, wasting mana and cooldown.",
        "If Shadow Dance is not learned, nothing happens upon cast, wasting mana and cooldown.",
        "The modifier provides the same movement speed, health regeneration, and invisibility as Shadow Dance does. The modifier fully stacks with those of Shadow Dance. This means during Shadow Dance, Slark gains a total of 48%\/72%\/96% movement speed and 10%\/12%\/14% max health as health regeneration while inside the area.",
        "The modifier fully stacks with those of Shadow Dance.",
        "This means during Shadow Dance, Slark gains a total of 48%\/72%\/96% movement speed and 10%\/12%\/14% max health as health regeneration while inside the area.",
        "The buff is provided by an aura. Its buff lingers for 0.5 seconds.",
        "Affects every allied unit that is not a building or ward. Does not affect invulnerable or hidden units.",
        "Does not affect invulnerable or hidden units.",
        "Can regenerate up to 17.5%\/21%\/24.5% of the affect unit's max health over its full duration."
      ],
      "mana": "75",
      "hotKey": "D",
      "cooldown": "75",
      "description": "Creates a 300 AoE cloud at the target location for 3 seconds. All allies inside the radius are hidden and affected by Shadow Dance. Cast Range: 800. Cooldown: 75",
      "spellName": "Depth Shroud",
      "params": [
        "Cast Animation: 0.1+0.8",
        "Cast Range: 800",
        "Radius: 300",
        "Duration: 3",
        "Aura Linger Duration: 0.5",
        "Attack Speed Bonus: 50"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Slark_Shadow_Dance.mp3\/revision\/latest?cb=20191216023923",
      "effects": [
        "Ability No Target \/ Passive",
        "Affects Self"
      ],
      "notes": [
        "Shadow Dance interrupts Slark's channeling abilities upon cast.",
        "Slark gains or loses the health regeneration and movement speed bonus 0.5 seconds after getting in or out of enemy vision, or casting Shadow Dance.",
        "If Slark is damaged by a neutral creep, the health regeneration and movement speed bonus are lost for 2 seconds.",
        "When casting Shadow Dance, he turns invisible and cannot be revealed by anything. However, the black cloud created is visible to enemies.",
        "The invisibility is granted by an aura, however, its buff does not linger. The aura does not affect invulnerable units, so if Slark turns invulnerable during it, he gets revealed.",
        "The aura does not affect invulnerable units, so if Slark turns invulnerable during it, he gets revealed.",
        "Shadow Dance does not grant phased movement.",
        "Can regenerate up to 20%\/25.5%\/31.5% (TagTalent 25%\/31.5%\/38.5%) of Slark's max health over its active duration. Can regenerate up to 300%\/360%\/420% of Slark's max health in one minute. Can fully regenerate Slark's health within 20\/16.67\/14.29 seconds.",
        "Can regenerate up to 300%\/360%\/420% of Slark's max health in one minute.",
        "Can fully regenerate Slark's health within 20\/16.67\/14.29 seconds."
      ],
      "mana": "120",
      "hotKey": "R",
      "cooldown": "75\/60\/45",
      "description": "When used, Slark hides himself in a cloud of shadows, becoming immune to detection. Attacking, casting spells, and using items will not reveal Slark. Passively, when not visible to the enemy team, Slark gains bonus movement speed and health regeneration.",
      "spellName": "Shadow Dance",
      "params": [
        "Cast Animation: 0+0",
        "Aura Radius: 0",
        "Fade Time: 0",
        "Move Speed Bonus: 24%\/36%\/48%",
        "Max Health as Regen per Second: 5%\/6%\/7%",
        "Passive Activation Delay: 0.5",
        "Neutral Creep Damage Deactivate Duration: 2",
        "Active Duration: 4\/4.25\/4.5 (TagTalent 5\/5.25\/5.5)",
        "Active Attack Speed Bonus: 50",
        "Grants a new ability: Depth Shroud.",
        "Regeneration and movement speed bonus are disabled, active invisibility is not.",
        "Illusions get the buff, but it does not grant them the health regen and movement speed."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "The hidden Thirteenth is a slippery foe."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.9,
    "attrStrength": 21.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.7,
    "attrAgility": 21.0
  },
  "description": "Slark, the Nightcrawler, is a melee agility hero that utilizes his abilities to spring onto enemy heroes and slip out unhindered. He is a very mobile ganker, but remains attribute-wise below most other carries unless he is able to steal away attributes with his abilities. Once he does, though, only a few heroes can hope to be as fearsome as the Nightcrawler - extremely mobile to the point of ever-presence, his strikes only hitting harder and faster.",
  "history": "Little known to the inhabitants of the dry world, Dark Reef is a sunken prison where the worst of the sea-breed are sent for crimes against their fellows. It is a razor barbed warren full of murderous slithereen, treacherous Deep Ones, and sociopathic meranths. In this dim labyrinth, patrolled by eels and guarded by enormous anemones, only the vicious survive. Pitched into Dark Reef for crimes unknown, Slark spent half a lifetime without kin or kindness, trusting no one, surviving through a combination of stealth and ruthlessness, keeping his thoughts and his plans to himself. When the infamous Dark Reef Dozen plotted their ill-fated breakout, they kept their plans a perfect secret, murdering anyone who could have put the pieces together--but somehow Slark discovered their scheme and made a place for himself in it. Ten of the Dozen died in the escape attempt, and two were captured, hauled back to Dark Reef, then executed for the entertainment of their fellow inmates. But Slark, the unsung thirteenth, used the commotion as cover and slipped away, never to be caught. Now a furtive resident of the carnivorous mangrove scrub that grips the southern reach of Shadeshore, Slark remains the only successful escapee from Dark Reef.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+65s Essence Shift Duration",
      "talentRight": "+1s Shadow Dance Duration"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0.8s Pounce Leash",
      "talentRight": "+1 Agility Gained per Essence Shift Attack"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+50 Shadow Dance Attack Speed",
      "talentRight": "+70 Dark Pact Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8 Agility",
      "talentRight": "-1s Dark Pact Cooldown"
    }
  ]
}