{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Armor Corruption Strike from talents is not disabled by Break. The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes.",
        "The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 Familiar",
          "talentRight": "+5 Gravekeeper's Cloak Stacks"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 Familiars Movement Speed",
          "talentRight": "+20 Soul Assumption Damage Per Charge"
        },
        {
          "talentLvl": "15",
          "talentLeft": "Soul Assumption Hits 2 Targets",
          "talentRight": "-3 Armor Corruption"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+25 Damage",
          "talentRight": "-3s Grave Chill Cooldown"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Visage_Grave_Chill.mp3\/revision\/latest?cb=20191216030319",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "The slow and speed bonus values are independent from each other. Upon cast, Visage gains movement speed based on his current movement speed while the affected target loses movement speed based on theirs. The same applies for the attack speed bonus and its reduction. This also means when either Visage or the target loses the buff\/debuff, the other still keep theirs.",
        "Upon cast, Visage gains movement speed based on his current movement speed while the affected target loses movement speed based on theirs.",
        "The same applies for the attack speed bonus and its reduction.",
        "This also means when either Visage or the target loses the buff\/debuff, the other still keep theirs.",
        "The buff is also applied to Familiars within 900 range of Visage. The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden. However, the buff is not applied to any other player-controlled units.",
        "The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden.",
        "However, the buff is not applied to any other player-controlled units.",
        "Grave Chill places a separate buff on each Familiar. Since the buff is not aura-based, Familiars can move away from Visage and still keep the buff after Grave Chill is cast. Dispelling Visage does not remove the buff on the Familiars. While active, increases Visage's total movement speed to 327.75\/342\/356.25\/370.5 and the Familiars' movement speed to 494.5\/516\/537.5\/559 (TagTalent 540.5\/564\/587.5\/611).",
        "Since the buff is not aura-based, Familiars can move away from Visage and still keep the buff after Grave Chill is cast.",
        "Dispelling Visage does not remove the buff on the Familiars.",
        "While active, increases Visage's total movement speed to 327.75\/342\/356.25\/370.5 and the Familiars' movement speed to 494.5\/516\/537.5\/559 (TagTalent 540.5\/564\/587.5\/611)."
      ],
      "mana": "90",
      "item_behaviour": [],
      "name": "Grave Chill",
      "cooldown": "16\/14\/12\/10 (TagTalent 13\/11\/9\/7)",
      "description": "Visage drains the movement and attack speed of the targeted unit, gaining it for itself and nearby familiars.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range: 625",
        "Familiar Search Radius: 900",
        "Move Speed Change: 15%\/20%\/25%\/30%",
        "Attack Speed Change: 34\/46\/58\/70",
        "Duration: 6",
        "Applies self-buff while spell immune. Cannot target spell immune enemies. Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "When blocked, Visage is not boosted either."
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Visage_Soul_Assumption_1.mp3\/revision\/latest?cb=20191216030321",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1000.",
        "Each instance of damage taken by heroes within 1800 radius is saved for 6 seconds or until Soul Assumption is cast. When the sum of the saved damage exceeds 100 damage, a charge is added. A total of 300\/400\/500\/600 damage is needed, within the radius in the last 6 seconds to reach the maximum amount of charges.",
        "When the sum of the saved damage exceeds 100 damage, a charge is added.",
        "A total of 300\/400\/500\/600 damage is needed, within the radius in the last 6 seconds to reach the maximum amount of charges.",
        "Only counts damage values between 2 – 3000 (after reductions) that is dealt by player-controlled units and Roshan to heroes (and clones). Does not count damage less or more than the values above, or from self-inflicted damage sources (e.g. Mist Coil), or from illusions and creep-heroes.",
        "Does not count damage less or more than the values above, or from self-inflicted damage sources (e.g. Mist Coil), or from illusions and creep-heroes.",
        "The number of current charges is visible in the form of yellow bars above Visage. This is visible to Visage and his allies only.",
        "Upon cast, Soul Assumption's damage is set and the charges counter is reset upon projectile launch. The projectile's visual appearance also reflects the amount of charges, revealing how much damage it is approximately about to deal.",
        "The projectile's visual appearance also reflects the amount of charges, revealing how much damage it is approximately about to deal.",
        "With 0\/1\/2\/3\/4\/5\/6 charges, Soul Assumption can deal 20\/95\/170\/245\/320\/395\/470 (TagTalent 20\/115\/210\/305\/400\/495\/590) damage to the target (before reductions).",
        "With the level 15 talent, Soul Assumption launches another additional projectile towards a random visible valid target within the search range. With Soul Assumption's cast range and the secondary target range buffer, the ability has a search range of 1300. Since the additional projectile uses the ability's cast range, cast range increasing effects increase its search range as well. If no other valid targets are found within the search radius, the second Soul Assumption is not released. Heroes and illusions have a higher priority than other units. Treats creep-heroes as creeps.",
        "With Soul Assumption's cast range and the secondary target range buffer, the ability has a search range of 1300.",
        "Since the additional projectile uses the ability's cast range, cast range increasing effects increase its search range as well.",
        "If no other valid targets are found within the search radius, the second Soul Assumption is not released.",
        "Heroes and illusions have a higher priority than other units. Treats creep-heroes as creeps."
      ],
      "mana": "125",
      "item_behaviour": [],
      "name": "Soul Assumption",
      "cooldown": "4",
      "description": "Visage gathers charges of soul essence each time nearby heroes take more than 100 damage. When the essence is released, it deals base damage as well as damage for each gathered soul charge.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range: 1000",
        "Damage Gather Radius: 1800",
        "Number of Targets: 1 (TagTalent 2)",
        "Charge Gain Damage Threshold: 100",
        "Max Charges: 3\/4\/5\/6",
        "Base Damage: 20",
        "Damage per Charge: 75 (TagTalent 95)",
        "Charge Duration: 6",
        "Secondary Target Range Buffer: 300",
        "Blocked upon impact."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Visage_Gravekeeper%27s_Cloak.mp3\/revision\/latest?cb=20210103162728",
      "effects": [
        "Ability Passive (TagAghanim No Target)",
        "Affects Self (TagAghanim Enemies)",
        "Damage Magical"
      ],
      "notes": [
        "Applies generic incoming damage reduction on Visage. Stacks additively with other sources of generic incoming damage manipulation. The reduction affects all damage Visage takes that is not flagged as HP removal.",
        "The reduction affects all damage Visage takes that is not flagged as HP removal.",
        "Upon learning, 4 floating stones appear around Visage, indicating the number of layers he has. A stone disappears for each missing layer. If he has more than 4 layers, the amount of floating stones around him will still be 4, and the stones start disappearing once his layers drop below 4 layers. The number of layers can be seen on the status buff icon as well. The damage reduction only reacts on player-based damage instances that are greater than 40 (after all other reductions). Does not interact at all with damage instances lower than the value above, or self-inflicted damage sources.",
        "A stone disappears for each missing layer. If he has more than 4 layers, the amount of floating stones around him will still be 4, and the stones start disappearing once his layers drop below 4 layers.",
        "The number of layers can be seen on the status buff icon as well.",
        "The damage reduction only reacts on player-based damage instances that are greater than 40 (after all other reductions).",
        "Does not interact at all with damage instances lower than the value above, or self-inflicted damage sources.",
        "With 4 layers, the damage reduction is hard capped at 32%\/48%\/64%\/80%, unless the Gravekeeper Cloak stacks increasing talent is learned. As the layers recharge, and once it reaches the 80% damage reduction cap, subsequent layers added will be also at their maximum damage reduction potency, until it reaches the maximum layers count. With the level 25 talent, subsequent layers added after the 4th stack will be at 80% damage reduction, up to the 9th stack. For how much damage reduction is granted per layer, please refer to the chart below.",
        "As the layers recharge, and once it reaches the 80% damage reduction cap, subsequent layers added will be also at their maximum damage reduction potency, until it reaches the maximum layers count.",
        "With the level 25 talent, subsequent layers added after the 4th stack will be at 80% damage reduction, up to the 9th stack.",
        "For how much damage reduction is granted per layer, please refer to the chart below.",
        "The aura also affects all Familiars under Visage's control, granting them damage reduction based on the current charges on Visage. The buff lingers for 0.5 seconds. Unlike the damage reduction on Visage, this damage reduction has no minimum threshold and no maximum cap on Familiars. This means it reduces any damage they take, no matter how small, and that it grants them 100% incoming damage reduction when at 13\/9\/7\/5 charges. The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden. However, the buff is not applied to any other player-controlled units.",
        "Unlike the damage reduction on Visage, this damage reduction has no minimum threshold and no maximum cap on Familiars.",
        "This means it reduces any damage they take, no matter how small, and that it grants them 100% incoming damage reduction when at 13\/9\/7\/5 charges.",
        "The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden.",
        "However, the buff is not applied to any other player-controlled units.",
        "With Aghanim's Shard, Gravekeeper's Cloak turns into an active ability. The passive component is still present. Except for the health regeneration, the other values are taken from Stone Form, based on the current level of Summon Familiars. If Summon Familiars is not learned, nothing happens upon cast, wasting the mana and cooldown.",
        "Except for the health regeneration, the other values are taken from Stone Form, based on the current level of Summon Familiars.",
        "If Summon Familiars is not learned, nothing happens upon cast, wasting the mana and cooldown.",
        "Visage is rooted during the 0.55 seconds effect delay. He can still turn, attack, and cast abilities and items during the effect delay.",
        "Gravekeeper's Cloak first applies the debuff, then the damage.",
        "After the effect delay, Visage is invulnerable and disabled. The 60\/100\/140 area damage and 1\/1.25\/1.5 second stun duration is then applied, and Visage regenerates 5.83% of his maximum health over the duration. If Visage dies during the effect delay, the area damage and stun are not applied, but the visual effects still appear. The duration is indicated by a yellow number above Visage. This number is visible to Visage only.",
        "The 60\/100\/140 area damage and 1\/1.25\/1.5 second stun duration is then applied, and Visage regenerates 5.83% of his maximum health over the duration.",
        "If Visage dies during the effect delay, the area damage and stun are not applied, but the visual effects still appear.",
        "The duration is indicated by a yellow number above Visage. This number is visible to Visage only.",
        "The stun and damage location is determined upon landing, not upon cast. Upon landing, trees within 350 radius are destroyed.",
        "Upon landing, trees within 350 radius are destroyed."
      ],
      "mana": "125",
      "item_behaviour": [],
      "name": "Gravekeeper's Cloak",
      "cooldown": "60",
      "description": "Visage generates a layered barrier that protects him from damage. If he receives damage from a player, one layer is removed, and takes time to recover.",
      "hot_key": "E",
      "params": [
        "Aura Radius: 1200",
        "Max Layers: 4 (TagTalent 9)",
        "Damage Reduction per Layer: 8%\/12%\/16%\/20%",
        "Damage Reduction Cap: 80%",
        "Min Damage Threshold: 40",
        "Layer Recharge Time: 6\/5\/4\/3",
        "Aura Linger Duration: 0.5",
        "Active Maximum Health Restored: 35%",
        "Grants Visage the ability to cast Stone Form. Restores up to 35% of your health. Cooldown: 60. Manacost: 125.",
        "Does not reduce damage or lose charges during Break. Lost charges still recharge normally. Damage reduction on Familiars is only disabled when applying Break on Visage, not on the Familiar itself."
      ],
      "legacy_key": "V",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Stone Form does not interrupt Visage's channeling abilities upon cast.",
        "This ability is disabled when no Familiar has Stone Form ready. The ability goes on a cooldown equal to the cooldown time of the Stone Form with the lowest cooldown among all Familiars. The cooldown is not affected by any cooldown reduction and cooldown resets sources, it periodically updates itself to match the next lowest Stone Form cooldown. This means re-casting Summon Familiars while the sub-ability is on cooldown, Stone Form is instantly ready to be cast again.",
        "The ability goes on a cooldown equal to the cooldown time of the Stone Form with the lowest cooldown among all Familiars.",
        "The cooldown is not affected by any cooldown reduction and cooldown resets sources, it periodically updates itself to match the next lowest Stone Form cooldown.",
        "This means re-casting Summon Familiars while the sub-ability is on cooldown, Stone Form is instantly ready to be cast again.",
        "Upon cast, it orders the closest Familiar to enter Stone Form automatically. Familiars entering Stone Form via this sub-ability do not trigger on-cast effects. If the familiar is stunned, silenced, sleeping, hidden, taunted, feared, or hypnotized, it cannot be made to enter Stone Form.",
        "Familiars entering Stone Form via this sub-ability do not trigger on-cast effects.",
        "If the familiar is stunned, silenced, sleeping, hidden, taunted, feared, or hypnotized, it cannot be made to enter Stone Form.",
        "This ability can be cast when Visage is stunned, cycloned, sleeping, taunted, hidden, or during Forced Movement. However, he cannot use this ability while silenced, hexed or prevented from acting. Visage is unable to ⇧ Shift-queue this ability.",
        "However, he cannot use this ability while silenced, hexed or prevented from acting.",
        "Visage is unable to ⇧ Shift-queue this ability."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Stone Form",
      "cooldown": "0",
      "description": "After a short delay, the nearest Familiar turns into stone and smashes into the ground, stunning and damaging all targets in the area. The Familiar becomes invulnerable, and will regain its health very rapidly. After 6 seconds, the Familiar will automatically leave Stone Form.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d9\/Visage_Silent_as_the_Grave.mp3\/revision\/latest?cb=20210103162730",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Silent as the Grave does not interrupt Visage's channeling abilities upon cast.",
        "Only affects Visage and his Familiars, regardless of where they are on the map. Does not affect any other player-controlled units. While active, increases Visage's total movement speed to 342 and the Familiars' movement speed to 516 (TagTalent 564).",
        "Does not affect any other player-controlled units.",
        "While active, increases Visage's total movement speed to 342 and the Familiars' movement speed to 516 (TagTalent 564).",
        "The invisibility is lost upon reaching the cast point of abilities, or upon landing an attack on an enemy. This means if the attack misses, the invisibility is not lost. Visage can pick up, drop, and attack items without breaking the invisibility.",
        "This means if the attack misses, the invisibility is not lost.",
        "Visage can pick up, drop, and attack items without breaking the invisibility.",
        "Grants Visage unobstructed movement, but does not grant flying vision.",
        "The main attack damage buff is granted whenever the invisibility buff is lost in any way. The attack damage bonus is also granted by the invisibility buff itself so that the first attack out of the invisibility has the bonus as well. Only increases base attack damage and damage granted by primary attributes of affected units. It does not increase bonus attack damage.",
        "The attack damage bonus is also granted by the invisibility buff itself so that the first attack out of the invisibility has the bonus as well.",
        "Only increases base attack damage and damage granted by primary attributes of affected units. It does not increase bonus attack damage."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Silent as the Grave",
      "cooldown": "45",
      "description": "Turns Visage and familiars invisible, granting Visage movement speed and upgrading its movement type to flying. When Visage or its familiars leave invisibility they deal more damage for 4 seconds. Lasts 35 seconds. Invisibility ends when attacking or casting.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 0+0",
        "Fade Time: 0",
        "Move Speed Bonus: 20%",
        "Attack Damage Bonus: 30%",
        "Damage Bonus Duration: 4",
        "Invisibility Duration: 35"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Visage_Summon_Familiars.mp3\/revision\/latest?cb=20191216030324",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Summon Familiars interrupts Visage's channeling abilities upon cast.",
        "Casting Summon Familiars replaces all currently active Familiars from a previous cast. Their attack damage, health, and armor values (including Stone Form's level) are only updated upon ability recast, and not immediately upon leveling the ability up.",
        "Their attack damage, health, and armor values (including Stone Form's level) are only updated upon ability recast, and not immediately upon leveling the ability up.",
        "The Familiars are summoned 200 range in front on Visage, with 120 range distance between the Familiars. Visage is always at the center of the line. Familiars have flying movement. They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "Familiars have flying movement.",
        "They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities."
      ],
      "mana": "150",
      "item_behaviour": [],
      "name": "Summon Familiars",
      "cooldown": "130\/120\/110",
      "description": "Conjures two blind Familiars to fight for Visage. Familiars possess the Stone Form ability, that allows them to turn into stone, stunning enemies upon landing. While in Stone Form, Familiars are invulnerable, and rapidly regenerate their health. Familiars grant high bounty when killed.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Number of Familiars: 2 (TagTalent 3)",
        "Familiar Duration: Permanent",
        "Grants a new ability: Silent as the Grave."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Familiar_Stone_Form_1.mp3\/revision\/latest?cb=20191216030317",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "The Familiar is rooted during the 0.55 effect delay. It can still turn, attack, and cast abilities during the effect delay.",
        "Stone Form first applies the debuff, then the damage.",
        "After the effect delay, the Familiar is invulnerable and disabled. The 60\/100\/140 area damage and 1\/1.25\/1.5 seconds stun is then applied, and it regenerates up to 900\/1050\/1200 health over its full duration. When a Familiar dies during the effect delay, the area damage and stun are not applied, but the visual effects still appear. The duration is indicated by a yellow number above the Familiar. This number is visible to Visage only.",
        "The 60\/100\/140 area damage and 1\/1.25\/1.5 seconds stun is then applied, and it regenerates up to 900\/1050\/1200 health over its full duration.",
        "When a Familiar dies during the effect delay, the area damage and stun are not applied, but the visual effects still appear.",
        "The duration is indicated by a yellow number above the Familiar. This number is visible to Visage only.",
        "The stun and damage location is determined upon landing, not upon cast. Upon landing, trees within 350 radius are destroyed.",
        "Upon landing, trees within 350 radius are destroyed."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Stone Form",
      "cooldown": null,
      "description": "After a short delay, the Familiar turns into stone and smashes into the ground, stunning and damaging all targets in the area. The Familiar becomes invulnerable, and will regain its health very rapidly. After 6 seconds, the Familiar will automatically leave Stone Form.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0",
        "Effect Radius: 350",
        "Effect Delay: 0.55",
        "Health Regen Bonus: 150\/175\/200",
        "Damage: 60\/100\/140",
        "Stun Duration: 1\/1.25\/1.5",
        "Stone Form Duration: 6",
        ""
      ],
      "legacy_key": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 1.3,
    "attrAgility": 11.0
  },
  "description": "Visage, the bound form of Necro'lic, is a ranged intelligence hero whose traits are unusual when compared to most intelligence heroes; he can be a ganker, tank, or nuker. Resilient and ruthless, Visage is a highly aggressive hero thanks to his great Strength gain and Gravekeeper's Cloak which allow him to soak up surprising amounts of damage. This is especially true from attacks mounted by Heroes who try to chip at his health with spells and burst damage without committing to a protracted engagement. This unholy gargoyle thrives in the midst of large battles, where the abundant pain and suffering in the air charges his Soul Assumption, allowing him to fire off huge bursts of magical damage in rapid succession. Additionally, Visage's proficiency with attacks is augmented by his ability to absorb the attack and movement speed of his foes with Grave Chill. Finally, his versatile ultimate, Familiars, is arguably one of the best scouting utilities in the game while also being excellent sources of damage and AoE disables. Utilizing his Familiars to their fullest requires constant split attention and good positioning to avoid feeding their large bounties to an enemy Hero. With a legion of ghostly gargoyles, incredible toughness, and fast attacks, Visage sows terror and agony, relentlessly hunting poor souls and leading them in the shackles of death to the gates of the Underscape.",
  "history": "Perched atop the entrance to the Narrow Maze sit the looming shapes of sneering gargoyles, the paths into the hereafter forever in their gaze. Beasts and birds, men and monsters, all creatures that die and choose to travel beyond must someday pass beneath their sight. For an untethered spirit, the decision to journey through the veil of death is irrevocable. When chance comes, and by craft or cunning some restless soul escapes their hells and heavens, it is the dreaded gargoyle Visage, the bound form of the eternal spirit Necro’lic, who is dispatched to reclaim them. Ruthless and efficient, unhindered by the principles of death and fatigue, Visage stalks its prey without mercy or end, willingly destroying all which may give shelter to the fugitive essence. That which flaunts the laws of the afterlife may never rest, for while it is true that the dead may be revived, it is only a matter of time before Visage finds and returns them to their proper place.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 Familiar",
      "talentRight": "+5 Gravekeeper's Cloak Stacks"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 Familiars Movement Speed",
      "talentRight": "+20 Soul Assumption Damage Per Charge"
    },
    {
      "talentLvl": "15",
      "talentLeft": "Soul Assumption Hits 2 Targets",
      "talentRight": "-3 Armor Corruption"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+25 Damage",
      "talentRight": "-3s Grave Chill Cooldown"
    }
  ]
}