{"abilities":[{"effects":["Радиус: 900","Бонус к скорости передвижения: 13%","Бонус к скорости атаки: 35","Длительность: 6"],"notes":["Прерывает произносимые заклинания владельца при применении.","Несколько использований Endurance не накапливают бафф, но вместо этого возобновляют длительность.","Влияет только на подконтрольных игроку юнитов, включая неуязвимых юнитов, и исключая варды."],"elements":["Способность Ненаправленная","Действует на Союзников"],"name":"Endurance","description":"Дает +35 к скорости атаки и +13% к скорости передвижения союзников в радиусе 900."},{"effects":["Радиус: 1200","Доп. скорость передвижения: 6%","Длительность задержки ауры: 0,5"],"notes":["Бафф ауры задерживается на 0,5 секунды.","Полностью сочетается с другими бонусами к скорости передвижения, кроме Swiftness Aura от нескольких таких же предметов.","Затрагивает неуязвимых юнитов."],"elements":["Способность Аура","Действует на Союзников"],"name":"Swiftness Aura","description":"Увеличивает скорость передвижения союзников в радиусе 1200."}],"cost":"1525","description":"Артефакт, дающий жизненные силы и ускоряющий всех вокруг.","further":["Crown","Sage's_Mask","Wind_Lace","Рецепт"],"attrs":["Активируемая Endurance","Зарядов 6","Пассивная Swiftness Aura","Бонус +6 к силе +6 к ловкости +6 к интеллекту +1,5 к регенерации маны","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 135 здоровья, 0,75 регенерации здоровья, 0,6% сопротивления магии, 0,96 брони, 6 скорости атаки, 0,3% скорости передвижения, 72 маны, 1,8 регенерации маны, 0,42% урона от способностей и 6 урона от атаки.","Для героев ловкости, даёт 108 здоровья, 0,6 регенерации здоровья, 0,48% сопротивления магии, 1,2 брони, 7,5 скорости атаки, 0,38% скорости передвижения, 72 маны, 1,8 регенерации маны, 0,42% урона от способностей и 6 урона от атаки.","Для героев интеллекта, даёт 108 здоровья, 0,6 регенерации здоровья, 0,48% сопротивления магии, 0,96 брони, 6 скорости атаки, 0,3% скорости передвижения, 90 маны, 1,88 регенерации маны, 0,53% урона от способностей и 6 урона от атаки. Вместе с активируемой способностью, дает владельцу в итоге 41 скорости атаки.","Предмет не исчезает после использования всех зарядов.","Заряды можно возобновить повторной покупкой рецепта."]}