{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Magic_Stick_Energy_Charge.mp3\/revision\/latest?cb=20191227195452",
      "effects": [
        "Радиус: 1200",
        "Зарядов за использованную способность: 1",
        "Максимум зарядов: 20",
        "Восст. здоровья и маны за заряд: 15"
      ],
      "notes": [
        "Прерывает произносимые заклинания владельца при применении.",
        "Получает 1 заряд когда видимое вражеское существо, включая нейтральных крипов, использует способность в радиусе 1200.",
        "Не получает заряды от переключаемых способностей, активных модификаторов атаки и способностей указанных здесь. Не получает заряды от срабатывания пассивных способностей (например, Quill Spray, Borrowed Time). Не получает заряды если враг применит способность, которая выведет его из невидимости (например, Moonlight Shadow).",
        "Не получает заряды от срабатывания пассивных способностей (например, Quill Spray, Borrowed Time).",
        "Не получает заряды если враг применит способность, которая выведет его из невидимости (например, Moonlight Shadow).",
        "Клоны, иллюзии и крипы-герои не могут получать заряды.",
        "Может восстановить до 300 здоровья и маны при максимальном количестве зарядов.",
        "При наличии нескольких предметов основанных на Magic Stick в инвентаре, первым заряды получит тот, который был раньше. Если он полон, то получать заряды начнёт второй по давности. При улучшении в предметы основанные на Magic Stick, все текущие заряды будут перенесены. Делит перезарядку с Magic Stick и Holy Locket.",
        "При улучшении в предметы основанные на Magic Stick, все текущие заряды будут перенесены.",
        "Делит перезарядку с Magic Stick и Holy Locket."
      ],
      "mana": "0",
      "abilityName": "Energy Charge",
      "cooldown": "13",
      "description": "Мгновенно восстанавливает 15 здоровья и маны за каждый имеющийся заряд. Может иметь до 20 зарядов. Получает один заряд каждый раз, когда видимый враг в радиусе 1200 использует способность.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "60 здоровья и 0,3 восстановления здоровья.",
    "36 маны и 0,15 восстановления маны.",
    "3 скорости атаки и 0,5 основной брони.",
    "3 основного урона от атаки всем \/ \/ героям."
  ],
  "cost": "450",
  "lore": null,
  "consistFrom": [
    "Magic Stick",
    "Iron Branch",
    "Iron Branch",
    "Recipe"
  ],
  "name": "Magic Wand",
  "description": "Простая волшебная палочка, в которой концентрируют магическую энергию начинающие волшебники и великие колдуны.",
  "trivia": null,
  "upgradeIn": [
    "Holy Locket"
  ],
  "tips": null
}