{
  "abilities": [
    {
      "notes": [
        "При использовании Plasma Field прерывает произносимые способности Razor",
        "Plasma Field закреплена за героем и перемещается вместе с ним\n Круг расширяется и сужается со скоростью 636 единиц; требуется 1,1 секунды для максимального расширения\n Дает летающий обзор в радиусе 700 единиц на 2,2 секунды, следующий за героем и оставляющий след обзора, длящийся 2 секунды",
        "Область поражения Plasma Field представляет собой кольцо радиусом в 200 единиц, находящееся прямо перед видимым кольцом\n То есть при использовании эффект мгновенно поражает существ в радиусе 200\n При расширении задевает существ на расстоянии до 900\n При возвращении эффект применяется после прохождения сквозь существ\n Урон и замедление применяются при расширении и возвращении волны, поэтому способность может поразить каждого врага дважды\n Дебафф замедления складывается"
      ],
      "item_behaviour": [],
      "description": "Герой высвобождает волну энергетической плазмы, которая затем возвращается к нему. Волна замедляет врагов и наносит им урон: чем дальше она от владельца, тем замедление и урон сильнее. Волна наносит урон дважды, при движении в обе стороны.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Макс\n радиус: 700",
        "Ширина урона: 200",
        "Минимальный урон: 35\/40\/45\/50",
        "Максимальный урон: 80\/115\/150\/185",
        "Мин\n замедление скорости передвижения: 5%",
        "Макс\n замедление скорости передвижения: 25%\/30%\/35%\/40%",
        "Длительность замедления: 1,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Razor_Plasma_Field_1.mp3\/revision\/latest?cb=20191216022243",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "13\/12\/11\/10",
      "aghanim": null,
      "name": "Plasma Field",
      "cooldown": "125",
      "legacy_key": "F",
      "story": "Плазменная мощь держит загробный мир во власти призрака молний."
    },
    {
      "notes": [
        "Static Link разрывается, если существо под действием способности умирает или расстояние от него до Razor превышает 800\n Иные варианты не смогут разорвать связь\n Расстояние между Razor и целью проверяется перед каждым интервалом кражи урона\n Если расстояние превышено при проверке, связь разорвется\n Поскольку связь использует дальность применения способности, то эффекты, увеличивающие дальности, влияют на её дальность",
        "Static Link при похищении урона дает общий обзор на цель\n Продолжит похищать урон, даже если урон цели достиг 0",
        "Вытягивает 1,75\/3\/4,25\/5,5 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3\/4,25\/5,5\/6,75) урона с интервалом в 0,25 секунды спустя 0,25 секунды после применения, срабатывая 20\/24\/28\/32 раз\n Крадет до 35\/72\/119\/176 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 60\/102\/154\/216) урона, если его вытягивали всю длительность",
        "Static Link отдает Razor приказ на атаку цели при применении и с каждым приказом на передвижение\n Способность позволяет Razor перемещаться при атаке цели\n Для отмены атак при передвижении Razor нужно отдать приказ на выбор существа или точки на земле, не связанный с перемещением или атакой",
        "Можно применять на героев, иллюзии и крипов-героев",
        "Несколько применений Static Link действуют отдельно друг от друга, размещая за каждое применение дебафф на цель и бафф на Razor\n При этом модификатор обзора не складывается\n Он исчезнет, как только закончится первая связь\n При движении совершает атаки только по первой цели заклинания"
      ],
      "item_behaviour": [],
      "description": "Создаёт электрическую связь с выбранным вражеским героем, передавая его урон от атак владельцу способности. Пока связь действует, атаки не прерывают передвижение.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 550",
        "Доп\n дальность разрыва: 250",
        "Скорость похищения урона: 7\/12\/17\/22 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 12\/17\/22\/27)",
        "Длительность связи: 5\/6\/7\/8",
        "Длительность эффекта: 15\/16\/17\/18"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f2\/Razor_Static_Link.mp3\/revision\/latest?cb=20191216022229",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев"
      ],
      "mana": "40\/35\/30\/25",
      "aghanim": null,
      "name": "Static Link",
      "cooldown": "65",
      "legacy_key": "C",
      "story": "Полярность призрака молний тянет к нему электричество, высасывая силы из противоположностей."
    },
    {
      "notes": [
        "С <span image=\"items\/aghanim's_shard\/full.webp\">[picture:aghanim's_shard]<\/span> Aghanim's Shard срабатывает только при попадании атаки вражеского существа в Razor независимо от расстояния\n То есть способность не срабатывает от промахнувшихся атак\n Не срабатывает от атак построек и вардов\n Срабатывает от союзных атак\n Срабатывание активируется союзником, но способность всё равно выбирает вторичными цели врагов\n Также срабатывает от направленных на Razor заклинаний, включая направленные на точку с возможностью выбора существа\n То есть способность не следует спискам механик «Отражение заклинаний» и «Блокировка заклинаний»\n Способности со снарядами активируют Storm Surge при запуске, а не при попадании",
        "Эффект Storm Surge применяется после активировавшей его способности\n То есть, если существо умрет от урона, то его способность всё равно сработает",
        "Радиус поиска закреплен за существом, на которое сработал эффект, а не за Razor\n Цели выбираются случайно без каких-либо приоритетов\n Если эффект активирован атакой, то он не выбирает вторичными целями невидимых врагов и врагов в тумане войны\n Если эффект активирован способностью, то он выбирает вторичными целями невидимых врагов и врагов в тумане войны",
        "Storm Surge сначала наносит урон, затем применяет дебафф",
        "Storm Surge использует псевдослучайное распределение"
      ],
      "item_behaviour": [],
      "description": "Пассивно увеличивает скорость передвижения владельца.",
      "hot_key": "E",
      "params": [
        "Доп\n скорость передвижения: 12%\/16%\/20%\/24%",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Шанс срабатывания молнии:  18%",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Радиус поиска:  900",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Число целей:  3",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Урон:  150",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Замедление скорости передвижения:  50%",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Длительность замедления:  1,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя ",
        "Урон: "
      ],
      "mana": null,
      "aghanim": null,
      "name": "Storm Surge",
      "cooldown": null,
      "legacy_key": "N",
      "story": "Кто приблизится к призраку молний, в ответ получит шоковую терапию."
    },
    {
      "notes": [
        "При применении прерывает произносимые способности Razor",
        "Eye of the Storm всегда выбирает первой целью существо с наименьшим текущим здоровьем в области действия\n Если в области действия несколько существ с одинаково низким здоровьем, то Eye of the Storm выберет среди них цель случайно\n Способность отдает приоритет врагам под действием модификатора обзора от <span image=\"images\/static_link.webp\">[picture:static_link]<\/span> Static Link, поражая их в первую очередь (даже при наличии других существ в радиусе действия), независимо от значения здоровья\n При наличии в радиусе действия нескольких врагов под действием модификатора обзора способность будет случайно выбирать между ними при каждом ударе",
        "С <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter только одна молния будет бить цель под модификатором обзора\n Молнии не поражают одновременно одну и ту же цель\n Если у двух врагов присутствует модификатор обзора, то каждая молния будет бить свою цель\n При атаках отдает приоритет существам вместо построек и игнорирует постройки для статуй\n Не снижает броню построек",
        "Разряды не являются ни обычными атаками, ни мгновенными, поэтому они игнорируют уклонение и блокировку урона\n Также они не могут активировать эффекты, срабатывающие от удара — (<span image=\"images\/counter_helix.webp\">[picture:counter_helix]<\/span> Counter Helix, <span image=\"images\/moment_of_courage.webp\">[picture:moment_of_courage]<\/span> Moment of Courage и <span image=\"images\/reactive_armor.webp\">[picture:reactive_armor]<\/span> Reactive Armor), и не сбрасывает перезарядку <span image=\"images\/tranquil_boots_%28active%29.png\">[picture:tranquil_boots_%28active%29]<\/span> Tranquil Boots\n Разряды сначала наносят урон, затем снижают броню",
        "Дебафф снижения брони длится столько же, сколько и сама способность, либо до смерти Razor",
        "Не действует на курьеров, <span image=\"images\/roshan.png\">[picture:roshan]<\/span> Рошана, невидимых существ и существ в тумане войны",
        "Eye of the Storm ударяет до 42\/50\/60 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 50\/60\/75) раз и наносит до 2520\/3750\/5400 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3000\/4500\/6750) урона цели (до уменьшений)",
        "Когда Razor становится невидимым, туча и молнии от нее тоже становятся невидимыми, но продолжают бить по ближайшим врагам, не становясь видимыми или слышимыми для них",
        "Eye of the Storm при смерти Razor мгновенно заканчивается"
      ],
      "item_behaviour": [],
      "description": "Собирает над героем грозовую тучу, которая бьёт молнией врага с наименьшим здоровьем, нанося ему урон и снижая его броню.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 500",
        "Число целей: 1 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Ошибка выражения: + не хватает операнда) (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 2, <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Ошибка выражения: + не хватает операнда)",
        "Интервал ударов: 0,7\/0,6\/0,5 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 0,6\/0,5\/0,4)",
        "Урона за удар: 60\/75\/90",
        "Снижение брони за удар: 1",
        "Длительность: 30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Razor_Eye_of_the_Storm_1.mp3\/revision\/latest?cb=20191216022238",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": "80\/70\/60",
      "aghanim": null,
      "name": "Eye of the Storm",
      "cooldown": "100\/150\/200",
      "legacy_key": "E",
      "story": "Как гром среди ясного неба."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.6,
    "attrAgility": 22.0
  },
  "description": "Static Link крадет скорость атаки Вторая волна от Plasma Field через 0,8 сек. −0,1 сек. интервала разрядов Eye of the Storm +21% к скорости передв. от Storm Surge +14 к силе +5 к урону в секунду у Static Link +9 к ловкости +30 к урону от Plasma Field",
  "history": "Никто из легендарных обитателей загробного мира не внушает такой страх, как призрак молний. Держа наготове свою молниеносную плеть, он охраняет порядок в Узком лабиринте, коварные и cпутанные коридоры которого направляют мёртвые души к судьбе, достойной их ума, способностей и упорства. Надзиратель парит над лабиринтом, выискивает замешкавшихся и стегает их обжигающим электрическим хлыстом. Судьба душ вершится их же руками, а разряды молний лишь подгоняют их либо к свету в конце тоннеля, либо к тёмным пучинам вечности. Беспристрастный и почти безразличный в применении силы призрак молний — извечное воплощение господства. Однако по его высокомерным манерам можно догадаться, что он получает от работы сардоническое удовольствие."
}