{"abilities":[{"spell":"Обдаёт выбранную область морозным ветром, который наносит врагам урон и замедляет их передвижение и атаку.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Дает наземный обзор в радиусе 900 единиц в месте использования на 6 секунд.","Crystal Nova сначала наносит урон, а затем применяет дебафф.","При использовании проигрывается звуковой эффект, который слышен всем."],"mana":"130\/145\/160\/175","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"11\/10\/9\/8","name":"Crystal Nova","description":["Анимация применения: 0,3+0,6","Дальность применения: 700 ( 800)","Радиус эффекта: 425","Урон: 130\/170\/210\/260 ( 430\/470\/510\/560)","Замедление скорости передвижения: 20%\/30%\/40%\/50%","Замедление скорости атаки: 20\/30\/40\/50","Длительность замедления: 4.5"],"hot_key":"Q","legacy_key":"V"},{"spell":"Заковывает противника в лёд, нанося ему периодический урон и запрещая двигаться и атаковать. Действует 10 секунд на крипов 6-го уровня или ниже.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Несмотря на визуальные эффекты, Frostbite применяется мгновенно и его нельзя избежать.","Оцепенение и обезоруживание не позволяет цели двигаться, атаковать и применять некоторые заклинания передвижения. Применяет эффект True Sight к цели.","Способность наносит 50 урона с интервалом в 0,5 секунды сразу после применения; на героев урон от способности сработает 3\/4\/5\/6 ( 6\/7\/8\/9) раза или 20 ( 23) раза на крипов.","Может нанести до 150\/200\/250\/300 ( 300\/350\/400\/450) единиц урона героям или 1000 ( 1150) урона крипам (до учета сопротивления).","Применяется к иллюзиям, крипам-героям и Рошану как к героям."],"mana":"140\/145\/150\/155","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"9\/8\/7\/6","name":"Frostbite","description":["Анимация применения: 0,3+0,6","Дальность применения: 525 ( 625)","Урон в секунду: 100","Длительность на героях: 1.5\/2\/2.5\/3 ( 3\/3.5\/4\/4.5)","Длительность на крипах: 10 ( 11.5)"],"hot_key":"W","legacy_key":"E"},{"spell":"Увеличивает восстановление маны у всех союзников на карте. Действует сильнее на владельца способности.","effects":["Способность Аура","Действует на Союзников"],"notes":["Бафф от ауры задерживается на 0,5 секунды.","Восстанавливает 0.1\/0.15\/0.2\/0.25 маны с интервалом в 0,1 секунду, отображается как 1\/1.5\/2\/2.5 маны в секунду. Восстановление для самой Crystal Maiden 0.25\/0.45\/0.65\/0.85 с интервалом в 0.1 секунду, отображается как 2.5\/4.5\/6.5\/8.5 маны в секунду.","Сочитается с другими источниками регенерации маны.","Регенерирует до 60\/90\/120\/150 (150\/270\/390\/510 владельцу способности) единиц маны в минуту.","Талант на 15-ом уровне добавляет к ауре эффект уменьшения потери маны. Снижает все эффекты потери маны союзникам, включая сожжение или вытягивание маны. Все снижения отображены в описании способности. Складывается с другими источниками уменьшения потери маны."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Arcane Aura","description":["Радиус: Глобально","Доп. регенерация маны союзникам: 1\/1.5\/2\/2.5","Доп. регенерация маны себе: 2.5\/4.5\/6.5\/8.5","Снижение потери маны: 0% ( 14%)","Длительность задержки ауры: 0,5"],"hot_key":"E","legacy_key":"R"},{"spell":"Окружает Crystal Maiden случайными ледяными взрывами, замедляющими врагов и наносящими большой урон, в течение 10 секунд.","effects":["Способность Ненаправленная \/ Произносимая","Действует на Врагов","Урон Магический"],"notes":["Замедление действует на всех врагов в радиусе с интервалом в 0,1 секунды без зависимости от ледяных взрывов.","Каждые 0,1 секунды происходит взрыв, всего их 100.","Каждый ледяной взрыв может появится в случайном расстоянии от 195 до 785 от самой Crystal Maiden.","Радиус появления взрыва делится на четыре части по 90° (0°–90°, 90°–180°, 180°–270°, 270°–360°).","Первый взрыв появляется в северо-восточной части круга, далее появление происходит против часовой стрелки.","Максимальная дальность нанесения урона - 1085 (считается из максимального радиуса появления взрывов + радиус взрывов).","Усредненный урон проходит в радиусе 485, далее урон снижается Чуть меньше 50% урона наносится в радиусе 785. В центре применения способности урон чуть побольше (на 5%).","За все время действия наносит около 2000\/3300\/4800 урона в радиусе 485 ±1,9 взрыва.","Если все взрывы смогут попасть в одну цель, способность сможет нанести до 10500\/17000\/25000 ( 16500\/23000\/31000) урона (до учета сопротивления).","Центр применения заклинания всегда находится под Crystal Maiden и следует за ней, даже если она сдвинется (к примеру, использование Force Staff).","Несмотря на визуальные эффекты, урон наносится в тот момент, как только ледяные осколки создаются, а не в момент их падения на землю.","Aghanim's Scepter добавляет способности ауру для Freezing Field, которая отмечает врагов в радиусе действия. Если вражеский юнит находится под эффектом ауры 2,5 секунды, на него сработает Frostbite текущего уровня. Юнит может быть заморожен Freezing Field только один раз за действие ультимейта. Даже если враги вернутся в ауру, на них способность повторно не сработает. Если юнит уже заморожен непосредственно способностью Frostbite, он может повторно попасть под заморозку в течении действия Freezing Field. Отметка ауры сбрасывается, если не действует на юнита. Это значит, что на юнита аура должна повторно действовать в течении 2,5 секунд, чтобы он получил заморозку. Отметка ауры не работает на неуязвимых или спрятанных юнитов. Отметка ауры задерживается на 0,1 секунды."],"mana":"200\/400\/600","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"110\/100\/90","name":"Freezing Field","description":["Анимация применения: 0+0","Максимальное время произнесения: 10","Радиус замедления: 835","Мин. радиус появления взрывов: 195","Макс. радиус появления взрывов: 785","Радиус урона взрывов: 300","Урон: 105\/170\/250 ( 165\/230\/310)","Замедление скорости передвижения: 30%","Замедление скорости атаки: 60","Длительность замедления: 1","Задержка действия Frostbite: 0 ( 2,5)","Доп. броня: 20"],"hot_key":"R","legacy_key":"F"}],"bio":"Рождённая в тихих местах и взращённая вместе со своей огненно-рыжей сестрой, ещё в молодости Рилай поняла, что её внутреннее единство со стихией льда вредит всем вокруг. Источники и горные реки замерзали, стоило ей прикорнуть неподалеку; зреющие плоды сковывал кусачий мороз, а цветущие висячие сады осыпались на землю безжизненной ледяной мозаикой. Когда отчаявшиеся родители решили отселить пламенную Лину на экватор, они изгнали и Рилай, чьим новым домом стали холодные земли Айсрека. Там, в пещере на вершине ледника Голубого сердца, её и стал наставлять маг льда. Спустя многие дни тренировок волшебник признал, что она готова творить магию в одиночку и оставил ей свой пост — а сам спустился вглубь ледника на тысячелетнюю спячку. С тех пор Рилай серьёзно отточила свое мастерство, и с ней не сравнится уже никто.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Золото с таланта является ненадёжным."],"trivia":["Рилай является одним из старейших героев оригинальной DotA в WarCraft: Reign of Chaos. Её прозвищем было \"Frost Maiden\" - \"Морозная Дева\". (Нынешнее \"Crystal Maiden\" - \"Кристальная Дева\")","Имя Crystal Maiden в DotA было Rylai Crestfall. Фамилия Рилай была удалена при переходе в Dota 2 для добавления родственной неприязни с Lina.","Arcane Aura ранее использовала название \"Brilliance Aura\".","В ранних версиях DotA, Crystal Maiden и Lich использовали одну и ту же способность Frost Blast. Однако, в последующих обновлениях, способность для Crystal Maiden была заменена на Crystal Nova, где она стала действовать на точку, в то время как для Lich надо выбрать цель.","В оригинальной DotA из Warcraft, способность Crystal Maiden Frostbite могла заморозить вражеский фонтан, при это действие способности было как на крипов.","В игре \"League of Legends\" существует предмет под названием \"Rylai's Crystal Scepter\" - дань уважения разработчиков игре DotA.","В игре \"World of Warcraft\" есть NPC со стороны Альянса с именем Rylai Crestfall - как дань уважения оригинальной Crystal Maiden из DotA \"Warcraft III\".","Реплика при повышении уровня Играть \"Is it cold in here or is it just me?\" является отсылкой к фильму \"Разрушитель\"","Реплика при возрождении Играть \"You only live ice...\" является отсылкой к популярной фразе 'You Only Live Once (YOLO)' (Живем лишь раз). По другой версии это отсылка к фильму про Джеймса Бонда 1967 года \"You only live twice\".","Реплика Crystal Maiden Играть \"It's all fun and games until someone's frozen solid.\" Это отсылка к новелле написанной Кристофером Брукмайром под названием All Fun and Games until Somebody Loses an Eye\"","Редкая реплика Рилай Играть \"Can you guess my... favorite poet?\" - отсылка к Robert Frost из-за его фамилии."],"talents":["+300 к урону от Crystal Nova:+1,5 сек. действия Frostbite","+60 к урону от Freezing Field:+250 к скорости атаки","+150 золота в минуту:Аура уменьшает расход и сжигание маны на 14%","+100 к дальности способностей:+250 к здоровью"],"tips":["Frostbite запрещает цели перемещаться и атаковать, а также прерывает прерываемые заклинания, в том числе Town Portal Scroll. Однако, под действием способности, вражеские герои могут применять свои способности. Юнит, ушедший в невидимость, под действием этого заклинания, остается видимым пока не закончится Frostbite.","Аура от Arcane Aura может стать приоритетной, особенно при наличии героя(-ев), которому(-ым) нужно много маны.","Freezing Field — очень сильное заклинание, однако оно достаточно непредсказуемо, к тому же часто прерывается оппонентами, т.к. Crystal Maiden чаще всего - Support-герой и Black King Bar или Shadow Blade появляется у нее достаточно редко.","На шестом уровне базового манапула недостаточно для полного прокаста, поэтому перед его достижением стоит купить Enchanted Mango или Magic Wand."],"desc":"Рилай, Crystal Maiden - герой с дальним типом атаки, основной характеристикой которого является интеллект, который использует силу холода и льда, чтобы справится с её противниками. Известная как хорошо сбалансированный герой поддержки, Crystal Maiden владеет сильными атакующими и обезвреживающими заклинаниями, которые позволяют сильно замедлять врагов. Crystal Nova - мощное заклинание, применяемое по области, замедляющее скорость атаки и передвижения врагов на несколько секунд, в то время, как Frostbite заключает врага в лёд на несколько мгновений, сковывая его и нанося немного урона в секунду. Сочетания этих двух способностей вместе с способностями, которыми располагает партнер по линии, как правило, бывает достаточно, чтобы сломить вражеского героя. Её пассивная Arcane Aura также восстановит ману Рилай и её союзникам, усиливая их возможность активно применять заклинания в ранней игре. Хоть её сильное влияние на начальную часть игры может быть подпорчено её чрезвычайной хрупкостью и низкой мобильностью, позднее Рилай может внести ощутимую часть урона в групповых сражениях, если сможет применить свой смертоносный ультимейт, Freezing Field. Её глобальная аура маны, мощные обезвреживающие и атакующие заклинания, простые по применению способности и практически отсутствие зависимости от наличия предметов делают Crystal Maiden надежным героем поддержки, опирающимся на магию, который может оказаться мощным активом любой команды, а разумное использование её ультимейта позволит разгромить врагов. С поддержкой команды и выборе соответствующих предметов Рилай может быть единственным игроком поддержки, который нужен любой команде."}