{"abilities":[{"spell":"Герой наполняет атаки дополнительным чистым уроном, зависящим от его текущего запаса маны. Каждое попадание по вражескому герою крадёт у него интеллект на 80 секунд. Урон наносится по небольшой области.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов \/ Себя","Урон Чистый"],"notes":["Наносит урон как отдельный источник, поэтому на него не работают никакие эффекты от модификаторов атаки.","Наносит урон до применения основной атаки, но продолжает зависеть от попадания атаки по цели.","Проверяет запас маны Outworld Devourer до попадания снаряда, поэтому увеличение или уменьшение запаса маны в момент, пока снаряд летит, повлияет на его урон.","Крадет интеллект после применения урона, так что недавно увеличенный запас маны не повлияет на урон атаки.","Также заставляет атаки временно забирать 12\/24\/36\/48 единиц маны у цели. Потеря маны применяется после урона и до кражи интеллекта.","Когда у цели заканчивается дебафф, первой к ней возвращается забранная мана, а затем восстанавливается интеллект.","В отличии от целей, Outworld Devourer только получает или теряет украденный интеллект, без получения или потери дополнительной маны. Он сохраняет его текущее соотношение маны.","Не может украсть интеллект у иллюзий или клонов Meepo, но может красть его у Tempest Double.","Не может снизить значение вражеского интеллекта ниже 0, но Outworld Devourer всегда получает полное количество интеллекта вне зависимости от оставшегося его количества у цели.","Вражеские герои, чей основной атрибут не интеллект, теряют по 12\/24\/36\/48 маны, 0.05\/0.1\/0.15\/0.2 регенерации маны и 0.07%\/0.14%\/0.21%\/0.28% урона заклинаний. Вражеские герои с основным атрибутом интеллект теряют по 12\/24\/36\/48 маны, 0.05\/0.1\/0.15\/0.2 регенерации маны, 0.07%\/0.14%\/0.21%\/0.28% урона заклинаний и 1\/2\/3\/4 урона от атаки. И наоборот, мана, её регенерация, урон заклинаний и урон от атаки Outworld Devourer увеличиваются на те же значения.","Размещает 1 дебафф на атакуемые цели и 1 бафф на Outworld Devourer, показывающие текущее количество зарядов (количество видно на иконке). Длительность зарядов не зависит друг от друга. Несколько применений не обновляет длительность предыдущих зарядов.","При смерти интеллект умершего героя вернется к его стандартным значениям, когда для остальной команды сохранится измененные значения интеллекта на оставшееся время действия."],"mana":"110\/140\/170\/200","elements":["Можно избежать.","Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Arcane Orb","description":["Дальность применения: 450","Радиус урона: 175","Маны в виде урона: 6%\/7%\/8%\/9%","Кража интеллекта: 1\/2\/3\/4","Длительность кражи: 80 ( 140)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Помещает выбранное существо в астральное заточение, где оно неуязвимо и неактивно. По окончании эффекта происходит взрыв, наносящий 100\/175\/250\/325 урона в радиусе 400 вокруг цели.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Astral Imprisonment полностью обезвреживает цель и делает её неуязвимой и скрытой на всё время действия.","Урон применяется в конце действия и также срабатывает на заключенного юнита, если он является врагом.","Красное кольцо, взрывающеся в центре в качестве визуального эффекта, показывает длительность заточения. Красное кольцо видно только союзникам.","Функция \"Без помощи\" не позволяет использовать эту способность союзному Outworld Devourer на вашего героя."],"mana":"140\/160\/180\/200","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"24\/20\/16\/12 ( 0)","name":"Astral Imprisonment","description":["Анимация применения: 0,25+0,4","Дальность применения: 225\/300\/375\/450 ( 525\/600\/675\/750)","Радиус урона: 400","Урон: 100\/175\/250\/325","Длительность заточения: 4","Максимально зарядов: 0 ( 2)","Время перезарядки заряда: 0 ( 12)"],"hot_key":"W","legacy_key":"T"},{"spell":"Герой крадёт у врагов ману в размере 11%\/18%\/25%\/32% от наносимого урона. Применение увеличит это число втрое, а способности будут замедлять задетых врагов.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов"],"notes":["При применении прерывает произносимые заклинания Outworld Devourer.","Вопреки описанию, способность не крадет ману. Она лишь восстанавливает ману Outworld Devourer, а цель ману не теряет.","Вопреки описанию, замедление применяется из-за любого урона, а не только урона заклинаний.","Восстановление маны основано на нанесённом уроне после всех снижений.","Срабатывает на любой урон, включая атаки и предметы.","Накладывает дебафф замедления после урона, активировавшего его."],"mana":"50","elements":["Может использоваться иллюзиями.","Не отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"18","name":"Equilibrium","description":["Урона в восстановление маны: 11%\/18%\/25%\/32%","Урона в восстановление маны при применении: 12%\/22%\/32%\/42%","Замедление скорости передвижения: 12%\/22%\/32%\/42%","Длительность замедления: 1.75","Длительность баффа: 7"],"hot_key":"E","legacy_key":"E"},{"spell":"Вызывает ментальный взрыв, который сжигает вражеским героям 30% от их максимального запаса маны, а также наносит урон, зависящий от разницы в интеллекте между жертвами и самим Outworld Devourer. Если уровень интеллекта больше или равен тому, что у Outworld Devourer, то способность не нанесет урона. Действует на врагов, находящихся под действием Astral Imprisonment.","effects":["Способность Направленная на область","Действует на Вражеских героев","Урон Магический"],"notes":["Влияет на юнитов под действием Astral Imprisonment, примененным Outworld Devourer (или укравшим способность Rubick), но не пробивает другие источники неуязвимости или исчезновения.","Сначала применяет сжигание маны, затем урон.","Урон и сжигание маны работает на иллюзии.","Считает крипов-героев за крипов."],"mana":"200\/325\/450","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"160","name":"Sanity's Eclipse","description":["Анимация применения: 0,25+0,4","Дальность применения: 700","Радиус: 375\/475\/575","Множитель интеллекта: 8\/9\/10 ( 10\/11\/12)","Процент сжигания маны: 30%"],"hot_key":"R","legacy_key":"C"}],"bio":"Представитель благородной и властной расы, Предвестник бороздит кромку Пустоши и в одиночку несёт дозор в последней оставшейся заставе мира у края бездны. Он провёл вечность в выщербленном кристаллическом Внемирье, ни на мгновение не покидая свой пост, вглядываясь в небеса и ожидая движения в бездонной ночи за звёздами. Глубоко в сияющих переплетениях его интеллекта лежит узор пророчества — тёмная музыка, предвещающая, что однажды за гранью мироздания проснётся некое зло, которое обратит свой взор к нашему миру. Полностью поглощённый наблюдением, страж оставлял без внимания события, происходящие у самого солнца. Но вот наконец конфликт Древних и чувство нарастающей угрозы изнутри и извне заставили его двинуться в сторону солнца, к просторам сражений. Наши пророчества недвусмысленно говорят о Предвестнике: он — знак грядущих катастроф. Однако и само по себе его прибытие сулит беду.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на броню не дается иллюзиям.","Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.","Талант на силу в общем даёт Outworld Devourer: 400 здоровья, 2 регенерации здоровья и 1,6% сопротивления магии.","Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.","Талант вампиризма заклинаний лечит на 12% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."],"trivia":["В оригинальной DotA, имя героя было Obsidian Destroyer, что является отсылкой к юниту из Warcraft 3.","В Dota 2, изначальное имя героя было Outworld Destroyer, однако затем было изменено на Outworld Devourer в связи с претензиями со стороны правообладателей.","Фраза \"Прости, Anti-Mage, но теперь ты не готов.\", возможно является отсылкой к известной фразе Иллидана из вселенной Warcraft - \"Вы не готовы\". Скорее всего, потому что для Anti-Mage была использована модель Иллидана в DotA Allstars."],"talents":["+15% к вампиризму способностями:+60 сек. действия украденного интеллекта от Arcane Orb","+2 к множителю Sanity's Eclipse:+20 к силе","+6 к броне:+350 к мане","+20 к скорости атаки:+250 к здоровью"],"desc":"Outworld Devourer — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность Arcane Orb уникальный модификатор атаки добавляющий к атакам Outworld Devourer дополнительный чистый урон, пропорциональный текущему запасу маны. Наносит дополнительный урон призванным существам и иллюзиям. Второй способностью Astral Imprisonment помещает вражеского или союзного героя в астрал. Герой в астрале неуязвим и неактивен. Пассивная способность Essence Aura восстанавливает часть маны, когда находящиеся неподалеку союзники или сам Outworld Devourer используют заклинания. Также Outworld Devourer пассивно получает бонус к базовому запасу маны. Некоторые способности без перезарядки и переключаемые способности не вызывают срабатывание ауры. Ультимативная способность Sanity's Eclipse вызывает взрыв, который наносит вражеским героям урон, зависящий от разницы в интеллекте между жертвами и самим Outworld Devourer. Если эта разница больше определенного порога, жертва потеряет 40% своей маны. Если же уровень интеллекта больше или равен тому, что у Outworld Devourer, то способность не возымеет никакого действия. Срабатывает на целях, находящихся под действием Astral Imprisonment. Улучшение с Aghanim's Scepter увеличивает дальность применения способности и применяет способность Astral Imprisonment текущего уровня на задетых вражеских героев."}