{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Mirror_Shield_Echo_Shield.mp3\/revision\/latest?cb=20191227195712",
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "The Spell Block has a higher priority than Linken's Sphere, and lower priority than Counterspell.",
        "The Spell Reflection has a lower priority than Lotus Orb and Counterspell. If these two are active on the owner, Echo Shield does not trigger at all, including its spell block. This means when affected by of Lotus Orb, Linken's Sphere triggers instead.",
        "If these two are active on the owner, Echo Shield does not trigger at all, including its spell block.",
        "This means when affected by of Lotus Orb, Linken's Sphere triggers instead.",
        "Fully stacks with Soulbind."
      ],
      "mana": null,
      "abilityName": "Echo Shield",
      "cooldown": "8",
      "description": "Block and reflect most targeted spells back to their caster once every 8 seconds.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Mirror Shields are fully sharable."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Mirror Shield",
  "description": "The shield that long ago robbed the old one of his first memories.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+16 Strength",
    "+16 Agility",
    "+16 Intelligence"
  ],
  "tips": [
    "Best shared to your hard carries as the Echo Shield will block and reflect any single-targeted spell back to its caster, preventing them from getting disabled easily.",
    "Because Mirror Shield has a higher priority than Linken's Sphere and both items will simultaneously block a spell, it is wise to give this item to an another allied hero instead.",
    "You can also share a Mirror Shield to your supports if they have a powerful teamfight spell especially those that are channeled."
  ]
}