{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+80% к критическому урону от Drunken Brawler",
          "talentRight": "Воины получают пассивную способность Drunken Brawler"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+80 к скорости атаки",
          "talentRight": "+1400 к здоровью воинов от Primal Split"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+350 к здоровью",
          "talentRight": "+30% к длительности и урону от Cinder Brew"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+200 к радиусу Thunder Clap",
          "talentRight": "+15 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Thunder_Clap_%28Brewmaster%29.mp3\/revision\/latest?cb=20141125112622",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Thunder Clap сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "Q",
      "cooldown": "13",
      "description": "Сотрясает землю, нанося урон всем врагам в области действия, а также замедляя их атаки и передвижение.",
      "spellName": "Thunder Clap",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Радиус: 400",
        "Урон: 90\/160\/230\/300",
        "Замедление скорости передвижения: 25%\/35%\/45%\/55%",
        "Замедление скорости атаки: 25\/35\/45\/55",
        "Длительность замедления: 4 (TagTalent 204)",
        "Замедление сохраняется, если эффект был наложен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Коли Магникс бьёт своей крепкой бочкой оземь — значит, быть веселью."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/42\/Drunken_Haze.mp3\/revision\/latest?cb=20161220224708",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд Cinder Brew летит со скоростью 1600.",
        "Несмотря на визуальный эффект, при достижении снарядом центра области Cinder Brew не применяется ко всем существам одновременно. Эффект распространяется расширяющейся волной, применяясь к каждому существу в пределах выбранной области.",
        "Эффект распространяется расширяющейся волной, применяясь к каждому существу в пределах выбранной области.",
        "Когда враги под действием дебаффа Cinder Brew получают любой урон от заклинания, то длительность дебаффа горения увеличивается на 3 и начинает наноситься урон.",
        "Дебафф загорается лишь один раз. Замедление продолжается после поджога.",
        "Интервал урона основан на длительности дебаффа, поэтому он всегда срабатывает 8 раз. Каждый интервал наносит 9,375\/18,75\/28,125\/37,5 урона.",
        "Повторное применение на те же цели обновит длительность, но не сложит эффекты и не улучшит дебафф до текущего уровня способности. Обновление на уже горящих целях обновит дебафф горения и не сбросит горение. Интервал урона не обновляется при поджоге. Значение интервалов фиксированное, поэтому способность продолжит наносить урон до завершения дебаффа.",
        "Обновление на уже горящих целях обновит дебафф горения и не сбросит горение.",
        "Интервал урона не обновляется при поджоге. Значение интервалов фиксированное, поэтому способность продолжит наносить урон до завершения дебаффа."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "W",
      "cooldown": "20\/17\/14\/11",
      "description": "Обливает указанную область алкоголем, отчего враги передвигаются медленнее и загораются, получив урон от любой способности. Время действия на загоревшегося врага продлевается на 3 сек.",
      "spellName": "Cinder Brew",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 850",
        "Радиус: 400",
        "Замедление скорости передвижения: 24%\/28%\/32%\/36%",
        "Суммарный урон от горения: 75\/150\/225\/300 (TagTalent 97,5\/195\/292,5\/390)",
        "Длительность: 5 (TagTalent 6.5)",
        "Увеличение длительности горения: 3",
        "Замедление сохраняется, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Орден Ойо знает, как решить любую проблему — еще по одной!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Brawler_cast.mp3\/revision\/latest?cb=20181201183144",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Brewmaster.",
        "При активации увеличивает шанс на уклонение до 18\/36\/54\/72% и шанс на критический удар до 72%.",
        "Пассивно увеличивает урон от атак до 10,8%\/14,4%\/18%\/21,6% (TagTalent 30%\/33,6%\/37,2%\/40,8%) и выживаемость против физических атак до 6%\/14%\/22%\/32%.",
        "Шанс срабатывания сочетается с другими источниками критического урона. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.",
        "Если одновременно срабатывают два источника критического удара, используется более высокий множитель.",
        "Уклонение Drunken Brawler Складывается по закону убывающей полезности с другими источниками уклонения.",
        "Уклонение и критический удар Drunken Brawler используют Псевдослучайное распределение.",
        "Звук и частицы крита проигрываются при начале атаки, а не её попадании.",
        "Изменение скорости передвижения происходит каждую секунду и начинается с положительного бонуса. В итоге скорость передвижения увеличивается на 40% в первую, третью и пятую секунду и замедляется на 20% на вторую и четвертую. Средняя скорость передвижения в течение этих 5 секунд составляется 116%.",
        "В итоге скорость передвижения увеличивается на 40% в первую, третью и пятую секунду и замедляется на 20% на вторую и четвертую.",
        "Средняя скорость передвижения в течение этих 5 секунд составляется 116%."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "E",
      "cooldown": "20\/19\/18\/17",
      "description": "Герой имеет постоянный шанс уклониться от атаки или нанести критический удар. При применении герой использует технику пьяного боя, отчего эти шансы увеличиваются, но скорость передвижения варьируется между -20% и +40%. Действует 5 сек.",
      "spellName": "Drunken Brawler",
      "params": [
        "Анимация применения: 0+0",
        "Шанс уклонения (TagTalentпассивный): 6%\/12%\/18%\/24%",
        "Шанс критического удара (TagTalentпассивный): 24%",
        "Критический урон: 145%\/160%\/175%\/190% (TagTalent 225%\/240%\/255%\/270%)",
        "Множитель шанса при применении: 3",
        "Замедление скорости передвижения: 20%",
        "Доп. скорость передвижения: 40%",
        "Длительность: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Получив титул Хмелевара ордена Ойо, Мангикс также доказал всем, что он мастер опьянения."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Primal_Split.mp3\/revision\/latest?cb=20141125112536",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя",
        "Урон Физический"
      ],
      "notes": [
        "Brewmaster становится неуязвимым и исчезает во время применения заклинания и его длительности. Не накладывает никакой формы развеивания.",
        "Взаимодействия с Brewmaster во время действия Primal Split зависят от живого воина с самым высоким приоритетом. Приоритет воинов от самого главного — воин земли, воин шторма, воин огня, воин пустоты.",
        "Пока способность активна, Brewmaster периодически перемещается туда, где находится с самым высоким приоритетом. Из этого следует еще несколько моментов: Когда Primal Split заканчивается, Brewmaster появляется на месте выжившего воина с самым высоким приоритетом. Каждая аура, которая имеется у героя (включая Gem of True Sight и Radiance), работает в радиусе вокруг живого воина с самым высоким приоритетом Эффекты, реагирующие на присутствие героя (TagTalent Smoke of Deceit, Marksmanship, Blur) реагируют только на присутствие воина с самым высоким приоритетом. Эффекты телепортации (TagTalent Holy Persuasion или Relocate) заставляют периодическое перемещение Brewmaster прерваться, и в таком случае вышенаписанные примечания больше неприменимы.",
        "Когда Primal Split заканчивается, Brewmaster появляется на месте выжившего воина с самым высоким приоритетом.",
        "Каждая аура, которая имеется у героя (включая Gem of True Sight и Radiance), работает в радиусе вокруг живого воина с самым высоким приоритетом",
        "Эффекты, реагирующие на присутствие героя (TagTalent Smoke of Deceit, Marksmanship, Blur) реагируют только на присутствие воина с самым высоким приоритетом.",
        "Эффекты телепортации (TagTalent Holy Persuasion или Relocate) заставляют периодическое перемещение Brewmaster прерваться, и в таком случае вышенаписанные примечания больше неприменимы.",
        "Воины всегда появляются в одном и том же построении, образуя правильный треугольник (TagTalent квадрат), вписанный в окружность с радиусом в 100 единиц. Все воины будут смотреть в ту же сторону, куда смотрел Brewmaster перед применением способности. Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster. Воин шторма всегда появляется на расстоянии в 50 позади и 86.603 левее Brewmaster, Воин огня всегда появляется на расстоянии в 50 позади и 86.603 правее Brewmaster. При улучшении с Aghanim's Shard воины будут появляться в построении, образуя квадрат, вписанный в окружность с радиусом ~141 единицу. Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster. Воин шторма всегда появляется на расстоянии в 100 единиц слева от того места, где стоял Brewmaster. Воин огня всегда появляется на расстоянии в 100 единиц справа от того места, где стоял Brewmaster. Воин пустоты всегда появляется на расстоянии в 100 единиц позади того места, где стоял Brewmaster.",
        "Все воины будут смотреть в ту же сторону, куда смотрел Brewmaster перед применением способности.",
        "Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster.",
        "Воин шторма всегда появляется на расстоянии в 50 позади и 86.603 левее Brewmaster,",
        "Воин огня всегда появляется на расстоянии в 50 позади и 86.603 правее Brewmaster.",
        "При улучшении с Aghanim's Shard воины будут появляться в построении, образуя квадрат, вписанный в окружность с радиусом ~141 единицу. Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster. Воин шторма всегда появляется на расстоянии в 100 единиц слева от того места, где стоял Brewmaster. Воин огня всегда появляется на расстоянии в 100 единиц справа от того места, где стоял Brewmaster. Воин пустоты всегда появляется на расстоянии в 100 единиц позади того места, где стоял Brewmaster.",
        "Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster.",
        "Воин шторма всегда появляется на расстоянии в 100 единиц слева от того места, где стоял Brewmaster.",
        "Воин огня всегда появляется на расстоянии в 100 единиц справа от того места, где стоял Brewmaster.",
        "Воин пустоты всегда появляется на расстоянии в 100 единиц позади того места, где стоял Brewmaster.",
        "Призванные воины — это древние крипы-герои, поэтому определенные заклинания взаимодействуют с ними иначе. Для подробностей взаимодействия перейдите к соответствующим статьям.",
        "При улучшении с Aghanim's Scepter воины получаются подспособность Прервать Primal Split. Её использование мгновенно прекращает действие Primal Split и возвращает Brewmaster на место воина, на котором была использована подспособность.",
        "Её использование мгновенно прекращает действие Primal Split и возвращает Brewmaster на место воина, на котором была использована подспособность.",
        "Талант 25-го уровня дарует всем воинам modifier_brewmaster_drunken_brawler_passive, то есть пассивный шанс срабатывания уклонения и критического удара. Так как сама способность не даруется воинам, они не могут её использовать, чтобы увеличить шансы срабатывания.",
        "Так как сама способность не даруется воинам, они не могут её использовать, чтобы увеличить шансы срабатывания."
      ],
      "mana": "125\/150\/175",
      "hotKey": "R",
      "cooldown": "140\/130\/120 (TagTalent 0)",
      "description": "Разделяет героя на трёх выносливых воинов-элементалей. Если хотя бы один из них доживёт до окончания действия способности, герой вернётся в свою прежнюю форму.",
      "spellName": "Primal Split",
      "params": [
        "Анимация применения: 0,65+0",
        "Время разделения: 0,6",
        "Длительность: 16\/18\/20",
        "Количество зарядов: 0 (TagAghanim 2)",
        "Время восстановления: 0 (TagAghanim 140\/130\/120)",
        "Даёт способности 2 заряда и позволяет в любой момент прервать её действие. Герой объединится на позиции того воина, у которого была использована способность отмены. Время восстановления заряда равно обычной перезарядке.",
        "Добавляет воина пустоты к способности Primal Split. У него есть способность Astral Pulse, которая замедляет врагов в радиусе 500 на 20%\/30%\/40% и накладывает на них бессилие. Длительность: 2,5 секунды. Перезарядка: 12 секунд."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Не ясно, осознает ли Мангикс свою могучую связь с природой, ибо она чаще всего проявляется во время пьянки."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Требуется Aghanim's Scepter для разблокировки.",
        "Даруется всем воинам.",
        "При использовании мгновенно прекращает действие Primal Split.",
        "Brewmaster будет появляться на месте воина, на котором была использована эта подспособность, а не в зависимости от приоритета живущих воинов."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "0",
      "description": "Объединиться в одного героя.",
      "spellName": "Прервать Primal Split",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Hurl_Boulder.mp3\/revision\/latest?cb=20141125112549",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Булыжник летит со скоростью 800.",
        "Булыжник сначала применяет дебафф, затем наносит урон."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Бросает булыжник, который наносит урон врагу и обездвиживает его.",
      "spellName": "Hurl Boulder",
      "params": [
        "Анимация применения: 0,25+0,8",
        "Дальность применения: 800",
        "Урон: 50\/100\/150",
        "Длительность оглушения: 2",
        "Блокируется по достижению снарядом цели."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Невосприимчив к заклинаниям.",
      "spellName": "Spell Immunity",
      "params": [
        "Доп. сопротивление магии: 100%"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Урон от способности непосредственно добавляется к урону воина земли. Но, поскольку он наносится только постройкам, то не отображается в интерфейсе."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Существо наносит дополнительный урон постройкам.",
      "spellName": "Demolish",
      "params": [
        "Доп. урон по строениям: 90\/180\/270"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Dispel_Magic.mp3\/revision\/latest?cb=20141125112517",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Накладывает базовое развеивание на всех существ в радиусе действия.",
        "Всегда развеивает Cyclone независимо от того, на врага или союзника действует способность. Кроме того, способность следует стандартным правилам развеивания, снимая дебаффы с союзников и баффы с врагов.",
        "Кроме того, способность следует стандартным правилам развеивания, снимая дебаффы с союзников и баффы с врагов.",
        "Урон наносится юнитам, созданным способностями, включая иллюзии. Крипы-герои получают урон только если также относятся к древним.",
        "Крипы-герои получают урон только если также относятся к древним.",
        "Действует на неуязвимых, но не на спрятанных юнитов."
      ],
      "mana": "75",
      "hotKey": "Q",
      "cooldown": "4",
      "description": "Наносит урон призванным существам и рассеивает большинство положительных и отрицательных эффектов в небольшой области.",
      "spellName": "Dispel Magic",
      "params": [
        "Анимация применения: 0,4+0,93",
        "Дальность применения: 500",
        "Радиус: 600",
        "Урон призванным существам: 1000",
        "Затрагивает союзников с иммунитетом к заклинаниям, но не врагов."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Cyclone_%28Brewmaster%29.mp3\/revision\/latest?cb=20141125223146",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Накладывает эффект урагана на цель при применении, то есть цель становится неуязвимой и полностью обезвреживаются.",
        "В отличии от других торнадо, это не развеивает эффекты цели.",
        "Поднятые существа теряют свой размер столкновения на длительность, позволяя другим существам пройти под ними.",
        "Можно применить на Рошана, но это только прервет его на часть секунды и не повлияет на него."
      ],
      "mana": "150",
      "hotKey": "W",
      "cooldown": "8",
      "description": "Закручивает врага в торнадо, временно обездвиживающее его на поле битвы.",
      "spellName": "Cyclone",
      "params": [
        "Анимация применения: 0,4+0,67",
        "Дальность применения: 600",
        "Длительность на героях: 6",
        "Длительность на крипах: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Skeleton_Walk.mp3\/revision\/latest?cb=20141125112530",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "Не останавливает прерываемые способности при применении.",
        "Дополнительный урон добавляется напрямую к урону юнита, а потому может быть снижен Static Link. Тем не менее, не может быть увеличена, например, Empower. Урон учитывается вампиризмом, уроном соседним целям и критическим ударом.",
        "Тем не менее, не может быть увеличена, например, Empower.",
        "Урон учитывается вампиризмом, уроном соседним целям и критическим ударом.",
        "Во время задержки невидимости, Storm может использовать способности и атаковать не выходя из невидимости. Такие атаки так же наносят урон способности.",
        "Такие атаки так же наносят урон способности.",
        "Дополнительный урон не действует, если ударить из невидимости строение, но действует на варды.",
        "Невидимость теряется, как только используется заклинание или выпущен снаряд атаки. Таким образом, даже если атака промахнется, невидимость все равно будет утеряна.",
        "Таким образом, даже если атака промахнется, невидимость все равно будет утеряна.",
        "Позволяет Storm проходить сквозь другие юниты, включая варды, но не строения."
      ],
      "mana": "75",
      "hotKey": "E",
      "cooldown": "5",
      "description": "Дает временную невидимость. Пока воин невидим, он передвигается значительно быстрее; атака, снимающая невидимость, нанесет дополнительный урон.",
      "spellName": "Wind Walk",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0.6",
        "Доп. скорость передвижения: 50%",
        "Урон: 140\/200\/260",
        "Длительность: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Permanent Immolation это аура. Эффект задерживается на 0,5 секунды.",
        "Наносит урон каждую секунду, начиная с первой секунды с момента получения негативного эффекта.",
        "Может нанести до 412,5\/925\/1537,5 урона одному существу (до учета сопротивлений), если оно оставалось в пределах действия всю длительность."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Обжигает врагов неподалёку.",
      "spellName": "Permanent Immolation",
      "params": [
        "Радиус: 220",
        "Урон в секунду: 25\/50\/75",
        "Длительность задержки ауры: 0,5",
        "Пытается нанести урон, если эффект был наложен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Void_Astral_Pulse.mp3\/revision\/latest?cb=20201223213602",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "Не смотря на визуальные эффекты, мгновенно достигает всех врагов в радиусе поражения."
      ],
      "mana": "0",
      "hotKey": "Q",
      "cooldown": "12",
      "description": "Для этой способности нет описания.",
      "spellName": "Astral Pulse",
      "params": [
        "Анимация применения: 0,25+0,95",
        "Радиус: 500",
        "Замедление скорости передвижения: 20%\/30%\/40%",
        "Длительность: 2,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.0,
    "attrAgility": 19.0
  },
  "description": "Brewmaster, или Мангикс — это герой с ближним типом атаки, основным атрибутом которого является сила. Герой может заполнять практически любую роль, хотя в первую очередь он рассматривается как Керри, Ганкер, Стойкость или Инициатор. Он хорошо вписывается в любую линию, но очень зависим от опыта, а это значит, что его часто видят как на оффлейне, так и на центральной линии. Основные способности героя делают его респектабельным наносителем физического урона и особенно хорошим дуэлянтом, поскольку у него есть способности, которые включают в себя непринятие атак противника (например, уклонение) при одновременном усилении его собственных (шанс критического удара). Однако истинная сила Brewmaster заключается в его ультимативной способности Primal Split, которая при правильном использовании может сама по себе перевернуть ход командного боя. Каждый из трех воинов героя исключительно силен, с исключительными дизейблами, а также живучестью против магических и физических атак и урона. Призванные от ультимативной способности воины могут безрассудно атаковать врага, поскольку получаемый ими урон непостоянен, и очень редко все трое умирают до того, как закончится действие Primal Split. По этим причинам Brewmaster почти всегда сообирается (по предметам) таким образом, чтобы максимизировать потенциал Primal Split.",
  "history": "Глубоко в Скулящих горах, в долине под Разрушенным городом древний орден Ойо веками упражнялся в ритуалах священного забытья, соединяясь с миром духов в грандиозных хмельных праздниках. Рождённый плотской матерью от отца-небожителя, молодой Мангикс стал первым, кто совместил в себе способности обоих родителей. Он занимался с величайшими эстетами Ордена, со временем заполучив прилежной нетрезвостью право соревноваться за титул Хмелевара — самого почётного звания во всей спиртотворческой касте мыслителей. Девять дней Мангикс сражался и пил до последнего — оба процесса были одинаково важны, — стараясь одолеть и перепить старшего мастера. Девять ночей они шатались и крутились, спотыкались и наносили удар за ударом — и так до тех пор, пока воин постарше наконец не свалился на землю в пьяном ступоре, а его соперника не нарекли новым Хмелеваром. Теперь новый, молодой Хмелевар взывает к силе прародителей ордена Ойо, дабы те благословили его посох. К своим предкам-небожителям он обращается, когда пользуется магией. И, подобно всем предыдущим Хмелеварам, его отправили в странствие с единственной целью: найти просвещение на дне кружки и разрешить древнюю духовную загадку; надумать ту самую мысль, что вновь воссоединит духовный и материальный миры.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+80% к критическому урону от Drunken Brawler",
      "talentRight": "Воины получают пассивную способность Drunken Brawler"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+80 к скорости атаки",
      "talentRight": "+1400 к здоровью воинов от Primal Split"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+350 к здоровью",
      "talentRight": "+30% к длительности и урону от Cinder Brew"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+200 к радиусу Thunder Clap",
      "talentRight": "+15 к урону"
    }
  ]
}