{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a0\/Hoodwink_Acorn_Shot_1.mp3\/revision\/latest?cb=20201219182025",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Instant Attack"
      ],
      "notes": [
        "Acorn Shot's cast range can only be further increased by attack range bonuses of the same range type as the caster, as well as cast range bonuses. With the ability's own attack range bonus, Acorn Shot effectively has a cast range of 700\/775\/850\/925 on Hoodwink.",
        "With the ability's own attack range bonus, Acorn Shot effectively has a cast range of 700\/775\/850\/925 on Hoodwink.",
        "When ground-targeted, a tree gets planted upon reaching that point. Planted trees have a smaller collision size and block less vision than regular trees. Unlike with other planted trees, Tango does not heal for twice as long when targeting an Acorn Shot tree. The planted tree provides 200 radius ground vision around itself, which lasts for 20 seconds or until the tree is destroyed. When put on Autocast, the ability can only be ground-targeted.",
        "Unlike with other planted trees, Tango does not heal for twice as long when targeting an Acorn Shot tree.",
        "The planted tree provides 200 radius ground vision around itself, which lasts for 20 seconds or until the tree is destroyed.",
        "When put on Autocast, the ability can only be ground-targeted.",
        "When unit-targeted, the initial hit is not counted towards the bounce limit, so that up to 3\/4\/5\/6 (TagTalent 5\/6\/7\/8) hits can be achieved.",
        "The initial projectile travels at a speed of 2200. The speed while bouncing equals half of Hoodwink's current attack projectile speed. With her default attack projectile speed, the bouncing projectile travels at a speed of 900. This can be defined as EXPR CurrentProjectileSpeed × 0.5. This affects Acorn Shot not being able to be reflected on certain melee heroes (e.g. Marci) because they have 0 projectile speed. The projectile speed can be further increased by other attack projectile speed bonuses.",
        "The speed while bouncing equals half of Hoodwink's current attack projectile speed.",
        "With her default attack projectile speed, the bouncing projectile travels at a speed of 900.",
        "This can be defined as EXPR CurrentProjectileSpeed × 0.5. This affects Acorn Shot not being able to be reflected on certain melee heroes (e.g. Marci) because they have 0 projectile speed.",
        "This affects Acorn Shot not being able to be reflected on certain melee heroes (e.g. Marci) because they have 0 projectile speed.",
        "The projectile speed can be further increased by other attack projectile speed bonuses.",
        "The projectile bounces in 0.1-second intervals. Can bounce on the same unit multiple times, but only when another target was hit between the bounces. Cannot bounce on invisible, invulnerable, hidden or attack immune units, but can bounce on units in the Fog of War.",
        "Can bounce on the same unit multiple times, but only when another target was hit between the bounces.",
        "Cannot bounce on invisible, invulnerable, hidden or attack immune units, but can bounce on units in the Fog of War.",
        "Upon projectile hit, Acorn Shot causes Hoodwink to perform an instant attack on the enemies. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms. For melee units, if the enemy target is farther than 350 range more than the attacker's range, the attack will always miss.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "For melee units, if the enemy target is farther than 350 range more than the attacker's range, the attack will always miss.",
        "Acorn Shot's instant attack first reduces Hoodwink's total attack damage and then the bonus damage is added as attack damage bonus on top of that after the total main damage is calculated. The total damage dealt includes all already existing attack damage changes, including conditional bonus sources (e.g. Bash). This can be defined as EXPR ΣAtk × 75% + 50\/75\/100\/125 Therefore, attack damage based attack modifiers (e.g. critical strike and lifesteal) include the 50\/75\/100\/125 bonus damage as well. Only Acorn Shot can use the bonus attack damage. Since the damage comes from a regular attack, it counts as attack damage and not as spell damage. This means it is affected by damage block, unaffected by spell damage amplification, and cannot spell lifesteal. When ground-targeted, the instant attack of Acorn Shot does not break the invisibility of the following sources: Decoy, Disguise, Shadow Walk and Glimmer. For Fade, the invisibility breaks upon projectile hit after the fade time. For Shadow Walk, the invisibility breaks upon projectile hit and apply its ability effects.",
        "The total damage dealt includes all already existing attack damage changes, including conditional bonus sources (e.g. Bash). This can be defined as EXPR ΣAtk × 75% + 50\/75\/100\/125",
        "Therefore, attack damage based attack modifiers (e.g. critical strike and lifesteal) include the 50\/75\/100\/125 bonus damage as well.",
        "Only Acorn Shot can use the bonus attack damage.",
        "Since the damage comes from a regular attack, it counts as attack damage and not as spell damage.",
        "This means it is affected by damage block, unaffected by spell damage amplification, and cannot spell lifesteal.",
        "When ground-targeted, the instant attack of Acorn Shot does not break the invisibility of the following sources: Decoy, Disguise, Shadow Walk and Glimmer. For Fade, the invisibility breaks upon projectile hit after the fade time. For Shadow Walk, the invisibility breaks upon projectile hit and apply its ability effects.",
        "For Fade, the invisibility breaks upon projectile hit after the fade time.",
        "For Shadow Walk, the invisibility breaks upon projectile hit and apply its ability effects.",
        "The projectile performs the instant attack, and then applies the debuff. The movement speed slow is independent from the instant attack, and is placed even when the instant attack misses.",
        "The movement speed slow is independent from the instant attack, and is placed even when the instant attack misses.",
        "The projectile provides 200 radius flying vision around itself as it travels. This vision does not last.",
        "Fully ignores Couriers.",
        "TALENT NOTES Acquiring the Acorn Shot charges talent instantly grants 1 extra charge."
      ],
      "mana": "16\/14\/12\/10 (TagTalent 0)",
      "item_behaviour": [],
      "name": "Acorn Shot",
      "cooldown": "16\/14\/12\/10",
      "description": "Fires Hoodwink's attack with an acorn at the target unit. The acorn bounces to nearby targets, slowing them and dealing a percentage of Hoodwink's attack with bonus damage. If point targeted, a tree is created at the target position and the acorn will bounce to nearby targets. The ability may be placed on auto-cast to force this behavior.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+1.37",
        "Cast Range:   575",
        "Attack Range Bonus: 125\/200\/275\/350",
        "Bounce Distance: 525",
        "Number of Bounces: 2\/3\/4\/5 ( 4\/5\/6\/7)",
        "Instant Attack Damage Bonus: 50\/75\/100\/125",
        "Instant Attack Damage: 75%",
        "Move Speed Slow: 100%",
        "Slow Duration: 0.35",
        "Tree Duration: 20"
      ],
      "legacy_key": "C",
      "story": "Though she'll make do with almost anything, Oak and Ironwood acorns make the most effective projectiles -- and the bulk of Hoodwink's stash."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Hoodwink_Bushwhack_1.mp3\/revision\/latest?cb=20201219182032",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies ",
        "Damage: Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1300.",
        "Trees within the radius indicator are highlighted when a target location is selected.",
        "With the maximum cast range and radius, Bushwhack can hit units up to 1265 range away.",
        "Provides 265 radius flying vision at the target location upon reaching it, lasting for 1.5\/1.8\/2.1\/2.4 seconds. If there are no trees within the area, the ability only provides the flying vision upon reaching the target.",
        "If there are no trees within the area, the ability only provides the flying vision upon reaching the target.",
        "Deals 15\/25\/32.14\/37.5 damage in 0.3-second intervals, starting 0.3 seconds after receiving the debuff, resulting in 0 instances.",
        "Hit enemies are stuned and moved towards the tree closest to the center of the targeted point. However, if there is another tree in the way, the unit is bound to that tree instead. Moves units towards the tree at a speed of 1000. Exposes hit enemies for the debuff duration, revealing their exact location.",
        "However, if there is another tree in the way, the unit is bound to that tree instead.",
        "Moves units towards the tree at a speed of 1000.",
        "Exposes hit enemies for the debuff duration, revealing their exact location.",
        "Bound units can be freed by destroying the tree they are bound to. Bound units are also freed when any form of forced movement sources is applied on them. If Bushwhack binds a unit to a planted tree with an expiration timer, that planted tree cannot expire until Bushwhack ends.",
        "Bound units are also freed when any form of forced movement sources is applied on them.",
        "If Bushwhack binds a unit to a planted tree with an expiration timer, that planted tree cannot expire until Bushwhack ends.",
        "During the stun duration, the bound units have their total vision range set to 0. Therefore, Moon Shard's nighttime vision bonus is reduced as well.",
        "Therefore, Moon Shard's nighttime vision bonus is reduced as well.",
        "Affects units inside the Fog of War, but not invisible units."
      ],
      "mana": "14 (TagTalent 11)",
      "item_behaviour": [],
      "name": "Bushwhack",
      "cooldown": "90\/100\/110\/120",
      "description": "Tosses a net trap that stuns enemy heroes if they are near a tree in the area. Affected enemies take damage and are pulled towards the tree nearest to them, and have their vision reduced to 0 for the duration of the stun.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.2+1.07",
        "Cast Range:  1000",
        "Radius: 265 ( 400)",
        "Total Damage: 75\/150\/225\/300 ( 135\/210\/285\/360)",
        "Set Vision Range: 0",
        "Stun Duration: 1.5\/1.8\/2.1\/2.4"
      ],
      "legacy_key": "W",
      "story": "Hoodwink favors Ironwood groves for ambushes, but the wary step carefully in all areas of the mistwoods."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Hoodwink_Scurry_1.mp3\/revision\/latest?cb=20201219182019",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "notes": [
        "Hoodwink gets all charges immediately upon learning Scurry.",
        "Interrupts Hoodwink's channeling abilities upon cast.",
        "Grants tree-walking and phased movement to Hoodwink.",
        "The passive modifier is hidden by default, and turns visible when near a tree.",
        "While Scurry is active, Hoodwink cannot recast Scurry.",
        "The passive evasion and the active component are independent from each other. The evasion is always present even when Scurry is not castable. Stacks multiplicatively with other sources of evasion The evasion uses pseudo-random distribution.",
        "The evasion is always present even when Scurry is not castable.",
        "Stacks multiplicatively with other sources of evasion",
        "The evasion uses pseudo-random distribution.",
        "On average, Scurry passively increases Hoodwink's survivability against physical attacks by 18%\/25%\/33%\/43%. TALENT NOTES The active evasion increasing talent only affects Hoodwink when there are trees within the same search radius. It increases the total evasion to 55%\/60%\/65%\/70%. This further increases Hoodwink's survivability against physical attacks to 122%\/150%\/186%\/233% while Scurry is active.",
        "TALENT NOTES The active evasion increasing talent only affects Hoodwink when there are trees within the same search radius.",
        "It increases the total evasion to 55%\/60%\/65%\/70%. This further increases Hoodwink's survivability against physical attacks to 122%\/150%\/186%\/233% while Scurry is active."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Scurry",
      "cooldown": "30\/24\/18\/12",
      "description": "Hoodwink passively has a chance to evade physical attacks while near trees. When activated, Hoodwink gains bonus movement speed, phased collision, and tree-walking for a brief time.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Passive Tree Search Radius: 275",
        "Passive Evasion: 15%\/20%\/25%\/30%",
        "Active Move Speed Bonus: 20%\/25%\/30%\/35%",
        "Active Duration: 4",
        "<span image=\"images\\Talent\"><\/span> Active Evasion: 40%"
      ],
      "legacy_key": "R",
      "story": "There's not a nook or cranny in the Wood Tomo'kan out of reach of Hoodwink's paws."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bd\/Hoodwink_Decoy_1.mp3\/revision\/latest?cb=20210410154146",
      "effects": [
        "Ability: No Target",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Interrupt Hoodwink's channeling abilities upon cast.",
        "Does not require Sharpshooter to be leveled to be unlocked, once Aghanim's Scepter is acquired. However, it relies on Sharpshooter to work, since it directly uses its values. This means when Sharpshooter is not learned, Decoy creates an illusion that runs towards the nearest enemy hero or enemy illusion. Sharpshooter notes fully apply.",
        "However, it relies on Sharpshooter to work, since it directly uses its values. This means when Sharpshooter is not learned, Decoy creates an illusion that runs towards the nearest enemy hero or enemy illusion.",
        "Sharpshooter notes fully apply.",
        "Upon cast, Decoy creates an uncontrollable and indistinguishable illusion at Hoodwink's current facing direction that automatically channels Sharpshooter, and homes into the nearest enemy hero. The illusion created has the Scurry's modifier, it is completely independent from the ability and does not require Scurry to be learned. The Sharpshooter channeled by the illusion can not be manually canceled by Hoodwink in any way. It neither has a gold, nor experience bounty.",
        "The illusion created has the Scurry's modifier, it is completely independent from the ability and does not require Scurry to be learned.",
        "The Sharpshooter channeled by the illusion can not be manually canceled by Hoodwink in any way.",
        "It neither has a gold, nor experience bounty.",
        "The bolt travels at a speed of 1200 (TagTalent 1500), and travels for the full distance, or until hitting a valid target. However, if the illusion does not have enough mana, Sharpshooter will not be cast.",
        "However, if the illusion does not have enough mana, Sharpshooter will not be cast.",
        "The invisibility buff has an instant fade time and is lost upon reaching the cast point of abilities or items, or upon landing an attack. Missed attacks do not break it.",
        "The damage starts at 66\/108\/150 and increases by 8.8\/14.4\/20 (TagTalent 11.73\/19.2\/26.67) for each 0.1 seconds wound up, reaching the full damage in 3 seconds.",
        "When hit by an attack or a unit-targeted ability within 0 range, the channeled Sharpshooter is canceled, and Decoy's effects trigger. Sharpshooter will not be fired this way. This means enemy attacks missed (including attacks evaded by the illusion's Scurry evasion) do not trigger the Decoy. Only triggers on attacks of enemy heroes, illusions, clones, and creep-heroes. Triggers on abilities of any unit, not just heroes, following the rules of Spell Block. The triggering ability is blocked as well. Triggers even when affected by an allied Transfer Spellblock. Attacks and abilities coming from more than 15% range away do not trigger the Decoy. However, abilities from outside that distance still get fully blocked. Attacks affect the Decoy normally.",
        "Sharpshooter will not be fired this way.",
        "This means enemy attacks missed (including attacks evaded by the illusion's Scurry evasion) do not trigger the Decoy.",
        "Only triggers on attacks of enemy heroes, illusions, clones, and creep-heroes.",
        "Triggers on abilities of any unit, not just heroes, following the rules of Spell Block. The triggering ability is blocked as well.",
        "Triggers even when affected by an allied Transfer Spellblock.",
        "Attacks and abilities coming from more than 15% range away do not trigger the Decoy.",
        "However, abilities from outside that distance still get fully blocked. Attacks affect the Decoy normally.",
        "When triggered, the illusion gets destroyed, and a lesser Bushwhack is sent towards the target's location. Upon reaching the location, it first creates a planted tree. This tree is smaller than the other trees on the map and has a smaller collision size. Tango heals for twice as long when targeting a Decoy tree. Although using Bushwhack's modifier, the area stun is completely independent from the ability and does not require Bushwhack to be learned.",
        "Upon reaching the location, it first creates a planted tree. This tree is smaller than the other trees on the map and has a smaller collision size.",
        "Tango heals for twice as long when targeting a Decoy tree.",
        "Although using Bushwhack's modifier, the area stun is completely independent from the ability and does not require Bushwhack to be learned."
      ],
      "mana": "30",
      "item_behaviour": [],
      "name": "Decoy",
      "cooldown": "60",
      "description": "Hoodwink turns invisible, increasing her movement speed, and creates a decoy illusion that starts aiming a decreased damage Sharpshooter at the nearest enemy hero. If the illusion is attacked or hit by a targeted ability, it is destroyed and it throws a lesser bushwhack towards the enemy.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: Global",
        "Fade Time: 0",
        "Trigger Distance: 1000",
        "Stun Radius: 250",
        "Sharpshooter Damage Percentage: 60%",
        "Move Speed Bonus: 15%",
        "Number of Illusions: 1",
        "Illusion Damage Dealt: 0%",
        "Illusion Damage Taken: 200%",
        "Max Illusion Duration: 6",
        "Tree Duration: 20",
        "Stun Duration: 2",
        "Invisiblity Duration: 6"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Hoodwink_Hunter%27s_Boomerang_1.mp3\/revision\/latest?cb=20210410154149",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "When unit-targeted, the boomerang homes in on the target. Can be cast on any unit, including allies, excluding self, buildings and wards. Targeting allies sends the boomerang towards them, but does not affect them. The boomerang either travels at a speed of 900 or reaches the target unit between 0.5 – 1.2 seconds, whichever is faster. The same applies upon returning. This means the boomerang can fly for 1 – 2.4 seconds at minimum and maximum respectively. The duration is set once upon cast, based on the distances. If the distances change after cast, the speed adapts to the predetermined duration. For example, if the target was within 450 range upon cast, the boomerang will have fully returned within 1 second. If the target was more than 1080 range away, it will have fully returned within 2.4 seconds.",
        "Can be cast on any unit, including allies, excluding self, buildings and wards.",
        "Targeting allies sends the boomerang towards them, but does not affect them.",
        "The boomerang either travels at a speed of 900 or reaches the target unit between 0.5 – 1.2 seconds, whichever is faster. The same applies upon returning.",
        "This means the boomerang can fly for 1 – 2.4 seconds at minimum and maximum respectively.",
        "The duration is set once upon cast, based on the distances. If the distances change after cast, the speed adapts to the predetermined duration. For example, if the target was within 450 range upon cast, the boomerang will have fully returned within 1 second. If the target was more than 1080 range away, it will have fully returned within 2.4 seconds.",
        "For example, if the target was within 450 range upon cast, the boomerang will have fully returned within 1 second.",
        "If the target was more than 1080 range away, it will have fully returned within 2.4 seconds.",
        "When ground-targeted, it flies towards that point at the fixed speed of 900.",
        "The boomerang is always thrown from Hoodwink's right side and returns from the opposite side. It flies towards the target arcing to the right side and returns to Hoodwink in a mirrored arc. Both arcs have a combined width of 400. Its minimum travel distance is 400 as well, so when targeting a point closer than 400 range, it flies in a triangular pattern with side lengths of 400.",
        "It flies towards the target arcing to the right side and returns to Hoodwink in a mirrored arc.",
        "Both arcs have a combined width of 400.",
        "Its minimum travel distance is 400 as well, so when targeting a point closer than 400 range, it flies in a triangular pattern with side lengths of 400.",
        "The boomerang first applies the debuff, then the damage.",
        "The boomerang provides 150 radius flying vision around itself as it travels. This vision lasts for 2 seconds.",
        "The primary target is damaged and debuffed when getting within its radius like any other unit. However, the boomerang only starts returning once fully reaching the target.",
        "However, the boomerang only starts returning once fully reaching the target.",
        "Applies generic incoming damage amplification on the targets. Stacks additively with other sources of generic incoming damage manipulation. The amplification affects only spell damage the target takes that is not flagged as HP removal. Attack damage is not amplified. Since it uses incoming amplification, it does affect the damage of abilities that ignore outgoing amplification (e.g. Damage Return, cleave and Moon Glaives).",
        "The amplification affects only spell damage the target takes that is not flagged as HP removal. Attack damage is not amplified.",
        "Since it uses incoming amplification, it does affect the damage of abilities that ignore outgoing amplification (e.g. Damage Return, cleave and Moon Glaives)."
      ],
      "mana": "18",
      "item_behaviour": [],
      "name": "Hunter's Boomerang",
      "cooldown": "125",
      "description": "Tosses a boomerang in an arc. Upon contact, it returns to Hoodwink. The boomerang will deal damage as it passes through or hits enemies, and apply a Hunter's Mark that causes affected enemies to be slowed and be more vulnerable to spell damage.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 0.2+1.07",
        "Cast Range:  900",
        "Boomerang Radius: 150",
        "Boomerang Arc Distance: 400",
        "Damage: 250",
        "Move Speed Slow: 20%",
        "Incoming Spell Damage Amp: 20%",
        "Debuff Duration: 7"
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Hoodwink_Sharpshooter_1.mp3\/revision\/latest?cb=20201219182022",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "notes": [
        "For better readability, the turn rate during the wind-up time is given as degrees per second, instead of radians per 0.03 seconds. 60° per second equal a turn rate of 0.031.",
        "60° per second equal a turn rate of 0.031.",
        "A timer above Hoodwink's head shows how much time is left before the bolt releases. This timer is visible to everyone.",
        "The direction can be changed with a move order (TagTalent Right Click or M). A line indicator is cast in front of Hoodwink while aiming the shot, showing the path it will take once released. The indicator also shows for how long it is being winded up, starting out green, slowly turning red over 5 seconds. The indicator is visible to the player only. Neither allies nor enemies can see it.",
        "A line indicator is cast in front of Hoodwink while aiming the shot, showing the path it will take once released.",
        "The indicator also shows for how long it is being winded up, starting out green, slowly turning red over 5 seconds.",
        "The indicator is visible to the player only. Neither allies nor enemies can see it.",
        "Hoodwink can still perform other actions during Sharpshooter. Non-targeted abilities and items are used normally. However, targeted items that require facing can only be cast when targeted within her current facing direction. Targeting outside her facing direction causes her to get locked in position until the stop (S) or hold command are used.",
        "However, targeted items that require facing can only be cast when targeted within her current facing direction.",
        "Targeting outside her facing direction causes her to get locked in position until the stop (S) or hold command are used.",
        "Hoodwink is disarmed during Sharpshooter. Attack orders behave like move orders during disarms, and it sets a new location as well.",
        "Sharpshooter cannot be interuptted by disables, and can only be canceled by the following conditions: Casting the End Sharpshooter sub-ability or by Hoodwink's death. Casting Town Portal Scroll or other teleport abilities. Being Relocated.",
        "Casting the End Sharpshooter sub-ability or by Hoodwink's death.",
        "Casting Town Portal Scroll or other teleport abilities.",
        "Being Relocated.",
        "However, silencing Hoodwink prevents her from manually firing Sharpshooter earlier with the sub-ability.",
        "Once released, Hoodwink gets knocked back in an arc with a height of 75 and distance of up to 350 over up to 0.4 seconds, or until touching the ground again. This means the knockback distance and duration can be reduced\/increased by jumping up\/down a ramp or impassable terrain.",
        "This means the knockback distance and duration can be reduced\/increased by jumping up\/down a ramp or impassable terrain.",
        "The damage starts at 110\/180\/250 and increases by 14.67\/24\/33.33 (TagTalent 19.56\/32\/44.44) for each 0.1 seconds wound up, reaching the full damage in 3 seconds.",
        "The debuff duration starts at 1 and increases by 0.13 (TagTalent 0.18) for each 0.1 seconds wound up, reaching the full duration in 3 seconds. The debuff applies Break on the target, disabling their passive abilities.",
        "The debuff applies Break on the target, disabling their passive abilities.",
        "The bolt travels at a speed of 2200 (TagTalent 2750), and travels for the full distance, or until hitting a valid target.",
        "The bolt starts on Hoodwink's position. It can hit units up to 3125 range away. It does not search for units behind the starting location.",
        "Can only hit heroes and clones, but not illusions and creep-heroes. The projectile does not hit invulnerable or hidden units, it flies right through them.",
        "The projectile does not hit invulnerable or hidden units, it flies right through them.",
        "The bolt first applies the debuff, then the damage.",
        "The bolt provides 350 radius flying vision as it travels. This vision does not linger.",
        "The cast backswing starts the moment the cast begins, so the effective backswing depends on when the shot was released. This means the backswing can range from 4.5 to 9.5 seconds.",
        "This means the backswing can range from 4.5 to 9.5 seconds."
      ],
      "mana": "45",
      "item_behaviour": [],
      "name": "Sharpshooter",
      "cooldown": "125\/175\/225",
      "description": "Hoodwink charges up and fires a deadly bolt from her crossbow, dealing heavy damage, break and slow to an enemy Hero. The damage and debuff duration scale up to max after 3 seconds, and the bolt is fired automatically after 5 seconds. Hoodwink is knocked backwards for a distance of 350 from the force of the shot.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+9.5",
        "Cast Range:  3000",
        "Max Travel Distance:  3000",
        "Bolt Collision Radius: 125",
        "Turn Rate in Degrees per Second: 60°",
        "Max Wind-Up Time: 3 ( 2.25)",
        "Max Aim Time: 5",
        "Self Knockback Distance: 350",
        "Starting Power: 20%",
        "Max Damage: 550\/900\/1250",
        "Move Speed Slow: 30%\/40%\/50%",
        "Max Slow Duration: 5",
        "Self Knockback Duration: 0.4"
      ],
      "legacy_key": "T",
      "story": "While her first arbalest was a chance discovery, Hoodwink now takes great care in carving and caring for her own -- of course with some necessary components pilfered or otherwise cleverly procured."
    },
    {
      "audioUrl": "",
      "effects": [
        "Ability: No Target"
      ],
      "notes": [
        "Replaces Sharpshooter until the sub-ability is used, or the bolt is released.",
        "Interrupts Hoodwink's channeling abilities upon cast.",
        "Hoodwink is unable to level Sharpshooter up while this sub-ability is active."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "End Sharpshooter",
      "cooldown": "0",
      "description": "Release the charged shot, regain ability to move and attack.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0"
      ],
      "legacy_key": "T",
      "story": "Fire!"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 17.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 3.6,
    "attrAgility": 24.0
  },
  "description": "Shackles her enemies to trees. Always at hand when trouble's afoot, Hoodwink lives to tangle with the threats that fill the haunted forest she adopted as her home. A natural Sharpshooter toting a massive crossbow and firing Acorn Shots while still able to Scurry through the woodland with the greatest of ease, Hoodwink is nearly impossible to keep tabs on in battle and Bushwhacks her foes when they least expect her to. Losing track of her once, she will use the opportunity to mislead her foes by sending out a Decoy, only to pop out holding her Boomerang behind them — their stunned carcasses already dangling in one of her nets.  Support Nuker Escape Disabler ★★☆",
  "trivia": [
    "Hoodwink was teased in the Diretide 2020 trailer, where she appeared briefly with an unknown bird character in a newspaper article Snapfire is reading.[1]",
    "Hoodwink featured in the Nemestice trailer and fought Arc Warden.",
    "Brooke Williams, who voices Hoodwink, has played other video game characters such as Merveil, the Act 1 final boss in Path of Exile.",
    "Hoodwink's response upon buying Gleipnir, Link▶️ \"Wait, if the Gleipnir's here. Then he's... I gotta go.\" is a reference to Primal Beast who she had chained up with it. This in return may be a reference to the item being based on the Gleipnir artifact from Norse mythology that leashed the demon wolf Fenrir to prevent him from starting Ragnarok.",
    "This in return may be a reference to the item being based on the Gleipnir artifact from Norse mythology that leashed the demon wolf Fenrir to prevent him from starting Ragnarok."
  ],
  "history": "Hoodwink's earliest years were spent in the idyllic expanse of green that once filled the edges of Krimwohl. But as that kingdom grew, and the needs of both her citizens and her armies became ravenous, rival ore and timber barons scratched and clawed to outpace each other in devouring the natural beauty of the border forests, gorging themselves to meet the demands of the changing land. To those living in the ancient timberlands, the choice came down to following the line of refugees into the pacified zones, falling to Krimwohl's black powder and steel while defending their homes, or fleeing further north to tempt fate in the haunted glens and groves of the misty Wood Tomo'kan. So it was in those treacherous northern mistwoods that Hoodwink came of age, dodging the horrific predators of the Tomo'kan, ingratiating herself with some of the local banditry whilst antagonizing others, and finding absolutely every which way to be underfoot whenever some interesting mischief arose--often allegedly the cause of it. But when the faintest whiff of Krimwohl's fires eventually drifted into her adopted home, Hoodwink's thoughts turned to any family and friends who might have survived the invasion--now made to eke out lives in the razed lands whose wounds scarred her very soul--and she couldn't help but approach the edges of civilization to get a glimpse of the devils that had destroyed her old life. There, she saw that the monsters from her childhood weren't monsters at all. They were just...people. Soldiers, laborers, merchants...and refugees. And the soldiers, even with their black powder and steel, were nothing compared to the dangers of the Tomo'kan--real dangers with tentacles and teeth--dangers she danced around like a twirling maple seed. Knowing she can always find safe passage in the tangles of the Tomo'kan, where most warm-blooded folk wisely fear to tread, Hoodwink now strikes out against those who dare try to further pacify the wilds, happily taking what she likes from their belongings, destroying what she has no use for, and helping guide any kindred survivors back to a life in the green once again.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "2 Acorn Shot Charges",
        "talent_left": "+135 Bushwhack Radius"
      },
      {
        "talent_lvl": "20",
        "talent_right": "25% Sharpshooter Faster Projectile \/ Charge Time",
        "talent_left": "-4 Armor Corruption"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+60 Bushwhack Damage",
        "talent_left": "+2 Acorn Shot Bounces"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+40% Scurry Evasion When Active",
        "talent_left": "-3s Bushwhack Cooldown"
      }
    ],
    "notes": [
      "Armor Corruption from talents is not disabled by Break. The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes.",
      "The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes."
    ]
  }
}