{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Wind_Waker_Cyclone.mp3\/revision\/latest?cb=20210120233455",
      "effects": [
        "Cast Range: 550",
        "Cyclone Radius: 24",
        "Damage: 50",
        "Self Cyclone Speed: 360",
        "Duration: 2.5"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "Applies a basic dispel and Cyclone effect on the target upon cast, turning it invulnerable and fully disabled. The Cyclone duration is not affected by status resistance.",
        "The Cyclone duration is not affected by status resistance.",
        "Cyclone first applies the dispel, then the invulnerability.",
        "Can target any unit that is not a ward or building. Cannot be cast on allies who have ☐ Disabled Help from the caster.",
        "Cannot be cast on allies who have ☐ Disabled Help from the caster.",
        "The affected unit is silenced, muted and disarmed.",
        "When targeting self, Right Click on the ground causes the user to be moved via forced movement at a speed of 360. Since it uses forced movement, it ignores the user's turn rate, and allows the affected unit to path through cliffs and trees. Targeting own Meepo Clones or own Tempest Doubles behaves as if the item was self targeted.",
        "Since it uses forced movement, it ignores the user's turn rate, and allows the affected unit to path through cliffs and trees.",
        "Targeting own Meepo Clones or own Tempest Doubles behaves as if the item was self targeted.",
        "While cycloned, the affected unit is moved upwards and has no collision. However, a pathing blocker is created at the base of the cyclone within a 24 radius.",
        "The damage is applied at the end of the duration. If the cyclone gets dispelled, it still applies the damage as soon as the target lands. The damage is only applied to enemy targets.",
        "The damage is only applied to enemy targets.",
        "Can be cast on Roshan, but has no effect, since Roshan is immune to forced movement. However, the damage is still applied.",
        "Shares cooldown with other Eul's Scepter of Divinity-based items."
      ],
      "mana": "175",
      "abilityName": "Cyclone",
      "cooldown": "18",
      "description": "Sweeps a target unit up into a cyclone, making them invulnerable for 2.5 seconds. Cyclone can be cast on yourself, enemy units or allied units. Enemy units take 50 magical damage upon landing.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "420 mana and 1.75 mana regeneration.",
    "35 main attack damage to heroes."
  ],
  "cost": "6825",
  "lore": null,
  "consistFrom": [
    "Eul's Scepter of Divinity",
    "Mystic Staff",
    "Recipe"
  ],
  "name": "Wind Waker",
  "description": "Proof enough to some that unseen forces manipulate the happenings of the material plane.",
  "trivia": [
    "The item's name may be a reference to The Legend of Zelda: The Wind Waker"
  ],
  "upgradeIn": null,
  "tips": [
    "Cyclone can be used in the following situations: Offensively by disabling an enemy before a gank, giving you the time to set up your abilities. On fleeing enemies to give your team the time to surround the target. On enemies in teamfights to take them out of the fight for a few seconds. This is especially effective on carries. ↓↓ Double-tapping during teamfights, baiting enemies into using their abilities on you, then becoming invulnerable to interrupt their burst damage. To buy yourself a little more time for abilities and items to come off cooldown, especially items like Blink Dagger or Blade Mail. On an enemy who has activated items like Blade Mail, Mask of Madness or Lotus Orb. Doing so will waste the duration of those items.",
    "Offensively by disabling an enemy before a gank, giving you the time to set up your abilities.",
    "On fleeing enemies to give your team the time to surround the target.",
    "On enemies in teamfights to take them out of the fight for a few seconds. This is especially effective on carries.",
    "↓↓ Double-tapping during teamfights, baiting enemies into using their abilities on you, then becoming invulnerable to interrupt their burst damage.",
    "To buy yourself a little more time for abilities and items to come off cooldown, especially items like Blink Dagger or Blade Mail.",
    "On an enemy who has activated items like Blade Mail, Mask of Madness or Lotus Orb. Doing so will waste the duration of those items."
  ]
}