{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Visage_Grave_Chill.mp3\/revision\/latest?cb=20191216030319",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self \/ Enemies"
      ],
      "notes": [
        "The slow and speed bonus values are independent from each other. Upon cast, Visage gains movement speed based on his current movement speed while the affected target loses movement speed based on theirs. The same applies to the attack speed bonus and its reduction. This also means when either Visage or the target loses the buff\/debuff, the other still keeps theirs.",
        "Upon cast, Visage gains movement speed based on his current movement speed while the affected target loses movement speed based on theirs.",
        "The same applies to the attack speed bonus and its reduction.",
        "This also means when either Visage or the target loses the buff\/debuff, the other still keeps theirs.",
        "The buff is also independently applied to Familiars within 900 range of Visage. Dispelling Visage does not remove the buff on the Familiars. The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden. This buff is not applied to other player-controlled units. Since the buff is not aura-based, Familiars can move away from Visage and still keep the buff after Grave Chill is cast.",
        "Dispelling Visage does not remove the buff on the Familiars.",
        "The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden.",
        "This buff is not applied to other player-controlled units.",
        "Since the buff is not aura-based, Familiars can move away from Visage and still keep the buff after Grave Chill is cast."
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "item_behaviour": [],
      "name": "Grave Chill",
      "cooldown": "100",
      "description": "Visage drains the movement and attack speed of the targeted unit, gaining it for itself and nearby familiars.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range:  625",
        "Familiar Search Radius: 900",
        "Move Speed Change: 15%\/20%\/25%\/30%",
        "Attack Speed Change: 25\/40\/55\/70",
        "Duration: 6"
      ],
      "legacy_key": "G",
      "story": "The warmth of the sun is never felt in the dark cold of the Narrow Maze."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Visage_Soul_Assumption_1.mp3\/revision\/latest?cb=20191216030321",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1000.",
        "Each instance of damage taken by heroes within 1800 radius is saved for 6 seconds or until Soul Assumption is cast. When the sum of the saved damage exceeds 100 damage, a charge is added. A total of 300\/400\/500\/600 damage is needed, within the radius in the last 6 seconds to reach the maximum amount of charges.",
        "When the sum of the saved damage exceeds 100 damage, a charge is added.",
        "A total of 300\/400\/500\/600 damage is needed, within the radius in the last 6 seconds to reach the maximum amount of charges.",
        "Counts damage values of all 3 damage types between 2 – 3000 (after reductions) that is dealt by player-controlled units and Roshan to heroes and clones. Does not count self-inflicted damage (e.g. Mist Coil), damage flagged as HP Removal (e.g. Soul Ring), and from illusions and creep-heroes.",
        "Does not count self-inflicted damage (e.g. Mist Coil), damage flagged as HP Removal (e.g. Soul Ring), and from illusions and creep-heroes.",
        "The number of current charges is visible in the form of yellow bars above Visage. This is visible to Visage and his allies only.",
        "Upon cast, Soul Assumption's damage is set and the charges counter is reset upon projectile launch. The projectile's visual appearance also reflects the number of charges, revealing how much damage it is approximately about to deal.",
        "The projectile's visual appearance also reflects the number of charges, revealing how much damage it is approximately about to deal.",
        "With 0\/1\/2\/3\/4\/5\/6 charges, Soul Assumption can deal 20\/90\/160\/230\/300\/370\/440 (TagTalent 20\/110\/200\/290\/380\/470\/560) damage to the target (before reductions).",
        "TALENT NOTES The Soul Assumption multishot talent launches 1 additional projectile towards random visible valid targets within the range. With the cast range and the range buffer, the ability has a search range of 1300. Cannot target the primary target with the additional projectile, so when no other targets are nearby, nothing happens. The secondary target is chosen randomly within the area, with heroes (including illusions and clones) being prioritized. Treats creep-heroes as creeps. Since the additional projectile uses the ability's cast range, cast range increasing effects increase its range as well.",
        "With the cast range and the range buffer, the ability has a search range of 1300.",
        "Cannot target the primary target with the additional projectile, so when no other targets are nearby, nothing happens.",
        "The secondary target is chosen randomly within the area, with heroes (including illusions and clones) being prioritized. Treats creep-heroes as creeps.",
        "Since the additional projectile uses the ability's cast range, cast range increasing effects increase its range as well."
      ],
      "mana": "4",
      "item_behaviour": [],
      "name": "Soul Assumption",
      "cooldown": "135",
      "description": "Visage gathers charges of soul essence each time nearby heroes take more than 100 damage. When the essence is released, it deals base damage as well as damage for each gathered soul charge.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range:  1000",
        "Damage Gather Radius: 1800",
        "Number of Targets: 1 ( 2)",
        "Charge Gain Damage Threshold: 100",
        "Max Charges: 3\/4\/5\/6",
        "Base Damage: 20",
        "Damage per Charge: 70 ( 90)",
        "Charge Duration: 6",
        "<span image=\"images\\Talent\"><\/span> Secondary Target Range Buffer: 300"
      ],
      "legacy_key": "C",
      "story": "The collected souls of the dead reach out to bring another into their fold."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Visage_Gravekeeper%27s_Cloak.mp3\/revision\/latest?cb=20210103162728",
      "effects": [
        "Ability: Passive",
        "Affects: Self ",
        "Damage: "
      ],
      "notes": [
        "Applies generic incoming damage reduction on Visage. Stacks additively with other sources of generic incoming damage manipulation. The reduction affects all damage Visage takes that is not flagged as HP removal. The damage reduction only reacts on player-based damage greater than 40 (after all other reductions) that is not self-inflicted.",
        "The reduction affects all damage Visage takes that is not flagged as HP removal.",
        "The damage reduction only reacts on player-based damage greater than 40 (after all other reductions) that is not self-inflicted.",
        "Upon learning, 4 floating stones appear around Visage, indicating the number of layers he has. A stone disappears for each missing layer. The number of layers can be seen on the status buff icon as well. The recharge time for each layer is independent of all others. Multiple layers can recharge at once, if they are removed quickly enough. Damage dealt to Familiars does not remove layers.",
        "The number of layers can be seen on the status buff icon as well.",
        "The recharge time for each layer is independent of all others. Multiple layers can recharge at once, if they are removed quickly enough.",
        "Damage dealt to Familiars does not remove layers.",
        "With 4 layers, the damage reduction is hard capped at 32%\/48%\/64%\/80%. For how much damage reduction is granted per layer, please refer to the chart below.",
        "For how much damage reduction is granted per layer, please refer to the chart below.",
        "The aura also affects all Familiars under Visage's control, granting them damage reduction based on the current charges on Visage. The buff lingers for 0.5 seconds. Unlike the damage reduction on Visage, this damage reduction has no minimum threshold, reducing all damage they take. The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden. This buff is not applied to other player-controlled units. TALENT NOTES The Gravekeeper's Cloak armor talent also grants armor to the Familiars. Visage receives this armor bonus from the ability's passive modifier, since the aura only affects Familiars.",
        "Unlike the damage reduction on Visage, this damage reduction has no minimum threshold, reducing all damage they take.",
        "The buff is applied even while they are invulnerable (i.e. Stone Form), but not when hidden.",
        "This buff is not applied to other player-controlled units.",
        "TALENT NOTES The Gravekeeper's Cloak armor talent also grants armor to the Familiars. Visage receives this armor bonus from the ability's passive modifier, since the aura only affects Familiars.",
        "Visage receives this armor bonus from the ability's passive modifier, since the aura only affects Familiars.",
        "SHARD NOTES Adds an active component to Gravekeeper's Cloak, with the passive effects still present. Except for the health regeneration values, the other values are taken from Familiars' Stone Form, based on the current level of Summon Familiars. Can regenerate 4.17% of Visage's maximum health per second over the duration. Stone Form notes fully apply. If Summon Familiars is not learned, nothing happens upon cast, wasting the mana and cooldown.",
        "Except for the health regeneration values, the other values are taken from Familiars' Stone Form, based on the current level of Summon Familiars.",
        "Can regenerate 4.17% of Visage's maximum health per second over the duration.",
        "Stone Form notes fully apply.",
        "If Summon Familiars is not learned, nothing happens upon cast, wasting the mana and cooldown."
      ],
      "mana": "60",
      "item_behaviour": [],
      "name": "Gravekeeper's Cloak",
      "cooldown": "125",
      "description": "Visage generates a layered barrier that protects him from damage. If he receives damage from a player, one layer is removed, and takes time to recover.",
      "hot_key": "E",
      "params": [
        "Aura Radius: 900",
        "Max Layers: 4",
        "Damage Reduction per Layer: 8%\/12%\/16%\/20%",
        "Damage Reduction Cap: 80%",
        "Min Damage Threshold: 40",
        "Layer Recharge Time: 6\/5\/4\/3",
        "Aura Linger Duration: 0.5",
        "Active Max Health Restored: 25%",
        "<span image=\"images\\Talent\"><\/span> Armor Bonus: 10"
      ],
      "legacy_key": "V",
      "story": "Visage's tough scales share equal properties of ghost and stone, making it nearly impervious to blade and magical assault."
    },
    {
      "audioUrl": "",
      "effects": [
        "Ability: No Target",
        "Affects: Familiars"
      ],
      "notes": [
        "Does not interrupt Visage's channeling abilities upon cast.",
        "This ability is disabled when no Familiar has Stone Form ready. The ability goes on a cooldown equal to the cooldown time of the Stone Form with the lowest cooldown among all Familiars. The cooldown is not affected by any cooldown reduction and cooldown resets sources, it periodically updates itself to match the next lowest Stone Form cooldown. This means re-casting Summon Familiars while the sub-ability is on cooldown, Stone Form is instantly ready to be cast again.",
        "The ability goes on a cooldown equal to the cooldown time of the Stone Form with the lowest cooldown among all Familiars.",
        "The cooldown is not affected by any cooldown reduction and cooldown resets sources, it periodically updates itself to match the next lowest Stone Form cooldown.",
        "This means re-casting Summon Familiars while the sub-ability is on cooldown, Stone Form is instantly ready to be cast again.",
        "Upon cast, it orders the closest Familiar to enter Stone Form automatically. Familiars entering Stone Form via this sub-ability do not trigger on-cast effects. If the familiar is stunned, silenced, sleeping, hidden, taunted, feared, or hypnotized, it cannot be made to enter Stone Form.",
        "Familiars entering Stone Form via this sub-ability do not trigger on-cast effects.",
        "If the familiar is stunned, silenced, sleeping, hidden, taunted, feared, or hypnotized, it cannot be made to enter Stone Form.",
        "This ability can be cast when Visage is stunned, cycloned, sleeping, taunted, hidden, or during forced movement. However, he cannot use this ability while silenced, hexed or prevented from acting. Visage is unable to ⇧ Shift-queue this ability.",
        "However, he cannot use this ability while silenced, hexed or prevented from acting.",
        "Visage is unable to ⇧ Shift-queue this ability."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Stone Form",
      "cooldown": "0",
      "description": "After a short delay, the nearest Familiar turns into stone and smashes into the ground, stunning and damaging all targets in the area. The Familiar becomes invulnerable, and will regain its health very rapidly. After 6 seconds, the Familiar will automatically leave Stone Form.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d9\/Visage_Silent_as_the_Grave.mp3\/revision\/latest?cb=20210103162730",
      "effects": [
        "Ability: No Target",
        "Affects: Self "
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Silent as the Grave does not interrupt Visage's channeling abilities upon cast.",
        "Only affects Visage and his Familiars, regardless of where they are on the map. Does not affect any other player-controlled units.",
        "Does not affect any other player-controlled units.",
        "The invisibility is lost upon reaching the cast point of abilities, or upon landing an attack on an enemy. This means if the attack misses, the invisibility is not lost. Visage can pick up, drop, and attack items without breaking the invisibility.",
        "This means if the attack misses, the invisibility is not lost.",
        "Visage can pick up, drop, and attack items without breaking the invisibility.",
        "Grants Visage flying movement, but does not grant flying vision.",
        "The attack damage buff is granted whenever the invisibility buff is lost in any way. The attack damage bonus is also granted by the invisibility buff itself so that the first attack out of the invisibility has the bonus as well. Grants regular flat bonus attack damage based on Visage's and his Familiars' main attack damage respectively. Does not further increase bonus attack damage. Their current main attack damage is periodically checked and the bonuses are adapted instantly.",
        "The attack damage bonus is also granted by the invisibility buff itself so that the first attack out of the invisibility has the bonus as well.",
        "Grants regular flat bonus attack damage based on Visage's and his Familiars' main attack damage respectively. Does not further increase bonus attack damage.",
        "Their current main attack damage is periodically checked and the bonuses are adapted instantly."
      ],
      "mana": "45",
      "item_behaviour": [],
      "name": "Silent as the Grave",
      "cooldown": "100",
      "description": "Turns Visage and familiars invisible, granting Visage bonus movement speed and upgrading its movement type to flying. When Visage or its familiars leave invisibility they deal more damage for 4 seconds. Lasts 35 seconds. Invisibility ends when attacking or casting.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 0+0",
        "Fade Time: 0",
        "Move Speed Bonus: 20%",
        "Attack Damage Bonus: 25%",
        "Damage Bonus Duration: 4",
        "Invisibility Duration: 35"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Visage_Summon_Familiars.mp3\/revision\/latest?cb=20191216030324",
      "effects": [
        "Ability: No Target"
      ],
      "notes": [
        "Interrupts Visage's channeling abilities upon cast.",
        "Does not update any values of already summoned Familiars upon leveling up the ability. Casting Summon Familiars replaces all existing Familiars from a previous cast, creating new ones based on the current level.",
        "Casting Summon Familiars replaces all existing Familiars from a previous cast, creating new ones based on the current level.",
        "The Familiars are summoned 200 range in front on Visage, with 120 range distance between the Familiars. Familiars have flying movement. They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "Familiars have flying movement.",
        "They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "TALENT NOTES Visage and the Familiars have a innate hidden modifier that manages the talent bonuses for them. Therefore the attack damage and movement speed increasing talents are immediately applied to existing Familiars and Visage's illusions. Armor Corruption from multiple sources fully stacks. Visage and all Familiars together can reduce a total of 3 (TagTalent 4) armor.",
        "Therefore the attack damage and movement speed increasing talents are immediately applied to existing Familiars and Visage's illusions.",
        "Armor Corruption from multiple sources fully stacks.",
        "Visage and all Familiars together can reduce a total of 3 (TagTalent 4) armor."
      ],
      "mana": "130\/120\/110",
      "item_behaviour": [],
      "name": "Summon Familiars",
      "cooldown": "150",
      "description": "Conjures blind Familiars to fight for Visage. Familiars possess the Stone Form ability, that allows them to turn into stone, stunning enemies upon landing. While in Stone Form, Familiars are invulnerable, and rapidly regenerate their health. Familiars grant high bounty when killed.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Number of Familiars: 2 ( 3)",
        "Familiar Duration: Permanent"
      ],
      "legacy_key": "T",
      "story": "Guardians of the Narrow Maze, Necro'lic's Familiars stand watch over his domain."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Visage_Familiar_Stone_Form_1.mp3\/revision\/latest?cb=20191216030317",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "notes": [
        "The Familiar is rooted during the 0.55-second effect delay. However, it can still turn, attack, and cast abilities during the effect delay.",
        "However, it can still turn, attack, and cast abilities during the effect delay.",
        "After the effect delay, the Familiar is invulnerable and disabled, and the area damage and stun are applied. Stone Form first applies the stun debuff, then the damage. When a Familiar dies during the effect delay, the area effects are not applied, but the visual effects still appear. Upon landing, trees within 375 radius are destroyed.",
        "Stone Form first applies the stun debuff, then the damage.",
        "When a Familiar dies during the effect delay, the area effects are not applied, but the visual effects still appear.",
        "Upon landing, trees within 375 radius are destroyed.",
        "Can regenerate up to 900\/1050\/1200 health over its full duration.",
        "Stone Form's duration is indicated by a yellow number above the Familiar, visible to Visage only."
      ],
      "mana": "14",
      "item_behaviour": [],
      "name": "Stone Form",
      "cooldown": "0",
      "description": "After a short delay, the Familiar turns into stone and smashes into the ground, stunning and damaging all targets in the area. The Familiar becomes invulnerable, and will regain its health very rapidly. After 6 seconds, the Familiar will automatically leave Stone Form.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0",
        "Effect Radius: 375",
        "Effect Delay: 0.55",
        "Health Regen Bonus: 150\/175\/200",
        "Damage: 60\/100\/140",
        "Stun Duration: 1\/1.25\/1.5",
        "Stone Form Duration: 6"
      ],
      "legacy_key": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 1.3,
    "attrAgility": 11.0
  },
  "description": "Scouts and attacks with his familiars. Perched atop the Narrow Maze was Visage, a dreadful gargoyle form to which the eternal spirit Necro'lic was bound. Tasked with hunting down those who escape the afterlife, Visage instills Grave Chill in his prey, impairing them while augmenting his speed. He reaps their essence with Soul Assumption, gathering energy from the anguish they felt before releasing it in a devastating attack. Protected by the Gravekeeper's Cloak, the gargoyle's ablative layers deflect both steel and spells. His deadly Familiars scout the land for runaways as Silent as the Grave. On his command, they harass their prey, dropping down to earth as Stone Statues to restrain the captive for their master's impending arrival.  Support Nuker Durable Disabler Pusher ★★★",
  "trivia": [
    "Visage has one of the most numerous ability remakes in the game, with Grave Chill being his only mainstay: Soul Assumption, in an earlier version, was an autocast enabled attack modifier where he will deal bonus damage and steal the life of his enemies upon death, healing him and leaving no corpse. Gravekeeper's Cloak used to be a passive aura where allies in the area will be healed when Visage takes damage, physical or magical. Raise Revenants, his former ultimate, lets him summon up to eight pitch-black, gargoyle-shaped spirits from a corpse. It was likely changed because of it being a very effective scouting tool that makes map control easier. The Revenants had good vision range, a flying attribute, and can be resummoned easily since the ability neither cost a lot of mana nor had a long cooldown. This, along with the fact that the Revenants did not do a lot of damage on their own (attack modifier limits their damage to one-third the stated amount against heroes) and no special abilities give them very limited usage in combat situations.",
    "Soul Assumption, in an earlier version, was an autocast enabled attack modifier where he will deal bonus damage and steal the life of his enemies upon death, healing him and leaving no corpse.",
    "Gravekeeper's Cloak used to be a passive aura where allies in the area will be healed when Visage takes damage, physical or magical.",
    "Raise Revenants, his former ultimate, lets him summon up to eight pitch-black, gargoyle-shaped spirits from a corpse. It was likely changed because of it being a very effective scouting tool that makes map control easier. The Revenants had good vision range, a flying attribute, and can be resummoned easily since the ability neither cost a lot of mana nor had a long cooldown. This, along with the fact that the Revenants did not do a lot of damage on their own (attack modifier limits their damage to one-third the stated amount against heroes) and no special abilities give them very limited usage in combat situations.",
    "Visage's rival line towards Keeper of the Light Link▶️ \"You shall not pass!\" is a direct quote from Gandalf, a character from The Lord of the Rings. This reference is due to the similarities between Keeper of the Light and Gandalf.[1]"
  ],
  "history": "Perched atop the entrance to the Narrow Maze sit the looming shapes of sneering gargoyles, the paths into the hereafter forever in their gaze. Beasts and birds, men and monsters, all creatures that die and choose to travel beyond must someday pass beneath their sight. For an untethered spirit, the decision to journey through the veil of death is irrevocable. When chance comes, and by craft or cunning some restless soul escapes their hells and heavens, it is the dreaded gargoyle Visage, the bound form of the eternal spirit Necro’lic, who is dispatched to reclaim them. Ruthless and efficient, unhindered by the principles of death and fatigue, Visage stalks its prey without mercy or end, willingly destroying all which may give shelter to the fugitive essence. That which flaunts the laws of the afterlife may never rest, for while it is true that the dead may be revived, it is only a matter of time before Visage finds and returns them to their proper place.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Gravekeeper's Cloak grants +10 Armor",
        "talent_left": "+1 Familiar"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+20 Soul Assumption Damage Per Charge",
        "talent_left": "+20 Visage and Familiars Movement Speed"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-1 Armor Corruption to Visage and Familiars",
        "talent_left": "Soul Assumption Hits 2 Targets"
      },
      {
        "talent_lvl": "10",
        "talent_right": "-3s Grave Chill Cooldown",
        "talent_left": "+6 Visage and Familiars Attack Damage"
      }
    ],
    "notes": [
      "Armor Corruption from talents is not disabled by Break. The armor corruption lasts 10 seconds and stacks with the Armor Corruption talents of other heroes.",
      "The armor corruption lasts 10 seconds and stacks with the Armor Corruption talents of other heroes."
    ]
  }
}