{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Magic_Stick_Energy_Charge.mp3\/revision\/latest?cb=20191227195452",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца.",
        "Получает 1 заряд каждый раз, когда видимое вражеское существо (включая нейтральных крипов) использует способность в радиусе действия.",
        "Не получает заряды от переключаемых способностей, активных модификаторов атаки и перечисленных здесь способностей.",
        "Клоны, иллюзии и крипы-герои не могут получить заряды.",
        "Пассивно срабатывающие заклинания (такие как Quill Spray, Borrowed Time, Multicast и Reincarnation) не дают заряды.",
        "Когда враг использует заклинание из невидимости от Руна невидимости, Shadow Walk, Sand Storm или Moonlight Shadow, то предмет не получает заряды.",
        "Может восстановить до 150 здоровья и маны при максимальном количестве зарядов.",
        "Имеет общее время перезарядки с Magic Wand и Holy Locket.",
        "Если в инвентаре несколько Magic Stick или Magic Wand, то заряды будет получать первый полученный предмет. Если у него максимум зарядов, то получать заряды будет второй полученный предмет.",
        "При улучшении Magic Stick в Magic Wand все заряды сохраняются."
      ],
      "mana": null,
      "abilityName": "Energy Charge",
      "cooldown": "13",
      "description": "Мгновенно восстанавливает 15 здоровья и маны за каждый имеющийся заряд. Может иметь до 10 зарядов. Получает один заряд каждый раз, когда видимый враг в радиусе 1200 использует способность.",
      "params": [
        "Радиус: 1200",
        "Зарядов за способность: 1",
        "Максимум зарядов: 10",
        "Восст. здоровья и маны за заряд: 15"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "200",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Разное",
  "name": "Magic Stick",
  "description": "Простая волшебная палочка, в которой концентрируют магическую энергию начинающие волшебники и великие колдуны.",
  "trivia": null,
  "upgradeIn": [
    "Magic Wand"
  ],
  "bonuses": null,
  "tips": [
    "Magic Stick даёт игроку возможность быстро исцелиться или использовать последнюю способность в бою. Даже в середине игры, когда быстрое исцеление не так эффективно, Magic Stick всё ещё может спасти вам жизнь или помочь совершить убийство врага.",
    "Magic Stick — это отличный предмет против героев, которые растрачивают свои способности, находясь на линии, так как заряды дают вам возможность вернуть потерянное здоровье или использовать больше собственных способностей. Magic Stick очень универсальный предмет и лучше пользоваться им большую часть времени."
  ]
}