{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Cooldown Reduction of multiple Octarine Cores does not stack.",
        "Stacks multiplicatively with other sources of cooldown reduction."
      ],
      "mana": null,
      "abilityName": "Cooldown Reduction",
      "cooldown": null,
      "description": "Reduces the cooldown time of all spells and items by 25%.",
      "params": [
        "Cooldown Reduction: 25%"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Does not stack with the cast range bonus of Aether Lens or other Octarine Cores."
  ],
  "cost": "5475",
  "lore": null,
  "consistFrom": [
    "Aether Lens",
    "Soul Booster"
  ],
  "boughtFrom": "Magical",
  "name": "Octarine Core",
  "description": "At the core of spellcraft are spectrums only the very gifted can sense.",
  "trivia": [
    "Octarine Core's name is an homage to the comic fantasy book series Discworld, paying tribute to the writer Terry Pratchett who died about a month prior to the item's release. In the series, Octarine is a fictional color which is described as \"resembling a flourescent greenish-yellow purple\". The color can only be seen by wizards and by cats, which is also referenced by Octarine Core's item lore. Spell Lifesteal is also shown on a character with greenish-yellow and purple particle effects.",
    "In the series, Octarine is a fictional color which is described as \"resembling a flourescent greenish-yellow purple\". The color can only be seen by wizards and by cats, which is also referenced by Octarine Core's item lore. Spell Lifesteal is also shown on a character with greenish-yellow and purple particle effects.",
    "The components of Octarine Core before 7.27 are the same as the components of the pre-6.60 Aghanim's Scepter."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+425 Health",
    "+725 Mana",
    "+3 Mana Regeneration",
    "+250 Cast Range"
  ],
  "tips": [
    "If you have a hero with short cooldowns on your abilities, consider this item; casting your spells more often in a single fight is a major boon, and the increased casting range allows you to do so without having to stay in the middle of the fight for an extended duration."
  ]
}