{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Monkey_King_Bar_Pierce.mp3\/revision\/latest?cb=20191227195506",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The proc chances of Pierce from multiple Monkey King Bars do not stack. However, Monkey King Bar's pierce works completely independent from Javelin's pierce, fully stacking with it.",
        "However, Monkey King Bar's pierce works completely independent from Javelin's pierce, fully stacking with it.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It is not considered by crit, cleave or lifesteal. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It is not considered by crit, cleave or lifesteal.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Does not work against buildings, but works against wards and allied units.",
        "Adds an average of 52.5 magical damage to every attack.",
        "Pierce uses pseudo-random distribution.",
        "Attacks which proc Pierce cannot miss."
      ],
      "mana": null,
      "abilityName": "Pierce",
      "cooldown": null,
      "description": "Grants each attack a 75% chance to pierce through evasion and deal 70 bonus magical damage.",
      "params": [
        "Proc Chance: 75%",
        "Damage: 70"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4975",
  "lore": null,
  "consistFrom": [
    "Demon Edge",
    "Javelin",
    "Blitz Knuckles",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Monkey King Bar",
  "description": "A powerful staff used by a master warrior.",
  "trivia": [
    "The Monkey King, Sun Wukong, is the subject of the Chinese folk novel Journey to the West. His weapon, Ruyi Jingu Bang (如意金箍棒), is a magical iron rod with ends banded with gold. Although it weighs several tons, the Monkey King can change its size at will so he may shrink it and tuck it behind his ear, or grow exponentially and duplicate into an infinite number of individual rods.",
    "Monkey King's default weapon model is a Monkey King Bar."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+40 Attack damage",
    "+35 Attack speed"
  ],
  "tips": [
    "Monkey King Bar's Pierce works against every form of miss chance, not only evasion. This means it is also a viable pickup when the enemy has sources of blind."
  ]
}