{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0a\/Bristleback_Viscous_Nasal_Goo_1.mp3\/revision\/latest?cb=20191216011435",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1000.",
        "Накладывает один дебафф на цель. Каждое последующее использование делает дебафф сильнее. Число в иконке показывает количество обновлений дебаффа, включая первое использование.",
        "Число в иконке показывает количество обновлений дебаффа, включая первое использование.",
        "Чтобы узнать, сколько брони и скорости движения отнимает каждый эффект Viscous Nasal Goo до 4 (TagTalent 7) на каждом уровне способности, пожалуйста, посмотрите таблицу. Снижает броню цели на 8\/10\/12\/14 (TagTalent 12,5\/16\/19,5\/23) при максимальном количестве эффектов. Снижает скорость передвижения цели на 27%\/39%\/51%\/63% (TagTalent 36%\/57%\/78%\/99%) при максимальном количестве эффектов.",
        "Снижает броню цели на 8\/10\/12\/14 (TagTalent 12,5\/16\/19,5\/23) при максимальном количестве эффектов.",
        "Снижает скорость передвижения цели на 27%\/39%\/51%\/63% (TagTalent 36%\/57%\/78%\/99%) при максимальном количестве эффектов.",
        "Считает крипов-героев за героев.",
        "С улучшением от Aghanim's Scepter, Viscous Nasal Goo использует то же время применения и те же избегаемые снаряды, но другую анимацию применения. Не выбирает целями невидимых, неуязвимых и спрятаных юнитов или юнитов в тумане войны. Радиус применения нельзя увеличить бонусами к дальности применения, кроме увеличивающего дальность применения Viscous Nasal Goo таланта.",
        "Не выбирает целями невидимых, неуязвимых и спрятаных юнитов или юнитов в тумане войны.",
        "Радиус применения нельзя увеличить бонусами к дальности применения, кроме увеличивающего дальность применения Viscous Nasal Goo таланта."
      ],
      "mana": "1,75",
      "item_behaviour": [],
      "name": "Viscous Nasal Goo",
      "cooldown": "12\/16\/20\/24",
      "description": "Обильно сморкается на жертву, снижая ее броню и скорость передвижения. Эффекты от действия способности складываются, а время действия обновляется с каждым повторным применением.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0 ( 0+0)",
        "Дальность применения: 650 ( 800) ( 0)",
        "Максимум эффектов: 4 ( 7)",
        "Базовое снижение брони: 2",
        "Снижение брони за каждый эффект: 1,5\/2\/2,5\/3",
        "Базовое замедление скорости передвижения: 15%",
        "Замедление за каждый эффект: 3%\/6%\/9%\/12%",
        "Длительность на героях: 5",
        "Длительность на крипах: 10",
        "Радиус: 650 ( 800)"
      ],
      "legacy_key": "G",
      "story": "Простуду, подхваченную в снегах, Bristleback делает своим преимуществом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d5\/Bristleback_Quill_Spray_1.mp3\/revision\/latest?cb=20191216011432",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "notes": [
        "При использовании прерывает произносимые способности Bristleback.",
        "Выпускаемые иглы имеют скорость в 2400 и достигают максимума радиуса за 0,29 секунды.",
        "Иглы разлетаются не в форме кольца. Они действуют на каждого врага в пределах расширяющейся области, поэтому их нельзя избежать, блинканувшись к Bristleback.",
        "Центром эффекта является место применения, он не следует за Bristleback.",
        "Накладывает дебафф на каждого врага и с каждым следующим применением добавляет один заряд дебаффа каждому ранее задетому. Первый дебафф отображает число зарядов в иконке статус-бара. Дебафф зарядов - скрытый. Длительность зарядов не связана друг с другом. Успешные применения не обновляют предыдущие заряды. Учитывая текущую перезарядку и длительность эффекта, то способность складывает заряды до 5 раз. Чтобы достигнуть максимального урона, необходимы срабатывания игл от Bristleback. Максимальный урон достигается за 20\/18\/17\/15 (TagTalent 12\/12\/11\/10) эффектов. Чтобы этого достичь, требуется 15\/13\/12\/10 (TagTalent 7\/7\/6\/5) пассивных срабатываний игл (без учета уменьшения перезарядок).",
        "Первый дебафф отображает число зарядов в иконке статус-бара. Дебафф зарядов - скрытый.",
        "Длительность зарядов не связана друг с другом. Успешные применения не обновляют предыдущие заряды.",
        "Учитывая текущую перезарядку и длительность эффекта, то способность складывает заряды до 5 раз. Чтобы достигнуть максимального урона, необходимы срабатывания игл от Bristleback.",
        "Максимальный урон достигается за 20\/18\/17\/15 (TagTalent 12\/12\/11\/10) эффектов. Чтобы этого достичь, требуется 15\/13\/12\/10 (TagTalent 7\/7\/6\/5) пассивных срабатываний игл (без учета уменьшения перезарядок).",
        "Сначала проверяет количество зарядов на юнитах, затем наносит урон, основанный на этом значении, а затем увеличивает число зарядов. То есть первое использование наносит только базовый урон.",
        "И базовый урон от игл, и дополнительный урон, и максимальный урон можно увеличить с помощью усиления урона заклинананий.",
        "Чтобы узнать о том, сколько урона наносит Fury Swipes на каждом уровне при разном количестве эффектов (до учета сопротивления), смотрите таблицу."
      ],
      "mana": "3",
      "item_behaviour": [],
      "name": "Quill Spray",
      "cooldown": "35",
      "description": "Выпускает во все стороны иглы, нанося урон всем врагам вокруг себя. Жертвы получают дополнительный урон за каждое попадание иглами за последние 14 секунд.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 700",
        "Базовый урон: 25\/45\/65\/85",
        "Доп. урон за каждый эффект: 28\/30\/32\/34 ( 48\/50\/52\/54)",
        "Максимальный урон: 550",
        "Длительность одного эффекта: 14"
      ],
      "legacy_key": "R",
      "story": "Честь вышибалы весьма остра. Как и его шипы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Bristleback_Bristleback.mp3\/revision\/latest?cb=20191216011429",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "notes": [
        "Визуальный эффект и звук проигрываются с каждым получением урона спиной, если Bristleback изучил способность Quill Spray. Получение урона боком не вызывает никаких эффектов.",
        "Получение урона боком не вызывает никаких эффектов.",
        "Даёт герою общее уменьшение входяшего урона. Сочетается аддитивно с другими источниками общего уменьшения урона. Bristleback получает меньше урона от всех типов урона за исключением помеченного как отнимающий здоровье. При получении урона со спины эффективное здоровье Bristleback увеличивается на 19%\/32%\/47%\/67%. При получении урона с боков эффективное здоровье Bristleback увеличивается на 9%\/14%\/19%\/25%.",
        "Bristleback получает меньше урона от всех типов урона за исключением помеченного как отнимающий здоровье.",
        "При получении урона со спины эффективное здоровье Bristleback увеличивается на 19%\/32%\/47%\/67%.",
        "При получении урона с боков эффективное здоровье Bristleback увеличивается на 9%\/14%\/19%\/25%.",
        "Проверяет текущее положение источника урона и сопоставляет его с углом поворота Bristleback к каждому источнику. То есть периодический урон будет снижен только если его источник находится в пределах градусов. Урон от Death Ward, Proximity Mines снижается, если герой отворачивается от них, поскольку они и являются источниками урона.",
        "То есть периодический урон будет снижен только если его источник находится в пределах градусов.",
        "Урон от Death Ward, Proximity Mines снижается, если герой отворачивается от них, поскольку они и являются источниками урона.",
        "Пассивная Quill Spray срабатывает, когда спина (но не бока) Bristleback впитывает 200 единиц урона (после всех сопротивлений). У счетчика урона нет лимита по времени. Он сбрасывается только после выпускания пассивных игл. Любой превышающий урон полностью игнорируется, а это означает, что если противник нанесет, например, 400 единиц урона за один раз, пассивная способность сработает лишь единожды. Не учитывает урон, отмеченный как отнимающий здоровье или неотражаемый. Пассивные иглы не срабатывают, если Quill Spray не изучена. Срабатывание Quill Spray не расходует ману, не имеет перезарядки и не связано с перезарядкой активируемой Quill Spray.",
        "У счетчика урона нет лимита по времени. Он сбрасывается только после выпускания пассивных игл.",
        "Любой превышающий урон полностью игнорируется, а это означает, что если противник нанесет, например, 400 единиц урона за один раз, пассивная способность сработает лишь единожды.",
        "Не учитывает урон, отмеченный как отнимающий здоровье или неотражаемый.",
        "Пассивные иглы не срабатывают, если Quill Spray не изучена.",
        "Срабатывание Quill Spray не расходует ману, не имеет перезарядки и не связано с перезарядкой активируемой Quill Spray."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Bristleback",
      "cooldown": null,
      "description": "Герой получает меньше урона от атак со спины и с боков. При получении 200 урона со спины применяется способность Quill Spray текущего уровня.",
      "hot_key": "E",
      "params": [
        "Угол спины: 70°",
        "Угол боков: 110°",
        "Снижение урона от атак в спину: 16%\/24%\/32%\/40% ( 24%\/32%\/40%\/48%)",
        "Снижение урона от атак с боков: 8%\/12%\/16%\/20% ( 12%\/16%\/20%\/24%)",
        "Предел урона: 200"
      ],
      "legacy_key": "K",
      "story": "Иногда бывает полезно повернуться спиной к врагу во время битвы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Bristleback_Hairball.mp3\/revision\/latest?cb=20201224013124",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Снаряд летит со скоростью 1200.",
        "Эффект от Viscous Nasal Goo и Quill Sprays основан на их текущем уровне. Если эти способности не изучены, то Hairball не будет их использовать. Уровень проверяется при попадании снаряда.",
        "Если эти способности не изучены, то Hairball не будет их использовать.",
        "Уровень проверяется при попадании снаряда.",
        "Когда снаряд достигает центра области, все враги в радиусе поражения становятся целью Viscsous Nasal Goo. Viscous Nasal Goo не задевает невидимых существ и существ в тумане войны. В то же время используется первый Quill Spray. Второй применяется спустя 0,1 секунды. Обе способности работают идентично своему обычному применению.",
        "Viscous Nasal Goo не задевает невидимых существ и существ в тумане войны.",
        "В то же время используется первый Quill Spray. Второй применяется спустя 0,1 секунды.",
        "Обе способности работают идентично своему обычному применению.",
        "Так как скорость Quill Spray больше скорости Viscous Nasal Goo, то первые иглы всегда будут задевать врага быстрее, чем это сделает Viscous Nasal Goo, то есть они не будут получать бонуса от снижения брони противника.",
        "Использование Hairball даёт только один эффект Warpath."
      ],
      "mana": "20",
      "item_behaviour": [],
      "name": "Hairball",
      "cooldown": "100",
      "description": "Отхаркивает в указанную область комок игл. Приземлившись, он лопается и применяет на всех врагов в радиусе 700 один эффект Viscous Nasal Goo и 2 Quill Spray.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,1+0,64",
        "Дальность применения: 1500",
        "Радиус: 700",
        "Число эффектов Quill Sprays: 2",
        "Интервал между срабатываниями Quill Spray: 0,1",
        "Число эффектов Viscous Nasal Goo: 1"
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "notes": [
        "Использование предметов, способностей с 0 перезарядкой и способностей, которые не провоцируют срабатывание от применения не будет активировать Warpath. Пассивное срабатывание Quill Spray от Bristleback также не активирует Warpath.",
        "Пассивное срабатывание Quill Spray от Bristleback также не активирует Warpath.",
        "С каждым зарядом размер Bristleback и количество летающий вокруг него частиц увеличивается.",
        "Складывается до 6\/8\/10 раз, давая герою до 120\/200\/300 (TagTalent 228\/344\/480) урона от атаки и 18%\/32%\/50% к скорости передвижения.",
        "Длительность зарядов не связана друг с другом. Успешные применения не обновляют предыдущие заряды. Только первый эффект отображается в интерфейсе. Он показывает число зарядов в иконке.",
        "Только первый эффект отображается в интерфейсе. Он показывает число зарядов в иконке."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Warpath",
      "cooldown": null,
      "description": "Герой нагоняет на себя ярость каждый раз, когда использует способность, повышая свои скорость передвижения и урон.",
      "hot_key": "R",
      "params": [
        "Макс. количество эффектов: 6\/8\/10",
        "Доп. урон за каждый эффект: 20\/25\/30 ( 38\/43\/48)",
        "Доп. скорость за каждый эффект: 3%\/4%\/5%",
        "Длительность одного эффекта: 16\/18\/20"
      ],
      "legacy_key": "W",
      "story": "«Держи себя в руках», — часто наставляла его мама. Но в битве ярость всегда к месту."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 22.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 2.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 17.0
  },
  "description": "Получает меньше урона, отвернувшись от врагов В сражении Bristleback совсем не против подставить врагам спину. Уменьшая весь урон, который ему наносят сзади и сбоку, он безрассудно бросается в бой и обдаёт врагов смертоносными иглами и замедляющими соплями.  Керри Стойкость Инициация Быстрый урон ★☆☆",
  "history": "Ригварл никогда не поворачивался спиной в бою и славился битвами с самыми крепкими и гадкими задирами, до которых только доходили руки. Любимец пьяных толп стал участвовать в подпольных боях, что проводились в каждой придорожной таверне между Сломом и Эльзе, и однажды умелого бойца заприметил один трактирщик, искавший вышибалу в бар. За скромную выпивку Ригварл стал собирать с посетителей плату, следить за порядком и время от времени ломать пару конечностей особо несговорчивым клиентам (а одному членистоногому бедняге однажды сломал целых пять). Но одной праздной ночью хмельной удар разделили Ригварл и его собственная печёнка: он нашёл равного себе бойца. «Не нравятся мне ваши бивни, уважаемый», — пробормотал он заплетающимся языком кряжистому детине с севера, которому пора было заплатить. И началось побоище века! В драку бросилась дюжина посетителей. Не уцелел ни один стул. А закончилось всё невероятно: клиент ушёл, не заплатив за выпивку. За несколько недель раны вышибалы затянулись, а иглы отросли, но удар по чести он простить не мог. Счёт Ригварл оплатил из своего кармана, поклявшись выследить северянина и взыскать с него полную плату. После этого он занялся тренировками, чего никогда раньше не делал, и неожиданно для себя сделал поразительное открытие. С улыбкой расправив иглы, он решил: иногда всё же стоит показывать обидчику спину."
}