{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/47\/Magnus_Shockwave_1.mp3\/revision\/latest?cb=20191216015854",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Shockwave движется со скоростью в 900, проходя максимальное расстояние за 1,333 (TagTalent 1,5) сек.",
        "Поражает существ на расстоянии до 1400 (TagTalent 1550). Это расстояние складывается из дальности прохождения и радиуса. Может задеть врагов на небольшом расстоянии за Magnus.",
        "Может задеть врагов на небольшом расстоянии за Magnus.",
        "Задетые враги притягиваются к центру Shockwave и к Magnus. Чем дальше враги от центра волны, тем сильнее их притягивает в нему, а не к Magnus. Притягивает врагов на расстояние 150 за 0,2 сек. со скоростью 750. Задетые враги разрушают деревья на своём пути.",
        "Чем дальше враги от центра волны, тем сильнее их притягивает в нему, а не к Magnus.",
        "Притягивает врагов на расстояние 150 за 0,2 сек. со скоростью 750.",
        "Задетые враги разрушают деревья на своём пути.",
        "Волна сначала применяет дебаффы, затем наносит урон.",
        "Проигрывает базовый звук и частицы при начале применения.",
        "Замедление от нескольких применений не складывается, но обновляет длительность.",
        "Замедление и урон действуют на Рошана, но притяжение нет.",
        "При улучшении с Aghanim's Scepter Shockwave извергается спустя 1,5 после применения, нанося урон существам на месте волны. Извержение сначала наносит урон, затем применяет дебафф. Shockwave вместе с извержением наносят 206,25\/412,5\/618,75\/825 (TagTalent 225,5\/431,75\/638\/844,25) урона (до учёта сопротивления). Каждый враг враг под действием извержения теряет 75% от своей скорости передвижения и основной брони. Скорость передвижение восстанавливается каждые 0,3 секунды, изменяя значение 16 раз. Однако броня начинает восстанавливаться только спустя 1 секунду после наложения дебаффа, а также имеет интервалы восстановления в 1 секунду, поэтому значения изменяются 4 раз.",
        "Извержение сначала наносит урон, затем применяет дебафф.",
        "Shockwave вместе с извержением наносят 206,25\/412,5\/618,75\/825 (TagTalent 225,5\/431,75\/638\/844,25) урона (до учёта сопротивления).",
        "Каждый враг враг под действием извержения теряет 75% от своей скорости передвижения и основной брони.",
        "Скорость передвижение восстанавливается каждые 0,3 секунды, изменяя значение 16 раз.",
        "Однако броня начинает восстанавливаться только спустя 1 секунду после наложения дебаффа, а также имеет интервалы восстановления в 1 секунду, поэтому значения изменяются 4 раз."
      ],
      "mana": "13\/12\/11\/10",
      "item_behaviour": [],
      "name": "Shockwave",
      "cooldown": "80\/90\/100\/110",
      "description": "Герой отправляет в указанном направлении ударную волну, притягивающую к себе врагов, наносящую им урон и ненадолго замедляющую их.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+1,2",
        "Дальность применения: 1200 ( 1400)",
        "Дальность прохождения волны: 1200 ( 1350)",
        "Радиус: 200 ( 250)",
        "Урон: 75\/150\/225\/300 ( 82\/157\/232\/307)",
        "Замедление скорости передвижения: 75%",
        "Расстояние притягивания: 150",
        "Длительность притягивания: 0,2",
        "Длительность замедления: 0,9 ( 1,4)",
        "Задержка перед извержением: 1,5",
        "Урон извержения от урона способности: 75%",
        "Снижение брони от извержения: 75%",
        "Замедление передвижения от извержения: 75%",
        "Длительность дебаффа извержения: 5"
      ],
      "legacy_key": "W",
      "story": "Вулкан Йорлак всегда был весьма нестабильным, и магнорог научился направлять его раскаты в нужном направлении."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Magnus_Empower.mp3\/revision\/latest?cb=20191216015850",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников",
        "Урон: Физический"
      ],
      "notes": [
        "При применении на себя дает 17,5%\/35%\/52,5%\/70% (TagTalent 35%\/52,5%\/70%\/87,5%) прорубающего урона и 21%\/35%\/49%\/63% (TagTalent 38,5%\/52,5%\/66,5%\/80,5%) к урону. ↓↓ Двойное нажатие автоматически выбирает заклинателя в качестве цели.",
        "↓↓ Двойное нажатие автоматически выбирает заклинателя в качестве цели.",
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом существ. Дополнительный урон не увеличивается. Способность периодически проверяет текущий урон существа и мгновенно адаптирует бонус. Выбор таланта, увеличивающего урон и прорубание, мгновенно обновит все действующие эффекты способность.",
        "Способность периодически проверяет текущий урон существа и мгновенно адаптирует бонус.",
        "Выбор таланта, увеличивающего урон и прорубание, мгновенно обновит все действующие эффекты способность.",
        "Дает целям ближнего боя эффект прорубания и дополнительный урон, а целям дальнего боя - только урон.",
        "Прорубающий урон не может быть увеличен с помощью усиления урона заклинаний и он не дает лечения от вампиризма заклинаний. Может быть усилен усилением входящего урона. Прорубающий урон уменьшается блокировкой урона. Прорубающий урон зависит от значения урона атакующего существа, а не от урона, полученного основной целью. Урон вторичным целям распространяется по конической площади перед существом. Способность сочетается с другими источниками прорубания. Каждый источник действует независимо от другого. Прорубание не действует при атаке вардов, строений или союзных существ. На варды и строения прорубание не действует. Несмотря на визуальные эффекты, прорубающий урон наносится мгновенно по области.",
        "Может быть усилен усилением входящего урона.",
        "Прорубающий урон уменьшается блокировкой урона.",
        "Прорубающий урон зависит от значения урона атакующего существа, а не от урона, полученного основной целью.",
        "Урон вторичным целям распространяется по конической площади перед существом.",
        "Способность сочетается с другими источниками прорубания. Каждый источник действует независимо от другого.",
        "Прорубание не действует при атаке вардов, строений или союзных существ. На варды и строения прорубание не действует.",
        "Несмотря на визуальные эффекты, прорубающий урон наносится мгновенно по области."
      ],
      "mana": "8",
      "item_behaviour": [],
      "name": "Empower",
      "cooldown": "45\/60\/75\/90",
      "description": "Даёт союзнику дополнительный урон и прорубающую атаку. Действует на владельца на 75% сильнее.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+1,07",
        "Дальность применения: 800",
        "Начальный радиус прорубания: 150",
        "Дальность прорубания: 650",
        "Конечный радиус прорубания: 360",
        "Прорубающий урон: 10%\/20%\/30%\/40% ( 20%\/30%\/40%\/50%)",
        "Дополнительный урон: 12%\/20%\/28%\/36% ( 22%\/30%\/38%\/46%)",
        "Бонус себе: 75%",
        "Длительность: 35 ( 45)"
      ],
      "legacy_key": "E",
      "story": "Могучим утробным рыком магнорог демонстрирует свою недюжинную силу."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e7\/Magnus_Skewer_1.mp3\/revision\/latest?cb=20191216015855",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "notes": [
        "Magnus разгоняется со скоростью 900 единиц.",
        "Перемещает Magnus на отрезок в 30 единиц. При выборе расстояние, не кратного этому числу, оно будет округлено в меньшую сторону. То есть минимальное расстояние составляет 30 единиц, а максимально возможное — 900\/960\/1050\/1110 (TagTalent 1260\/1350\/1410\/1500).",
        "То есть минимальное расстояние составляет 30 единиц, а максимально возможное — 900\/960\/1050\/1110 (TagTalent 1260\/1350\/1410\/1500).",
        "Во время движения Magnus обезврежен.",
        "Вражеские герои в радиусе 145 вокруг Magnus оказываются перед героем и движутся вместе с ним.",
        "Во время движения захваченные герои оглушены.",
        "При завершении движения герои оказываются в 200 единицах перед Magnus.",
        "Может захватывать иллюзии и крипов-героев.",
        "Может захватывать и перемещать врагов через непроходимую территорию.",
        "Skewer сначала применяет дебафф замедления, затем наносит урон.",
        "Во время движения разрушает деревья в радиусе 200 единиц вокруг героя и в радиусе 400 в конечной точке."
      ],
      "mana": "22\/20\/18\/16 (TagTalent 15\/13\/11\/9)",
      "item_behaviour": [],
      "name": "Skewer",
      "cooldown": "80",
      "description": "Герой бросается вперёд, пронзая врагов своим массивным рогом. Если на пути попадутся вражеские герои, то их протащит до места назначения, после чего они получат урон, а их скорость передвижения и атаки уменьшится.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,33",
        "Дальность применения: Глобальная",
        "Максимальная дальность прохождения: 900\/975\/1050\/1125 ( 1275\/1350\/1425\/1500)",
        "Радиус: 145",
        "Урон: 80\/170\/260\/350",
        "Замедление скорости передвижения: 20%\/30%\/40%\/50%",
        "Замедление скорости атаки: 25\/30\/35\/40",
        "Длительность замедления: 3,25"
      ],
      "legacy_key": "D",
      "story": "Рога магнорогов очень дороги. Их ценность пропорциональна опасности, которой себя подвергают излишне предприимчивые продавцы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5c\/Magnus_Horn_Toss_1.mp3\/revision\/latest?cb=20201231014402",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Радиус поиска врагов Horn Toss является сегмент круга с радиусом 325 и отсеченная углом в 230°. Это означает, что способность действует на существ перед Magnus, а также слева и справа от него до определенной степени.",
        "Это означает, что способность действует на существ перед Magnus, а также слева и справа от него до определенной степени.",
        "Центр сегмента поиска находится на расстоянии в 75 перед Magnus, что примерно совпадает с положением рога. Это значит, что Horn Toss может задеть существ на расстоянии 400 перед Magnus.",
        "Это значит, что Horn Toss может задеть существ на расстоянии 400 перед Magnus.",
        "Враги после броска находятся на расстоянии от 180 до 210 позади Magnus в зависимости от того, где они находились до броска.",
        "Враги движутся над головой Magnus по дуге с высотой 300 и варьируемой длиной. Бросок всегда длится 7 секунд. Враги не обезвреживаются во время броска.",
        "Враги не обезвреживаются во время броска.",
        "Урон наносится при применении, а замедление накладывается при приземлении. Однако сам модификатор броска также накладывает замедление.",
        "Замедляет и наносит урон Рошану, но не бросает его."
      ],
      "mana": "30",
      "item_behaviour": [],
      "name": "Horn Toss",
      "cooldown": "125",
      "description": "Герой перебрасывает врагов через себя, нанося им урон. Они летят 0,6 сек. и сильно замедляются по приземлении.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,79",
        "Радиус поиска врагов: 325",
        "Угол: 115°",
        "Смещение центра области поиска: 75",
        "Урон: 200",
        "Замедление скорости передвижения: 100%",
        "Замедление скорости атаки: 100",
        "Длительность броска: 0,6",
        "Длительность замедления при приземлении: 1,25"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Magnus_Reverse_Polarity_1.mp3\/revision\/latest?cb=20191216015852",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Мгновенно притягивает всех существ на расстояние 150 от Magnus.",
        "Reverse Polarity сначала применяет дебафф, затем наносит урон.",
        "У способности нет лимита по количеству затрагиваемых существ.",
        "Оглушает Рошана, но не притягивает его к герою.",
        "Эффекты частицы и звук проигрываются в начале применения."
      ],
      "mana": "130",
      "item_behaviour": [],
      "name": "Reverse Polarity",
      "cooldown": "150\/225\/300",
      "description": "Герой изменяет свойства материи, стягивая всех врагов вокруг в точку перед собой, оглушая их мощным хлопком и нанося им урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+1,3",
        "Радиус: 410",
        "Урон: 75\/150\/225",
        "Длительность оглушения: 2,75\/3,25\/3,75 ( 3,75\/4,25\/4,75)"
      ],
      "legacy_key": "V",
      "story": "Магнорог сражается с яростью извергающегося вулкана Йорлак."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 25.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 2.5,
    "attrAgility": 15.0
  },
  "description": "+1 сек. оглушения от Reverse Polarity +10% к урону\/прорубанию от Empower +375 к дальности Skewer +125 к урону от Shockwave −7 сек. перезарядки Skewer +16 к силе за героя, задетого Reverse Polarity +0,5 сек. замедления от Shockwave +10 сек. действия Empower",
  "history": "Лишь в одном было согласие между лучшими кузнецами вулкана Йорлак — в том, что рог магнорога есть драгоценнейший из всех материалов. Самый большой и острый из них принадлежит зверю, которого они прозвали Magnus. Он с легкостью пронзал своим рогом ещё их отцов, пытавшихся заполучить сокровища его рода. Изо дня в день он возвращался в свою пещеру с побагровевшими от крови копытами и рогом — до тех пор, пока родоначальница не призвала его и весь его род уйти из пещер и искать покоя на севере, в тени горы. Магнорог лишь усмехнулся, ведь он всегда справлялся с защитой своего народа. Он решил, что племя останется, ведь магнороги не верят в случайности… и не меняют своих решений. Однако когда внезапное извержение вулкана Йорлак обратило половину рода в пламя и пепел, защитник всё же решился изменить свою волю. Выжившие шли на север, пока не встретили на своем пути заставу с сотней охотников, вооруженных луками и закаленной сталью. Меньшего магнорог и не ожидал. Он повел своих самых свирепых братьев и сестер в битву с яростью, сравнимой лишь с яростью огнедышащей горы, подступающей сзади и неумолимо пожирающей их старейшин, матерей и телят. О дальнейшем ходе событий кузнецы спорят до сих пор. Одни говорят, что магнорог воссоздал свой род, а другие — что он не пережил побоища, умерев от смертельных ранений у бездыханного тела родоначальницы. Но ни те, ни другие не правы. Магнорог поклялся, что вернется в своё племя… но лишь когда последний из виновников извержения падёт от его могучего рога. Ведь магнороги не верят в случайности."
}