{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1f\/Spirit_Vessel_Soul_Release_1.mp3\/revision\/latest?cb=20191227195539",
      "effects": [
        "Cast Range: 750",
        "Charge Gain Radius: 1400",
        "Ally Health Regen Bonus: 40",
        "Enemy Damage per Second: 35",
        "Enemy Current Health as Damage per Second: 4%",
        "Enemy Health Restoration Reduction: 45%",
        "Duration: 8"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "Successive casts on the same target do not stack but refresh the duration instead. The buff and debuff are independent and stack with each other, although the heal gets canceled as soon as the damage ticks.",
        "The buff and debuff are independent and stack with each other, although the heal gets canceled as soon as the damage ticks.",
        "Both Urn of Shadows' and Spirit Vessel's heal and damage debuffs do not stack, with Spirit Vessel's modifiers overriding both of Urn of Shadows' modifiers. When attempting to do so, Urn of Shadows goes on cooldown, without losing charges.",
        "When attempting to do so, Urn of Shadows goes on cooldown, without losing charges.",
        "Can regenerate up to 320 health over its full duration. Deals 35 + 4% of current health as damage in 1-second intervals, starting 1 second after cast, resulting in 8 damage instances. The flat damage is calculated first (after all reductions), followed by the current health as damage per second. Can deal a total of 280 + 27.86% of current health as damage to the targeted enemy (before reductions).",
        "Deals 35 + 4% of current health as damage in 1-second intervals, starting 1 second after cast, resulting in 8 damage instances.",
        "The flat damage is calculated first (after all reductions), followed by the current health as damage per second.",
        "Can deal a total of 280 + 27.86% of current health as damage to the targeted enemy (before reductions).",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan dispels the healing effect, but not the damaging effect. Does not get dispelled by damage flagged as HP Removal.",
        "Does not get dispelled by damage flagged as HP Removal.",
        "Applies heal reduction, health regen reduction, lifesteal reduction and spell lifesteal reduction on the target.",
        "Can only be cast on heroes (including illusions and clones) and creep-heroes.",
        "When no charges are left, Soul Release gains 2 charges from the next enemy hero's death instead of 1. Does not gain charges if the dying hero has Reincarnation, is an illusion, or the Tempest Double. Soul Release charges cannot be gathered by clones, illusions, and creep-heroes.",
        "Does not gain charges if the dying hero has Reincarnation, is an illusion, or the Tempest Double.",
        "Soul Release charges cannot be gathered by clones, illusions, and creep-heroes.",
        "When having multiple Urn of Shadows and\/or Spirit Vessels, the one in the higher inventory slot gains charges. The top left inventory slot has the highest priority, the bottom right one has the lowest. Cannot gain charges while inside the backpack. When multiple heroes in a team have Urn of Shadows, the hero who is closest to the dying enemy hero gains charges. Shares cooldown with Urn of Shadows-based items. All current charges are carried over when upgrading Urn of Shadows-based items.",
        "The top left inventory slot has the highest priority, the bottom right one has the lowest.",
        "Cannot gain charges while inside the backpack.",
        "When multiple heroes in a team have Urn of Shadows, the hero who is closest to the dying enemy hero gains charges.",
        "Shares cooldown with Urn of Shadows-based items.",
        "All current charges are carried over when upgrading Urn of Shadows-based items."
      ],
      "mana": "0",
      "abilityName": "Soul Release",
      "cooldown": "7",
      "description": "When used against enemies, it reduces health by 4% of current health per second, and reduces HP regeneration and healing by 45%. Deals 35 damage per second. When used on allies, it provides 40 health regeneration per second. Lasts 8 seconds. Gains charges every time an enemy hero dies within 1400 units. Only the closest Spirit Vessel to the dying hero will gain a charge.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "40 health and 0.2 health regeneration.",
    "24 mana and 0.1 mana regeneration.",
    "2 attack speed and 0.33 main armor.",
    "2 main attack damage to all \/ \/ heroes."
  ],
  "cost": "2980",
  "lore": null,
  "consistFrom": [
    "Urn of Shadows",
    "Vitality Booster",
    "Recipe"
  ],
  "name": "Spirit Vessel",
  "description": "Forged by a god to entrap the soul of another.",
  "trivia": null,
  "upgradeIn": null,
  "tips": []
}