{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/dd\/Revenant%27s_Brooch_Phantom_Province_1.mp3\/revision\/latest?cb=20220618225122",
      "effects": [
        "Количество атак: 5",
        "Длительность: 15"
      ],
      "notes": [
        "Прерывает произносимые способности заклинателя при применении.",
        "Расходует заряд при запуске атаки, независимо от её исхода. Для героев дальнего боя, это происходит при запуске снаряда.",
        "Когда активна, использовавший может атаковать существ иммунитетом к атакам как обычно. Тем не менее, это не позволяет использовавшему обойти запрет на выбор в цель, то есть это не работает против Book of Shadows и Shadow Realm.",
        "Тем не менее, это не позволяет использовавшему обойти запрет на выбор в цель, то есть это не работает против Book of Shadows и Shadow Realm.",
        "Когда активна, обычные атаки использовавшего наносят магический урон, вместо физического. Это включает все бонусы, кроме дополнительного урона от источников выжигания маны. Полностью действует на все другие бонусы условного урона от атаки (например, урон от оглушающего удара, Fury Swipes, Shadow Blade и т.п.). Не действует на урон, который наносится в отдельности от атаки. (например, Searing Arrows, Desolate и т.п.). Действует только на физический урон от атаки, но не на чистый урон от атаки (например, Bloodrage).",
        "Полностью действует на все другие бонусы условного урона от атаки (например, урон от оглушающего удара, Fury Swipes, Shadow Blade и т.п.).",
        "Не действует на урон, который наносится в отдельности от атаки. (например, Searing Arrows, Desolate и т.п.).",
        "Действует только на физический урон от атаки, но не на чистый урон от атаки (например, Bloodrage).",
        "Когда активна, заставляет прорубание и Psi Blades не наносить никакого урона, независимо от того получает ли цель атаки урон или нет. Также не даёт использовавшему лечиться от вампиризма, когда активна. Не предотвращает нанесение урона по площади.",
        "Также не даёт использовавшему лечиться от вампиризма, когда активна.",
        "Не предотвращает нанесение урона по площади.",
        "Полностью работает с мгновенными атаками, каждая из них расходует заряд. Это значит, что способности, которые наносят несколько атак за одно применение, расходуют заряд на каждую атаку, а не просто один заряд.",
        "Это значит, что способности, которые наносят несколько атак за одно применение, расходуют заряд на каждую атаку, а не просто один заряд.",
        "Работает только когда предмет находится в инвентаре. Перемещение предмета в ранце заставляет бафф не работать, даже после перемещения обратно в основной инвентарь.",
        "Заменяет эффект частиц снаряда для героев дальнего боя на синий снаряд."
      ],
      "mana": "300",
      "abilityName": "Phantom Province",
      "cooldown": "25",
      "description": "Следующие 5 атак владельца наносят магический урон, и ими нельзя промахнуться. Длительность: 15 сек. Позволяет атаковать бесплотных существ и не наносит урона целям, невосприимчивым к магии.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Revenant%27s_Brooch_Witch_Blade.mp3\/revision\/latest?cb=20220618225124",
      "effects": [
        "Интеллекта в урон за секунду: 100%",
        "Замедление скорости передвижения: 25%",
        "Длительность: 4"
      ],
      "notes": [
        "Успешные атаки с Witch Blade не складываются, но обновляют длительность эффекта.",
        "Атака сначала применяет дебафф, а потом урон.",
        "Не действует на варды и постройки или союзных существ.",
        "Наносит урон в 1-секундных интервалах, начиная через 1 секунду после применения дебаффа, срабатывая 4 раза.",
        "Может нанести цели до 400% от интеллекта в урон (до уменьшений).",
        "Делит перезарядку с Witch Blade. Witch Blade у Revenant's Brooch использует изменённую систему перезарядки. Она применяет на использовавшего дебафф, который не даёт способности снова сработать. Длительность этого дебаффа подвергается процентным уменьшениям перезарядки в начале применения. Он также не подвергается источникам сброса перезарядки или источникам прямого уменьшения перезарядки. Это значит, что возможно получить рассинхронизацию с перезарядкой Witch Blade. Потеря отрицательного эффекта невозможна, поэтому попытка снять его приводит к возобновлению эффекта.",
        "Witch Blade у Revenant's Brooch использует изменённую систему перезарядки. Она применяет на использовавшего дебафф, который не даёт способности снова сработать.",
        "Длительность этого дебаффа подвергается процентным уменьшениям перезарядки в начале применения.",
        "Он также не подвергается источникам сброса перезарядки или источникам прямого уменьшения перезарядки.",
        "Это значит, что возможно получить рассинхронизацию с перезарядкой Witch Blade.",
        "Потеря отрицательного эффекта невозможна, поэтому попытка снять его приводит к возобновлению эффекта."
      ],
      "mana": null,
      "abilityName": "Witch Blade",
      "cooldown": null,
      "description": "Следующая атака отравит жертву на 4 сек., замедлив её на 25% и каждую секунду нанося ей урон, равный интеллекту владельца, помноженному на 1. Этой атакой невозможно промахнуться.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6200",
  "lore": null,
  "consistFrom": [
    "Witch Blade",
    "Mystic Staff",
    "Recipe"
  ],
  "name": "Revenant's Brooch",
  "description": "Проклятая брошь павшего стража, блуждающего меж завесами жизни и смерти.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}