{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний. Лечит на 60 % от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.",
        "Лечит на 60 % от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Атака вместе с целью Tether",
          "talentRight": "+900 к здоровью"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-30 сек. перезарядки Relocate",
          "talentRight": "+60 к урону героям от Spirits"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+15% к вампиризму заклинаниями",
          "talentRight": "+300 к макс. дальности Spirits"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+30 к урону",
          "talentRight": "+5 здоровья в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1c\/Tether.mp3\/revision\/latest?cb=20141125151432",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Вспомогательной способностью Break Tether можно разорвать связь с союзником.",
        "Если Io попытается связаться с союзником на расстоянии в 700 единиц или больше, то его притянет к нему. Io притягивается со скоростью в 1000 единиц, пока не окажется на расстоянии в 300 от цели. Может затягивать Io на непроходимую территорию. После притягивания уничтожает все деревья в радиусе 350 от Io. Если Io разрывает связь во время притягивания, то оно мгновенно прервется. Притягивание прерывается, если на Io подействует оглушение, проклятие, исчезновение, страх, гипноз или оцепенение. Принудительное движение также отменяет притягивание, но при завершении движения, а не при применении. Провокация, привязка и безмолвие притягивание не прерывают. Если расстояние между Io и целью превысит 900 (или 2150 во время притягивания), то Tether разорвется.",
        "Io притягивается со скоростью в 1000 единиц, пока не окажется на расстоянии в 300 от цели.",
        "Может затягивать Io на непроходимую территорию.",
        "После притягивания уничтожает все деревья в радиусе 350 от Io.",
        "Если Io разрывает связь во время притягивания, то оно мгновенно прервется.",
        "Притягивание прерывается, если на Io подействует оглушение, проклятие, исчезновение, страх, гипноз или оцепенение.",
        "Принудительное движение также отменяет притягивание, но при завершении движения, а не при применении.",
        "Провокация, привязка и безмолвие притягивание не прерывают.",
        "Если расстояние между Io и целью превысит 900 (или 2150 во время притягивания), то Tether разорвется.",
        "Если расстояние между Io и целью превышает 700, то визуально связь меняется.",
        "Длительность Tether не ограничена. Она разорвется лишь в случае, если будет превышена дистанция прерывания, использована вспомогательная способность, Io спрятали с помощью Assimilate или если заклинатель или выбранная им цель умрет.",
        "Дополнительная скорость передвижения применяется только к союзнику, а скорость Io копирует скорость цели. То есть Io копирует только базовою скорость передвижения и любые бонусы (фиксированные и процентные). Если цель замедлили, то скорость Io не будет учитывать потерю. При этом Io можно замедлить напрямую, но не увеличить его скорость любыми источниками.",
        "То есть Io копирует только базовою скорость передвижения и любые бонусы (фиксированные и процентные).",
        "Если цель замедлили, то скорость Io не будет учитывать потерю.",
        "При этом Io можно замедлить напрямую, но не увеличить его скорость любыми источниками.",
        "На привязанное существо действуют Overcharge, Relocate и регенерация и восстановление здоровья и маны, действующие на Io. Существа продолжают получать бонусы от всех эффектов в невидимом или спрятанном состоянии. Восстановление здоровья и маны действует даже если здоровье или мана Io полные.",
        "Существа продолжают получать бонусы от всех эффектов в невидимом или спрятанном состоянии.",
        "Восстановление здоровья и маны действует даже если здоровье или мана Io полные.",
        "Если Io связывается с невидимым существом, то враги увидят фальшивую связь, соединенную с последним известным расположением этого существа.",
        "Замедление применяется к каждому врагу, задевшему связь. Оно применяется с каждым тиком сервера.",
        "При выборе таланта на 25 уровне, Io совершает мгновенные атаки по каждому врагу, которого атакует связанный союзник. Атака совершается в тот момент, когда союзник запускает свою (включая мгновенные атаки). Неважно, попала ли атака или нет. Не атакует, если у связанной цели также есть этот талант (т.е. цель - иллюзия Io). На мгновенные атаки Io могут сработать любые модификаторы атаки. У этих атак нет эффекта True Strike, но они игнорируют обезоруживание.",
        "Атака совершается в тот момент, когда союзник запускает свою (включая мгновенные атаки). Неважно, попала ли атака или нет.",
        "Не атакует, если у связанной цели также есть этот талант (т.е. цель - иллюзия Io).",
        "На мгновенные атаки Io могут сработать любые модификаторы атаки. У этих атак нет эффекта True Strike, но они игнорируют обезоруживание."
      ],
      "mana": "40",
      "hotKey": "Q",
      "cooldown": "12",
      "description": "Связывает героя с союзным существом, увеличивая скорость передвижения обоих. Когда владелец способности восстанавливает здоровье или ману, их в приумноженном количестве получает и привязанное существо. Связь разорвётся, если отменить способность вручную или если расстояние до цели окажется слишком большим.",
      "spellName": "Tether",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 1800",
        "Дистанция разрыва: 900",
        "Дистанция притягивания: 700",
        "Дистанция прерывания связи при притягивании: 2150",
        "Множитель восстановления: 60%\/90%\/120%\/150%",
        "Доп. скорость передвижения: 5%\/8%\/11%\/14%",
        "Замедление скорости передвижения врага: 8%\/16%\/24%\/32%",
        "Замедление скорости атаки врага: 8\/16\/24\/32",
        "Длительность замедления: 0,2"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Великодушное прикосновение предвечного наполняет межпространственной силой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/48\/Break_Tether.mp3\/revision\/latest?cb=20140525161243",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Tether, пока Io связан.",
        "При использовании прерывает произносимые заклинания Io.",
        "Уходит на 0,25-секундную перезарядку при использовании Tether, поэтому связь нельзя разорвать мгновенно."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Разрывает связь.",
      "spellName": "Break Tether",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f4\/Spirits.mp3\/revision\/latest?cb=20141125151404",
      "effects": [
        "Способность Ненаправленная (TagAghanim Пассивная)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания Io.",
        "При применении заклинание заменяется вспомогательным, позволяющим приближать или отдалять духов.",
        "5 духов призываются в течении четырех секунд (с интервалом в 0,8 секунды), поэтому расстоянии между ними одинаковое. Первый дух появляется на севере от Io, следующие - с интервалом в 1 секунду. Духи автоматически появляются на максимальной дистанции. Духи всегда крутятся по часовой стрелке и следуют за расположением Io. Приближение или отдаление духов не разрушает их порядок расположения. Они всегда движутся по кругу и сохраняют равное расстояние между собой.",
        "Первый дух появляется на севере от Io, следующие - с интервалом в 1 секунду.",
        "Духи автоматически появляются на максимальной дистанции.",
        "Духи всегда крутятся по часовой стрелке и следуют за расположением Io.",
        "Приближение или отдаление духов не разрушает их порядок расположения. Они всегда движутся по кругу и сохраняют равное расстояние между собой.",
        "Духи проходят весь круг за 2,7 секунды независимо от дистанции от Io. Их угловая скорость постоянна, поэтому они будут ускоряться при отдалении от заклинателя. То есть первый созданный дух может облететь Io 7 раз.",
        "Их угловая скорость постоянна, поэтому они будут ускоряться при отдалении от заклинателя.",
        "То есть первый созданный дух может облететь Io 7 раз.",
        "Если существо не-герой оказывается в пределах 110 радиуса столкновения духов, то оно получает урон от столкновения.",
        "Если герой оказывается в пределах радиуса столкновения духов, то дух взрывается в радиусе 360 единиц.",
        "Духи не сталкиваются с и не взрываются от невидимых или спрятанных героев.",
        "Оставшиеся духи одновременно взорвутся при истечении длительности или при повторном использовании, нанося урон от взрыва.",
        "Духи дают летающий обзор на 3 секунды в радиусе 150 единиц при столкновении с героем Они не дают обзор, если взорвались из-за истечения длительности или повторного применения.",
        "Они не дают обзор, если взорвались из-за истечения длительности или повторного применения.",
        "Духи не видны врагам, если сам Io находится в невидимости.",
        "Может нанести до 100\/200\/300\/400 (TagTalent 400\/500\/600\/700) единиц урона одному существу, если все 5 духов взорвутся у цели (до уменьшений).",
        "Считает крипов-героев за героев, а иллюзии - за крипов.",
        "Приобретение Aghanim's Scepter убирает необходимость применения Spirits, постоянно призывая духов вокруг Io. При получении Aghanim's Scepter с духами от применения способности последние исчезают без взрыва. При потере Aghanim's Scepter появившиеся духи не исчезают до столкновения с врагом или смерти Io. Вопреки описанию, духи продолжают появляться с интервалом в 0,8 секунды, а не 1 секунды. Вспомогательная способность всё также доступна для использования. Сама способность Spirits скрыта.",
        "При получении Aghanim's Scepter с духами от применения способности последние исчезают без взрыва.",
        "При потере Aghanim's Scepter появившиеся духи не исчезают до столкновения с врагом или смерти Io.",
        "Вопреки описанию, духи продолжают появляться с интервалом в 0,8 секунды, а не 1 секунды.",
        "Вспомогательная способность всё также доступна для использования. Сама способность Spirits скрыта."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "W",
      "cooldown": "26\/24\/22\/20",
      "description": "Призывает пять духов, которые кружатся вокруг героя. При столкновении с вражеским героем дух взрывается, нанося урон всем существам в области вокруг взрыва. При столкновении с крипом дух наносит немного урона, но не взрывается. После окончания действия заклинания духи взрываются.",
      "spellName": "Spirits",
      "params": [
        "Анимация применения: 0+0",
        "Радиус столкновения: 110",
        "Радиус взрыва: 360",
        "Урон при столкновении: 10\/18\/26\/34",
        "Урон при взрыве: 20\/40\/60\/80 (TagTalent 80\/100\/120\/140)",
        "Длительность: 19 (TagAghanim Постоянная)",
        "Духи постоянно кружатся вокруг героя, появляясь каждую секунду. Духов не может быть больше пяти.",
        "Пассивное появление духов не отключается истощением."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Своей невообразимой силой предвечный раскручивает частицы вселенной."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Способность заменяет Spirits до исчезновения всех духов.",
        "Не прерывает произносимые заклинания Io.",
        "Передвигает духов ближе или дальше к герою со скоростью в 250 единиц. Требуется 2 секунды для достижения максимальной дистанции (и наоборот)."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Призывает или отправляет духов.",
      "spellName": "Spirits Movement",
      "params": [
        "Анимация применения: 0+0",
        "Минимальная дистанция: 200",
        "Максимальная дистанция: 700"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fe\/Overcharge.mp3\/revision\/latest?cb=20141125151311",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Союзников"
      ],
      "notes": [
        "Прерывает произносимые заклинания Io.",
        "Эффект Overcharge действует на союзника даже если Io свяжется с ним после активации заклинания. Длительность Overcharge на союзника не отображается и эффект появляется как постоянный бафф.",
        "Длительность Overcharge на союзника не отображается и эффект появляется как постоянный бафф.",
        "Может восстановить до 4%\/4,8%\/5,6%\/6,4% от максимального здоровья Io за всю длительность.",
        "Может восстановить союзнику до 4%\/4,8%\/5,6%\/6,4% от максимального здоровья цели плюс 2,4%\/4,32%\/6,72%\/9,6% от максимального здоровья Io за всю длительность."
      ],
      "mana": "40\/60\/80\/100",
      "hotKey": "E",
      "cooldown": "22\/20\/18\/16",
      "description": "Герой повышает свою скорость атаки и получает увеличенное восстановление здоровья, зависящее от своего максимального здоровья. Связанное с владельцем способности существо также получает эти бонусы.",
      "spellName": "Overcharge",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость атаки: 50\/80\/110\/140",
        "Восстановление от макс. здоровья: 0.5%\/0.6%\/0.7%\/0.8%",
        "Длительность: 8"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Привлекая энергию мироздания из всех миров, предвечный начинает расплетать время."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Relocate.mp3\/revision\/latest?cb=20141125151335",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя \/ Союзных героев"
      ],
      "notes": [
        "Двойное нажатие автоматически отправит героя к своему фонтану.",
        "Если при применении Io будет оглушен, проклят или на него подействует сон или ураган, то Relocate отменится. Можно использовать, если на Io действует оцепенение, но телепортация не произойдет, если оцепенение продолжится после задержки. Если Io обезмолвлен при завершении применения, то телепортация так же не произойдет. Обезвреживание связанного союзника Io не прервет телепортацию, если применение успешно завершено. Возвращение нельзя прервать.",
        "Можно использовать, если на Io действует оцепенение, но телепортация не произойдет, если оцепенение продолжится после задержки.",
        "Если Io обезмолвлен при завершении применения, то телепортация так же не произойдет.",
        "Обезвреживание связанного союзника Io не прервет телепортацию, если применение успешно завершено.",
        "Возвращение нельзя прервать.",
        "Враги видят во время задержки индикатор на мини-карте, показывающий выбранную точку для телепортации. Создает визуальный эффект в выбранной точке во время задержки телепортации, видный всем. Создает визуальный эффект на позиции Io до телепортации, который также виден всем.",
        "Создает визуальный эффект в выбранной точке во время задержки телепортации, видный всем.",
        "Создает визуальный эффект на позиции Io до телепортации, который также виден всем.",
        "Relocate прерывает произносимые заклинания и текущие приказы Io и связанного союзника как при телепортации, так и при возвращении.",
        "При телепортации в выбранную точку позволяет Io избежать снаряды, но не позволяет их избежать при возвращении. Союзник не избегает снаряды.",
        "Союзник не избегает снаряды.",
        "Io может разорвать связь в любой момент, чтобы предотвратить возвращение героя вместе с ним.",
        "Может телепортировать только героев, иллюзии и крипов-героев.",
        "Телепортирует неуязвимые и спрятанные цели.",
        "При телепортации разрушает деревья в радиусе 300 единиц.",
        "Вы можете отключить помощь, чтобы Io не мог использовать эту способность на вас."
      ],
      "mana": "175",
      "hotKey": "R",
      "cooldown": "90\/75\/60 (TagTalent 65\/50\/35)",
      "description": "Телепортирует героя и связанного с ним союзника в любую точку карты. Спустя некоторое время герой вернётся туда, откуда он телепортировался, также перенеся связанного с собой союзника. Двойное нажатие отправит героя к своему фонтану.",
      "spellName": "Relocate",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: Глобальная",
        "Время применения: 3.5\/3.25\/3",
        "Длительность: 12"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Ио есть воплощение тайн вселенной."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 17.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.6,
    "attrAgility": 14.0
  },
  "description": "Io — это герой с дальним типом атаки, основным атрибутом которого является сила. Его первая способность Tether связывает Io и союзного юнита, увеличивая скорость передвижения обоих. Когда Io пополняет здоровье или ману, привязанный герой тоже восстанавливается, но в умноженном количестве. Связь разрывается, если вы с целью разойдетесь слишком далеко друг от друга, или если Io отменит заклинание. Противник, проходящий через связь Io, замедляется. Вторая способность Spirits призывает пять духов, которые кружатся вокруг Io нанося урон всем вокруг. При попадании по герою духи взрываются, нанося урон по области. Третья способность Overcharge увеличивает скорость атаки героя и увеличивает его восстановление здоровья в зависимости от максимального. Связанный с вами герой получает такой же бонус. Ультимативная способность Relocate телепортирует Io и любого связанного с ним героя в любую точку карты. После телепортации Io и связанный с ним герой вернутся на первоначальное место спустя 12 секунд.",
  "history": "Ио — непостижимое проявление жизненной силы, присутствующее везде и во всём, и для врагов оно оказывается великим разрушителем, а для учёных мужей — блеском божественного ока. Сущность эта находится одновременно на всех уровнях бытия, а её малейшие частицы воплощаются в физическом мире в каждое отдельно взятое мгновение. Подобно великим всадникам-близнецам, Тьме и Свету, а также древнему путнику, чьё истинное происхождение затеряно в веках, — это предвечная сущность вселенной, сила старше самого времени, пришелец из миров за гранью понимания смертных. Ио есть совокупность всех материальных сил притяжения и отторжения, разумное проявление связующей реальность энергии. Присутствие его в материальном мире осязается лишь в контролируемых искривлениях векторов этих сил. Сущность эта по своей природе благожелательна, и передаёт свой непостижимый магнетизм союзникам, делая их сильнее и выносливее. Что движет этой невообразимой силой — неведомо, а её движение по физическому миру — прекрасное напоминание, что вселенная полна загадок и тайн.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Атака вместе с целью Tether",
      "talentRight": "+900 к здоровью"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-30 сек. перезарядки Relocate",
      "talentRight": "+60 к урону героям от Spirits"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+15% к вампиризму заклинаниями",
      "talentRight": "+300 к макс. дальности Spirits"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+30 к урону",
      "talentRight": "+5 здоровья в секунду"
    }
  ]
}