{"abilities":[{"effects":["Cast Range (Tree\/Unit): 350","Cast Range (Other): 450","Current Health as Damage: 40%"],"notes":["When targeting a unit, it deals damage based on the target's current health. Cannot target any player-controlled units or ancient creeps. Uses the shorter cast range and long cooldown when targeting units.","When targeting a tree or ward, it instantly destroys it. Targeting a tree puts the item on a 4 second cooldown, instead of 25 seconds. Can target any tree, Observer Wards, Sentry Wards, Stasis Traps, and Remote Mines. Uses the shorter cast range for trees and longer cast range for wards, traps and mines, and the short cooldown for both.","The cast sound does not play when targeting trees.","Does not share cooldown with Quelling Blade or Battle Fury."],"elements":["Ability Target Unit","Affects Enemy Units \/ Trees","Damage Pure"],"description":"Targets a non-player enemy unit to remove 40% of its current HP. If cast on a tree or ward, instantly destroys it."},{"effects":["Attack Damage Bonus (Melee): 18","Attack Damage Bonus (Ranged): 5"],"notes":["Stacks with the Quell of Battle Fury, but not with Quelling Blade or additional Iron Talons.","When the owner's attack type changes to ranged or melee, the attack damage bonus adapts immediately.","Quell fully works with crits, cleave, splash, and lifesteal.","When attacking creeps, Quell also causes cleave, splash, and Psi Blades to deal more damage to every unit they hit.","The damage Moon Glaives bounces are not increased, since they are based on the attacker's attack damage value.","Does not work against wards, buildings, illusions, Spirit Bear, and allied units. Works against Roshan."],"elements":["Ability Passive","Affects Enemy Units"],"description":"Increases attack damage against non-hero units by 18 for melee heroes, and 5 for ranged."}],"cost":"N\/A","description":"A simple but effective weapon devised to quell a great Hellbear uprising.","trivia":["Prior to the July 14, 2017 Patch, Iron Talon's active ability, Chop, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."],"tips":["Use the active in the jungle against the creep with the most current HP in the middle and hard camp.","Chop can be used to make it easier to last hit creeps that are being attacked by a tower. The extra damage might just be enough to kill the creep if just the attack damage wouldn't be enough."],"attrs":["Tier 1","Active Chop","Passive Quell","Bonus +2 Armor","Disassemble? No","Alert allies? No"],"info":["Iron Talons are fully sharable."]}