{"abilities":[{"effects":["Дальность применения (Дерево\/Юнит): 350","Дальность применения (Вард): 450","Текущего здоровья в урон: 50%"],"notes":["При применении на юнита, наносит урон основывающийся на текущем здоровье цели. Нельзя выбирать подконтрольных игроку юнитов или древних крипов. При применении на юнитах использует меньшую дальность применения и большую перезарядку. Звук играет только при применении на юнитах.","При применении на дерево или вард, мгновенно уничтожает его. При выборе дерева предмет будет иметь перезарядку в 4 секунд, вместо 25 секунд. Можно выбирать любое дерево, включая деревья Sprout. Можно выбирать Observer Ward и Sentry Ward, а также Stasis Trap и Remote Mines у Techies. Использует меньшую дальность применения на деревьях и большую дальность применения на вардах, и короткую перезарядку для обеих.","Не имеет общую перезарядку с Quelling Blade или Battle Fury."],"elements":["Способность Направленная на юнита","Действует на Вражеских существ \/ Деревья","Урон Чистый"],"name":"Chop","description":"Снимает у обычного недружественного существа 50% текущего здоровья. Мгновенно уничтожает деревья и варды."},{"effects":["Дополнительный урон (ближний бой): 18","Дополнительный урон (дальний бой): 5"],"notes":["Сочетается с Quell Battle Fury, но не с Quelling Blade и другими Iron Talon.","Дополнительный урон не учитывается при атаке союзных существ (т.е. добивание своих крипов).","При изменении типа атаки владельца на ближний или дальний, бонус силы атаки сразу меняется соответственно.","Quell полностью работает с критами, прорубающими ударами и вампиризмом. При наличии прорубающего удара, атака по существам расщепляет увеличенный урон по области. Тем не менее, если персонаж имеет Tidebringer, срабатывающая атака не увеличивается Quell.","Урон по ближайшим целям Elder Dragon Form также увеличивает урон по ближайшим целям при атаке крипов.","Урон Moon Glaives не увеличивается, так как он основан на количестве урона атакующего.","Psi Blades будет распространять больше урона при атаке крипов.","Не работает против вардов, строений, Spirit Bear и союзных существ."],"elements":["Способность Пассивная","Действует на Вражеских существ"],"name":"Quell","description":"Увеличивает урон от атак по существам, не являющимися героями, в зависимости от типа атаки владельца."}],"cost":"Н\/Д","description":"Простое, но эффективное оружие, некогда подавившее великое восстание медведемонов.","attrs":["Разряд 1","Активная Chop","Пассивная Quell","Бонус +2 к броне","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Iron Talon — полностью передаваемый предмет."]}