{
  "abilities": [
    {
      "notes": [
        "Талант на дальность атаки также влияет на дальность применения Searing Arrows и Burning Barrage.",
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Clinkz до 26,3125%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Две цели Searing Arrows",
          "talentRight": "+50\/5% Здоровья\/Урона за Death Pact"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+3 к числу стрел у Burning Barrage",
          "talentRight": "+125 к дальности атаки"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к урону от Searing Arrows",
          "talentRight": "−5 сек. перезарядки Skeleton Walk"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1,75 маны в секунду",
          "talentRight": "+12% к сопротивлению магии"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c6\/Clinkz_Burning_Barrage.mp3\/revision\/latest?cb=20210823213542",
      "effects": [
        "Способность Направленная на точку \/ Произносимая",
        "Действует на Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Стрелы летят со скорость 1200 и всегда пролетают полную дистанцию. Скорость стрел не может быть увеличена бонуса к скорости снарядов.",
        "Скорость стрел не может быть увеличена бонуса к скорости снарядов.",
        "Дальность применения зависит от дальности атаки заклинателя. Это значит, что её дальность применения можно увеличить при помощи бонусов к дальности атаки, но не' бонусами к дальности применения заклинаний.",
        "Это значит, что её дальность применения можно увеличить при помощи бонусов к дальности атаки, но не' бонусами к дальности применения заклинаний.",
        "Выпускает стрелы с интервалом в 0,5\/0,48\/0,46\/0,45 (TagTalent 0,25\/0,27\/0,29\/0,3) секунды, начиная немедленно после применения. Это значит, что для выпускания всех стрел потребуется 1\/1,43\/1,84\/2,25 (Шаблон:Знаок 1,25\/1,63\/2,01\/2,4) секунд.",
        "Это значит, что для выпускания всех стрел потребуется 1\/1,43\/1,84\/2,25 (Шаблон:Знаок 1,25\/1,63\/2,01\/2,4) секунд.",
        "Стрелы выпускаются из лука, а не из центра размера столкновения Clinkz. Это приводит к тому, что первая выпущенная стрелка немного смещается влево от Clinkz по сравнению со следующими стрелками. Также Clinkz не будет попадать по врагам, стоящим вплотную к нему.",
        "Это приводит к тому, что первая выпущенная стрелка немного смещается влево от Clinkz по сравнению со следующими стрелками. Также Clinkz не будет попадать по врагам, стоящим вплотную к нему.",
        "Clinkz выполняет мгновенные атаки при попадании по врагам. На эти атаки могут сработать любые модификаторы атаки. Они имеют эффект True Strike и игнорируют обезоруживание. На стрелы всегда накладывается Searing Arrows текущего уровня. Searing Arrows, используемые в Burning Barrage, не требуют маны. талант на несколько целей от Searing Arrows не применяется к Searing Arrows в Burning Barrage.",
        "На эти атаки могут сработать любые модификаторы атаки. Они имеют эффект True Strike и игнорируют обезоруживание.",
        "На стрелы всегда накладывается Searing Arrows текущего уровня. Searing Arrows, используемые в Burning Barrage, не требуют маны. талант на несколько целей от Searing Arrows не применяется к Searing Arrows в Burning Barrage.",
        "Searing Arrows, используемые в Burning Barrage, не требуют маны.",
        "талант на несколько целей от Searing Arrows не применяется к Searing Arrows в Burning Barrage.",
        "Стрелы дают летающий обзор в радиусе 200 во время полёта."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "Q",
      "cooldown": "28\/24\/20\/16",
      "description": "Прерываемая. Герой 1,5\/1,9\/2,3\/2,7 секунды выпускает залп из 3\/4\/5\/6 стрел в выбранном направлении. Они пролетают расстояние в 750\/800\/850\/900 сквозь всех врагов на пути, нанося им 60% от обычного урона и накладывая эффекты атаки.",
      "spellName": "Burning Barrage",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 750\/800\/850\/900 (TagTalent 875\/925\/975\/1025)",
        "Дальность полёта стрел: 750\/800\/850\/900 (TagTalent 875\/925\/975\/1025)",
        "Ширины стрелы: 200",
        "Максимальная длительность: 1,5\/1,9\/2,3\/2,7",
        "Число стрел: 3\/4\/5\/6 (TagTalent 6\/7\/8\/9)",
        "Урон от обычной атаки: 60%"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Clinkz_Searing_Arrows_1.mp3\/revision\/latest?cb=20191216012119",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Физический Мгновенная атака"
      ],
      "notes": [
        "Дальность применения зависит от дальности атаки заклинателя. Это значит, что её дальность применения можно увеличить при помощи бонусов к дальности атаки, но не' бонусами к дальности применения заклинаний. Талант на увеличение дальности атаки увеличит дальность применения до 750.",
        "Это значит, что её дальность применения можно увеличить при помощи бонусов к дальности атаки, но не' бонусами к дальности применения заклинаний.",
        "Талант на увеличение дальности атаки увеличит дальность применения до 750.",
        "Дополнительный урон наносится отдельным источником и считается за урон заклинаний. То есть на урон не влияет и его не учитывают эффекты, взаимодействующие с уроном от атаки. Также на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на урон не влияет и его не учитывают эффекты, взаимодействующие с уроном от атаки.",
        "Также на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "Можно использовать на постройки, но не на варды и союзных существ.",
        "Выбор таланта на дополнительный урон мгновенно улучшит все летящие Searing Arrows.",
        "При выборе таланта на 25-ом уровне при использовании способности также выбирается другая случайная цель в радиусе дальности применения для второй Searing Arrow. Позволяет Clinkz совершить мгновенную атаку по выбранной цели с каждым запуском Searing Arrow. На атаку может сработать любой модификатор атаки или эффект, срабатывающий при атаке. Поскольку способность использует свою дальности применения, эффекты, влияющие на дальность, также влияют на дальность второй стрелы. У второй стрелы нет приоритета для целей. Она выбирает случайную подходящую цель в пределах дальности применения. Поскольку Searing Arrows действует на строения, то вторая стрела также считает строения за цели.",
        "Позволяет Clinkz совершить мгновенную атаку по выбранной цели с каждым запуском Searing Arrow.",
        "На атаку может сработать любой модификатор атаки или эффект, срабатывающий при атаке.",
        "Поскольку способность использует свою дальности применения, эффекты, влияющие на дальность, также влияют на дальность второй стрелы.",
        "У второй стрелы нет приоритета для целей. Она выбирает случайную подходящую цель в пределах дальности применения.",
        "Поскольку Searing Arrows действует на строения, то вторая стрела также считает строения за цели."
      ],
      "mana": "10",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Наполняет стрелы Clinkz огнем, позволяя наносить дополнительный урон.",
      "spellName": "Searing Arrows",
      "params": [
        "Дальность применения: 625 (TagTalent 750)",
        "Урон: 24\/36\/48\/60 (TagTalent 54\/66\/78\/90)",
        "Количество стрел: 1 (TagTalent 2)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Skeleton_Walk.mp3\/revision\/latest?cb=20141125112530",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Skeleton Walk не прерывает произносимые способности Clinkz.",
        "Пока проходит время до невидимости, Clinkz может использовать заклинания, предметы и совершать атаки без выхода из невидимости.",
        "Невидимость спадает при достижении точки применения способностью или предметом или при попадании атаки по цели.",
        "Позволяет Clinkz проходить сквозь других существ, включая варды, но исключая постройки.",
        "Clinkz может поднимать или выкидывать предметы без выхода из невидимости.",
        "При улучшении с Aghanim's Shard в 250 единицах слева и права от Clinkz появляются лучника, смотрящих в ту же сторону. Лучник появляется только при потере баффа Skeleton Walk любым способом. Призывается тот же лучник, что используются способностью Burning Army от . Ниже указаны их характеристики.",
        "Лучник появляется только при потере баффа Skeleton Walk любым способом.",
        "Призывается тот же лучник, что используются способностью Burning Army от . Ниже указаны их характеристики."
      ],
      "mana": "75",
      "hotKey": "E",
      "cooldown": "20\/19\/18\/17 (TagTalent 15\/14\/13\/12)",
      "description": "Clinkz незаметно передвигается сквозь юнитов, пока не нанесет удар.",
      "spellName": "Skeleton Walk",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0,6",
        "Доп. скорость передвижения: 15%\/30%\/45%\/60%",
        "Длительность невидимости: 25\/30\/35\/40",
        "Число лучников: 2",
        "Время жизни лучников: 45",
        "При выходе из невидимости создаёт рядом с героем двух скелетов от способности Burning Army. Увеличивает дополнительную скорость передвижения на 30% и позволяет превысить максимум скорости."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Clinkz_Burning_Army.mp3\/revision\/latest?cb=20210424153341",
      "effects": [
        "Способность Направленная на точку \/ Направленная по вектору",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Для разблокировки требуется Aghanim's Scepter. Может быть разблокирована в Ability Draft если у игрока есть Death Pact.",
        "Может быть разблокирована в Ability Draft если у игрока есть Death Pact.",
        "Burning Army можно использовать без поворота в сторону выбранной области.",
        "Сразу после применения призывает лучников в линию одним за другим. Для появления всех лучников требуется 2 секунды.",
        "Для появления всех лучников требуется 2 секунды.",
        "Первый лучник появляется в начальной выбранной области. Следующие появляются на расстоянии 312,5 единиц друг от друга. Существа смотрят в ту же сторону, что и Clinkz в момент их появления.",
        "Существа смотрят в ту же сторону, что и Clinkz в момент их появления.",
        "Призванных лучников нельзя контролировать. Они автоматически атакуют ближайших вражеских героев вне зависимости от настроек автоатаки. Лучники атакую только героев, включая иллюзии и клонов, исключая крипов-героев. Они используют стандартные правила автоатаки. Но при этом меняют цель только в случае, если их текущую цель больше нельзя атаковать. При этом у них возможно отключить Автоприменение Searing Arrows. Оно включается всегда при появлении лучников.",
        "Лучники атакую только героев, включая иллюзии и клонов, исключая крипов-героев.",
        "Они используют стандартные правила автоатаки. Но при этом меняют цель только в случае, если их текущую цель больше нельзя атаковать.",
        "При этом у них возможно отключить Автоприменение Searing Arrows. Оно включается всегда при появлении лучников.",
        "Урон от атаки лучников периодически приравнивается к общему урону Clinkz То есть также учитывается дополнительный урон.",
        "То есть также учитывается дополнительный урон.",
        "Дальность атаки лучников периодически приравнивается к дальности атаки Clinkz.",
        "Лучники используют Searing Arrows, того же уровня, что и Clinkz. Уровень фиксируется в момент появления. Поднятие уровня Searing Arrows после призыва не улучшит способность лучников. Хоть способность и идентична Searing Arrows Clinkz, но для использования лучникам не нужна мана. Существа также используют талант на увеличение урона и на дополнительные цели Searing Arrows. В Ability Draft Searing Arrows будет у лучников только в том случае, если способность также выбрана.",
        "Уровень фиксируется в момент появления. Поднятие уровня Searing Arrows после призыва не улучшит способность лучников.",
        "Хоть способность и идентична Searing Arrows Clinkz, но для использования лучникам не нужна мана.",
        "Существа также используют талант на увеличение урона и на дополнительные цели Searing Arrows.",
        "В Ability Draft Searing Arrows будет у лучников только в том случае, если способность также выбрана.",
        "Лучники не блокируют лагеря нейтральных крипов.",
        "Урон лучников не уменьшается блокировкой урона."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "80",
      "description": "Герой призывает армию огненных скелетов-лучников. Лучники неподвижны и умирают от 2 aтак героев. Скелеты используют способность Searing Arrows текущего уровня и атакуют только героев. Их базовый урон равен 30% от базового урона вашего героя. Их дальность атаки равна дальности атаки вашего героя.",
      "spellName": "Burning Army",
      "params": [
        "Анимация применения: 0+0,67",
        "Дальность применения: 1200",
        "Дальность появления: 1300",
        "Число лучников: 5",
        "Интервал появления: 0,5",
        "Атак героев до уничтожения: 2",
        "Атак не-героев до уничтожения: 8",
        "Интервал между атаками лучников: 1,6",
        "Урон лучников: 30%",
        "Длительность: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Death_Pact.mp3\/revision\/latest?cb=20141205103613",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских существ \/ Союзных существ",
        "Урон Чистый Отнимающий здоровье"
      ],
      "notes": [
        "Не раскрывает невидимость от Skeleton Walk.",
        "Несмотря на описание, дополнительное здоровье и урон основаны на максимальном здоровье выбранного юнита, а не на текущем.",
        "Выбранное существо мгновенно умирает, засчитываясь как обычное убийство или добивание.",
        "Увеличивает максимальное здоровье Clinkz без сохранения процента текущего здоровья, затем излечивает Clinkz на полученное значение.",
        "Когда эффект от Death Pact истекает, то максимальный запас здоровья Clinkz возвращается к обычному, а его текущее здоровье сохраняется без превышения значения максимального.",
        "Урон напрямую добавляется к базовому урону Clinkz, поэтому на него действует вампиризм, критический удар, уменьшение (TagTalent Enfeeble) и усиление (TagTalent Empower) урона.",
        "Несколько применений Death Pact не складываются, но обновляют длительность и значения. Выбор таланта на увеличение здоровья и урона не обновит текущий эффект.",
        "Выбор таланта на увеличение здоровья и урона не обновит текущий эффект.",
        "Нельзя применить к древним крипам и крипам-героям.",
        "Можно применить к союзным крипам."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "80\/70\/60",
      "description": "Герой поглощает существо или скелета, от чего получает бонус к здоровью и урону.",
      "spellName": "Death Pact",
      "params": [
        "Анимация применения: 0,2+0,47",
        "Дальность применения: 900",
        "Текущее здоровье цели как бонус к здоровью: 40%\/70%\/100% (TagTalent 90%\/120%\/150%)",
        "Текущее здоровье цели как бонус к урону: 4%\/8%\/12% (TagTalent 9%\/13%\/17%)",
        "Длительность: 65",
        "Дарует новую способность: Burning Army."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 16.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.7,
    "attrAgility": 22.0
  },
  "description": "Clinkz — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Burning Barrage, выпускает залп стрел, каждая из которых может нанести урон нескольким противникиам сразу. Вторая способность, Searing Arrows, позволяет наносить дополнительный урон при атаках. Третья способность, Skeleton Walk, позволяет герою уходить в невидимость, при этом увеличивая его скорость передвижения. Ультимативная способность Death Pact пожирает душу союзного или вражеского крипа, увеличивая свои максимальное здоровье и урон в процентном соотношении от текущего здоровья жертвы.",
  "history": "У подножия Кровоточащих холмов раскинулся гигантский лес — место под названием Ховен, где темные заводи вбирают в себя смолистую кровь гор и где правит великодушный король-маг Сазерекс. Когда-то верный защитник земель Ховена, Clinkz, заслужил себе репутацию благодаря своему владению луком. На трехсотый год правления короля-мага демон Мараксиформ восстал из шестого ада, чтобы предъявить свои права на лес. В ответ король-маг наложил неразрушимое заклинание: тот, кто убьет демона, будет награжден жизнью без конца. Не подозревающий о заклинании Clinkz вступил в битву, защищая свои земли от пламенной атаки демона. Лучник заставил отступить Мараксиформа назад, к самым вратам шестого ада, где горящая граница заперла обоих в смертельном бою. Почти добитый, демон испустил сноп адского пламени, и тут же Clinkz отправил в полет свою последнюю стрелу. Она поразила демона как раз в тот миг, когда адское пламя излилось по землям, воспламенив темные заводи и сжигая Clinkz заживо. Заклинание мага вступило в силу в самый момент сгорания лучника, сохранив его в этом страшном состоянии и оставляя его созданием из костей и ярости, пойманном в самом процессе смерти и несущим дыхание ада в своем путешествии в вечность.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Две цели Searing Arrows",
      "talentRight": "+50\/5% Здоровья\/Урона за Death Pact"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+3 к числу стрел у Burning Barrage",
      "talentRight": "+125 к дальности атаки"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к урону от Searing Arrows",
      "talentRight": "−5 сек. перезарядки Skeleton Walk"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1,75 маны в секунду",
      "talentRight": "+12% к сопротивлению магии"
    }
  ]
}