{
  "abilities": [
    {
      "notes": [
        "Талант на дальность атаки также влияет на дальность применения Searing Arrows.",
        "Талант на ловкость в общем даёт Clinkz: 1,33 брони, 8 скорости атаки и 8 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Несколько целей Searing Arrows",
          "talentRight": "+50\/5% Здоровья\/Урона за Death Pact"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-10 сек. перезарядки Strafe",
          "talentRight": "+125 к дальности атаки"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к урону от Searing Arrows",
          "talentRight": "-7 сек. перезарядки Skeleton Walk"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1.75 маны в секунду",
          "talentRight": "+8 к ловкости"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d4\/Strafe.mp3\/revision\/latest?cb=20140424025306",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Strafe не прерывает произносимые способности Clinkz. Не раскрывает невидимость от Skeleton Walk.",
        "Не отменяет запуск атак врага. Их избегание происходит при достижении снарядами самого Clinkz. То есть, если действие Strafe истекает до попадания уже запущенного снаряда, то Clinkz его не избежит и снаряд подействует на него.",
        "То есть, если действие Strafe истекает до попадания уже запущенного снаряда, то Clinkz его не избежит и снаряд подействует на него.",
        "Не позволяет избегать снаряды от союзников. Это также относится к вражеским снарядам, отскочивших от союзников на Clinkz.",
        "У избегания приоритет выше, чем у уклонения, поэтому оно не срабатывает на атаки, полученные под действием Strafe.",
        "Несколько использований Strafe не складываются, но обновляют длительность и делают скорость атаки равной текущему уровню способности."
      ],
      "mana": "70",
      "hotKey": "Q",
      "cooldown": "34\/30\/26\/22 (TagTalent 24\/20\/16\/12)",
      "description": "Герой ведёт заградительный огонь, ненадолго, но значительно увеличивая свою скорость атаки. Также позволяет герою уклониться от атак дальнего боя.",
      "spellName": "Strafe",
      "params": [
        "Анимация применения: 0+0",
        "Дополнительная скорость атаки: 90\/120\/150\/180",
        "Длительность: 3\/4\/5\/6",
        "Уклонение: 100%"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Трудно сказать, вызвано ли мерцание вокруг костяного лучника теплом его раскаленного сердца или скоростью, с которой он достает стрелы из колчана."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/97\/Searing_Arrows.mp3\/revision\/latest?cb=20150211001437",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Дополнительный урон наносится отдельным источником и считается за урон заклинаний. То есть на урон не влияет и его не учитывают эффекты, взаимодействующие с уроном от атаки. Также на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на урон не влияет и его не учитывают эффекты, взаимодействующие с уроном от атаки.",
        "Также на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "Можно использовать на постройки, но не на варды и союзных существ.",
        "Выбор таланта на дополнительный урон мгновенно улучшит все летящие Searing Arrows Clinkz.",
        "При выборе таланта на 25-ом уровне при использовании способности также выбирается другая случайная цель в радиусе дальности применения для второй Searing Arrow. Позволяет Clinkz совершить мгновенную атаку по выбранной цели с каждым запуском Searing Arrow. На атаку может сработать любой модификатор атаки или эффект, срабатывающий при атаке. Поскольку способность использует свою дальности применения, эффекты, влияющие на дальность, также влияют на дальность второй стрелы. У второй стрелы нет приоритета для целей. Она выбирает случайную подходящую цель в пределах дальности применения. Поскольку Searing Arrows действует на строения, то вторая стрела также считает строения за цели.",
        "Позволяет Clinkz совершить мгновенную атаку по выбранной цели с каждым запуском Searing Arrow.",
        "На атаку может сработать любой модификатор атаки или эффект, срабатывающий при атаке.",
        "Поскольку способность использует свою дальности применения, эффекты, влияющие на дальность, также влияют на дальность второй стрелы.",
        "У второй стрелы нет приоритета для целей. Она выбирает случайную подходящую цель в пределах дальности применения.",
        "Поскольку Searing Arrows действует на строения, то вторая стрела также считает строения за цели."
      ],
      "mana": "6\/8\/10\/12",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Наполняет стрелы Clinkz огнем, позволяя наносить дополнительный урон.",
      "spellName": "Searing Arrows",
      "params": [
        "Дальность применения: 625 (TagTalent 750)",
        "Урон: 24\/36\/48\/60 (TagTalent 54\/66\/78\/90)",
        "Количество стрел: 1 (TagTalent 2)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Clinkz поджигает стрелы своей огненной сущностью, что придает им поистине разрушительную мощь."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Skeleton_Walk.mp3\/revision\/latest?cb=20141125112530",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Skeleton Walk не прерывает произносимые способности Clinkz.",
        "Пока проходит время до невидимости, Clinkz может использовать заклинания, предметы и совершать атаки без выхода из невидимости.",
        "Невидимость спадает при достижении точки применения способностью или предметом или при попадании атаки по цели.",
        "Позволяет Clinkz проходить сквозь других существ, включая варды, но исключая постройки.",
        "Clinkz может поднимать или выкидывать предметы без выхода из невидимости.",
        "При выборе правого таланта на 10 уровне в 250 единицах слева от Clinkz появлется лучник, смотрящий в ту же сторону. Лучник появляется только при потере баффа Skeleton Walk любым способом. Призывается тот же лучник, что используются способностью Burning Army от . Ниже указаны их характеристики.",
        "Лучник появляется только при потере баффа Skeleton Walk любым способом.",
        "Призывается тот же лучник, что используются способностью Burning Army от . Ниже указаны их характеристики."
      ],
      "mana": "75",
      "hotKey": "E",
      "cooldown": "20\/19\/18\/17 (TagTalent 13\/12\/11\/10)",
      "description": "Clinkz незаметно передвигается сквозь юнитов, пока не нанесет удар.",
      "spellName": "Skeleton Walk",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0,6",
        "Доп. скорость передвижения: 15%\/30%\/45%\/60%",
        "Длительность невидимости: 25\/30\/35\/40",
        "Число лучников: 2",
        "Время жизни лучников: 45",
        "При выходе из невидимости создаёт рядом с героем двух скелетов от способности Burning Army. Увеличивает дополнительную скорость передвижения на 30% и позволяет превысить максимум скорости."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Вспышка огня, клубы дыма — и костяного лучника не видать."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Clinkz_Burning_Army.mp3\/revision\/latest?cb=20210424153341",
      "effects": [
        "Способность Направленная на точку \/ Направленная по вектору",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Для разблокировки требуется Aghanim's Scepter. Может быть разблокирована в Ability Draft если у игрока есть Death Pact.",
        "Может быть разблокирована в Ability Draft если у игрока есть Death Pact.",
        "Burning Army можно использовать без поворота в сторону выбранной области.",
        "Сразу после применения призывает лучников в линию одним за другим. Для появления всех лучников требуется 2 секунды.",
        "Для появления всех лучников требуется 2 секунды.",
        "Первый лучник появляется в начальной выбранной области. Следующие появляются на расстоянии 312,5 единиц друг от друга. Существа смотрят в ту же сторону, что и Clinkz в момент их появления.",
        "Существа смотрят в ту же сторону, что и Clinkz в момент их появления.",
        "Призванных лучников нельзя контролировать. Они автоматически атакуют ближайших вражеских героев вне зависимости от настроек автоатаки. При этом у них возможно отключить автоприменение Searing Arrows.",
        "При этом у них возможно отключить автоприменение Searing Arrows.",
        "Урон от атаки лучников периодически приравнивается к общему урону Clinkz То есть также учитывается дополнительный урон.",
        "То есть также учитывается дополнительный урон.",
        "Дальность атаки лучников периодически приравнивается к дальности атаки Clinkz.",
        "Лучники атакуют только героев, включая иллюзии и клонов, но исключая крипов-героев. Они используют стандартные правила автоатаки. Но при этом меняют цель только в случае, если их текущую цель больше нельзя атаковать.",
        "Они используют стандартные правила автоатаки. Но при этом меняют цель только в случае, если их текущую цель больше нельзя атаковать.",
        "Лучники используют Searing Arrows, того же уровня, что и Clinkz. Уровень фиксируется в момент появления. Поднятие уровня Searing Arrows после призыва не улучшит способность лучников. Хоть способность и идентична Searing Arrows Clinkz, но для использования лучникам не нужна мана. Существа также используют талант на урон и на дополнительные цели Searing Arrows.",
        "Уровень фиксируется в момент появления. Поднятие уровня Searing Arrows после призыва не улучшит способность лучников.",
        "Хоть способность и идентична Searing Arrows Clinkz, но для использования лучникам не нужна мана.",
        "Существа также используют талант на урон и на дополнительные цели Searing Arrows.",
        "Лучники не блокируют лагеря нейтральных крипов.",
        "Урон лучников не уменьшается блокировкой урона."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "80",
      "description": "Герой призывает армию огненных скелетов-лучников. Лучники неподвижны и умирают от 2 aтак героев. Скелеты используют способность Searing Arrows текущего уровня и атакуют только героев. Их базовый урон равен 30% от базового урона вашего героя. Их дальность атаки равна дальности атаки вашего героя.",
      "spellName": "Burning Army",
      "params": [
        "Анимация применения: 0+0,67",
        "Дальность применения: 1200",
        "Дальность появления: 1300",
        "Число лучников: 5",
        "Интервал появления: 0,5",
        "Атак героев до уничтожения: 2",
        "Атак не-героев до уничтожения: 8",
        "Интервал между атаками лучников: 1,6",
        "Урон лучников: 30%",
        "Длительность: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Связь жизни и смерти стала частью Clinkz, и теперь его старые кости требуют принести в жертву низших существ."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Death_Pact.mp3\/revision\/latest?cb=20141205103613",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских существ \/ Союзных существ",
        "Урон Чистый Отнимающий здоровье"
      ],
      "notes": [
        "Выбранное существо мгновенно умирает, засчитываясь как обычное убийство или добивание.",
        "Дополнительное здоровье и урон основаны на текущем здоровье выбранного юнита.",
        "Не раскрывает невидимость от Skeleton Walk.",
        "Урон напрямую добавляется к базовому урону Clinkz, поэтому на него действует вампиризм, критический удар, уменьшение (TagTalent Enfeeble) и усиление (TagTalent Empower) урона.",
        "Увеличивает текущий и максимальный запас здоровья Clinkz, излечивая его на полученное значение.",
        "Когда бафф от Death Pact истекает, то максимальный запас здоровья Clinkz возвращается к обычному, но его текущее соотношение здоровья сохраняется без превышения значения максимального.",
        "Несколько применений Death Pact не складываются, но обновляют длительность и значения, получаемые от текущего уровня способности и текущего здоровья цели.",
        "Нельзя применить к древним крипам и крипам-героям.",
        "Можно применить к союзным крипам."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "80\/70\/60",
      "description": "Герой поглощает существо или скелета, от чего получает бонус к здоровью и урону.",
      "spellName": "Death Pact",
      "params": [
        "Анимация применения: 0,5+0,3",
        "Дальность применения: 400",
        "Текущее здоровье цели как бонус к здоровью: 40%\/70%\/100% (TagTalent 90%\/120%\/150%)",
        "Текущее здоровье цели как бонус к урону: 4%\/9%\/14% (TagTalent 9%\/14%\/19%)",
        "Длительность: 65"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Связь жизни и смерти стала частью лучника, и теперь его старые кости наполняет жизнь каждого принесённого в жертву низшего существа."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 16.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.7,
    "attrAgility": 22.0
  },
  "description": "Clinkz — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Strafe, значительно увеличивает скорость атаки на короткое время, а также даёт возможность уклониться от любого направленного снаряда. Вторая способность, Searing Arrows, позволяет наносить дополнительный урон при атаках. Третья способность, Skeleton Walk, позволяет герою уходить в невидимость, при этом увеличивая его скорость передвижения. Ультимативная способность Death Pact пожирает душу союзного или вражеского крипа, увеличивая свои максимальное здоровье и урон в процентном соотношении от текущего здоровья жертвы.",
  "history": "У подножия Кровоточащих холмов раскинулся гигантский лес — место под названием Ховен, где темные заводи вбирают в себя смолистую кровь гор и где правит великодушный король-маг Сазерекс. Когда-то верный защитник земель Ховена, Clinkz, заслужил себе репутацию благодаря своему владению луком. На трехсотый год правления короля-мага демон Мараксиформ восстал из шестого ада, чтобы предъявить свои права на лес. В ответ король-маг наложил неразрушимое заклинание: тот, кто убьет демона, будет награжден жизнью без конца. Не подозревающий о заклинании Clinkz вступил в битву, защищая свои земли от пламенной атаки демона. Лучник заставил отступить Мараксиформа назад, к самым вратам шестого ада, где горящая граница заперла обоих в смертельном бою. Почти добитый, демон испустил сноп адского пламени, и тут же Clinkz отправил в полет свою последнюю стрелу. Она поразила демона как раз в тот миг, когда адское пламя излилось по землям, воспламенив темные заводи и сжигая Clinkz заживо. Заклинание мага вступило в силу в самый момент сгорания лучника, сохранив его в этом страшном состоянии и оставляя его созданием из костей и ярости, пойманном в самом процессе смерти и несущим дыхание ада в своем путешествии в вечность.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Несколько целей Searing Arrows",
      "talentRight": "+50\/5% Здоровья\/Урона за Death Pact"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-10 сек. перезарядки Strafe",
      "talentRight": "+125 к дальности атаки"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к урону от Searing Arrows",
      "talentRight": "-7 сек. перезарядки Skeleton Walk"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1.75 маны в секунду",
      "talentRight": "+8 к ловкости"
    }
  ]
}