{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The agility talent effectively grants Hoodwink 2.67 armor, 16 attack speed, and 16 attack damage.",
        "Armor Corruption from talents is not disabled by Break. The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes.",
        "The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Sharpshooter Pure Damage and Pierces Spell Immunity",
          "talentRight": "2 Acorn Shot Charges"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-3 Armor Corruption",
          "talentRight": "25% Sharpshooter Faster Projectile \/ Charge Time"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+16 Agility",
          "talentRight": "Scurry Camouflage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-4s Bushwhack Cooldown",
          "talentRight": "+200 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a0\/Hoodwink_Acorn_Shot_1.mp3\/revision\/latest?cb=20201219182025",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "The cast range of Acorn Shot is based on the attack range of the caster. Together with the ability's own bonus, Acorn Shot effectively has a cast range of 1100 on Hoodwink. The cast range can be further increased by other attack range bonuses, and is also affected by cast range bonuses.",
        "Together with the ability's own bonus, Acorn Shot effectively has a cast range of 1100 on Hoodwink.",
        "The cast range can be further increased by other attack range bonuses, and is also affected by cast range bonuses.",
        "When targeting the ground, a tree gets planted upon reaching that point. Planted trees have a smaller collision size and block less vision than regular trees. Unlike with other planted trees, Tango does not heal for twice as long when targeting a Acorn Shot tree. The planted tree provides 200 radius ground vision around itself, that lasts for 20 seconds or until the tree is destroyed. When put on Autocast, it can only target the ground.",
        "Unlike with other planted trees, Tango does not heal for twice as long when targeting a Acorn Shot tree.",
        "The planted tree provides 200 radius ground vision around itself, that lasts for 20 seconds or until the tree is destroyed.",
        "When put on Autocast, it can only target the ground.",
        "When targeting a unit, the initial hit is not counted towards the bounce limit, so that up to 3\/4\/5\/6 hits can be achieved.",
        "The projectile speed is based on the attack projectile speed of the caster. Initially, the projectile's speed matches the caster's projectile speed, but is halved on the bounces. Has an initial projectile speed of 1800 and a bounce speed of 900 on Hoodwink. The projectile speed can be further increased by other attack projectile speed bonuses.",
        "Initially, the projectile's speed matches the caster's projectile speed, but is halved on the bounces.",
        "Has an initial projectile speed of 1800 and a bounce speed of 900 on Hoodwink.",
        "The projectile speed can be further increased by other attack projectile speed bonuses.",
        "The projectile bounces in 0.1-second intervals.",
        "Can bounce on the same unit multiple times, but only when another target was hit between the bounces. Cannot bounce on invisible, invulnerable or hidden units, but can bounce on units in the Fog of War.",
        "Cannot bounce on invisible, invulnerable or hidden units, but can bounce on units in the Fog of War.",
        "Causes Hoodwink perform an instant attack on the enemies upon projectile hit. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "The slow is independent from the instant attack, and is placed even when the instant attack misses.",
        "The projectile first performs the instant attack, and then applies the debuff.",
        "The projectile provides 200 radius flying vision around itself as it travels. This vision does not last."
      ],
      "mana": "75\/85\/95\/105",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10 (TagTalent 0)",
      "description": "Fires Hoodwink's attack with an acorn at the target unit. The acorn bounces to nearby targets, slowing them and dealing bonus damage. If point targeted, a tree is created at the target position and the acorn will bounce to nearby targets.",
      "spellName": "Acorn Shot",
      "params": [
        "Cast Animation: 0.2+1.37",
        "Bounce Distance: 525",
        "Attack Range Bonus: 125\/200\/275\/350",
        "Instant Attack Damage Bonus: 50\/75\/100\/125",
        "Instant Attack Damage: 75%",
        "Number of Bounces: 2\/3\/4\/5",
        "Move Speed Slow: 100%",
        "Slow Duration: 0.25",
        "Tree Duration: 20",
        "Number of Charges: 2",
        "Charge Replenish Time: 16\/14\/12\/10",
        "Can target spell immune enemies. Instant attack pierces spell immunity. Slow does not pierce spell immunity.",
        "Blocked fully only when primary target. Not blocked when ground-targeted or as secondary target.",
        "When directly targeted, disjointing makes it place a tree instead, and continue bouncing from there. As a secondary target, disjointing stops the bouncing as well."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Though she'll make do with almost anything, Oak and Ironwood acorns make the most effective projectiles -- and the bulk of Hoodwink's stash."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Hoodwink_Bushwhack_1.mp3\/revision\/latest?cb=20201219182032",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1200.",
        "With the maximum cast range and radius, Bushwhack can hit units up to 1265 range away.",
        "If there are no trees within the area, nothing happens.",
        "Hit enemies are stunned and moved towards the tree closest to the center of the targeted point. However, if there is another tree in the way, the unit is bound to that tree instead. Moves units towards the tree at a speed of 1000. Exposes hit enemies for the debuff duration, revealing their exact location.",
        "However, if there is another tree in the way, the unit is bound to that tree instead.",
        "Moves units towards the tree at a speed of 1000.",
        "Exposes hit enemies for the debuff duration, revealing their exact location.",
        "Bound units can be freed by destroying the tree they are bound to. Bound units are also freed when any form of Forced Movement is applied on them. If Bushwhack binds a unit to a planted tree with an expiration timer, that planted tree cannot expire until Bushwhack ends.",
        "Bound units are also freed when any form of Forced Movement is applied on them.",
        "If Bushwhack binds a unit to a planted tree with an expiration timer, that planted tree cannot expire until Bushwhack ends.",
        "Provides 265 radius flying vision at the target location upon reaching it, lasting for 1.5\/1.8\/2.1\/2.4 seconds.",
        "Affects units inside the Fog of War, but not invisible units."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "14 (TagTalent 10)",
      "description": "Tosses a net trap that stuns enemy heroes if they are near a tree in the area. Affected enemies take damage and are pulled towards the tree nearest to them, and have their vision reduced to 0 for the duration of the stun.",
      "spellName": "Bushwhack",
      "params": [
        "Cast Animation: 0.2+1.07",
        "Cast Range: 1000",
        "Radius: 265",
        "Damage: 75\/150\/225\/300",
        "Stun Duration: 1.5\/1.8\/2.1\/2.4"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Hoodwink favors Ironwood groves for ambushes, but the wary step carefully in all areas of the mistwoods."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Hoodwink_Scurry_1.mp3\/revision\/latest?cb=20201219182019",
      "effects": [
        "Ability No Target \/ Passive",
        "Affects Self"
      ],
      "notes": [
        "Hoodwink gets all 2 charges immediately upon learning Scurry.",
        "Interrupts Hoodwink's channeling abilities upon cast.",
        "Grants phased movement and tree-walking to Hoodwink.",
        "Scurry's evasion stacks diminishingly with other sources of evasion and uses pseudo-random distribution.",
        "The passive modifier is hidden by default, and turns visible when near a tree.",
        "The passive evasion and the active component are independent from each other. The evasion is always present even when Scurry is not castable.",
        "The evasion is always present even when Scurry is not castable.",
        "The Scurry Camouflage talent turns Hoodwink invisible and phased when standing still within 275 range of a tree for 1.2 seconds. The invisibility is broken upon reaching the cast point of abilities or items, or upon launching an attack. Other orders do not break it. The invisibility is also lost upon position changes. This means Forced Movement breaks it as well. This also means that when given move orders (M), the invisibility is not broken while turning, but breaks when the actual moving starts.",
        "The invisibility is broken upon reaching the cast point of abilities or items, or upon launching an attack. Other orders do not break it.",
        "The invisibility is also lost upon position changes. This means Forced Movement breaks it as well.",
        "This also means that when given move orders (M), the invisibility is not broken while turning, but breaks when the actual moving starts."
      ],
      "mana": "35",
      "hotKey": "E",
      "cooldown": "0",
      "description": "Hoodwink passively has a chance to evade physical attacks while near trees. When activated, Hoodwink gains bonus movement speed, phased collision, and tree-walking for a brief time.",
      "spellName": "Scurry",
      "params": [
        "Cast Animation: 0+0",
        "Passive Tree Search Radius: 275",
        "Passive Evasion: 8%\/16%\/24%\/32%",
        "Active Move Speed Bonus: 20%\/25%\/30%\/35%",
        "Active Duration: 4",
        "Number of Charges: 2",
        "Charge Replenish Time: 30\/24\/18\/12",
        "Passive Invisibility Fade Delay: 1.2",
        "The passive evasion as well as the invisibility from the talent are disabled by Break.",
        "Passive evasion, as well as the invisibility from the talent work for illusions."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "There's not a nook or cranny in the Wood Tomo'kan out of reach of Hoodwink's paws."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bd\/Hoodwink_Decoy_1.mp3\/revision\/latest?cb=20210410154146",
      "effects": [
        "Ability Target Point",
        "Affects Enemies"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked. In Ability Draft, Decoy can be unlocked by the player that drafted Sharpshooter.",
        "In Ability Draft, Decoy can be unlocked by the player that drafted Sharpshooter.",
        "↓↓ Double-tapping automatically targets the cursor's current location. Ignores the HUD, so cannot be cast through the minimap this way.",
        "Decoy can be cast without having to face towards the targeted point.",
        "Does not interrupt Hoodwink's channeling abilities or any other current order upon cast.",
        "The illusion automatically walks to the targeted point once created.",
        "The illusion spawns with the Scurry buff based on its current level. If Scurry is not learned, the buff is still placed, but without any values. This means it does not grant the movement speed bonus, but still grants the phased movement and tree-walking.",
        "If Scurry is not learned, the buff is still placed, but without any values.",
        "This means it does not grant the movement speed bonus, but still grants the phased movement and tree-walking.",
        "The tree and area stun are only applied when the illusion gets triggered. They are not applied if the illusion is destroyed in other ways or it expires. It gets triggered when an enemy hero (including illusions, clones, and creep-heroes) lands an attack on it. Missed attacks do not count. It gets also triggered when it gets targeted by an ability, following the rules of Spell Block.",
        "It gets triggered when an enemy hero (including illusions, clones, and creep-heroes) lands an attack on it. Missed attacks do not count.",
        "It gets also triggered when it gets targeted by an ability, following the rules of Spell Block.",
        "When triggered, the illusion is instantly destroyed and it is not credited to anyone. Creates a regular planted tree at its location when triggered. This tree is smaller than the other trees on the map and has a smaller collision size. Tango heals for twice as long when targeting a Decoy tree. Although using Bushwhack's modifier, the area stun is completely independent from the ability. This means, in Ability Draft, Bushwhack is not required for the the stun to be applied, it works regardless.",
        "Creates a regular planted tree at its location when triggered. This tree is smaller than the other trees on the map and has a smaller collision size.",
        "Tango heals for twice as long when targeting a Decoy tree.",
        "Although using Bushwhack's modifier, the area stun is completely independent from the ability.",
        "This means, in Ability Draft, Bushwhack is not required for the the stun to be applied, it works regardless."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "60",
      "description": "Hoodwink sends a decoy illusion to the target location. When the illusion is attacked or hit by a targeted ability, it is destroyed and plants a tree in its place that applies a lesser Bushwhack to enemy heroes around it.",
      "spellName": "Decoy",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: Global",
        "Number of Illusions: 1",
        "Illusion Damage Dealt: 0%",
        "Illusion Damage Taken: 200%",
        "Illusion Duration: 12",
        "Stun Radius: 250",
        "Stun Duration: 1",
        "Tree Duration: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Hoodwink_Hunter%27s_Boomerang_1.mp3\/revision\/latest?cb=20210410154149",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. In Ability Draft, Hunter's Boomerang can be unlocked by the player that drafted Sharpshooter.",
        "In Ability Draft, Hunter's Boomerang can be unlocked by the player that drafted Sharpshooter.",
        "Can be cast on an unit, including allies, excluding self, buildings and wards. Targeting allies sends the boomerang towards them, but does not affect them.",
        "Targeting allies sends the boomerang towards them, but does not affect them.",
        "The boomerang either travel at a speed of 900 or reaches the target unit between 0.5 and 1.2 seconds, whichever is faster. The same applies upon returning. This means the boomerang can fly for a minimum of 1 second and a maximum of 2.4 seconds. The duration is set once upon cast, based on the distances. If the distances change after cast, the speed adapts to the predetermined duration. For example, if the target was within 450 range upon cast, the boomerang will have fully returned within 1 second. If the target was more than 1080 range away, it will have fully returned within 2.4 seconds.",
        "This means the boomerang can fly for a minimum of 1 second and a maximum of 2.4 seconds.",
        "The duration is set once upon cast, based on the distances. If the distances change after cast, the speed adapts to the predetermined duration. For example, if the target was within 450 range upon cast, the boomerang will have fully returned within 1 second. If the target was more than 1080 range away, it will have fully returned within 2.4 seconds.",
        "For example, if the target was within 450 range upon cast, the boomerang will have fully returned within 1 second.",
        "If the target was more than 1080 range away, it will have fully returned within 2.4 seconds.",
        "The boomerang is always thrown from Hoodwink's right side and returns from the opposite side. It flies towards the target arcing to the right side and returns to Hoodwink in a mirrored arc. Both arcs have a combined width of 400. Its minimum travel distance is 400 as well, so when targeting a point closer than 400 range, it flies in a triangular pattern with side lengths of 400.",
        "It flies towards the target arcing to the right side and returns to Hoodwink in a mirrored arc.",
        "Both arcs have a combined width of 400.",
        "Its minimum travel distance is 400 as well, so when targeting a point closer than 400 range, it flies in a triangular pattern with side lengths of 400.",
        "The boomerang first applies the debuff, then the damage.",
        "The primary target is damaged and debuffed when getting within its radius like any other unit. However, the boomerang only starts returning once fully reaching the target and not sooner.",
        "However, the boomerang only starts returning once fully reaching the target and not sooner.",
        "Applies generic incoming damage amplification on the targets. Stacks additively with other sources of generic incoming damage manipulation. The amplification affects only spell damage the target takes that is not flagged as HP removal. Attack damage is not amplified. Since it uses incoming amplification, it does affect the damage of abilities that ignore outgoing amplification, like Damage Return and Moon Glaives.",
        "The amplification affects only spell damage the target takes that is not flagged as HP removal. Attack damage is not amplified.",
        "Since it uses incoming amplification, it does affect the damage of abilities that ignore outgoing amplification, like Damage Return and Moon Glaives."
      ],
      "mana": "125",
      "hotKey": "F",
      "cooldown": "18",
      "description": "Tosses a boomerang at the target enemy in an arc. Upon contact, it returns to Hoodwink. The boomerang will deal damage as it passes through or hits enemies, and apply a Hunter's Mark that causes affected enemies to be slowed and be more vulnerable to spell damage and have reduced status resistance.",
      "spellName": "Hunter's Boomerang",
      "params": [
        "Cast Animation: 0.2+1.07",
        "Cast Range: 1000",
        "Boomerang Radius: 150",
        "Boomerang Arc Distance: 400",
        "Damage: 350",
        "Move Speed Slow: 20%",
        "Incoming Spell Damage Amplification: 25%",
        "Status Resistance Reduction: 25%",
        "Debuff Duration: 7",
        "Blocked fully only when primary target. Blocked upon impact. When blocked, the boomerang does not return.",
        "When disjointed, the boomerang returns once reaching the target's last location before disjointing it."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Hoodwink_Sharpshooter_1.mp3\/revision\/latest?cb=20201219182022",
      "effects": [
        "Ability Target Point",
        "Affects Enemy Heroes",
        "Damage Magical (TagAghanim Pure)"
      ],
      "notes": [
        "For better readability, the turn rate during the Sharpshooter is given as degrees per second, instead of radians per 0.03 seconds. 60° per second equal a turn rate of 0.031.",
        "60° per second equal a turn rate of 0.031.",
        "A timer above Hoodwink's head shows how much time is left before the bolt releases. This timer is visible to everyone.",
        "The direction can be changed with a move order (TagTalent Right Click or M). A line indicator is cast in front of Hoodwink while aiming the shot, showing the path it will take once released. The indicator also shows for how long it is being charged, starting out green, slowly turning red over 5 seconds. The indicator is visible to the player only. Neither allies nor enemies can see it.",
        "A line indicator is cast in front of Hoodwink while aiming the shot, showing the path it will take once released.",
        "The indicator also shows for how long it is being charged, starting out green, slowly turning red over 5 seconds.",
        "The indicator is visible to the player only. Neither allies nor enemies can see it.",
        "Hoodwink can still perform other actions during Sharpshooter. Non-targeted abilities and items are used normally. However, targeted items that require facing can only be cast when targeted within her current facing direction. Targeting outside her facing direction causes her to get locked in position until the stop (S) or hold command are used.",
        "However, targeted items that require facing can only be cast when targeted within her current facing direction.",
        "Targeting outside her facing direction causes her to get locked in position until the stop (S) or hold command are used.",
        "Hoodwink is disarmed during Sharpshooter. Attack orders behave like move orders during disarms, and it sets a new location as well.",
        "Sharpshooter can only be canceled by End Sharpshooter, casting Town Portal Scroll, or by dying. It cannot be interrupted by disables.",
        "Once released, Hoodwink gets knocked back in an arc with a height of 75 and distance of up to 350 over up to 0.4 seconds, or until touching the ground again. This means the knockback distance and duration can be reduced\/increased by jumping up\/down a cliff or a ramp.",
        "This means the knockback distance and duration can be reduced\/increased by jumping up\/down a cliff or a ramp.",
        "The damage starts at 110\/180\/250 and increases by 14.67\/24\/33.33 (TagTalent 19.56\/32\/44.44) for each 0.1 seconds charged, reaching the full damage in 3 seconds.",
        "The debuff duration starts at 1 and increases by 0.13 (TagTalent 0.18) for each 0.1 seconds charged, reaching the full duration in 3 seconds. The debuff applies Break on the target, disabling their passive abilities.",
        "The debuff applies Break on the target, disabling their passive abilities.",
        "The bolt travels at a speed of 2200 (TagTalent 2750), and travels for the full distance, or until hitting a valid target.",
        "The bolt starts on Hoodwink's position. It can hit units up to 3125 range away. It does not search for units behind the starting location.",
        "Can only hit heroes, including clones, excluding illusions and creep-heroes. Does not hit, invulnerable, or hidden units, flying right through them.",
        "The bolt first applies the debuff, and then the damage.",
        "The bolt provides 350 radius flying vision as it travel. This vision does not linger.",
        "The cast backswing starts the moment the cast begins, so the effective backswing depends on when the shot was released. This means the backswing can range from 4.5 to 9.5 seconds.",
        "This means the backswing can range from 4.5 to 9.5 seconds."
      ],
      "mana": "125\/175\/225",
      "hotKey": "R",
      "cooldown": "45",
      "description": "Hoodwink charges up and fires a deadly bolt from her crossbow, dealing heavy damage and slow to an enemy Hero. The damage and debuff duration scale up to max after 3 seconds, and the bolt is fired automatically after 5 seconds. Hoodwink is knocked backwards for a distance of 350 from the force of the shot.",
      "spellName": "Sharpshooter",
      "params": [
        "Cast Animation: 0+9.5",
        "Cast Range: 3000",
        "Max Travel Distance: 3000",
        "Bolt Collision Radius: 125",
        "Turn Rate in Degrees per Second: 60°",
        "Max Charge Time: 3 (TagTalent 2.25)",
        "Max Aim Time: 5",
        "Self Knockback Distance: 350",
        "Starting Power: 20%",
        "Max Damage: 550\/900\/1250",
        "Move Speed Slow: 30%\/40%\/50%",
        "Max Slow Duration: 5",
        "Self Knockback Duration: 0.4",
        "Grants a new ability: Hunter's Boomerang.",
        "Grants a new ability: Decoy.",
        "Does not collide with spell immune units. Fully pierces spell immunity."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "While her first arbalest was a chance discovery, Hoodwink now takes great care in carving and caring for her own -- of course with some necessary components pilfered or otherwise cleverly procured."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Sharpshooter until the bolt is released.",
        "Interrupts Hoodwink's channeling abilities upon cast."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "0",
      "description": "Release the charged shot, regain ability to move and attack.",
      "spellName": "End Sharpshooter",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Fire!"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 17.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 3.6,
    "attrAgility": 24.0
  },
  "description": "Hoodwink is a tricky ranged agility hero who runs wild through the trees of the Mistwoods. Firing Acorn Shots from her arbalest, she creates new forests through which to Scurry. For her foes, the woods are a dangerous place, full of Bushwhack traps and vantage points for the Sharpshooter to aim the ultimate crossbow shot. This crafty critter should never be underestimated.",
  "history": "Hoodwink's earliest years were spent in the idyllic expanse of green that once filled the edges of Krimwohl. But as that kingdom grew, and the needs of both her citizens and her armies became ravenous, rival ore and timber barons scratched and clawed to outpace each other in devouring the natural beauty of the border forests, gorging themselves to meet the demands of the changing land. To those living in the ancient timberlands, the choice came down to following the line of refugees into the pacified zones, falling to Krimwohl's black powder and steel while defending their homes, or fleeing further north to tempt fate in the haunted glens and groves of the misty Wood Tomo'kan. So it was in those treacherous northern mistwoods that Hoodwink came of age, dodging the horrific predators of the Tomo'kan, ingratiating herself with some of the local banditry whilst antagonizing others, and finding absolutely every which way to be underfoot whenever some interesting mischief arose--often allegedly the cause of it. But when the faintest whiff of Krimwohl's fires eventually drifted into her adopted home, Hoodwink's thoughts turned to any family and friends who might have survived the invasion--now made to eke out lives in the razed lands whose wounds scarred her very soul--and she couldn't help but approach the edges of civilization to get a glimpse of the devils that had destroyed her old life. There, she saw that the monsters from her childhood weren't monsters at all. They were just...people. Soldiers, laborers, merchants...and refugees. And the soldiers, even with their black powder and steel, were nothing compared to the dangers of the Tomo'kan--real dangers with tentacles and teeth--dangers she danced around like a twirling maple seed. Knowing she can always find safe passage in the tangles of the Tomo'kan, where most warm-blooded folk wisely fear to tread, Hoodwink now strikes out against those who dare try to further pacify the wilds, happily taking what she likes from their belongings, destroying what she has no use for, and helping guide any kindred survivors back to a life in the green once again.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Sharpshooter Pure Damage and Pierces Spell Immunity",
      "talentRight": "2 Acorn Shot Charges"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-3 Armor Corruption",
      "talentRight": "25% Sharpshooter Faster Projectile \/ Charge Time"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+16 Agility",
      "talentRight": "Scurry Camouflage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-4s Bushwhack Cooldown",
      "talentRight": "+200 Health"
    }
  ]
}