{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на уклонение мультипликативно складывается с другими источниками уклонения.",
        "Критический удар от талантов не отключается истощением. Критический удар увеличивает урон от атаки в среднем на 24%. Шанс срабатывания от нескольких источников критического удара складывается. Если одновременно срабатывает несколько источников критического удара, то приоритет будет иметь высший множитель крита.",
        "Критический удар увеличивает урон от атаки в среднем на 24%.",
        "Шанс срабатывания от нескольких источников критического удара складывается. Если одновременно срабатывает несколько источников критического удара, то приоритет будет иметь высший множитель крита."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Шанс в 24% нанести атакой 200% урона",
          "talentRight": "-4 сек. перезарядки Doppelganger"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+5% к урону иллюзий от Juxtapose",
          "talentRight": "+300 к дальности Phantom Rush"
        },
        {
          "talentLvl": "15",
          "talentLeft": "–3 сек. перезарядки Spirit Lance",
          "talentRight": "+16% к уклонению"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости атаки",
          "talentRight": "+150 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/25\/Phantom_Lancer_Spirit_Lance_1.mp3\/revision\/latest?cb=20191216021801",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Spirit Lance летит со скоростью в 1000.",
        "Копье сначала применяет дебафф, а затем наносит урон.",
        "Иллюзия появляется только в случае успешного попадания и нанесения урона или замедления цели.",
        "Иллюзия появляется в 58 единицах от цели в случайном месте.",
        "Иллюзии Phantom Lancer в радиусе 675 единиц от него выпускают фальшивые копья. Они проигрывают ту же анимацию применения и выпускают фальшивые копья одновременно с настоящим снарядом. Если у иллюзиий нет приказов и они спокойно стоят, то они поворачиваются к цели и используют фальшивые копья. Если иллюзии движутся или атакуют, то они продолжают действия и не поворачиваются к цели. У них проиграется анимация использования, перекрывающая их анимации движения или атаки. При отмене применения иллюзии все равно проигрывают полную анимацию применения, но копья не запускают. Фальшивые копья ни с чем не взаимодействуют: не наносят урон, не замедляют и не создают иллюзии.",
        "Они проигрывают ту же анимацию применения и выпускают фальшивые копья одновременно с настоящим снарядом.",
        "Если у иллюзиий нет приказов и они спокойно стоят, то они поворачиваются к цели и используют фальшивые копья.",
        "Если иллюзии движутся или атакуют, то они продолжают действия и не поворачиваются к цели. У них проиграется анимация использования, перекрывающая их анимации движения или атаки.",
        "При отмене применения иллюзии все равно проигрывают полную анимацию применения, но копья не запускают.",
        "Фальшивые копья ни с чем не взаимодействуют: не наносят урон, не замедляют и не создают иллюзии.",
        "Иллюзии, созданные Spirit Lance, дают при убийстве награду: 5 и 5XP; эти значения не меняются с повышением уровней.",
        "С Aghanim's Shard снаряд отскакивает в другое существо в радиусе 750. Не отскакивает в невидимых существ или существ в тумане войны. Не поражает существо дважды за одно применение. Если текущая цель стала неуязвимой или спряталась, то копье от нее не отскочит. Все копья наносят до 200\/320\/440\/560 урона (до уменьшений).",
        "Не отскакивает в невидимых существ или существ в тумане войны.",
        "Не поражает существо дважды за одно применение.",
        "Если текущая цель стала неуязвимой или спряталась, то копье от нее не отскочит.",
        "Все копья наносят до 200\/320\/440\/560 урона (до уменьшений)."
      ],
      "mana": "120",
      "hotKey": "Q",
      "cooldown": "7 (TagTalent 4)",
      "description": "Метает в указанного врага магическое копьё, которое наносит цели урон и замедляет её, а также создает атакующую её союзную иллюзию.",
      "spellName": "Spirit Lance",
      "params": [
        "Анимация применения: 0,3+0,73",
        "Дальность применения: 525\/600\/675\/750",
        "Число целей: 1 (TagTalent 2)",
        "Урон: 100\/160\/220\/280",
        "Замедление скорости передвижения: 10%\/18%\/26%\/34%",
        "Урон иллюзии: 20% (TagTalent 60%)",
        "Урон по иллюзии: 400%",
        "Время жизни иллюзии: 2\/4\/6\/8",
        "Длительность замедления: 3,25",
        "Дальность отскока: 750",
        "Копьё отскакивает в одного врага в радиусе 750 (TagTalentв первую очередь в героев). Увеличивает урон иллюзии от этой способности на 40%.",
        "Замедление остается, если дебафф был применен до невосприимчивости к магии и не был развеян. Также останавливает отскок копья при попадании в существо с невосприимчивостью.",
        "Блокируется при попадании как основной, так и вторичной целью. При блокировке останавливает отскок.",
        "Может избежать как основная, так и вторичная цель. При избегании останавливает отскок."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Когда-то Азраф мастерски рыбачил копьями, чтобы накормить семью. Этот навык очень пригодился ему на поле боя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/57\/Phantom_Lancer_Doppelganger.mp3\/revision\/latest?cb=20191216021754",
      "effects": [
        "Способность Направленная на область",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Doppelganger позволяет избежать снарядов и применяет к Phantom Lancer базовое развеивание.",
        "Phantom Lancer и его иллюзии неуязвимы и спрятаны в момент задержки появления. В момент задержки существа не могут ничего делать. Любой приказ, отданный в этот момент, будет поставлен в очередь.",
        "В момент задержки существа не могут ничего делать. Любой приказ, отданный в этот момент, будет поставлен в очередь.",
        "Phantom Lancer и 2 созданные иллюзии будут смотреть в ту сторону, куда смотрел герой при использовании способности. Остальные собранные иллюзии сохраняют предыдущий градус расположения. Phantom Lancer и его иллюзии располагаются после появления в виде плюса с возможными вариациями. После появления иллюзии продолжат двигаться или атаковать цель, если ранее им были отданы эти приказы. Разрушает деревья в радиусе 200 единиц вокруг Phantom Lancer и каждой задействованной иллюзии при их появлении.",
        "Остальные собранные иллюзии сохраняют предыдущий градус расположения.",
        "Phantom Lancer и его иллюзии располагаются после появления в виде плюса с возможными вариациями.",
        "После появления иллюзии продолжат двигаться или атаковать цель, если ранее им были отданы эти приказы.",
        "Разрушает деревья в радиусе 200 единиц вокруг Phantom Lancer и каждой задействованной иллюзии при их появлении.",
        "Увеличивается время жизни всех иллюзий, собранных Doppelganger. Не распространяется на иллюзии, созданные применением способности. Увеличение длительность происходит при использовании, давая дополнительную 1 секунду к времени жизни, поскольку появление Phantom Lancer и иллюзий занимает 1 сек.",
        "Увеличение длительность происходит при использовании, давая дополнительную 1 секунду к времени жизни, поскольку появление Phantom Lancer и иллюзий занимает 1 сек.",
        "Иллюзия, получающая обычный урон и не наносящая его, ярче, поэтому Phantom Lancer и его союзники могут отличить её от других иллюзий.",
        "Иллюзия, получающая 20% урона и наносящая 600% от урона, выглядит как все остальные иллюзии Phantom Lancer.",
        "В отличии от иллюзий, создаваемых другими способностями Phantom Lancer, иллюзии Doppelganger используют стандартное значение награды и оно меняется с повышением уровней.",
        "Doppelganger не может быть прервана ничем, кроме смерти. То есть, когда Phantom Lancer телепортируется (например, из-за Glimpse), то он все равно появится в выбранной области."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "25\/20\/15\/10 (TagTalent 21\/16\/11\/6)",
      "description": "Герой и все иллюзии неподалёку ненадолго исчезают с поля боя. Через 1 сек. в случайных точках указанной области появляются сам герой, его копии, а также две новые иллюзии с разными характеристиками. Продлевает время жизни всех иллюзий. Одна из них получает обычный урон, но не наносит его, а другая — получает дополнительные -80% урона и наносит на -500% меньше урона.",
      "spellName": "Doppelganger",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 575",
        "Радиус области: 325",
        "Радиус сбора иллюзий: 900",
        "Задержка появления: 1",
        "Число иллюзий: 2",
        "Урон первой иллюзии: 0%",
        "Урон по первой иллюзии: 100%",
        "Урон второй иллюзии: 20%",
        "Урон по второй иллюзии: 600%",
        "Длительность сбора иллюзий: 2",
        "Время жизни иллюзий от Doppelganger: 8"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Смерть Ворна — мага страха — наделила Азрафа возможностью искривлять и дробить все спектры света."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Phantom_Lancer_Phantom_Rush.mp3\/revision\/latest?cb=20191216021800",
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя"
      ],
      "notes": [
        "Способность можно отключать. Переключение действует только на Phantom Lancer, для его иллюзий она остается активной.",
        "Переключение действует только на Phantom Lancer, для его иллюзий она остается активной.",
        "Требует непосредственного приказа на атаку цели (A или Нажатие ПКМ) для активации. Автоатака или приказ на атаку, отданный через точку на земле, не активируют Phantom Rush.",
        "Phantom Rush срабатывает от любой цели, включая варды и постройки.",
        "Обезоруживание или призрачная форма не мешают Phantom Lancer совершать рывок; при этом он не может выбрать существ с иммунитетом к атакам (например, неуязвимых или находящихся в призрачной форме).",
        "При срабатывании Phantom Lancer получает бафф рывка, дающий герою ускорение и возможность перемещаться сквозь существ. Бафф длится до 5 сек.: до успешного удара по цели или до получения героем другого приказа. Ненаправленные предметы не могут отменить рывок. ↓↓ Двойное нажатие, применяющее предмет на себя, считается за направленный предмет. Бафф рывка также исчезает при оглушении, сне, проклятии, исчезновении или действии урагана. Оцепенение не отменяет действие баффа на Phantom Lancer; он продолжит рывок при истечении оцепенения. Провокация заставляет Phantom Lancer ускорится непосредственно к её источнику без потери баффа. Принудительные атаки, вызываемые провокацией, не отменяют действие баффа. Страх так же не сбрасывает бафф, поэтому герой ускоряется к фонтану. Если цель прячется, становится невидимой или перемещается в туман войны, то Phantom Lancer совершает рывок к последнему известному расположению существа.",
        "Бафф длится до 5 сек.: до успешного удара по цели или до получения героем другого приказа.",
        "Ненаправленные предметы не могут отменить рывок. ↓↓ Двойное нажатие, применяющее предмет на себя, считается за направленный предмет.",
        "Бафф рывка также исчезает при оглушении, сне, проклятии, исчезновении или действии урагана.",
        "Оцепенение не отменяет действие баффа на Phantom Lancer; он продолжит рывок при истечении оцепенения.",
        "Провокация заставляет Phantom Lancer ускорится непосредственно к её источнику без потери баффа. Принудительные атаки, вызываемые провокацией, не отменяют действие баффа.",
        "Страх так же не сбрасывает бафф, поэтому герой ускоряется к фонтану.",
        "Если цель прячется, становится невидимой или перемещается в туман войны, то Phantom Lancer совершает рывок к последнему известному расположению существа.",
        "Phantom Lancer получает бафф, дающий ловкость, при потере баффа рывка. Неважно, из-за чего исчезнет бафф рывка, герою всегда дается бафф ловкости.",
        "Неважно, из-за чего исчезнет бафф рывка, герою всегда дается бафф ловкости.",
        "В среднем бафф ловкости дает Phantom Lancer 1,67\/3,33\/5\/6,67 брони, 10\/20\/30\/40 скорости атаки и 10\/20\/30\/40 урона."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Выбрав цель атаки, герой быстро сближается с ней, на время получая дополнительную ловкость. Иллюзии героя также обладают этой способностью.",
      "spellName": "Phantom Rush",
      "params": [
        "Мин. расстояние до рывка: 200",
        "Макс. расстояние до рывка: 600\/675\/750\/825 (TagTalent 900\/975\/1050\/1125)",
        "Скорость рывка: 800",
        "Доп. ловкость: 10\/20\/30\/40",
        "Макс. длительность рывка: 5",
        "Длительность доп. ловкости: 2"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Азраф знает, что на поле боя скорость может значить всё."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная (TagAghanim Ненаправленная)",
        "Действует на Себя"
      ],
      "notes": [
        "Шанс создания иллюзии срабатывает только при атаке.",
        "Действует на варды, но не на постройки.",
        "Juxtapose использует псевдослучайное распределение.",
        "Иллюзии, созданные Juxtapose, будут атаковать цель, из-за которой способность сработала. То есть иллюзии, созданные Juxtapose, используют Phantom Rush, если их цель находится на подходящем расстоянии.",
        "То есть иллюзии, созданные Juxtapose, используют Phantom Rush, если их цель находится на подходящем расстоянии.",
        "Иллюзии, созданные Juxtapose, дают при убийстве 5 и 5XP; эти значения не меняются с повышением уровней.",
        "Иллюзии появляются в 72 единицах от Phantom Lancer на севере, востоке, юге или западе.",
        "Juxtapose влияет на все иллюзии Phantom Lancer, а не только на те, которые созданы его способностями. Это распространяется и на иллюзии, созданные предметами (TagTalent Manta Style), или с помощью других способностей (TagTalent Reflection). То есть даже иллюзия, созданная врагом с Phantom Lancer, имеет шанс создать еще одну под контролем врага.",
        "Это распространяется и на иллюзии, созданные предметами (TagTalent Manta Style), или с помощью других способностей (TagTalent Reflection).",
        "То есть даже иллюзия, созданная врагом с Phantom Lancer, имеет шанс создать еще одну под контролем врага.",
        "С Aghanim's Scepter Juxtapose становится активной способностью, сохраняющую пассивную часть. При примении все существующие иллюзии Juxtapose мгновенно уничтожаются. Создает иллюзии с интервалом в 0,05 сек. сразу после применения, призывая все иллюзии за 0,25\/0,35\/0,45 сек. Иллюзии появляются в случаных местав в пределах радиуса появления.",
        "При примении все существующие иллюзии Juxtapose мгновенно уничтожаются.",
        "Создает иллюзии с интервалом в 0,05 сек. сразу после применения, призывая все иллюзии за 0,25\/0,35\/0,45 сек.",
        "Иллюзии появляются в случаных местав в пределах радиуса появления."
      ],
      "mana": "75",
      "hotKey": "R",
      "cooldown": "60",
      "description": "При каждой атаке герой может раздробить свою сущность, создав иллюзорную копию себя. Все иллюзии героя также могут раздробиться. Копии, созданные самим героем, живут 8 сек., а копии, созданные другими иллюзиями — 4 сек.",
      "spellName": "Juxtapose",
      "params": [
        "Анимация применения: 0+0,54",
        "Шанс срабатывания у героя: 40%\/45%\/50%",
        "Шанс срабатывания у иллюзии: 8%",
        "Максимум иллюзий: 6\/8\/10",
        "Урон иллюзии: 22% (TagTalent 27%)",
        "Урон по иллюзии: 650%",
        "Время жизни иллюзий (TagTalentсозданных героем): 8",
        "Время жизни иллюзий (TagTalentсозданных иллюзией): 4",
        "Радиус появления: 550",
        "Время жизни иллюзии: 18",
        "Способность можно применить, чтобы уничтожить все иллюзии от неё и создать максимум возможных иллюзий, которые живут на 10 секунд дольше."
      ],
      "itemBehaviour": [],
      "legacyKey": "X",
      "story": "Копьё Азрафа будто бы бьёт дважды… или трижды… или четырежды…"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 19.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.2,
    "attrAgility": 26.0
  },
  "description": "Phantom Lancer — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая способность, Spirit Lance, метает в противника магическое копье, которое наносит цели урон и замедляет ее, а также создает атакующую ее союзную иллюзию. Вторая способность, Doppelganger, позволяет Phantom Lancer ненадолго исчезает с поля боя. Через секунду он, все его иллюзии неподалеку, а также две новые иллюзии появляются в случайных точках в указанной области. Эти две новые иллюзии различаются: одна получает обычный урон, но не наносит его, а другая — получает 600 % и наносит 20 % урона. Пассивная способность, Phantom Rush, позволяет Phantom Lancer быстро бежать к выбранной цели. Иллюзии героя также обладают этой способностью. Ультимативная пассивная способность, Juxtapose, позволяет Phantom Lancer раздробиться надвое, создав свою иллюзию. Иллюзии также имеют возможность раздробиться.",
  "history": "Удалённая деревня Поул не знала о войнах, идущих в центре королевства. Спокойная ловля рыбы и ужин в кругу семьи — для них это была полноценная жизнь. Но война всё равно настигла их. Присоединившись к крепким рекрутам, проходившим мимо домов, скромный копейщик Азраф дал клятву принести мир своему королевству и его жителям. Его сородичи принесли великую жертву, находясь в авангарде последнего боя с магом ужаса Ворном. Когда битва подступила к крепости, Азраф остался один, и он единственный смог пробраться в неё. Сосредоточенный и разъяренный той бойней, в которой пали его братья, Азраф преодолел смертельно опасные ловушки чародея и его околдованных стражей. Вскоре простой рыбак прибыл в башню святилища Ворна. До самого рассвета, пока внизу царил хаос, они сражались, копьё против посоха, пока, наконец, Азраф не пронзил своего врага с оглушающим криком. Но колдун не просто пал: он распался на бесчисленные осколки света, которые пронзили мощью убийцу. Когда улеглась пыль, а туман войны рассеялся, Азраф обнаружил, что находится среди своих сородичей. Каждый казался одет в ту же одежду, что и он сам, каждый имел то же оружие, что и он сам, и Азраф почувствовал, что все мысли их также подобны его собственным. Зная о приближении союзников, Азраф пожелал, чтобы фантомы спрятались, и они один за другим превратились в ничто. Придя в святилище, солдаты нашли воина, что сразил чародея. Когда они приблизились к герою, копейщик испарился. Он оказался всего лишь ещё одним фантомом.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Шанс в 24% нанести атакой 200% урона",
      "talentRight": "-4 сек. перезарядки Doppelganger"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+5% к урону иллюзий от Juxtapose",
      "talentRight": "+300 к дальности Phantom Rush"
    },
    {
      "talentLvl": "15",
      "talentLeft": "–3 сек. перезарядки Spirit Lance",
      "talentRight": "+16% к уклонению"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости атаки",
      "talentRight": "+150 к здоровью"
    }
  ]
}