{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Эффект True Sight даётся по всей области, независимо от фактического обзора носителя. Он полностью беспрепятственный.",
        "Эффект True Sight даётся аурой, которая действует на врагов. Негативный эффект задерживается на 0,5 секунды.",
        "Не может обнаружить существ под эффектами Shadow Dance, Smoke of Deceit и мины Techies под действием Minefield Sign с Aghanim's Scepter.",
        "True Sight не работает, если предмет находится в инвентаре курьера или Spirit Bear.",
        "Когда Gem of True Sight находится на земле, он продолжает давать True Sight вокруг него той команде, которая его уронила. True Sight длится до тех пор, пока не поднимут Gem of True Sight. Находясь на земле, Gem of True Sight также даёт летающий обзор в радиусе 300 единиц вокруг себя, для команды, которая его уронила.",
        "True Sight длится до тех пор, пока не поднимут Gem of True Sight.",
        "Находясь на земле, Gem of True Sight также даёт летающий обзор в радиусе 300 единиц вокруг себя, для команды, которая его уронила."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Даёт владельцу и его союзникам возможность видеть невидимых существ и варды в радиусе 900.",
      "params": [
        "Радиус: 900",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Gem of True Sight условно передаваемый предмет.",
    "Время восстановления в лавке занимает 10 минут.",
    "Этот предмет выпадает, когда носитель умирает, если только у него нет воскрешения.",
    "Gem of True Sight нельзя уничтожить или продать.",
    "Gem of True Sight нельзя переложить в ранец."
  ],
  "cost": "900",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Разное",
  "name": "Gem of True Sight",
  "description": "Как не сдаётся житель моря, Как души утонувших моряков, Как Маэльрон не ведает покоя, Сей камень вечно прослужить готов.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Gem of True Sight — рискованный вклад, так как он падает на землю при смерти и даёт бесплатную возможность врагу забрать его. Поэтому Gem of True Sight стоит покупать только тогда, когда у вашего героя достаточно выживаемости или когда вам не хватает других предметов с эффектом True Sight.",
    "Хотя Gem of True Sight часто приобретают герои поддержки, его лучше носить на стойких героях или инициаторах, которые с меньшей вероятностью умрут и потеряют его.",
    "В начале игры, когда герои больше сосредоточены на фарме линий, Sentry Ward более эффективный предмет для того, чтобы избежать ганка от невидимых героев.",
    "Из-за того, что True Sight является пассивной аурой, он становится эффективным, но самым дорогим предметом для постоянного обнаружения невидимых врагов поблизости.",
    "Gem of True Sight может стать лучшим вкладом в конце игры, даже когда у врага нет невидимых героев. С помощью него можно без проблем уничтожать вражеские Варды в течение длительного времени, так как единственным альтернативным предметом для этого является Sentry Ward, но его можно с лёгкостью потратить впустую, если местоположение вражеских вардов неизвестно."
  ]
}