{
  "abilities": [
    {
      "notes": [
        "The armor talent does not benefit illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "15% Firestorm Building Damage",
          "talentRight": "+0.65s Pit of Malice Root"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 Health Regen",
          "talentRight": "+50 Attack Speed"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-4s Firestorm Cooldown",
          "talentRight": "+75 Pit of Malice AoE"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+2 Firestorm Wave Count",
          "talentRight": "+5 Armor"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Underlord_Firestorm_1.mp3\/revision\/latest?cb=20191216025834",
      "effects": [
        "Ability Target Area (TagAghanim Target Unit)",
        "Affects Enemies (TagAghanim Self)",
        "Damage Magical"
      ],
      "notes": [
        "The visual and audio effects at the targeted area during the cast time are visible and audible to allies only.",
        "Creates waves in 1 second intervals, starting immediately upon cast, resulting in the effect lasting 5 (TagTalent 7) seconds.",
        "Despite the visual effects, the damage of the waves is applied instantly, and not upon landing.",
        "The burn debuff deals damage in 1 second intervals, starting immediately as the debuff is applied, resulting in 3 instances.",
        "The burn debuff does not stack per interval. Each interval refreshes its duration, resulting in 8 (TagTalent 10) possible instances.",
        "On each wave, Firestorm first applies the damage, then the debuff .",
        "Does not place the burn debuff on Roshan, but does apply the wave damage.",
        "Can deal up to 150\/240\/330\/420 + 8%\/16%\/24%\/32% (TagTalent 200\/320\/440\/560 + 10%\/20%\/30%\/40%) of max health as damage (before reductions) when all waves hit and the debuff is not dispelled.",
        "With Aghanim's Shard, the modifier is placed on Underlord as a buff on each wave, healing in the same intervals. Heals Underlord for 3.75\/6\/8.25\/10.5 health per wave. The burn buff heals for 0.15%\/0.3%\/0.45%\/0.6% of max health as health per second. Can heal for up to 22.5\/36\/49.5\/63 + 1.2%\/2.4%\/3.6%\/4.8% (TagTalent 30\/48\/66\/84 + 1.5%\/3%\/4.5%\/6%) of max health as health when all waves hit and the buff is not dispelled.",
        "Heals Underlord for 3.75\/6\/8.25\/10.5 health per wave.",
        "The burn buff heals for 0.15%\/0.3%\/0.45%\/0.6% of max health as health per second.",
        "Can heal for up to 22.5\/36\/49.5\/63 + 1.2%\/2.4%\/3.6%\/4.8% (TagTalent 30\/48\/66\/84 + 1.5%\/3%\/4.5%\/6%) of max health as health when all waves hit and the buff is not dispelled.",
        "With Aghanim's Shard, Firestorm may directly target Underlord. It cannot target other units. When done, the waves area created at Underlord's current location, instead of staying at the original cast location. ↓↓ Double-tapping automatically targets self.",
        "When done, the waves area created at Underlord's current location, instead of staying at the original cast location.",
        "↓↓ Double-tapping automatically targets self.",
        "When the level 25 talent is chosen, Firestorm fully affects buildings, but deals less damage to them. Deals 3.75\/6\/8.25\/10.5 damage per wave to buildings. The burn debuff is placed as well, dealing 0.15%\/0.3%\/0.45%\/0.6% of max health as damage per second. Can deal up to 22.5\/36\/49.5\/63 + 1.2%\/2.4%\/3.6%\/4.8% (TagTalent 30\/48\/66\/84 + 1.5%\/3%\/4.5%\/6%) of max health as damage (before reductions) when all waves hit and the debuff is not dispelled.",
        "Deals 3.75\/6\/8.25\/10.5 damage per wave to buildings.",
        "The burn debuff is placed as well, dealing 0.15%\/0.3%\/0.45%\/0.6% of max health as damage per second.",
        "Can deal up to 22.5\/36\/49.5\/63 + 1.2%\/2.4%\/3.6%\/4.8% (TagTalent 30\/48\/66\/84 + 1.5%\/3%\/4.5%\/6%) of max health as damage (before reductions) when all waves hit and the debuff is not dispelled."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "Q",
      "cooldown": "12 (TagTalent 8)",
      "description": "Calls down waves of fire that damage enemy units in the target area, burning for additional damage over time.",
      "spellName": "Firestorm",
      "params": [
        "Cast Animation: 0.5+0.6 (TagTalent 0.25+0.85)",
        "Cast Range: 600\/625\/650\/675",
        "Effect Radius: 400\/430\/460\/490",
        "Number of Waves: 6 (TagTalent 8)",
        "Wave Interval: 1",
        "Damage per Wave: 25\/40\/55\/70",
        "Max Health as Damage per Second: 1%\/2%\/3%\/4%",
        "Burn Duration: 2",
        "Building Damage Percentage: 15%",
        "Damage Values as Heal: 15%",
        "Firestorm can be self-targeted. When used that way, the Firestorm follows Underlord around. Also causes Firestorm to heal him for 15% of the damage values. Reduced cast point by half.",
        "Attempts to damage if debuff was placed before spell immunity."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "The flames of conquest blaze forth from the darkest depths of the abyss."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Underlord_Pit_of_Malice_1.mp3\/revision\/latest?cb=20191216025837",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "The visual and audio effects at the targeted area during the cast time are visible and audible to allies only.",
        "Roots the targets, preventing them from moving and casting certain mobility spells. Provides True Sight over the targets.",
        "Provides True Sight over the targets.",
        "The root is applied periodically on every enemy within the area. However, the Buff Placer modifier prevents them from being continuously rooted for the whole duration. This hidden modifier is applied on every unit within the area which does not have the modifier yet. The modifier lasts for 3.6 seconds. So whenever the modifier expires, enemies get instantly rooted again and then receive the hidden modifier again. This means that Pit of Malice does not root every unit within the area in set intervals. Each unit is rooted every 3.6 seconds based on when they entered the area. The hidden modifier does not disappear upon leaving the area. This means quickly leaving and re-entering does not result in an instant-root. All Pits share the same modifier, meaning they do not stack - once rooted, the unit becomes immune to all other pits until the modifier wears off.",
        "However, the Buff Placer modifier prevents them from being continuously rooted for the whole duration.",
        "This hidden modifier is applied on every unit within the area which does not have the modifier yet. The modifier lasts for 3.6 seconds.",
        "So whenever the modifier expires, enemies get instantly rooted again and then receive the hidden modifier again.",
        "This means that Pit of Malice does not root every unit within the area in set intervals. Each unit is rooted every 3.6 seconds based on when they entered the area.",
        "The hidden modifier does not disappear upon leaving the area. This means quickly leaving and re-entering does not result in an instant-root.",
        "All Pits share the same modifier, meaning they do not stack - once rooted, the unit becomes immune to all other pits until the modifier wears off.",
        "Fully affects invisible units and units inside the Fog of War.",
        "Can root a unit up to 4 times if it stays within the area for the full duration, resulting in a total root time of 4.8\/5.6\/6.4\/7.2 (TagTalent 7.4\/8.2\/9\/9.8) seconds.",
        "Creates a distinct visual effect around, and plays a distinct sound on affected heroes and illusions, but not around other affected units."
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "W",
      "cooldown": "21\/19\/17\/15",
      "description": "A deadly pit is conjured at the target location; any unit that enters will be rooted. Each enemy unit within the pit are affected every 3.6 seconds.",
      "spellName": "Pit of Malice",
      "params": [
        "Cast Animation: 0.45+0.6",
        "Cast Range: 675",
        "Effect Radius: 400 (TagTalent 475)",
        "Root Interval: 3.6",
        "Root Duration: 1.2\/1.4\/1.6\/1.8 (TagTalent 1.85\/2.05\/2.25\/2.45)",
        "Pit Duration: 12"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Twisting into the seams of reality itself, Vrogros' manifest hatred paralyzes those who defy his will."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Only reduces base damage and that given by the primary attribute of affected units. Raw bonus damage is not reduced.",
        "The aura's debuff lingers for 0.5 seconds.",
        "It does not matter how an enemy dies, Underlord always gets the damage as long as it was affected by the debuff.",
        "Each damage increment per dying unit lasts for the set duration. Gaining more damage does not refresh the duration of the previous increments.",
        "The damage bonuses persist through Underlord's death.",
        "A status buff icon appears whenever Underlord gains damage from the aura. The buff shows how much damage the aura currently grants. Underlord's weapon also glows stronger with green particle effects the more damage stacks he has.",
        "Underlord's weapon also glows stronger with green particle effects the more damage stacks he has.",
        "Does not gain attack damage from dying illusions, couriers, buildings, wards, Tempest Double and Undying Zombie.",
        "When there are multiple Meepo Clones within range, only one of them grants Underlord damage when they die.",
        "Treats creep-heroes as creeps, gaining only the creep value when creep-heroes die within range.",
        "The aura does not affect invulnerable or hidden units.",
        "The attack damage reduction does not affect enemies which have no vision over Underlord. However, Underlord still gains damage from enemies within the aura's range, despite the debuff not being present.",
        "However, Underlord still gains damage from enemies within the aura's range, despite the debuff not being present."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Nearby enemy units are weakened, losing a portion of their base damage. If an enemy dies while under this effect, Underlord gains temporary bonus damage.",
      "spellName": "Atrophy Aura",
      "params": [
        "Radius: 900",
        "Attack Damage Reduction: 5%\/15%\/25%\/35%",
        "Attack Damage Bonus per Hero Death: 30\/35\/40\/45",
        "Attack Damage Bonus per Non-Hero Death: 2\/4\/6\/8",
        "Attack Damage Bonus Duration: 30\/45\/60\/75",
        "Aura Linger Duration: 0.5",
        "Disables aura and prevents gaining new stacks. Already existing stacks still provide bonus attack damage.",
        "Illusions carry the aura. When an enemy unit dies around an illusion which is or was under Underlord's control, the damage is granted to Underlord. If the source of the illusion is an enemy or allied ability, the damage is granted to the illusion, although the illusion cannot make use of it."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "To merely stand in the presence of the Underlord is to feel the conviction of battle sapped from one's soul."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/73\/Underlord_Dark_Rift_1.mp3\/revision\/latest?cb=20191216025830",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Allied Heroes"
      ],
      "notes": [
        "Upon cast, Dark Rift is replaced by Cancel Dark Rift for its duration.",
        "↓↓ Double-tapping automatically targets the team's fountain.",
        "Can be cast on any allied unit which is not a hero (or illusion) or a ward. Can target creep-heroes. With Aghanim's Scepter, can be cast on any allied unit that is not a ward.",
        "With Aghanim's Scepter, can be cast on any allied unit that is not a ward.",
        "Can target and teleport to invulnerable units. Cannot target hidden units, but the teleport still happens if the target turns hidden after being targeted.",
        "When targeting the ground, it searches for the nearest valid target on the map and teleports towards it.",
        "The visual effects around Underlord and on the teleport target are visible to everyone.",
        "The targeted unit's priority is lowered, meaning it is attacked as the last auto attack target by other units.",
        "Disjoints projectiles upon teleporting for everyone who gets teleported.",
        "Can only teleport heroes (including illusions and clones) and creep-heroes. Can teleport them even while invulnerable or hidden.",
        "When Underlord or the teleport target dies during the delay, the spell is canceled. The spell is not canceled when the targeted creep changes ownership."
      ],
      "mana": "100\/200\/300",
      "hotKey": "R",
      "cooldown": "130\/115\/100 (TagTalent 80\/65\/50)",
      "description": "Opens a dark rift at the targeted friendly unit's or building's position. After a short delay, Underlord and all nearby friendly heroes are teleported to that unit's location. Dark Rift can be cancelled at anytime during the cast. If it is cancelled in this way or the target unit dies before the spell becomes active, Dark Rift goes into cooldown.",
      "spellName": "Dark Rift",
      "params": [
        "Cast Animation: 0.6+0.47",
        "Cast Range: Global",
        "Radius: 600",
        "Teleport Delay: 6\/5\/4 (TagAghanim 5\/4\/3)",
        "Dark Rift can be cast on allied heroes. Reduces cast delay by -1 second and cooldown by 50 seconds."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "They come without warning, leaving fire and blood where kingdoms once flourished."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Underlord_Cancel_Dark_Rift.mp3\/revision\/latest?cb=20191216025832",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Dark Rift until the teleport finishes or this spell is cast.",
        "Interrupts Underlord's channeling spells upon cast."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Stop the teleport.",
      "spellName": "Cancel Dark Rift",
      "params": [
        "Cast Animation: 0+1.07"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 25.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.3,
    "attrAgilityInc": 1.6,
    "attrAgility": 12.0
  },
  "description": "Vrogros, the Underlord, is a melee strength hero whose commanding presence is crucial to his team's success. With his long-lasting abilities, Underlord is able to control wide areas of the battlefield during teamfights and skirmishes. Raining down damage from afar with Firestorm, he clears out creeps and discourages enemies from approaching. With his ultimate, Dark Rift, he can teleport his entire team across the map, taking enemies by surprise, pushing in lanes while the other team is dead or out of position. He can also use it as an escape mechanism, bringing himself and his own team to safety in a dicey situation. Enemies' base attack damage are reduced around Underlord by his Atrophy Aura, making him and his team far more durable when dealing with physical damage. The aura also provides him with damage with the death of nearby enemy creeps and heroes, making him an excellent laner and a strong pusher after a won teamfight as well. One of the best area disables in the game, Pit of Malice presents a very large obstacle for enemies, especially melee attackers. With it, Underlord can repeatedly ensnare multiple enemies at once, making him a potent and disruptive opponent in any teamfight.",
  "history": "Neither myth nor song exist to tell of their coming. Deep below the surface of the world lay unknown wonders and horrors. Down and down again, well beneath the slithering magma fields and simmering roots of dormant volcanoes stands the obsidian city of Aziyog, its incomparable stonework spanning an endless cavern. Within honeycomb walls mortared with the bones of countless slaves lies the domain of the Abyssal Horde, and their brutal underlord Vrogros. Armed by the monstrous forgemasters of his kind and well-practiced in the arts of the Dark Rift, Vrogros is able to conjure forth flame and crippling malice through the twist between worlds. He seeks always to expand his holdings, destroying or enslaving all he encounters. Yet the lands offered by the subterranean realm are few, and so his sights have turned upward. By his command the first waves of abyssal invaders have already marched through the rift, a few doomed legions meant merely to test the might of nations above. Now, as his full force readies itself for unending conquest, Vrogros himself steps into a sunlit world to announce his coming reign. Those who face the Underlord will bow and pay tribute, or be crushed where they stand.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "15% Firestorm Building Damage",
      "talentRight": "+0.65s Pit of Malice Root"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 Health Regen",
      "talentRight": "+50 Attack Speed"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-4s Firestorm Cooldown",
      "talentRight": "+75 Pit of Malice AoE"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+2 Firestorm Wave Count",
      "talentRight": "+5 Armor"
    }
  ]
}