{"abilities":[{"spell":"An exploding pulse deals damage to enemies and structures in the area. Deals half damage to structures.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Deals 50\/87.5\/125\/162.5 ( 150\/187.5\/225\/262.5) damage to buildings.","The visual effects and the sound during the 0.9 second effect delay are only visible and audible to allies."],"mana":"85\/105\/125\/145","elements":["Does not pierce spell immunity."],"cooldown":"5 ( 4)","name":"Nether Blast","description":["Cast Animation: 0.2+0","Cast Range: 400","Blast Radius: 400","Effect Delay: 0.9","Damage: 100\/175\/250\/325 ( 300\/375\/450\/525)","Building Damage Percentage: 50%"],"hot_key":"Q","legacy_key":"B"},{"spell":"A powerful banishing spell that slows a unit and renders it unable to attack or be attacked. Afflicted units take extra magic damage.","effects":["Ability Target Unit","Affects Enemies \/ Allies"],"notes":["Turns the target ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance.","Reduces most allied heroes' total magic resistance to 6.25%, assuming basic 25% magic resistance and no other sources of magic resistance. Reduces an allied Visage's total magic resistance to -12.5%, assuming his basic 10% magic resistance and no other sources of magic resistance.","Reduces most enemy heroes' total magic resistance to 2%\/-5%\/-13%\/-20%, assuming basic 25% magic resistance and no other sources of magic resistance. Reduces an enemy Visage's total magic resistance to -17%\/-26%\/-35%\/-44%, assuming his basic 10% magic resistance and no other sources of magic resistance.","Decrepify's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.","Can be cast on Nether Wards and Tombstones. This includes allied Nether Wards and Tombstones, and enemy Nether Wards, but not enemy Tombstones, since it does not pierce spell immunity on enemies. Cannot be cast on any other ward.","Does not slow allied targets."],"mana":"60","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"15\/12\/9\/6","name":"Decrepify","description":["Cast Animation: 0.2+0.4","Cast Range: 700","Enemy Move Speed Slow: 30%\/40%\/50%\/60%","Ally Magic Resistance Reduction: 25%","Enemy Magic Resistance Reduction: 30%\/40%\/50%\/60%","Duration: 3.5 ( 5.5)"],"hot_key":"W","legacy_key":"C"},{"spell":"Pugna places a Nether Ward at the target location. The ward reduces the mana regeneration of nearby enemy heroes, and will fire at any enemy hero who casts a spell. Nether Ward deals damage equal to the damage multiplier times the mana spent by the enemy hero.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["When double-clicking the ability, the ward is placed right in front of Pugna, 150 range away from him.","The mana loss is provided by an aura with 1600 radius. Its debuff lingers for 0.5 seconds. The flare is independent from the aura.","Causes mana loss by directly decreasing mana regeneration, which is also reflected in the UI with a lower mana regen value.","Can degenerate up to 7.625%\/15.25%\/22.875%\/30.5% of a unit's max mana over its full duration.","Can fully degenerate a unit's mana within 400\/200\/133.33\/100 seconds.","The mana loss aura does not affect neutral creeps and lane creeps.","Mana Flare triggers on every instance of mana usage from spells and items. If a spell or item costs no mana to use, it does not trigger on it. This means it triggers on Pulse Nova, Voodoo Restoration, Chakram and Ball Lightning whenever they use mana. It also triggers on active attack modifiers like Frost Arrows, Arcane Orb and Melting Strike.","Mana Flare does not trigger on mana loss caused in other ways (all forms of mana burn, Mana Drain, Sanity's Eclipse, etc). The mana loss from Overcharge counts as a mana removal, not as a mana cost, and therefore does not proc Mana Flare either.","Mana Flare deals the damage before the actual spell is cast, so if the target dies, the spell stays unused. This means that spells which provide protection (e.g. Rage, Refraction) do not save the caster from a lethal Mana Flare. Dying with Reincarnation active triggers Mana Flare, but it does not prevent Reincarnation from going off.","The damage source is the ward itself, meaning certain on-damage effects react on the ward rather than on Pugna (e.g. Blade Mail).","Mana Flare can hit invulnerable and invisible units and units in the Fog of War.","Illusions are treated as creeps when attacking the ward, so they take 16 attacks to destroy it, instead of 4 like heroes."],"mana":"80","elements":["Partially pierces spell immunity."],"cooldown":"35","name":"Nether Ward","description":["Cast Animation: 0.2+0.4","Cast Range: 150","Radius: 1600","Hero Attacks to Destroy: 4 ( 7)","Non-Hero Attacks to Destroy: 16 ( 28)","Damage per Used Mana: 1.25\/1.5\/1.75\/2 ( 3\/3.25\/3.5\/3.75)","Max Mana Loss per Second: 0.25%\/0.5%\/0.75%\/1%","Aura Linger Duration: 0.5","Ward Duration: 30"],"hot_key":"E","legacy_key":"W"},{"spell":"When cast on an enemy, Pugna drains health from the target enemy unit to heal himself and granting vision over the target. If Pugna has full HP, and the enemy target is a Hero, Life Drain will restore mana instead. When cast on an ally, Pugna will drain his own health into his ally.","effects":["Ability Target Unit \/ Channeled","Affects Enemies \/ Allies","Damage Magical"],"notes":["The link breaks when the target turns invulnerable or hidden, exceeds the break distance, or runs out of health.","Provides shared vision and True Sight over the target.","The health restored equals the amount of damage dealt per tick after all reductions. This means when a damage instance is reduced (e.g. magic resistance, Refraction, etc), it heals for the reduced amount. But this also means that amplifying the damage (e.g. Decrepify, Soul Catcher, etc), causes it to heal for more. This also goes for targeting allies. The more damage it deals to Pugna, the more it heals and vice versa. This means that Pugna cannot heal his allies while he has 100% magic resistance (e.g. via spell immunity), since he takes 0 damage from the spell. The +25% heal talent for Life Drain amplifies the healing done by Life Drain by 25%. It is still based on the damage dealt.","If Pugna's or the allied hero's health is full and the damaged unit is a hero, it restores their mana instead. This means it also restores mana on allied non-hero units when they are at full health, since Pugna (a hero) is damaged. Just like the health restoring, the amount of mana restored equals the amount of damage dealt after all reductions.","The self-damage when targeting allies is lethal, so it can be used to deny oneself.","Drains 37.5\/56.25\/75 health in 0.25 second intervals, starting 0.25 seconds after cast, resulting in up to 40 instances. The talent amplifies the heal value to 46.875\/70.3125\/93.75 without changing the damage value.","The color of the drain changes depending on the situation: When draining life from an enemy, the drain is red\/green (pink\/blue if Pugna is at full health). When draining life into an ally, the drain is green\/green (blue\/green if the ally is at full health).","Can drain up to 1500\/2250\/3000 health (before reductions) when fully channeled. With the talent, it can heal up to 1875\/2812.5\/3750 health, while the damage dealt remains unchanged.","Instantly destroys targeted enemy illusions on the first instance. Allied illusions are not destroyed."],"mana":"125\/175\/225","elements":["Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"22 ( 0)","name":"Life Drain","description":["Cast Animation: 0.2+0","Cast Range: 700","Max Channel Time: 10","Link Break Distance: 1000","Health Drain per Second: 150\/225\/300","Life Drain Heal Amplification: 0 ( 25%)"],"hot_key":"R","legacy_key":"D"}],"bio":"In the realm of Pugna's birth, near the vents of the Nether Reaches, there stood a lamasery devoted to the Arts of Oblivion, which drew its power from the nether energies. The Grandmaster of the temple compound had himself passed into Oblivion several years prior, leaving his academy without a leader. From the moment of their master's death, the regents of the temple began rites of divination to identify their master's reincarnation, and eventually all signs converged on the immediate neighborhood. Several villages squatted in the shadow of the temple, their alleys and plazas full of the laughter of squalling children. Pugna, a mere thirteen months of age, was but one candidate among the local brats, and on the appointed day he was presented at the temple alongside two other promising tots. The lamas offered a jumble of worn relics to the children, treasured possessions of their former grandmaster. One boy reached for a porphyry wand that had belonged to the lama...and put it in his nostril. An impish girl pulled out an amulet that had also been the lama's, and immediately swallowed it. Pugna regarded the other two coolly, gave a merry laugh, and blasted them with gouts of emerald flame, reducing them to ashes in an instant. He then snatched up the wand and amulet, saying 'Mine!' The regents hoisted the beaming Pugna on their shoulders, wrapped him in their grandmaster's vestments, and rushed him to the throne before his mood could change. Within five years, the temple itself was another pile of ash, which pleased Pugna to no end.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["According to Alchemist's rival hero taunt, Pugna is composed largely of phosphorus. Being a skeleton, he would be made of the phosphorus-containing mineral hydroxyapatite, a major component of bone.","Several lines of dialogue reference Viper being Pugna's pet before he was summoned from the Nether by a wizard.","\"Pugna\" is a Latin word that translates to a few meanings, namely \"fight\", \"dispute\", or \"conflict\".","Pugna's unused response \"First, do no harm.\" is a reference to the medical principle \"Primum non nocere\", which is latin and translates into \"First, do no harm\".","In DotA, Pugna's title was Oblivion. While his lore and lines still mention \"Oblivion\" in Dota 2, this is now the name of his art of sorcery rather than his title, making Pugna one of the few Dota 2 heroes without both a name and a title."],"talents":["+1.75 Netherward Damage Per Mana:+200 Nether Blast Damage","+2s Decrepify Duration:+25% Life Drain Heal","+3 Nether Ward Health:-1s Netherblast Cooldown","+225 Health:+20 Movement Speed"],"desc":"Pugna is a ranged intelligence hero whose spells give him powerful nuking and pushing capability. Nether Blast is a delayed low-cooldown area nuke which also deals damage to buildings, allowing Pugna to use it as a basic nuke as well as a pushing spell. Decrepify is a unit-targeted spell that gives its target the ethereal status effect, rendering them unable to take physical damage but also slowing them and decreasing their magic resistance. Nether Ward is a ward-type ability that debilitates enemy casting, degenerating their mana while punishing them with powerful nukes based on the mana cost of the spells they cast within its domain. Pugna's ultimate ability, Life Drain, is a channeling ability which saps enemy health and grants it to himself, and can be cast on allies to give them health and mana as well. With a strong array of versatile nukes, Pugna can be a force to be reckoned with in teamfights, able to blast his foes into Oblivion with ease."}