{"abilities":[{"spell":"Бросает в указанную область сеть, которая приковывает врагов к земле. Жертва не может уйти в невидимость или выбраться из сети.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Скорость полета сетки - 900.","Earthbind может задевать юнитов на расстоянии до 720\/970\/1220\/1470 единиц (складывается из максимальной дальности применения и радиуса).","Применяет к цели оцепенение, препятствуя её движению и использованию определенных способностей для передвижения. Дает эффект True Sight на цель.","Сеть дает летающий обзор в радиусе 300 единиц вокруг себя в момент полёта."],"mana":"100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/16\/12\/8 ( 16\/12\/8\/4)","name":"Earthbind","description":["Анимация применения: 0,3+0","Дальность применения: 500\/750\/1000\/1250","Радиус: 220","Длительность: 2"],"hot_key":"Q","legacy_key":"E"},{"spell":"Используя таинственную энергию земли, Meepo может телепортироваться к другому Meepo после произнесения заклинания в течение 1,5 секунд, нанося урон как в точке отправки, так и в месте прибытия.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Себя \/ Врагов","Урон Магический"],"notes":["С помощью Poof нельзя избегать снаряды.","Poof может выбрать в качестве только Meepo, его клонов и иллюзии.","При выборе точки на земле, при применении выбирается ближайший к выбранной точке Meepo (это может быть тот же Meepo, что использовал способность).","Poof наносит урон дважды: один раз в месте применения, второй - в месте назначения.","Здесь указано, сколько урона может нанести Poof (до учета сопротивления), когда несколько Meepo используют способность в одной и той же точке: 1 Meepo: 140\/180\/220\/260 ( 200\/240\/280\/320) 2 Meepo: 280\/360\/440\/520 ( 400\/480\/560\/640) 3 Meepo: 420\/540\/660\/780 ( 600\/720\/840\/960) 4 Meepo: 560\/720\/880\/1040 ( 800\/960\/1120\/1280) 5 Meepo: 700\/900\/1100\/1300 ( 1000\/1200\/1400\/1600)"],"mana":"80","elements":["Нельзя применять в оцепенении.","Блокируется иммунитетом к заклинаниям."],"cooldown":"12\/10\/8\/6 ( 7\/5\/3\/1)","name":"Poof","description":["Анимация применения: 1,5+0","Дальность применения: Глобальная","Радиус: 375","Урон: 70\/90\/110\/130 ( 100\/120\/140\/160)"],"hot_key":"W","legacy_key":"F"},{"spell":"Каждая атака крадёт здоровье у противника и излечивает остальные копии героя.","effects":["Способность Пассивная","Действует на Врагов","Урон Чистый"],"notes":["При атаке наносит врагам чистый урон. Урон способности применяется до урона от атаки.","Излечивает всех остальных Meepo на установленное значение. Фактическое количество полученного урона целью значения не имеет.","Не действует на Рошана или иллюзии.","Считает крипов-героев за крипов."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Ransack","description":["Похищение здоровья (герои): 6\/10\/14\/18","Похищение здоровья (крипы): 4\/6\/8\/10"],"hot_key":"E","legacy_key":"G"},{"spell":"Герой создаёт неидеальную и почти разумную копию самого себя. Эти клоны получают золото и опыт, а также перенимают способности, характеристики и уровень героя. Клоны не могут использовать какие-либо предметы, кроме сапог главного героя. Если хоть один из клонов погибнет, то умрут как все остальные клоны, так и сам герой.","effects":["Способность Пассивная"],"notes":["В отличии от большинства ультимейтов, Divided We Stand можно изучать на 3\/10\/17, а не на стандартных 6\/12\/18.","При поднятии уровня способности клоны Meepo всегда появляются с полным запасом здоровья и маны рядом с основным Meepo, даже если способность изучалась клоном.","Meepo и его клоны отображаются в качестве иконок с полосами здоровья и маны для каждого в верхнем левом угле экрана. При выборе Meepo его иконка становится ярче. Когда Meepo получает урон, его иконка мигает красным.","Клоны Meepo получают урон как герои за одним исключением: Thundergod's Wrath не поражает клонов Meepo.","Клоны получают бонусы от талантов и от любых атрибутов, даваемых предметами или баффами. Но при этом не получают бонусы от любых других бонусов предметов (дополнительный урон, здоровье, броня и т.д.). Также это означает, что дополнительные атрибуты от Guardian Greaves и Power Treads, как и +7 к силе от таланта, удваиваются для клонов.","Клоны Meepo получают лишь 40% от всего опыта, даже если находятся по одиночке. То есть, если клон в одиночестве, он теряет 60% от опыта. Если рядом 1 союзник, клон получает 20%, союзник — 80%, с 2 союзниками клон получает 13.33%, союзники — по 86.67% каждый. Главный Meepo продолжает получать 100% опыта — как и остальные герои. Штраф действует только для клонов.","Когда основной Meepo теряет атрибуты (к примеру от Decay или Intelligence Steal), атрибуты клонов адаптируются под это. При этом сами клоны Meepo подвержены потере атрибутов, но атрибуты остальных Meepo под это не адаптируются.","Клоны Meepo не могут поднимать или выбрасывать любые предметы. Клоны могут подбирать руны и получать от них бонусы. Невозможно дать клонам Tango или Варды. Их можно лечить с помощью, к примеру, Bottle. Клоны Meepo могут иметь в инвентаре только одну пару обуви, скопированную с основного Meepo в следующем приоритете: Boots of Travel 2 > Boots of Travel 1 > Guardian Greaves > Power Treads > Arcane Boots > Phase Boots > Tranquil Boots > Boots of Speed. Клоны не могут использовать Guardian Greaves, Arcane Boots и Power Treads. Phase Boots и Boots of Travel использовать можно. Если основной Meepo переключит атрибут Power Treads, атрибуты у обуви клонов также поменяются. Когда Meepo воскрешается с помощью Aegis of the Immortal, все клоны появляются рядом с основным Meepo, а не на месте их смертей.","После приобретения Aghanim's Scepter Meepo не может его выбросить или продать. Улучшение от Aghanim's Scepter не требует изученного Divided We Stand и всегда дает дополнительного Meepo. Приобретение Aghanim's Scepter в мертвом состоянии заставляет нового клона мгновенно умереть и воскреснуть уже вместе с Meepo."],"mana":"0","elements":["Не отключается истощением."],"cooldown":"0","name":"Divided We Stand","description":["Количество клонов: 1\/2\/3 ( 2\/3\/4)","Получение опыта клонами: 40%"],"hot_key":"R","legacy_key":"D"}],"bio":"«Как по мне, в жизни важны лишь две вещи: те, кого ты знаешь, и то, что можешь найти. Но в руинах Ущелья теней непросто даже червячка заморить. Так что надо хитрить, надо попрошайничать, надо знать свои сильные стороны. Некоторые твари с поверхности — раз! — и прибьют тебя, так что нужно охотиться на слабых и избегать тех, что посильнее. Но не всё так грустно — в наших руинах живёт история, а ведь для некоторых она очень даже дорога. Раньше здесь был дворец, и в нём тёмный народ проворачивал свои тёмные ритуалы. Просто ужас. Если кто переживал церемонию, они разбивали кристалл и дробили душу бедняги на кусочки. Зато какое у них искусство! Скульптуры, все дела... Я тебе вот что скажу: бывает, натыкаешься на старинную резьбу. Набираешь столько кусков, сколько можешь унести, продаёшь в городе — и пару недель живёшь себе припеваючи. А если совсем повезёт, наткнёшься на кристалл теней. Узнаёшь цену и начинаешь искать покупателя. Благо, хватает болванов, мечтающих о таких безделушках. А коли не выходит, продаёшь любому проезжему магу. Они обожают такие штуковины. Но ты аккуратнее. Не завидую я тому, кто разобьёт этот кристалл. Это ой как больно!»","talentsTips":["Все таланты влияют на основного Meepo и его клонов.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на силу в общем даёт Meepo: 140 здоровья, 0.7 регенерации здоровья и 0.56% сопротивления магии.","Талант на уклонение мультипликативно сочетается с другими источниками уклонения.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Several of Meepo's lines reference the Scout from Team Fortress 2, another title by Valve. \"Aww, didn't mean to hurt ya. Much.\" is referring to Scout's line \"Oh, I'm sorry, I didn't mean to hit ya... No, wait, yeah I did.\" \"I'm not even winded.\", \"Who's the tough guy now, tough guy?\", \"Freakin' unbelievable.\", \"This is a real freakin' embarrasment.\", \"No, seriously, you all suck!\" and \"Now that's what I'm talking about!\" are direct quotes from Scout. His death lines \"Hey, that hurt.\" are a reference to Scout's lines upon evading bullets while under the effect of his Bonk! Atomic Punch (as heard here and here). \"You suck!\" is also a line used frequently by the Scout. In his anger lines and , he's mumbling \"You've got to be kidding me\", another line frequently used by the Scout. His death line \"You punched out all of my blood!\" is a quote from the Scout in the shortfilm Meet the Sandvich. With \"Ahh now that's the stuff!\", he's also quoting one of the Demoman's lines, another character from Team Fortress 2 (as heard here).","Meepo is named after the first kobold players meet in The Sunless Citadel Dungeons and Dragons 3.0 adventure."],"talents":["-5 сек. перезарядки Poof:+400 к здоровью","+10% к вампиризму:-4 сек. перезарядки Earthbind","+30 к урону от Poof:+15% к уклонению","+10 к урону:+7 к силе"],"desc":"Meepo — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Первой способностью, Earthbind, Meepo бросает сеть в указанную область, приковывая врагов к земле. Earthbind предотвращает уход в невидимость. Не прерывает телепортацию и используемые заклинания. Второй способностью, Poof, Meepo может телепортироваться к другому Meepo после произнесения заклинания, нанося урон как в точке отправки, так и в месте прибытия. Пассивной способностью, Ransack, каждая атака крадёт здоровье у противника и излечивает остальные копии героя. Ультимативной способностью, Divided We Stand, Meepo создает неидеальных, полуавтономных клонов. Клоны способны получать и разделять золото и опыт, а также перенимают все способности Meepo. Клоны неспособны использовать какие-либо предметы, кроме сапогов, что носит оригинал. Если хоть один из клонов умрет, то умирают и все остальные Meepo. Улучшение с Aghanim's Scepter добавляет дополнительного клона."}