{
  "abilities": [
    {
      "notes": [
        "Накладывает на противников провокацию, заставляя их атаковать Axe. Затронутые существа не могут использовать способности и активные предметы. Не накладывает безмолвие, поэтому активные модификаторы атаки все еще работают, если включено Автоприменение. Существа будут следовать и атаковать Axe вне зависимости от дистанции, обзора, препятствий и статуса. Затронутые существа все так же могут быть подвержены другим обезвреживаниям и не получают свободного передвижения. Действует на невидимых существ и существ в тумане войны. Не действует на башни, варды, неуязвимых и спрятанных юнитов. Не действует на линейных крипов из самой первой волны, пока они не встретятся с крипами противоположной стороны",
        "Повторное применение способности на цель, уже находящуюся под её действием, обновляет длительность",
        "Если Axe станет невидимым во время провокации, затронутые существа начнут атаковать ближайшего к ним врага. Если рядом врагов нет, то они останутся на месте. В это время они могут получить один приказ, исполнением которого они займутся. Этот приказ уже не может быть отменен. Приказ может любым, включая использование способности или предмета, передвижение или атаку. После этого приказа существо больше не может ничего делать и стоит на месте пока провокация не закончится. Правда если Axe снова станет видимым, существа вновь начнут его атаковать",
        "Провокация имеет одинаковый приоритет с  Winter's Curse, но меньший чем  Duel. Одинаковый приоритет означает, что затронутые существа будут атаковать цель, которая первая использовала провокацию, и переключатся на другую цель, как только первая провокация завершилась. У провокации приоритет выше, чем у страха, при этом страх не дает существу атаковать цель",
        "Если Axe умрет, эффект провокации мгновенно закончится",
        "Berserker's Call увеличивает урон в секунду от  Battle Hunger на 25 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 50) во время своего действия. Может увеличить общий урон от Battle Hunger на 50\/50\/50\/75 ‒ 50\/75\/75\/100 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 100\/100\/100\/150 ‒ 100\/150\/150\/200)",
        "С улучшением от  Aghanim's Scepter, также применяет  Battle Hunger на всех задетых врагов. Провокация и Battle Hunger накладываются одновременно. Примечания к Battle Hunger полностью применимы. Если способность не изучена, то Battle Hunger не накладывается"
      ],
      "item_behaviour": [],
      "description": "Герой бросает вызов ближайшим врагам, заставляя их атаковать его, а также получает бонус к броне на время действия способности.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Радиус: 300 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 400)",
        "Дополнительная броня: 25 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 33)",
        "Длительность: 2\/2,4\/2,8\/3,2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Axe_Berserker%27s_Call.mp3\/revision\/latest?cb=20191216010834",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя"
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "aghanim": null,
      "name": "Berserker's Call",
      "cooldown": "80\/90\/100\/110",
      "legacy_key": "E",
      "story": "Могучий рёв Могул Хана заставляет врагов вступить в заведомо проигранную схватку."
    },
    {
      "notes": [
        "Негативный эффект может быть снять при убийстве любого существа, если оно не является иллюзией, в любом случае. Также снимает негативный эффект при уничтожении постройки, варда и при добивании союзника. Чтобы избавиться от негативного эффекта, подверженные существа должны совершить убийство сами. Призываемые существа или иллюзии под контролем того же игрока не избавляют от эффекта, если они совершат убийство. Использование способностей, совершающих мгновенное убийство (например,  Devour,  Demonic Conversion,  Hand of Midas), также убирает негативный эффект",
        "Не уменьшает скорость передвижения противника, если Axe находится в области 90° перед ними вне зависимости от расстояния или тумана войны. Уменьшает скорость передвижения крипов на 5,5%\/9,5%\/13,5%\/17,5% и броню на 3,5. Считает крипов-героев за крипов",
        "Наносит урон каждую секунду спустя 1 секунду после применения, срабатывая до 12 раз. Может нанести до 120\/180\/240\/300 + 12x (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 24x) урона от брони (до учёт сопротивлений) за всю длительность. Повышение уровня способности не повысит базовый урон от уже наложенного эффекта. Однако значение брони Axe постоянно проверяется, поэтому урон от брони обновляется мгновенно. Изучение таланта, повышающего урон способности также мгновенно обновляет значение урона на всех активных эффектах. Основанный на броне урон не ограничивается 0 снизу. Это значит, что если броня Axe отрицательна, то способность будет наносить уменьшенный урон вплоть до 0, если у Axe будет 10\/15\/20\/25 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 5\/7,5\/10\/12,5) брони",
        "Повышение уровня способности или выбор увеличивающего замедление <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта не повысит замедление от уже наложенного эффекта",
        "Повторное использование способности на одну и ту же цель только обновит длительность эффекта, никак не взаимодействуя иначе",
        "У способности присутствует скрытый статус, который всегда активен, но не виден игроку. Он не показывается до тех пор, пока количество эффектов равно 0. С улучшением от  Aghanim's Scepter статус начинает давать Axe броню за каждого поражённого способностью противника. Увеличивает урон в секунду от Battle Hunger на 7 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 14) и общий урон на 84 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 168) за каждого задетого противника. У этого статуса нет лимита эффектов",
        "Чтобы узнать, сколько урона наносит способность на каждом уровне, учитывая основную броню Axe и выбранные таланты, посмотрите таблицу ниже"
      ],
      "item_behaviour": [],
      "description": "Приводит врага в бешенство, нанося ему урон, пока он кого-нибудь не убьёт или действие способности не закончится. Урон от способности увеличивается в зависимости от брони владельца способности. Скорость передвижения жертвы уменьшается, когда она не смотрит в сторону владельца способности.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 700\/775\/850\/925",
        "Базовый урон в секунду: 10\/15\/20\/25",
        "Брони в виде урона каждую секунду: 100% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 200%)",
        "Изменение скорости передвижения: 11%\/19%\/27%\/35% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 23%\/31%\/39%\/47%)",
        "Множитель скорости передвижения\/брони на крипах: 0,5",
        "Лицевой угол: 90°",
        "Длительность: 12",
        "Снижение брони цели:  7",
        "Дополнительная броня за героя:  7",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Бонус к скорости передвижения за эффект:  12%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Axe_Battle_Hunger.mp3\/revision\/latest?cb=20191216010833",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов ",
        "Урон: Физический"
      ],
      "mana": "20\/15\/10\/5",
      "aghanim": null,
      "name": "Battle Hunger",
      "cooldown": "50\/60\/70\/80",
      "legacy_key": "R",
      "story": "Обычные герои не могут сопротивляться ярости Могул Хана, и она калечит их, пока они не выместят ее на ком-нибудь."
    },
    {
      "notes": [
        "Срабатывает только когда вражеское существо успешно завершает атаку на Axe вне зависимости от расстояния. Таким образом не срабатывает, если атака промахнется",
        "Не срабатывает при вторичных атаках от  Moon Glaives,  Death Ward,  Split Shot и  Flak Cannon. Срабатывает при вторичных атаках от других мгновенных атак. Не срабатывает при атаках построек, вардов и союзников",
        "Несмотря на визуальные эффекты, урон в радиусе наносится моментально",
        "Counter Helix использует псевдослучайное распределение",
        "Counter Helix использует нестандартную перезарядку. Ее время не показывается на иконке способности и не подвергается эффектам манипуляции временем перезарядки",
        "С улучшением от  Aghanim's Shard, герой накладывает на врагов эффект, уменьшающий их урон от атак. Этот эффект может складываться до 6 раз. Текущее число эффектом написано в иконке статуса. Снижает урон от атак на 15%\/30%\/45%\/60%\/75%\/90% на каждом числе эффектов. Наложение нового эффекта обновит длительность предыдущих. Снижение урона действует на итоговый урон от атаки, включая основной и дополнительный и исключая модификаторы атаки"
      ],
      "item_behaviour": [],
      "description": "Герой с некоторой вероятностью отвечает на атаки противников, нанося чистый урон всем врагам вокруг себя.",
      "hot_key": "E",
      "params": [
        "Радиус: 275",
        "Шанс контратаки: 17%\/18%\/19%\/20% ( 27%\/28%\/29%\/30%)",
        "Урон: 60\/100\/140\/180 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 90\/130\/170\/210)",
        "Максимум эффектов:  6",
        "Снижение урона от атак:  15%",
        "Длительность снижения:  6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8e\/Axe_Counter_Helix.mp3\/revision\/latest?cb=20191216010823",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Counter Helix",
      "cooldown": null,
      "legacy_key": "X",
      "story": "Могул Хан — сам себе войско."
    },
    {
      "notes": [
        "Проверяет здоровье цели на момент применения способности. Если текущее здоровье ниже, чем итоговый исходящий урон от Culling Blade, то нанесённый урон будет отмечен как отнимающий здоровье. Это гарантирует, что уменьшение входящего урона на цели не предотвратит убийство от Culling Blade. Поскольку используется итоговый исходящий урон, то усилители исходящего урона на Axe также влиют на порог для убийства. Усиление входящего урона также влияет на порог для убийства, так как отнимающий здоровье",
        "Когда цель умирает от Culling Blade, происходит следующее: Снимаются все эффекты, предотвращающие смерть (например,  Shallow Grave,  False Promise, <span image=\"images\/Borrowed_Time.webp\">Borrowed_Time<\/span> Borrowed Time и  Battle Trance) Однако форма призраков от  Reincarnation не убирается, так как она предоставляется аурой, которая не убирается при смерти. Это означает, что цель всё равно войдет в форму призрака. Герой и близстоящие союзники получают бонус к скорости передвижения и скорости атаки. Если целью был герой, клон или иллюзия, то перезарядка способности сбрасывается. Если целью был герой, то Axe получает постоянный бонус к броне",
        "При первом убийстве этой способностью Axe получает постоянный эффект, дающий броню. Последующие успешные убийства будут обновлять этот эффект. Число эффектов отображается в иконке статуса, а полученная броня отображается в описании статуса. Не получает эффекты за убийство иллюзии,  Tempest Double или   призраков. Получает эффект, даже если убитый противник имел воскрешение. Бонус к броне изменяется при повышении уровня способности или выборе увеличивающего броню при убийстве <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта. Бонус к броне постоянно увеличивает урон в секунду от  Battle Hunger на 1\/1,5\/2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2\/3\/4). С увеличивающим броню при убийстве <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом увеличивает урон в секунду Battle Hunger на 2\/2,5\/3 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 4\/5\/6)",
        "Нельзя применить на существ под эффектом   Wraith Delay",
        "Скрытый модификатор состояния jungle weapon gesture modifier используется предметом Fists of Axe Unleashed и является ответственным за звук и анимацию"
      ],
      "item_behaviour": [],
      "description": "Герой находит слабую точку врага и наносит ему чистый урон. Если убить этой способностью вражеского героя, её перезарядка сбрасывается, броня её владельца навсегда увеличится, а его союзники поблизости временно получат дополнительную скорость.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 175",
        "Радиус ускорения: 900",
        "Урон\/Порог для убийства: 250\/350\/450 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 400\/500\/600)",
        "Броня за убийство: 1\/1,5\/2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2\/2,5\/3)",
        "Доп. скорость передвижения: 20%\/25%\/30%",
        "Доп. скорость атаки: 20\/30\/40",
        "Длительность ускорения: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Axe_Culling_Blade_1.mp3\/revision\/latest?cb=20191216010823",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Чистый"
      ],
      "mana": "100\/85\/70",
      "aghanim": null,
      "name": "Culling Blade",
      "cooldown": "100\/125\/150",
      "legacy_key": "C",
      "story": "Словно воплощение самой яростной битвы, Могул Хан жестоко расправляется с теми, кто осмелился дать ему бой."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 25.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.0,
    "attrAgility": 20.0
  },
  "description": "Провоцирует врагов, заставляя их атаковать его Один за другим, солдаты Красного тумана пали. Одни в погибли битвах, другие — стали жертвами амбиций Могул Хана. В какой-то момент самопровозглашенный генерал обнаружил, что командовать ему больше некем. «Не важно», думал Axe. «Войско из одного солдата — лучшая возможная армия». Врываясь в схватку, Могул Хан издает свой Berserker's Call, обращая против себя мечи всех врагов вокруг, заставляя их атаковать себя. Принимая удары, Axe контратакует врагов, рассекая вокруг себя топором в смертельном Counter Helix, с легкостью одолевая всю собравшуюся кругом толпу. Ускользнувших от Axe терзает нескончаемая Battle Hunger — жажда битвы, которую нельзя утолить никоим способом, кроме смерти, чужой или своей. Тех немногих, что выживают после схватки, Могул Хан отправляет на тот свет Culling Blade, не останавливаясь, пока не останется никого.  Инициация Стойкость Контроль Лес ★☆☆",
  "history": "Ещё будучи рядовым бугаем в армии Красного тумана, Могул Хан положил глаз на генеральский титул. Битву за битвой он самыми кровавыми способами доказывал собственное превосходство. Облегчало подъём в чинах и то, что без тени сомнения он мог обезглавить старшего по званию. В семилетней кампании на Тысячеболотье Могул Хан отличился в кровопролитных бойнях, и звезда его славы засияла еще ярче, но число соратников неизменно сокращалось. В ночь безоговорочной победы он провозгласил себя генералом Красного тумана, присвоив себе заодно и титул верховного военачальника. Однако теперь в его отряде не значилось ни одного воина. Множество бойцов было повержено врагом, но и от его топора погибло достаточно. Стоит ли говорить, что большинство солдат теперь ни за что не переманить под его знамена? Но Могул Хана это совсем не смущает, ведь он знает: один в поле воин."
}