{
  "abilities": [
    {
      "effects": [
        "Base Experience Gained: 700",
        "Bonus Experience Gained per Previous Tome: 135"
      ],
      "notes": [
        "Interrupts the user's channeling spells on cast.",
        "The first Tome used only grants the 700 base experience. Each subsequent Tome used by that team grants 135 more exp than the previous Tome. This growth effect has no upper limit, so the exp bonus keeps growing bigger and bigger with each Tome of Knowledge consumed by that team.",
        "Grants the experience instantly.",
        "Cannot be used by Spirit Bear or couriers.",
        "Can be used even when already at max level, effectively wasting the item."
      ],
      "elements": [
        "Ability No Target",
        "Affects Self"
      ],
      "name": "Enlighten",
      "description": "Grants you 700 experience plus 135 per tome consumed by your team."
    }
  ],
  "cost": "150",
  "description": "That which raises beast to man and man to god.",
  "tips": [
    "Because Tome is relatively cheap for the amount of experience it provides, it is generally advisable for someone on your team to buy and use it about as soon as each one becomes available.",
    "Because it takes more and more experience to level up the more a hero levels, the experience bonus is technically more relevant the lower its user's level. For example, a hero that is nearly lvl 5 can use Tome to jump all the way to level 6, while a hero that is lvl 24 might receive about 1\/3 of a level from the same tome.",
    "It is recommended that your team allow the first tome to be consumed by someone that is not yet Lvl 6. Ideally, they then use their newly acquired ultimate ability to make a play (such as, to kill an enemy hero) for immediate pay-off.",
    "What your team uses any further tomes for is more debatable. Tomes can be used to put your core heroes even further ahead, or they can be used to help your lower-leveled heroes catch up. In general, they should be used to help your team achieve key hero levels, namely 6\/12\/18 (for ultimates) and 10\/15\/20\/25 (for talents). Keep in mind that some ultimate\/talent upgrades are worth much more than others."
  ],
  "attrs": [
    "Active Enlighten",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "Becomes available for purchase at the 10 minute mark.",
    "Tome of Knowledge is limited to a stock of 3 in the store. It takes 10 minutes for 1 tome to replenish in the stock.",
    "Stacks with itself in the inventory. There is no stack limit. The sell value adapts based on the number of instances in the stack.",
    "Tomes of Knowledge are fully sharable."
  ]
}