{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Enemy Missing Health Threshold: 10%",
        "Attack Damage Bonus per 10% Health Missing: 10"
      ],
      "notes": [
        "Works against any unit, including buildings, wards, and allies.",
        "Dark Mercy is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to wielder's attack damage. The attack damage bonus values are not considered by critical strike and cleave. However, it is considered by lifesteal, and it can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to wielder's attack damage.",
        "The attack damage bonus values are not considered by critical strike and cleave.",
        "However, it is considered by lifesteal, and it can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Grants the user 10\/20\/30\/40\/50\/60\/70\/80\/90 attack damage if their target is at less than 90%\/80%\/70%\/60%\/50%\/40%\/30%\/20%\/10% health."
      ],
      "mana": null,
      "abilityName": "Dark Mercy",
      "cooldown": null,
      "description": "Your attacks deal 10 more damage to enemies for each 10% HP they are missing.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Brigand's Blade",
  "description": "An infamous assassin's blade stolen and smuggled out of White Spire after its owner's mysterious demise.",
  "trivia": [
    "This item's internal name is \"Misericorde\"."
  ],
  "upgradeIn": null,
  "tips": null
}