{
  "abilities": [
    {
      "notes": [
        "The attack range talent also affects the cast range of Searing Arrows, and the range of Burning Barrage.",
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Clinkz's magic resistance to 34%.",
        "Increases Clinkz's magic resistance to 34%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Searing Arrows Multishot",
          "talentRight": "+50\/5% Death Pact Health\/Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+2 Burning Barrage arrows",
          "talentRight": "+125 Attack Range"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 Searing Arrows Damage",
          "talentRight": "-5s Skeleton Walk Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1.75 Mana Regen",
          "talentRight": "+12% Magic Resistance"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c6\/Clinkz_Burning_Barrage.mp3\/revision\/latest?cb=20210823213542",
      "effects": [
        "Ability Target Point \/ Channeled",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "The arrows fly at a speed of 1200, and always fly the full distance. The speed is not affected by projectile speed increasing effects.",
        "The speed is not affected by projectile speed increasing effects.",
        "The cast range and arrows' travel distance is affected by attack range bonuses, but not by cast range bonuses.",
        "Releases the arrows in 0.5\/0.48\/0.46\/0.45 (TagTalent 0.3\/0.32\/0.33\/0.34)-second intervals, starting immediately upon channel begin. This means it takes total of 1\/1.43\/1.84\/2.25 (TagTalent 1.2\/1.58\/1.97\/2.36) seconds to release all arrows.",
        "This means it takes total of 1\/1.43\/1.84\/2.25 (TagTalent 1.2\/1.58\/1.97\/2.36) seconds to release all arrows.",
        "The arrows are released from the tip of the bow, not from Clinkz's center point. This results in the first launched arrow being offset slightly towards Clinkz's left side as compared to the following arrows.",
        "This results in the first launched arrow being offset slightly towards Clinkz's left side as compared to the following arrows.",
        "Causes Clinkz to perform instant attacks on enemies within hit by the arrows. These instant attacks can proc any attack modifiers and on-hit effects normally. They have True Strike, and completely ignore disarms. The arrows always apply the current level of Searing Arrows, regardless of whether they are currently castable or not. The Searing Arrows applied by Burning Barrage do not cost any mana. The Searing Arrows multishot talent is not applied to these Searing Arrows.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They have True Strike, and completely ignore disarms.",
        "The arrows always apply the current level of Searing Arrows, regardless of whether they are currently castable or not.",
        "The Searing Arrows applied by Burning Barrage do not cost any mana.",
        "The Searing Arrows multishot talent is not applied to these Searing Arrows.",
        "The arrows provide 200 radius flying vision around them as they travel."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "Q",
      "cooldown": "28\/24\/20\/16",
      "description": "Clinkz channels for 1.5\/1.9\/2.3\/2.7s shooting 3\/4\/5\/6 piercing arrows in the target direction up to 750\/800\/850\/900 distance away that hit all enemy units applying 60% of Clinkz' attack damage and attack modifiers.",
      "spellName": "Burning Barrage",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 750\/800\/850\/900 (TagTalent 875\/925\/975\/1025)",
        "Arrows Travel Distance: 750\/800\/850\/900 (TagTalent 875\/925\/975\/1025)",
        "Arrows Collision Radius: 200",
        "Max Channel Time: 1.5\/1.9\/2.3\/2.7",
        "Number of Arrows: 3\/4\/5\/6 (TagTalent 5\/6\/7\/8)",
        "Attack Damage as Damage: 60%"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "It's hard to say whether the blur around the Bone Fletcher is from his flaming heart or his speed with the quiver."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Clinkz_Searing_Arrows_1.mp3\/revision\/latest?cb=20191216012119",
      "effects": [
        "Ability Target Unit \/ Autocast",
        "Affects Enemies",
        "Damage Physical (TagAghanim Instant Attack)"
      ],
      "notes": [
        "The cast range of Searing Arrows is based on the attack range of the caster. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses. The bonus attack range talent increases the cast range to 750.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "The bonus attack range talent increases the cast range to 750.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "Can be cast on buildings but not on wards and allied units.",
        "The damage increasing talent immediately upgrades all of Clinkz's currently flying Searing Arrows.",
        "With the level 25 talent, whenever Searing Arrows is used, a different random target within its cast range is also targeted by a second Searing Arrow. Causes Clinkz to perform an instant attack on the chosen target whenever he launches a Searing Arrow. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike. Since it uses the ability's cast range, effects which increase its cast range increase the secondary arrows' range as well. The secondary arrow has no target priorities. It simply chooses a random valid target within cast range. Since Searing Arrows affects buildings, the secondary arrows can target buildings as well.",
        "Causes Clinkz to perform an instant attack on the chosen target whenever he launches a Searing Arrow.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike.",
        "Since it uses the ability's cast range, effects which increase its cast range increase the secondary arrows' range as well.",
        "The secondary arrow has no target priorities. It simply chooses a random valid target within cast range.",
        "Since Searing Arrows affects buildings, the secondary arrows can target buildings as well."
      ],
      "mana": "10",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Imbues Clinkz's arrows with fire for extra damage.",
      "spellName": "Searing Arrows",
      "params": [
        "Cast Range: 625 (TagTalent 750)",
        "Damage: 24\/36\/48\/60 (TagTalent 54\/66\/78\/90)",
        "Arrows per Cast: 1 (TagTalent 2)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Clinkz simply lights his arrows from his flaming essence for quite the destructive effect."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Clinkz_Skeleton_Walk.mp3\/revision\/latest?cb=20191216012121",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Skeleton Walk does not interrupt Clinkz' channeling abilities upon cast.",
        "During the fade time, Clinkz can cast abilities, use items and perform attacks without breaking the invisibility.",
        "Invisibility is broken upon launching an attack, or upon reaching the cast point of items and abilities, except for Death Pact.",
        "Allows Clinkz to path through other units, including wards, but not through buildings.",
        "Clinkz can pick up or drop items without breaking the invisibility.",
        "With Aghanim's Shard, the 2 Skeleton Archers spawn 250 range away from Clinkz to his right and left side, facing the same direction. The archers only spawn upon losing the Skeleton Walk buff, no matter how. The archers are the same as the ones summoned by Burning Army. See below for their stats.",
        "The archers only spawn upon losing the Skeleton Walk buff, no matter how.",
        "The archers are the same as the ones summoned by Burning Army. See below for their stats."
      ],
      "mana": "75",
      "hotKey": "E",
      "cooldown": "20\/19\/18\/17 (TagTalent 15\/14\/13\/12)",
      "description": "Clinkz moves invisibly through units until the moment he attacks or uses items.",
      "spellName": "Skeleton Walk",
      "params": [
        "Cast Animation: 0+0",
        "Fade Time: 0.6",
        "Move Speed Bonus: 15%\/30%\/45%\/60%",
        "Invisibility Duration: 25\/30\/35\/40",
        "Number of Archers: 2",
        "Archers Duration: 45",
        "Causes Skeleton Walk to create two Burning Army Skeletons."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "With a burst of fire and puff of smoke, the Bone Fletcher was nowhere to be seen."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Clinkz_Burning_Army.mp3\/revision\/latest?cb=20210424153341",
      "effects": [
        "Ability Target Point \/ Vector Targeting",
        "Affects Enemy Heroes"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. In Ability Draft, Burning Army can be unlocked by the player that drafted Death Pact.",
        "In Ability Draft, Burning Army can be unlocked by the player that drafted Death Pact.",
        "Burning Army can be cast without having to face towards the targeted area.",
        "Spawns the archers in the given line one after another, starting immediately upon cast. It takes 2 seconds for all archers to spawn.",
        "It takes 2 seconds for all archers to spawn.",
        "The first archer spawns at the initial targeted location. Following archers spawn with 312.5 in between each. The archers spawn facing the same direction as Clinkz does as they spawn.",
        "The archers spawn facing the same direction as Clinkz does as they spawn.",
        "The archers cannot be controlled. They automatically attack nearby enemy heroes, regardless of auto-attack settings. The archers only attack heroes, including illusions and clones, excluding creep-heroes. The archers only switch their attack targets when their current target cannot be attacked anymore.",
        "The archers only attack heroes, including illusions and clones, excluding creep-heroes.",
        "The archers only switch their attack targets when their current target cannot be attacked anymore.",
        "The archers' base attack damage is periodically set equal to Clinkz' main attack damage. The archers also gain bonus damage for raw damage bonuses Clinkz has.",
        "The archers also gain bonus damage for raw damage bonuses Clinkz has.",
        "The attack range of the archers is also periodically set equal to Clinkz' attack range.",
        "The archers have Searing Arrows, based on its current level. The level for the ability is set for each archer as it spawns. Leveling it afterwards does not update its level on the archers. Although having a mana pool, the archers do not need mana to cast it. The archers fully benefit from the Searing Arrows damage increasing and Searing Arrows multishot talents. In Ability Draft, Searing Arrows must be drafted as well for the archers to gain them.",
        "The level for the ability is set for each archer as it spawns. Leveling it afterwards does not update its level on the archers.",
        "Although having a mana pool, the archers do not need mana to cast it.",
        "The archers fully benefit from the Searing Arrows damage increasing and Searing Arrows multishot talents.",
        "In Ability Draft, Searing Arrows must be drafted as well for the archers to gain them.",
        "The archers do not block neutral creep camps.",
        "The Skeleton Archers' attack damage is not reduced by Damage Block."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "80",
      "description": "Clinkz summons an army of fiery ranged skeleton archers. Archers are immobile and die with 2 attacks from a hero. Skeletons deal a percentage of Clinkz' damage, use his current Searing Arrows ability and attack only heroes. Attack range is equal to Clinkz's attack range.",
      "spellName": "Burning Army",
      "params": [
        "Cast Animation: 0+0.67",
        "Cast Range: 1200",
        "Spawn Range: 1300",
        "Number of Archers: 5",
        "Archers Spawn Interval: 0.5",
        "Hero Attacks to Destroy: 2",
        "Non-Hero Attacks to Destroy: 8",
        "Archers Attack Interval: 1.6",
        "Archers Attack Damage: 30%",
        "Duration: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Existing on the brink of life and death, Clinkz has learned to temporarily bridge the gap between the two."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/75\/Clinkz_Death_Pact.mp3\/revision\/latest?cb=20200502135132",
      "effects": [
        "Ability Target Unit",
        "Affects Enemy Units \/ Self",
        "Damage Instant Kill"
      ],
      "notes": [
        "Can be cast without breaking the invisibility of Skeleton Walk.",
        "Despite the description, the bonuses are based on the target's maximum health, not current health.",
        "The targeted unit is instantly killed, counting as a regular last hit or deny.",
        "Increases Clinkz' maximum health without keeping the current health percentage, then heals Clinkz for the same amount.",
        "When the Death Pact buff expires, Clinkz' maximum health returns to normal, but his current health is kept, without exceeding his maximum health.",
        "The attack damage bonus is added as raw attack damage, so it is not affected by most percentage-based damage increasing or reducing effects.",
        "Successive casts of Death Pact do not stack, but refresh the duration and update the values. The health and damage increasing talent does not update an already existing buff.",
        "The health and damage increasing talent does not update an already existing buff.",
        "Cannot be cast on ancient creeps and creep-heroes."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "80\/70\/60",
      "description": "Clinkz consumes the target enemy unit or friendly unit, gaining max health and damage based on its current health.",
      "spellName": "Death Pact",
      "params": [
        "Cast Animation: 0.2+0.47",
        "Cast Range: 900",
        "Target Max Health as Health Bonus: 40%\/70%\/100% (TagTalent 90%\/120%\/150%)",
        "Target Max Health as Attack Damage Bonus: 4%\/8%\/12% (TagTalent 9%\/13%\/17%)",
        "Duration: 65",
        "Grants a new ability: Burning Army."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Sutherex' bond of life and death has become a part of Clinkz, and his old bones are refreshed with repetition of the pact on lesser beings."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 16.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.7,
    "attrAgility": 22.0
  },
  "description": "Clinkz, the Bone Fletcher, is a ranged agility hero specializing in ambushing lone enemies due to his high physical damage and incredible speed. Though frail and easy to kill, Skeleton Walk grants Clinkz stealth and haste to escape and re-position himself. This skill is also what makes Clinkz such an incredible ganker. This assassin is also equipped with Death Pact which consumes an enemy unit or creep for bonus health and an armor debuff. Searing Arrows provide huge bonus damage, greatly injuring enemies. To aid his assault, Clinkz can summon a Burning Army of fiery bone archers who cut down his foes with powerful arrows.",
  "history": "At the base of the Bleeding Hills stretches a thousand-league wood, a place called The Hoven, where black pools gather the tarry blood of the uplands, and the king-mage Sutherex sits in benevolent rule. Once a sworn protector of the Hoven lands, Clinkz earned a reputation for his skill with a bow. In the three-hundredth year of the king-mage, the demon Maraxiform rose from sixth hell to lay claim to the forest. In response, the king-mage decreed an unbreakable spell: to any who slew the demon would be granted Life Without End. Unaware of the spell, Clinkz waded into battle, defending his lands against the demon's fiery onslaught. Clinkz drove Maraxiform back to the gates of sixth-hell itself, where on that fiery threshold the two locked in a mortal conflict. Grievously wounded, the demon let out a blast of hellfire as Clinkz loosed his final arrow. The arrow struck the demon true as hellfire poured out across the land, lighting the black pools and burning Clinkz alive at the instant of the demon's death. Thus, the mage's spell took effect at the very moment of the archer's conflagration, preserving him in this unholy state, leaving him a being of bones and rage, caught in the very act of dying, carrying hell's breath with him on his journey into eternity.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Searing Arrows Multishot",
      "talentRight": "+50\/5% Death Pact Health\/Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+2 Burning Barrage arrows",
      "talentRight": "+125 Attack Range"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 Searing Arrows Damage",
      "talentRight": "-5s Skeleton Walk Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1.75 Mana Regen",
      "talentRight": "+12% Magic Resistance"
    }
  ]
}