{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.",
        "The armor talent does not benefit illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+0.6s Rolling Boulder Stun Duration",
          "talentRight": "Geomagnetic Grip Targets Allies"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+3 Geomagnetic Grip Silence Duration",
          "talentRight": "+18% Spell Amplification"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+120 Rolling Boulder Damage",
          "talentRight": "+8 Armor"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+60 Damage",
          "talentRight": "+325 Rolling Boulder Distance"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fe\/Earth_Spirit_Boulder_Smash_1.mp3\/revision\/latest?cb=20191216012735",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "Boulder Smash has different targeting rules based on whether Earth Spirit wants to smash a distant remnant, nearby remnant or a unit.",
        "Smashing a distant remnant: To do this, the ground must be targeted. There must be a Stone Remnant within 200 radius around the targeted point. If a remnant is found, he walks towards the point until the remnant is within 200 range. Any remnant he meets on the way are ignored. Only the closest remnant to the targeted point is smashed. Upon reaching the remnant, he smashes it towards the direction he approached it from.",
        "To do this, the ground must be targeted. There must be a Stone Remnant within 200 radius around the targeted point.",
        "If a remnant is found, he walks towards the point until the remnant is within 200 range.",
        "Any remnant he meets on the way are ignored. Only the closest remnant to the targeted point is smashed.",
        "Upon reaching the remnant, he smashes it towards the direction he approached it from.",
        "Smashing a nearby remnant: To do this, the ground must be targeted. There must not be a Stone Remnant within 200 radius around the targeted point. There must be a Stone Remnant within 200 radius around Earth Spirit. Boulder Smash has a default cast range of 2000. This range allows him to aim the Stone Remnant precisely. When targeting beyond 2000 range, he walks up until the point is within range. If there is a remnant nearby, he smashes it.",
        "To do this, the ground must be targeted. There must not be a Stone Remnant within 200 radius around the targeted point.",
        "There must be a Stone Remnant within 200 radius around Earth Spirit.",
        "Boulder Smash has a default cast range of 2000. This range allows him to aim the Stone Remnant precisely.",
        "When targeting beyond 2000 range, he walks up until the point is within range. If there is a remnant nearby, he smashes it.",
        "Smashing a unit: To do this, the unit must be directly targeted. There must not be a Stone Remnant between Earth Spirit and the targeted unit. He walks up until the target is within 150 range and smashes it towards the direction he approached the target from. If he meets a remnant while walking up to the target, he smashes the remnant towards the targeted unit instead.",
        "To do this, the unit must be directly targeted.",
        "There must not be a Stone Remnant between Earth Spirit and the targeted unit.",
        "He walks up until the target is within 150 range and smashes it towards the direction he approached the target from.",
        "If he meets a remnant while walking up to the target, he smashes the remnant towards the targeted unit instead.",
        "Boulder Smash first applies the damage, then the knockback debuff. Smashed remnants first applies the damage, then the slow debuff. The slow is applied to all enemy units within the radius of a smashed remnant. A smashed unit is not and does not slow.",
        "The slow is applied to all enemy units within the radius of a smashed remnant. A smashed unit is not and does not slow.",
        "Damage is applied to all enemy units within the radius of a smashed Stone Remnant or smashed unit. The smashed enemy is damaged instantly on cast. Smashed allies are not damaged.",
        "The smashed enemy is damaged instantly on cast.",
        "Smashed allies are not damaged.",
        "Smashed units are not disabled during the knockback, and are able to act freely during it. Does not interrupt channeling abilities.",
        "Cannot be cast on ancient creeps.",
        "Can move units and Stone Remnants over impassable terrain.",
        "Destroys trees which the targeted units or Stone Remnant collide with during the knockback.",
        "With Aghanim's Scepter, when Earth Spirit is enchanted by Enchant Remnant, Boulder Smash turns into a non-targeted ability and automatically casts on himself when used. ↓↓ Double-tapping automatically target self.",
        "↓↓ Double-tapping automatically target self."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "22\/18\/14\/10",
      "description": "Earth Spirit smashes the target enemy or ally, sending them in the direction he is facing. If Earth Spirit targets an area, he will smash the nearest Stone Remnant in a 200 radius. The travelling unit or Remnant damages all enemy units it hits. If an enemy is hit by a Stone Remnant, they are also slowed. Stone Remnants travel further than other units.",
      "spellName": "Boulder Smash",
      "params": [
        "Cast Animation: 0.01+0",
        "Unit Cast Range: 150",
        "Stone Cast Range: 200",
        "Damage & Slow Radius: 180",
        "Damage: 105\/170\/235\/300",
        "Knockback Speed: 900",
        "Unit Knockback Distance: 480\/600\/680\/800",
        "Stone Knockback Distance: 2000",
        "Stone Move Speed Slow: 50%",
        "Stone Slow Duration: 1.25\/2.5\/3.25\/4",
        "Cannot target spell immune units. Does not attempt to damage or slow spell immune enemies. Can target spell immune units under the effect of Enchant Remnant.",
        "Blocked fully only when primary target.",
        "It is with the power of a mountain that Earth Spirit strikes his enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "It is with the power of a mountain that Earth Spirit strikes his enemies."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/28\/Earth_Spirit_Rolling_Boulder_1.mp3\/revision\/latest?cb=20191216012726",
      "effects": [
        "Ability Target Point",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Rolls at a speed of 800 and always rolls the full 750 (TagTalent 1075) distance within 0.94 (TagTalent 1.34) seconds when not colliding with an enemy hero.",
        "When rolling over a Stone Remnant, the rolling speed is doubled, and the total rolling distance is increased to 1500 (TagTalent 2150). The stun duration also gets increased to 0.8\/1.2\/1.6\/2 (TagTalent 1.4\/1.8\/2.2\/2.6)",
        "The stun duration also gets increased to 0.8\/1.2\/1.6\/2 (TagTalent 1.4\/1.8\/2.2\/2.6)",
        "The stun is applied to all enemy units (except for Couriers) in the path, not just the hero it collides with.",
        "Rolling Boulder first applies the damage, then the debuff.",
        "While rolling, Earth Spirit is rooted and disarmed, so he cannot move, blink or attack during it. Other abilities and items can be used normally while rolling, except for Rolling Boulder, which cannot be re-cast while rolling.",
        "Other abilities and items can be used normally while rolling, except for Rolling Boulder, which cannot be re-cast while rolling.",
        "Earth Spirit is placed 80 range away from an enemy hero upon colliding, on the opposite side he collided into them from.",
        "Does not affect invulnerable units and heroes. Cannot collide with invulnerable heroes. Fully affects invisible units.",
        "Can move Earth Spirit over impassable terrain. Destroys trees Earth Spirit collides with while rolling.",
        "Rolling Boulder is canceled when Earth Spirit gets stunned, cycloned, hexed, slept, hidden, feared, hypnotized or hit by Forced Movement at any time during it. It is not canceled by taunts. Instead, Earth Spirit starts attacking the taunting unit once the rolling stops. Non-disabling forced movement does not cancel it when applied while stationary, but does once the rolling begins.",
        "It is not canceled by taunts. Instead, Earth Spirit starts attacking the taunting unit once the rolling stops.",
        "Non-disabling forced movement does not cancel it when applied while stationary, but does once the rolling begins."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "16\/12\/8\/4",
      "description": "Earth Spirit gathers himself into a boulder and, after a 0.6s delay, rolls toward the target location, damaging and stunning enemy units. He will stop if he collides with an enemy hero or is stunned. If he rolls over a Stone Remnant, he will travel further and faster, and stun enemies for longer.",
      "spellName": "Rolling Boulder",
      "params": [
        "Cast Animation: 0.01+0",
        "Cast Range: 3000",
        "Effect & Collision Radius: 160",
        "Effect Delay: 0.6",
        "Default Roll Distance: 750 (TagTalent 1075)",
        "Stone Roll Distance: 1500 (TagTalent 2150)",
        "Damage: 70\/90\/110\/130 (TagTalent 190\/210\/230\/250)",
        "Stun Duration: 0.4\/0.6\/0.8\/1 (TagTalent 1\/1.2\/1.4\/1.6)",
        "Stone Stun Duration Bonus: 0.4\/0.6\/0.8\/1",
        "Collides with, and attempts to damage spell immune enemies.",
        "Getting rooted while already rolling does not cancel the rolling.",
        "Calling upon his connection to the land, the Earth Spirit draws loose stone to him, which forms a protective ball that he can use to roll short distances."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Calling upon his connection to the land, the Earth Spirit draws loose stone to him, which forms a protective ball that he can use to roll short distances."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1a\/Earth_Spirit_Geomagnetic_Grip_1.mp3\/revision\/latest?cb=20191216012714",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies (TagAghanim Allies)",
        "Damage Magical"
      ],
      "notes": [
        "This ability is not available in Ability Draft.",
        "When targeting ground, a Stone Remnant within 180 radius of the targeted point is pulled. When no Stone Remnants are within the range, nothing happens. The ability is not cast. When cast on allies or Stone Remnants affected by Boulder Smash, the smash gets canceled out by the grip.",
        "When no Stone Remnants are within the range, nothing happens. The ability is not cast.",
        "When cast on allies or Stone Remnants affected by Boulder Smash, the smash gets canceled out by the grip.",
        "In order to pull a unit, it has to be targeted directly. Cannot target allied heroes and treats creep-heroes as creeps. With the level 25 talent, Geomagnetic Grip can target allied heroes.",
        "With the level 25 talent, Geomagnetic Grip can target allied heroes.",
        "Silence is applied to all enemy units within the radius of a pulled unit or remnant.",
        "Damage is applied to all enemy units within the radius of a pulled Stone Remnant. A pulled unit is not damaged and does no damage.",
        "Targeted units are not disabled during the pull. They are able to turn, attack, cast abilities and use items. Geomagnetic Grip does not interrupt the target's channeling abilities. Destroys trees within 200 radius around the targeted unit during the pull.",
        "Geomagnetic Grip does not interrupt the target's channeling abilities.",
        "Destroys trees within 200 radius around the targeted unit during the pull.",
        "Geomagnetic Grip does not pull the target if it is affected by Black Hole, Chronosphere, Duel, or Flaming Lasso. In the last two cases, it does not even pull the target if it is affected by Enchant Remnant.",
        "In the last two cases, it does not even pull the target if it is affected by Enchant Remnant.",
        "The pulled remnant first applies the debuff, then the damage.",
        "Can move Stone Remnants and allies over impassable terrain."
      ],
      "mana": "100",
      "hotKey": "E",
      "cooldown": "13",
      "description": "Earth Spirit pulls the target Stone Remnant. Enemies struck by the gripped target will be silenced and take damage.",
      "spellName": "Geomagnetic Grip",
      "params": [
        "Cast Animation: 0.01+0",
        "Cast Range: 1100",
        "Effect Radius: 180",
        "Stone Damage: 50\/100\/150\/200",
        "Stone Pull Speed: 900",
        "Unit Pull Speed: 600",
        "Silence Duration: 2\/2.5\/3\/3.5 (TagTalent 5\/5.5\/6\/6.5)",
        "Cannot target spell immune units. Does not attempt to damage or silence spell immune enemies. Silence persists if debuff was placed before spell immunity and when not dispelled. Can target spell immune units under the effect of Enchant Remnant.",
        "Not blocked when cast on an enemy hero affected by Enchant Remnant.",
        "Like calls to like. Even the minerals found in the blood and bones of living beings are not immune to the call of the Earth Spirit."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Like calls to like. Even the minerals found in the blood and bones of living beings are not immune to the call of the Earth Spirit."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b8\/Earth_Spirit_Stone_Remnant_1.mp3\/revision\/latest?cb=20191216012730",
      "effects": [
        "Ability Target Point"
      ],
      "notes": [
        "This is an innate ability and does not need to be skilled. In Ability Draft, Stone Remnant is bound to Magnetize, and is granted to the player that drafts it.",
        "In Ability Draft, Stone Remnant is bound to Magnetize, and is granted to the player that drafts it.",
        "Earth Spirit begins the game with all 7 charges. When acquiring Aghanim's Shard, he immediately gains the extra charges as well.",
        "When acquiring Aghanim's Shard, he immediately gains the extra charges as well.",
        "↓↓ Double-tapping places a Stone Remnant 100 range in front of Earth Spirit.",
        "It is possible to have up to 7 (13) remnants when placing all 7 (11) remnants at once, and then every time after the 25 seconds recharge.",
        "Remnants cannot be attacked or destroyed by anyone. They may only be destroyed by Rolling Boulder, Magnetize or by expiring. When used by Magnetize, the remnant remains for 8 seconds before crumbling down. Rolling Boulder destroys them instantly.",
        "When used by Magnetize, the remnant remains for 8 seconds before crumbling down.",
        "Rolling Boulder destroys them instantly.",
        "Rubick is unable to steal Stone Remnant with Spell Steal. An enemy Rubick can make use of the same remnants when stealing and using one of Earth Spirit's abilities.",
        "An enemy Rubick can make use of the same remnants when stealing and using one of Earth Spirit's abilities.",
        "Stone Remnants can be seen through the Fog of War by all players.",
        "Enemies can also see and hear the following effects through the Fog of War: Stone Remnants being smashed by Boulder Smash. Stone Remnants being consumed by Rolling Boulder to roll farther. Stone Remnants being pulled by Geomagnetic Grip.",
        "Stone Remnants being smashed by Boulder Smash.",
        "Stone Remnants being consumed by Rolling Boulder to roll farther.",
        "Stone Remnants being pulled by Geomagnetic Grip.",
        "With Aghanim's Shard, Stone Remnant provides ground vision. Instantly grants 4 charges as well. However, even with Aghanim's Shard, it does not instantly grant Morphling the extra charges upon Morph. Alt creates a range indicator around all Stone Remnants, showing their vision range.",
        "Instantly grants 4 charges as well.",
        "However, even with Aghanim's Shard, it does not instantly grant Morphling the extra charges upon Morph.",
        "Alt creates a range indicator around all Stone Remnants, showing their vision range."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Call a Stone Remnant to the target location. Stone Remnants have no vision and are invulnerable, and can be used with Earth Spirit's abilities. Calling a Stone Remnant consumes a charge, which recharge over time.",
      "spellName": "Stone Remnant",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 1100",
        "Remnant Duration: 60",
        "Number of Charges: 7 (TagTalent 11)",
        "Charge Replenish Time: 25",
        "Vision Radius: 375",
        "Grants a new ability: Enchant Remnant.",
        "Causes Stone Remnant to provide 375 ground vision. Increases charge count by 4.",
        "Earth Spirit calls forth a remnant of his stone army, long buried with him in the dark embrace of the Earth."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Earth Spirit calls forth a remnant of his stone army, long buried with him in the dark embrace of the Earth."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b1\/Earth_Spirit_Enchant_Remnant.mp3\/revision\/latest?cb=20191216012740",
      "effects": [
        "Ability Target Unit",
        "Affects Enemy Heroes \/ Allied Heroes",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. In Ability Draft, Enchant Remnant can be unlocked by the player that drafted Magnetize.",
        "In Ability Draft, Enchant Remnant can be unlocked by the player that drafted Magnetize.",
        "Can be cast on any hero, allied and enemies. Can be cast on illusions and clones, but not on creep-heroes. ↓↓ Double-tapping automatically target self. When Earth Spirit is enchanted, Boulder Smash turns into a non-targeted ability and automatically casts on himself when used.",
        "↓↓ Double-tapping automatically target self.",
        "When Earth Spirit is enchanted, Boulder Smash turns into a non-targeted ability and automatically casts on himself when used.",
        "Provides True Sight over the target for the full duration.",
        "An enchanted hero is fully disabled, invulnerable and reacts on Earth Spirit's abilities just like a regular Stone Remnant. Boulder Smash: Enchanted heroes are knocked back for 2000 distance and slow and damage enemies they collide with. Rolling Boulder: Enchanted heroes boost the rolling, ending the enchantment early. Earth Spirit does not collide with them. Geomagnetic Grip: Enchanted heroes are pulled at a speed of 900 and apply the damage. Can pull enchanted enemies. Magnetize: Enchanted heroes receive, refresh and spread Magnetize when within its stone search radius.",
        "Boulder Smash: Enchanted heroes are knocked back for 2000 distance and slow and damage enemies they collide with.",
        "Rolling Boulder: Enchanted heroes boost the rolling, ending the enchantment early. Earth Spirit does not collide with them.",
        "Geomagnetic Grip: Enchanted heroes are pulled at a speed of 900 and apply the damage. Can pull enchanted enemies.",
        "Magnetize: Enchanted heroes receive, refresh and spread Magnetize when within its stone search radius.",
        "If the enchantment expires during Boulder Smash, the unit still moves the full distance, but stops applying the slow. If the enchantment expires while an enemy is being smashed back, they take the boulder smash damage, but are not slowed.",
        "If the enchantment expires while an enemy is being smashed back, they take the boulder smash damage, but are not slowed.",
        "If the enchantment expires during Geomagnetic Grip, it still is pulled at the higher speed, but stops applying the damage.",
        "Can be cast on Stone Remnants as well, using the lower cooldown when doing so. The Stone Remnant cannot expire while affected by Enchant Remnant. However, it gets destroyed once Enchant Remnant expires on it.",
        "The Stone Remnant cannot expire while affected by Enchant Remnant. However, it gets destroyed once Enchant Remnant expires on it.",
        "The area damage at the end hits all enemies, not just heroes."
      ],
      "mana": "150",
      "hotKey": "F",
      "cooldown": "45\/5",
      "description": "Earth Spirit temporarily enchants a hero, granting them the properties of a Stone Remnant. After 3 seconds the remnant shatters, releasing the hero and damaging nearby enemies. Can be used on Earth Remnants. Has a 5 second cooldown when used that way.",
      "spellName": "Enchant Remnant",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range: 125",
        "Damage Radius: 450",
        "Damage: 450",
        "Duration: 3",
        "Can be cast on spell immune allies. Cannot be cast on spell immune enemies. Does not attempt to damage spell immune enemies.",
        "Kaolin uses the elemental power of the Earth to temporarily petrify living beings, so that they might be conscripted into his stone funerary army."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Kaolin uses the elemental power of the Earth to temporarily petrify living beings, so that they might be conscripted into his stone funerary army."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/47\/Earth_Spirit_Magnetize_1.mp3\/revision\/latest?cb=20191216012717",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Checks for nearby Stone Remnants in 0.5-second intervals, starting 0.5 seconds after cast.",
        "If a remnant is found near an affected unit, Magnetize gets spread to enemies within a 600 radius around the remnant. If an enemy within range already was affected by Magnetize, it gets the debuff refreshed instead.",
        "If an enemy within range already was affected by Magnetize, it gets the debuff refreshed instead.",
        "Deals 20\/40\/60 damage in 0.5-second intervals, starting 0.5 seconds after cast. Without refreshing the duration once, Magnetize can deal up to 240\/480\/720 damage per affected unit (before reductions).",
        "Without refreshing the duration once, Magnetize can deal up to 240\/480\/720 damage per affected unit (before reductions).",
        "Earth Spirit can still utilize a Stone Remnant for 8 seconds after it has spread Magnetize, before it is destroyed.",
        "The magnetize debuff can be placed on and spread from invisible and invulnerable units, but not on or from hidden units and couriers.",
        "A number is visible above all magnetized enemies, counting down the duration. This is visible to allies only. Refreshing the duration with a Stone Remnant also resets the timer.",
        "Refreshing the duration with a Stone Remnant also resets the timer."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "100\/90\/80",
      "description": "Magnetizes units in a small nearby area, causing them to take damage for a short duration. Magnetized heroes cause nearby Stone Remnants to explode, destroying the remnant and refreshing Magnetize's duration on all nearby enemies. This process can repeat multiple times. If an enemy hero is affected by Geomagnetic Grip or Boulder Smash, all magnetized heroes share the effects.",
      "spellName": "Magnetize",
      "params": [
        "Cast Animation: 0.01+0",
        "Radius: 350",
        "Stone Search Radius: 400",
        "Stone Refresh Radius: 600",
        "Damage per Second: 40\/80\/120",
        "Duration: 6",
        "Places debuff on and attempts to damage spell immune enemies. Can spread to and refresh debuff on spell immune enemies. Does not silence or slow spell immune enemies when another magnetized enemy is hit by Boulder Smash or Geomagnetic Grip.",
        "At the Earth Spirit’s call, the minerals in the blood and bones of his enemies rebel against the bodies they find themselves in."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "At the Earth Spirit’s call, the minerals in the blood and bones of his enemies rebel against the bodies they find themselves in."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.4,
    "attrStrength": 22.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 2.4,
    "attrAgility": 17.0
  },
  "description": "Kaolin, the Earth Spirit, is a melee strength hero with great utility, possessing a wide array of disables in all of his basic abilities.",
  "history": "Deep amid the Upland crags and cliffs there runs a seam of sacred jade long foresworn by highland miners. From this rare material, the likeness of the great general Kaolin was carved and buried at the head of a stone funerary army ten thousand strong—a force of soldiers and holy men, jesters and acrobats, carved by crafstmen and entombed for millennia in the dark embrace of the Earth. What the craftsmen had not known was that within the strange seam of jade flowed the spirit of the Earth itself—an elemental force at one with the planet. When the force within the carved jade found itself cut off from the life's blood of the world, it gathered its strength over the course of a thousand years and dug itself free and into the light. Now the great Kaolin Earth Spirit strides the Upland roads, fighting for the spirit of the Earth; and in times of need calls forth remnants of his buried army still locked in the loving embrace of the soil.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+0.6s Rolling Boulder Stun Duration",
      "talentRight": "Geomagnetic Grip Targets Allies"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+3 Geomagnetic Grip Silence Duration",
      "talentRight": "+18% Spell Amplification"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+120 Rolling Boulder Damage",
      "talentRight": "+8 Armor"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+60 Damage",
      "talentRight": "+325 Rolling Boulder Distance"
    }
  ]
}