{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Abyssal_Blade.mp3\/revision\/latest?cb=20141214201740",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Перемещает заклинателя к цели, случайным образом размещая его вокруг существа.",
        "При телепортации не позволяет избежать снарядов.",
        "Заклинатель получает приказ атаковать цель.",
        "Можно применять на курьеров.",
        "Вопреки визуальным эффектам, эффект мгновенный и не имеет времени полёта."
      ],
      "mana": "75",
      "abilityName": "Overwhelm",
      "cooldown": "35",
      "description": "Перемещает владельца к выбранной вражеской цели и оглушает её на 2 сек. Проходит сквозь невосприимчивость к заклинаниям.",
      "params": [
        "Дальность применения: 550",
        "Длительность оглушения: 2"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Skull_Basher.mp3\/revision\/latest?cb=20141214201224",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Не сочетается с другим Abyssal Blade или Skull Basher.",
        "При наличии нескольких предметов c оглушаюшим ударом, работать будет та которая дольше находится в инвентаре.",
        "Сработавшая атака сначала применяет дебафф, затем наносит свой урон.",
        "Дополнительный урон наносится одним источником вместе с атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "В среднем добавляет 25 урона каждой атаке для героев ближнего боя и 10 урона для героев дальнего боя.",
        "Не действует на варды и строения, но срабатывает на союзных существ.",
        "Bash использует псевдослучайное распределение."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": "2,3",
      "description": "Каждая атака может оглушить цель на 1,5 сек. и нанести 100 магического урона. Вероятность зависит от типа атаки владельца: 25% в ближнем бою, 10% — в дальнем.",
      "params": [
        "Шанс для героев ближнего боя: 25%",
        "Шанс для героев дальнего боя: 10%",
        "Урон: 100",
        "Длительность оглушения: 1,5"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Не действует против вардов (TagTalent Plague Ward, Mass Serpent Ward, Death Ward).",
        "Не уменьшает физический урон от заклинаний, за исключением Moon Glaives и The Swarm.",
        "Damage Block использует псевдослучайное распределение.",
        "Для деталей, смотрите Блокировка урона."
      ],
      "mana": null,
      "abilityName": "Damage Block",
      "cooldown": null,
      "description": "С вероятностью в 50% блокирует 70 урона от атак, если владелец — герой ближнего боя, или 35 урона, если герой дальнего боя.",
      "params": [
        "Шанс срабатывания: 50%",
        "Блокирует урона (ближний бой): 70",
        "Блокирует урона (дальний бой): 35"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 450 здоровья, 11 регенерации здоровья и 35 урона от атаки.",
    "Для героев ловкости, даёт 450 здоровья, 11 регенерации здоровья и 25 урона от атаки.",
    "Для героев интеллекта, даёт 450 здоровья, 11 регенерации здоровья и 25 урона от атаки.",
    "У Slardar, Spirit Breaker или Faceless Void Bash не срабатывает.",
    "У героя с пассивной способностью Time Lock (например в Ability Draft), Bash также не сработает."
  ],
  "cost": "6625",
  "lore": null,
  "consistFrom": [
    "Skull Basher",
    "Vanguard",
    "Recipe"
  ],
  "boughtFrom": "Оружие",
  "name": "Abyssal Blade",
  "description": "Острие потерянного клинка Повелителя бездны впивается врагу прямо в душу.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 к силе",
    "+250 к здоровью",
    "+10 к регенерации здоровья",
    "+25 к урону"
  ],
  "tips": null
}