{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Magic_Stick_Energy_Charge.mp3\/revision\/latest?cb=20191227195452",
      "effects": [
        "Radius: 1200",
        "Charges per Cast Spell: 1",
        "Max Charges: 20",
        "Health and Mana Restored per Charge: 15"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Gains 1 charge whenever a visible enemy unit, including neutral creeps, uses an ability within 1200 radius.",
        "Does not gain charges from toggle abilities, active attack modifiers and the abilities listed here. Does not gain charges from passively triggered abilities (e.g. Quill Spray, Borrowed Time) as well. Does not gain charges when an enemy casts an ability while breaking out from invisibility (e.g. Moonlight Shadow). Can gain charges from Return and Walrus PUNCH!.",
        "Does not gain charges from passively triggered abilities (e.g. Quill Spray, Borrowed Time) as well.",
        "Does not gain charges when an enemy casts an ability while breaking out from invisibility (e.g. Moonlight Shadow).",
        "Can gain charges from Return and Walrus PUNCH!.",
        "With maximum charges, it can restore up to 300 health and mana.",
        "When having multiple Magic Stick-based items in the inventory, only the oldest one will gain charges from cast abilities. If it is full, the second oldest one starts gaining charges. All current charges are carried over when upgrading Magic Stick-based items. Shares cooldown with Magic Stick and Holy Locket.",
        "All current charges are carried over when upgrading Magic Stick-based items.",
        "Shares cooldown with Magic Stick and Holy Locket."
      ],
      "mana": "0",
      "abilityName": "Energy Charge",
      "cooldown": "13",
      "description": "Instantly restores 15 health and mana per charge stored. Max 20 charges. Gains a charge whenever a visible enemy within 1200 range uses an ability.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "60 health and 0.3 health regeneration.",
    "36 mana and 0.15 mana regeneration.",
    "3 attack speed and 0.5 main armor.",
    "3 main attack damage to all \/ \/ heroes."
  ],
  "cost": "450",
  "lore": null,
  "consistFrom": [
    "Magic Stick",
    "Iron Branch",
    "Iron Branch",
    "Recipe"
  ],
  "name": "Magic Wand",
  "description": "A simple wand used to channel magic energies, it is favored by apprentice wizards and great warlocks alike.",
  "trivia": null,
  "upgradeIn": [
    "Holy Locket"
  ],
  "tips": [
    "Magic Wand allows you to get a quick burst of healing in dire situations, or to use one last ability in a fight. Even during the midgame, when the boost is less noticeable, a Magic Wand can still save your life if you are in danger.",
    "The Magic Wand makes an excellent item against heroes that spam abilities while in the lane, as the charges can help to mitigate damage you take, or to cast more of your own abilities.",
    "The Iron Branches needed to build Magic Wand are common to buy early on in the game, giving a suitable route of making a cost effective build, and emptying up the inventory space without having to sell items."
  ]
}