{
  "abilities": [
    {
      "spell": "Shackles the target to an enemy unit or tree in a line directly behind it. If no unit or tree is present, the stun duration is reduced to 0.75.",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Shackleshot travels at a speed of 1650.",
        "The projectile searches for enemies or trees within 46 degrees at the opposite side of the target from where Shackleshot was cast. This means when Windranger blinks away after cast, it latches on targets based on the cast location, not her new location. The complete search area is shaped like a triangle. 575 is the triangle's height. Therefore, the triangle has two sides with a length of 624.66, and the third side has a length of 488.15.",
        "Shackleshot always prioritizes units over trees as a secondary target.",
        "If the target does not get shackled, it is only briefly stunned (using the default Stunned debuff).",
        "If the target gets shackled to a unit, both of them are stunned for the full duration (using the Shackle Shot debuff).",
        "The stun persists, even when the primary or the secondary unit dies, or the tree is destroyed earlier.",
        "The stun also persists, when one of the targets gets freed from the stun earlier.",
        "When the primary target dies before the shackle reaches it, it still can latch to a secondary unit and stun it.",
        "Can latch on invisible units, units in the Fog of War and the trees from Sprout.",
        "The stun duration increasing talent only affects the success stun duration. The fail stun duration is not increased."
      ],
      "mana": "70\/85\/100\/115",
      "elements": [
        "Can be disjointed.",
        "Partially blocked by Linken's Sphere.",
        "Does not pierce spell immunity."
      ],
      "cooldown": "18\/16\/14\/12 ( 12.6\/11.2\/9.8\/8.4)",
      "name": "Shackleshot",
      "description": [
        "Cast Animation: 0.15+0.45",
        "Cast Range: 800",
        "Shackle Search Range: 575",
        "Shackle Search Angle: 46",
        "Max Shackle Targets: 2",
        "Success Stun Duration: 2\/2.6\/3.2\/3.8 ( 3\/3.6\/4.2\/4.8)",
        "Fail Stun Duration: 0.75"
      ],
      "hot_key": "Q",
      "legacy_key": "E"
    },
    {
      "spell": "Windranger charges her bow for up to 1 second for a single powerful shot, which deals more damage the longer it is charged. The arrow damages enemies and destroys trees along its path. For each enemy that Powershot hits, its damage is reduced by 20%.",
      "effects": [
        "Ability Target Point \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The arrow travels at a speed of 3000, taking 0.87 seconds to reach max distance.",
        "The arrow can damage units up to 2725 range away (travel distance + damage radius).",
        "The full damage is done after the full 1 seconds of channeling. Each channeled 0.03 seconds increase its damage by 5\/8.33\/11.67\/15 ( 8.33\/11.67\/15\/18.33).",
        "Every time the arrow hits an enemy, its current damage is reduced by 20%.",
        "This is how much damage a fully channeled arrow deals (before reductions) after hitting up to 10 units:",
        "This is how much it deals with the Powershot damage talent leveled:",
        "To reach 1 damage, the arrow needs to hit 23\/25\/27\/28 ( 25\/27\/28\/29) units.",
        "The arrow provides 400 radius flying vision as it travels, which sticks at its final location for 3.34 seconds.",
        "The arrow destroys trees within 75 radius around it while traveling. Hit trees do not reduce its damage.",
        "The sound of a bow getting stretched during channeling time is audible to allies only."
      ],
      "mana": "90\/100\/110\/120",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "12\/11\/10\/9 ( 8.4\/7.7\/7\/6.3)",
      "name": "Powershot",
      "description": [
        "Cast Animation: 0+0",
        "Cast Range: 2600",
        "Travel Distance: 2600",
        "Damage Radius: 125",
        "Max Channel Time: 1",
        "Maximum Damage: 150\/250\/350\/450 ( 250\/350\/450\/550)",
        "Damage Reduction per Unit Hit: 20%"
      ],
      "hot_key": "W",
      "legacy_key": "R"
    },
    {
      "spell": "Increases movement speed and adds evasion from all physical attacks, while slowing movement of nearby enemies.",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Windrun interrupts Windranger's channeling spells upon cast.",
        "Grants Windranger 100% evasion for its duration. This means attacks with True Strike are not avoided.",
        "The slow is provided by an aura on Windranger. Its debuff lingers for 2.5 seconds.",
        "When the level 20 talent is chosen, Windrun turns Windranger invisible and phased for its duration. During the fade time, Windranger can cast spells, use items and perform attacks without breaking the invisibility. Invisibility is broken upon reaching the cast point of spells or items, or upon launching an attack. The invisibility is provided by a second buff, so breaking it prevents Windranger from going invisible again. Windranger can pick up or drop items without breaking the invisibility."
      ],
      "mana": "50",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "15\/14\/13\/12 ( 10.5\/9.8\/9.1\/8.4)",
      "name": "Windrun",
      "description": [
        "Cast Animation: 0+0",
        "Slow Radius: 325",
        "Move Speed Bonus: 60%",
        "Evasion: 100%",
        "Move Speed Slow: 15%\/20%\/25%\/30% ( 45%\/50%\/55%\/60%)",
        "Invisibility Fade Time: 0 ( 0.2)",
        "Aura Linger Duration: 2.5",
        "Duration: 3\/4\/5\/6"
      ],
      "hot_key": "E",
      "legacy_key": "W"
    },
    {
      "spell": "Windranger channels the wind to gain 400 additional attack speed against a single enemy unit or structure, though with a reduction to her attack damage. Extra damage from secondary item effects is not reduced. Lasts 20 seconds.",
      "effects": [
        "Ability Target Unit",
        "Affects Self"
      ],
      "notes": [
        "The cast range of Focus Fire always equals the caster's attack range. However, this does not include the unlimited range while Hurricane Pike is active.",
        "Focus Fire orders Windranger to attack the target upon cast.",
        "Focus Fire allows Windranger to move while attacking the Focus Fire target.",
        "Windranger will automatically attack the Focus Fire target whenever she is in range, unless she is manually stopped and not moving.",
        "Only reduces Windranger's main and bonus damage when attacking the target. Damage from item effects (e.g. Monkey King Bar, Diffusal Blade) is unaffected.",
        "Windranger can switch attack targets without losing the buff against the Focus Fire target.",
        "When switching attack targets, the attack speed and damage adapt as soon as the attack begins.",
        "Casting Focus Fire on multiple targets only grants the attack speed and damage reduction against the most recent target.",
        "Focus Fire ends prematurely when Windranger dies, but persists through the target's death.",
        "Can be cast on any enemy unit, including buildings, excluding wards, invulnerable or hidden units.",
        "Although the level 25 talent's bash duration is set to 0.01 seconds, it lasts 0.03-0.04 seconds due to the server tick rate limit."
      ],
      "mana": "75\/100\/125",
      "elements": [
        "Blocked by Linken's Sphere.",
        "Partially pierces spell immunity."
      ],
      "cooldown": "70 ( 49) ( 15, 10.5)",
      "name": "Focus Fire",
      "description": [
        "Cast Animation: 0+0",
        "Bash Proc Chance: 0 ( 35%)",
        "Attack Speed Bonus: 400",
        "Attack Damage Reduction: 50%\/40%\/30% ( 30%\/15%\/0%)",
        "Duration: 20",
        "Bash Duration: 0 ( 0.01)"
      ],
      "hot_key": "R",
      "legacy_key": "F"
    }
  ],
  "bio": "The western forests guard their secrets well. One of these is Lyralei, master archer of the wood, and favored godchild of the wind. Known now as Windranger, Lyralei's family was killed in a storm on the night of her birth--their house blown down by the gale, contents scattered to the winds. Only the newborn survived among the debris field of death and destruction. In the quiet after the storm, the wind itself took notice of the lucky infant crying in the grass. The wind pitied the child and so lifted her into the sky and deposited her on a doorstep in a neighboring village. In the years that followed, the wind returned occasionally to the child's life, watching from a distance while she honed her skills. Now, after many years of training, Windranger fires her arrows true to their targets. She moves with blinding speed, as if hastened by a wind ever at her back. With a flurry of arrows, she slaughters her enemies, having become, nearly, a force of nature herself.",
  "talentsTips": [
    "The attack range talent also affects the cast range of Focus Fire.",
    "The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."
  ],
  "trivia": [
    "In DotA, Windranger was known as Alleria, the Windrunner. Alleria Windrunner is a character from the Warcraft universe. In the November 21, 2013 update, her name was changed to \"Windranger\", likely to avoid copyright issues with Blizzard.",
    "Windranger's current name, Lyralei, is a partial anagram of Alleria (one of the A's was replaced with the Y)."
  ],
  "talents": [
    "30% Cooldown Reduction:+35% Ministun Focus Fire",
    "Windrun Grants Invisibility:+1s Shackleshot Duration",
    "+100 Attack Range:+100 Powershot Damage",
    "+30% Windrun Slow:+3 Mana Regen"
  ],
  "desc": "Lyralei, the Windranger, is a ranged intelligence hero that uses powerful abilities in conjunction with her physical attack to take down enemies. Despite being an intelligence Hero, Windranger's playstyle resembles that of an agility Hero, due in large part to her skill set. Windranger is most often played as an offlane solo due to her escape, long range harass, and farm capability; however, she is quite versatile and can be fielded as a midlaner, roamer, lane support, or even a carry, if the game calls for it. She is famous for her immense utility and versatility."
}