{"abilities":[{"spell":"Dark Seer creates a vacuum over the target area that sucks in enemy units, disrupting them and dealing damage.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The pull duration always takes 0.3\/0.4\/0.5\/0.6 seconds, no matter how far or close the units are from the center, so the speed varies.","The damage is applied upon losing the debuff, so that dispelling it causes it to happen earlier.","Affected units are fully disabled during the pull.","Can pull units over impassable terrain.","Fully affects invisible and invulnerable units (exept for units affected by Eul's Scepter of Divinity's Cyclone), but not hidden units.","Does not affect ancient creeps and creep-heroes.","Vacuum destroys trees within 275 radius at the targeted point upon cast, after placing the debuff on enemies."],"mana":"100\/130\/160\/190","elements":["Does not pierce spell immunity."],"cooldown":"60\/50\/40\/30 ( 12)","name":"Vacuum","description":["Cast Animation: 0.4+0.7","Cast Range: 450\/500\/550\/600","Effect Radius: 400\/450\/500\/550 ( 475\/525\/575\/625)","Damage: 50\/100\/150\/200","Pull Duration: 0.3\/0.4\/0.5\/0.6"],"hot_key":"Q","legacy_key":"C"},{"spell":"Surrounds the target unit with a bristling shield that damages enemy units in an area around it.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The shell can be put on enemy and allied units, damaging only enemy units. The unit with the shell itself is not damaged.","Successive casts on the same unit do not stack, but refresh the duration and update the damage to the current level instead. When two opposing heroes cast it on the same target, the modifier updates and starts damaging the enemies of the latest caster. The modifier status, however, does not update. Whether it is treated as a buff or debuff is determined by the first cast, and not updated on refresh.","Deals 2.4\/4.6\/6.8\/9 ( 10.4\/12.6\/14.8\/17) damage in 0.1 second intervals, starting 0.1 second after the cast, resulting in 250 damage instances.","Can deal up to 600\/1150\/1700\/2250 ( 2600\/3150\/3700\/4250) damage to a single unit (before reductions), if it stays in range for the full duration.","Affects invisible units that go close to the shell wearer, however, the visual effects do not appear.","Cannot be cast on creep-heroes or couriers.","Choosing the damage upgrading talent immediately upgrades all of Dark Seer's currently active Ion Shell modifiers."],"mana":"100\/110\/120\/130","elements":["Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"9","name":"Ion Shell","description":["Cast Animation: 0.4+0.7","Cast Range: 600","Damage Radius: 250","Damage per Second: 24\/46\/68\/90 ( 104\/126\/148\/170)","Duration: 25"],"hot_key":"W","legacy_key":"E"},{"spell":"Charges a target friendly unit with power, giving it a brief burst of movement speed and removes unit collisions. Allows the unit to surpass the movement speed limit and cannot be slowed.","effects":["Ability Target Unit ( Target Area)","Affects Allies"],"notes":["Applies a haste on the target, meaning it cannot be slowed while affected.","Also grants the target phased movement, and removes the movement speed limit while affected.","The talent turns Surge into an area-targeted spell, so that it cannot directly target units anymore. Self-casting the ability still targets Dark Seer, centering the AoE around him."],"mana":"50","elements":["Pierces spell immunity."],"cooldown":"16\/14\/12\/10","name":"Surge","description":["Cast Animation: 0.4+0.57","Cast Range: 600","Radius: 0 ( 400)","Movement Speed Bonus: 25%\/40%\/55%\/70%","Duration: 6"],"hot_key":"E","legacy_key":"R"},{"spell":"Raises a wall of warping light that slows and creates replicas of any enemy hero who crosses it. Enemy replicas serve at the Dark Seer's will. Replicas last until they are destroyed, or until the wall's duration ends.","effects":["Ability Target Point \/ Vector Targeting","Affects Enemy Heroes"],"notes":["The values of the wall are set upon creation, and do not update upon leveling the spell further up after having placed the wall. However, Aghanim's Scepter's bonus is applied to the wall immediately. Illusions created while having Scepter get the increased damage.","A wall can only create one illusion per player. There cannot be more than one illusion per player per wall. This means when there are multiple walls up (with the talent, or with multiple casts), each wall can create an illusion for each enemy. This also means that when an enemy has multiple heroes ( Divided We Stand and Tempest Double clones), they are still limited to one illusion per wall. Even if the illusion gets Enchanted, the wall can still not create a new ilusion.","Only creates illusions of real heroes. Does not create illusions of illusions pathing through the wall. Can create illusions of Divided We Stand and Tempest Double clones as well, but not of Wukong's Command clones. Can create the illusions of invulnerable enemies, but not hidden ones. The slow, however, is not placed on invulnerable units.","Upon spawning, the illusions are automatically ordered to attack the heroes they are based on.","When the illusion dies, the wall can create a new illusion of that hero as soon as it comes in range.","Illusions created by Wall of Replica have a static 5 gold and experience bounty which does not scale with levels.","The illusions's duration is based on the remaining duration of the wall from which they originate.","The illusion spawns 108 range away from the hero if the hero has a collision size of 24, and 72 if the collision size is 8. It appears either north, east, south or west from the target.","Wall of Replica illusions are visually distinguishable for the enemies.","The slow is applied constantly within the wall's area. When walls overlap with each, their slows do not stack.","When choosing the parallel wall talent, a second wall is placed 600 range behind the cast location of first wall, parallel to it."],"mana":"125\/250\/375","elements":["Partially pierces spell immunity."],"cooldown":"100","name":"Wall of Replica","description":["Cast Animation: 0.2+0.73","Cast Range: 1300","Number of Walls: 1 ( 2)","Wall Length: 1300 ( 2600)","Wall Width: 50","Parallel Wall Distance: 600","Movement Speed Slow: 50%\/60%\/70%","Illusion Damage Dealt: 70%\/85%\/100%","Illusion Damage Taken: 200%","Duration: 45","Slow Duration: 0.75"],"hot_key":"R","legacy_key":"W"}],"bio":"Fast when he needs to be, and a cunning strategist, Ish'Kafel the Dark Seer requires no edged weapons to vanquish his enemies, relying instead on the strength of his powerful mind. His talent lies in his ability to maneuver the fight to his advantage. Hailing from a place he calls 'The Land behind the wall,' Dark Seer remains an outsider here—a warrior from a realm beyond the veil of this reality. Once a great general among his people, and a valiant defender of the god-king Damathryx, Dark Seer’s army was wiped out by a much larger force in the final days of the Great Boundaries War. Facing certain defeat, he made one last desperate act: he led the enemy forces into the maze between the walls. At the last moment, just before capture, he crossed over—then sealed the walls forever in an explosive release of dark energy. When the dust settled, he saw that he had saved his people but found himself blinking at the sun of a different world, with no way to return. Now he is committed to proving his worth as a military strategist, and vows to show that he’s the greatest tactician this strange new world has ever seen.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The evasion talent stacks multiplicatively with other sources of evasion.","The armor talent does not benefit illusions."],"trivia":["Dark Seer's response, \"Speed is the heart of battle.\" is an indirect quote of Chinese military strategist Sun Tzu, who said \"Quickness is the essence of war.\"","Dark Seer's response, \"No, I will not calm my beard.\" is a response to Beastmaster's and Clockwerk's rival hero taunts, both voiced by Sam A. Mowry.","Dark Seer's Vacuum's lore is based on the military term, center of gravity, which is a concept developed by Carl Von Clausewitz, a Prussian military theorist, in his work On War."],"talents":["400 AoE Surge:Parallel Wall","+80 Ion Shell Damage:+10 Armor","+75 Vacuum AoE:+12 Health Regen","+90 Damage:12% Evasion"],"desc":"Ish'kafel the Dark Seer is a melee intelligence hero who relies on his abilities' potent utility and synergy. In lane he is sustained by high armor and enabled by his Ion Shell and Surge. Surge boosts his or an ally's speed, helping them to escape or pursue opponents. Ion Shell wraps a unit in a spiky shield that rapidly damages nearby enemies, enabling Ish'kafel to harass and gain last hits. These abilities also make him an efficient jungler and therefore a natural semi-carry, usually focused on building utility items."}