{"abilities":[{"spell":"Dark Seer создает вакуум в выбранной области, который втягивает в себя врагов и наносит им повреждения.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Втягивание всегда занимает 0.3\/0.4\/0.5\/0.6 секунды, поэтому не имеет значения, как далеко или близко юниты находятся от центра способности, скорость втягивания будет варьироваться.","Юниты под действием способностью полностью обезврежены на всё время действия стягивания.","Урон наносится после после потери дебаффа, то есть развеивание дебаффа нанесет урон раньше.","Может затянуть юнитов на непроходимую территорию.","Полностью работает на невидимых юнитов, но не работает на неуязвимых.","Не работает на древних крипов и крипов-героев.","Деревья на расстоянии 275 вокруг центра применения Vacuum будут уничтожены."],"mana":"100\/130\/160\/190","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"60\/50\/40\/30 ( 0.00085)","name":"Vacuum","description":["Анимация применения: 0,4+0,7","Дальность применения: 450\/500\/550\/600","Радиус: 400\/450\/500\/550 ( 475\/525\/575\/625)","Урон: 25\/50\/100\/200","Длительность втягивания: 0.3\/0.4\/0.5\/0.6"],"hot_key":"Q","legacy_key":"C"},{"spell":"Окружает выбранную цель колючим щитом, наносящим урон всем врагам вокруг.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Щит можно повесить на вражеских и союзных юнитов, урон нановится только вражеским юнитам. Юнит с щитом не получает урон от него по себе.","Несколько применений щита на одного и того же юнита не складываются. Если на цели заклинания уже есть Ion Shell, то он просто обновит свое время действия.","Наносит 3\/5\/7\/9 ( 18\/20\/22\/24) урона с интервалом в 0.1 секунду спустя 0.1 секунды после применения, срабатывая 250 раз.","Может нанести до 750\/1250\/1750\/2250 ( 4500\/5000\/5500\/6000) единиц урона в одиночную цель (до учета сопротивления), если цель будет стоять в радиусе урона все время действия.","Действует на невидимых юнитов, если они подойдут к щиту достаточно близко, но визуальные эффекты работать на них не будут.","Нельзя применить на крипов-героев."],"mana":"100\/110\/120\/130","elements":["Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"9 ( 7.65)","name":"Ion Shell","description":["Анимация применения: 0,4+0,7","Дальность применения: 600","Радиус урона: 250","Урон в секунду: 30\/50\/70\/90 ( 180\/200\/220\/240)","Длительность: 25"],"hot_key":"W","legacy_key":"E"},{"spell":"Заряжает дружественное существо энергией, ненадолго увеличивающей скорость передвижения и позволяющей проходить сквозь существ. Цель может превысить стандартный максимум скорости, и её невозможно замедлить.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Союзников"],"notes":["Применяет на цель ускорение, поэтому цель нельзя замедлить, пока эффект не спадет.","Также позволяет цели проходить сквозь других юнитов и убирает ограничение скорости передвижения.","Талант превращает Surge в заклинание, применяемое по области, поэтому способность больше нельзя применить напрямую на юнита."],"mana":"50","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/14\/12\/10 ( 13.6\/11.9\/10.2\/8.5)","name":"Surge","description":["Анимация применения: 0,4+0,57","Дальность применения: 600","Радиус применения: 0 ( 400)","Доп. скорость передвижения: 30%\/45%\/60%\/75%","Длительность: 6"],"hot_key":"E","legacy_key":"R"},{"spell":"Создает стену преломленного света, которая наносит урон и создает копии любого вражеского героя, проходящего сквозь нее. Копии врага служат Dark Seer. Копии пропадут, если их уничтожить или если закончится время действия стены.","effects":["Способность Направленная на точку \/ Вектор","Действует на Вражеских героев"],"notes":["Создает иллюзии только из героев. Не создает иллюзии с иллюзий.","Не создает иллюзию для каждого из клонов Meepo, только один из клонов может иметь иллюзию от Wall of Replica.","При появлении иллюзия автоматически получает приказ атаковать героя, создавшего её.","При смерти иллюзии, стена может создать новую как только герой появится в радиусе действия.","Убийство иллюзии от Wall of Replica дает фиксированные 5 золота и очков опыта, которые не увеличиваются с повышением уровня способности.","Время жизни иллюзий основано на оставшейся длительности стены, из которой они были созданы.","Иллюзии появляются в 108 единицах от героя, если область столкновения равна 24 единицам и в 72, если область столкновения равна 8. Иллюзия появляется с одной из сторон(сверху, слева, снизу или справа).","Иллюзии от Wall of Replica визуально различимы для врагов.","Замедление постоянно применяется по всей области стены. Если стены накладываются друг на друга, то их замедления не складываются.","При выборе таланта на создание параллельной стены, вторая стена располагается позади первой стены на расстоянии 600 единиц. Обе стены могут работать на одних и тех же юнитов, поэтому две иллюзии могут существовать от одного героя одновременно."],"mana":"125\/250\/375","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"100 ( 85)","name":"Wall of Replica","description":["Анимация применения: 0,2+0,73","Дальность применения: 1300","Количество стен: 1 ( 2)","Длина стены: 1300","Ширина стены: 50","Расстояние до параллельной стены: 600","Замедление скорости передвижения: 50%\/60%\/70%","Иллюзии наносят урона: 70%\/85%\/100% ( 100%\/120%\/140%)","Иллюзии получают урона: 200%","Длительность: 45","Длительность замедления: 0.5\/0.75\/1.0"],"hot_key":"R","legacy_key":"W"}],"bio":"Стремительный в час нужды стратег Иш'Кафэль — расчётливый провидец, что обходится в бою без острых мечей: если нужно уничтожить противника, он полагается на мощь своего разума, мастерски направляя сражение в нужное русло. Сей воин пришёл из измерения вне граней реальности, которое он сам называет «миром за стеной». Когда-то Иш'Кафэль был великим военачальником своего народа и храбрым защитником святого короля Даматрикса, но в последние дни Великой войны Пределов его войско пало под натиском превосходящих сил. Поражение было неминуемо, но стратег совершил отчаянный поступок: он завёл армию врага в лабиринт меж стен. В последний миг Иш'Кафэль выскользнул из окружения и выпустил сокрушительную волну тёмной энергии, навеки заточив преследователей в лабиринте. Когда пыль улеглась, стратег увидел, что спас свой народ, однако сам он очутился под светилом иного мира, неспособный вернуться домой. Теперь Иш'Кафэль неуклонно проявляет свой военный гений, поклявшись показать себя величайшим тактиком из всех, что видел этот странный новый мир.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на уклонение мультипликативно сочетается с другими источниками уклонения.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["Реплика героя Играть \"No, I will not calm my beard\" возможно является отсылка к насмешкам героев Beastmaster и Clockwerk, оба которые озвучены Сэмом А. Моури."],"talents":["+150 к урону от Ion Shell:Параллельная Стена","Surge применяется в радиусе 400:-15% перезарядки способностей","+75 к радиусу Vacuum:+12 здоровья в секунду","+90 к урону:+12% к уклонению"],"tips":["У Dark Seer очень маленькая скорость атаки. Используйте Ion Shell, чтобы легче добивать крипов.","Так как у Dark Seer'a ультимейт наносит определенный процент урона от урона врагов, то имеет смысл прокачивать его в середине игры, когда у врагов уже имеются какие-нибудь предметы на урон."],"desc":"%"}