{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The lifesteal talent stacks additively with other sources of lifesteal.",
        "The spell lifesteal talent stacks additively with other sources of spell lifesteal. Heals for 5% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions.",
        "Heals for 5% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Burning Spears Pure Damage",
          "talentRight": "25% Spell Lifesteal"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-3s Life Break Cooldown",
          "talentRight": "+35% Berserker's Blood Regen"
        },
        {
          "talentLvl": "15",
          "talentLeft": "15% Lifesteal",
          "talentRight": "+5 Burning Spears DPS"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+12 Damage",
          "talentRight": "+175 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/66\/Huskar_Inner_Fire.mp3\/revision\/latest?cb=20191216014111",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Inner Fire first applies the damage, then the debuffs.",
        "The disarm is applied at the same time as the knockback. Enemies are not disabled during the knockback, and are, besides moving and attacking, able to act freely during it. Can push units over impassable terrain. Trees a knocked back unit collides with gets destroyed. Does not knock back Roshan, but does damage and disarm him.",
        "Enemies are not disabled during the knockback, and are, besides moving and attacking, able to act freely during it.",
        "Can push units over impassable terrain. Trees a knocked back unit collides with gets destroyed.",
        "Does not knock back Roshan, but does damage and disarm him.",
        "The knockback is not a set distance. It pushes every enemy so they are 400 range away from Huskar's cast location. So the minimum knockback distance is -100.",
        "The knockback duration is always 1, so the speed varies between -100 and 400, depending on the knockback distance.",
        "With Aghanim's Shard, Inner Fire loses its cast time and backswing. It still interrupts channeling abilities upon cast. It can be cast while stunned, cycloned, slept, taunted, hidden or during forced movement. It still cannot be cast while silenced, hexed or prevented from acting. Huskar becomes unable to ⇧ Shift-queue this ability upon acquiring Aghanim's Shard.",
        "It can be cast while stunned, cycloned, slept, taunted, hidden or during forced movement.",
        "It still cannot be cast while silenced, hexed or prevented from acting.",
        "Huskar becomes unable to ⇧ Shift-queue this ability upon acquiring Aghanim's Shard.",
        "With Aghanim's Shard, the disarm modifier also slows movement speed by 40% and applies a 50% heal reduction, health regeneration reduction, lifesteal reduction and spell lifesteal reduction."
      ],
      "mana": "75\/100\/125\/150",
      "hotKey": "Q",
      "cooldown": "14\/13\/12\/11 (TagTalent 11\/10\/9\/8)",
      "description": "In a fiery rage, knocks all nearby enemies away from you to a fixed distance, dealing damage and disarming them.",
      "spellName": "Inner Fire",
      "params": [
        "Cast Animation: 0.2+0.64 (TagTalent 0+0)",
        "Radius: 500",
        "Damage: 100\/170\/240\/310",
        "Max Knockback Distance: 400",
        "Knockback Duration: 1",
        "Debuff Duration: 1.75\/2.5\/3.25\/4",
        "Health Restoration Reduction: 50%",
        "Move Speed Slow: 40%",
        "Causes Inner Fire to reduce healing and regeneration by 50% and applies a 40% movement speed slow. Lowers cooldown by 3 seconds. Can be cast while disabled.",
        "Disarm persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Not even Huskar's own flesh can contain the unending expansion of his life force."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f9\/Huskar_Burning_Spear_1.mp3\/revision\/latest?cb=20191216014116",
      "effects": [
        "Ability Target Unit \/ Autocast",
        "Affects Enemies",
        "Damage Magical (TagAghanim Pure)"
      ],
      "notes": [
        "The current health as cost is direct HP Removal.",
        "Uses Huskar's 400 attack range when Autocast is active. Manually casting it uses the 450 cast range. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "Burning Spear stacks additively when used multiple times on one target. Each attack places the counter modifier on the target. The number of debuffs are summed up and displayed as one icon on the affected enemy. A number on the icon reveals the amount of stacks. The number is visible to everyone. Every instance's duration is completely independent from other instances. They do not prolong or refresh each other. The debuff modifier is only placed once and refreshed with successive casts. The debuff deals damage equal to 5\/10\/15\/20 (TagTalent 10\/15\/20\/25) times the number of stacks, starting 1 second after the debuff is applied. The damage is decided by the level of spell upon placing the debuff modifier. Therefore, placing new stacks with higher level of the ability on targets with old stacks still uses the old damage value.",
        "Each attack places the counter modifier on the target.",
        "The number of debuffs are summed up and displayed as one icon on the affected enemy.",
        "A number on the icon reveals the amount of stacks. The number is visible to everyone.",
        "Every instance's duration is completely independent from other instances. They do not prolong or refresh each other.",
        "The debuff modifier is only placed once and refreshed with successive casts.",
        "The debuff deals damage equal to 5\/10\/15\/20 (TagTalent 10\/15\/20\/25) times the number of stacks, starting 1 second after the debuff is applied.",
        "The damage is decided by the level of spell upon placing the debuff modifier. Therefore, placing new stacks with higher level of the ability on targets with old stacks still uses the old damage value.",
        "The damage per second increasing and the pure damage talents immediately update all current active Burning Spear stacks.",
        "Deals a total of 40\/80\/120\/160 (TagTalent 80\/120\/160\/200) damage per Burning Spear instance (before reductions).",
        "Cannot be cast on buildings, wards and allied units."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Huskar sets his spears aflame, dealing damage over time with his regular attack. Multiple attacks will stack additional damage. Each attack drains some of Huskar's health. Lasts 8 seconds.",
      "spellName": "Burning Spear",
      "params": [
        "Cast Range: 450",
        "Current Health as Cost: 3%",
        "Damage per Second: 5\/10\/15\/20 (TagTalent 10\/15\/20\/25)",
        "Duration: 8",
        "Does not pierce spell immunity. Attempts to damage if debuff was placed before spell immunity. Pierces spell immunity when the required talent is chosen."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "The Sacred Warrior ignites his weaponry after marking it with his own blood - causing far greater pain than he himself feels."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Huskar's model size increases the closer he gets to the max bonuses of Berserker's Blood, up to 35%.",
        "Although not visible in the HUD due to it no showing enough decimals, each missing point of health grants bonuses.",
        "The bonuses grow exponentially, ramping up faster the lower his health is. The benefits ramp up to approximately 50% at 40% health and 75% at 25% health.",
        "The benefits ramp up to approximately 50% at 40% health and 75% at 25% health.",
        "No bonuses are applied at 100% health and the maximum bonus values are applied when strictly below 10% health.",
        "The health percentage is checked periodically and the effects adapted instantly."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Huskar's injuries feed his power, giving increased attack speed and health regen based on missing health. Health regen is a percentage of your strength.",
      "spellName": "Berserker's Blood",
      "params": [
        "Max Attack Speed Bonus: 160\/210\/260\/310",
        "Strength as Max Health Regen Bonus: 20%\/40%\/60%\/80% (TagTalent 55%\/75%\/95%\/115%)",
        "Max Bonus Health Threshold: 10%"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "After losing his birthright, Huskar gained a lethality in physical combat that is only heightened as his own blood is spilled."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2d\/Huskar_Life_Break_1.mp3\/revision\/latest?cb=20191216014112",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Magical"
      ],
      "notes": [
        "Huskar leaps at a speed of 1200.",
        "Applies a basic dispel on Huskar upon cast.",
        "Upon cast, Huskar receives a hidden charge buff, which lasts for 5 seconds or until reaching the target, whichever is shorter. This modifier turns him spell immune, disarms him, forces him to face the target and is responsible for the leap animation. Since the modifier has a set max duration, it can expire while leaping, continuing the rest of the leap without its effects. If Huskar is disabled during the leap or the distance between the target and Huskar becomes more than 1450, the leap stops.",
        "This modifier turns him spell immune, disarms him, forces him to face the target and is responsible for the leap animation.",
        "Since the modifier has a set max duration, it can expire while leaping, continuing the rest of the leap without its effects.",
        "If Huskar is disabled during the leap or the distance between the target and Huskar becomes more than 1450, the leap stops.",
        "Huskar can use items and abilities during the leap. However, position changing effects like Blink Dagger cancel it.",
        "Can be cast on and debuff Roshan, but does not damage him. Can be cast on Couriers.",
        "Can be cast on Couriers.",
        "Deals magical damage to the caster as well. Therefore, it can be reduced by magic resistance. The self-inflicted damage is not lethal, no matter how strong it gets amplified, so it cannot be used to deny oneself. The self-inflicted damage is applied on impact, it's not applied if the leap is interrupted prematurely.",
        "The self-inflicted damage is not lethal, no matter how strong it gets amplified, so it cannot be used to deny oneself.",
        "The self-inflicted damage is applied on impact, it's not applied if the leap is interrupted prematurely.",
        "Life Break first applies the damage, then the slow debuff, and then the taunt debuff.",
        "With Aghanim's Scepter, Life Break taunts the target, forcing them to attack Huskar. Does not silence the target, so active attack modifiers with Autocast on are still applied.",
        "Does not silence the target, so active attack modifiers with Autocast on are still applied."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Huskar draws upon his health to break an enemy's life, leaping at a target within attack range to shatter a percentage of that hero's current health, and slowing them. While leaping, Huskar is spell immune.",
      "spellName": "Life Break",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 550 (TagAghanim 850)",
        "Current Health as Cost: 32%\/38%\/44%",
        "Target Current Health as Damage: 32%\/38%\/44%",
        "Move Speed Slow: 60%",
        "Slow Duration: 3\/4\/5",
        "Taunt Duration: 3",
        "Forces the enemy target to attack you and increases cast range.",
        "Blocked upon impact. When blocked, Huskar takes no damage either."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "No matter the danger, Huskar thrusts himself into melees that only he can survive."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 21.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 1.6,
    "attrAgility": 13.0
  },
  "description": "Huskar, the Sacred Warrior, is a ranged strength hero who is an effective ganker and carry, with both great benefits and risks offered. He is known to be a powerful adversary in most games because his damage-per-second attacks can easily kill almost all heroes at any point in the game, assuming no one is nearby to save them. Unlike many other heroes, Huskar does not require much mana to use his abilities; rather, he sacrifices his own health to inflict additional damage. His passive, Berserker's Blood, defines the power of sacrifice: Huskar gets more dangerous the more he gets hurt. This ability gives him increased health regen and attack speed depending on how much life he is missing. Combined with the DPS from Burning Spear, the increased attack speed from Berserker's Blood allows Huskar to output colossal damage, which can be used to gain an advantage over the enemies early on during the game. His Life Break is his most dangerous ability, but also his riskiest one: charging towards his target, Huskar sheds a large amount of his life force to cut an equal amount of the target's current health. This is great to use as an initiation spell as it deals a guaranteed percentage damage, allowing Huskar and his allies to feel the pain that the Sacred Warrior felt. Courageous and fearless, Huskar is powerful at any stage of the game and is willing to suffer and face death, for the greater good of taking his allies to victory.",
  "history": "Emerging from the throes of the sacred Nothl Realm, Huskar opened his eyes to see the prodigal shadow priest Dazzle working a deep incantation over him. Against the ancient rites of the Dezun Order, Huskar's spirit had been saved from eternity, but like all who encounter the Nothl he found himself irrevocably changed. No longer at the mercy of a mortal body, his very lifeblood became a source of incredible power; every drop spilled was returned tenfold with a fierce, burning energy. However this newfound gift infuriated Huskar, for in his rescue from the Nothl, Dazzle had denied him a place among the gods. He had been denied his own holy sacrifice. In time the elders of the order sought to expand their influence and Huskar, they agreed, would be a formidable tool in their campaign. Yet becoming a mere weapon for the order that denied him his birthright only upset him further. As the first embers of war appeared on the horizon, he fled his ancestral home to find new allies, all the while seeking a cause worthy of unleashing the power his total sacrifice could bring.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Burning Spears Pure Damage",
      "talentRight": "25% Spell Lifesteal"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-3s Life Break Cooldown",
      "talentRight": "+35% Berserker's Blood Regen"
    },
    {
      "talentLvl": "15",
      "talentLeft": "15% Lifesteal",
      "talentRight": "+5 Burning Spears DPS"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+12 Damage",
      "talentRight": "+175 Health"
    }
  ]
}