{"abilities":[{"spell":"Slams the ground with a mighty totem, creating an impassable ridge of stone while stunning and damaging enemy units along its line.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Fissure's effects are instantly applied within its whole area. There is no travel time.","The Fissure consists of 24 ( 31) segments, which are placed in a straight line in front of Earthshaker. The segments have a collision size of 24 and a distance of 8.25 between each other, with the first one being placed 8.25 range in front of Earthshaker. This means the Fissure's effective blocking area is 1350 ( 1743.75) range long and 24 range wide. Every unit (except wards and buildings) which is within that area upon cast is pushed aside.","The stun and damage are applied in a circular shape around each segment. This means the total damage\/stun area consists of multiple overlapping circles, and not a smooth line. A unit can only be hit by one instance per cast, even when within the damage\/stun radius of multiple segments. Can hit units up to 1575 ( 1968.75) range in front and 216.75 range behind Earthshaker.","Fissure first applies the debuff, then the damage.","Flying units and units with free pathing ( Spectral Dagger, Charge of Darkness, Spin Web) are not blocked by Fissure. They still are fully affected by it otherwise when hit. They are pushed aside, stunned and damaged.","Units not controlled by any player do not try to path around the Fissure, but simply walk against it as if it is not there. This effectively causes them to get stuck, until they change directions (e.g. when aggro-ing them), or until the Fissure dissipates."],"mana":"125\/140\/155\/170","elements":["Partially pierces spell immunity."],"cooldown":"21\/19\/17\/15","name":"Fissure","description":["Cast Animation: 0.69+0","Cast Range: 1400 ( 1800)","Fissure Length: 1350 ( 1743.75)","Fissure Pathing Block Radius: 24","Fissure Damage\/Stun Radius: 225","Damage: 110\/160\/210\/260","Stun Duration: 1\/1.25\/1.5\/1.75","Fissure Duration: 8"],"hot_key":"Q","legacy_key":"F"},{"spell":"Empowers Earthshaker's totem, causing it to deal extra damage on the next attack.","effects":["Ability No Target ( Target Area)","Affects Self"],"notes":["Only increases base damage and that given by the primary attribute of Earthshaker. Raw bonus damage is not increased.","The Enchant Totem buff grants True Strike, so the attack cannot miss.","When upgraded, the spell turns into an area targeted spell. It may only target the ground or self. Double-clicking the ability automatically targets self. When targeting self, the ability behaves like the unupgraded version, using the 0.69 + 0.57 second cast animation and not leaping. When targeting the ground, it uses a 0 second cast time and a 0.2 second cast backswing, during which Earthshaker is disabled. The leap duration is always the same, so the speed adapts based on the targeted distance. The leap height is always 562 range. During the leap, Earthshaker is fully disabled, unable to move, turn, attack or cast spells or items. The spell counts as cast as soon as the leap starts. However, Aftershock and the totem buff are applied upon landing. Aftershock and the totem buff are applied even when Earthshaker gets disabled or dies during the leap. Getting hit by other sources of forced movement causes the leap's trajectory to change, but it is not interrupted. However, getting hit by forced movement causes the ability to not apply Aftershock or the totem buff upon landing. The spell is fully and immediately canceled when getting moved upwards or teleported by other spells. While in the air, other units may pass below Earthshaker. The targeting reticule shows the radius of Aftershock, even when it hasn't been learned yet."],"mana":"35\/40\/45\/50","elements":["Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"5 ( 3)","name":"Enchant Totem","description":["Cast Animation: 0.69+0.57 ( 0+0.2)","Cast Range: 0 ( 1100)","Max Leap Distance: 0 ( 1100)","Attack Damage Bonus: 100%\/200%\/300%\/400%","Damage Bonus Duration: 14","Leap Duration: 0 ( 1)"],"hot_key":"W","legacy_key":"E"},{"spell":"Causes the earth to shake underfoot, adding additional damage and stuns to nearby enemy units when Earthshaker casts his abilities.","effects":["Ability Passive","Affects Enemies","Damage Magical"],"notes":["Aftershock does not trigger upon using items.","Aftershock first applies the debuff, then the damage.","Applies its own effects before the effects of the triggering spell are applied.","The stun does not stack with the stun of Fissure. It follows the regular rule of stuns – the longer stun overrides the shorter one.","Applies damage after stun."],"mana":"0","elements":["Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Aftershock","description":["Radius: 300","Damage: 75\/100\/125\/150","Stun Duration: 0.6\/0.9\/1.2\/1.5"],"hot_key":"E","legacy_key":"T"},{"spell":"Shockwaves travel through the ground, damaging enemy units. Each enemy hit causes an echo to damage nearby units. Real heroes cause two echoes.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Echo Slam interrupts Earthshaker's channeling spells upon cast.","Each enemy within the initial search radius sends echo waves towards enemies within the echo search radius.","The echo waves travel at a speed of 600.","The echo search radii are centered around each unit hit by the initial damage. Echo waves are sent out to every enemy unit within the search radius, except to the unit itself. This means the echo waves targets can be up to 1200 range away from Earthshaker upon cast. This also means when only one enemy is within the radius, it takes no damage, since it cannot send echoes to itself.","Hit enemy heroes send two echoes to every valid target within the radius, and not only to other heroes.","Wards and buildings are completely ignored, meaning they do not release and are not targeted by echoes.","Fully affects invisible units and units in the Fog of War.","Total damage when hitting a certain amount of heroes, with no other units nearby (before reductions): 1 Hero: 100 ( 100) total damage to the hero, since echoes do not deal damage to their source. 2 Heroes: 240\/280\/320 ( 340\/380\/420) damage to each hero, 480\/560\/640 ( 680\/760\/840) total damage. 3 Heroes: 380\/460\/540 ( 580\/660\/740) damage to each hero, 1140\/1380\/1620 ( 1740\/1980\/2220) total damage. 4 Heroes: 520\/640\/760 ( 820\/940\/1060) damage to each hero, 2080\/2560\/3040 ( 3280\/3760\/4240) total damage. 5 Heroes: 660\/820\/980 ( 1060\/1220\/1380) damage to each hero, 3300\/4100\/4900 ( 5300\/6100\/6900) total damage."],"mana":"145\/205\/265","elements":["Cannot be disjointed.","Partially pierces spell immunity."],"cooldown":"150\/130\/110","name":"Echo Slam","description":["Cast Animation: 0+1.33","Initial Search Radius: 600","Echo Search Radius: 600","Base Damage: 100","Echo Damage: 70\/90\/110 ( 120\/140\/160)"],"hot_key":"R","legacy_key":"C"}],"bio":"Like a golem or gargoyle, Earthshaker was one with the earth but now walks freely upon it. Unlike those other entities, he created himself through an act of will, and serves no other master. In restless slumbers, encased in a deep seam of stone, he became aware of the life drifting freely above him. He grew curious. During a season of tremors, the peaks of Nishai shook themselves loose of avalanches, shifting the course of rivers and turning shallow valleys into bottomless chasms. When the land finally ceased quaking, Earthshaker stepped from the settling dust, tossing aside massive boulders as if throwing off a light blanket. He had shaped himself in the image of a mortal beast, and named himself Raigor Stonehoof. He bleeds now, and breathes, and therefore he can die. But his spirit is still that of the earth; he carries its power in the magical totem that never leaves him. And on the day he returns to dust, the earth will greet him as a prodigal son.","talentsTips":["The mana talent increases maximum mana capacity, and keeps the current mana percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The armor talent does not benefit illusions.","The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Earthshaker's magic resistance to 62.5%."],"trivia":["Earthshaker's response \"Chaos Dunk!\" is a reference to the freeware RPG game Barkley, Shut Up and Jam: Gaiden.","Earthshaker is possibly named after the weapon \"Earthshaker\" from World of Warcraft, known for its AoE stun."],"talents":["-2s Enchant Totem Cooldown:+50% Magic Resistance","+400 Fissure Range:+50 Echo Damage","+7 Armor:+30 Movement Speed","+250 Mana:+30 Damage"],"desc":"Raigor Stonehoof, the Earthshaker, is a melee strength hero with several area of effect (AoE) disables, commonly played as a ganker or initiator. Good usage of his spells allow him to damage and chainstun multiple enemies at once, making him very disruptive in skirmishes and teamfights. His Fissure is a versatile long-ranged spell that affects enemies in a line, used to stun, inflict moderate damage, and create an impassable wall of earth for a significant duration. Proper usage of this can allows him to cut off chokepoints, leaving enemies with no escape routes or preventing them from chasing after endangered allies. Enchant Totem massively boosts his attack damage for one attack, and has a very short cooldown. Aftershock lets the Earthshaker deal additional damage and stun in a small area around him every time he uses one of his spells, and combos particularly well with Enchant Totem, given the former's very low cooldown. Earthshaker's heavy AoE-centric kit is most powerful when his enemies are in large numbers and in close proximity. With his Echo Slam, he can deal heavy damage to clusters of enemies. All of Earthshaker's spells (with the exception of his ultimate) have a long casting animation, but with proper positioning, an adept Earthshaker can wreak havoc. Blink Dagger is an essential item for him to be able to properly land Echo Slam within a cluster of enemies. At the same time, because of the high mana costs of his spells, he needs some form of mana sustenance. With his tremendous seismic power, the Earthshaker is never one that should be taken lightly even when he is heavily outnumbered."}