{
  "abilities": [
    {
      "spell": "Герой разбивает землю могучим тотемом, оставляя перед собой непроходимую каменную борозду, при этом оглушая стоящих на её пути врагов и нанося им урон.",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Борозда появляется сразу после применения. У нее нет времени появления.",
        "Борозда состоит из 24 ( 31) сегментов, которые расположены по прямой перед Earthshaker. Сегменты имеют радиус столкновения в 24 единицы и расстояние между друг друга в 8,25 единиц, а первый сегмент появляется в 8,25 единицах перед Earthshaker. То есть блокировка площади бороздой составляет 1350 ( 1743.75) диапазона в длину и 24 в ширину. Каждый юнит (кроме вардов и строений), который находился на линии появления борозды, будет отодвинут в сторону.",
        "Оглушение и урон применяются вокруг каждого сегмента. То есть общая область урона\/оглушения состоит из множества накладывающихся друг на друга кругов, а не из единой линии. Юнит поражается только один раз за применение, даже если попал в пересечение радиусов сегментов. Может поражать юнитов на расстоянии до 1575 ( 1968.75) единиц перед Earthshaker и в 216.75 позади героя.",
        "Fissure сначала применяет дебафф, затем наносит урон.",
        "Летающие юниты и юниты, которые могут проходить где угодно ( Spectral Dagger, Charge of Darkness, Spin Web), не блокируются бороздой. Они по прежнему будут затронуты ударом. Они также будут отодвинуты в сторону, получат урон и будут оглушены.",
        "Юниты, неподконтрольные игрокам, не пытаются обойти вокруг Fissure, а просто пытаются идти дальше, будто препятствия нет. Фактически юниты застревают до смены направления (например, с помощью агра) или исчезновения Fissure."
      ],
      "mana": "125\/140\/155\/170",
      "elements": [
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "21\/19\/17\/15",
      "name": "Fissure",
      "description": [
        "Анимация применения: 0,69+0",
        "Дальность применения: 1400 ( 1800)",
        "Длина борозды: 1350 ( 1743.75)",
        "Радиус блокирования пути: 24",
        "Радиус урона\/оглушения: 225",
        "Урон: 110\/160\/210\/260",
        "Длительность борозды: 8"
      ],
      "hot_key": "Q",
      "legacy_key": "F"
    },
    {
      "spell": "Заряжает тотем, увеличивая урон следующей атаки.",
      "effects": [
        "Способность Ненаправленная ( Направленная на область)",
        "Действует на Себя"
      ],
      "notes": [
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом героя. Дополнительный урон не увеличивается.",
        "Бафф Enchant Totem дает эффект True Strike, поэтому атака не может промахнуться.",
        "При улучшении способность становится направленной на область. Её можно направить только на землю или себя. Двойное нажатие на способность автоматически наводит её на себя. При применении на себя способность игнорирует улучшение и ведёт себя, как базовая, используя время применения в 0,69 + 0,57 секунд без прыжка. При применении на землю она использует время применения в 0 + 0,2 секунды, во время которого Earthshaker обезврежен. Длительность прыжка всегда одинакова, поэтому скорость адаптируется к расстоянию. Высота прыжка всегда равна 562. Во время прыжка Earthshaker полностью обезврежен, не имея возможности двигаться, поворачиваться, атаковать или использовать способности и предметы. Способность считается использованной в начале прыжка. Однако, Aftershock и усиление тотема применяются лишь при приземлении. Aftershock и усиление тотема применяются, даже если Earthshaker был обезврежен или убит в прыжке. При воздействии другими источниками принудительного движения прыжок меняет траекторию, но не прерывается. Однако, в данном случае Aftershock или усиление тотема не применяются при приземлении. Способность полностью и незамедлительно отменяется только при принудительном движении вверх или телепортации другими способностями. Пока Earthshaker в воздухе, другие юниты могут пройти под ним. Направляющая рамка показывает радиус Aftershock, даже если он не изучен."
      ],
      "mana": "35\/40\/45\/50",
      "elements": [
        "Нельзя применять в оцепенении.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "5 ( 3)",
      "name": "Enchant Totem",
      "description": [
        "Анимация применения: 0,69+0,57 ( 0+0,2)",
        "Дальность применения: 0 ( 1100)",
        "Макс. дальность прыжка: 0 ( 1100)",
        "Дополнительный урон: 100%\/200%\/300%\/400%",
        "Длительность: 14",
        "Длительность прыжка: 0 ( 1)"
      ],
      "hot_key": "W",
      "legacy_key": "E"
    },
    {
      "spell": "Герой сотрясает землю при каждом применении способности, нанося урон врагам поблизости и оглушая их.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Использование предметов не активирует Aftershock.",
        "Aftershock сначала применяет дебафф, затем наносит урон.",
        "Применяет свои эффекты (урон и оглушение) перед эффектами вызвавшего его заклинания.",
        "Оглушение от способности не сочетается с оглушение от Fissure. Здесь работает стандартное правило оглушения – большее оглушение перекрывает меньшее оглушение."
      ],
      "mana": "0",
      "elements": [
        "Отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Aftershock",
      "description": [
        "Радиус: 300",
        "Урон: 75\/100\/125\/150",
        "Длительность оглушения: 0.6\/0.9\/1.2\/1.5"
      ],
      "hot_key": "E",
      "legacy_key": "T"
    },
    {
      "spell": "По земле распространяются ударные волны, наносящие урон врагам. Каждое попадание по врагу создаёт волновое эхо, которое наносит урон ближайшим врагам. Попадание по герою создаёт двойное эхо.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Echo Slam прерывает произносимые способности Earthshaker.",
        "Каждый враг в начальном радиусе распространяет волну на врагов в пределах радиуса ударной волны.",
        "Волны эха распространяются со скоростью 600.",
        "Центром радиуса поиска для эха является каждый задетый начальной волной юнит. Волны распространяются на каждого юнита в радиусе поиска за исключением самого испустившего. Это означает, что волны эхо могут распространяться в радиусе 1200 от Earthshaker. Также если в радиусе будет лишь один враг, то урона он не получит, так как не сможет распространить волну от себя себе.",
        "Пораженные вражеские герои распространяют две волны к каждой подходящей цели в радиусе, а не только к героям.",
        "Варды и строения игнорируются, не испуская и не получая урон от волн.",
        "Действует на невидимых юнитов и юнитов в тумане войны.",
        "Общее количество урона на определенное количество героев без крипов вблизи (до учета сопротивлений): 1 герой: 100\/100\/100 ( 100\/100\/100), не может отправить волны к самому себе. 2 героя: 240\/280\/320 ( 340\/380\/420) за каждого героя, всего 380\/460\/540 ( 580\/660\/740) урона. 3 героя: 380\/460\/540 ( 580\/660\/740) за каждого героя, всего 940\/1180\/1420 ( 1540\/1780\/2020) урона. 4 героя: 520\/640\/760 ( 820\/940\/1060) за каждого героя, всего 1780\/2260\/2740 ( 2980\/3460\/3940) урона. 5 героев: 660\/820\/980 ( 1060\/1220\/1380) за каждого героя, всего 2900\/3700\/4500 ( 4900\/5700\/6500) урона."
      ],
      "mana": "145\/205\/265",
      "elements": [
        "Нельзя избежать.",
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "150\/130\/110",
      "name": "Echo Slam",
      "description": [
        "Анимация применения: 0+1,33",
        "Начальный радиус: 600",
        "Радиус ударной волны: 600",
        "Базовый урон: 100",
        "Урон от волны: 70\/90\/110 ( 120\/140\/160)"
      ],
      "hot_key": "R",
      "legacy_key": "C"
    }
  ],
  "bio": "Словно голем или гаргулья, Earthshaker когда-то был един с землей, но сейчас он свободно ступает по ней. В отличие от других, он создал себя своей волей и никому не служит. В беспокойных снах, заключенный глубоко в камне, он узнал, что жизнь проходит над ним. Он вырос любознательным. Во время землетрясений пик горы Ишай стряхивал с себя рыхлые лавины, меняя течение рек и превращая равнины в бездонные разломы. Когда, наконец, земля перестала дрожать, из оседающей пыли, разбрасывая тяжелые валуны как какие-то тряпки, вышел Earthshaker. Он сделал себя похожим на смертную тварь и назвался Рейгором Каменное Копыто. В его венах течет кровь, а в легких проходит воздух, а это значит, что теперь он смертен. Но дух его всё еще связан с землей. Он несет ее силу в магическом тотеме, который всегда с ним. И в день, когда он обратится в пыль, земля примет его как своего блудного сына.",
  "talentsTips": [
    "Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.",
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
    "Талант на броню не дается иллюзиям.",
    "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
    "Талант на сопротивление магии увеличивает сопротивление магии Earthshaker до 62.5%."
  ],
  "trivia": [
    "Реплика \"Играть Chaos Dunk!\" является отсылкой к бесплатной RPG Barkley, Shut Up and Jam: Gaiden"
  ],
  "talents": [
    "-2 сек. перезарядки у Enchant Totem:+50% к сопротивлению магии",
    "+400 к дальности Fissure:+50 к урону от эха у Echo Slam",
    "+7 к броне:+30 к скорости передвижения",
    "+250 к мане:+30 к урону"
  ],
  "tips": [
    "Fissure создаёт непроходимый барьер, который позволит заблокировать путь противнику не дав ему убежать. Вы и ваши союзники также не смогут пройти через барьер.",
    "Используйте Enchant Totem в сочетании с Aftershock, чтобы остановить врагов, даже если Fissure ещё недоступен. Бонусный урон с этой способности не совмещается с Руна двойного урона.",
    "Из-за урона от эхо, Echo Slam лучше всего использовать в середине вражеской команды, особенно когда вокруг них большое количество юнитов. Способность не игнорирует невидимые и скрытые в тумане войны цели.",
    "Blink Dagger или Force Staff помогут вам оказаться в лучшей позиции для атаки.",
    "Рассчитывайте на оглушение от Aftershock, чтобы уйти из опасного места после использования Echo Slam."
  ],
  "desc": "Рейгор Каменное Копыто, Earthshaker — герой характеристики сила с ближним типом атаки. Его первая способность, Fissure, бьёт по земле, заставляя землю растрескаться, нанося урон врагам и оставляя непроходимую борозду на некоторое время. Второй способностью, Enchant Totem, герой заряжает тотем, увеличивая урон следующей атаки. Пассивная способность, Aftershock, при использовании героем любой способности сотрясает землю, нанося урон врагам поблизости и оглушая их. Ультимативной способностью, Echo Slam, герой бьёт тотемом по земле, от этого распространяются ударные волны, наносящие урон врагам. Каждое попадание по врагу создаёт волновое эхо, которое наносит урон ближайшим врагам. Способность Enchant Totem с Aghanim's Scepter позволяет прыгнуть в указанную точку в радиусе 900 и мгновенно применить в ней Enchant Totem. Применение на себя работает как раньше, без прыжка."
}