{"abilities":[{"effects":["Дальность применения (союзник): 800","Дальность применения (враг): 400","Дистанция отталкивания (союзник): 600","Дистанция отталкивания (враг): 450","Длительность отталкивания (союзник): 0,5","Длительность отталкивания (враг): 0.2","Число атак без ограничений: 4","Доп. скорость атаки по цели: 100","Длительность баффа: 5"],"notes":["Double clicking the item casts it on self.","Pushes at a speed of 1500, if the target is self or an ally. Pushes the caster and target at a speed of 2250, if the target is an enemy.","Targeting allies pushes them based on their facing direction. Targeting enemies pushes them based on the caster's facing direction. The caster is pushed into the opposite direction, adding a 900 range distance between the caster and targeted enemy. The caster is only pushed when the target was an enemy, not an ally.","The unlimited attack range only works against the targeted enemy. Attacking other units still uses the regular attack range.","Same goes for the attack speed. When switching targets uses regular attack speed. Updates the speed upon reaching attack point.","Gives the caster an attack order on the target if the target is an enemy. This effect works exclusively for ranged heroes.","The push does not disable, so the caster and the targeted unit can still cast spells or items, attack and turn during the push. This also means that it does not cancel channeling spells of the target.","Does not push units affected by a Chronosphere, Black Hole, Duel, or Kinetic Field. If the target is an enemy, not even the push on the caster or the unlimited attack range are applied.","Cannot break Pounce leash. When pushing a leashed hero, it does not get pushed beyond the leash's max range.","Can target any unit, except for wards and buildings. It can also push a Homing Missile.","Can force units over impassable terrain. Trees within 100 radius around the pushed units get destroyed during the push.","Can be cast on Roshan but without any effect, since Roshan is immune to forced movement (still applies its effects on the caster).","Casting on self or allies uses the default Force Staff sound.","Shares cooldown with Force Staff."],"elements":["Способность Направленная на юнита","Действует на Врагов \/ Союзников"],"description":"При использовании на противника отталкивает цель и владельца друг от друга на расстояние в 450 единиц. Если владелец сражается в дальнем бою, то после этого он следующие 5.0 секунд может совершить до 4 атак по цели без ограничения на расстояние. Скорость таких атак увеличена на 100. При использовании на себя и союзников работает как Force Staff."},{"effects":["Дополнительная дальность атаки: 140"],"notes":["Attack range bonuses from multiple Hurricane Pikes or Dragon Lances do not stack.","Stacks with any other source of attack range bonus.","Affects the cast range of active attack modifiers as well.","Does not affect the range of secondary attacks like Moon Glaives, Split Shot, Flak Cannon or Marksmanship.","Affects the cast range of Focus Fire as well, so it matches the total attack range."],"elements":["Способность Пассивная","Действует на Себя"],"description":"Увеличивает дальность атаки героев дальнего боя на 140."}],"cost":"4600","description":"Легендарная пика, в далеком прошлом служившая монаршим символом наездников на вивернах.","further":["Force_Staff","Dragon_Lance","Рецепт"],"attrs":["Активируемая Hurricane Thrust","Пассивная Dragon's Reach","Бонус +15 к силе +20 к ловкости +13 к интеллекту +2,5 к регенерации здоровья +140 к дальности атаки","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 300 здоровья, 4 регенерации здоровья, 1,2% сопротивления магии, 3,2 брони, 20 скорости атаки, 1% скорости передвижения, 156 маны, 0,65 регенерации маны, 0,91% урона от способностей и 15 урона от атаки.","Для героев ловкости, даёт 300 здоровья, 4 регенерации здоровья, 1,2% сопротивления магии, 3,2 брони, 20 скорости атаки, 1% скорости передвижения, 156 маны, 0,65 регенерации маны, 0,91% урона от способностей и 20 урона от атаки.","Для героев интеллекта, даёт 300 здоровья, 4 регенерации здоровья, 1,2% сопротивления магии, 3,2 брони, 20 скорости атаки, 1% скорости передвижения, 156 маны, 0,65 регенерации маны, 0,91% урона от способностей и 13 урона от атаки."]}