{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e8\/Helm_of_the_Dominator_Dominate.mp3\/revision\/latest?cb=20191227195434",
      "effects": [
        "Дальность применения: 700",
        "Макс. существ: 1",
        "Минимальный базовый запас здоровья: 1800",
        "Установленная скорость передвижения: 400",
        "Установленная награда в золоте: 250",
        "Бонус к базовому урону от атаки: 80",
        "Бонус к восстановлению здоровья: 12",
        "Бонус к восстановлению маны: 4",
        "Бонус к броне: 8"
      ],
      "notes": [
        "Нельзя подчинять крипов-героев, катапульты, лучников Некрономикона, воинов Некрономикона и Рошана.",
        "Применяет базовое развеивание на цель, которое убирает баффы и дебаффы.",
        "При подчинении нового крипа, при наличии максимального количества, умрёт самый старый крип.",
        "Максимальное количество существ привязано к игроку. Покупка нового Helm of the Overlord не позволит подчинить дополнительных существ. При владении обоими, Helm of the Dominator и Helm of the Overlord, Helm of the Overlord имеет приоритет, разрешая 1 существо. Этот также относится и к копированному Helm of the Overlord у Tempest Double. Если враг крадёт подчинённого крипа (например Enchant), то он больше не учитывается в максимальном ограничении. Если предмет продать или уничтожить, то подчинённый крип умрёт. Смерти не учитываются ни для кого, так что никто не получает опыт за это.",
        "При владении обоими, Helm of the Dominator и Helm of the Overlord, Helm of the Overlord имеет приоритет, разрешая 1 существо.",
        "Этот также относится и к копированному Helm of the Overlord у Tempest Double.",
        "Если враг крадёт подчинённого крипа (например Enchant), то он больше не учитывается в максимальном ограничении.",
        "Если предмет продать или уничтожить, то подчинённый крип умрёт.",
        "Смерти не учитываются ни для кого, так что никто не получает опыт за это.",
        "Устанавливает скорость передвижения цели на 400, независимо от её стандартной скорости передвижения.",
        "Устанавливает награду в золоте за цель на 250 , независимо от стандартной награды за неё. При убийстве цели не выдаётся её стандартная награда в золоте, только установленное значение. Награда в опыте не изменяется.",
        "При убийстве цели не выдаётся её стандартная награда в золоте, только установленное значение. Награда в опыте не изменяется.",
        "Если максимальное здоровье существа ниже минимального порога здоровья, то его максимальное и текущее здоровье увеличивается на разницу. Это увеличение текущего здоровья не считается лечением. Значение здоровья существа устанавливается на значение.",
        "Это увеличение текущего здоровья не считается лечением. Значение здоровья существа устанавливается на значение.",
        "Бонус к урону от атаки добавляется напрямую к базовому урону от атаки существа. Он не добавляется как прямой бонус к урону от атаки.",
        "Не восстанавливает ману крипа.",
        "Не делит перезарядку с Helm of the Dominator."
      ],
      "mana": "0",
      "abilityName": "Dominate",
      "cooldown": "45",
      "description": "Даёт контроль над нейтральным крипом, не являющимся древним, и увеличивает его скорость передвижения до 400, а запас здоровья — до 1800. Также даёт крипу +80 к базовому урону, +8 к броне, +12 к восстановлению здоровья и +4 к восстановлению маны. Если максимальное здоровье существа больше 1800, оно не изменится. За убийство существа даётся 250 золота.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Вампиризм: 18%",
        "Доп. восстановление маны: 2",
        "Доп. урон: 18%",
        "Доп. броня: 3",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Эффект от нескольких Vladmir's Offering не складывается. Это также включает ауру от Vladmir's Offering. Полностью складывается с другими источниками брони, включая улучшения Buckler. Полностью сочетается с другими источниками восстановления маны, в том числе и улучшениями Ring of Basilius. Полностью складывается с другими источниками увеличения урона от атак. Складывается аддитивно с другими источниками вампиризма.",
        "Полностью складывается с другими источниками брони, включая улучшения Buckler.",
        "Полностью сочетается с другими источниками восстановления маны, в том числе и улучшениями Ring of Basilius.",
        "Полностью складывается с другими источниками увеличения урона от атак.",
        "Складывается аддитивно с другими источниками вампиризма.",
        "Аура вампиризма не будет восстанавливать здоровье за удары по вардам, постройкам и союзным существам.",
        "Увеличивает только базовый урон и урон от основного атрибута героя. Не увеличивает прямые бонусы к урону.",
        "Восстанавливает до 120 маны в минуту.",
        "Эффект от ауры задерживается на 0,5 секунды.",
        "Действует на неуязвимых существ.",
        "В отличие от других предметов, аура Helm of the Overlord не даётся собственным модификатором предмета, вместо этого он применяет модификатор предмета Vladmir's Offering на носителя, который даёт ауру."
      ],
      "mana": null,
      "abilityName": "Vladmir's Aura",
      "cooldown": null,
      "description": "Увеличивает вампиризм союзников на 18%, их урон на 18%, броню на 3 и восстановление маны на 2.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6175",
  "lore": null,
  "consistFrom": [
    "Helm of the Dominator",
    "Vladmir's Offering",
    "Recipe"
  ],
  "name": "Helm of the Overlord",
  "description": "Могущественный шлем мертвого некроманта.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}