{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The proc chances of Pierce from multiple Javelins work fully independently from each other. This means that two of them can proc on the same attack and both deal their damage. Also stacks with Pierce of Monkey King Bar.",
        "This means that two of them can proc on the same attack and both deal their damage.",
        "Also stacks with Pierce of Monkey King Bar.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. However, it is not considered by lifesteal, crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "However, it is not considered by lifesteal, crit or cleave.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Does not work against buildings, but works against wards and allied units.",
        "Adds an average of 21 magical damage to every attack.",
        "Pierce uses pseudo-random distribution.",
        "Attacks which proc Pierce cannot miss."
      ],
      "mana": null,
      "abilityName": "Pierce",
      "cooldown": null,
      "description": "Grants each attack a 30% chance to pierce through evasion and deal 70 bonus magical damage.",
      "params": [
        "Proc Chance: 30%",
        "Damage: 70",
        "Can proc for illusions, allowing them to bypass evasion, but does not apply the bonus damage."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1100",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Equipment",
  "name": "Javelin",
  "description": "A rather typical spear that can sometimes pierce through an enemy's armor when used to attack.",
  "trivia": null,
  "upgradeIn": [
    "Monkey King Bar",
    "Maelstrom"
  ],
  "bonuses": null,
  "tips": null
}