{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Naga Siren: 260 здоровья и 1,3 регенерации здоровья.",
        "Талант на ловкость в общем даёт Naga Siren: 1,67 брони, 10 скорости атаки и 10 урона от атаки.",
        "Талант на уклонение мультипликативно сочетается с другими источниками уклонения."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+5 к снижению брони от Rip Tide",
          "talentRight": "+25% к уклонению"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+1 иллюзия от Mirror Image",
          "talentRight": "-9 сек. перезарядки Ensnare"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+13 к силе",
          "talentRight": "+10 к ловкости"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+9% к урону Mirror Image",
          "talentRight": "+20 к скорости передвижения"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Naga_Siren_Mirror_Image.mp3\/revision\/latest?cb=20191216020848",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении Mirror Image позволяет избегать снаряды.",
        "Пока Naga Siren создает копии, она неуязвима, скрыта и обладает иммунитетом к заклинаниям.",
        "При использовании к герою применяется базовое развеивание.",
        "Сбрасывает для остальных существ все текущие приказы на атаку и выбор целью направленных заклинаний Naga Siren.",
        "После задержки Naga Siren появляется со своими иллюзиями. Место появления зависит от местоположения Naga Siren на момент использования способности; при этом одно существо всегда будет находится на месте применения, а остальные - находится вокруг него. То есть при появлении 3 иллюзий их расположение напоминает букву \"Т\", а при появлении 4 - знак плюса. Расстояние между каждым существом 72 единицы. Поскольку расположение всегда одинаково, то Naga Siren и её иллюзии располагаются случайно и смотрят в одну сторону.",
        "Место появления зависит от местоположения Naga Siren на момент использования способности; при этом одно существо всегда будет находится на месте применения, а остальные - находится вокруг него.",
        "То есть при появлении 3 иллюзий их расположение напоминает букву \"Т\", а при появлении 4 - знак плюса.",
        "Расстояние между каждым существом 72 единицы.",
        "Поскольку расположение всегда одинаково, то Naga Siren и её иллюзии располагаются случайно и смотрят в одну сторону.",
        "После задержки отдает заклинателю команду «стоп», отменяя все текущие приказы и приказы, отданные во время разделения.",
        "Повторное использование Mirror Image заменяет иллюзии от предыдущего использования независимо от того, под чьим контролем они находятся."
      ],
      "mana": "70\/85\/100\/115",
      "hotKey": "Q",
      "cooldown": "45\/40\/35\/30",
      "description": "Создаёт несколько иллюзий героя под его контролем.",
      "spellName": "Mirror Image",
      "params": [
        "Анимация применения: 0,65+0",
        "Задержка: 0,3",
        "Число иллюзий: 3 (TagTalent 4)",
        "Иллюзии наносят урона: 25%\/30%\/35%\/40% (TagTalent 34%\/39%\/44%\/49%)",
        "Иллюзии получают урона: 350%",
        "Длительность иллюзий: 26"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Слисис чувствует себя как рыба в воде, что мешает врагам выследить ее."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b4\/Naga_Siren_Ensnare_1.mp3\/revision\/latest?cb=20191216020847",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Сеть летит со скоростью в 1500 единиц.",
        "Применяет оцепенение к цели, предотвращая её передвижение и использование способностей для перемещения. Дает эффект True Sight на цель.",
        "Дает эффект True Sight на цель.",
        "Все иллюзии, принадлежащие Naga Siren, также используют фальшивую Ensnare на цель, находящуюся в 900 единицах от них. Они проигрывают ту же анимацию применения и выпускают свои сети одновременно с настоящей. Если у иллюзий нет никаких приказов и они просто стоят, то иллюзии развернутся лицом к цели и выпустят фальшивые сети. Если иллюзии движутся или атакуют, то они продолжают свои действия без разворота к цели. У них проиграется анимация применения, перекрывающая их анимации движения или атаки. При отмене применения иллюзии все равно проигрывают полную анимацию, но не выпускают сети. Фальшивые сети ни с чем не взаимодействуют и не применяют оцепенение.",
        "Они проигрывают ту же анимацию применения и выпускают свои сети одновременно с настоящей.",
        "Если у иллюзий нет никаких приказов и они просто стоят, то иллюзии развернутся лицом к цели и выпустят фальшивые сети.",
        "Если иллюзии движутся или атакуют, то они продолжают свои действия без разворота к цели. У них проиграется анимация применения, перекрывающая их анимации движения или атаки.",
        "При отмене применения иллюзии все равно проигрывают полную анимацию, но не выпускают сети.",
        "Фальшивые сети ни с чем не взаимодействуют и не применяют оцепенение."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "W",
      "cooldown": "14 (TagTalent 5)",
      "description": "Прерывает действия цели, а также опутывает ее сетью, не давая двигаться и телепортироваться.",
      "spellName": "Ensnare",
      "params": [
        "Анимация применения: 0,5+0,43",
        "Дальность применения: 650",
        "Длительность: 2\/3\/4\/5",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Единственный способ избежать ярости Слизеринца — не воевать с ним."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При срабатывании Rip Tide сначала применяет дебафф, затем наносит урон, а затем наносится урон от атаки.",
        "Если существо попадает в область действия нескольких Rip Tide, то снижение брони от них не складывается, но её длительность обновляется.",
        "Rip Tide использует псевдослучайное распределение."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой и все его иллюзии имеют шанс обдать врагов рядом с собой мощной волной воды, нанося им урон и снижая их броню на 4 сек.",
      "spellName": "Rip Tide",
      "params": [
        "Шанс срабатывания: 17%",
        "Радиус: 300",
        "Урон: 30\/40\/50\/60",
        "Снижение брони: 2\/4\/6\/8 (TagTalent 7\/9\/11\/13)",
        "Длительность: 4",
        "Снижение брони остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Поток из самых глубин сносит защиту противников сирены."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Naga_Siren_Song_of_the_Siren.mp3\/revision\/latest?cb=20191216020844",
      "effects": [
        "Способность Ненаправленная \/ Аура",
        "Действует на Врагов (TagAghanim Союзников)"
      ],
      "notes": [
        "Применяет к затронутым существам сон, предотвращая их действия до пробуждения.",
        "Затронутые существа во сне неуязвимы.",
        "Область действия заклинания следует за Naga Siren; если она уйдет достаточно далеко, то существа проснутся.",
        "Song of the Siren нельзя прервать. Только сама Naga Siren или её смерть могут завершить заклинание. При этом действующее на Naga Siren безмолвие не позволит ей отменить вручную песню.",
        "При этом действующее на Naga Siren безмолвие не позволит ей отменить вручную песню.",
        "Сон распространяется аурой. Её дебафф задерживается на 0.4 сек.",
        "Не действует на Рошана, варды и спрятанных существ. Действует на строения и неуязвимых существ.",
        "Лечение, даваемое улучшением от Aghanim's Scepter, также распространяется в виде ауры, которая задерживается на 0.4 сек. Лечение действует на каждого союзника. Хотя бафф накладывается на союзные строения, они не излечиваются. Восстанавливает до 74% от максимального запаса здоровья существа, если оно остается в радиусе действия на всю длительность. Восстановит все здоровье существа за 10 секунд.",
        "Лечение действует на каждого союзника. Хотя бафф накладывается на союзные строения, они не излечиваются.",
        "Восстанавливает до 74% от максимального запаса здоровья существа, если оно остается в радиусе действия на всю длительность.",
        "Восстановит все здоровье существа за 10 секунд."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "160\/120\/80",
      "description": "Все враги в определённой области вокруг героя впадают в магический сон, в котором они не могут ничего делать, но их нельзя атаковать. Повторное применение способности завершит заклинание преждевременно.",
      "spellName": "Song of the Siren",
      "params": [
        "Анимация применения: 1+0,3",
        "Радиус: 1000\/1200\/1400",
        "Регенерация здоровья в секунду: 0 (TagAghanim 10%)",
        "Длительность задержки ауры: 0.4",
        "Длительность: 7",
        "Способность каждую секунду восстанавливает союзникам долю от их максимального здоровья.",
        "Сон не действует на врагов с иммунитетом к заклинаниям. Лечение действует на союзников с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Мощный голос Слисис очаровывает орды противников, пока ее сородичи спешат ей на помощь."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Naga_Siren_Song_of_the_Siren_End.mp3\/revision\/latest?cb=20191216020843",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Song of the Siren до использования вспомогательного заклинания или завершения песни.",
        "При использовании Song of the Siren End прерывает произносимые заклинания Naga Siren.",
        "Уходит на 1-секундную перезарядку сразу после использования Song of the Siren.",
        "При использовании пробуждает затронутых врагов (TagTalent и прекращает лечение союзников) после завершения задержки ауры."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Пробудить врагов ото сна, что снова сделает их уязвимыми.",
      "spellName": "Song of the Siren End",
      "params": [
        "Анимация применения: 0+0,97"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.5,
    "attrAgility": 21.0
  },
  "description": "Naga Siren — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Mirror Image, создает три иллюзии Naga Siren, которыми можно управлять. Вторая способность, Ensnare, опутывает цель сетью, прерывает действия цели, не давая двигаться и телепортироваться. Пассивная способность, Rip Tide, даёт шанс Naga Siren и всем её иллюзиям обдать окружающих их врагов мощной волной, которая снижает их броню и наносит урон. Ультимативная способность, Song of the Siren, позволяет усыпить магическим сном всех врагов рядом с Naga Siren, в котором они не могут ничего делать или быть атакованными. Song of the Siren End преждевременно завершит заклинание. Улучшение с Aghanim's Scepter позволяет Song of the Siren восстанавливать 10% здоровья союзников в секунду.",
  "history": "Присяга самых именитых змееногих стражей, торжественно произносящаяся перед битвой, гласит: «Змееногий не ошибется». По правде говоря, это можно назвать и клятвой, и заветом, ведь не исполнившие долг исключаются из ордена навеки. Ошибка — удел кого угодно, но не змееногих. Незабываемый голос опытной военачальницы Слизис, когда-то глубоко уважаемой своей расой, служит ей оружием. Сильная, гибкая, змееподобная, она вела смертоносных стражей на защиту обитателей глубин и великих богатств затонувших городов. Но в последней битве при Крее её войска отбросила армия левиантов-мародёров, искавших подаяние для своего бога Мэльрона. После долгой и кровавой битвы, когда тела убирали из затонувших коридоров, обнаружилось, что из сокровищницы пропала драгоценная чаша. Из сотни стражников выжило лишь несколько, но их жертвенность и храбрость мало что значили. Было важно лишь украденное сокровище. Обесчещенную Слизис изгнали с позором и направили на поиски украденной чаши. Даже если бывшая стражница сможет положить в сокровищницу в сотни раз больше, она обречена жить вдали от своего народа до того дня, когда вернёт похищенное. Ведь никакое золото не сравнится с потерянной честью.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+5 к снижению брони от Rip Tide",
      "talentRight": "+25% к уклонению"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+1 иллюзия от Mirror Image",
      "talentRight": "-9 сек. перезарядки Ensnare"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+13 к силе",
      "talentRight": "+10 к ловкости"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+9% к урону Mirror Image",
      "talentRight": "+20 к скорости передвижения"
    }
  ]
}