{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Rod_of_Atos.mp3\/revision\/latest?cb=20170114190755",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1500.",
        "Применяет оцепенение на цель, запрещая ей передвигаться и использовать некоторые способности побега. Дает True Sight на цель. Не дает True Sight, если была применена в течение времени исчезновения заклинаний неуязвимости.",
        "Дает True Sight на цель. Не дает True Sight, если была применена в течение времени исчезновения заклинаний неуязвимости.",
        "Успешные применения на одну и ту же цель не складываются, но обновляется длительность."
      ],
      "mana": "50",
      "abilityName": "Cripple",
      "cooldown": null,
      "description": "На 2 секунды накладывает на врага оцепенение.",
      "params": [
        "Дальность применения: 1100",
        "Длительность оцепенения: 2"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_symbol)^Блокируется иммунитетом к заклинаниям\nОцепенение остается если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 200 здоровья, 1 регенерации здоровья, 1,67 брони, 10 скорости атаки, 240 маны, 1 регенерации маны и 10 урона от атаки.",
    "Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья, 1,67 брони, 10 скорости атаки, 240 маны, 1 регенерации маны и 10 урона от атаки.",
    "Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья, 1,67 брони, 10 скорости атаки, 240 маны, 1 регенерации маны и 20 урона от атаки."
  ],
  "cost": "2750",
  "lore": null,
  "consistFrom": [
    "Staff of Wizardry",
    "Crown",
    "Crown",
    "Recipe"
  ],
  "boughtFrom": "Магия",
  "name": "Rod of Atos",
  "description": "В этом простом на первый взгляд жезле заключено естество владыки чумы Атоса.",
  "trivia": null,
  "upgradeIn": [
    "Gleipnir"
  ],
  "bonuses": [
    "+10 к силе",
    "+10 к ловкости",
    "+20 к интеллекту"
  ],
  "tips": null
}