{"abilities":[{"spell":"Clinkz consumes the target enemy unit or skeleton, gaining max health and armor reduction on attack. If a hero dies under this debuff, Clinkz will gain a permanent damage bonus and Death Pact will be refreshed.","effects":["Ability Target Unit","Affects Enemy Units \/ Self","Damage Instant Kill"],"notes":["The targeted unit is instantly killed, counting as a regular last hit or deny.","Increases Clinkz' maximum health without keeping the current health percentage, then heals Clinkz for the same amount.","When the Death Pact buff expires, Clinkz' maximum health returns to normal, but his current health is kept, without exceeding his maximum health.","While having the buff, Clinkz' attacks place an armor reducing debuff on targets. Successive attacks do not stack the debuff, but refresh the duration instead. The attacks first apply the debuff, then their own damage. Works against every unit, including wards, buildings and allied units.","When an enemy hero (including clones, excluding illusions) dies with the debuff on them, Clinkz gains the permanent attack damage. It does not matter how the target dies or who kills them, the damage is always granted. Since the debuff can be placed on allies as well, denying allies grants the damage as well.","Successive casts of Death Pact do not stack, but refresh the duration and update the values.","Cannot be cast on ancient creeps and creep-heroes.","Cannot be cast on allied units. Can be cast on own Skeleton Archers, but not enemy or allied ones."],"mana":"60","elements":["Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"90","name":"Death Pact","description":["Cast Animation: 0.2+0.47","Cast Range: 900","Creep Max Level: 3\/4\/5\/6","Permanent Attack Damage Bonus: 5","Max Health Bonus: 250\/350\/450\/550 ( 600\/700\/800\/900)","Armor Reduction on Attack: 2\/3\/4\/5","Death Pact Duration: 55","Armor Reduction Duration: 3"],"hot_key":"Q","legacy_key":"T"},{"spell":"Imbues Clinkz's arrows with fire for extra damage.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Physical"],"notes":["The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","Can be cast on buildings but not on wards and allied units.","Choosing the damage upgrading talent immediately upgrades all of Clinkz's currently flying Searing Arrows.","When choosing the level 25 talent, whenever Searing Arrows is used, a different random target within its cast range is also targeted by a second Searing Arrow. Causes Clinkz to perform an instant attack on the chosen target whenever he launches a Searing Arrow. This instant attack can proc any attack modifier or on-hit effect like a regular attack. Since it uses the spell's cast range, effects which increase its cast range increase the secondary arrows' range as well. The secondary arrow has no target priorities. It simply chooses a random valid target within cast range. Since Searing Arrows affects buildings, the secondary arrows can target buildings as well."],"mana":"6\/8\/10\/12","elements":["Can be disjointed.","Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"0","name":"Searing Arrows","description":["Cast Range: 625 ( 750)","Damage: 20\/30\/40\/50 ( 35\/45\/55\/65)","Arrows per Cast: 1 ( 2)"],"hot_key":"W","legacy_key":"R"},{"spell":"Clinkz moves invisibly through units until the moment he attacks or uses an ability. When exiting invisibility, Clinkz gains bonus attack speed.","effects":["Ability No Target","Affects Self"],"notes":["Skeleton Walk does not interrupt Clinkz' channeling spells upon cast.","During the fade time, Clinkz can cast spells, use items and perform attacks without breaking the invisibility.","Invisibility is broken upon reaching the cast point of spells or items, or upon launching an attack.","Allows Clinkz to path through other units, including wards, but not through buildings.","Clinkz can pick up or drop items without breaking the invisibility.","The attack speed buff is granted whenever the invisibility buff is lost, no matter how.","When upgraded, the 2 archers spawn 250 range away from Clinkz, to his left and right respectively, facing the same direction. The archers only spawn upon losing the Skeleton Walk buff, no matter how. Both archers spawn simultaniously. The archers are the same as the ones summoned by Burning Army. See below for their stats. This means if Burning Army is not learned, no skeletons spawn."],"mana":"75","elements":["Pierces spell immunity."],"cooldown":"20\/19\/18\/17","name":"Skeleton Walk","description":["Cast Animation: 0+0","Fade Time: 0.6","Move Speed Bonus: 15%\/25%\/35%\/45% ( 45%\/55%\/65%\/75%)","Attack Speed Bonus: 70\/100\/130\/160","Number of Archers: 0 ( 2)","Invisibility Duration: 20\/25\/30\/35","Attack Speed Duration: 4 ( 8)"],"hot_key":"E","legacy_key":"W"},{"spell":"Clinkz summons an army of fiery ranged skeleton archers. Archers are immobile and die with 2 attacks from a hero. Skeletons use your current Searing Arrows ability and attack only heroes. Base damage is 28% of your hero's base damage. Attack range is equal to your hero's attack range.","effects":["Ability Target Point \/ Vector Targeting","Affects Enemy Heroes"],"notes":["Burning Army can be cast without having to face towards the targeted area.","Spawns the archers in the given line one after another, starting immediately upon cast. It takes 2.1\/2.8\/3.5 seconds for all archers to spawn.","The first archer spawns at the initial targeted location. Following archers spawn with 416.67\/312.5\/250 in between each. The archers spawn facing the same direction as Clinkz does as they spawn.","The spawned archers cannot be controlled. They automatically attack nearby enemy heroes, regardless of auto-attack settings. However, it is possible to turn the autocast on their Searing Arrows off.","The archers' base attack damage is periodically set equal to Clinkz' main attack damage. The archers also gain bonus damage for raw damage bonuses Clinkz has.","The attack range of the archers is also periodically set equal to Clinkz' attack range.","The archers only attack heroes, including illusions and clones, excluding creep-heroes. The archers follow default auto-attack rules. However, they only switch targets when their current target cannot be attacked anymore.","The archers have Searing Arrows, with the same level as on Clinkz. The level for it is set for each archer as it spawns. Leveling it afterwards does not update its level on the archers. Although being identical to Clinkz's Searing Arrows, and having a mana pool, the archers do not need mana to cast it. The archers fully benefit from the Searing Arrows damage and Searing Arrows multishot talents.","The archers do not block neutral creep camps.","The Skeleton Archers' attack damage is not reduced by Damage Block."],"mana":"125\/175\/225","elements":[],"cooldown":"110 ( 80)","name":"Burning Army","description":["Cast Animation: 0+0.67","Cast Range: 1200","Spawn Range: 1300","Number of Archers: 4\/5\/6","Archers Spawn Interval: 0.7","Hero Attacks to Destroy: 2","Non-Hero Attacks to Destroy: 8","Archers Attack Interval: 1.6","Archers Attack Damage: 28%","Duration: 20"],"hot_key":"R","legacy_key":"E"}],"bio":"At the base of the Bleeding Hills stretches a thousand-league wood—a place called The Hoven, where black pools gather the tarry blood of the uplands, and the king-mage Sutherex sits in benevolent rule. Once a sworn protector of the Hoven lands, Clinkz earned a reputation for his skill with a bow. In the three-hundredth year of the king-mage, the demon Maraxiform rose from sixth hell to lay claim to the forest. In response, the king-mage decreed an unbreakable spell: to any who slew the demon would be granted Life Without End. Unaware of the spell, Clinkz waded into battle, defending his lands against the demon’s fiery onslaught. Clinkz drove Maraxiform back to the gates of sixth-hell itself, where on that fiery threshold the two locked in a mortal conflict. Grievously wounded, the demon let out a blast of hellfire as Clinkz loosed his final arrow. The arrow struck the demon true as hellfire poured out across the land, lighting the black pools and burning Clinkz alive at the instant of the demon’s death. Thus, the mage’s spell took effect at the very moment of the archer’s conflagration, preserving him in this unholy state, leaving him a being of bones and rage, caught in the very act of dying, carrying hell’s breath with him on his journey into eternity.","talentsTips":["The attack range talent also affects the cast range of Searing Arrows.","The strength talent effectively grants Clinkz 200 health, 1 health regen and 0.8% magic resistance.","The agility talent effectively grants Clinkz 1.28 armor, 8 attack speed, 0.4% movement speed and 8 attack damage."],"trivia":["Bone Fletcher's alternate\/fun name was \"Clinkz Eastwood\", a pun on the name of famed actor Clint Eastwood.","The line \"Better to run than curse the road.\" is a reference to a Wolof (Senegal) proverb, \"Better to walk than curse the road\".","The phrase \"Thy Flesh Consumed.\" may be referred to the fourth and final episode of Ultimate Doom game, and also to King James version of the Bible \"And thou mourne at the last, when thy flesh and thy body are consumed\" PROVERBS 5:11.","Clinkz's phrase \"Ashes to ashes.\" is a reference to a common christian saying, popularized by the Book of Common Prayer \"[...]we therefore commit his body to the ground; earth to earth, ashes to ashes, dust to dust;[...]\"."],"talents":["Searing Arrows Multishot:+4s Skeleton Walk Attack Speed Duration","+350 Death Pact Health:+125 Attack Range","+15 Searing Arrows Damage:-30s Burning Army Cooldown","+10 Strength:+8 Agility"],"desc":"Clinkz, the Bone Fletcher, is a ranged agility hero specializing in ambushing lone enemies due to his high physical damage and incredible speed. Though frail and easy to kill, Skeleton Walk grants Clinkz stealth and haste to escape and re-position himself. This skill is also what makes Clinkz such an incredible ganker. This assassin is also equipped with Death Pact which consumes an enemy unit or creep for bonus health and an armor debuff. It also gives 5 permanent bonus damage for every hero killed while under its effect. Searing Arrows provide huge bonus damage, greatly injuring enemies in conjunction with Strafe. To aid his assault, Clinkz can summon an Burning Army of fiery bone archers who cut down his foes with powerful arrows."}