{"abilities":[{"spell":"Герой ведёт заградительный огонь, ненадолго, но значительно увеличивая свою скорость атаки. Также позволяет герою уклониться от снарядов.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["При использовании Strafe не прерывает произносимые способности Clinkz.","Не отменяет запуск снарядов заклинаний или атак врага. Их избегание происходит при достижении снарядами самого Clinkz. То есть, если действие Strafe истекает до попадания уже запущенного снаряда, то Clinkz его не избежит и снаряд подействует на него.","Не позволяет избегать снаряды от союзников. Это также относится к вражеским снарядам, отскочивших от союзников на Clinkz.","У избегания приоритет выше, чем у уклонения, поэтому оно не срабатывает на атаки, полученные под действием Strafe.","Несколько использований Strafe не складываются, но обновляют длительность и делают скорость атаки равной текущему уровню способности."],"mana":"75\/80\/85\/90","elements":["Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"30\/25\/20\/15","name":"Strafe","description":["Анимация применения: 0+0","Доп. скорость атаки: 110\/160\/210\/260","Длительность: 3.5 ( 7.5)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Наполняет стрелы героя огнем, увеличивая их урон.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Физический"],"notes":["Наносит урон отдельным источником, на который не действует снижение урона от Static Link или Enfeeble.","При этом Clinkz не может получать лечение от вампиризма, этот урон не может быть критическим и его нельзя усилить с помощью Empower или Руна двойного урона.","Можно применять к строениям, но нельзя применить к вардам и союзным юнитам.","Выбор таланта на дополнительный урон мгновенно улучшит все летящие Searing Arrows Clinkz.","При выборе таланта на 25-ом уровне при использовании способности также выбирается другая случайная цель в радиусе дальности применения для второй Searing Arrow. Поскольку способность использует свою дальности применения, эффекты, влияющие на дальность, также влияют на дальность второй стрелы. У второй стрелы нет приоритета для целей. Она выбирает случайную подходящую цель в пределах дальности применения. Поскольку Searing Arrows действует на строения, то вторая стрела также считает строения за цели."],"mana":"6\/8\/10\/12","elements":["Можно избежать.","Не блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Searing Arrows","description":["Дальность применения: 650 ( 775)","Урон: 20\/30\/40\/50 ( 35\/45\/55\/65)","Количество стрел: 1 ( 2)"],"hot_key":"W","legacy_key":"R"},{"spell":"Герой становится невидимым и передвигается сквозь других существ, пока не атакует или не применит способность.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["При использовании Skeleton Walk не прерывает произносимые способности Clinkz.","Пока проходит время до невидимости, Clinkz может использовать заклинания, предметы и совершать атаки без выхода из невидимости.","Невидимость спадает при достижении точки применения способностью или предметом или при попадании атаки по цели.","Позволяет Clinkz проходить сквозь других юнитов, включая варды, но исключая строения.","Clinkz может поднимать или выкидывать предметы без выхода из невидимости.","С Aghanim's Scepter в 250 единицах справа и слева от Clinkz появляются лучника, смотрящих в ту же сторону. Лучники появляются только при потере баффа Skeleton Walk любым способом. Оба юнита появляются одновременно. Призываются те же лучники, что используются способностью Burning Army. Ниже указаны их характеристики. То есть без изученной Burning Army скелеты не появляются."],"mana":"75","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/19\/18\/17","name":"Skeleton Walk","description":["Анимация применения: 0+0","Время до невидимости: 0,6","Доп. скорость передвижения: 15%\/25%\/35%\/45% ( 45%\/55%\/65%\/75%)","Число лучников: 0 ( 2)","Длительность: 20\/25\/30\/35"],"hot_key":"E","legacy_key":"W"},{"spell":"Герой призывает армию огненных скелетов-лучников. Лучники неподвижны и умирают от 2 атак героев. Скелеты используют способность Searing Arrows текущего уровня и атакуют только героев. Их базовый урон равен 80%\/100%\/120% от базового урона вашего героя. Их дальность атаки равна дальности атаки вашего героя.","effects":["Способность Направленная на точку \/ Направленная по вектору","Действует на Вражеских героев"],"notes":["Burning Army можно использовать без поворота лицом в сторону выбранной области.","Сразу после применения призывает лучников в линию одним за другим. Для появления всех лучников требуется 2.1\/2.8\/3.5 секунды.","Первый лучник появляется в начальной выбранной области. Следующие появляются на расстоянии 416.67\/312.5\/250 единиц друг от друга. Юниты смотрят в ту же сторону, что и Clinkz в момент их появления.","Призванных лучников нельзя контролировать. Они автоматически атакуют ближайших вражеских героев вне зависимости от настроек автоатаки. При этом у них возможно отключить автоприменение Searing Arrows.","Урон от атаки лучников периодически приравнивается к базовому урону Clinkz. То есть копируется только базовый урон и урон, даваемый основным атрибутом, но не дополнительный.","Дальность атаки лучников периодически приравнивается к дальности атаки Clinkz.","Лучники атакуют только героев, включая иллюзии и клонов, но исключая крипов-героев. Юниты используют стандартные правила автоатаки. Но при этом меняют цель только в случае, если их текущую цель больше нельзя атаковать.","Лучники обладают Searing Arrows того же уровня, что и Clinkz. Уровень устанавливается в момент появления. Поднятие уровня Searing Arrows после призыва не улучшит способность лучников. Хоть способность и идентична Searing Arrows Clinkz, но для использования лучникам не нужно расходовать ману. Юниты также используют талант на урон и на дополнительные цели Searing Arrows.","Лучники не блокируют лагери нейтральных крипов."],"mana":"125\/175\/225","elements":[],"cooldown":"110 ( 80)","name":"Burning Army","description":["Анимация применения: 0+0,67","Дальность применения: 1200","Дальность появления: 1300","Число лучников: 4\/5\/6","Интервал появления: 0.7","Ударов героев до уничтожения: 2","Ударов не-героев до уничтожения: 8","Интервал между атаками лучников: 1.6","Урон лучников: 80%\/100%\/120%","Длительность: 20"],"hot_key":"R","legacy_key":"E"}],"bio":"У подножия Кровоточащих холмов раскинулся гигантский лес Ховен, где тёмные заводи вбирают в себя смолистую кровь гор и где правит великодушный король-маг Сазерекс. Когда-то один лучник, верный защитник земель Ховена, заслужил добрую славу своей умелой стрельбой. На трёхсотый год правления короля-мага демон Мараксиформ восстал из шестого ада, чтобы предъявить свои права на лес. В ответ король-маг наложил неразрушимое заклинание: тот, кто убьёт демона, будет награждён жизнью без конца. Не подозревающий о заклинании лучник вступил в битву, защищая свои земли от пламенного натиска демона, и заставил Мараксиформа отступить к вратам шестого ада, в чьём огненном преддверьи они оказались заперты в смертельной битве. Сокрушённый ранами демон испустил сноп адского пламени, и тут же лучник отправил в полёт свою последнюю стрелу. Она поразила демона как раз в тот миг, когда адское пламя излилось по землям, воспламенило тёмные заводи и сожгло воина заживо. Заклинание мага сработало в самый миг сгорания — сохранив лучника в этом жутком состоянии, сделав его созданием из костей и ярости, остающемся на границе между жизнью и смертью и несущим дыхание ада на своей дороге в вечность.","talentsTips":["Талант на дальность атаки также влияет на дальность применения Searing Arrows.","Талант на силу в общем даёт Clinkz: 200 здоровья, 1 регенерации здоровья и 0.8% сопротивления магии.","Талант на ловкость в общем даёт Clinkz: 1.28 брони, 8 скорости атаки, 0.4% скорости передвижения и 8 урона от атаки."],"trivia":["Альтернативное\/шуточное имя героя \"Clinkz Eastwood\", которое звучит похоже на имя актера Клинта Иствуда (Clint Eastwood)","Реплика, \"Better to run than curse the road.\" - это отсылка к пословице народа Волоф(Сенегал), \"Better to walk than curse the road\".","Реплика, \"Thy Flesh Consumed.\" может быть отсылкой к четвертой и последней части игры Ultimate Doom, а также к переводу Библии короля Якова \"And thou mourne at the last, when thy flesh and thy body are consumed\" (Притч. V, 11)"],"talents":["Несколько целей у Searing Arrows:+4 сек. к длительности Strafe","+16 здоровья в секунду:+125 к дальности атаки","+15 к урону от Searing Arrows:-30 сек. перезарядки Burning Army","+10 к силе:+8 к ловкости"],"desc":"Clinkz — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Strafe, значительно увеличивает скорость атаки на короткое время, а также даёт возможность уклониться от любого направленного снаряда. Вторая способность, Searing Arrows, позволяет наносить дополнительный урон при атаках. Третья способность, Skeleton Walk, позволяет герою уходить в невидимость, при этом увеличивая его скорость передвижения. Чтобы усилить свою огневую мощь, Clinkz может использовать свой ультимейт Burning Army и призвать армию костяных лучников, которая уничтожит врагов своими мощными стрелами."}