{
  "abilities": [
    {
      "spell": "Герой ведёт заградительный огонь, ненадолго, но значительно увеличивая свою скорость атаки. Также позволяет герою уклониться от снарядов.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Strafe не прерывает произносимые способности Clinkz.",
        "Не отменяет запуск снарядов заклинаний или атак врага. Их избегание происходит при достижении снарядами самого Clinkz. То есть, если действие Strafe истекает до попадания уже запущенного снаряда, то Clinkz его не избежит и снаряд подействует на него.",
        "Не позволяет избегать снаряды от союзников. Это также относится к вражеским снарядам, отскочивших от союзников на Clinkz.",
        "У избегания приоритет выше, чем у уклонения, поэтому оно не срабатывает на атаки, полученные под действием Strafe.",
        "Несколько использований Strafe не складываются, но обновляют длительность и делают скорость атаки равной текущему уровню способности."
      ],
      "mana": "75\/80\/85\/90",
      "elements": [
        "Не может использоваться иллюзиями.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "30\/25\/20\/15",
      "name": "Strafe",
      "description": [
        "Анимация применения: 0+0",
        "Доп. скорость атаки: 110\/160\/210\/260",
        "Длительность: 3.5 ( 6.5)"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Наполняет стрелы Clinkz огнем, позволяя наносить дополнительный урон.",
      "effects": [
        "Способность Направленная на юнита \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Наносит урон отдельным источником, на который не действует снижение урона от Static Link или Enfeeble.",
        "При этом Clinkz не может получать лечение от вампиризма, этот урон не может быть критическим и его нельзя усилить с помощью Empower или Руна двойного урона.",
        "Можно применять к строениям, но нельзя применить к вардам и союзным юнитам.",
        "Выбор таланта на дополнительный урон мгновенно улучшит все летящие Searing Arrows Clinkz.",
        "При выборе таланта на 25-ом уровне при использовании способности также выбирается другая случайная цель в радиусе дальности применения для второй Searing Arrow. Поскольку способность использует свою дальности применения, эффекты, влияющие на дальность, также влияют на дальность второй стрелы. У второй стрелы нет приоритета для целей. Она выбирает случайную подходящую цель в пределах дальности применения. Поскольку Searing Arrows действует на строения, то вторая стрела также считает строения за цели."
      ],
      "mana": "12",
      "elements": [
        "Можно избежать.",
        "Не блокируется Linken's Sphere.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Searing Arrows",
      "description": [
        "Дальность применения: 640 ( 740)",
        "Урон: 30\/40\/50\/60 ( 60\/70\/80\/90)",
        "Количество стрел: 1 ( 2)"
      ],
      "hot_key": "W",
      "legacy_key": "R"
    },
    {
      "spell": "Герой становится невидимым и передвигается сквозь других существ, пока не атакует или не применит способность.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Skeleton Walk не прерывает произносимые способности Clinkz.",
        "Пока проходит время до невидимости, Clinkz может использовать заклинания, предметы и совершать атаки без выхода из невидимости.",
        "Невидимость спадает при достижении точки применения способностью или предметом или при попадании атаки по цели.",
        "Позволяет Clinkz проходить сквозь других юнитов, включая варды, но исключая строения.",
        "Clinkz может поднимать или выкидывать предметы без выхода из невидимости."
      ],
      "mana": "75",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "20\/19\/18\/17",
      "name": "Skeleton Walk",
      "description": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0,6",
        "Доп. скорость передвижения: 15\/25\/35\/45%",
        "Длительность: 20\/25\/30\/35"
      ],
      "hot_key": "E",
      "legacy_key": "W"
    },
    {
      "spell": "Герой призывает армию огненных скелетов-лучников. Лучники неподвижны и умирают от двух атак героев. Скелеты используют способность Searing Arrows текущего уровня и атакуют только героев. Их базовый урон равен базовому урону вашего героя. Их дальность атаки равна дальности атаки вашего героя.",
      "effects": [
        "Способность Направленная на точку \/ Вектор",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Burning Army можно использовать без поворота лицом в сторону выбранной области.",
        "Burning Army можно использовать без поворота лицом в сторону выбранной области.",
        "Сразу после применения призывает лучников в линию одним за другим. Для появления всех лучников требуется 2.4\/3.2\/4 секунды.",
        "Первый лучник появляется в начальной выбранной области. Следующие появляются на расстоянии 3750\/5000\/6250 единиц друг от друга. Юниты смотрят в ту же сторону, что и Clinkz в момент их появления.",
        "Призванных лучников нельзя контроллировать. Они автоматически атакуют ближайших вражеских героев вне зависимости от настроек автоатаки. При этом у них возможно отключить автоприменение Searing Arrows.",
        "Урон от атаки лучников периодически приравнивается к базовой атаке Clinkz. То есть копируется только базовый урон и урон, даваемый основным атрибутом, но не дополнительный.",
        "Дальность атаки лучников периодически приравнивается к дальности атаки Clinkz.",
        "Лучники атакуют только героев, включая иллюзии и клонов, но исключая крипов-героев. Юниты используют стандартные правила автоатаки. Но при этом меняют цель только в случае, если их текущую цель больше нельзя атаковать.",
        "Лучники обладают Searing Arrows того же уровня, что и Clinkz. Уровень устанавливается в момент появления. Поднятие уровня Searing Arrows после призыва не улучшит способность лучников. Хоть способность и идентична Searing Arrows Clinkz, но для использования лучникам не нужно расходовать ману. Юниты также используют талант на урон и на дополнительные цели Searing Arrows.",
        "Лучники не блокируют лагери нейтральных крипов."
      ],
      "mana": "125\/175\/225",
      "elements": [],
      "cooldown": "110",
      "name": "Burning Army",
      "description": [
        "Анимация применения: 0+0,67",
        "Дальность применения: 1200",
        "Дальность появления: 1300",
        "Число лучников: 4\/5\/6",
        "Интервал появления: 0,8",
        "Ударов героев до уничтожения: 2",
        "Ударов не-героев до уничтожения: 8",
        "Интервал между атаками лучников: 1.75\/1.6\/1.45",
        "Длительность: 20"
      ],
      "hot_key": "R",
      "legacy_key": "E"
    }
  ],
  "bio": "У подножия Кровоточащих холмов раскинулся гигантский лес — место под названием Ховен, где темные заводи вбирают в себя смолистую кровь гор и где правит великодушный король-маг Сазерекс. Однажды верный защитник земель Ховена, Clinkz, заслужил себе репутацию благодаря своему владению луком. На трехсотый год правления короля-мага демон Мараксиформ восстал из шестого ада, чтобы предъявить свои права на лес. В ответ король-маг наложил неразрушимое заклинание: тот, кто убьет демона, будет награжден Жизнью без конца. Не подозревающий о заклинании Clinkz вступил в битву, защищая свои земли от пламенной атаки демона. Clinkz заставил отступить Мараксиформа назад к самим вратам шестого ада, где горящая граница заперла обоих в смертельном бою. Почти добитый, демон испустил сноп адского пламени, и тут же Clinkz отправил в полет свою последнюю стрелу. Она поразила демона как раз в тот миг, когда адское пламя излилось по землям, воспламенив темные заводи и сжигая Clinkz заживо. Заклинание мага вступило в силу в самый момент сгорания лучника, сохранив его в этом дьявольском состоянии и оставляя его созданием из костей и ярости, пойманном на самом процессе смерти и несущим с собой дыхание ада в своем путешествии в вечность.",
  "talentsTips": [
    "Талант на дальность атаки также влияет на дальность применения Searing Arrows.",
    "Талант на броню не дается иллюзиям.",
    "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
    "Талант на сопротивление магии увеличивает сопротивление магии Clinkz до 34%.",
    "Талант на уклонение мультипликативно сочетается с другими источниками уклонения."
  ],
  "trivia": [
    "Альтернативное\/шуточное имя героя \"Clinkz Eastwood\", которое звучит похоже на имя актера Клинта Иствуда (Clint Eastwood)",
    "Реплика, Играть \"Better to run than curse the road.\" - это отсылка к пословице народа Волоф(Сенегал), \"Better to walk than curse the road\".",
    "Реплика, Играть \"Thy Flesh Consumed.\" может быть отсылкой к четвертой и последней части игры Ultimate Doom, а также к переводу Библии короля Якова \"And thou mourne at the last, when thy flesh and thy body are consumed\" (Притч. V, 11)"
  ],
  "talents": [
    "Несколько целей у Searing Arrows:+3 сек. к длительности Strafe",
    "+16 здоровья в секунду:+100 к дальности атаки",
    "+30 к урону от Searing Arrows:+20% к уклонению",
    "+5 к броне:+12% к сопротивлению магии"
  ],
  "tips": [
    "Хотя он может быть великолепным ганкером, Сlinkz является очень тонким героем, наносящим большое количество урона в тимфайтах, что делает его приоритетной целью. Лучше позволить своим союзникам инициировать, при этом находясь далеко от центра боя, атакуя обезвреженных или отставших от команды врагов.",
    "Способность Searing Arrows позволяет наносить большой урон оппонентам на линии. Однако не стоит забывать об их стоимости по мане.",
    "Используйте Skeleton Walk за некоторое время до атаки на противника или появления в драке. Это позволит вскоре использовать способность снова, что даст возможность убежать или догнать выживших героев противника.",
    "Всегда пытайтесь использовать Death Pact на самого cильного крипа в большом лагере нейтралов, наподобие кентавра-захватчика и сатира-мучителя.",
    "Из-за большого количества физического урона, наносимого в короткий промежуток времени, Clinkz отлично ломает вражеские башни."
  ],
  "desc": "Clinkz — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Strafe, значительно увеличивает скорость атаки на короткое время, а также даёт возможность уклониться от любого направленного снаряда. Вторая способность, Searing Arrows, позволяет наносить дополнительный урон при атаках. Третья способность, Skeleton Walk, позволяет герою уходить в невидимость, при этом увеличивая его скорость передвижения. Чтобы усилить свою огневую мощь, Clinkz может использовать свой ультимейт Burning Army и призвать армию костяных лучников, которая уничтожит врагов своими мощными стрелами."
}