{"abilities":[{"spell":"Lina channels the breath of a dragon, sending out a wave of fire that scorches every enemy in its path.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["Dragon Slave travels at a speed of 1200, taking 0.9 ( 1) seconds to travel the full distance.","Can hit units up to 1275 ( 1400) range away (travel distance + end radius).","The complete area is shaped like a cone."],"mana":"100\/115\/130\/145","elements":["Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"8 ( 2)","name":"Dragon Slave","description":["Cast Animation: 0.45+0.53","Cast Range: 800 ( 925)","Starting Radius: 275","Travel Distance: 1075 ( 1200)","End Radius: 200","Damage: 85\/160\/235\/310"],"hot_key":"Q","legacy_key":"D"},{"spell":"Summons a column of flames that damages and stuns enemies.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Light Strike Array destroys trees within the affected radius.","Light Strike Array first applies the debuff, then the damage.","The visual effects and the sound during the 0.5 second effect delay are only visible and audible to allies.","Lina has two different animations for this spell, leading to two possible cast backswing durations."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"7","name":"Light Strike Array","description":["Cast Animation: 0.45+0.67\/0.43","Cast Range: 625 ( 750)","Effect Radius: 225","Effect Delay: 0.5","Damage: 80\/120\/160\/200 ( 220\/260\/300\/340)","Stun Duration: 1.6\/1.9\/2.2\/2.5"],"hot_key":"W","legacy_key":"T"},{"spell":"Grants bonus attack and movement speed each time Lina casts a spell. Stacks with itself. Lasts 10 seconds.","effects":["Ability Passive","Affects Self"],"notes":["Using items does not trigger Fiery Soul.","Each spell cast refreshes the duration of the whole stack, making it theoretically possible to permanently have max stacks on.","At 2 stacks the buff grants 10%\/12%\/14%\/16% ( 14%\/16%\/18%\/20%) movement speed and 80\/110\/140\/170 ( 140\/170\/200\/230) attack speed.","At 3 stacks the buff grants 15%\/18%\/21%\/24% ( 21%\/24%\/27%\/30%) movement speed and 120\/165\/210\/255 ( 210\/255\/300\/345) attack speed."],"mana":"0","elements":["Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Fiery Soul","description":["Max Stacks: 3","Move Speed Bonus per Stack: 5%\/6%\/7%\/8% ( 7%\/8%\/9%\/10%)","Attack Speed Bonus per Stack: 40\/55\/70\/85 ( 70\/85\/100\/115)","Stack Duration: 10"],"hot_key":"E","legacy_key":"F"},{"spell":"Fires off a bolt of lightning at a single enemy unit, dealing massive damage.","effects":["Ability Target Unit","Affects Enemies","Damage Magical ( Pure)"],"notes":["Places a debuff on the target, which applies the damage upon expiring. The debuff lasts 0.25 seconds. This means the spell can be avoided by being invulnerable or hidden (or spell immune when not upgraded) as the debuff expires."],"mana":"280\/420\/680","elements":["Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"70\/60\/50","name":"Laguna Blade","description":["Cast Animation: 0.45+0.7","Cast Range: 600 ( 725)","Effect Delay: 0.25","Damage: 450\/650\/850"],"hot_key":"R","legacy_key":"G"}],"bio":"The sibling rivalries between Lina the Slayer, and her younger sister Rylai, the Crystal Maiden, were the stuff of legend in the temperate region where they spent their quarrelsome childhoods together. Lina always had the advantage, however, for while Crystal was guileless and naive, Lina's fiery ardor was tempered by cleverness and conniving. The exasperated parents of these incompatible offspring went through half a dozen homesteads, losing one to fire, the next to ice, before they realized life would be simpler if the children were separated. As the oldest, Lina was sent far south to live with a patient aunt in the blazing Desert of Misrule, a climate that proved more than comfortable for the fiery Slayer. Her arrival made quite an impression on the somnolent locals, and more than one would-be suitor scorched his fingers or went away with singed eyebrows, his advances spurned. Lina is proud and confident, and nothing can dampen her flame.","talentsTips":["The cast range talent also affects the max distance of Dragon Slave.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["The original Lina Inverse \"The Slayer\" was modeled after the main character from the novels\/anime\/manga Slayers where Light Strike Array, Dragon Slave and Laguna Blade are all spells used by the original Lina Inverse.","Lina's line \"Better to burn out than fade away\" is a reference to the Neil Young song, My, My, Hey, Hey. The line also appears in the suicide note of Kurt Cobain.","The line \"Turn me over... I'm done.\" is a reference to Lawrence of Rome who was roasted alive on a giant grill and joked, \"Turn me over — I'm done on this side.\"","Lina's rival response towards Batrider \"Why'd you stop? This isn't Batrider country.\" is a reference to a line in the movie Fear and Loathing in Las Vegas.","In older versions of DotA, Lina was a male hero that used the Blood Mage model, also used by the Invoker. In these versions, Lina was known as Link Inverse.","Lina's line \"It's not the heat, it's the humiliation.\" is a reference to \"It's not the heat, it's the humidity.\" a quote from Yogi Berra.","Lina's coils around her neck are possibly a representation of Kayan Lahwi women in Myanmar, who are also referred to as \"dragon women\"."],"talents":["+175 Attack Range:-6s Dragon Slave Cooldown","+30\/2% Fiery Soul Per Stack:+14% Spell Amplification","+140 Light Strike Array Damage:+350 Health","+125 Cast Range:+30 Damage"],"desc":"Lina, the Slayer, is a ranged Intelligence hero, adept at destroying enemy heroes quickly by delivering massive bursts of magical damage, making her one of the most effective gankers in the game. She possesses immense damaging capabilities all throughout the game, but is very fragile. Two of her fiery spells are her main source of damage, Dragon Slave sends a wave of fire to burn enemies in her path while Light Strike Array stuns them with a concentrated pillar of solar flame. Each of her spells deals great damage early on and has a low cooldown. Her Fiery Soul bolsters her attack and movement speed every time she casts a spell, which gives her scaling damage for the later game. Laguna Blade, her ultimate, is her ace in the hole. Lina fires off a huge bolt of lightning at a single target, dealing colossal damage. Laguna Blade's damage is staggering in early-mid game, and late game is still enough to destroy frail enemy heroes. Dragon Slave, Light Strike Array, and Laguna Blade are incredible flaming nukes that can incinerate her target instantly, and Fiery Soul allows her to transition into a strong and fast physical attacker. Though her power falls from its peak late game, mana-boosting and damage-increasing items can be purchased to keep herself up."}