{"abilities":[{"spell":"Lina призывает дыхание дракона, сжигающее всех врагов на своем пути.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Дыхание дракона распространяется со скоростью 1200, требуется 0.9 ( 0.98) секунды, чтобы достигнуть максимальной дальности.","Может задевать врагов на расстоянии до 1275 ( 1375) единиц (складывается из дальности прохождения и конечного радиуса).","Вся область поражения имеет форму конуса."],"mana":"100\/115\/130\/145","elements":["Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"8 ( 2)","name":"Dragon Slave","description":["Анимация применения: 0,45+0,53","Дальность применения: 800 ( 925)","Начальный радиус: 275","Дальность прохождения: 1075 ( 1200)","Конечный радиус: 200","Урон: 85\/160\/235\/310"],"hot_key":"Q","legacy_key":"D"},{"spell":"Призывает столб пламени, который сокрушает и оглушает врагов.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Уничтожает деревья в зоне действия способности.","Визуальный эффект и звук во время задержки длительностью 0.5 секунды видны только союзникам.","У Lina есть две различные анимации для этой способности, что приводит к двум возможным длительностям задержки после применения."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"7","name":"Light Strike Array","description":["Анимация применения: 0,45+0,67\/0,43","Дальность применения: 625 ( 750)","Радиус: 225","Задержка: 0.5","Урон: 80\/120\/160\/200 ( 220\/260\/300\/340)","Длительность оглушения: 1.6\/1.9\/2.2\/2.5"],"hot_key":"W","legacy_key":"T"},{"spell":"Дает бонус к скорости атаки и передвижения всякий раз, когда Lina использует заклинание. Бонусы накапливаются. Действует 10 секунд.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Использование предметов не активирует эту способность.","Применение любой другой способности обновляет время действия этой, в теории возможно постоянно иметь максимальное количество зарядов.","2 заряда дают 10%\/12%\/14%\/16% ( 14%\/16%\/18%\/20%) к скорости передвижения и 80\/110\/140\/170 ( 130\/160\/190\/220) к скорости атаки.","3 заряда дают 15%\/18%\/21%\/24% ( 21%\/24%\/27%\/30%) к скорости передвижения и 120\/165\/210\/255 ( 195\/240\/285\/330) к скорости атаки."],"mana":"0","elements":["Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Fiery Soul","description":["Максимально зарядов: 3","Доп. скорость передвижения: 5%\/6%\/7%\/8% ( 7%\/8%\/9%\/10%)","Доп. скорость атаки: 40\/55\/70\/85 ( 65\/80\/95\/110)","Длительность бонуса: 10"],"hot_key":"E","legacy_key":"F"},{"spell":"Выпускает разряд молнии в одного врага, нанося сокрушительный урон.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический ( Чистый)"],"notes":["Цель помечается негативным эффектом, который наносит урон, как только у него истечет срок действия. Эффект длится 0.25 секунды. Способность можно избежать с помощью некоторых предметов и способностей, дающих неуязвимость или исчезновение (или неуязвимостью к магии, если способность не была улучшена Aghanim's Scepter), пока эффект не нанес урон."],"mana":"280\/420\/680","elements":["Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"70\/60\/50","name":"Laguna Blade","description":["Анимация применения: 0,45+0,7","Дальность применения: 600 ( 725)","Задержка урона: 0.25","Урон: 450\/650\/850"],"hot_key":"R","legacy_key":"G"}],"bio":"Соперничество огненной волшебницы и её младшей ледяной сестрицы стали поистину легендарными в тех тихих местах, где девочки провели своё буйное детство. И всё же старшая сестра всегда одерживала верх, ведь её горячность и пыл уравновешивались смекалкой и коварством, а вот младшая сестра была проста и наивна. Отчаявшиеся родители несовместимых отпрысков меняли дома один за другим, теряя их то в огне, то во льду. В конце концов они поняли: жить станет проще, если разлучить сестёр. Старшую отправили далеко на юг, к терпеливой тётушке в знойную пустыню Мизрула, погода которой пришлась любительнице огня по душе. Новая соседка тут же всполошила неторопливый местный народ и опалила пальцы и брови далеко не одного горе-ухажёра. Она горда и уверена в себе, и ничто не затушит её пламя.","talentsTips":["Талант на дальность способностей также действует на максимальную дальность Dragon Slave.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Прототипом Лины является одноименный персонаж аниме сериалов, фильмов, манги, игр и книг из серии Slayers. В Dota 2 были так же сохранены названия способностей персонажа, таких как Dragon Slave, Light Strike Array и Laguna Blade (в оригинале Ragna Blade).","Lina - это первый созданный герой в Dota 2.","Lina - сестра Crystal Maiden","Фраза при атаке \" Helter swelter! \" - отсылка к песне группы The Beatles - Helter Skelter.","Фраза Лины \" Лучше сгореть, чем угаснуть \" взята из предсмертной записки Курта Кобейна."],"talents":["+175 к дальности атаки:-6 сек. к перезарядке Dragon Slave","+25\/2% ускорения за эффект Fiery Soul:+12% к урону от способностей","+140 к урону от Light Strike Array:+350 к здоровью","+125 к дальности способностей:+30 к урону"],"tips":["Сочетание способности Light Strike Array с другими оглушающими способностями, такими как Magic Missile и Storm Hammer делает Lina серьёзным ганкером на ранней стадии игры.","Предметы, помогающие быстро подбираться к противнику, такие как Blink Dagger, Force Staff или Phase Boots, будут весьма полезны при использовании Light Strike Array, а следовательно и для всей связки заклинаний.","В командных сражениях, сосредотачивайте свои атаки на героях поддержки или на врагах с низким уровнем здоровья.","Laguna Blade можно применять перед началом боя, чтобы вынудить одного из противников отступить, снижая потенциал всей вражеской команды.","Не будьте скромными использовать Laguna Blade в середине игры чтобы ослабить врага. Низкий кулдаун себя окупает. Можно также сочетать с Soul Ring"],"desc":"Lina — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Данный герой отлично подходит для нанесения немалого урона противнику, так как благодаря своим способностям, - Lina может как оглушать противника, так и наносить сокрушительный урон. Способность Dragon Slave позволяет герою сжигать пламенем всё на своем пути, нанося урон. Light Strike Array - дает герою возможность вызывать огненный столб, который наносит урон и оглушает противника на некоторое время. Пассивная способность Fiery Soul дает герою бонусы к скорости боя и передвижения за каждое произнесенное заклинание. Способность Laguna Blade позволяет герою выпустить разряд молнии в противника, нанося огромный урон."}