{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Luna_Lucent_Beam_1.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Lucent Beam сначала наносит урон, затем применяет дебафф.",
        "Оружие героя во время анимации применения выпускает немного частиц, видимых всем.",
        "Даёт наземный обзор с радиусом 200 вокруг цели применения на 3 секунды.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Lucent Beam даёт стакающийся бонус к урону от атаки за каждого задетого лучом героя, включая лучи от Eclipse. Длительность эффектов не зависит друг от друга, получение нового не обновит длительность предыдущих. Число получаемого бонусного урона от атаки отображается на иконке эффекта и в его описании. Считает иллюзии и крипов-героев за героев. Возможно получить до 30\/30\/30\/30 (TagTalent 30\/30\/45\/45) бонусного урона от атаки, если применять способность каждый раз по истечение перезарядки.",
        "Длительность эффектов не зависит друг от друга, получение нового не обновит длительность предыдущих.",
        "Число получаемого бонусного урона от атаки отображается на иконке эффекта и в его описании. Считает иллюзии и крипов-героев за героев.",
        "Считает иллюзии и крипов-героев за героев.",
        "Возможно получить до 30\/30\/30\/30 (TagTalent 30\/30\/45\/45) бонусного урона от атаки, если применять способность каждый раз по истечение перезарядки.",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Lucent Beam выпускает атаки при выборе соответствующего таланта. Применяет 2 мгновенные атаки по случайным целям в радиусе 500 вокруг луча. Могут сработать любые модификаторы атаки и эффекты от удара (включая Moon Glaives). Эта атака может промахнуться, но она игнорирует обезоруживание. Цель в радиусе выбирается случайно без каких-либо приоритетов. Не может атаковать невидимых существ, но может атаковать в существ в тумане войны. Мгновенные атаки исходят от выбранной точки или существа. При применении на землю, атака исходит из выбранной точки, даже если луч поразил вражеского героя. Выбор таланта не улучшает лучи от Eclipse.",
        "Могут сработать любые модификаторы атаки и эффекты от удара (включая Moon Glaives). Эта атака может промахнуться, но она игнорирует обезоруживание.",
        "Цель в радиусе выбирается случайно без каких-либо приоритетов.",
        "Не может атаковать невидимых существ, но может атаковать в существ в тумане войны.",
        "Мгновенные атаки исходят от выбранной точки или существа.",
        "При применении на землю, атака исходит из выбранной точки, даже если луч поразил вражеского героя.",
        "Выбор таланта не улучшает лучи от Eclipse."
      ],
      "mana": "9\/8\/7\/6 (TagTalent 7\/6\/5\/4)",
      "item_behaviour": [],
      "name": "Lucent Beam",
      "cooldown": "90\/100\/110\/120",
      "description": "Направляет во врага луч лунной энергии, нанося урон и ненадолго оглушая его.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,47",
        "Дальность применения: 800",
        "Урон: 80\/160\/240\/320 ( 180\/260\/340\/420)",
        "Длительность оглушения: 0,8 ( 1,2)",
        "Бонус к урону от атаки: 15",
        "Длительность бонуса: 12",
        "Радиус поиска врага для мгновенной атаки: 500",
        "Количество мгновенных: 2"
      ],
      "legacy_key": "C",
      "story": "Селемине поражает тех, кто вторгается в Серебристый лес."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3c\/Luna_Moon_Glaives.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "notes": [
        "Отскочившие глефы летят с той же скоростью, что и снаряд атаки героя. Это значит, что их скорость может быть увеличена при помощи других бонусов ко скорости снарядов.",
        "Это значит, что их скорость может быть увеличена при помощи других бонусов ко скорости снарядов.",
        "Moon Glaives срабатывают только при успешном попадании снаряда в цель. То есть при промахе или избегании атаки способность не сработает.",
        "Не производит мгновенные атаки. Урон от снарядов считается обычным уроном от заклинаний. На глефы не срабатывают никакие модификаторы атаки и они не считаются атаками для эффектов, срабатывающих от атаки (например, Retaliate). Также глефы игнорируют уклонение. При этом блокировка урона уменьшает их урон. Хотя урон от отскочивших глеф считается за урон заклинаний, при этом они игнорируют усиление урона от заклинаний и не используют вампиризм заклинаниями.",
        "На глефы не срабатывают никакие модификаторы атаки и они не считаются атаками для эффектов, срабатывающих от атаки (например, Retaliate).",
        "Также глефы игнорируют уклонение. При этом блокировка урона уменьшает их урон.",
        "Хотя урон от отскочивших глеф считается за урон заклинаний, при этом они игнорируют усиление урона от заклинаний и не используют вампиризм заклинаниями.",
        "Урон глефов зависит от урона запустившей их атаки и рассчитывается в начале атаки. То есть они взаимодействуют с критическим ударом и Quell, поскольку эффекты учитываются при расчете начального урона. Также неважно, сколько урона фактически получила цель, поскольку расчет происходит до попадания снаряда. При этом остальные бонусы к урону не учитываются (например, срабатывание Javelin), поскольку их урон наносится после урона атаки.",
        "То есть они взаимодействуют с критическим ударом и Quell, поскольку эффекты учитываются при расчете начального урона.",
        "Также неважно, сколько урона фактически получила цель, поскольку расчет происходит до попадания снаряда.",
        "При этом остальные бонусы к урону не учитываются (например, срабатывание Javelin), поскольку их урон наносится после урона атаки.",
        "С учетом всех отскоков, увеличивает урон Luna на 71,88%\/93,75%\/120,26%\/153,89% (TagTalent 93,1%\/122,47%\/158,69%\/205,88%).",
        "Может отскочить обратно в тех же существ, если способность поразит других ближайших. Если поблизости нет существ, способность ничего не сделает. Не может отскочить в невилимых противников и во врагов в тумане войны. Может отскочить в бесплотных существ, но не нанесёт им урон. Не может отскочить в невидимых существ. Глефы не перескакивают на варды, курьеров и союзников, но при атаке могут от них отскочить. Полностью работает против построек.",
        "Не может отскочить в невилимых противников и во врагов в тумане войны.",
        "Может отскочить в бесплотных существ, но не нанесёт им урон. Не может отскочить в невидимых существ.",
        "Глефы не перескакивают на варды, курьеров и союзников, но при атаке могут от них отскочить.",
        "Полностью работает против построек.",
        "При изучении оружие героя начинает выделять голубые частицы, видимые всем."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Moon Glaives",
      "cooldown": null,
      "description": "Заклинает глефы героя, позволяя им отскакивать по нескольким врагам. Каждый следующий отскок наносит меньше урона.",
      "hot_key": "W",
      "params": [
        "Радиус отскоков: 500",
        "Отскоков: 3\/4\/5\/6",
        "Снижение урона за отскок: 56%\/50%\/44%\/38% ( 48%\/42%\/36%\/30%)"
      ],
      "legacy_key": "G",
      "story": "Аккуратно заострённые двусторонние клинки лунной наездницы рассекают ряды противников."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Союзников"
      ],
      "notes": [
        "Увеличивает ночной обзор героя до 1050\/1300\/1550\/1800.",
        "Даёт фиксированный бонусный урон от атаки.",
        "Бафф ауры задерживается на 6\/14\/20\/28 сек.",
        "Действует на неуязвимых, но не спрятанных существ. Считает крипов-героев и клонов за героев.",
        "Считает крипов-героев и клонов за героев.",
        "При изучении Luna испускает очень слабые пульсирующие частицы."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Lunar Blessing",
      "cooldown": null,
      "description": "Повышает урон от атак владельца способности и союзных героев неподалёку. Ночью действует по всей карте и увеличивает дальность обзора владельца.",
      "hot_key": "E",
      "params": [
        "Радиус днём: 1200",
        "Радиус ночью: Глобальный",
        "Дополнительный обзор ночью: 250\/500\/750\/1000",
        "Дополнительный урон от атаки: 6\/14\/20\/28 ( 41\/49\/55\/63)",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "L",
      "story": "Богиня луны благоволит своим последователям."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5d\/Luna_Eclipse_1.mp3\/revision\/latest?cb=20191216015818",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Eclipse изменяет время суток со дня в ночь на 10 секунд. Смена не связана с длительностью способности. Способности, изменяющие время суток, имеют следующий приоритет: Supernova ➤ Eclipse ➤ Dark Ascension. Не мешает ночи, вызванной Dark Ascension, поэтому ночь, вызванная Night Stalker, не приостанавливается.",
        "Способности, изменяющие время суток, имеют следующий приоритет: Supernova ➤ Eclipse ➤ Dark Ascension.",
        "Не мешает ночи, вызванной Dark Ascension, поэтому ночь, вызванная Night Stalker, не приостанавливается.",
        "Лучи наносят урон в соответствии с текущим уровнем Lucent Beam; если способность не изучена, Eclipse не будет наносить урона. Максимальный возможный урон по одной цели (до уменьшений): Уровень 1: 400 (TagTalent 900) (TagTalent 480\/960\/1440, 1080\/2160\/3240) Уровень 2: 800 (TagTalent 1300) (TagTalent 960\/1920\/2880, 1560\/3120\/4680) Уровень 3: 1200 (TagTalent 1700) (TagTalent 1440\/2880\/4320, 2040\/4080\/6120) Уровень 4: 1600 (TagTalent 2100) (TagTalent 1920\/3840\/5760, 2520\/5040\/7560)",
        "Максимальный возможный урон по одной цели (до уменьшений): Уровень 1: 400 (TagTalent 900) (TagTalent 480\/960\/1440, 1080\/2160\/3240) Уровень 2: 800 (TagTalent 1300) (TagTalent 960\/1920\/2880, 1560\/3120\/4680) Уровень 3: 1200 (TagTalent 1700) (TagTalent 1440\/2880\/4320, 2040\/4080\/6120) Уровень 4: 1600 (TagTalent 2100) (TagTalent 1920\/3840\/5760, 2520\/5040\/7560)",
        "Уровень 1: 400 (TagTalent 900) (TagTalent 480\/960\/1440, 1080\/2160\/3240)",
        "Уровень 2: 800 (TagTalent 1300) (TagTalent 960\/1920\/2880, 1560\/3120\/4680)",
        "Уровень 3: 1200 (TagTalent 1700) (TagTalent 1440\/2880\/4320, 2040\/4080\/6120)",
        "Уровень 4: 1600 (TagTalent 2100) (TagTalent 1920\/3840\/5760, 2520\/5040\/7560)",
        "Не поражает невидимых существ и существ в тумане войны.",
        "Несколько применений (с и без Aghanim's Scepter) действуют независимо друг от друга.",
        "При смерти героя Eclipse прерывается. При этом 10-секундная ночь продолжается.",
        "Оружие героя во время анимации применения испускает немного частиц, видимых для всех.",
        "При выборе дающего оглушения от Eclipse таланта каждый луч также будет оглушать пораженных врагов на 0,25 сек. В отличие от урона оглушение применяется независимо от текущего уровня Lucent Beam, так как оно не связано с оглушением способности. Лучи сначала наносят урон, затем применяют дебафф. Талант мгновенно применяет эффект, поэтому лучи уже активированной способности будут оглушать.",
        "В отличие от урона оглушение применяется независимо от текущего уровня Lucent Beam, так как оно не связано с оглушением способности.",
        "Лучи сначала наносят урон, затем применяют дебафф.",
        "Талант мгновенно применяет эффект, поэтому лучи уже активированной способности будут оглушать.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Позволяет применять способность на область или любое союзное существо. ↓↓ Двойное нажатие применяет способность на себя. При применении на союзника будет следовать за ним, как при обычном применении следует за Luna. Может выбрать целью любое союзное существо, за исключением вардов и построек. При улучшении и применении на союзника способность прервется при смерти союзника, а не Luna. При применении на землю способность будет воздействовать вокруг выбранной точки. При улучшении и применении на землю способность прервется при смерти Luna. Даёт наземный обзор в радиусе 675 единиц на всю длительность в случае, если существо не было выбрано.",
        "↓↓ Двойное нажатие применяет способность на себя.",
        "При применении на союзника будет следовать за ним, как при обычном применении следует за Luna. Может выбрать целью любое союзное существо, за исключением вардов и построек. При улучшении и применении на союзника способность прервется при смерти союзника, а не Luna.",
        "Может выбрать целью любое союзное существо, за исключением вардов и построек.",
        "При улучшении и применении на союзника способность прервется при смерти союзника, а не Luna.",
        "При применении на землю способность будет воздействовать вокруг выбранной точки. При улучшении и применении на землю способность прервется при смерти Luna. Даёт наземный обзор в радиусе 675 единиц на всю длительность в случае, если существо не было выбрано.",
        "При улучшении и применении на землю способность прервется при смерти Luna.",
        "Даёт наземный обзор в радиусе 675 единиц на всю длительность в случае, если существо не было выбрано.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Попадание луча от Eclipse даёт стакающийся бонус к урону от атаки за каждого задетого лучом героя. Длительность эффектов не зависит друг от друга, получение нового не обновит длительность предыдущих. Число получаемого бонусного урона от атаки отображается на иконке эффекта и в его описании. Считает иллюзии и крипов-героев за героев. Возможно получить до 75 ‒ 90\/135\/180 (TagTalent или 90\/180\/270) бонусного урона от атаки при попадании всеми лучами по вражеским героям.",
        "Длительность эффектов не зависит друг от друга, получение нового не обновит длительность предыдущих.",
        "Число получаемого бонусного урона от атаки отображается на иконке эффекта и в его описании. Считает иллюзии и крипов-героев за героев.",
        "Считает иллюзии и крипов-героев за героев.",
        "Возможно получить до 75 ‒ 90\/135\/180 (TagTalent или 90\/180\/270) бонусного урона от атаки при попадании всеми лучами по вражеским героям.",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ При выборе соответствующего таланта лучи от Eclipse оглушают врагов на 0,25 сек. Длительность оглушения не зависит от длительности оглушения от Lucent Beam и применяется вне зависимости от её уровня. Луч от Eclipse сначала наносит урон, затем применяет оглушение Изучение этого мгновенно улучшит текущее применение Eclipse.",
        "Длительность оглушения не зависит от длительности оглушения от Lucent Beam и применяется вне зависимости от её уровня.",
        "Луч от Eclipse сначала наносит урон, затем применяет оглушение",
        "Изучение этого мгновенно улучшит текущее применение Eclipse.",
        "ПРИМЕЧАНИЯ К SPELL STEAL Лучи от Eclipse наносят урон в зависимости от уровня Lucent Beam у Luna на момент кражи."
      ],
      "mana": "140\/130\/120 (TagTalent 115\/105\/95)",
      "item_behaviour": [],
      "name": "Eclipse",
      "cooldown": "150\/200\/250",
      "description": "Бьёт случайных врагов неподалёку лучами от способности Lucent Beam текущего уровня. Лучи не оглушает и могут ударить по одному существу ограниченное число раз. Также способность на 10 сек. превращает день в ночь.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,5+0,37",
        "Радиус: 675",
        "Всего лучей: 6\/9\/12 ( 6\/12\/18)",
        "Макс. лучей на существо: 5 ( 6\/12\/18)",
        "Интервал лучей: 0,6 ( 0,3)",
        "Длительность: 2,4\/4,2\/6 ( 1,5\/3,3\/5,1)",
        "Длительность ночи: 10",
        "Длительность оглушения за луч: 0,25",
        "Дальность применения: 2500"
      ],
      "legacy_key": "E",
      "story": "При особой необходимости Селемине сама нисходит в мир, затмевая свет и надежды противников."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 3.4,
    "attrAgility": 24.0
  },
  "description": "Бросает во врагов отскакивающие снаряды Luna быстро врывается в битву, кромсая противника своими отскакивающими атаками. Если враги идут в наступление, она призывает на помощь силу Луны и сокрушает их жгучим лучом или лунным градом.  Керри Быстрый урон Осада ★☆☆",
  "history": "Как она опустилась до такого? Бич равнин, беспощадный повелитель людей и зверей, она могла сеять страх там, где ей вздумается. Теперь она была далеко от своей родины, на грани безумия от голода и месяцев скитаний, а её армия либо была давно мертва, либо их настигла участь хуже смерти. Едва она преступила границу древнего леса, в темноте блеснул пылающий взор. Что-то красивое и смертельное искало себе добычу в увядающих сумерках. Бесшумно оно развернулось и ушло. Ей завладела ярость. Схватив ржавый кинжал, она ринулась вслед за зверем, в надежде вернуть хотя бы частичку былой славы, но добыча все ускользала от неё. Три раза она загоняла зверя в угол, и три раза она нападала, но видела лишь ускользающую в леса тень. Освещая все вокруг, взошла полная луна, и отследить зверя стало легче. Достигнув светлой вершины холма, огромная кошка, более не скрываясь, сидела в ожидании. Когда женщина стала размахивать кинжалом, зверь поднялся, взревел и кинулся на неё. Казалось, смерть наконец настигла её. Но она спокойно остановилась. Через мгновение зверь выбил кинжал из её рук и исчез в лесу. Тишина. Фигуры в капюшонах приблизились к ней. В почтительных тонах они поведали, что Селемине, Богиня Луны выбрала её, вела её и испытала её. Невольно она выполнила священный ритуал Темной Луны, воинов Серебряных лесов. Ей предложили выбор: присоединиться к Темной Луне и поклясться служить Селемине или уйти и никогда не возвращаться. Она не колебалась. Принимая своё освобождение, она отказалась от кровавого прошлого, и с тех пор её имя — Luna, устрашающая лунная наездница, беспощадная и непоколебимая защитница Серебряных лесов."
}