{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b4\/Refresher_Shard_Reset_Cooldowns.mp3\/revision\/latest?cb=20191227195521",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "Only refreshes items in the user's inventory. Items in the stash, in other units' inventories or dropped items are unaffected.",
        "Only refreshes items owned by the user. Allied items in the inventory are not refreshed.",
        "Refreshes all spells owned by the user. This includes hidden or inactive spells (e.g. invoked spells). This means that it does not refresh all spells for Rubick. Stolen spells are only refreshed when he owns them upon refreshing. Morphling’s inactive spells during Morph aren’t refreshed either. Only his currently active spells are refreshed.",
        "This means that it does not refresh all spells for Rubick. Stolen spells are only refreshed when he owns them upon refreshing.",
        "Morphling’s inactive spells during Morph aren’t refreshed either. Only his currently active spells are refreshed.",
        "Also replenishes all charges of charge-based abilities.",
        "Does not skip the fade delay for Cloak and Dagger.",
        "Visually resets the cooldown of Tranquil Boots, but does not skip the broken state.",
        "Does not refresh Refresher Orb, Ex Machina or the cooldown of other Refresher Shards.",
        "Does not share cooldown with Refresher Orb."
      ],
      "mana": null,
      "abilityName": "Reset Cooldowns",
      "cooldown": "200",
      "description": "Resets the cooldowns of all your items and abilities.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Refresher Shard is completely sharable. Although Refresher Shard cannot be bought, it can be sold for 500 gold. However, only the hero whose main inventory it enters first can sell it. If a courier is the first unit to pick up the shard, it cannot be sold by anyone, even if it remains on the courier or is given to a hero afterwards. If a Refresher Shard directly enters a backpack when picked up, it remains sellable by anyone until it enters any unit's main inventory.",
    "Although Refresher Shard cannot be bought, it can be sold for 500 gold. However, only the hero whose main inventory it enters first can sell it.",
    "If a courier is the first unit to pick up the shard, it cannot be sold by anyone, even if it remains on the courier or is given to a hero afterwards.",
    "If a Refresher Shard directly enters a backpack when picked up, it remains sellable by anyone until it enters any unit's main inventory.",
    "Refresher Shards do not stack in the inventory. Each acquired instance requires its own slot.",
    "Unlike the Aegis of the Immortal, Refresher Shard is not reclaimed by Roshan."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Roshan Drop",
  "name": "Refresher Shard",
  "description": "Across an epoch of endless battle, the Immortal's will to triumph never faltered.",
  "trivia": [
    "The Refresher Shard's icon and in-game model are based on the Refresher Orb. Its active uses the same sound and visual effect as Refresher Orb.",
    "The pop-up that appears when you hover over the item on the ground shows a buying price of 1000 gold, but when you pick it up, the pop-up shows the selling price of 500 gold."
  ],
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "The Refresher Shard is basically a Refresher Orb with a single charge, so the same tips apply to it.",
    "However, due to it having no mana cost, and no gold cost, it opens a lot of possibilities for heroes who normally don't or can't buy a Refresher Orb, either due to the lack of mana supporting combos, being unable to farm it up, or it being too ineffective for the item slot.",
    "The Refresher Shard does not share a cooldown with Refresher Orb. Combined with the lack of a mana cost, this means it makes it possible for heroes who already have a Refresher Orb to use their spells three times in a fight.",
    "In some scenarios, it might be worth it to sell the Refresher Shard for its selling price of gold to buy a key item sooner rather than consuming it."
  ]
}