{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Dual_Breath.mp3\/revision\/latest?cb=20141207184727",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Выбор существа в качестве цели направит дыхание в сторону этого существа.",
        "Ледяная и огненная волна движется со скоростью в 1050 единиц, для прохождения всего пути нужно 0,71 (TagTalent 1,43) сек.",
        "Огненное дыхание выходит спустя 0,2 сек. после выпуска ледяного. Возможен вариант, что враги получат урон только от одной волны, если выйдут из зоны поражения в промежутке между первой и второй волной. Jakiro не может двигаться, пока не выпустит волны, но в промежутке между ними может использовать предметы, способности и немного поворачиваться.",
        "Возможен вариант, что враги получат урон только от одной волны, если выйдут из зоны поражения в промежутке между первой и второй волной.",
        "Jakiro не может двигаться, пока не выпустит волны, но в промежутке между ними может использовать предметы, способности и немного поворачиваться.",
        "Поражает существ на расстоянии до 1025 (TagTalent 1775) единиц (складывается из дальности волны и конечного радиуса). Зона общего поражения выглядит как конус.",
        "Зона общего поражения выглядит как конус.",
        "Наносит 10\/20\/30\/40 (TagTalent 20\/40\/60\/80) единиц урона с промежутком в 0,5 сек., начиная наносить урон сразу после применения негативного эффекта, срабатывая 10 раз. Может нанести до 100\/200\/300\/400 (TagTalent 200\/400\/600\/800) единиц урона (до учета сопротивления).",
        "Может нанести до 100\/200\/300\/400 (TagTalent 200\/400\/600\/800) единиц урона (до учета сопротивления)."
      ],
      "mana": "10",
      "item_behaviour": [],
      "name": "Dual Breath",
      "cooldown": "135\/140\/155\/170",
      "description": "Поток льда, за которым следует волна огня. Лёд замедляет врагов, а огонь наносит им периодический урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,35+1,4",
        "Дальность применения: 750 ( 1500)",
        "Начальный радиус: 225",
        "Дальность волны: 750 ( 1500)",
        "Конечный радиус: 275",
        "Замедление передвижения: 28%\/32%\/36%\/40%",
        "Замедление скорости атаки: 28\/32\/36\/40",
        "Урон в секунду: 20\/40\/60\/80 ( 40\/80\/120\/160)",
        "Длительность: 5"
      ],
      "legacy_key": "D",
      "story": "Драконы-близнецы крайне опасны своим дыханием, воздействующим на цель разными видами магии; представить разрушительную силу некоторых таких комбинаций просто невозможно."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bd\/Ice_Path.mp3\/revision\/latest?cb=20141207184748",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Несмотря на визуальный эффект, сама дорожка не движется, а эффект от неё срабатывает спустя 0,5 сек.",
        "Ice Path начинается в 12 единицах от Jakiro и имеет длину в 1200 единиц. Может поразить существ на расстоянии в 1362 единиц (складывается из начального расстояния от Jakiro, длины дорожки и ее ширины). Также может задеть существ в 138 единицах позади Jakiro за счет его радиуса и начальной точки появления способности.",
        "Может поразить существ на расстоянии в 1362 единиц (складывается из начального расстояния от Jakiro, длины дорожки и ее ширины).",
        "Также может задеть существ в 138 единицах позади Jakiro за счет его радиуса и начальной точки появления способности.",
        "Вражеские существа, оказавшиеся в радиусе 150 единиц дорожки, оглушаются и получают урон.",
        "Оглушение длится столько же, сколько существует дорожка. Дорожка дает в радиусе 150 единиц летающего обзора по всей её длине всё время действия.",
        "Дорожка дает в радиусе 150 единиц летающего обзора по всей её длине всё время действия.",
        "Противники могут получить оглушение только один раз, то есть если эффект будет развеян, то они не будут оглушены повторно.",
        "Ice Path сначала накладывает негативный эффект, затем наносит урон."
      ],
      "mana": "21\/17\/13\/9 (TagTalent 18,5\/14,5\/10,5\/6,5)",
      "item_behaviour": [],
      "name": "Ice Path",
      "cooldown": "100",
      "description": "Создаёт полосу льда, которая оглушает прикоснувшихся к ней врагов и наносит им урон.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,65+0,8",
        "Дальность применения: 1200",
        "Длина дорожки: 1200",
        "Радиус дорожки: 150",
        "Задержка: 0,5",
        "Урон: 50",
        "Длительность дорожки: 1,6\/1,9\/2,2\/2,5 ( 2,1\/2,4\/2,7\/3)"
      ],
      "legacy_key": "T",
      "story": "Мудрая правая голова дракона взывает к своему морозному наследию, покрывая землю пузыристой наледью."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Jakiro_Liquid_Fire_1.mp3\/revision\/latest?cb=20191216014427",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Применение Liquid Fire вручную использует дальность применения в 600 (TagTalent 875) единиц. Обычные атаки с автоприменением Liquid Fire используют стандартную дальность атаки Jakiro в 400 (TagTalent 675) единиц. Дальность применения может быть увеличена другими бонуса к дальности атаки. Однако она не может быть увеличена бонусами к дальности применения заклианий.",
        "Дальность применения может быть увеличена другими бонуса к дальности атаки. Однако она не может быть увеличена бонусами к дальности применения заклианий.",
        "Если атака промахнулась или её избежали, то она все равно применит Liquid Fire на цель и существ вокруг. Однако, если цель получила иммунитет к заклинаниям или стала неуязвимой до попадания снаряда, то Liquid Fire применяться не будет.",
        "Однако, если цель получила иммунитет к заклинаниям или стала неуязвимой до попадания снаряда, то Liquid Fire применяться не будет.",
        "Несколько применений Liquid Fire не складываются, но обновляют время действия негативных эффектов.",
        "Атака сначала применяет негативный эффект, затем наносит собственный урон.",
        "Способность действует на постройки, замедляя их скорость атаки. Не работает на варды.",
        "Наносит 7,5\/10\/12,5\/15 единиц урона с интервалом в 0,5 сек. (до учета сопротивления), начиная наносить урон с задержкой в 0,5 сек. после применения, работает 10 раз. Может нанести до 75\/100\/125\/150 единиц урона в одиночную цель (до учета сопротивления).",
        "Может нанести до 75\/100\/125\/150 единиц урона в одиночную цель (до учета сопротивления).",
        "При завершении перезарядки, рот огненной головы наполняется огнем (видимым для всех) и Jakiro начинает использовать огненную голову для анимации атаки до следущего применения Liquid Fire.",
        "Liquid Fire имеет меньший приоритет, чем Liquid Frost. Если при ручном использовании Liquid Fire было включено Liquid Frost, то будет применён только Liquid Frost. Если и у Liquid Fire, и у Liquid Frost включено автоприменение, то будет применён только Liquid Frost.",
        "Если и у Liquid Fire, и у Liquid Frost включено автоприменение, то будет применён только Liquid Frost."
      ],
      "mana": "16\/12\/8\/4",
      "item_behaviour": [],
      "name": "Liquid Fire",
      "cooldown": "0",
      "description": "Герой наполняет свою атаку жидким пламенем, поджигая цель и всех врагов вокруг неё. Жертвы получают периодический урон и медленнее атакуют.",
      "hot_key": "E",
      "params": [
        "Дальность применения: 600 ( 875)",
        "Радиус: 300",
        "Замедление скорости атаки: 30\/40\/50\/60 ( 80\/90\/100\/110)",
        "Периодический урон: 15\/20\/25\/30",
        "Длительность: 5"
      ],
      "legacy_key": "Q",
      "story": "Левая пасть дракона открывается, уничтожая любого на своём пути."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/94\/Jakiro_Liquid_Frost_1.mp3\/revision\/latest?cb=20201228224140",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Применение Liquid Frost вручную использует дальность применения в 600 (TagTalent 875) единиц. Обычные атаки с автоприменением Liquid Fire используют стандартную дальность атаки Jakiro в 400 (TagTalent 675) единиц. Дальность применения может быть увеличена другими бонуса к дальности атаки. Однако она не может быть увеличена бонусами к дальности применения заклианий.",
        "Дальность применения может быть увеличена другими бонуса к дальности атаки. Однако она не может быть увеличена бонусами к дальности применения заклианий.",
        "Если атака промахнулась или её избежали, то она все равно применит Liquid Frost на цель и существ вокруг. Однако, если цель получила иммунитет к заклинаниям или стала неуязвимой до попадания снаряда, то Liquid Frost применяться не будет.",
        "Однако, если цель получила иммунитет к заклинаниям или стала неуязвимой до попадания снаряда, то Liquid Frost применяться не будет.",
        "Несколько применений Liquid Frost не складываются, но обновляют время действия негативных эффектов.",
        "Атака сначала применяет негативный эффект, затем наносит собственный урон.",
        "Способность действует на постройки, замедляя их скорость атаки. Не работает на варды.",
        "Наносит урон каждую секунду спустя одну секунду после наложения негативного эффекта, срабатывая 4 раз.",
        "Может нанести до 80 + 10% от макс. здоровья единиц урона в одиночную цель (до учета сопротивления).",
        "При завершении перезарядки, рот ледяной головы наполняется светло-синим морозным дымом (видимым для всех) и Jakiro начинает использовать ледяную голову для анимации атаки до следующего применения Liquid Frost.",
        "Liquid Frost имеет больший приоритет, чем Liquid Fire. Если при ручном использовании Liquid Fire было включено Liquid Frost, то будет применён только Liquid Frost. Если и у Liquid Fire, и у Liquid Frost включено автоприменение, то будет применён только Liquid Frost.",
        "Если и у Liquid Fire, и у Liquid Frost включено автоприменение, то будет применён только Liquid Frost."
      ],
      "mana": "12",
      "item_behaviour": [],
      "name": "Liquid Frost",
      "cooldown": "0",
      "description": "Герой наполняет свою атаку морозным эффектом, который оглушает врага на 0,4 сек., замедляет его передвижение на 20% и ежесекундно наносит ему урон, равный 20 + 2,5% от максимального запаса здоровья. Длительность: 4 сек.",
      "hot_key": "D",
      "params": [
        "Дальность применения: 600 ( 875)",
        "Радиус: 300",
        "Замедление скорости передвижения: 20%",
        "Базовый урон в секунду: 20",
        "Урон от макс. здоровья в секунду: 2,5%",
        "Длительность замедления и получения урона: 4",
        "Длительность оглушения: 0,4"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Jakiro_Macropyre_1.mp3\/revision\/latest?cb=20191216014429",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Мгновенно применяет способность по всей площади. Не имеет анимации растекания.",
        "Огонь начинается в 234 единицах впереди Jakiro и имеет длину в 1166 (TagTalent 1566) единиц. Может поражать существ на расстоянии до 1660 (TagTalent 2060) единиц (складывается из начального расстояния, длины дорожки и её ширины). Также поражает врагов в 26 единицах позади позади Jakiro за счет его радиуса и начальной точки появления способности.",
        "Может поражать существ на расстоянии до 1660 (TagTalent 2060) единиц (складывается из начального расстояния, длины дорожки и её ширины).",
        "Также поражает врагов в 26 единицах позади позади Jakiro за счет его радиуса и начальной точки появления способности.",
        "Накладывает на врагов в области действия дебафф с интервалом в 0,5 сек., начиная спустя 0,5 сек. после применения.",
        "Дебаффы не складываются. Если враг вновь оказался в области действия, его длительность обновляется. Негативный эффект наносит 55\/77,5\/100 (TagTalent 70\/92,5\/115) урона с интервалом в 0,5 сек., начиная спустя 0,5 после наложения эффекта, срабатывая 4 раз. Может сработать максимум 23 (TagTalent 53) раз, если цель стояла в огне всю длительность способности Одно срабатывание наносит 220\/310\/400 (TagTalent 280\/370\/460) урона (до учета сопротивления).",
        "Негативный эффект наносит 55\/77,5\/100 (TagTalent 70\/92,5\/115) урона с интервалом в 0,5 сек., начиная спустя 0,5 после наложения эффекта, срабатывая 4 раз.",
        "Может сработать максимум 23 (TagTalent 53) раз, если цель стояла в огне всю длительность способности",
        "Одно срабатывание наносит 220\/310\/400 (TagTalent 280\/370\/460) урона (до учета сопротивления).",
        "Несколько накладывающихся друг на друга Macropyre не складываются. Они обновляют общий дебафф на врагах.",
        "Может нанести до 1265\/1782,5\/2300 (TagTalent 1610\/2127,5\/2645) единиц урона одному существу (до учета снижений). При улучшении с Aghanim's Scepter, может нанести до 2915\/4107,5\/5300 (TagTalent 3710\/4902,5\/6095) единиц урона одному существу.",
        "При улучшении с Aghanim's Scepter, может нанести до 2915\/4107,5\/5300 (TagTalent 3710\/4902,5\/6095) единиц урона одному существу.",
        "Aghanim's Scepter меняет звуковой эффект Macropyre. Этот изменённый звуковой эффект слышно через туман войны."
      ],
      "mana": "80\/70\/60",
      "item_behaviour": [],
      "name": "Macropyre",
      "cooldown": "220\/330\/440",
      "description": "Герой извергает широкий поток жидкого пламени, который держится некоторое время и ежесекундно наносит урон вражеским существам.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,4+1,07",
        "Дальность применения: 1400 ( 1800)",
        "Длина: 1400 ( 1800)",
        "Радиус: 260",
        "Урон в секунду: 110\/155\/200 ( 140\/185\/230) ( 125\/175\/225)",
        "Длительность задержки урона: 2",
        "Длительность: 10 ( 25)"
      ],
      "legacy_key": "R",
      "story": "Смесь обжигающего холода и леденящего пламени разрывает поле боя в клочья."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 25.0,
    "attrIntelligence": 26.0,
    "attrIntelligenceInc": 3.0,
    "attrAgilityInc": 1.2,
    "attrAgility": 15.0
  },
  "description": "−2,5 сек. перезарядки Ice Path Урон и дальность Dual Breath умножаются на 2 +30 к урону от Macropyre +0,5 сек. действия Ice Path +325 к здоровью +50 к замедлению атаки от Liquid Fire +10%\/+10 к замедлению атаки\/передвижения от Dual Breath +275 к дальности атаки",
  "history": "Даже среди магических существ двуглавый дракон считается уродом. Поровну вмещающий в себя лед и пламя, коварство и ярость, он парит над обугленными и замороженными полями битв и изничтожает любого, кто осмелится бросить ему вызов. Яйца пироксианских драконов вмещают двух детенышей. Знаменитые своим злобным нравом с первых мгновений жизни, едва вылупившиеся детёныши пытаются убить друг друга ещё в гнезде. Выживает сильнейший. Так из поколения в поколение сохраняется сила пироксианского вида. Но по ошибке природы из одного яйца вылупился двуглавый уродец, объединив в одном теле все сильные стороны пироксианского древа. Запрятанные под мощной чешуёй силы льда и огня объединяются, и от них не спастись никому."
}