{
  "abilities": [
    {
      "notes": [
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Morphling's magic resistance to 36.25%.",
        "Increases Morphling's magic resistance to 36.25%.",
        "The agility talent effectively grants Morphling 2.5 armor, 15 attack speed, and 15 main attack damage.",
        "The strength talent effectively grants Morphling 400 health and 2 health regeneration."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Attribute Shift While Stunned",
          "talentRight": "2 Waveform Charges"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Waveform Attacks Targets",
          "talentRight": "+20 Strength"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+15 Agility",
          "talentRight": "+16s Morph Duration"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+250 Waveform Range",
          "talentRight": "+15% Magic Resistance"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Morphling_Waveform.mp3\/revision\/latest?cb=20191216020828",
      "effects": [
        "Ability Target Point",
        "Affects Enemies \/ Self",
        "Damage Magical (TagAghanim Instant Attack)"
      ],
      "notes": [
        "Surges with a speed of 1250 and disjoints projectiles upon cast.",
        "Morphling is invulnerable, and his model cannot be directly selected with during Waveform. However, Morphling can be still be selected through the hero icon.",
        "However, Morphling can be still be selected through the hero icon.",
        "With the travel distance and radius, Waveform can hit units up to 900\/1000\/1100\/1200 (TagTalent 1150\/1250\/1350\/1450) distance away.",
        "Morphling can turn, attack, cast abilities, and use items during Waveform.",
        "Does not travel the full distance, when targeting closer than the max distance.",
        "With the level 20 talent, Morphling performs instant attacks on every enemy hit by Waveform. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms."
      ],
      "mana": "130",
      "hotKey": "Q",
      "cooldown": "20\/17\/14\/11 (TagTalent 0)",
      "description": "Morphling dissolves into liquid and surges forward, damaging enemy units in his path. Morphling is invulnerable during Waveform.",
      "spellName": "Waveform",
      "params": [
        "Cast Animation: 0.25+0",
        "Cast Range: 700\/800\/900\/1000 (TagTalent 950\/1050\/1150\/1250)",
        "Max Travel Distance: 700\/800\/900\/1000 (TagTalent 950\/1050\/1150\/1250)",
        "Damage Radius: 200",
        "Damage: 75\/150\/225\/300",
        "Number of Charges: 2",
        "Charge Replenish Time: 20\/17\/14\/11",
        "The instant attacks added by the talent pierce spell immunity."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c1\/Morphling_Adaptive_Strike_%28Agility%29_1.mp3\/revision\/latest?cb=20191216020828",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Adaptive Strike (Agility) and Adaptive Strike (Strength) are linked abilities; leveling up one automatically levels up the other as well.",
        "Casting this puts the other Adaptive Strike (Strength) on a fixed 3 second cooldown. This cooldown can be reset with cooldown resetting abilities, but it is not affected by percentage-based cooldown changes.",
        "This cooldown can be reset with cooldown resetting abilities, but it is not affected by percentage-based cooldown changes.",
        "The projectile travels at a speed of 1150.",
        "The damage multiplier values are not fixed. They adapt linearly in smooth intervals depending on the difference between Morphling's agility and strength. The values change with each percent difference between agility and strength, even when it is just a minimal change. The multiplier count base attributes, as well as bonus attributes.",
        "The values change with each percent difference between agility and strength, even when it is just a minimal change.",
        "The multiplier count base attributes, as well as bonus attributes.",
        "When the current agility is 50% higher than the strength, the damage multiplier is at its maximum at 1\/1.5\/2\/2.5.",
        "When the current strength is 50% higher than the agility, the damage multiplier is at its minimum at 0.5.",
        "Checks Morphling's attributes upon projectile impact.",
        "With Aghanim's Shard, Adaptive Strike launches 1 additional projectile towards random visible valid targets within the range. With the cast range and the range buffer, the ability has a search range of 900\/1000\/1100\/1200. Cannot target the primary target with the additional projectile, so when no other targets are nearby, nothing happens. The secondary target is chosen randomly within the area, with heroes being prioritized. Treats creep-heroes as heroes. Since the additional projectile uses the ability's cast range, cast range increasing effects increase its range as well.",
        "With the cast range and the range buffer, the ability has a search range of 900\/1000\/1100\/1200.",
        "Cannot target the primary target with the additional projectile, so when no other targets are nearby, nothing happens.",
        "The secondary target is chosen randomly within the area, with heroes being prioritized. Treats creep-heroes as heroes.",
        "Since the additional projectile uses the ability's cast range, cast range increasing effects increase its range as well."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "W",
      "cooldown": "10",
      "description": "Launches a surge of water toward an enemy unit, dealing base damage plus additional damage based on Morphling's agility times a multiplier. If Morphling's agility is 50% higher than strength, the maximum agility multiplier is used. Also puts Adaptive Strike (Strength) on a 3 second cooldown.",
      "spellName": "Adaptive Strike (Agility)",
      "params": [
        "Cast Animation: 0.25+0.67",
        "Cast Range: 600\/700\/800\/900",
        "Number of Targets: 1 (TagTalent 2)",
        "Base Damage: 40\/50\/60\/70",
        "Min Bonus Damage Agility Multiplier: 0.5",
        "Max Bonus Damage Agility Multiplier: 1\/1.5\/2\/2.5",
        "Adaptive Strike (TagTalentStrength) Downtime: 3",
        "Secondary Target Range Buffer: 300",
        "Causes Adaptive Strike to have +1 Multishot. Multishot prioritizes heroes.",
        "Blocked upon impact."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Morphling_Adaptive_Strike_%28Strength%29_1.mp3\/revision\/latest?cb=20191216020820",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Adaptive Strike (Strength) and Adaptive Strike (Agility) are linked abilities; leveling up one automatically levels up the other as well.",
        "Casting this puts the other Adaptive Strike (Agility) on a fixed 3 second cooldown. This cooldown can be reset with cooldown resetting abilities, but it is not affected by percentage-based cooldown changes.",
        "This cooldown can be reset with cooldown resetting abilities, but it is not affected by percentage-based cooldown changes.",
        "The projectile travels at a speed of 1150.",
        "The knockback and stun values are not fixed. They adapt linearly in smooth intervals depending on the difference between Morphling's strength and agility. The values change with each percent difference between strength and agility, even when it is just a minimal change. The knockback and stun values count base attributes, as well as bonus attributes.",
        "The values change with each percent difference between strength and agility, even when it is just a minimal change.",
        "The knockback and stun values count base attributes, as well as bonus attributes.",
        "When the current strength is 50% higher than the agility, the knockback distance and stun duration are at their maximum at 500 and 1.5\/2\/2.5\/3 (TagTalent 2.5\/3\/3.5\/4) seconds respectively.",
        "When the current agility is 50% higher than the strength, the knockback distance and stun duration are at their minimum at 100 and 0.5 (TagTalent 1.5) seconds respectively.",
        "Knocks the target back at a speed of 1000, resulting in a knockback duration of 0.1‒0.5 seconds.",
        "Checks Morphling's attributes upon projectile impact.",
        "With Aghanim's Shard, Adaptive Strike launches 1 additional projectile towards random visible valid targets within the range. With the cast range and the range buffer, the ability has a search range of 900\/1000\/1100\/1200. Cannot target the primary target with the additional projectile, so when no other targets are nearby, nothing happens. The secondary target is chosen randomly within the area, with heroes being prioritized. Treats creep-heroes as heroes. Since the additional projectile uses the ability's cast range, cast range increasing effects increase its range as well.",
        "With the cast range and the range buffer, the ability has a search range of 900\/1000\/1100\/1200.",
        "Cannot target the primary target with the additional projectile, so when no other targets are nearby, nothing happens.",
        "The secondary target is chosen randomly within the area, with heroes being prioritized. Treats creep-heroes as heroes.",
        "Since the additional projectile uses the ability's cast range, cast range increasing effects increase its range as well."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "E",
      "cooldown": "10",
      "description": "Launches a surge of water toward an enemy unit, stunning and knocking back the target based on Morphling's strength. If his strength is 50% higher than his agility, the maximum stun\/knockback is dealt. Also puts Adaptive Strike (Agility) on a 3 second cooldown.",
      "spellName": "Adaptive Strike (Strength)",
      "params": [
        "Cast Animation: 0.25+0.67",
        "Cast Range: 600\/700\/800\/900",
        "Number of Targets: 1 (TagTalent 2)",
        "Min Knockback Distance: 100",
        "Max Knockback Distance: 500",
        "Min Stun Duration: 0.5 (TagTalent 1.5)",
        "Max Stun Duration: 1.5\/2\/2.5\/3 (TagTalent 2.5\/3\/3.5\/4)",
        "Adaptive Strike (TagTalentAgility) Downtime: 3",
        "Secondary Target Range Buffer: 300",
        "Causes Adaptive Strike to have +1 Multishot and increases the stun duration by 1 second. Multishot prioritizes heroes.",
        "Blocked upon impact."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d9\/Morphling_Attribute_Shift_%28Agility_Gain%29.mp3\/revision\/latest?cb=20191216020822",
      "effects": [
        "Ability Toggle",
        "Affects Self"
      ],
      "notes": [
        "Attribute Shift (Agility Gain) and Attribute Shift (Strength Gain) are linked abilities; leveling up one automatically levels up the other as well.",
        "Attribute Shift does not interrupt Morphling's channeling abilities upon toggling.",
        "Costs 3.33\/1.66\/0.83\/0.416 mana per shift interval, resulting in 10 mana per second. This mana cost is fixed and cannot be altered by anything. It ignores mana loss manipulation.",
        "This mana cost is fixed and cannot be altered by anything. It ignores mana loss manipulation.",
        "Converts 3\/6.02\/12.05\/24.04 attribute points per second, resulting in the following changes per second: Agility: Morphling gains\/loses 0.5\/1\/2.01\/4.01 armor, 3\/6.02\/12.05\/24.04 attack speed, and 3\/6.02\/12.05\/24.04 main attack damage. Strength: Morphling gains\/loses 60.06\/120.48\/240.96\/480.77 maximum health, and 0.3\/0.6\/1.2\/2.4 health regen. The strength bonus\/loss does not keep the current health percentage, but instead adds\/removes 20 health per strength to\/from the current health pool. This health bonus does not bypass Ice Blast or False Promise, and it does not count as heal for the latter. However, for other amplifications and reductions, only the part that exceeds the current health percentage is affected.",
        "Agility: Morphling gains\/loses 0.5\/1\/2.01\/4.01 armor, 3\/6.02\/12.05\/24.04 attack speed, and 3\/6.02\/12.05\/24.04 main attack damage.",
        "Strength: Morphling gains\/loses 60.06\/120.48\/240.96\/480.77 maximum health, and 0.3\/0.6\/1.2\/2.4 health regen.",
        "The strength bonus\/loss does not keep the current health percentage, but instead adds\/removes 20 health per strength to\/from the current health pool.",
        "This health bonus does not bypass Ice Blast or False Promise, and it does not count as heal for the latter.",
        "However, for other amplifications and reductions, only the part that exceeds the current health percentage is affected.",
        "Attribute Shift continues to convert attributes even if Morphling is disabled, but cannot be toggled while disabled. With the level 25 talent, this restriction is removed, allowing Morphling to toggle Attribute Shift even while disabled. With the talent, it can be toggled while stunned, cycloned, slept, taunted, hidden, or during forced movement, but not while silenced, hexed or prevented from acting. Morphling becomes unable to ⇧ Shift-queue this ability upon acquiring the talent.",
        "With the level 25 talent, this restriction is removed, allowing Morphling to toggle Attribute Shift even while disabled. With the talent, it can be toggled while stunned, cycloned, slept, taunted, hidden, or during forced movement, but not while silenced, hexed or prevented from acting. Morphling becomes unable to ⇧ Shift-queue this ability upon acquiring the talent.",
        "With the talent, it can be toggled while stunned, cycloned, slept, taunted, hidden, or during forced movement, but not while silenced, hexed or prevented from acting.",
        "Morphling becomes unable to ⇧ Shift-queue this ability upon acquiring the talent.",
        "Toggling one Attribute Shift ability On automatically toggles the other Off. If Attribute Shift cannot convert anymore due to lack of attribute points or mana, it stays toggled, but the process is paused until it can continue.",
        "If Attribute Shift cannot convert anymore due to lack of attribute points or mana, it stays toggled, but the process is paused until it can continue.",
        "Can only convert Morphling's base agility and strength. Bonus attributes cannot be converted. The passively added strength and agility are not added to the base attributes, and can therefore not be converted either.",
        "The passively added strength and agility are not added to the base attributes, and can therefore not be converted either.",
        "Shifted attributes are permanent and not reverted on death.",
        "The passive agility bonus effectively grants Morphling 0.5\/0.83\/1.17\/1.5 armor, and 3\/5\/7\/9 attack speed and attack damage.",
        "The passive strength bonus effectively grants Morphling 60\/100\/140\/180 health and 0.3\/0.5\/0.7\/0.9 health regen."
      ],
      "mana": "0",
      "hotKey": "D",
      "cooldown": "0",
      "description": "Morphling shifts its form, pulling points from Strength and pouring them into Agility. The process is reversible. Additional points in Attribute Shift increase the rate of stat change. Passively grants bonus Agility.",
      "spellName": "Attribute Shift (Agility Gain)",
      "params": [
        "Cast Animation: 0+0",
        "Shift Interval: 0.333\/0.166\/0.083\/0.0416",
        "Mana Cost per Second: 10",
        "Points per Shift: 1",
        "Bonus Agility: 3\/5\/7\/9",
        "Illusions spawn with Morphling's current stats, not his original stats."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Morphling_Attribute_Shift_%28Strength_Gain%29.mp3\/revision\/latest?cb=20191216020823",
      "effects": [
        "Ability Toggle",
        "Affects Self"
      ],
      "notes": [
        "Same notes as for Attribute Shift (Agility Gain) apply."
      ],
      "mana": "0",
      "hotKey": "F",
      "cooldown": "0",
      "description": "Morphling shifts its form, pulling points from Agility and pouring them into Strength. The process is reversible. Additional points in Attribute Shift increase the rate of stat change. Passively grants bonus Strength.",
      "spellName": "Attribute Shift (Strength Gain)",
      "params": [
        "Cast Animation: 0+0",
        "Shift Interval: 0.333\/0.166\/0.083\/0.0416",
        "Mana Cost per Second: 10",
        "Points per Shift: 1",
        "Bonus Strength: 3\/5\/7\/9",
        "Illusions spawn with Morphling's current stats, not his original stats."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5c\/Morphling_Morph.mp3\/revision\/latest?cb=20191216020825",
      "effects": [
        "Ability Target Unit",
        "Affects Self"
      ],
      "notes": [
        "Does not replace Morphling with a clone of the target. Morph only copies the target's model (including the cosmetic items they wear). This means he is still registered as Morphling, so that innate passive abilities of the target are not gained. For example, when morphing into Faceless Void, Morphling still gets frozen by Chronosphere. This also means that Morphling can still be killed normally in the morphed form, since it is still him and not a separate clone or illusion. Morphling is visually distinguishable from the original hero while morphed. Buffs and debuffs Morphling receives whiled morphed stay on him upon unmorphing. Most channeling abilities are interrupted upon unmorphing, except for Phase Shift, Upheaval, and item abilities.",
        "This means he is still registered as Morphling, so that innate passive abilities of the target are not gained.",
        "For example, when morphing into Faceless Void, Morphling still gets frozen by Chronosphere.",
        "This also means that Morphling can still be killed normally in the morphed form, since it is still him and not a separate clone or illusion.",
        "Morphling is visually distinguishable from the original hero while morphed.",
        "Buffs and debuffs Morphling receives whiled morphed stay on him upon unmorphing.",
        "Most channeling abilities are interrupted upon unmorphing, except for Phase Shift, Upheaval, and item abilities.",
        "Morphling keeps his current health and mana percentages upon morphing. He does not copy the target's current health or mana.",
        "Also copies the target's attribute values, primary attribute, movement speed, attack range and range type. This means when targeting a melee strength hero, Morphling becomes a melee strength hero for the duration. Only copies the target's base attributes. Bonus attributes from abilities and items are not copied. All other base stats (e.g. attack values, armor, magic resistance, etc) are not copied either.",
        "This means when targeting a melee strength hero, Morphling becomes a melee strength hero for the duration.",
        "Only copies the target's base attributes. Bonus attributes from abilities and items are not copied.",
        "All other base stats (e.g. attack values, armor, magic resistance, etc) are not copied either.",
        "Removes Morphling's abilities and replaces them with the target's non-ultimate abilities, including their passive abilities and sub-abilities. This includes Invoked abilities or any non-ultimate ability acquired via Spell Steal upon morphing into them. Non-ultimate abilities granted by Aghanim's Scepter and Aghanim's Shard are only copied if Morphling has the respective item as well.",
        "This includes Invoked abilities or any non-ultimate ability acquired via Spell Steal upon morphing into them.",
        "Non-ultimate abilities granted by Aghanim's Scepter and Aghanim's Shard are only copied if Morphling has the respective item as well.",
        "Morphling keeps his own items during Morph, he does not copy the target's items. This means when Morphling has Aghanim's Scepter or Aghanim's Shard, it upgrades every upgradable ability copied with Morph. Talents are not copied, any talent the target has which upgrades their abilities is not applied to Morphling's copied abilities.",
        "This means when Morphling has Aghanim's Scepter or Aghanim's Shard, it upgrades every upgradable ability copied with Morph.",
        "Talents are not copied, any talent the target has which upgrades their abilities is not applied to Morphling's copied abilities.",
        "Can only be cast on enemy heroes, including illusions and clones. Cannot be cast on creep-heroes. When cast on illusions, it copies the hero who owns the illusion, and not the hero the illusion is based on. For example, when targeting Disruption illusions, Morphling turns into Shadow Demon, and not the hero Disruption was cast on. However, it cannot target Morphling itself or illusions under Morphling's control. An Enchanted Morphling illusion is still treated as an own illusion and can still not be targeted.",
        "When cast on illusions, it copies the hero who owns the illusion, and not the hero the illusion is based on.",
        "For example, when targeting Disruption illusions, Morphling turns into Shadow Demon, and not the hero Disruption was cast on.",
        "However, it cannot target Morphling itself or illusions under Morphling's control.",
        "An Enchanted Morphling illusion is still treated as an own illusion and can still not be targeted.",
        "Multiple sources of mana loss reduction stacks additively.",
        "With Aghanim's Scepter, Morph can also target allied heroes, with the same rules as above. Also reduces Morph's cooldown, although this is not included in the upgrade's description.",
        "Also reduces Morph's cooldown, although this is not included in the upgrade's description."
      ],
      "mana": "50",
      "hotKey": "R",
      "cooldown": "140\/100\/60",
      "description": "Morphling changes his form to match the targeted enemy, gaining their basic abilities with reduced mana cost. Can be toggled for the duration of the ability.",
      "spellName": "Morph",
      "params": [
        "Cast Animation: 0.25+0.1",
        "Cast Range: 700\/850\/1000",
        "Mana Loss Reduction: 50%",
        "Duration: 20 (TagTalent 36)",
        "Cast Range Bonus: 300",
        "Allows targeting allied heroes. While Morphed, you gain Cast Range increase."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Morphling_Morph_Replicate.mp3\/revision\/latest?cb=20191216020824",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Morph Replicate replaces Morph until it expires. The legacy Hotkey for Morph Replicate is also the legacy key of the target's ultimate ability.",
        "The legacy Hotkey for Morph Replicate is also the legacy key of the target's ultimate ability.",
        "Morph Replicate interrupts Morphling's channeling abilities upon cast.",
        "Casting this does not end Morph. Instead, it shifts Morphling back to his original form. When used again, it shifts Morphling back into the target. Goes on cooldown whenever forms get shifted.",
        "Goes on cooldown whenever forms get shifted.",
        "Whenever Morphling shifts back into the target, he re-copies all their abilities. This means if the target leveled up their abilities, Morphling now copies the new level as well. This also means if the target learned or acquired new abilities (e.g. Invoker invoked new abilities), Morphling copies the new abilities.",
        "This means if the target leveled up their abilities, Morphling now copies the new level as well.",
        "This also means if the target learned or acquired new abilities (e.g. Invoker invoked new abilities), Morphling copies the new abilities."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "1",
      "description": "Toggles Morphling's form between his own and the replicated enemy.",
      "spellName": "Morph Replicate",
      "params": [
        "Cast Animation: 0+0",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "?",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 3.9,
    "attrAgility": 24.0
  },
  "description": "Morphling is a ranged agility hero that has many flexible abilities, item builds and is leveled as a very strong hard carry. He relies strongly on his attributes, and is an effective ganker. Unlike other agility carries that rely on physical attacks, he relies on his powerful abilities to initiate and shift into a state from which he can make a kill. Waveform lets him surge directly forward to a location, damaging enemies on his path, working both as a nuke or an escape. Adaptive Strike is a scaling two-part ability that blasts enemies with a jet of water, either stunning and knocking back or dealing damage. Its power is based on either agility or strength. Attribute Shift allows him to edit his physical being, switching it from Agility or Strength, transforming him into a strong damage dealer or a tank. His ultimate, Morph, transforms him into a copy of an enemy using their stats and basic abilities.",
  "history": "For dark eons the comet circled. Held in thrall to a distant sun, bound by gravity’s inexorable pull, the massive ball of ice careened through the blackness between worlds, made strange by its dark journey. On the eve of the ancient war of the Vloy, it punched down through the sky and lit a glowing trail across the night, a sign both armies took for an omen. The frozen ball melted in a flash of boiling heat, as below two forces enjoined in battle across the border of a narrow river. Thus freed from its icy stasis, the Morphling was born into conflict, an elemental power at one with the tides of the ocean, capricious and unconstrained. He entered the fight, instinctively taking the form of the first general who dared set foot across the water, and then struck him dead. As the motley warriors clashed, he shifted from form to form throughout the battle, instantly absorbing the ways of these strange creatures--now a footsoldier, now an archer, now the cavalryman--until, by the time the last soldier fell, Morphling had played every part. The battle's end was his beginning.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Attribute Shift While Stunned",
      "talentRight": "2 Waveform Charges"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Waveform Attacks Targets",
      "talentRight": "+20 Strength"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+15 Agility",
      "talentRight": "+16s Morph Duration"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+250 Waveform Range",
      "talentRight": "+15% Magic Resistance"
    }
  ]
}