{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Techies до 27,25%.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+60 к скорости передвижения всех мин",
          "talentRight": "+252 к урону"
        },
        {
          "talentLvl": "20",
          "talentLeft": "–22 сек. перезарядки Blast Off!",
          "talentRight": "+40 к скорости передвижения"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+3 маны в секунду",
          "talentRight": "+300 к урону от Blast Off"
        },
        {
          "talentLvl": "10",
          "talentLeft": "−3 сек. к перезарядке Proximity Mines",
          "talentRight": "+20% к сопротивлению магии"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Techies_Proximity_Mines_1.mp3\/revision\/latest?cb=20191216024807",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При изучении Proximity Mines Techies сразу получает все 3 заряда.",
        "Мины не срабатывают в первые 1,75 сек. после установки. Во время задержки мины видны врагам; после нее они становятся невидимыми.",
        "Во время задержки мины видны врагам; после нее они становятся невидимыми.",
        "Для взрыва Proximity Mine нужно 3,35 сек. при установке мины прямо перед вражеским существом или строением. Proximity Mines проявляются во время задержки активации.",
        "Proximity Mines проявляются во время задержки активации.",
        "Мины срабатывают от невидимых существ, но не от неуязвимых или спрятанных.",
        "Мины взрываются только если враг задерживается в радиусе срабатывания на 1,6 сек. То есть быстрый вход и выход из области срабатывания не активирует их. При входе в радиус мина издает звук, предупреждая врага о попадании в радиус срабатывания. Звук слышен всем даже через туман войны. Взрыв мины также слышен сквозь туман войны. Мины наносят урон только при срабатывании, а не при разрушении атакой. Летающие существа не могут активировать или получить урон от мин. Урон мин связан с текущим уровнем Proximity Mines, а не с уровнем на момент установки. Урон мин не увеличивается с Усиление урона заклинаний.",
        "То есть быстрый вход и выход из области срабатывания не активирует их.",
        "При входе в радиус мина издает звук, предупреждая врага о попадании в радиус срабатывания.",
        "Звук слышен всем даже через туман войны. Взрыв мины также слышен сквозь туман войны.",
        "Мины наносят урон только при срабатывании, а не при разрушении атакой.",
        "Летающие существа не могут активировать или получить урон от мин.",
        "Урон мин связан с текущим уровнем Proximity Mines, а не с уровнем на момент установки.",
        "Урон мин не увеличивается с Усиление урона заклинаний.",
        "Мина наносит 50\/100\/150\/200 урона строениям.",
        "Дает летающий обзор в радиусе 300 единиц на 1 секунду в месте взрыва.",
        "Proximity Mines нельзя разместить в радиусе срабатывания остальных союзных Proximity Mines. При выборе заклинания все принадлежащие заклинателю Proximity Mines обрамлены красными кругами, отображающими радиус срабатывания мин. Но при выборе таланта, дающего минам скорость передвижения, несколько мин смогут двигаться рядом и складываться после размещения.",
        "При выборе заклинания все принадлежащие заклинателю Proximity Mines обрамлены красными кругами, отображающими радиус срабатывания мин.",
        "Но при выборе таланта, дающего минам скорость передвижения, несколько мин смогут двигаться рядом и складываться после размещения.",
        "Источником урона является сама мина, поэтому определенные эффекты, реагирующие на урон, реагируют на мины, а не на Techies (например, Blade Mail).",
        "Мины не блокируют лагери нейтральных крипов."
      ],
      "mana": "110\/130\/150\/170",
      "item_behaviour": [],
      "name": "Proximity Mines",
      "cooldown": "0",
      "description": "Устанавливает невидимую мину. Её невидимость невозможно раскрыть, но она станет видна, если противник зайдёт в радиус действия. Мина взорвётся, если противник будет 1,6 сек. находиться на расстоянии в 400 от неё. Взрыв наносит полный урон по всей области срабатывания. Наносит постройкам 25% урона.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,47",
        "Дальность применения: 100 (TagAghanim 400)",
        "Радиус срабатывания: 400",
        "Радиус урона: 400",
        "Задержка активации: 1,75",
        "Задержка срабатывания: 1,6",
        "Урон: 200\/400\/600\/800",
        "Урон постройкам: 25%",
        "Число зарядов: 3",
        "Время восстановления заряда: 23 (TagTalent 20)",
        "Увеличивает дальность применения."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Techies_Stasis_Trap_1.mp3\/revision\/latest?cb=20191216024811",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Ловушки не срабатывают в первые 2 сек. после установки. Во время задержки ловушки видны врагам; после нее они становятся невидимыми.",
        "Во время задержки ловушки видны врагам; после нее они становятся невидимыми.",
        "Применяет оцепенение к целям, препятствуя их передвижению и использованию способностей для передвижения. Дает эффект True Sight на цели. Ловушка применяет оцепенение только при срабатывании, а не разрушения из-за атаки. Длительность оцепенения зависит от уровня Stasis Trap на момент установки ловушки, а не от уровня на момент срабатывания.",
        "Дает эффект True Sight на цели.",
        "Ловушка применяет оцепенение только при срабатывании, а не разрушения из-за атаки.",
        "Длительность оцепенения зависит от уровня Stasis Trap на момент установки ловушки, а не от уровня на момент срабатывания.",
        "При срабатывании Stasis Trap все остальные ловушки, установленные игроком в радиусе 600 от сработавшей ловушки, разрушаются. Несмотря на это, ловушки можно размещать на расстоянии 600 единиц друг от друга.",
        "Несмотря на это, ловушки можно размещать на расстоянии 600 единиц друг от друга.",
        "Ловушки не срабатывают от невидимых, неуязвимых и спрятаных существ или существ с иммунитетом к заклинаниям. При этом невидимые существа оцепенеют, если находились в радиусе при срабатывании ловушки.",
        "При этом невидимые существа оцепенеют, если находились в радиусе при срабатывании ловушки.",
        "Дает летающий обзор в радиусе 600 единиц на 1 секунду в месте срабатывания.",
        "Взрыв ловушки слышен сквозь туман войны.",
        "Stasis Trap не блокирует лагери нейтральных крипов."
      ],
      "mana": "80\/110\/140\/160",
      "item_behaviour": [],
      "name": "Stasis Trap",
      "cooldown": "20\/16\/13\/10",
      "description": "Устанавливает невидимую ловушку, которая при срабатывании применяет на вражеских существ оцепенение.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 1+0",
        "Дальность применения: 150 (TagAghanim 450)",
        "Радиус срабатывания: 400",
        "Радиус оцепенения: 600",
        "Задержка активации: 2",
        "Длительность оцепенения: 2\/3\/4\/5",
        "Увеличивает дальность применения."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/74\/Techies_Blast_Off%21_1.mp3\/revision\/latest?cb=20191216024800",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Магический Отнимающий здоровье"
      ],
      "notes": [
        "Прыжок всегда занимает 0,75 сек., поэтому скорость полета варьируется между 0 и 1333,33.",
        "Траектория прыжка — арка высотой в 281,108 единиц, поэтому другие существа могут проходить под героем.",
        "Урон по себе смертелен, поэтому Techies может добить себя с помощью этой способности. Суицид не дает Town Portal Scroll.",
        "Суицид не дает Town Portal Scroll.",
        "Урон по себе — магический, отмеченный как отнимающий здоровье; большинство источников манипуляцим уроном его игнорируют (за исключением сопротивления магии и магического барьера). Только следующие способности взаимодействуют с подобным уроном: Borrowed Time, Aphotic Shield, Ghostship и False Promise. Shallow Grave предотвращает смерть от урона.",
        "Только следующие способности взаимодействуют с подобным уроном: Borrowed Time, Aphotic Shield, Ghostship и False Promise.",
        "Shallow Grave предотвращает смерть от урона.",
        "Взрыв сначала применяет дебафф, затем урон по области, урон Techies, а затем оглушение. Наносит урон врагам по области до нанесения урона самому Techies, поэтому заклинатель получает опыт за героев, умерших от заклинания. То есть Techies может умереть от Blade Mail, Spiked Carapace, Dispersion, Last Will и Static Charge, если его здоровье было достаточно низким при применении.",
        "Наносит урон врагам по области до нанесения урона самому Techies, поэтому заклинатель получает опыт за героев, умерших от заклинания.",
        "То есть Techies может умереть от Blade Mail, Spiked Carapace, Dispersion, Last Will и Static Charge, если его здоровье было достаточно низким при применении.",
        "При приземлении разрушает деревья в радиусе 400 вокруг Techies.",
        "Можно прервать с помощью принудительного движения во время прыжка, но способность не прерывается другими типами обезвреживания.",
        "Можно использовать при оцепенении; получение оцепенения во время прыжка не прервет его."
      ],
      "mana": "100\/125\/150\/175",
      "item_behaviour": [],
      "name": "Blast Off!",
      "cooldown": "35 (TagTalent 13)",
      "description": "Герои бросаются в гущу врагов и при приземлении взрывают свой боезапас, нанося задетым врагам огромный урон и запрещая им применять способности. Сами подрывники получают при взрыве урон в размере 300\/400\/500\/600 от максимального запаса здоровья.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 1+0,9",
        "Дальность применения: 1000 (TagTalent 1300)",
        "Радиус урона\/безмолвия: 400",
        "Урон себе от макс. здоровья: 50%",
        "Урон по области: 300\/400\/500\/600 (TagTalent 600\/700\/800\/900)",
        "Длительность прыжка: 0,75",
        "Длительность безмолвия: 4\/5\/6\/7",
        "Радиус оглушения: 400",
        "Длительность оглушения: 1,75",
        "Увеличивает дальность применения на 300. Способность оглушает врагов в радиусе 400 на 1,75 секунды."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Techies_Minefield_Sign.mp3\/revision\/latest?cb=20191216024803",
      "effects": [
        "Способность Направленная на область (TagAghanim Аура)",
        "Действует на Союзных существ"
      ],
      "notes": [
        "Эта способность присутствует изначально: её нельзя изучить или увеличивать её уровень. В режиме Ability Draft Minefield Sign связана с Remote Mines и они даются игроку парой.",
        "В режиме Ability Draft Minefield Sign связана с Remote Mines и они даются игроку парой.",
        "Одновременно на карте может присутствовать только одна табличка. Размещение второй моментально уничтожит предыдущую (хоть и с визуальной задержкой).",
        "Размещение второй моментально уничтожит предыдущую (хоть и с визуальной задержкой).",
        "Табличка не имеет размера столкновения и не может заблокировать проход существ.",
        "Табличка не блокирует лагери нейтральных крипов.",
        "Aghanim's Scepter дает Minefield Sign ауру радиусом 125, применяющую к минам невидимость и защищающую их от эффекта True Sight. Данная аура действует только на Proximity Mines, Stasis Trap и Remote Mines. На другие типы вардов способность не влияет. Аура влияет на все мины союзников, но не на вражеские. Мины в пределах 125 от таблички становятся невидимыми мгновенно. Невидимость не дает врагам увидеть Proximity Mines даже при нахождении в радиусе срабатывания мины и Remote Mines при задержке взрыва. Бафф ауры задерживается на сек. Табличку нельзя разместить на фонтане.",
        "Данная аура действует только на Proximity Mines, Stasis Trap и Remote Mines. На другие типы вардов способность не влияет.",
        "Аура влияет на все мины союзников, но не на вражеские.",
        "Мины в пределах 125 от таблички становятся невидимыми мгновенно.",
        "Невидимость не дает врагам увидеть Proximity Mines даже при нахождении в радиусе срабатывания мины и Remote Mines при задержке взрыва.",
        "Бафф ауры задерживается на сек.",
        "Табличку нельзя разместить на фонтане."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Minefield Sign",
      "cooldown": null,
      "description": "На 180 секунд устанавливает предостерегающую табличку, советующую врагам ступать осторожно. Нельзя ставить больше одной таблички одновременно.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 10",
        "Максимум табличек: 1",
        "Длительность: 180",
        "Радиус эффекта: 125",
        "Время до невидимости: 0",
        "Длительность задержки ауры: 0,5",
        "Табличка защищает ловушки, мины и бомбы от любых эффектов, раскрывающих невидимость."
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Techies_Remote_Mines.mp3\/revision\/latest?cb=20210424160500",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Мины наносят урон врагам только при активации с помощью Pinpoint Detonate или Focused Detonate. Разрушение мин атаками или истечение их длительности взрыв не вызывают.",
        "Разрушение мин атаками или истечение их длительности взрыв не вызывают.",
        "Remote Mines можно взорвать сразу после установки. Тем не менее, взрыв происходит через 0,25 секунд после активации.",
        "Тем не менее, взрыв происходит через 0,25 секунд после активации.",
        "Источником урона является сама мина, поэтому определенные эффекты, реагирующие на урон, реагируют на мины, а не на Techies (например, Blade Mail).",
        "Можно размещать несколько мин в одной точке; мины не блокируют проход существ.",
        "На карте может быть до 69 мин одновременно, учитывая стандартную анимацию применения, перезарядку и длительность.",
        "Дает летающий обзор в радиусе 500 на 3 секунды в месте взрыва.",
        "Урон зависит от уровня Remote Mines на момент установки мины, а не от уровня на момент взрыва. При этом мины улучшаются\/ухудшаются при экипировке\/выбрасывании Aghanim's Scepter. Урон мин не увеличивается с Усиление урона заклинаний.",
        "При этом мины улучшаются\/ухудшаются при экипировке\/выбрасывании Aghanim's Scepter.",
        "Урон мин не увеличивается с Усиление урона заклинаний.",
        "С каждым уровнем модель мины увеличивается на 10%.",
        "Мины не блокируют лагери нейтральных крипов."
      ],
      "mana": "120\/180\/240",
      "item_behaviour": [],
      "name": "Remote Mines",
      "cooldown": "8",
      "description": "Устанавливает невидимую мину, которая взрывается только при активации вручную после небольшой задержки. Не наносит урон постройкам.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,75+0,13",
        "Дальность применения: 500 (TagAghanim 800)",
        "Радиус взрыва: 425",
        "Задержка активации: 0",
        "Задержка взрыва: 0,25",
        "Время до невидимости: 2",
        "Урон: 300\/450\/600 (TagAghanim 450\/600\/750)",
        "Длительность: 600",
        "Увеличивает урон и дальность применения."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/48\/Techies_Focused_Detonate.mp3\/revision\/latest?cb=20191216024802",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Focused Detonate разблокируется после изучения Remote Mines.",
        "Можно использовать без поворота персонажа к выбранной области.",
        "Можно использовать пока герой мёртв или на него действует запрет действий, но не обезвреживание.",
        "Если в радиусе действия способности не будет Remote Mines, то ничего не произойдёт, а способность уйдет на перезарядку."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Focused Detonate",
      "cooldown": null,
      "description": "Взорвать все мины в выбранной области.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: Глобальная",
        "Радиус: 700"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Techies_Pinpoint_Detonate.mp3\/revision\/latest?cb=20191216024806",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "Это заклинание самой мины, позволяющее Techies взорвать мины, если он не может использовать Focused Detonate из-за обезвреживания.",
        "Взрывает все выбранные радиоуправляемые мины с задержкой в 0,03 секунды между каждой."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Pinpoint Detonate",
      "cooldown": null,
      "description": "Взрывает все выбранные радиоуправляемые мины.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0"
      ],
      "legacy_key": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 19.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.3,
    "attrAgility": 14.0
  },
  "description": "Techies — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Его первая способность Proximity Mines, позволяет устанавливает невидимую мину, которая взорвется при приближении врага. Мина также наносит урон строениям. Вторая способность Stasis Trap, позволяет устанавливает невидимую ловушку, которая оглушает вражеских существ вокруг нее при срабатывании. Третьей способностью Blast Off! герой совершает опасный прыжок в указанную точку, наносящий огромный урон по площади. Каждый попавший в радиус взрыва противник на время лишается возможности использовать способности. Сам Techies получает урон, равный 50 % от максимального. Ультимативная способность Remote Mines, также позволяет устанавливает невидимую мину, которая взрывается только при активации вручную либо способностью Focused Detonate, которая активирует все мины в радиусе. Не наносит урон строениям. Улучшается с Aghanim's Scepter. Также у героя есть способность Minefield Sign, позволяющая устанавливать предостерегающую табличку. Улучшается с Aghanim's Scepter, позволяя скрывать мины и ловушки в радиусе вокруг таблички от раскрытия невидимости.",
  "history": "За всю историю Устричной бухты никого не ненавидели так, как подрывников Techies. Но — вот незадача — Устричной бухты больше нет. Как и города Тотерина. И даже Охотограда. Вообще, если бы кто-нибудь следил за похождениями подрывников, он бы заметил, что там, где появляются Techies, исчезают города. Как и все остальные неизбежные бедствия, происходившие вокруг них, отправной точкой для уничтожения Устричной бухты стало изобретение. Гении пиротехники — Скви, Сплин и Спун — искали безопасный метод пробить шахты под городом взрывчаткой и создали самое диковинное свое устройство — кнопку, позволяющую зажечь фитиль издалека. Троица, решившая во что бы то ни стало испытать свое изобретение, заставила всю свою крохотную мастерскую радиоуправляемыми бочками с огненной солью. Набив тележку этими бомбами, они закопали их в пустынном поле. Спрятавшись в траншее, Сплин вдавил кнопку детонатора. Но ничего не произошло. Смутившись, он поднялся на ноги и нажимал кнопку еще и еще, пока наконец не прогремел взрыв, оставивший на поле воронку. Радостные Скви и Сплин уж было направились в сторону дома, но тут их накрыла мощная ударная волна. Сбитые с толку неожиданным взрывом, они пробрались через едкий дым и увидели, что от их мастерской остались одни руины. С неба падали куски дерева и камня, а воронка под мастерской начала углубляться. Вся Устричная бухта содрогнулась и начала оседать в шахты, а паникующие жители спасались бегством. Присев на краю своего тонущего дома, подрывники ухмылялись и хихикали, уже представляя себе, на что они способны, и совсем не думали о гневе их бывших соседей. Им было интересно только одно: а как можно сделать взрыв еще сильнее?",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+60 к скорости передвижения всех мин",
      "talentRight": "+252 к урону"
    },
    {
      "talentLvl": "20",
      "talentLeft": "–22 сек. перезарядки Blast Off!",
      "talentRight": "+40 к скорости передвижения"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+3 маны в секунду",
      "talentRight": "+300 к урону от Blast Off"
    },
    {
      "talentLvl": "10",
      "talentLeft": "−3 сек. к перезарядке Proximity Mines",
      "talentRight": "+20% к сопротивлению магии"
    }
  ]
}