{
  "abilities": [
    {
      "notes": [
        "При применении перемещает героя со скоростью в 1250 единиц и позволяет избежать снаряды",
        "Morphling неуязвим и его модель нельзя выделить мышкой во время Waveform\n Однако Morphling можно выбрать нажатием на иконку героя",
        "Поражает существ на расстоянии до 900\/1000\/1100\/1200 ( 1150\/1250\/1350\/1450) единиц",
        "Morphling может поворачиваться, атаковать, использовать способности и предметы во время Waveform",
        "Не проходит полную дистанцию, если выбрать точку ближе максимального расстояния",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ При выборе  таланта на атаки во время Waveform Morphling совершает мгновенные атаки по каждому врагу, которого задела способность\n На эти мгновенные атаки может сработать любой модификатор атаки\n Они не обладают эффектом True Strike, но игнорируют обезоруживание"
      ],
      "item_behaviour": [],
      "description": "Герой принимает жидкую форму и устремляется вперёд, нанося урон всем врагам на своём пути. Во время применения способности герой неуязвим.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,25+0",
        "Дальность применения:  700\/800\/900\/1000 ( 950\/1050\/1150\/1250)",
        "Макс\n дистанция прохождения:  700\/800\/900\/1000 ( 950\/1050\/1150\/1250)",
        "Радиус урона: 200",
        "Урон: 75\/150\/225\/300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Morphling_Waveform.mp3\/revision\/latest?cb=20191216020828",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "21\/18\/15\/12 (TagTalent 12,6\/10,8\/9\/7,2)",
      "aghanim": null,
      "name": "Waveform",
      "cooldown": "130",
      "legacy_key": "W",
      "story": "На врагов обрушивается стремительный поток воды."
    },
    {
      "notes": [
        "Использование этой способности запускает фиксированную перезарядку в секунды для связанной Adaptive Strike\n Может быть сброшена эффектами, сбрасывающими перезарядку",
        "Снаряд летит со скоростью в 1150 единиц",
        "Множитель урона не фиксирован и плавно увеличивается в зависимости от разницы между текущими значениями силы и ловкости Morphling",
        "Значения меняются с каждым процентом разницы между ловкостью и силой, даже если разница между ними минимальна",
        "Множитель учитывает не только базовые атрибуты, но и дополнительные",
        "Если текущая ловкость на 50% больше силы, множитель урона устанавливается на максимальное значение в 3",
        "Если текущая сила на 50% больше ловкости, множитель урона устанавливается на минимальное значение в 1\/1,5\/2\/2,5",
        "Проверяет атрибуты Morphling при попадании снаряда"
      ],
      "item_behaviour": [],
      "description": "Запускает во вражеское существо поток воды, нанося ему урон в зависимости от ловкости героя. Множитель ловкости будет максимальным, если ловкость героя на 50% выше его силы. Способность Adaptive Strike (сила) также уходит на перезарядку в сек.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,25+0,67",
        "Дальность применения:  600\/700\/800\/900",
        "Число целей: 1",
        "Базовый урон: 55\/65\/75\/85",
        "Мин\n множитель ловкости: 0,5",
        "Макс\n множитель ловкости: 1\/1,5\/2\/2,5",
        "Недоступность Adaptive Strike (Сила): 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c1\/Morphling_Adaptive_Strike_%28Agility%29_1.mp3\/revision\/latest?cb=20191216020828",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "10",
      "aghanim": null,
      "name": "Adaptive Strike (Ловкость)",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "E",
      "story": "Герой взывает к своей стихии, дабы врагов сокрушили волны."
    },
    {
      "notes": [
        "Использование этой способности запускает фиксированную перезарядку в секунды для связанной Adaptive Strike\n Может быть сброшена эффектами, сбрасывающими перезарядку",
        "Снаряд летит со скоростью в 1150 единиц",
        "Значения отбрасывания и оглушения не фиксированы и плавно увеличиваются в зависимости от разницы между текущими значениями силы и ловкости Morphling",
        "Значения меняются с каждым процентом разницы между ловкостью и силой, даже если разница между ними минимальна",
        "Отбрасывание и оглушение учитывают не только базовые атрибуты, но и дополнительные",
        "Если текущая сила на 50% больше ловкости, дальность отбрасывания и длительность оглушения устанавливаются на их максимальное значение в 0,5 и 3 соответственно",
        "Если текущая ловкость на 50% больше силы, дальность отбрасывания и длительность оглушения устанавливаются на их минимальное значение в 500 и 1,5\/2\/2,5\/3 соответственно",
        "Отбрасывает цель назад со скоростью в 1000 единиц за 0,5-0,0005 секунды",
        "Проверяет атрибуты Morphling при попадании снаряда"
      ],
      "item_behaviour": [],
      "description": "Запускает во вражеское существо поток воды, оглушая и отталкивая его назад в зависимости от силы героя. Оглушение и толчок будут максимальными, если сила героя на 50% выше его ловкости. Способность Adaptive Strike (ловкость) также уходит на перезарядку в сек.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,25+0,67",
        "Дальность применения:  600\/700\/800\/900",
        "Число целей: 1",
        "Мин\n расстояние отбрасывания: 100",
        "Макс\n расстояние отбрасывания: 500",
        "Мин\n длительность оглушения: 0,5 ( 1,5)",
        "Макс\n длительность оглушения: 1,5\/2\/2,5\/3 ( 2,5\/3\/3,5\/4)",
        "Недоступность Adaptive Strike (Ловкость): 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Morphling_Adaptive_Strike_%28Strength%29_1.mp3\/revision\/latest?cb=20191216020820",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "10",
      "aghanim": null,
      "name": "Adaptive Strike (Сила)",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "T",
      "story": "Герой взывает к своей стихии, дабы врагов сокрушили волны."
    },
    {
      "notes": [
        "При переключении не прерывает произносимые способности Morphling",
        "Расходует 1\/1\/1\/1 маны за интервал обмена, в результате получается 5\/10\/15\/20 маны в секунду\n Расход маны фиксированный и не подвергается влиянию манипуляции потерей маны",
        "Преобразовывает 5\/10\/15\/20 очков атрибута в секунду, в результате чего в секунду:  Ловкость: Morphling получает\/теряет 0,8\/1,7\/2,5\/3,3 брони, 5\/10\/15\/20 скорости атаки и 5\/10\/15\/20 основного урона от атаки\n  Сила: Morphling получает\/теряет 100\/200\/300\/400 максимального здоровья и 0,5\/1\/1,5\/2 восстановления здоровья\n Получение\/потеря силы не сохраняет текущий процент здоровья, но взамен добавляет\/отнимает 20 здоровья за единицу силы к\/от текущего запаса здоровья\n Это дополнительное здоровье не добавляется во время действия  Ice Blast или  False Promise и не учитывается для последней в лечение\n Тем не менее, для других усилений и уменьшений, затрагивается лишь часть, которая превышает процент текущего здоровья",
        "Attribute Shift продолжает обменивать атрибуты даже если Morphling обезврежен, но при этом способность нельзя выключить в обезвреженном состоянии\n С <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, это ограничение убирается, позволяя Morphling переключать Attribute Shift даже в обезвреженном состоянии\n Её можно переключать будучи в следующих состояниях: оглушении, урагане, сне, провокации, исчезновении или во время принудительного движения, но не в безмолвии, проклятии или отключении приказов\n Morphling не способен установить эту способность в ⇧ Shift-очередь при получении Aghanim's Shard",
        "Переключение одной способности Attribute Shiftв состояние Вкл автоматически переключит другую в состояние Выкл\n Если Attribute Shift больше не может обменивать атрибуты из-за нехватки очков атрибутов или маны, то она остаётся включенной, но процесс приостанавливается до того как он сможет продолжиться",
        "Может обменивать только базовые атрибуты Morphling\n Дополнительные атрибуты не обмениваются\n Пассивно получаемые сила и ловкость не добавляются к базовым, и потому не могут быть обменяны",
        "Обменянные атрибуты постоянны и не возвращаются при смерти",
        "Пассивная дополнительная ловкость в среднем даёт Morphling 0,5\/0,83\/1,17\/1,5 ( 1,5\/1,83\/2,17\/2,5) основной брони и по 3\/5\/7\/9 ( 9\/11\/13\/15) скорости атаки и основного урона от атаки"
      ],
      "item_behaviour": [],
      "description": "Герой меняет свою форму, превращая очки силы в очки ловкости. Этот процесс обратим. С уровнем растёт скорость превращения. Также даёт постоянный бонус к ловкости.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Скорость обмена: 0,2\/0,1\/0,0667\/0,05",
        "Маны в секунду: 5\/10\/15\/20",
        "Очков атрибута за обмен: 1",
        "Дополнительная ловкость: 3\/5\/7\/9 ( 9\/11\/13\/15)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d9\/Morphling_Attribute_Shift_%28Agility_Gain%29.mp3\/revision\/latest?cb=20191216020822",
      "effects": [
        "Способность: Переключаемая",
        "Действует на: Себя"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Attribute Shift (Ловкость)",
      "cooldown": "0",
      "legacy_key": "D",
      "story": "Непостоянство вод не позволяет уловить природу героя."
    },
    {
      "notes": [
        "Примечания те же, что и для  Attribute Shift (Ловкость)",
        "Пассивная дополнительная сила в среднем даёт 60\/100\/140\/180 ( 180\/220\/260\/300) здоровья и 0,3\/0,5\/0,7\/0,9 ( 0,9\/1,1\/1,3\/1,5) восстановления здоровья"
      ],
      "item_behaviour": [],
      "description": "Герой меняет свою форму, превращая очки ловкости в очки силы. Этот процесс обратим. С уровнем растёт скорость превращения. Также даёт постоянный бонус к силе.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0",
        "Скорость обмена: 0,2\/0,1\/0,0667\/0,05",
        "Маны в секунду: 5\/10\/15\/20",
        "Скорость обмена: 1",
        "Дополнительная сила: 3\/5\/7\/9 ( 9\/11\/13\/15)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Morphling_Attribute_Shift_%28Strength_Gain%29.mp3\/revision\/latest?cb=20191216020823",
      "effects": [
        "Способность: Переключаемая",
        "Действует на: Себя"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Attribute Shift (Сила)",
      "cooldown": "0",
      "legacy_key": "F",
      "story": "Непостоянство вод не позволяет уловить природу героя."
    },
    {
      "notes": [
        "Не заменяет Morphling клоном цели\n Morph лишь копирует модель цели (включая надетые на неё косметические предметы)\n То есть герой продолжает считаться Morphling, поэтому он не получает родные пассивные способности цели\n Например, при превращении в  Faceless Void Morphling все равно будет застывать в  Chronosphere\n Также Morphling может умереть как обычно, будучи превращенным, поскольку эта форма продолжает считаться им самим, а не отдельным клоном или иллюзией\n Morphling визуально отличается от цели, в которую он обратился\n Большинство баффов и дебаффов, полученных Morphling в превращении, остаются при нем при развоплощении\n Большинство произносимых способностей прервутся при развоплощении, за исключением  Phase Shift,  Upheaval и способностей предметов",
        "Также копирует значения атрибутов цели, базовые характеристики, скорость передвижения, тип и дальность атаки\n То есть при выборе героя ближнего боя с атрибутом силы Morphling будет этим героем всю длительность\n Копирует только базовые атрибуты цели\n Дополнительные атрибуты от способностей и предметов не копируются\n Также не копирует бонусы от талантов\n Также не копирует остальные базовые характеристики (показатели урона, брони, сопротивления магии и прочие)",
        "Morphling сохраняет при превращении текущее соотношение здоровье и маны в процентах и не копирует текущее здоровье\/ману цели",
        "Убирает способности Morphling и заменяет их на все способности цели (включая пассивные), кроме ультимативной\n В способности входят вспомогательные заклинания и даже способности, даваемые <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter, за исключением  Second Chakram, поскольку данная способность - часть ультимативной\n Сюда также входят созданные заклинания  Invoker или любые украденные  Rubick неультимативные заклинания при превращении в него",
        "При использовании Morph у Morphling остаются все его предметы, поскольку он не копирует предметы цели\n То есть в случае, когда у Morphling есть <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter, то данный предмет улучшит каждую скопированную улучшаемую способность\n Поскольку таланты не копируются, то улучшения, даваемые ими, не действуют на скопированные Morphling способности",
        "Можно использовать на вражеских героев, включая иллюзии и клонов\n Нельзя использовать на крипов-героев\n При использовании на иллюзии способность копирует того героя, кому иллюзия принадлежит, а не того, с кого она скопирована\n Например, при выборе иллюзии, созданной  Disruption, то Morphling превращается в Shadow Demon, а не в героя, с которого была сделана иллюзия\n С <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter способность также может копировать союзных героев с теми же ограничениями\n Morph нельзя использовать на самого Morphling или любую иллюзию под его контролем\n При приручении врагом одной из иллюзий Morphling с помощью  Enchant её все равно нельзя выбрать целью Morph, поскольку иллюзия продолжает считаться подконтрольной Morphling",
        "Уменьшение расхода маны сочетается по закону убывающей полезности с остальными источниками уменьшения"
      ],
      "item_behaviour": [],
      "description": "Герой изменяет свою форму по образу и подобию выбранного противника, получая его основные способности с уменьшенным расходом маны. Во время действия форму героя можно изменить на основную и наоборот.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,25+0,1",
        "Дальность применения:  700\/850\/1000",
        "Длительность: 20 ( 36)",
        "Кража атрибутов:  20%",
        "Кража сопротивление эффектам:  40%",
        "Кража скорости атаки:  70",
        "Кража доп\n урона от заклинаний:  25%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5c\/Morphling_Morph.mp3\/revision\/latest?cb=20191216020825",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Себя "
      ],
      "mana": "140\/100\/60",
      "aghanim": null,
      "name": "Morph",
      "cooldown": "50",
      "legacy_key": "R",
      "story": "Если неотрывно смотреть в его воды, можно увидеть своё отражение."
    },
    {
      "notes": [
        "Заменяет слот ультимативной способности Morphling на все время действия Morph\n Классическая клавиша для способности будет установлена той же клавишей, которая назначена для ультимейта цели, выбранной для превращения",
        "При применении Morph Replicate прерывает произносимые заклинания Morphling",
        "Использование не завершает действие Morph\n При этом способность возвращает Morphling к его оригинальной форме\n При повторном использовании Morph Replicate снова превращает Morphling в выбранную ранее цель\n Уходит на перезарядку при завершении превращения",
        "При повторном превращении в цель Morphling вновь копирует все её способности\n То есть при повторном превращении уровни скопированных способностей обновляются под их уровень у цели\n Также, если цель получила новые заклинания (например,  Invoker скомбинировал новое), Morphling их скопирует"
      ],
      "item_behaviour": [],
      "description": "Герой моментально превращается в копию врага или наоборот.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Morphling_Morph_Replicate.mp3\/revision\/latest?cb=20191216020824",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "1",
      "aghanim": null,
      "name": "Morph Replicate",
      "cooldown": "0",
      "legacy_key": "?",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 3.9,
    "attrAgility": 24.0
  },
  "description": "Обходит врагов, превращаясь в волну Благодаря способности вливаться в любую ситуацию Morphling увёртлив и смертоносен. Если его пытаются загнать в угол, он уходит от врага на своей волне или увеличивает здоровье и превращается в ложного двойника героя.  Керри Побег Стойкость Быстрый урон Контроль ★★★",
  "history": "Многие века космос бороздила ледяная комета. Громадный шар, прикованный к дальней звезде неумолимыми силами гравитации, мчался сквозь тьму меж мирами, обретая в своём путешествии необычайные свойства. Однажды, в канун войны за Влой, комета рухнула со звёздного неба, оставив в ночи светящийся след, принятый обеими армиями как знак судьбы. Ледяной шар стремительно таял во вспышке кипящей жары, а две стороны схлестнулись в схватке по берегам узкой речонки. Тогда-то, вырвавшись из ледяного сна, был рождён Морфлинг — элементаль, обладающий силой стихии столь же капризной и необузданной, как сам океан. Он инстинктивно принял облик первого же генерала, отваживавшегося ступить в воду, и сразив того намертво, вступил в бой. Пока глупые солдатики бились друг с другом, элементаль перемещался по полю битвы, меняя форму одну за другой. Он мгновенно поглощал образы странных существ — то пехотинца, то лучника, то кавалериста, — и к тому мгновению, когда пал последний солдат, элементаль сыграл каждую роль. Конец этой битвы стал его началом."
}