{"abilities":[{"spell":"Creates an explosively charged image of Storm Spirit that lasts 12 seconds and will detonate and deal damage if an enemy unit comes near it.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Static Remnant interrupts Storm Spirit's channeling spells upon cast.","After a remnant is placed, it takes 1 second for it to be able to explode and deal damage.","When a remnant expires, it still explodes and deals damage around it.","Remnant can be triggered by invisible units and deal damage to them.","The remnants are visible on the minimap with the same color as Radiant\/Dire units, not the color of the player.","Remnants provide 500 range flying vision at their location for their duration or until detonating."],"mana":"70\/80\/90\/100","elements":["Partially pierces spell immunity."],"cooldown":"3.5","name":"Static Remnant","description":["Cast Animation: 0+1.1","Trigger Radius: 235","Damage Radius: 260","Activation Delay: 1","Damage: 120\/175\/230\/285 ( 200\/255\/310\/365)","Remnant Duration: 12"],"hot_key":"Q","legacy_key":"R"},{"spell":"A vortex that pulls an enemy unit to Storm Spirit's location.","effects":["Ability Target Unit ( No Target)","Affects Enemies \/ Self"],"notes":["Electric Vortex pulls affected units at a speed of 128.57\/122.22\/118.18\/115.38 ( 94.74\/95.65\/96.3\/96.77).","If the affected unit gets affected by another source of horrizontal forced movement, it stops pulling, and continues as soon as the other source expires. This means, unlike other forced movement effects, Electric Vortex is not canceled by them, but temporarily stopped instead.","If the target gets moved more than 1200 range away from the original cast location, the link breaks immediately.","The Aghanim's Scepter upgraded version still uses the same cast time. Does not hit invisible, invulnerable and hidden units as well as units in the Fog of War within the radius. When cast while no enemies are within range, it still triggers Overload.","Multiple casts on the same target refresh the pull duration, and reset the pull distance, but do not update the pull location."],"mana":"60\/70\/80\/90","elements":["Partially blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"16","name":"Electric Vortex","description":["Cast Animation: 0.3+0.77","Cast Range: 300 ( 0)","Radius: 0 ( 475)","Pull Duration: 1.4\/1.8\/2.2\/2.6 ( 1.9\/2.3\/2.7\/3.1)","Pull Distance: 180\/220\/260\/300"],"hot_key":"W","legacy_key":"E"},{"spell":"Casting a spell creates an electrical charge, which is released in a burst on Storm's next attack, dealing damage and slowing nearby enemies.","effects":["Ability Passive","Affects Enemies","Damage Magical"],"notes":["Using items does not trigger Overload.","The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","The slow and damage are applied to all enemy units within the radius around the attacked target.","On the primary target, the attack first applies the debuff, then its own damage. On secondary targets, it first applies the damage, then the debuff.","The charge is released upon successfully hitting a target. If the attack misses or is disjointed, nothing happens.","Each attack checks for the buff on Storm Spirit upon successfully hitting the target. If the buff is present, the charge is released. This means when Storm Spirit gains the buff while an attack projectile is flying, that attack still releases the charge when it hits.","Attacking buildings or allies does not release the charge, however attacking wards does."],"mana":"0","elements":["Disabled by Break.","Partially pierces spell immunity."],"cooldown":"0","name":"Overload","description":["Radius: 300","Damage: 40\/60\/80\/100 ( 70\/90\/110\/130)","Move Speed Slow: 80%","Attack Speed Slow: 80","Slow Duration: 0.6"],"hot_key":"E","legacy_key":"V"},{"spell":"Storm Spirit becomes volatile electricity, charging across the battlefield until he depletes his mana or reaches his target. The activation mana cost is 30+8% of his total mana pool, and the cost per 100 units traveled is 12+0.7% of his total mana pool. Damage is expressed in damage per 100 units traveled.","effects":["Ability Target Point","Affects Self \/ Enemies","Damage Magical"],"notes":["Ball Lightning disjoints projectiles upon cast.","Storm Spirit is invulnerable during Ball Lightning.","Storm Spirit can turn, cast spells, use items and attack during Ball Lightning.","Recasting Ball Lightning during Ball Lightning has no effect, but is still registered as cast, proccing on-cast effects (the activation mana cost gets refunded).","If Storm Spirit runs out of mana while traveling, he stops immediately.","Ball Lightning destroys trees within 100 radius of Storm Spirit while traveling.","Provides 400 radius flying vision around Storm Spirit during Ball Lightning.","Drains Storm Spirit's mana after every 100 range traveled, resulting in 0.08\/0.05\/0.04 second intervals.","The spell's tooltip mana cost shows the current initial mana cost of the spell based on Storm Spirit's current maximum mana pool.","The damage of Ball Lightning works identical to shockwave-based spells (like e.g. Magnus' Shockwave), with Storm Spirit acting as the projectile. This means it applies its damage instantly on enemies getting within range, and an enemy can only be damaged once per cast. Unlike a regular shockwave spell, Ball Lightning's damage increases based on how far the projectile (Storm Spirit) has traveled. The damage increases by 8\/12\/16 per 100 units, so for the first 99 units, it deals 0 damage within its entire radius. This means if Storm Spirit zips up to 99 range directly towards an enemy, it does not get damaged when within 299 range of the starting location (99 distance + damage radius).","This is how much damage Ball Lightning can deal around Storm Spirit at certain travel distances (before reductions): 500 Distance: 40\/60\/80 damage (90 + 11.5% of max mana) 1000 Distance: 80\/120\/160 damage (150 + 15% of max mana) 2500 Distance: 200\/300\/400 damage (330 + 25.5% of max mana) 5000 Distance: 400\/600\/800 damage (630 + 43% of max mana) 10000 Distance: 800\/1200\/1600 damage (1230 + 78% of max mana)","When the talent is chosen, a Static Remnant is automatically dropped every 500 range Storm Spirit travels. These remnants do not cost any mana and do not prevent Storm Spirit from manually casting Static Remnant during Ball Lightning."],"mana":"30 + 8% of max mana","elements":["Cannot be cast while rooted or leashed.","Does not pierce spell immunity."],"cooldown":"0","name":"Ball Lightning","description":["Cast Animation: 0.3+0","Cast Range: Global","Damage Radius: 200","Travel Speed: 1250\/1875\/2500","Damage per 100 Units: 8\/12\/16","Auto Static Remnant Drop Distance: 0 ( 500)","Base Mana Cost per 100 Units: 12","Max Mana as Cost per 100 Units: 0.7%"],"hot_key":"R","legacy_key":"G"}],"bio":"Storm Spirit is literally a force of nature--the wild power of wind and weather, bottled in human form. And a boisterous, jovial, irrepressible form it is! As jolly as a favorite uncle, he injects every scene with crackling energy. But it was not always thus, and there was tragedy in his creation. Generations ago, in the plains beyond the Wailing Mountains, a good people lay starving in drought and famine. A simple elementalist, Thunderkeg by name, used a forbidden spell to summon the spirit of the storm, asking for rain. Enraged at this mortal’s presumption, the Storm Celestial known as Raijin lay waste to the land, scouring it bare with winds and flood. Thunderkeg was no match for the Celestial--at least until he cast a suicidal spell that forged their fates into one: he captured the Celestial in the cage of his own body. Trapped together, Thunderkeg's boundless good humor fused with Raijin's crazed energy, creating the jovial Raijin Thunderkeg, a Celestial who walks the world in physical form.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Storm Spirit, like Brewmaster, Earth Spirit and Ember Spirit, was a Pandaren in DotA. He was re-skinned to avoid copyright issues with Blizzard, since Pandaren are a race of in the Warcraft Universe.","The line I'll spirit you away!, as well as him muttering Spirit... Away... when he dies may be a reference to the film Spirited Away.","Storm Spirit's speech is very similar to Ninjor, a character from the Power Rangers franchise, whose voice acting is largely based on the character Dudley Do-Right, from the Dudley Do-Right Show.","Eul's Scepter of Divinity has an equivalent in Heroes of Newerth called \"Stormspirit\".","Ball lightning is an unexplained and potentially dangerous atmospheric electrical phenomenon. The term refers to reports of luminous, spherical objects that vary from pea-sized to several meters in diameter. Though usually associated with thunderstorms, the phenomenon lasts considerably longer than the split-second flash of a lightning bolt.","Storm Spirit's voice line \"I'll save this till it's five oclock somewhere\" is a reference to the song It's Five O' Clock Somewhere by Alan Jackson."],"talents":["500 Distance Auto Remnant in Ball Lightning:Overload Pierces Immunity","+30 Attack Speed:+0.5s Electric Vortex","+400 Health:+80 Static Remnant Damage","+3 Mana Regen:+30 Overload Damage"],"desc":"Raijin Thunderkeg, the Storm Spirit, is a ranged intelligence hero who wields the elemental power of lightning. He has high mobility, strong ganking and carrying potential, and very good synergy between his hero abilities."}