{"abilities":[{"spell":"Создает энергетическую копию Storm Spirit, которая живет 12 секунд, и взрывается, если поблизости проходит враг.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Static Remnant прерывает произносимые Storm Spirit заклинания.","После размещения, копии потребуется 1 секунда для срабатывания, чтобы взорваться и нанести урон.","Когда время жизни копии истечет, она взорвется и нанесет урон вокруг себя.","Копия может активироваться от невидимых юнитов и нанести им урон.","Копии отображаются на миникарте тем же цветом, что и юниты Света\/Тьмы, а не цветом игрока.","Копии дают летающий обзор в радиусе 500 единиц там, где они размещены, до того, пока они не пропадут или взорвутся."],"mana":"70\/80\/90\/100","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"3.5","name":"Static Remnant","description":["Анимация применения: 0+1,1","Радиус срабатывания: 235","Радиус урона: 260","Задержка до срабатывания: 1","Урон: 120\/175\/230\/285 ( 200\/255\/310\/365)","Длительность копии: 12"],"hot_key":"Q","legacy_key":"R"},{"spell":"Создает воронку, притягивающую врагов к месту нахождения Storm Spirit.","effects":["Способность Направленная на юнита ( Ненаправленная)","Действует на Врагов \/ Себя"],"notes":["Притягивает юнитов со скоростью 128.57\/122.22\/118.18\/115.38 ( 94.74\/95.65\/96.3\/96.77).","Если на цель воздействует другой источник горизонтального принудительного движения, то способность остановит притягивание и продолжит после завершения действия другого источника. То есть, в отличии от других эффектов принудительного движения, Electric Vortex не прерывается другими эффектами, а лишь временно приостанавливается.","Если цель переместилась на расстояние более 1200 единиц от изначального места применения, то связь мгновенно разрывается.","Улучшение от Aghanim's Scepter использует то же значение времени применения, что и сама способность. Не притягивает невидимых, неуязвимых и спрятанных юнитов, как и юнитов, находящихся в Тумане войны. Если при использовании в радиусе действия не было врагов, то Overload всё равно сработает.","Несколько использований на одну и ту же цель обновит длительность привязки и её радиус, но не расположение конечной точки привязки."],"mana":"60\/70\/80\/90","elements":["Частично блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"16","name":"Electric Vortex","description":["Анимация применения: 0,3+0,77","Дальность применения: 300 ( 0)","Радиус действия: 0 ( 475)","Длительность притягивания: 1.4\/1.8\/2.2\/2.6 ( 1.9\/2.3\/2.7\/3.1)","Радиус притягивания: 180\/220\/260\/300"],"hot_key":"W","legacy_key":"E"},{"spell":"При использовании заклинаний в Storm Spirit накапливается электрический заряд, который высвобождается со следующей атакой, нанося урон врагам поблизости и замедляя их.","effects":["Способность Пассивная","Действует на Врагов","Урон Магический"],"notes":["Использование предметов не активирует способность.","Замедление и урон работает на все вражеские юниты около атакуемой цели в определенном радиусе.","Заряд тратится в случае, если удар попал по цели. Если атакой промахнулись или её избежали, ничего не произойдет.","Каждая атака проверяет наличие баффа у Storm Spirit при успешном попадании по цели. Если бафф есть, заряд срабатывает. То есть, если Storm Spirit получает бафф, когда снаряд от атаки уже летит, на эту атаку сработает заряд при попадании в цель.","Атака строений или союзников не расходует заряд, но разрушение вардов его тратит."],"mana":"0","elements":["Отключается истощением.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Overload","description":["Радиус: 300","Урон: 40\/60\/80\/100 ( 70\/90\/110\/130)","Замедление скорости передвижения: 80%","Замедления скорости атаки: 80","Длительность замедления: 0.6"],"hot_key":"E","legacy_key":"V"},{"spell":"Storm Spirit оборачивается нестабильным электричеством, несущимся по полю боя, пока не достигнет своей цели либо исчерпает запас своей маны. Заклинание имеет начальную стоимость в 30+8% от общего запаса маны. Затем тратится 12+0.7% от общего запаса маны за каждые 100 единиц передвижения. Урон выражен в количестве урона за 100 единиц передвижения.","effects":["Способность Направленная на точку","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Ball Lightning позволяет уворачиваться от летящих снарядов.","Storm Spirit неуязвим во время действия Ball Lightning.","Storm Spirit может поворачиваться, использовать заклинания, предметы и атаковать во время использования Ball Lightning.","Повторное использование Ball Lightning не даст никакого эффекта, но будет засчитываться как использование для некоторых способностей.","Если в момент полета у Storm Spirit закончится мана, он незамедлительно остановится.","В момент полета Ball Lightning разрушает деревья в радиусе 100 единиц вокруг Storm Spirit.","Дает летающий обзор в радиусе 400 единиц вокруг Storm Spirit, пока действует Ball Lightning.","Тратит ману Storm Spirit каждые 100 единиц полета с интервалом в 0.08\/0.05\/0.04 секунды.","Указанная в описании способности стоимость использования показывает начальное значение, рассчитываемое с учетом текущего максимального запаса маны Storm Spirit.","Урон от Ball Lightning работает так же, как и способности, идентичные по механике способности Magnus Shockwave, т.е. действует как снаряд. Это означает, что урон врагам, находящимся в радиусе применения, наносится мгновенно, но только один раз за применение способности. В отличии от обычных заклинаний, похожих на Shockwave, урон от Ball Lightning увеличивается от того, насколько далеко снаряд (т.е. сам Storm Spirit) пролетел. Урон увеличивается на 8\/12\/16 за каждые 100 пройденных единиц, так что первые пройденные 99 единицы нанесут 0 урона в радиусе действия. Это значит, если Storm Spirit передвинется на 99 единиц прямо перед врагом, это не нанесет никакого урона в радиусе 299 единиц от начальной точки (99 единиц расстояния + радиус нанесения урона).","Тут представлен расчет того, сколько урона от Ball Lightning может нанести вокруг себя Storm Spirit в зависимости от дальности полета(без учета сопротивления): 500 пройденных единиц: 40\/60\/80 урона (30 + 68% от максимального запаса маны). 1000 пройденных единиц: 80\/120\/160 урона (30 + 128% от максимального запаса маны). 2500 пройденных единиц: 200\/300\/400 урона (30 + 308% от максимального запаса маны). 5000 пройденных единиц: 400\/600\/800 урона (30 + 608% от максимального запаса маны). 10000 пройденных единиц: 800\/1200\/1600 урона (30 + 1208% от максимального запаса маны)."],"mana":"30 + 8% от макс. запаса маны","elements":["Нельзя применять в оцепенении.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Ball Lightning","description":["Анимация применения: 0,3+0","Дальность применения: Глобальная","Радиус урона: 200","Скорость полета: 1250\/1875\/2500","Урон на 100 единиц перемещения: 8\/12\/16","Дистанция между появляющимися копиями: 0 ( 500)","Начальное кол-во маны на 100 единиц перемещения: 12","Макс. кол-во маны на 100 единиц перемещения: 0.7%"],"hot_key":"R","legacy_key":"G"}],"bio":"Райдзин Громокег — сила природы в самом буквальном смысле: это буйная энергия ветра и непогоды, заключённая в человеческом обличье. Как же он неистов, неудержим и задорен! Весёлый, словно любимый дядюшка, Райдзин заряжает всё вокруг своей искрящейся энергией. Но не всегда всё было именно так: начало его жизни положила трагедия. Много поколений назад, на плато за Скулящими горами, добрые люди страдали от голода и засухи. Обычный маг стихий Громокег запретным заклинанием призвал духа бури, умоляя его о дожде. Разгневанный дерзостью смертного, небесный Райдзин обрушил на землю потопы и ураганы. Громокег не мог противостоять духу, пока не произнёс самоубийственное заклятье, сковавшее их судьбы: он запер небесного духа в клетке собственного тела. С тех пор громогласный Райдзин и задорный Громокег навсегда стали жизнерадостным небожителем, ступающим по земле — и имя ему Райдзин Громокег.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Storm Spirit, как и Brewmaster, Ember Spirit и Earth Spirit, был Пандареном в DotA. Во избежание проблем с авторским правом, модель Brewmaster была переделана. Теперь он больше похож на Малую панду, нежели на Большую панду, на которой основывался внешний вид Пандаренов во вселенной Warcraft.","Райджин это имя бога молний и грома в японской мифологии и Синтоизме.","Фраза Storm Spirit \" NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!\" возможно является отсылкой к возгласу Дарта Вейдера из вселенной Звездных Войн.","The line I'll spirit you away!, as well as him muttering Spirit... Away... when he dies may be a reference to the film Spirited Away.","Storm Spirit's speech is very similar to Ninjor, a character from the Power Rangers franchise, who's voice acting is largely based on the character Dudley Do-Right, from the Dudley Do-Right Show."],"talents":["Создание копии каждые 500 единиц в Ball Lightning:Overload проходит сквозь защиту от магии","+30 к скорости атаки:+0,5 сек. действия Electric Vortex","+400 к здоровью:+80 урона от Static Remnant","+3 маны в секунду:+30 к урону от Overload"],"desc":"Storm Spirit — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Его первая способность, Static Remnant, позволяет создавать энергетическую копию Storm Spirit, которая взрывается, если поблизости проходит враг. Вторая способность, Electric Vortex, создает воронку, притягивающую врага к месту нахождения Storm Spirit, заодно замедляя его. Пассивная способность, Overload, дает электрический заряд при использовании заклинаний, который высвобождается со следующей атакой, нанося урон врагам поблизости и замедляя их. Ультимативная способность, Ball Lightning, позволяет герою летать, пока он достигнет своей цели либо исчерпает запас своей маны, при этом, противники, над которым пролетел герой, получат урон."}