{
  "abilities": [
    {
      "effects": [
        "Radius: 1200",
        "Lifesteal (Melee): 15%",
        "Lifesteal (Ranged): 10%",
        "Attack Damage Bonus: 15%",
        "Health Regeneration Bonus: 2.5",
        "Mana Regeneration Bonus: 1.75",
        "Armor Bonus: 4",
        "Aura Linger Duration: 0.5"
      ],
      "notes": [
        "Stacks additively with other sources of lifesteal.",
        "Cannot lifesteal off of wards, buildings and allied units.",
        "Considers base damage and primary attribute of affected units for the attack damage bonus. Bonus damage from other sources is not further increased.",
        "Can regenerate up to 150 health and 105 mana in one minute.",
        "The aura's buff lingers for 0.5 seconds.",
        "Affects invulnerable units."
      ],
      "elements": [
        "Ability Aura",
        "Affects Allies"
      ],
      "name": "Vladmir's Aura",
      "description": "Grants lifesteal (15% for melee heroes, 10% for ranged), 2.5 health regeneration, 1.75 mana regeneration, 15% bonus attack damage, and 4 armor to nearby allies."
    }
  ],
  "cost": "1925",
  "description": "An eerie mask that is haunted with the malice of a fallen vampire.",
  "trivia": [
    "The item's name and theme is a reference to Vlad Dracul III and his fictionalized version, Dracula."
  ],
  "further": [
    "Morbid_Mask",
    "Ring_of_Basilius",
    "Headdress"
  ],
  "tips": [
    "Vladmir's Offering is normally picked up in the early-mid game as it cannot be upgraded into a better item. Its wide variety of bonuses and useful components makes it an attractive choice for melee heroes.",
    "In the lategame a support should pick it up for the damage and armor auras, as the item slot is usually not worth it on core heroes, who need bigger items.",
    "Vladmir's Offering assists with pushing due to conferring armor and lifesteal to nearby creeps, making them withstand hits from enemy creeps, heroes and towers for longer.",
    "Since Vladmir's Aura can't be toggled off, its status buff icon is always visible on creeps. Therefore it is possible to detect invisible enemy heroes holding Vladmir's Offering by checking enemy creeps' status buff icons."
  ],
  "attrs": [
    "Passive Vladmir's Aura",
    "Bonus +2 Strength +2 Agility +2 Intelligence",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "For strength heroes, it grants 45 health, 0.25 health regen, 0.2% magic resistance, 0.32 armor, 2 attack speed, 0.1% movement speed, 24 mana, 0.1 mana regen, 0.14% spell damage and 2 attack damage.",
    "For agility heroes, it grants 36 health, 0.2 health regen, 0.16% magic resistance, 0.4 armor, 2.5 attack speed, 0.13% movement speed, 24 mana, 0.1 mana regen, 0.14% spell damage and 2 attack damage.",
    "For intelligence heroes, it grants 36 health, 0.2 health regen, 0.16% magic resistance, 0.32 armor, 2 attack speed, 0.1% movement speed, 30 mana, 0.13 mana regen, 0.18% spell damage and 2 attack damage."
  ]
}