{"abilities":[{"effects":["Радиус: 900","Вампиризм для ближнего боя: 15%","Вампиризм для дальнего боя: 10%","Бонус к урону: 15%","Бонус к регенерации маны: 0.65","Бонус к регенерации здоровья: 2.5","Бонус к броне: 4","Длительность задержки ауры: 0,5"],"notes":["Сочетается с другими источниками вампиризма.","Аура вампиризма не будет восстанавливать здоровье за удары по вардам, строениям и союзным юнитам.","Дополнительный урон зависит от базового урона и от урона, даваемого атрибутами. Дополнительный урон от других источников не усиливается.","Восстанавливает здоровье и ману в виде регенерации, регенерируя 0.25 здоровья и 0.065 маны с интервалом в 0,1 секунды, что составляет 2.5 здоровья и 0.65 маны в секунду.","Регенерирует до 150 здоровья и 39 маны в минуту.","Бафф от ауры задерживается на 0,5 секунды.","Действует на неуязвимых юнитов."],"elements":["Способность Аура","Действует на Союзников"],"name":"Vladmir's Aura","description":"Дарует союзникам вокруг эффект вампиризма (15% для героев ближнего боя и 10% — для героев дальнего боя), увеличивает их броню на 4, урон на 15%, а также усиливает восстановление здоровья на 2.5 и восстановление маны на 0.65."}],"cost":"900","description":"Жуткая маска, проклятая злобой павшего вампира.","further":["Morbid_Mask","Ring_of_Basilius","Headdress"],"attrs":["Пассивная Vladmir's Aura","Бонус +2 к силе +2 к ловкости +2 к интеллекту","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 45 здоровья, 0,25 регенерации здоровья, 0,2% сопротивления магии, 0,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.","Для героев ловкости, даёт 36 здоровья, 0,2 регенерации здоровья, 0,16% сопротивления магии, 0,4 брони, 2,5 скорости атаки, 0,13% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.","Для героев интеллекта, даёт 36 здоровья, 0,2 регенерации здоровья, 0,16% сопротивления магии, 0,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 30 маны, 0,13 регенерации маны, 0,18% урона от способностей и 2 урона от атаки."]}