{
  "abilities": [
    {
      "notes": [
        "При применении Earthshock прерывает произносимые заклинания Ursa",
        "При применении Ursa прыгает вперед на 250 единиц по дуге высотой 83. Пока герой в воздухе, под ним могут проходить другие существа",
        "Прыгает со скоростью в 1000 в течение 0,25 сек",
        "Может перепрыгивать через существ и непроходимую территорию",
        "Во время прыжка Ursa может атаковать, использовать заклинания и предметы и поворачиваться",
        "Earthshock применяется при потере баффа прыжка; т.е. если прыжок прервали (даже смертью), то способность применится в текущем местоположении Ursa",
        "Earthshock сначала применяет дебафф, затем наносит урон",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Получение накладывающего на задетых противников Fury Swipes <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта даёт способности возможность накладывать 2 эффектов  Fury Swipes, основанных на текущем уровне этой способности. Fury Swipes накладывается только на противников, задетых эффектом Earthshock. Если эффект не был наложен (например, из-за невосприимчивости к магии), то Fury Swipes не применится к цели. Fury Swipes не срабатывают на урон Earthshock. Это значит, что урон самой Earthshock не будет увеличиваться. Примечания к Fury Swipesполностью применимы. Если способность не изучена, эффект не будет накладываться",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Ursa получает  Enrage при каждом применении Earthshock. Примечания к Enrage полностью применимы. Если способность не изучена, эффект не будет накладываться. Применяет только сопротивление эффектам и снижение входящего урона. Другие эффекты (сильное развеивание, улучшение от Aghanim's Scepter), не даются. Если Enrage уже была активна, то её длительность увеличивается на  секунды. Не важно, каким образом был получен эффект Enrage. ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Не накладывает Enrage на союзников"
      ],
      "item_behaviour": [],
      "description": "Герой прыгает вперёд на расстояние в 250 и бьёт по земле, нанося урон всем врагам вокруг и замедляя их на 4 сек.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 385",
        "Дальность прыжка: 250",
        "Урон: 75\/125\/175\/225",
        "Замедление скорости передвижения: 22%\/28%\/34%\/40%",
        "Длительность замедления: 4",
        "Длительность прыжка: 0,25",
        "Длительность Enrage:  1,5",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Эффектов Fury Swipe:  2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0f\/Ursa_Earthshock_1.mp3\/revision\/latest?cb=20191216030125",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "11\/10\/9\/8 (TagTalent 9\/8\/7\/6)",
      "aghanim": null,
      "name": "Earthshock",
      "cooldown": "95",
      "legacy_key": "E",
      "story": "Как земля содрогается под весом его могучих медвежьих шагов, так и противники начинают дрожать при его виде."
    },
    {
      "notes": [
        "Не дает максимальную скорость атаки. Даваемая скорость атаки может сведена на нет сильным замедлением",
        "Заряды тратятся при совершении атаки вне зависимости от результата. То есть промахнувшиеся атаки так же расходуют заряды",
        "В иконке баффа можно увидеть число оставшихся атак",
        "Несколько применений не складываются, но обновляют число зарядов"
      ],
      "item_behaviour": [],
      "description": "Используя свой боевой опыт, герой увеличивает скорость нескольких следующих атак.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0",
        "Доп. скорость атаки: 400",
        "Число атак: 3\/4\/5\/6 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 6\/7\/8\/9)",
        "Длительность: 20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Ursa_Overpower.mp3\/revision\/latest?cb=20191216030123",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "12\/11\/10\/9",
      "aghanim": null,
      "name": "Overpower",
      "cooldown": "30\/40\/50\/60",
      "legacy_key": "V",
      "story": "Внушительный размер обманчив — Ульфсаар чрезвычайно ловок."
    },
    {
      "notes": [
        "Каждая атака с Fury Swipes сначала добавляет один эффект, а затем наносит урон, основанный на количестве зарядов. То есть дополнительный урон применяется даже при первой атаке",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, может быть прорубающим, но не может быть критическим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение",
        "Чтобы узнать о том, сколько урона наносит Fury Swipes на каждом уровне при разном количестве эффектов, смотрите таблицу",
        "Каждая успешная атака обновляет все эффекты. Промахнувшиеся атаки не применяют бафф и не добавляют\/обновляют эффекты",
        "Число зарядов можно увидеть в иконке дебаффа у атакованных существ",
        "Не действует на постройки, варды и при атаке союзных существ",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Талант на увеличение длительности эффектов не влияет на длительность зарядов на  Рошане"
      ],
      "item_behaviour": [],
      "description": "Когти героя всё глубже впиваются в плоть врага, нанося увеличенный урон с каждой последующей атакой. Дополнительный урон будет потерян, если не атаковать цель в течение 8\/12\/16\/20 секунд.",
      "hot_key": "E",
      "params": [
        "Доп. урон за атаку: 10\/19\/28\/37 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 22\/31\/40\/49)",
        "Длительность: 8\/12\/16\/20 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 28\/32\/36\/40)",
        "Длительность на Рошане: 10"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Fury Swipes",
      "cooldown": null,
      "legacy_key": "W",
      "story": "В природе раненые редко выживают после атак голодных хищников."
    },
    {
      "notes": [
        "При использовании Enrage прерывает произносимые заклинания Ursa",
        "При использовании применяет к Ursa сильное развеивание",
        "80% снижение урона уменьшает все 3 типа урона",
        "Не снижает урон от способностей, отнимающих здоровье",
        "Сопротивление эффектам сочетается по закону убывающей полезности с другими источниками сопротивления",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Enrage можно применить при действии оглушения, урагана, сна, провокации, исчезновения или принудительного движения. Способность нельзя использовать при безмолвии, проклятии или предотвращении действий. При этом её нельзя поставить в ⇧ Shift-очередь",
        "Перекрашивает модель Ursa в пылающий красный и увеличивает её размер на 20% (не влияет на её размер столкновения)",
        "Несколько применений не сочетаются, но обновляют длительность эффекта. Не увеличивает длительность уже наложенного Enrage",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Дающий эффект от Enrage союзникам <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талант будет применять эффект от Enrage на всех союзников в радиусе 700 от Ursa. Действует на героев, клонов, иллюзии и крипов-героев. Не действует на неуязвимых и спрятанных союзников. Не накладывает сильное развеивание на союзников. Даёт 40% уменьшения входящего урона и 25% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 30%) сопротивления эффектам всем союзным героям в радиусе. ПРИМЕЧАНИЯ К AGHANIM'S SHARD Не накладывает Enrage на союзников, если способность была применена при помощи  Earthshock"
      ],
      "item_behaviour": [],
      "description": "Приводит героя в бешенство, отчего он получает сопротивление эффектам и урону. Снимает все отрицательные эффекты.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Снижение получаемого урона: 80%",
        "Доп. сопротивление эффектам: 50% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 60%)",
        "Длительность: 4\/4,5\/5",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Радиус:  700",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Бонус союзникам от Enrage:  50%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5a\/Ursa_Enrage.mp3\/revision\/latest?cb=20191216030122",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя "
      ],
      "mana": null,
      "aghanim": null,
      "name": "Enrage",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Ульфсаар отдается своему древнему духу, приобретая невиданную свирепость."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 25.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 2.6,
    "attrAgility": 18.0
  },
  "description": "С каждой атакой наносит врагу всё больше урона Ursa раздирает плоть своей жертвы, с каждым ударом нанося ей всё больше урона. Он ненадолго увеличивает скорость своих ударов, замедляет противников неподалёку и быстро разрывает их на кусочки, игнорируя боль.  Керри Лес Стойкость Контроль ★☆☆",
  "history": "Воин Ульфсаар — сильнейший член медвежьего племени, стоящий горой за свои земли и свой народ. Долгими зимами, пока матери спали и нянчили своих детёнышей, на страже стояли самцы — ревнители древних обычаев. Едва заслышав о надвигающейся угрозе, Ульфсаар направился за границы родной чащи, дабы выследить и уничтожить источник зла, пока то не навредило его народу. Ульфсаар — гордый зверь с сильным духом, крайне надёжный товарищ и невероятно стойкий защитник."
}