{
  "abilities": [
    {
      "notes": [
        "Disruption fully disables the target and turns it invulnerable and hidden for its duration. Does not disjoint projectiles. ↓↓ Double-tapping automatically targets self. Cannot be cast on allies who have ☐ Disabled Help from Shadow Demon",
        "The following abilities fully affects the target under the effect of the most recent Disruption cast by Shadow Demon, regardless of its source:  Shadow Poison adding new stack or increasing its stacks. Casting  Shadow Poison Release or losing the Shadow Poison debuff in any way still causes the damage to be dealt.  Demonic Purge and  Demonic Cleanse's damage and heal respectively",
        "Always creates the illusions, even when cast on allies or self. Can be cast on illusions, creating illusions based on the original hero. Does not create illusions if the affected target dies while affected by Disruption",
        "When the target turns invisible during Disruption, the visual effects turn invisible as well",
        "The illusions are created at the end of the duration. When the target dies during Disruption, no illusions are created. The current health of the illusions is determined upon casting Disruption, not upon creating the illusions at the end of the duration. This means any health loss caused by Shadow Demon's abilities during Disruption does not affect the health of the illusions that are about to spawn. All other stats like hero level or current mana are determined upon creating the illusions. The illusions have a EXPR 2 * IllusionLVL bounty",
        "The targeted unit's position is not shuffled with the possible illusion's position. It always reappears between the 2 illusions, at the right vertex of an isosceles right triangle. The illusions spawn 108 range away from the hero if the hero has a collision size of 24, and 72 if the collision size is 8. Each illusion appears either north, east, south, or west from the hero and faces the same direction as the hero does",
        "The illusions carry the caster's name, not the targeted unit's player name, revealing that they are illusions when not cast on self",
        "TALENT NOTES Acquiring the Disruption Charges <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent instantly grants 1 extra charge"
      ],
      "item_behaviour": [],
      "description": "Banishes the targeted unit from the battlefield for a short duration. Upon returning, two illusions of the banished unit are created under Shadow Demon's control.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range:  650",
        "Number of Illusions: 2",
        "Illusion Damage Dealt: 30%\/45%\/60%\/75%",
        "Illusion Damage Taken: 300%",
        "Illusion Duration: 11\/12\/13\/14",
        "Disruption Duration: 2.75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/39\/Shadow_Demon_Disruption.mp3\/revision\/latest?cb=20191216022837",
      "effects": [
        "Ability: Target Unit",
        "Affects: Heroes"
      ],
      "mana": "26\/24\/22\/20 (TagTalent 0)",
      "aghanim": null,
      "name": "Disruption",
      "cooldown": "26\/24\/22\/20",
      "legacy_key": "D",
      "story": "The pain of deception comes not while it happens, but when it is revealed."
    },
    {
      "notes": [
        "Disseminate has no damage delay, so all targets within the radius are damaged at the same time. Can be cast on any units, except wards and hidden units. Can only be cast on ally  Couriers. ↓↓ Double-tapping automatically targets self",
        "Damage shared is the same type as the source damage. Shares all 3 damage types, but not from HP Removal effects (e.g.  Sunder,  Soul Ring). Therefore, the shared damage interacts with every on-damage effects (i.e. disabling  Blink Dagger). Shared magical damage is still affected by magic resistance. However, shared physical damage is not affected by damage block. It is also fully affected by outgoing damage manipulation, if the amplification is sourced to Shadow Demon. Instant kill effects in the form of HP Removal (e.g.  Sacred Arrow on creeps) shares an instance of 0 damage within its radius. Fully procs on-damage effects such as  Corrosive Skin, except those which have a minimum damage threshold (e.g.  Gravekeeper's Cloak)",
        "Disseminate's damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag",
        "Spreads the full damage value before the affected enemy targets actually take the damage. This means that the damage spreads before all manipulations, so that it may only be affected by incoming damage manipulation the affected targets have. This also means it shares damage instances that exceeded the targets' current health and killed them. The shared damage is always sourced to Shadow Demon. Therefore, if a unit dies to the damage done by Disseminate, Shadow Demon gets credited for the kill",
        "Non-player-controlled units are not aggro'd by the damage. Neutral creeps do not react to the damage",
        "Successive casts update the ability values and refresh its duration"
      ],
      "item_behaviour": [],
      "description": "Whenever the target takes damage, all enemies, including the target itself if it is an enemy, within 675 range of the target also receive a portion of that damage. Can target enemy and allied units. Effect is paused if the target is hidden by Disruption.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range:  700\/800\/900\/1000",
        "Radius: 675",
        "Damage Shared: 20%\/25%\/30%\/35% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 30%\/35%\/40%\/45%)",
        "Duration: 6"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Unit",
        "Affects: Units",
        "Damage: Source Type"
      ],
      "mana": "30\/26\/22\/18",
      "aghanim": null,
      "name": "Disseminate",
      "cooldown": "100",
      "legacy_key": "C",
      "story": null
    },
    {
      "notes": [
        "Shadow Poison travels at a speed of 1000 and always travels the full distance, which takes 1.5 seconds",
        "The projectile provides 350 radius non-lingering flying vision around the poison cloud as it travels. Provides 300 radius flying vision around each enemy unit it hits, and also upon reaching the maximum travel distance. This vision lingers for 3.5 seconds",
        "With the travel distance and effect radius, it can hit units up to 1700 range away",
        "Fully affects invisible units and units under the effect of the most recent  Disruption cast by Shadow Demon. Does not affect invulnerable units or units affected other hidden sources",
        "Shadow Poison first applies the initial damage, then adds 1 stack to all enemy units within 200 radius of it on each cast. The poison first applies the debuff or adds 1 stack to an existing debuff, then deals the initial damage. Successive hits on the same unit fully refresh the whole stack's duration",
        "The first 5 stacks get their damage multiplied by 1\/2\/4\/8\/16 depending on the amount of stacks. Every following stack adds 50 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 57.5) damage on top of that, so the damage starts growing linearly after the 5th stack. Therefore, the poison's max potency is reached at the 5th stack. The damage difference between applying 2 separate stacks of five and 1 stack of ten (excluding the initial damage) is 134\/326\/518\/710 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 154.1\/374.9\/595.7\/816.5). For how much damage each stack of Shadow Poison deals on each level up to the 10th stack, with the damage increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent (before reductions), please refer to the chart below",
        "Casting  Shadow Poison Release or losing the Shadow Poison debuff in any way causes the damage to be dealt",
        "From the same source, successive casts update the ability values and refresh the whole stack's duration. From different sources, successive casts increase the stack count of the first applied stack. The damage values are not updated, and therefore the stack damage value is based on the first applied stack",
        "The current number of stacks is visible to Shadow Demon and his allies above the affected units. Enemies cannot see it. This number is visually capped at 19, however, the poison has no stack limit and can be stacked infinitely. The current number of stacks is also shown on the debuff icon, which is visible to everyone. SPELL STEAL \/ MORPH NOTES Successive casts of different ability levels increase the stack count of the first applied stack. However, the damage values are not updated, the stack damage value is based on the first applied stack"
      ],
      "item_behaviour": [],
      "description": "Deals damage in a line, and afflicts enemy units with a poison effect. The poison deals 1\/2\/4\/8\/16 times the stack damage based on the number of stacks on the target, up to 5 stacks. Additional stacks cause 50 damage each. This deferred damage is dealt when Shadow Poison's duration is expired, or the Release sub-ability is used.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.25+0",
        "Cast Range:  1500",
        "Travel Distance:  1500",
        "Effect Radius: 200",
        "Initial Damage: 30\/40\/50\/60 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 34.5\/46\/57.5\/69)",
        "Stacks to Multiply: 5",
        "Multiplied Stack Damage: 24\/36\/48\/60 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 27.6\/41.4\/55.2\/69)",
        "Non-Multiplied Stack Damage: 50 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 57.5)",
        "Stack Duration: 10"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Shadow_Demon_Shadow_Poison_1.mp3\/revision\/latest?cb=20191216022839",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "2.5 (TagTalent 1.25)",
      "aghanim": null,
      "name": "Shadow Poison",
      "cooldown": "45",
      "legacy_key": "W",
      "story": "The ever growing influence of the Shadow Demon can pollute the most valiant and pure of heroes."
    },
    {
      "notes": [
        "Shadow Poison Release is unlocked upon learning  Shadow Poison and stays always active",
        "Shadow Demon still plays the full ability cast animation when casting this sub-ability while there are no units affected by Shadow Poison. SPELL STEAL Does not grant  Shadow Poison if this sub-ability is the last cast ability"
      ],
      "item_behaviour": [],
      "description": "Releases the poison to do damage on all affected enemies. Units under the effect of Disruption can still be affected by Shadow Poison.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.3+0"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: No Target"
      ],
      "mana": "1",
      "aghanim": null,
      "name": "Shadow Poison Release",
      "cooldown": "0",
      "legacy_key": "E",
      "story": null
    },
    {
      "notes": [
        "Requires  Aghanim's Shard to be unlocked",
        "↓↓ Double-tapping automatically targets self",
        "Applies a basic dispel on the target upon cast and over its entire duration. The heal is applied after the end of the duration. A unit can only be affected by either  Demonic Purge or Demonic Cleanse, but not both",
        "Can be cast on invulnerable allies, fully affecting them. Fully affects the target under the effect of the most recent  Disruption cast by Shadow Demon, regardless of its source. Cannot be cast on allies affected by other hidden sources. Can only be cast on ally  Couriers",
        "The heal is bound to the modifier. Therefore, successive casts remove the modifier from a previous cast, triggering the heal, then applying a new instance. It starts at 0 and increases by 1.43\/1.9\/2.38 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2.38\/2.86\/3.33) for each server tick affected, reaching the max values in 7 seconds",
        "Acquiring  Aghanim's Scepter instantly grants 2 extra charges. This only happens once, re-acquiring it does not grant another 2 charges",
        "TALENT NOTES Both of  Demonic Purge's damage increasing and cooldown reducing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent also affects Demonic Cleanse. The damage increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent increases Demonic Cleanse's heal value instead"
      ],
      "item_behaviour": [],
      "description": "Cleanses the target allied unit, removing negative buffs for the duration. At the end of the duration, the unit is healed. Units under the effect of Disruption can still be affected by Demonic Cleanse.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range:  800",
        "Min Heal: 0",
        "Max Heal: 300\/400\/500 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 500\/600\/700)",
        "Duration: 7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Shadow_Demon_Demonic_Purge_1.mp3\/revision\/latest?cb=20191216022844",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies"
      ],
      "mana": "60 (TagTalent 30) (TagTalent 0)",
      "aghanim": null,
      "name": "Demonic Cleanse",
      "cooldown": "60 ( 30)",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "Applies a basic dispel on the target upon cast and over its entire duration. The damage is applied after the end of the duration. A unit can only be affected by either Demonic Purge or  Demonic Cleanse, but not both",
        "Can be cast on invulnerable units, applying the initial dispel and the debuff if the invulnerability can be dispelled. However, if the target is an enemy and if the invulnerability cannot be dispelled, only the initial dispel is applied, and the debuff is not. Fully affects the target under the effect of the most recent  Disruption cast by Shadow Demon, regardless of its source. Cannot be cast on enemies affected by other hidden sources. Can only be cast on enemy  Couriers",
        "The movement speed slow starts at 100% decreases over time to 20%. Hit units regain 0.381% of their movement speed on each server tick. This translates to 11.43% movement speed regained per second",
        "The damage is bound to the modifier. Therefore, successive casts remove the modifier from a previous cast, triggering the damage, then applying a new instance. It starts at 0 and increases by 1.43\/1.9\/2.38 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2.38\/2.86\/3.33) for each server tick affected, reaching the max values in 7 seconds",
        "SCEPTER NOTES Demonic Purge now applies Break on the target as well. The break stops affecting the target before it deals its damage. Acquiring  Aghanim's Scepter instantly grants 2 extra charges. This only happens once, re-acquiring it does not grant another 2 charges"
      ],
      "item_behaviour": [],
      "description": "Purges the target enemy unit, removing positive buffs, and slowing the target for the duration. The unit slowly regains its movement speed until the end of the duration, upon which damage is dealt. Units under the effect of Disruption can still be affected by Demonic Purge.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range:  800",
        "Min Damage: 0",
        "Max Damage: 300\/400\/500 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 500\/600\/700)",
        "Min Move Speed Slow: 20%",
        "Max Move Speed Slow: 100%",
        "Duration: 7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Shadow_Demon_Demonic_Purge_1.mp3\/revision\/latest?cb=20191216022844",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "60 (TagTalent 30) (TagTalent 0)",
      "aghanim": null,
      "name": "Demonic Purge",
      "cooldown": "60 ( 30)",
      "legacy_key": "G",
      "story": "Once Shadow Demon no longer has any need for his collected cultist, he releases it from its subservience - and its life."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 23.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 2.2,
    "attrAgility": 18.0
  },
  "description": "Stacks exponential poison damage against his foes. Conspiring to gain power in material plane, the Shadow Demon patiently amassed himself a cult of followers. An entity of malevolent corruption, he spreads Shadow Poison to pollute the pure, while catching souls to compound and Disseminate his own spell effects, few dare to approach Shadow Demon. Banishing an enemy into the void as his allies gather for the kill, his Demonic Curses can Cleanse his allies of impurities, or inflict pain while stripping unneeded servants of every enchantment, effectively relieving his enemy of their duties — and their lives.  Support Disabler Initiator Nuker ★★☆",
  "trivia": [
    "In Dota, Shadow Demon's hero name was Eredar. This was removed in his transition to Dota 2 to avoid copyright issues with Blizzard as the Eredar are a race of magic wielders from the Warcraft universe.[1]",
    "Shadow Demon's fun\/alternate name was \"Giblet\", innards of birds that are used in cooking.",
    "All of Shadow Demon's ability sound effects have some of his voice lines interpolated. The used lines are all in the demon language \"Ozkavosh\". Link▶️ (\"Sa nith icha gluth.\") is used by Link▶️ Disruption. The first part of this Link▶️ line (\"Ozh icha tak izh\") is used by Link▶️ Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Soul Catcher\".. Link▶️ (\"Grrrr, Kish!\") is used by Link▶️ Shadow Poison. Link▶️ (\"Ozh icha tak lash\") is split up into 2 parts and then used by Link▶️ Link▶️ Demonic Purge.",
    "Link▶️ (\"Sa nith icha gluth.\") is used by Link▶️ Disruption.",
    "The first part of this Link▶️ line (\"Ozh icha tak izh\") is used by Link▶️ Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Soul Catcher\"..",
    "Link▶️ (\"Grrrr, Kish!\") is used by Link▶️ Shadow Poison.",
    "Link▶️ (\"Ozh icha tak lash\") is split up into 2 parts and then used by Link▶️ Link▶️ Demonic Purge."
  ],
  "history": "Among the sovereign demons with explicit access to this world, Doom scarcely bothers with the affairs of Noninfernals and Lesser Spectral Consorts, while Shadow Fiend passes through almost exclusively on collecting expeditions. The Shadow Demon, however, has always taken a deep and abiding interest in the material plane, as if sensing that mastery of this gritty dimensional nexus might be the key to total domination of all realities. Summoned first by minor wizards, the Shadow Demon granted every wish and put on increasingly impressive displays of power until he had the full attention of the greatest demonologists, and through them the various lords, tyrants, autarchs and heirophants who depended on sorcery to buttress their mundane power. So great was his deception that all his summoners considered themselves the master and Shadow Demon the servant; meanwhile, he eroded their identities and made their minds his own. In the end, most members of the cult were hollow puppets, extensions of his evil will. What Shadow Demon's next step would have been remains open to speculation, for around this time, Nevermore the Shadow Fiend bit into a particularly nasty-tasting soul and discovered that it held nothing but a foul nougat of Shadow Demon's essence. Alerted that a coup was underway, and that the ancient equilibrium of the Umbral Pact was about to be destabilized, Doom and Shadow Fiend briefly joined forces to destroy the burgeoning cult. Combining spells of incredible force, they undid Shadow Demon's centuries of patient work, reducing his cult to smithereens—and all its members to a bloody splatter. Nothing remained except a tiny speck of demon shadow. Immortal and irreducible, this mote of evil was enough to seed the Shadow Demon's next scheme, and in fits and starts, over further centuries, he began to regroup. Whatever that speck of shadow touched, it tainted, and its influence gradually grew. A chaos of damaged parts pulled together, reknit, and combined to give Shadow Demon a form even stronger than his former. He is all but complete now, and his plan for infinite dominion lacks all of its former weaknesses. It would seem that such a being of pure malice and malevolence, a threat to all creation, would be forever out of place in our world...yet Shadow Demon does not lack for followers.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-30s Demonic Purge Cooldown",
        "talent_left": "2 Charges of Disruption"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+10% Disseminate Shared Damage",
        "talent_left": "-1.25s Shadow Poison Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+25 Movement Speed",
        "talent_left": "+200 Demonic Purge Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+15% Shadow Poison Damage",
        "talent_left": "+12 Strength"
      }
    ],
    "notes": [
      "The strength talent effectively grants Shadow Demon 240 health and 1.2 health regeneration bonus."
    ]
  }
}