{
  "abilities": [
    {
      "spell": "Terrorblade brings forth an invulnerable dark reflection of all nearby enemy heroes. Affected enemy heroes are slowed and attacked by their reflection.",
      "effects": [
        "Ability No Target",
        "Affects Enemy Heroes"
      ],
      "notes": [
        "Upon cast, slows all enemy visible heroes and illusions within range and creates illusions of them.",
        "Reflection illusions are invulnerable, untargetable, and uncontrollable.",
        "Reflection illusions have 550 movement speed and free pathing. They also provide vision equal to the vision range of their target.",
        "The illusions spawn 108 range away from their targets if the hero has a collision size of 24, and 72 if the collision size is 8. They appear either north, east, south or west from their targets.",
        "The illusions attempt to attack their targets. If they cannot be attacked, they follow the targets close enough until they can be attacked again.",
        "The illusions do not lose track when their targets turn invisible, hidden or move in the Fog of War. However, they do need vision to attack.",
        "The illusions are completely immune to every spell, even those which affect invulnerable units.",
        "Just like other illusions, Reflection illusions bestow auras and can make use of other passive abilities which work for illusions.",
        "The slow debuffs and the illusions are bound to each other. Dispelling the slow removes the all Reflection illusions of that unit as well.",
        "The slow of multiple casts does not stack, but each cast creates an illusion for each enemy hero within range. Although the slow duration gets refreshed, each created illusion has its separate duration, meaning new casts do not refresh the duration of previous illusions.",
        "Has a cast backswing of 1.66 during Metamorphosis."
      ],
      "mana": "50",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "22\/20\/18\/16 ( 14\/12\/10\/8)",
      "name": "Reflection",
      "description": [
        "Cast Animation: 0.3+0.87",
        "Radius: 900",
        "Move Speed Slow: 20%",
        "Illusion Damage Dealt: 40%\/60%\/80%\/100%",
        "Duration: 2.5\/3.5\/4.5\/5.5"
      ],
      "hot_key": "Q",
      "legacy_key": "C"
    },
    {
      "spell": "Creates an illusion of Terrorblade that deals damage.",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "The created illusions are visually distinguishable from the real Terrorblade for the enemies.",
        "The illusion spawns 108 range away from Terrorblade. It appears either north, east, south or west from him.",
        "Considering the default cooldown and cast time, it is possible to have 3 illusions up at a time.",
        "Has a cast backswing of 0.7 during Metamorphosis."
      ],
      "mana": "70\/75\/80\/85",
      "elements": [],
      "cooldown": "16",
      "name": "Conjure Image",
      "description": [
        "Cast Animation: 0.15+0.77",
        "Number of Illusions: 1",
        "Illusion Damage Dealt: 30%\/40%\/50%\/60%",
        "Illusion Damage Taken: 400%",
        "Duration: 34"
      ],
      "hot_key": "W",
      "legacy_key": "E"
    },
    {
      "spell": "Terrorblade transforms into a powerful demon with a ranged attack. Any of Terrorblade's illusions that are within 1200 range will also be transformed by Metamorphosis.",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "During the transformation, Terrorblade cannot do anything. Cannot be interrupted. This applies to transforming illusions as well.",
        "The bonus damage is added to Terrorblade's and his illusions' base attack damage.",
        "Increases Terrorblade's base attack damage to 68‒74\/88‒94\/108‒114\/128‒134, attack range to 550 ( 850) and reduces movement speed to 280.",
        "It also gives him ranged unit properties, so all items with ranged and melee differences (e.g. Manta Style) use their ranged values.",
        "Terrorblade's attack projectiles travel at a speed of 900.",
        "The aura only affects illusions under Terrorblade's control, except for the illusions from Reflection.",
        "The transformation aura's buff lingers for 1 second.",
        "While transformed, Terrorblade does not leave footprints behind.",
        "Metamorphosis is fully canceled on death."
      ],
      "mana": "100",
      "elements": [
        "Can be used by illusions.",
        "Pierces spell immunity."
      ],
      "cooldown": "155",
      "name": "Metamorphosis",
      "description": [
        "Cast Animation: 0+0",
        "Transformation Time: 0.35",
        "Illusion Radius: 1200",
        "Attack Damage Bonus: 20\/40\/60\/80",
        "Attack Range Bonus: 400 ( 700)",
        "Move Speed Loss: 30",
        "Aura Linger Duration: 1",
        "Duration: 40\/44\/48\/52"
      ],
      "hot_key": "E",
      "legacy_key": "T"
    },
    {
      "spell": "Severs the life from both Terrorblade and a target hero, exchanging a percentage of both units' current health. Some health points must remain.",
      "effects": [
        "Ability Target Unit",
        "Affects Allied Heroes \/ Enemy Heroes"
      ],
      "notes": [
        "Sunder can be cast on both enemy and allied heroes as well as illusions.",
        "Terrorblade and his target always end up with at least 35%\/30%\/25% of their maximum health. For example, if both parties have 5% health before Sunder, then they both end up at 35%\/30%\/25% thereafter.",
        "Sunder directly manipulates Terrorblade's and his target's health, so it fully ignores on-damage effects (e.g. Ice Blast, Borrowed Time, and Blade Mail).",
        "Has a cast backswing of 0.8 during Metamorphosis."
      ],
      "mana": "200\/100\/50",
      "elements": [
        "Blocked by Linken's Sphere.",
        "Partially pierces spell immunity."
      ],
      "cooldown": "120\/80\/40 ( 85\/45\/5)",
      "name": "Sunder",
      "description": [
        "Cast Animation: 0.35+0.83",
        "Cast Range: 475",
        "Minimum Health: 35%\/30%\/25%"
      ],
      "hot_key": "R",
      "legacy_key": "R"
    }
  ],
  "bio": "Terrorblade is the demon marauder--an outlaw hellion whom even other demons fear. A cosmic iconoclast, he stole from the Demon Lords, ignored the codified rites that should have bound his behavior, and broke every law of the seven Infernal Regions. For his crimes, he was taught this lesson: even Hell has a hell. A short, brutal trial ensued, with many dead on all sides, and he was finally incarcerated in Foulfell, a hidden dimension where demonkind imprison their own. But Foulfell is no normal prison. In this dark mirror of reality, demons are sentenced to gaze eternally into the twisted reflection of their own souls. But instead of suffering, Terrorblade made himself master of his own reflected worst self--a raging, thieving demon of unimaginable power. With his inner beast under sway, he destroyed the fractal prison walls and burst free to turn his terror loose upon all creation.",
  "talentsTips": [
    "The evasion talent stacks multiplicatively with other sources of evasion.",
    "The health talent increases maximum health capacity, and keeps the current health percentage.",
    "The all stats talent effectively grants Terrorblade 180 health, 1 health regen, 0.8% magic resistance, 2 armor, 12.5 attack speed, 0.63% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 10 attack damage."
  ],
  "trivia": [
    "In DotA, Terrorblade and Anti-Mage were brothers. This was to be kept in Dota 2 based on certain responses Anti-Mage made in Terrorblade's presence, but upon Terrorblade's release, these relations were severed and thus the lines went unused.",
    "Terrorblade's title in DotA was Soul Keeper. Unlike other name changes, this one does not appear to be related to copyright issues with Blizzard. A possible reason could be that the title \"Soul Keeper\" doesn't fit him anymore, since only one ability could be associated with souls.",
    "In-game, Terrorblade constantly leaves flaming footprints wherever he goes, similar to his DotA hero model, Illidan Stormrage (a prominent Warcraft character). These can be seen by enemies, but stop being rendered once he's out of their vision, meaning that one cannot track down an enemy Terrorblade that goes invisible or enters the Fog of War on the basis of his footprints.",
    "Terrorblades response when dying \"I go where angels fear to tread.\" is a reference to the line \"Fools rush in where angels fear to tread\" from Alexander Pope's poem An Essay on Criticism. Zeus also has a response that references this poem."
  ],
  "talents": [
    "+300 Metamorphosis Attack Range:-35s Sunder Cooldown",
    "-8s Reflection Cooldown:+10 All Stats",
    "+25 Attack Speed:+250 Health",
    "10% Evasion:+20 Movement Speed"
  ],
  "desc": "Terrorblade the Demon Marauder is a melee agility hero who grows to a devastating carry in the later stages of the game. Terrorblade has the highest starting armor in the game, but is squishy due to his low health, meaning he needs strength items to be tanky enough to sustain damage to himself and his illusions. As with all illusion-based heroes, he needs attribute-based items in order to make his illusions powerful. He uses Reflection, which creates invulnerable illusions of all nearby enemy heroes for a few seconds. Conjure Image creates an illusion of Terrorblade that deals considerable damage at max level. Terrorblade can create up to two illusions, which together deal more damage than Terrorblade himself, effectively multiplying Terrorblade's base damage (but not his bonus damage). Metamorphosis transforms Terrorblade into a powerful ranged demon capable of wreaking havoc on his enemies with its bonus range and damage, but makes Terrorblade slower. Metamorphosis also makes illusions of Terrorblade transform into his demonic form, but they revert back once they wander too far away from Terrorblade. Finally his ultimate, Sunder, swaps his health with a targeted hero, ally or enemy alike. This ability makes ganks on him incredibly risky since he can sunder a hero before finishing them off with a few attacks. With his two illusion-based abilities, the 'semi-ultimate' Metamorphosis and his ultimate, Sunder, Terrorblade's skill set makes him a strong foe in the early game and absolutely terrifying at the later stages of the game. He is usually played as a hard carry."
}