{"abilities":[{"spell":"Terrorblade создает неуязвимых темных двойников всех вражеских героев, находящихся рядом. Каждый двойник атакует цель и уменьшает её скорость передвижения.","effects":["Способность Ненаправленная","Действует на Вражеских героев"],"notes":["При использовании замедляет всех видимых героев (включая клонов, исключая иллюзии и крипов-героев) в радиусе и создает их иллюзии.","Двойники неуязвимые, невыделяемые и неподконтрольны герою.","Скорость передвижения двойников - 550 и они могут свободно проходить сквозь препятствия. Они также дают обзор, равный обзору их целей.","Иллюзии появляются в 108 единицах от целей, если у героя размер столкновения равен 24, и в 72 единицах, если размер столкновения равен 8. Они возникают с одной из четырех сторон от целей.","Иллюзии пытаются атаковать свои цели. Если они не смогут атаковать, то будут двигаться за целям, пока не смогут вновь атаковать.","Иллюзии не теряют цель, если она стала невидимой, спрятанной или вошла в туман войны. При этом для атаки им нужен обзор.","Иллюзии полностью неуязвимы к любым способностям, даже тем, которые поражают неуязвимых юнитов.","Как и на остальные иллюзии, на двойников действуют ауры и они могут пользоваться пассивными способностями, которые работают для них.","Замедляющий дебафф и иллюзии связаны друг с другом. Развеивание замедления убирает все иллюзии, связанные с юнитом.","Замедление от нескольких применений не складывается, но создает дополнительные иллюзии для каждого вражеского героя в радиусе. Несмотря на то, что длительности замедления обновляется, каждое использование создает отдельную иллюзию со своей собственной длительностью, поэтому длительность предыдущих иллюзий не обновляется.","В форме Metamorphosis время после применения равно 1,66 секунды."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"22\/20\/18\/16 ( 14\/12\/10\/8)","name":"Reflection","description":["Анимация применения: 0,3+0,87","Радиус: 900","Замедление скорости передвижения: 20%","Урон иллюзий: 40%\/60%\/80%\/100%","Длительность: 2,5\/3,5\/4,5\/5,5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Создает иллюзию Terrorblade, которая наносит урон.","effects":["Способность Ненаправленная"],"notes":["Для врагов созданные иллюзии визуально отличаются от настоящего Terrorblade.","Иллюзия появляется в 108 единицах от Terrorblade с одной из четырех сторон.","Учитывая базовое время перезарядки и время применения, возможно одновременно иметь 3 иллюзии.","В форме Metamorphosis время после применения равно 0,7 секунды."],"mana":"70\/75\/80\/85","elements":[],"cooldown":"16","name":"Conjure Image","description":["Анимация применения: 0,15+0,77","Количество иллюзий: 1","Иллюзия наносит урона: 30%\/40%\/50%\/60%","Иллюзия получает урона: 360%","Длительность: 34"],"hot_key":"W","legacy_key":"E"},{"spell":"Terrorblade превращается в могущественного демона с дальней атакой. Все иллюзии Terrorblade в радиусе 1200 также подвержены действию этой способности.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["В момент трансформации Terrorblade не может ничего сделать. Также её нельзя прервать. Трансформация также применяется к иллюзиям.","Дополнительный урон добавляется к базовому урону Terrorblade и его иллюзий.","Усиливает базовый урон Terrorblade до 68‒74\/88‒94\/108‒114\/128‒134 единиц, дальность атаки до 550 ( 850) единиц и снижает скорость передвижения до 280 единиц.","Также дает ему свойства юнита дальнего боя, поэтому все предметы с разницей в значениях для ближнего и дальнего боя (например, Manta Style) будут использовать значения дальнего боя.","Снаряды от атак Terrorblade летят со скоростью в 900 единиц.","Аура действует только на иллюзии под контролем Terrorblade, исключая иллюзии от Reflection.","Бафф от ауры трансформации задерживается на 1 секунд.","В трансформировавшейся форме Terrorblade не оставляет за собой следы.","Metamorphosis полностью отменяется при смерти.","При улучшении Aghanim's Scepter спустя 0.6 секунды после применения выпускается волна, исходящая от изначальной точки применения. Звук применения улучшенной Metamorphosis глобальный и слышен врагам сквозь туман войны. Волна распространяется со скоростью 1000 единиц, достигая максимальной дистанции за 1.6 секунды. Волна распространяется узким кольцом, поэтому ее можно избежать, телепортировавшись в направлении Terrorblade. Вопреки описанию страх действует на всех юнитов, а не только героев."],"mana":"100","elements":["Может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"155","name":"Metamorphosis","description":["Анимация применения: 0+0","Время трансформации: 0,35","Радиус ауры: 1200","Радиус волны страха: 0 ( 1600)","Дополнительный урон: 20\/40\/60\/80","Доп. дальность атаки: 400 ( 700)","Снижение скорости передвижения: 30","Задержка волны: 0 ( 0.6)","Длительность задержки ауры: 1","Длительность: 40\/44\/48\/52","Длительность страха: 0 ( 3.75)"],"hot_key":"E","legacy_key":"T"},{"spell":"Вырывает душу из Terrorblade и его цели, меняя их местами вместе с частью жизненной силы. Некоторая часть здоровья остается на месте.","effects":["Способность Направленная на юнита","Действует на Союзных героев \/ Вражеских героев"],"notes":["Sunder можно применить как к вражеским, так и к союзным героям, включая иллюзии.","Terrorblade и его цель всегда остаются с последними 35%\/30%\/25% от их максимального запаса здоровья. К примеру, если у них будет по 5% здоровья до использования Sunder, после использования у них будет по 35%\/30%\/25%.","Sunder напрямую влияет на здоровье Terrorblade и его цели, поэтому полностью игнорирует эффекты, реагирующие на урон (к примеру Ice Blast, Borrowed Time и Blade Mail).","В форме Metamorphosis время после применения равно 0,8 секунды."],"mana":"200\/100\/50","elements":["Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"120\/80\/40 ( 85\/45\/5)","name":"Sunder","description":["Анимация применения: 0,35+0,83","Дальность применения: 475","Мин. здоровье для обмена: 35%\/30%\/25%"],"hot_key":"R","legacy_key":"R"}],"bio":"Этот демон-мародёр обрёл славу закоренелого преступника даже среди других адских тварей. Он был невиданным бунтарём, обворовал самих Владык-демонов, отверг все установленные обряды, призванные его смирить, и преступил все законы семи кругов Ада. За это ему преподали урок: даже в преисподней есть собственный ад. После короткого, сурового суда в окружении мириады мертвецов его наконец отправили в Колодец душ — скрытое измерение, куда демоны заключают себе подобных. Но это далеко не обычная тюрьма. Колодец душ — тёмное зеркало реальности, в котором демоны обречены взирать на искривлённое отражение собственной души. Однако заключённый и не думал страдать: он подчинил себе это отражение, яростного и вороватого демона невообразимой силы. Укротив своё тёмное начало, демон разрушил фрактальные стены темницы и вырвался на свободу, дабы вселять страх во всё мироздание.","talentsTips":["Талант на уклонение мультипликативно сочетается с другими источниками уклонения.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на все атрибуты в общем даёт Terrorblade: 200 здоровья, 1 регенерации здоровья, 0,8% сопротивления магии, 1,6 брони, 10 скорости атаки, 0,5% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона заклинаний и 10 урона от атаки."],"trivia":["В оригинальной Dota Allstars, имя героя было Soul Keeper Он также был братом Anti-Mage. По первоначальной задумке Valve, в Dota 2 они должны были остаться братьями - в репликах Anti-Mage были озвучены встречи с еще не выпущенным Terrorblade. Однако, к моменту релиза нового героя, разработчики изменили это решение - во фразах Terrorblade нет никаких упоминаний к братству с Anti-Mage, а озвученные ранее реплики Anti-Mage удалили из игры. Это означает, что во второй части они больше не братья, вообще никак не связаны и даже не знакомы. Также в оригинальной Dota Allstars герой использовал модель персонажа из Warcraft Иллидана Ярость Бури.","На поясе Terrorblade изображен символ Foulfell Shard (Руны \"Заключено демонов\"). Но в то же время он сам является демоном. Символ Foulfell Shard также появляется под героем после использования Metamorphosis.","Terrorblade появляется иногда с темно-зеленым цветом кожи, рогов и крыльев вместо розоватого.","У Terrorblade самая высокая базовая броня среди остальных героев.","У Terrorblade и Anti-Mage выбран одинаковый прообраз из Warcraft 3 - Иллидан. У Terrorblade Иллидан после соприкосновения с черепом Гул'дана, у Anti-Mage- до.","В игре Terrorblade оставляет за собой пламенные следы, прямо как его DotA-предшественник, чьей моделью был Illidan Stormrage (герой мира Warcraft 3), кто также отставлял за собой огненные следы. Они могли бы быть увидены противниками, но обработка шагов прекращается, как только Terrorblade выходит из зоны их видимости, что значит враги не смогут отследить героя, ушедшего в невидимость или укрывшегося в Тумане Войны.","Фраза при убийстве героя Doom The devil's in the details. является отсылкой к одноименной песне группы Placebo.","Одна из фраз при покупке Desolator является отсылкой к песне Sympathy to the Devil группы Rolling Stones."],"talents":["+300 к дальности атаки от Metamorphosis:-35 сек. перезарядки Sunder","-8 сек. перезарядки Reflection:+10 ко всем атрибутам","+25 к скорости атаки:+250 к здоровью","+15% к уклонению:+20 к скорости передвижения"],"desc":"Terrorblade — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Первая способность, Reflection, создает неуязвимых тёмных двойников всех ближайших вражеских героев. Двойники атакует цели и ненадолго уменьшают их скорость передвижения. Вторая способность, Conjure Image, создает иллюзию Terrorblade. Третья способность, Metamorphosis, превращает Terrorblade в могущественного демона с дальним типом атаки. Ультимативная способность, Sunder, вырывает душу из Terrorblade и его цели, меняя их местами вместе с частью жизненной силы. Некоторая часть здоровья остается на месте."}