{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Riki_Smoke_Screen.mp3\/revision\/latest?cb=20191216022340",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies"
      ],
      "notes": [
        "All effects of Smoke Screen are provided by an aura and its debuff lingers for 0.5 seconds.",
        "Successive casts, including from different sources, does not update the current ability values but refresh its duration.",
        "Although the debuff lingers, its effects instantly stop if the target turns invulnerable and hidden.",
        "Stacks additively with other sources of blind. Blind uses pseudo-random distribution.",
        "Blind uses pseudo-random distribution.",
        "While channeling Tricks of the Trade, Smoke Screen has no cast animation and does not require facing the target area to cast, as long as the targeted point is within cast range. The channeling itself does get interrupted, but the ability continues with its effects. In this state, new ⇧ Shift-queue orders causes Tricks of the Trade to get completely canceled.",
        "The channeling itself does get interrupted, but the ability continues with its effects.",
        "In this state, new ⇧ Shift-queue orders causes Tricks of the Trade to get completely canceled."
      ],
      "mana": "20\/17\/14\/11 (TagTalent 16\/13\/10\/7)",
      "item_behaviour": [],
      "name": "Smoke Screen",
      "cooldown": "65\/70\/75\/80",
      "description": "Throws down a smoke bomb, silencing enemies, and causing them to miss attacks.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range:  550",
        "Effect Radius: 375 ( 435)",
        "Miss Chance: 30%\/45%\/60%\/75%",
        "Duration: 6",
        "Aura Linger Duration: 0.5"
      ],
      "legacy_key": "C",
      "story": "Since his escape during the night of his betrayal, Riki has valued the use of a simple smoke screen to confuse his opponents."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Riki_Blink_Strike.mp3\/revision\/latest?cb=20191216022336",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self \/ Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Riki gets all 2 charges immediately upon learning Blink Strike.",
        "Blink Strike always teleports Riki behind the target. Does not disjoint projectiles upon teleporting.",
        "Does not disjoint projectiles upon teleporting.",
        "Can be cast on allies without damaging them.",
        "Riki is ordered to attack the target if it is an enemy.",
        "The bonus damage is independent from Riki's attack damage and it is considered as spell damage. The bonus damage is instantly dealt to the target. This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them.",
        "The bonus damage is instantly dealt to the target.",
        "This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them.",
        "Blink Strike first applies the slow debuff, then the bonus damage, then Riki's attack damage, then the attack animation bonus. This reduces Riki's attack animation to 0.15+0.15 for the next attack.",
        "This reduces Riki's attack animation to 0.15+0.15 for the next attack.",
        "When targeting an enemy, Riki receives a hidden buff. This buff makes the next attack apply an ensured backstab hit with Cloak and Dagger based on its current level, regardless of the target's facing angle. This means if the target manages to turn around before Riki's attack hits, it still applies the backstab damage. Cloak and Dagger damage notes fully apply. If it is not learned, the backstab damage is not applied. The buff lasts for 1 attack, or for up to 1 second, whichever happens first. The buff is used up upon starting an attack, not upon landing it, so canceling or missing the attack wastes it. The 1-second duration allows Riki to use the ensured backstab damage against other units than the Blink Strike target.",
        "This buff makes the next attack apply an ensured backstab hit with Cloak and Dagger based on its current level, regardless of the target's facing angle.",
        "This means if the target manages to turn around before Riki's attack hits, it still applies the backstab damage.",
        "Cloak and Dagger damage notes fully apply. If it is not learned, the backstab damage is not applied.",
        "The buff lasts for 1 attack, or for up to 1 second, whichever happens first.",
        "The buff is used up upon starting an attack, not upon landing it, so canceling or missing the attack wastes it.",
        "The 1-second duration allows Riki to use the ensured backstab damage against other units than the Blink Strike target.",
        "Cannot be cast on invulnerable and hidden units, buildings, Couriers and wards.",
        "Counterspell does not reflect Blink Strike. However, it is still blocked.",
        "Blink Strike has a 0.1-second cooldown to prevent accidental double-casts on the same target."
      ],
      "mana": "0.1",
      "item_behaviour": [],
      "name": "Blink Strike",
      "cooldown": "25\/20\/15\/10 ( 21\/16\/11\/6)",
      "description": "Teleports behind the target unit, momentarily slowing them and striking for bonus damage if it is an enemy.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  600\/700\/800\/900",
        "Self Attack Animation Speed Bonus: 50%",
        "Damage: 40\/55\/70\/85",
        "Enemy Move Speed Slow: 100%",
        "Slow Duration: 0.2\/0.4\/0.6\/0.8 ( 0.6\/0.8\/1\/1.2)"
      ],
      "legacy_key": "B",
      "story": "The Stealth Assassin's agile movement makes him impossible to escape."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d5\/Riki_Tricks_of_the_Trade.mp3\/revision\/latest?cb=20191216022342",
      "effects": [
        "Ability: Target Area",
        "Affects: Self \/ Enemies",
        "Damage: Instant Attack"
      ],
      "notes": [
        "Tricks of the Trade disjoints projectiles upon cast.",
        "Certain items abilities which do not cancel channeling (e.g. Shadow Walk or Arctic Blast) do cancel Tricks of the Trade. While channeling, Smoke Screen has no cast animation and does not require facing the target area to cast, as long as the targeted point is within cast range. The channeling itself does get interrupted, but the ability continues with its effects. In this state, new ⇧ Shift-queue orders causes Tricks of the Trade to get completely canceled.",
        "While channeling, Smoke Screen has no cast animation and does not require facing the target area to cast, as long as the targeted point is within cast range.",
        "The channeling itself does get interrupted, but the ability continues with its effects.",
        "In this state, new ⇧ Shift-queue orders causes Tricks of the Trade to get completely canceled.",
        "Riki is phased, invulnerable and hidden during Tricks of the Trade.",
        "Causes Riki to perform instant attacks on 1 (TagTalent 2) enemies within range in 0.67 (TagTalent 0.5)-second intervals, starting immediately upon cast, resulting in 4 (TagTalent 5) instances. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms. Since the damage comes from a regular attack, it counts as attack damage and not as spell damage. Fully affect enemy Couriers. This means it is affected by damage block, unaffected by spell damage amplification, and cannot spell lifesteal.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "Since the damage comes from a regular attack, it counts as attack damage and not as spell damage.",
        "Fully affect enemy Couriers.",
        "This means it is affected by damage block, unaffected by spell damage amplification, and cannot spell lifesteal.",
        "Tricks of the Trade first checks Riki's total agility and grants the agility bonus, and then reduces his main attack damage. This can be defined as (43 + ΣAgi × 155%\/170%\/185%\/200%) × 40% The agility bonus lasts as long as the channel time, and only the ability can use it.",
        "This can be defined as (43 + ΣAgi × 155%\/170%\/185%\/200%) × 40%",
        "The agility bonus lasts as long as the channel time, and only the ability can use it.",
        "During Tricks of the Trade, Cloak and Dagger based on the current level triggers on every attack, regardless of the enemy's facing angle. Cloak and Dagger damage notes fully apply. If it is not learned, the backstab damage is not applied.",
        "Cloak and Dagger damage notes fully apply. If it is not learned, the backstab damage is not applied.",
        "The instant attacks do not break Disguise and Cloak and Dagger's invisibility, although Cloak and Dagger visually goes on cooldown.",
        "Does not affect invisible units, but does affect units inside the Fog of War.",
        "The visual effects indicating Tricks of the Trade's attack radius are visible to both allies and enemies. The attack radius is always centered on Riki and follows him even when he gets moved (e.g. with Glimpse). However, a part of the radius indicating visual effects on the ground does not follow Riki, and stays at the cast location.",
        "The attack radius is always centered on Riki and follows him even when he gets moved (e.g. with Glimpse).",
        "However, a part of the radius indicating visual effects on the ground does not follow Riki, and stays at the cast location.",
        "Riki reappears at the center of the ability after the max channel time. ↓↓ Double-tapping automatically moves Riki to the targeted location within the cast range.",
        "↓↓ Double-tapping automatically moves Riki to the targeted location within the cast range.",
        "SCEPTER NOTES Trick of the Trade now attacks 2 enemies at once, resulting in up to 10 attacks over the same intervals and duration. Can be cast on an allied hero, including illusions and clones, excluding creep-heroes. Fully ignore ally Couriers. Riki and all of Tricks of the Trade's effects are centered around and follow the allied hero. Riki still remains hidden. The ability does not end when the target dies and continues at its corpse's location. It is still bound to the ally, so when it reincarnates, it follows it still.",
        "Can be cast on an allied hero, including illusions and clones, excluding creep-heroes.",
        "Fully ignore ally Couriers.",
        "Riki and all of Tricks of the Trade's effects are centered around and follow the allied hero. Riki still remains hidden.",
        "The ability does not end when the target dies and continues at its corpse's location. It is still bound to the ally, so when it reincarnates, it follows it still.",
        "TALENT NOTES The Tricks of the Trade dispel talent applies a basic dispel on Riki upon cast and allows it to be cast while rooted or leashed."
      ],
      "mana": "18\/16\/14\/12 (TagTalent 14\/12\/10\/8)",
      "item_behaviour": [],
      "name": "Tricks of the Trade",
      "cooldown": "55",
      "description": "Riki phases out of the world while striking random enemy units from behind in an area around him.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  400 ( 700)",
        "Max Channel Time: 2",
        "Radius: 450",
        "Attack Targets: 1 ( 2)",
        "Attack Count: 4 ( 5)",
        "Agility Bonus: 55%\/70%\/85%\/100%",
        "Instant Attack Damage: 40%"
      ],
      "legacy_key": "T",
      "story": "The Stealth Assassin is not afraid to fight dirty, and specializes in attacking his opponents from behind."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Riki_Sleeping_Dart_1.mp3\/revision\/latest?cb=20210103151321",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "The projectile travels at a speed of 1600.",
        "Applies sleep on affected units, preventing them from acting, until woken up. The target wakes up only after cumulatively taking 200 damage. The counter counts damage after all reductions.",
        "The target wakes up only after cumulatively taking 200 damage.",
        "The counter counts damage after all reductions.",
        "Sleeping units are never automatically attacked, regardless of auto attack settings. This means that sleeping units are never attacked by lane creeps, neutral creeps, towers and fountains. Players can still force an attack order on the target (TagTalent Right Click or A).",
        "This means that sleeping units are never attacked by lane creeps, neutral creeps, towers and fountains.",
        "Players can still force an attack order on the target (TagTalent Right Click or A).",
        "The damage and slow are applied upon losing the sleep debuff, no matter how. This means dispelling it applies the effects as well. The debuff first applies the movement speed slow debuff, then the damage.",
        "This means dispelling it applies the effects as well.",
        "The debuff first applies the movement speed slow debuff, then the damage."
      ],
      "mana": "12",
      "item_behaviour": [],
      "name": "Sleeping Dart",
      "cooldown": "75",
      "description": "Fires a dart at the target enemy, putting them to sleep. The target will wake up at the end of the duration or if they take too much damage. Upon waking up, the target takes damage and is slowed.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.57",
        "Cast Range:  1000",
        "Wake Up Damage Threshold: 200",
        "Damage: 150",
        "Move Speed Slow: 30%",
        "Slow Duration: 4",
        "Sleep Duration: 3"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/90\/Riki_Cloak_and_Dagger.mp3\/revision\/latest?cb=20191216022338",
      "effects": [
        "Ability: Passive",
        "Affects: Self \/ Enemies",
        "Damage: Physical"
      ],
      "notes": [
        "Riki does not auto-attack enemies while invisible.",
        "Riki starts off invisible and does not need to go through the fade delay when he respawns or during reincarnation.",
        "Casting abilities or using items does not break the invisibility.",
        "The ability icon shows a cooldown whenever the invisibility is broken. However, this has only informative purposes. The cooldown is not affected by any cooldown reduction and cooldown resets sources. Both Time Dilation and Chakra Magic affect the cooldown visually, but do not affect the fade delay in any way.",
        "The cooldown is not affected by any cooldown reduction and cooldown resets sources.",
        "Both Time Dilation and Chakra Magic affect the cooldown visually, but do not affect the fade delay in any way.",
        "Backstab damage is also applied when attacking and denying allies. Fully affect enemy Couriers.",
        "Fully affect enemy Couriers.",
        "Backstab damage is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Riki's attack damage. The attack damage bonus is considered by lifesteal, crit, and cleave, and it can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Riki's attack damage.",
        "The attack damage bonus is considered by lifesteal, crit, and cleave, and it can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "During Tricks of the Trade, the agility bonus effectively increases Cloak and Dagger damage per agility to the following values: Level 1: 2.17\/2.38\/2.59\/2.8 (TagTalent 2.95\/3.23\/3.52\/3.8) damage per agility. Level 2: 2.79\/3.06\/3.33\/3.6 (TagTalent 3.57\/3.91\/4.26\/4.6) damage per agility. Level 3: 3.41\/3.74\/4.07\/4.4 (TagTalent 4.19\/4.59\/5\/5.4) damage per agility.",
        "Level 1: 2.17\/2.38\/2.59\/2.8 (TagTalent 2.95\/3.23\/3.52\/3.8) damage per agility.",
        "Level 2: 2.79\/3.06\/3.33\/3.6 (TagTalent 3.57\/3.91\/4.26\/4.6) damage per agility.",
        "Level 3: 3.41\/3.74\/4.07\/4.4 (TagTalent 4.19\/4.59\/5\/5.4) damage per agility.",
        "",
        "The sound effect plays at the start of the attack, but the damage is applied on hit.",
        "TALENT NOTES The movement speed talent is only granted while invisible (i.e. when the ability is not on cooldown)."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Cloak and Dagger",
      "cooldown": null,
      "description": "Riki fades into the shadows, becoming invisible. Every time Riki strikes his enemy from behind, he deals bonus damage based on his Agility. When Riki attacks, he becomes visible.",
      "hot_key": "R",
      "params": [
        "Fade Delay: 4\/3\/2",
        "Back Angle: 105°",
        "Hero Damage per Agility: 1.4\/1.8\/2.2 ( 1.9\/2.3\/2.7)",
        "Creep Damage per Agility: 2.8\/3.6\/4.4 ( 3.8\/4.6\/5.4)",
        "<span image=\"images\\Talent\"><\/span> Move Speed Bonus: 8%"
      ],
      "legacy_key": "E",
      "story": "Riki comes for you."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 18.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.3,
    "attrAgilityInc": 1.4,
    "attrAgility": 18.0
  },
  "description": "Remains permanently invisible until the moment to strike. Leaving his past life behind, Riki escaped the royal grounds using his own Cloak-and-Dagger methods. Stealthy and fond of killing from behind, Riki throws down a dense Smoke Screen, blinding and choking foes as he takes them by surprise with Blink Strike. Intruders who enter his turf is greeted with twin daggers, flashes of steel that slash simultaneously at every turned back, or being tranquilized by his signature Sleeping Dart, while the master himself remains unseen. How this feat is accomplished remains a mystery, for the Stealth Assassin is not one to divulge his Tricks of the Trade.  Carry Escape Disabler ★☆☆",
  "trivia": [
    "In DotA, Riki was named \"Rikimaru\" (力丸), a reference to one of the main characters in the Tenchu video game series. The name is carried over to Riki's official Chinese hero name.",
    "Riki's fun\/alternate name was Riki Martin, which is a pun on Ricky Martin, a famous Latino pop singer.",
    "Riki's line upon dying, Link▶️ \"Good assassins never die… they just fade away.\", is a reference to a quote by General Douglas MacArthur, \"Old soldiers never die; they just fade away.\"",
    "Riki's line Link▶️ \"There are none so stabbed as those who will not see.\" is a reference to a proverb: \"There are none so blind as those who will not see.\"",
    "Riki's line Link▶️ \"I speak softly, but carry a sharp knife.\" is a reference to the West African Proverb \"Speak softly and carry a big stick.\", popularized by U.S. president Theodore Roosevelt."
  ],
  "history": "Riki was born middle child to the great dynasty of Tahlin. With an older brother groomed for the throne, and a younger brother coddled and kept, Riki, the small middle son, seemed born for the art of invisibility. It was an art he cultivated, and one which ultimately saved his life on the night that his people were betrayed and his family slaughtered. Of all the royal line, he alone escaped—small and agile, unassuming, using smoke as cover. He cut his way out of the royal grounds, using the advantage of surprise, quietly slitting the throats of one enemy warrior after another. Now free of his royal responsibilities, Riki uses his talents in service to a new trade: Stealth Assassin. He silences his enemies, sharpening his skills, hoping to one day take revenge on those who killed his family and robbed him of his birthright.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-4 Tricks of the Trade Cooldown",
        "talent_left": "Tricks of the Trade Applies a Basic Dispel"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+0.5 Backstab Multiplier",
        "talent_left": "-4s Blink Strike Replenish Time"
      },
      {
        "talent_lvl": "15",
        "talent_right": "8% Cloak and Dagger Movement Speed",
        "talent_left": "-4s Smoke Screen Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+60 Smoke Screen AoE",
        "talent_left": "+0.4s Blink Strike Slow"
      }
    ]
  }
}