{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9c\/Phase_Boots_Phase.mp3\/revision\/latest?cb=20191227195518",
      "effects": [
        "Move Speed Bonus (TagAghanimMelee): 20%",
        "Move Speed Bonus (TagAghanimRanged): 10%",
        "Turn Rate (TagAghanimMelee): 1",
        "Duration: 3"
      ],
      "notes": [
        "Does not interrupt the caster's channeling abilities upon cast.",
        "Allows the caster to phase through other units, including wards, but not buildings and trees.",
        "Checks the caster's attack range type (TagTalent melee or ranged) periodically and updates the movement speed bonus immediately.",
        "For melee heroes, it increases the average movement speed by 7.5% and increases the caster base turn rate to 1 for its duration. Turn rate slowing effects (e.g. Sticky Napalm) still affect it normally.",
        "Turn rate slowing effects (e.g. Sticky Napalm) still affect it normally.",
        "For ranged heroes, it increases the average movement speed by 3.75%.",
        "The buff is immediately removed, if the item is sold, dropped, or when moved into the backpack."
      ],
      "mana": "0",
      "abilityName": "Phase",
      "cooldown": "8",
      "description": "Gives 20% increased movement speed on melee heroes, and 10% on ranged heroes, and lets you move through units and turn more quickly for 3 seconds.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Movement speed bonuses from multiple pairs of Boots of Speed-based items do not stack, the one with a higher value takes priority.",
    "Stacks with all other movement speed bonus."
  ],
  "cost": "1500",
  "lore": null,
  "consistFrom": [
    "Boots of Speed",
    "Chainmail",
    "Blades of Attack"
  ],
  "name": "Phase Boots",
  "description": "Boots that allow the wearer to travel between the ether.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}