{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The strength talent effectively grants Dragon Knight 400 health, 2 health regeneration, and 20 main attack damage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+375 AoE Dragon Tail During Elder Dragon Form",
          "talentRight": "+12 Dragon Blood HP Regen\/Armor"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 Strength",
          "talentRight": "+150 Elder Dragon Form Attack Range"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+400 Health",
          "talentRight": "+0.5s Dragon Tail"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-30% Breathe Fire Damage Reduction",
          "talentRight": "+15 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/15\/Dragon_Knight_Breathe_Fire.mp3\/revision\/latest?cb=20191216012628",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Breathe Fire travels at a speed of 1050.",
        "With the travel distance and end radius, Breathe Fire can hit units up to 1000 range away. The complete area is shaped like a cone.",
        "The complete area is shaped like a cone.",
        "Reduces hit targets' total attack damage, including attack damage bonuses.",
        "Breathe Fire first applies the damage, then the debuff.",
        "Has a cast backswing of 0.53 seconds while in Elder Dragon Form."
      ],
      "mana": "90\/100\/110\/120",
      "item_behaviour": [],
      "name": "Breathe Fire",
      "cooldown": "14\/13\/12\/11",
      "description": "Unleashes a breath of fire in front of Dragon Knight that burns enemies and reduces the damage their attacks deal.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.47",
        "Cast Range: 600",
        "Starting Radius: 150",
        "Travel Distance: 750",
        "End Radius: 250",
        "Damage: 90\/170\/240\/300",
        "Attack Damage Reduction: 25% (TagTalent 55%)",
        "Reduction Duration: 11",
        "Attack damage reduction persists if debuff was placed before spell immunity and when not dispelled. Can directly target spell immune units, launching the fire in their direction."
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bc\/Dragon_Knight_Dragon_Tail_1.mp3\/revision\/latest?cb=20191216012629",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "In human form, Dragon Tail does not rely on a projectile and can therefore not be disjointed.",
        "Dragon Tail first applies the damage, then the debuff.",
        "While in Elder Dragon Form, Dragon Tail has a cast range of 400 and uses a projectile, instead of being instant. The projectile travels at a speed of 1600.",
        "The projectile travels at a speed of 1600.",
        "The level 25 talent adds a 375 radius to this ability while in Elder Dragon Form. The ability still must be centered over a unit. Causes the launched projectile to apply its effects within the area, instead of only to the targeted unit. Can hit invisible units and units inside the Fog of War.",
        "Causes the launched projectile to apply its effects within the area, instead of only to the targeted unit.",
        "Can hit invisible units and units inside the Fog of War."
      ],
      "mana": "70\/80\/90\/100",
      "item_behaviour": [],
      "name": "Dragon Tail",
      "cooldown": "16\/14\/12\/10",
      "description": "Dragon Knight smites an enemy unit in melee range with his shield, stunning it while dealing minor damage. When in Elder Dragon Form, the cast range increases to 400.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0.5",
        "Cast Range: 150",
        "Damage: 70\/100\/130\/160",
        "Stun Duration: 2.25\/2.5\/2.75\/3 (TagTalent 2.75\/3\/3.25\/3.5)",
        "The projectile used during Elder Dragon Form can be disjointed."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Can regenerate up to 180\/360\/540\/720 (TagTalent 900\/1080\/1260\/1440) health in one minute."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Dragon Blood",
      "cooldown": null,
      "description": "The life blood of the Dragon improves health regeneration and strengthens armor.",
      "hot_key": "E",
      "params": [
        "Health Regen Bonus: 3\/6\/9\/12 (TagTalent 15\/18\/21\/24)",
        "Armor Bonus: 3\/6\/9\/12 (TagTalent 15\/18\/21\/24)",
        "Illusions benefit from the health regeneration, but not from the armor."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Dragon_Knight_Fireball.mp3\/revision\/latest?cb=20201225162937",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "The damage is provided by an aura, its debuff lingers for 2 seconds.",
        "Deals 32.5 damage in 0.5-second intervals, immediately upon receiving the debuff, resulting in 25 damage instances. Can deal up to 812.5 damage to a single unit (before reductions).",
        "Can deal up to 812.5 damage to a single unit (before reductions).",
        "Multiple instances of Fireball's debuff do not stack.",
        "While in Elder Dragon Form, Fireball has a cast range of 1400."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Fireball",
      "cooldown": "20",
      "description": "Ignites a 450 AoE area for 10 seconds, dealing 65 damage per second that lingers for 2 seconds to enemies in it. Has reduced cast range when melee.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.53",
        "Cast Range: 600",
        "Radius: 450",
        "Damage per Second: 65",
        "Duration: 10",
        "Aura Linger Duration: 2",
        "Continues to deal damage while lingering out if spell immunity was acquired after receiving the debuff."
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/59\/Dragon_Knight_Elder_Dragon_Form.mp3\/revision\/latest?cb=20191216012624",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Magical \/ Physical"
      ],
      "notes": [
        "Increases Dragon Knight's movement speed to 335 and attack range to 500 (TagTalent 650) (TagTalent and magic resistance to 43.75%). Also gives Dragon Knight ranged attack properties. His attack projectiles travel at a speed of 900.",
        "Also gives Dragon Knight ranged attack properties. His attack projectiles travel at a speed of 900.",
        "Level 1 transforms him into a Green Dragon, level 2 into a Red Dragon, and level 3 into a Blue Dragon (TagTalent and level 4 into a Black Dragon).",
        "Elder Dragon Form is fully canceled on death. The Dragon Form buff is hidden, only the 3 attack modifier buffs are displayed.",
        "Successive casts of Elder Dragon Form refresh the duration and update the form, adapting to the current level of the ability.",
        "While in Elder Dragon Form, Dragon Knight gains the following attack modifiers through undispellable buffs:",
        "Corrosive Breath: (Available for Level 1 and higher levels of Elder Dragon Form) Places a Corrosive Breath debuff, which deals magical damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 5 instances. When on level 2 or higher, the debuff is applied to all enemies within the splash radius. Can deal up to 100 (TagTalent 150) damage to a unit (before reductions). Does not work against wards, works against allied units. Corrosive Breath fully affects buildings, meaning it can also be used to deny allied towers. However, buildings are only debuffed when directly attacked. Successive hits do not stack, but refresh the duration. The attacks first apply the debuff, then their own attack damage. However, on secondary targets, it first applies the splash damage, then the debuff. When an attack misses or is disjointed, the debuff is not applied within the radius.",
        "Places a Corrosive Breath debuff, which deals magical damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 5 instances.",
        "When on level 2 or higher, the debuff is applied to all enemies within the splash radius.",
        "Can deal up to 100 (TagTalent 150) damage to a unit (before reductions).",
        "Does not work against wards, works against allied units.",
        "Corrosive Breath fully affects buildings, meaning it can also be used to deny allied towers. However, buildings are only debuffed when directly attacked.",
        "Successive hits do not stack, but refresh the duration.",
        "The attacks first apply the debuff, then their own attack damage. However, on secondary targets, it first applies the splash damage, then the debuff.",
        "When an attack misses or is disjointed, the debuff is not applied within the radius.",
        "Splash Attack: (Available for Level 2 and higher levels of Elder Dragon Form) When an attack misses or is disjointed, no splash damage is dealt. Splash damage cannot be amplified with outgoing spell damage amplification and cannot spell lifesteal. Can be amplified by incoming spell damage amplification. The splash damage is physical damage, and is affected by Damage Block. Does not work against wards or buildings.",
        "When an attack misses or is disjointed, no splash damage is dealt.",
        "Splash damage cannot be amplified with outgoing spell damage amplification and cannot spell lifesteal. Can be amplified by incoming spell damage amplification.",
        "Can be amplified by incoming spell damage amplification.",
        "The splash damage is physical damage, and is affected by Damage Block.",
        "Does not work against wards or buildings.",
        "Frost Breath: (Available for Level 3 and higher levels of Elder Dragon Form) Does not work against wards, buildings, or allied units. Successive hits do not stack, but refresh the duration. The attacks first apply the debuff, then their own attack damage. The splash damage is applied after the debuff as well. When an attack misses or is disjointed, the slow is not applied within the radius.",
        "Does not work against wards, buildings, or allied units.",
        "Successive hits do not stack, but refresh the duration.",
        "The attacks first apply the debuff, then their own attack damage. The splash damage is applied after the debuff as well. When an attack misses or is disjointed, the slow is not applied within the radius.",
        "When an attack misses or is disjointed, the slow is not applied within the radius.",
        "With Aghanim's Scepter, the level of Elder Dragon Form increases 1. Elder Dragon Form has 4 levels by default, but the 4th level can only be reached with Aghanim's Scepter. The Black Dragon form has unobstructed movement, allowing him to path over impassable terrain, units, buildings, and trees. However, it does not have phased movement meaning other units cannot pass through it. The black dragon form is 30% larger than the other forms.",
        "Elder Dragon Form has 4 levels by default, but the 4th level can only be reached with Aghanim's Scepter.",
        "The Black Dragon form has unobstructed movement, allowing him to path over impassable terrain, units, buildings, and trees.",
        "However, it does not have phased movement meaning other units cannot pass through it.",
        "The black dragon form is 30% larger than the other forms."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Elder Dragon Form",
      "cooldown": "115\/110\/105 (TagTalent \/100)",
      "description": "Dragon Knight takes the form of one of three powerful elder dragons, increasing his speed, and Dragon Tail's range, while granting him new powers. LEVEL 1 Green Dragon - Corrosive Breath: attacks deal 20 poison damage per second for 5 seconds. Works on structures. LEVEL 2 Red Dragon - Splash Attack: attacks damage all enemy units in a 350 radius for 0%\/75%\/75%\/100%, with Corrosive Breath added to the targets. LEVEL 3 Blue Dragon - Frost Breath: slows movement speed by 40% and attack speed by 40 of enemy units in Splash Attack range for 3 seconds, with Corrosive Breath added to the targets.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0.5",
        "Attack Range Bonus: 350 (TagTalent 500)",
        "Move Speed Bonus: 25",
        "Magic Resistance Bonus: 0%\/0%\/0% (TagAghanim \/25%)",
        "Dragon Tail Cast Range Bonus: 250",
        "Dragon Form Duration: 60",
        "Corrosive Breath Damage per Second: 20\/20\/20 (TagAghanim \/30)",
        "Corrosive Breath Debuff Duration: 5",
        "Splash Attack Radius: 350",
        "Splash Attack Damage: 0%\/75%\/75% (TagAghanim \/100%)",
        "Frost Breath Radius: 300",
        "Frost Breath Move Speed Slow: 0%\/0%\/40% (TagAghanim \/60%)",
        "Frost Breath Attack Speed Slow: 0\/0\/40 (TagAghanim \/60)",
        "Frost Breath Debuff Duration: 3",
        "Dragon Tail Radius: 375",
        "Fireball Cast Range Bonus: 800",
        "Increases the level of Dragon Knight's ultimate. Adds a 4th level, Black Dragon. Black Dragon has bonus Corrosive Damage, Splash Damage and Slow amount, 25% increased Magic Resistance and free pathing.",
        "Grants a new ability: Fireball",
        "Poison and frost breath do not pierce spell immunity. Splash pierces spell immunity. Corrosive Breath attempts to damage spell immune enemies when placed before spell immunity and when not dispelled.",
        "Illusions get their own Elder Dragon Form buff lasting its regular duration."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 21.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 2.0,
    "attrAgility": 19.0
  },
  "description": "Davion, the Dragon Knight, is a durable melee strength hero with a relatively straightforward and yet versatile skill set. He has both an area-of-effect nuke and a lengthy single-target stun, giving him excellent farming and ganking capabilities. Though he has no real escape ability, his Dragon Blood provides him a hefty amount of armor and regen, making him capable of withstanding strong physical hits and recovering quickly. He is still very vulnerable in the early game, however, and needs to farm and stay alive in order to be effective in later stages. If he has enough levels and farm, Dragon Knight is very formidable in the late game due to his strong ultimate, Elder Dragon Form, which transforms him into a legendary dragon with a ranged attack, capable of eliminating multiple enemies at once.",
  "history": "After years on the trail of a legendary Eldwurm, the Knight Davion found himself facing a disappointing foe: the dreaded Slyrak had grown ancient and frail, its wings tattered, its few remaining scales stricken with scale-rot, its fangs ground to nubs, and its fire-gouts no more threatening than a pack of wet matchsticks. Seeing no honor to be gained in dragon-murder, Knight Davion prepared to turn away and leave his old foe to die in peace. But a voice crept into his thoughts, and Slyrak gave a whispered plea that Davion might honor him with death in combat. Davion agreed, and found himself rewarded beyond expectation for his act of mercy: As he sank his blade in Slyrak's breast, the dragon pierced Davion's throat with a talon. As their blood mingled, Slyrak sent his power out along the Blood Route, sending all its strength and centuries of wisdom to the knight. The dragon's death sealed their bond and Dragon Knight was born. The ancient power slumbers in the Dragon Knight Davion, waking when he calls it. Or perhaps it is the Dragon that calls the Knight…",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+375 AoE Dragon Tail During Elder Dragon Form",
      "talentRight": "+12 Dragon Blood HP Regen\/Armor"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 Strength",
      "talentRight": "+150 Elder Dragon Form Attack Range"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+400 Health",
      "talentRight": "+0.5s Dragon Tail"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-30% Breathe Fire Damage Reduction",
      "talentRight": "+15 Damage"
    }
  ]
}