{"abilities":[{"spell":"Magnus sends out a wave of force, damaging enemy units in a line and pulling them towards him.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The Shockwave travels at a speed of 900 ( 1200), taking 1.333 ( 1.438) seconds to reach the maximum distance.","Can hit units up to 1400 ( 1925) range away (travel distance + radius).","Hit enemies are pulled towards the center of the Shockwave and towards Magnus. The further enemies are from the center of the shockwave, the stronger the pull force is towards its center than towards Magnus. Pulles hit enemies 100 range over 0.2 seconds, resulting in a speed of 500.","The shockwave first applies the debuffs, then the damage.","Plays an initial sound and particles upon start casting.","When upgraded, the shockwave travels back to where the caster was upon cast, and not to where the caster currently is, or is upon reaching max distance. The returning shockwave acts like a separate cast. Therefore, enemies at the very tip may be hit only once. This is because Shockwave does not hit units behind the caster, so units hit by it 200 range beyond its max travel distance do not get hit upon returning. On the other side, units 200 range beyond the original cast point do get hit. On its way back, the shockwave can hit previously already hit enemies a second time. The slow from the returning shockwave lasts longer. Treats creep-heroes as creeps, dealing 37.5\/75\/112.5\/150 ( 75\/112.5\/150\/187.5) damage to them upon returning.","The slow of multiple casts does not stack, it only refreshes the duration. This includes the returning shockwave from the upgrade."],"mana":"90\/100\/110\/120","elements":["Does not pierce spell immunity."],"cooldown":"14\/13\/12\/11","name":"Shockwave","description":["Cast Animation: 0.3+1.2","Cast Range: 1200 ( 1725)","Wave Distance: 1200 ( 1725)","Wave Radius: 200","Damage: 75\/150\/225\/300 ( 150\/225\/300\/375)","Movement Speed Slow: 60%","Pull Distance: 100","Pull Duration: 0.2","Slow Duration: 0.75","Returning Shockwave Slow Duration: 0 ( 2)"],"hot_key":"Q","legacy_key":"W"},{"spell":"Gives an allied unit bonus damage and cleave on attack.","effects":["Ability Target Unit","Affects Allies","Damage Physical"],"notes":["Only increases base damage and that given by the primary attribute of affected units. Raw bonus damage is not increased.","The unit's current main damage is periodically checked, and the bonuses adapted instantly.","Grants melee targets cleave and attack damage, and ranged targets only attack damage.","Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","Cleave damage depends on the attack damage value of the cleaving unit, not on how much their primary attack target took.","The complete cleave area is shaped like an isosceles trapezoid in front of the attacking unit.","Fully stacks with other sources of cleave. Each source of cleave works completely independent.","Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.","Despite the visual effect, cleave damage is applied instantly in the whole area."],"mana":"30\/50\/70\/90","elements":["Cannot be used by illusions.","Pierces spell immunity."],"cooldown":"8","name":"Empower","description":["Cast Animation: 0.3+1.07","Cast Range: 800","Cleave Starting Radius: 150","Cleave Distance: 650","Cleave End Radius: 360","Cleave Damage: 14%\/34%\/54%\/74% ( 34%\/54%\/74%\/94%)","Attack Damage Bonus: 10%\/20%\/30%\/40% ( 30%\/40%\/50%\/60%)","Duration: 40"],"hot_key":"W","legacy_key":"E"},{"spell":"Magnus rushes forward, goring enemy units on his massive tusk. Heroes hit on the way will be dragged to the destination, then damaged and slowed.","effects":["Ability Target Point","Affects Enemy Heroes \/ Self","Damage Magical"],"notes":["Magnus charges at a speed of 950.","Moves Magnus in 31.67 range instances. When targeting any distance which is not a multiplier of that number, it gets rounded down. This means the minimal possible distance is 31.67 and the maximum possible 887\/982\/1077\/1172 ( 1393\/1488\/1583\/1678), which amounts to a mulitplier of 28\/31\/34\/37 ( 44\/47\/50\/53).","During the Skewer, Magnus is fully disabled.","Enemy heroes within 135 radius around Magnus get moved in front of him and dragged along.","Dragged heroes are fully disabled during the drag.","Dragged heroes land 200 range away in front of Magnus at the end of the charge.","Can charge through and drag enemies over impassable terrain.","Skewer first applies the slow debuff, then the damage.","Destroys trees within 200 radius during the charge, and 400 radius at the destination point.","Can also drag illusions and creep-heroes."],"mana":"80","elements":["Cannot be cast while rooted or leashed.","Partially pierces spell immunity."],"cooldown":"26\/24\/22\/20","name":"Skewer","description":["Cast Animation: 0.3+0.33","Cast Range: Global","Max Skewer Distance: 887\/982\/1077\/1172 ( 1393\/1488\/1583\/1678)","Skewer Radius: 135","Damage: 70\/140\/210\/280","Move Speed Slow: 25%\/30%\/35%\/40%","Attack Speed Slow: 25\/30\/35\/40","Slow Duration: 3.25"],"hot_key":"E","legacy_key":"D"},{"spell":"Magnus changes properties of matter, sucking all nearby enemies in front of him and stunning them with a powerful slam and dealing damage.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Instantly pulls all affected units 150 range in front of Magnus.","Reverse Polarity first applies the debuff, then the damage.","There is no limit of how many units can be affected.","Stuns Roshan but does not pull him.","The particle effects and a sound effect start playing at the beginning of the cast."],"mana":"200\/250\/300","elements":["Pierces spell immunity."],"cooldown":"130","name":"Reverse Polarity","description":["Cast Animation: 0.3+1.3","Radius: 410","Damage: 50\/125\/200","Stun Duration: 2.75\/3.25\/3.75 ( 3.75\/4.25\/4.75)"],"hot_key":"R","legacy_key":"V"}],"bio":"The master-smiths of Mt. Joerlak agree on only a single point: that the horn of a magnoceros is more precious than any alloy. And of all such horns, the largest and sharpest belongs to the beast they call Magnus. For half a generation, Magnus took easy sport goring hunters come to claim the treasures of his kin. Each time he would return to his cave with hooves and horns stained red, until his Matriarch urged him and all their kin to seek refuge to the north beyond the shadow of the mountain. But Magnus scoffed, having never failed to defend his people. The magnoceroi would stay, he decided, for a magnoceros does not believe in chance... nor does it ever change its mind. But when Mt. Joerlak erupted without warning, and half his kin perished in the fire and ash, Magnus changed his mind after all. The survivors pushed north, until they reached a blockade watched over by a hundred hunters armed with bow and steel. Magnus expected no less. He led his fiercest brothers and sisters in a charge against their enemies, and fought with a ferocity matched only by the fire-spewing mountain at his back. Meanwhile the magnoceros elders, mothers, and calves vanished into the drifts. The master-smiths are divided about what happened next. Some say Magnus reunited with his kin, while others claim he suffered mortal injuries and expired alongside the body of his Matriarch. Neither theory is correct. Magnus did vow to rejoin his kin...but only after seeking out those responsible for the eruption of Mt. Joerlak and watching them die upon his horn, for a magnoceros does not believe in chance.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","The strength talent effectively grants Magnus 240 health, 1.2 health regen, 0.96% magic resistance and 12 attack damage.","The armor talent does not benefit illusions."],"trivia":["In the transition to Dota 2, Magnus's race was changed from Magnataur to Magnoceros, most likely to avoid copyright issues with Blizzard, since the Magnataur are an existing race in the Warcraft universe.","\"Magnus\" means \"great\" in Latin. This was used as an honorific in certain esteemed Romans; the most famous being Gnaeus Pompey Magnus (Pompey the great), party with Caesar on two triumvirates. When Caesar refused to disband his army and enter Rome as a citizen, Pompey led the Roman's evacuation and was the main general to oppose Caesar, until his (Pompey's) death.","Magnus' lore was written by Greg Kasavin of Supergiant Games. In Greg's original draft, the Magnoceri were a dying race due to the males having the tendency of killing the females after mating, leading Magnus to go on a search for a new mate that could please him. Magnus still has many rivalry lines directed towards female heroes referencing that original draft.","Magnus is named after Gustav Magnus, a German physicist who discovered the Magnus effect, an effect in which a spinning ball\/cylinder curves away from its principle flight path. Reverse Polarity acts similarly in this regard, moving everyone around himself to a position in front of him."],"talents":["+1s Reverse Polarity Stun Duration:+20% Empower Damage\/Cleave","+500 Skewer Range:+10 Armor","+75 Shockwave Damage:+12 Strength","+200 Health:+25 Attack Speed"],"desc":"Magnus, the Magnoceros, is a monstrous melee strength hero who is usually played as a ganker, initiator, or semi-carry. His ability to battle multiple heroes at once gives him an excellent presence in team fights. In addition to his teamfight presence, he can buff allies or himself with bonus damage and cleave, capitalizing on his ability to group up multiple enemies. As a hero who possesses multiple area-of-effect abilities with a manageable mana cost, and a very powerful ultimate that serves as a great team fight initiation ability, Magnus is truly a force to be reckoned with."}