{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+60 к урону от Death Ward",
          "talentRight": "+1.2% к макс. лечению от Voodoo Restoration"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+15% к урону за срабатывание Maledict",
          "talentRight": "+100 к дальности атаки Death Ward"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+80 к радиусу Maledict",
          "talentRight": "+2 отскока у Paralyzing Cask"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+5 к броне",
          "talentRight": "+60 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d6\/Witch_Doctor_Paralyzing_Cask_1.mp3\/revision\/latest?cb=20191216030754",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Бочонок летит со скоростью 1000.",
        "Каждый бочонок отскакивает с интервалом в 0,3 секунды.",
        "Бочонок может отскочить на одно и то же существо несколько раз, но только при условии попадания в другое соседнее существо.",
        "Не отскакивает на невидимых, неуязвимых или спрятанных существ, но отскакивает на существ в тумане войны.",
        "Наносит до 150\/300\/500\/750 (TagTalent 225\/400\/625\/900) (100\/150\/200\/250 (TagTalent 150\/200\/250\/300) героям) урона одному существу (до уменьшений).",
        "Все отскоки наносят до 225\/500\/875\/1350 (TagTalent 375\/700\/1125\/1650) (150\/250\/350\/450 (TagTalent 250\/350\/450\/550) героям) единиц урона (до уменьшений).",
        "Бочонок сначала применяет дебафф, затем наносит урон.",
        "Иллюзии считаются за крипов, а Рошан и крипы-герои — за героев.",
        "Несколько бочонков от одного героя сбрасывают и делят оставшееся число отскоков для всех применений."
      ],
      "mana": "80\/100\/120140",
      "hotKey": "Q",
      "cooldown": "20\/18\/16\/14",
      "description": "Бросает бочонок с парализующим порошком, который отскакивает от противников, оглушая их и нанося им урон.",
      "spellName": "Paralyzing Cask",
      "params": [
        "Анимация применения: 0,35+0,37",
        "Дальность применения: 700",
        "Радиус отскока: 575",
        "Число отскоков: 2\/4\/6\/8 (TagTalent 4\/6\/8\/10)",
        "Урон героям: 50",
        "Урон крипам: 75\/100\/125\/150",
        "Длительность оглушения героев: 1",
        "Длительность оглушения крипов: 5",
        "Не может напрямую выбрать врага с иммунитетом к заклинаниям. Может отскакивать от врагов с иммунитетом. Не оглушает и не пытается нанести урон врагам с иммунитетом.",
        "Блокируется как основной, так и вторичной целью. Блокируется при попадании. Не прекращает отскоки, если бочонок был заблокирован."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Жарвакко перемалывает кости павших союзников и противников, пополняя порошком свой арсенал чар и алхимии."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Witch_Doctor_Voodoo_Restoration_1.mp3\/revision\/latest?cb=20191216030758",
      "effects": [
        "Способность Переключаемая \/ Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "При переключении Voodoo Restoration не прерывает произносимые заклинания.",
        "Обезвреживание Witch Doctor не отключает Voodoo Restoration, но оглушенный герой переключать способность не может.",
        "Лечит 5,28\/7,92\/10,56\/13,2 (TagTalent +0.396% от максимального здоровья) единиц здоровья и расходует 2,64\/3,96\/5,28\/6,6 единиц маны с интервалом в 0,33 секунды спустя 0,33 секунды после активации.",
        "Лечение предоставлено в виде ауры. Эффект после лечения задерживается на 0,5 сек. То есть после деактивации заклинание лечит и расходует ману еще в течение 0,5 секунды. Если у Witch Doctor недостаточно маны для следующих срабатываний, то заклинание само деактивируется. При этом задержавшийся бафф продолжит лечение даже без маны, срабатывая еще 2 раза. Не распространяется на неуязвимых или спрятанных существ.",
        "То есть после деактивации заклинание лечит и расходует ману еще в течение 0,5 секунды.",
        "Если у Witch Doctor недостаточно маны для следующих срабатываний, то заклинание само деактивируется.",
        "При этом задержавшийся бафф продолжит лечение даже без маны, срабатывая еще 2 раза.",
        "Не распространяется на неуязвимых или спрятанных существ."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Герой направляет свои чары на лечение ближайших союзников, теряя ману каждую секунду действия этой способности.",
      "spellName": "Voodoo Restoration",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 500",
        "Маны в секунду: 8\/12\/16\/20",
        "Базовое лечение в секунду: 16\/24\/32\/40",
        "Макс. здоровья в лечение в секунду: 0% (TagTalent 1.2%)",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Фокусы Жарвакко могут не только околдовать врагов, но и исцелить от различных болезней."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Witch_Doctor_Maledict_1.mp3\/revision\/latest?cb=20191216030750",
      "effects": [
        "Способность Направленная на область",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Проверяет значение текущего здоровья задетых существ 4 раза, первый - когда проклятье применяется, а остальные - каждые 4 сек. в течение длительности способности.",
        "Урон основан на разнице между текущим здоровьем героя и его здоровьме на момент применения проклятья. То есть, чем больше разница между текущим здоровьем и здоровьем после получения дебаффа, тем больше урона проклятье нанесет. И наоборот, чем больше здоровья стало, после применения заклинания, тем меньше урона нанесёт способность. Любое лечение уменьшает урон. Также не имеет значения, как именно существо потеряло здоровье, так как способность учитывает значение здоровья, а не количество полученного урона. Здесь указано, сколько урона повторно наносится проклятьем из-за потери здоровья в зависимости от того, сколько здоровья было сожжено на каждом уровне способности (до уменьшений): 0–3,9 секунды: 48%\/72%\/97%\/121% (TagTalent 94%\/118%\/142%\/166%) 3,9–7,9 секунды: 32%\/48%\/64%\/80% (TagTalent 62%\/78%\/94%\/111%) 7,9–11,9 секунды: 16%\/24%\/32%\/40% (TagTalent 31%\/39%\/47%\/55%)",
        "То есть, чем больше разница между текущим здоровьем и здоровьем после получения дебаффа, тем больше урона проклятье нанесет.",
        "И наоборот, чем больше здоровья стало, после применения заклинания, тем меньше урона нанесёт способность. Любое лечение уменьшает урон.",
        "Также не имеет значения, как именно существо потеряло здоровье, так как способность учитывает значение здоровья, а не количество полученного урона.",
        "Здесь указано, сколько урона повторно наносится проклятьем из-за потери здоровья в зависимости от того, сколько здоровья было сожжено на каждом уровне способности (до уменьшений): 0–3,9 секунды: 48%\/72%\/97%\/121% (TagTalent 94%\/118%\/142%\/166%) 3,9–7,9 секунды: 32%\/48%\/64%\/80% (TagTalent 62%\/78%\/94%\/111%) 7,9–11,9 секунды: 16%\/24%\/32%\/40% (TagTalent 31%\/39%\/47%\/55%)",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 12 раз.",
        "Вместе с сжиганием здоровья способность срабатывает 15 раз.",
        "Сжигание здоровья происходит за 0,1 секунды до каждого 4-го тика, поэтому здоровье сжигается после 3-го, 7-го и 11-го тика.",
        "Без остальных источников потери здоровья или лечения Maledict наносит до 109,9\/249,6\/423,1\/634,8 (TagTalent 138,9\/312,8\/526,1\/783,5) урона по существу (до уменьшений).",
        "Дебафф можно наложить на иллюзии и крипов-героев.",
        "Не действует на неуязвимых и спрятанных существ. Действует на невидимых существ."
      ],
      "mana": "105\/110\/115\/120",
      "hotKey": "E",
      "cooldown": "30\/26\/22\/18",
      "description": "Накладывает сглаз на всех вражеских героев в небольшой области, после чего они получают урон каждую секунду. Помимо этого, каждые 4 секунды им наносится периодический урон, зависящий от количества здоровья, потерянного с наложения сглаза.",
      "spellName": "Maledict",
      "params": [
        "Анимация применения: 0,35+0",
        "Дальность применения: 575",
        "Радиус: 180 (TagTalent 260)",
        "Урон в секунду: 7\/14\/21\/28",
        "Урон от потерянного здоровья: 16%\/24%\/32%\/40% (TagTalent 31%\/39%\/47%\/55%)",
        "Интервал нанесения урона: 4",
        "Длительность проклятья: 12",
        "Не может применить дебафф к существам с иммунитетом к заклинаниям. Если дебафф уже действует, но существо получило иммунитет, то способность перестает наносить базовый периодический урон. Урон от потерянного здоровья проходит сквозь иммунитет."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Некоторые заклятия вуду способны заставить врага жалеть о том, что он повстречался с Жарвакко."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Witch_Doctor_Voodoo_Switcheroo.mp3\/revision\/latest?cb=20210103153444",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Вражеских героев"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Превращает Witch Doctor в неуязвимое и спрятанное существо и запрещает герою действовать всю длительность.",
        "Death Ward призывается на местоположение Witch Doctor; характеристики варда равны текущему уровню Death Ward. Если Death Ward не изучена, то при применении Voodoo Switcheroo ничего не сделает. На вард распространяются все примечания, относящиеся к Death Ward.",
        "Если Death Ward не изучена, то при применении Voodoo Switcheroo ничего не сделает.",
        "На вард распространяются все примечания, относящиеся к Death Ward.",
        "Voodoo Switcheroo нельзя досрочно прервать.",
        "Скорость атаки Death Ward уменьшается на 30.",
        "С базовой скоростью атаки в 0.22 и замедлением в 30 вард атакует до 7 раз.",
        "С текущим базовым временем атаки и уроном вард наносит до 270,45\/429,55\/588,64 (TagTalent 461,36\/620,45\/779,55) урона в секунду одному существу.",
        "Наносит до 595\/945\/1295 (TagTalent 1015\/1365\/1715) урона одному существу (до уменьшений)."
      ],
      "mana": "250",
      "hotKey": "D",
      "cooldown": "70",
      "description": "Превращает героя в тотем от способности Death Ward, имеющий –30 к скорости атаки. Действует 2 секунды. Во время действия способности герой скрыт.",
      "spellName": "Voodoo Switcheroo",
      "params": [
        "Анимация применения: 0,1+0,73",
        "Снижение скорости атаки Death Ward: 30",
        "Длительность: 2"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Witch_Doctor_Death_Ward.mp3\/revision\/latest?cb=20191216030749",
      "effects": [
        "Способность Направленная на точку \/ Произносимая",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Death Ward автоматически атакует вражеских героев в пределах своей дальности атаки, используя стандартные правила автоатаки. При призыве вард атакует ближайшего вражеского героя. После этого он следует стандартным правилам автоатаки. Можно вручную выбрать цель для атаки варда через нажатие правой клавиши мышки в пределах дальности атаки. Отдача приказа на атаку при выбранных Witch Doctor и вард не прервет произнесение. Также можно остановить атаку варда, отдав команду \"стоп\" (работает только при отключенной в настройках автоатаке).",
        "При призыве вард атакует ближайшего вражеского героя. После этого он следует стандартным правилам автоатаки.",
        "Можно вручную выбрать цель для атаки варда через нажатие правой клавиши мышки в пределах дальности атаки.",
        "Отдача приказа на атаку при выбранных Witch Doctor и вард не прервет произнесение.",
        "Также можно остановить атаку варда, отдав команду \"стоп\" (работает только при отключенной в настройках автоатаке).",
        "Вард атакует и отскакивает только от героев (включая клонов Meepo и Tempest Double) и иллюзий.",
        "Источником урона является сам Death Ward; эффекты, реагирующие на урон, будут срабатывать на вард, а не на самого Witch Doctor (например, Blade Mail).",
        "Основную атаку можно избежать и она может промахнуться, предотвращая отскоки снаряда. Не промахивается при улучшении Aghanim's Scepter.",
        "При этом после первого отскока вард больше не будет промахиваться, но его атаки все ещё можно избежать. При избегании атака продолжает считаться отскоком и может отскочить обратно к увернувшемуся герою.",
        "При избегании атака продолжает считаться отскоком и может отскочить обратно к увернувшемуся герою.",
        "Атаки не отскакивают от невидимых существ и существ в тумане войны. Один снаряд никогда не сможет отскочить дважды от одного и того же существа.",
        "С базовым временем атаки, равному 0.22, вард атакует до 37 раз.",
        "С текущим базовым временем атаки и уроном вард наносит до 386,36\/613,64\/840,91 (TagTalent 659,09\/886,36\/1113,64) урона в секунду по одному герою.",
        "Наносит до 3145\/4995\/6845 (TagTalent 5365\/7215\/9065) урона одному герою (до уменьшений).",
        "Урон Death Ward не снижается блокировкой урона.",
        "Дает наземный обзор в радиусе 1200\/800 единиц в месте размещения в течении 5-ти секунд после завершения произнесения."
      ],
      "mana": "200",
      "hotKey": "R",
      "cooldown": "80",
      "description": "Призывает смертоносный тотем, атакующий вражеских героев. Действует 8 секунд.",
      "spellName": "Death Ward",
      "params": [
        "Анимация применения: 0,35+0",
        "Дальность применения: 600",
        "Максимальная длительность произнесения: 8",
        "Радиус отскока: 0 (TagAghanim 650)",
        "Атаки тотема отскакивают между вражескими героями и не могут промахнуться.",
        "Дарует новую способность: Voodoo Switcheroo."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Жарвакко исполняет ритуальный танец, приходящий к пережившим его в страшных снах."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.4,
    "attrAgility": 13.0
  },
  "description": "Witch Doctor — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, каждая из которых - активная. Первой способностью, Paralyzing Cask, герой бросает бочонок с парализующим порошком, который отскакивает от противников, оглушая их и нанося им урон. Урон и оглушение для крипов и героев - разные. Второй способностью, Voodoo Restoration, Witch Doctor создаёт небольшую область, исцеляющую всех союзников. Третья способность, Maledict, проклинает вражеских героев в небольшой области, после чего они получают урон каждую секунду. Помимо этого, им наносится периодический урон, зависящий от количества здоровья, потерянного с момента наложения проклятия. Ультимативная способность Death Ward, призывает Death Ward, атакующий вражеских героев вокруг. Улучшение с Aghanim's Scepter даёт Death Ward эффект True Strike, позволяющий не промахиваться и не позволять персонажам избежать атаки Death Ward, а также позволяет его атакам отскакивать от вражеских героев.",
  "history": "Вдали ковыляет тонкий силуэт — конечности его свисают, а походка виляет: это колдун неустанно ищет на поле боя слабину, где его умения принесут больше всего пользы и вреда. Неясно, уродилось ли это существо таким или его что-то обезобразило, но никто не усомнится в силах, что держит в себе такой неопрятный каркас. Громко стуча посохом оземь, Жарвакко вышагивает по полю боя, пользуясь внушительным арсеналом амулетов, проклятий, заговоров и заклинаний. В его теле — магические знания, добытые за несколько жизненных циклов на взгорье острова Арктура, и теперь колдун мастерски разит этими знаниями противников. Жарвакко может стать и лучшим другом, и злейшим врагом: он исцеляет союзников, но сеет смерть для тех, кто встаёт у него на пути.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+60 к урону от Death Ward",
      "talentRight": "+1.2% к макс. лечению от Voodoo Restoration"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+15% к урону за срабатывание Maledict",
      "talentRight": "+100 к дальности атаки Death Ward"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+80 к радиусу Maledict",
      "talentRight": "+2 отскока у Paralyzing Cask"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+5 к броне",
      "talentRight": "+60 к урону"
    }
  ]
}