{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Быстрые атаки по жертвам Dream Coil",
          "talentRight": "+250 к радиусу и дальности Waning Rift"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−4 сек. перезарядки Illusory Orb",
          "talentRight": "−6 сек. перезарядки Waning Rift"
        },
        {
          "talentLvl": "15",
          "talentLeft": "Атака от Phase Shift",
          "talentRight": "+12% к урону от заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0,75 сек. безмолвия от Waning Rift",
          "talentRight": "+25 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Puck_Illusory_Orb_1.mp3\/revision\/latest?cb=20191216021933",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Illusory Orb движется со скоростью 651.",
        "Для преодоления максимального расстояния шару нужно 3 секунды; он поражает существ на расстоянии до 2175 единиц (складывается из макс. расстояния и радиуса урона).",
        "Illusory Orb излучает красный импульс спустя 2,5 секунды полета, предупреждая, что он вот-вот достигнет максимальной дальности полёта.",
        "Illusory Orb оставляет за собой летающий обзор радиусом 450. Обзор задерживается на 5 секунд.",
        "Поднятие уровня способности автоматически улучшает Ethereal Jaunt."
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10 (TagTalent 9\/8\/7\/6)",
      "description": "Герой выпускает волшебный шар, летящий по прямой и поражающий всех противников на своем пути. К шару можно переместиться в любой момент, применив способность Ethereal Jaunt.",
      "spellName": "Illusory Orb",
      "params": [
        "Анимация применения: 0,1+0,27",
        "Дальность применения: 3000",
        "Макс. расстояние: 1950",
        "Радиус урона: 225",
        "Урон: 75\/150\/225\/300"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Волшебный дракончик обожает вводить врагов в замешательство, внезапно исчезая и появляясь то тут, то там."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0c\/Puck_Waning_Rift.mp3\/revision\/latest?cb=20191216021936",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически выберет точку в 25 единицах перед Puck.",
        "Waning Rift не позволяет избежать снарядов.",
        "Вопреки визуальным эффектам безмолвие и урон применяются мгновенно по всей области. Сначала наносит урон, затем применяет дебафф безмолвия, отталкивает и раскрывает невидимость.",
        "Сначала наносит урон, затем применяет дебафф безмолвия, отталкивает и раскрывает невидимость.",
        "С Aghanim's Shard отталкивает существ со скоростью 625. Дальность отталкивания всегда равна 250, даже если существо удалено от центра применения. Во время отталкивания существа не обезврежены. Они могут поворачиваться, атаковать и использовать предметы. Применение предметов не прерывается. Может заталкивать существ на непроходимую территорию. Деревья, с которыми существо столкнулось, разрушаются. Применяет тот же дебафф к врагам, что и Dust of Appearance; при этом он не замедляет их. Несколько раскрывающих дебаффов не складываются, но обновляют длительность. Дебафф также применяется к вардам.",
        "Во время отталкивания существа не обезврежены. Они могут поворачиваться, атаковать и использовать предметы. Применение предметов не прерывается.",
        "Может заталкивать существ на непроходимую территорию. Деревья, с которыми существо столкнулось, разрушаются.",
        "Применяет тот же дебафф к врагам, что и Dust of Appearance; при этом он не замедляет их.",
        "Несколько раскрывающих дебаффов не складываются, но обновляют длительность.",
        "Дебафф также применяется к вардам."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "W",
      "cooldown": "19\/17\/15\/13 (TagTalent 13\/11\/9\/7)",
      "description": "Герой перемещается в указанную точку и выпускает облако волшебной пыльцы, нанося врагам вокруг урон и запрещая им применять способности.",
      "spellName": "Waning Rift",
      "params": [
        "Анимация применения: 0,1+0,27",
        "Дальность применения: Глобальная",
        "Макс. дальность: 300 (TagTalent 550)",
        "Радиус: 400 (TagTalent 650)",
        "Урон: 70\/130\/190\/250 (TagTalent 140\/200\/260\/320)",
        "Длительность безмолвия: 2\/2,5\/3\/3,5 (TagTalent 2,75\/3,25\/3,75\/4,25)",
        "Дальность отталкивания: 250",
        "Длительность отталкивания: 0,4",
        "Длительность раскрытия невидимости: 5",
        "Способность наносит на 70 урона больше и отталкивает врагов на расстояние в 250 за 0,4 секунды (TagTalentне прерывает заклинания). На 5 секунд раскрывает невидимых врагов и варды в области действия.",
        "Безмолвие остается, если дебафф был применен до невосприимчивости к магии и не был развеян.",
        "Под действуем оцепенения или привязки способность всегда применяется в текущей локации, игнорируя выбранную область."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Дракончик с шаловливой улыбкой распыляет зачарованный порошок, нарушающий магический поток."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ac\/Puck_Phase_Shift.mp3\/revision\/latest?cb=20191216021935",
      "effects": [
        "Способность Ненаправленная \/ Произносимая",
        "Действует на Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "При применении Phase Shift позволяет избегать снарядов.",
        "Предметы, которые не прерывают произносимые заклинания (например, Shadow Blade или Shiva's Guard), отменяют Phase Shift.",
        "Делает заклинателя неуязвимым и спрятанным, пока действует Phase Shift. Не применяет к заклинателю сквозное состояние, поэтому во время действия Phase Shift герой продолжает блокировать путь для других существ. Бафф задерживается на один тик сервера после прерывания или завершения произнесения, позволяя использовать предметы в неуязвимом и скрытом состоянии.",
        "Не применяет к заклинателю сквозное состояние, поэтому во время действия Phase Shift герой продолжает блокировать путь для других существ.",
        "Бафф задерживается на один тик сервера после прерывания или завершения произнесения, позволяя использовать предметы в неуязвимом и скрытом состоянии.",
        "Талант «Атака от Phase Shift» позволяет Puck при применении совершать мгновенные атаки по всем врагам в пределах дальности атаки. На атаки могут сработать любой модификатор атаки и эффекты, срабатывающие при ударе. Они могут промахнуться, но игнорируют обезоруживание. Под атаку попадают все видимые и доступные для атаки враги. В цели входят постройки, но не варды и Undying Zombie. Конечный радиус мгновенных атак с учетом базовой дальности атаки Puck равен 750. Радиус можно увеличить бонусами к дальности атаки, но не бонусами к дальности применения.",
        "На атаки могут сработать любой модификатор атаки и эффекты, срабатывающие при ударе. Они могут промахнуться, но игнорируют обезоруживание.",
        "Под атаку попадают все видимые и доступные для атаки враги. В цели входят постройки, но не варды и Undying Zombie.",
        "Конечный радиус мгновенных атак с учетом базовой дальности атаки Puck равен 750.",
        "Радиус можно увеличить бонусами к дальности атаки, но не бонусами к дальности применения."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой ненадолго смещается в другое измерение, защищающее от любых атак.",
      "spellName": "Phase Shift",
      "params": [
        "Анимация применения: 0+0",
        "Макс. время применения: 0,75\/1,5\/2,25\/3,25",
        "Доп. дальность мгновенной атаки: 200"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Ехидно усмехнувшись, волшебный дракончик со вспышкой возвращается в иное, родное для себя измерение."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/43\/Puck_Ethereal_Jaunt.mp3\/revision\/latest?cb=20191216021932",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Эта способность автоматически улучшается при повышении уровня Illusory Orb.",
        "Эта способность неактивна до использования Illusory Orb и она вновь деактивируется после исчезновения шара. В режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний Ethereal Jaunt заменяет Illusory Orb во время полета шара, а не занимает отдельный слот.",
        "В режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний Ethereal Jaunt заменяет Illusory Orb во время полета шара, а не занимает отдельный слот.",
        "С помощью Ethereal Jaunt можно избегать снарядов от способностей.",
        "С двумя летящими шарами способность остается активной до окончания действия первого шара. При этом Puck телепортируется к последнему созданному шару.",
        "При этом Puck телепортируется к последнему созданному шару."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Перемещает героя к шару от способности Illusory Orb.",
      "spellName": "Ethereal Jaunt",
      "params": [
        "Анимация применения: 0+0,53"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Puck_Dream_Coil_1.mp3\/revision\/latest?cb=20200822132902",
      "effects": [
        "Способность Направленная на область",
        "Действует на Вражеских героев",
        "Урон Магический Мгновенная атака"
      ],
      "notes": [
        "Каждый вражеский герой (включая иллюзии, клонов и крипов-героев) в радиусе 375 от точки применения получает привязку, запрещающую использование определенных заклинаний для перемещения. Вход в область действия после применения не даст никакого эффекта. Способность не привязывает врагов после применения.",
        "Вход в область действия после применения не даст никакого эффекта. Способность не привязывает врагов после применения.",
        "Если связанные герои передвинутся более чем на 600 от места связки, то связка разорвётся, а враги оглушатся и получат урон. Неважно, насколько далеко или быстро переместился герой, оглушение и урон всегда сработают Разрыв привязки сначала наносит урон, затем применяет дебафф.",
        "Неважно, насколько далеко или быстро переместился герой, оглушение и урон всегда сработают",
        "Разрыв привязки сначала наносит урон, затем применяет дебафф.",
        "Dream Coil связывает невидимых существ или существ в тумане войны, но видимая линия обрыва отображает лишь их последнее местоположение.",
        "Несколько применений Dream Coil складываются, поскольку каждое применение накладывает отдельный дебафф.",
        "Талант на быстрые атаки по жертвам Dream Coil позволяет Puck совершать мгновенные атаки по всем привязанным врагам, пока он остается в радиусе 775 от выбранной области. На эти атаки могут сработать любые модификаторы атаки и эффекты, срабатывающие при атаке. Они могут промахнуться, но игнорируют обезоруживание. Атаки совершаются даже если заклинатель обезврежен или спрятан. То есть Puck атакует даже во время Phase Shift. Атакует с интервалом в 0,75 сек. спустя 0,75 сек. после применения, срабатывая до 8 (TagTalent 10) раз. Поскольку быстрые атаки связаны с эффектом связки, то её разрыв или развеивание с помощью невосприимчивости к магии останавливают атаки. Несколько применений Dream Coil позволяет заклинателю атаковать несколько раз с интервалом, установленным при получении дебаффа.",
        "На эти атаки могут сработать любые модификаторы атаки и эффекты, срабатывающие при атаке. Они могут промахнуться, но игнорируют обезоруживание.",
        "Атаки совершаются даже если заклинатель обезврежен или спрятан. То есть Puck атакует даже во время Phase Shift.",
        "Атакует с интервалом в 0,75 сек. спустя 0,75 сек. после применения, срабатывая до 8 (TagTalent 10) раз.",
        "Поскольку быстрые атаки связаны с эффектом связки, то её разрыв или развеивание с помощью невосприимчивости к магии останавливают атаки.",
        "Несколько применений Dream Coil позволяет заклинателю атаковать несколько раз с интервалом, установленным при получении дебаффа."
      ],
      "mana": "100\/150\/200",
      "hotKey": "R",
      "cooldown": "80\/75\/70",
      "description": "Цепляет вражеских героев нестабильной магической спиралью, оглушая их на 6 сек., накладывая на них эффект привязки и нанося им урон. Если враг отойдёт слишком далеко от центра спирали, то она разорвётся, оглушив его и нанеся дополнительный урон.",
      "spellName": "Dream Coil",
      "params": [
        "Анимация применения: 0,1+0,27",
        "Дальность применения: 750",
        "Радиус спирали: 375",
        "Радиус разрыва: 600",
        "Начальный урон: 125\/200\/275",
        "Урон при разрыве: 200\/300\/400 (TagAghanim 300\/450\/600)",
        "Длительность первоначального оглушения: 0,5",
        "Длительность оглушения при разрыве: 1,8\/2,4\/3 (TagAghanim 2\/3\/4)",
        "Длительность связки: 6 (TagAghanim 8)",
        "Радиус быстрых атак: 775",
        "Интервал быстрых атак: 0,75",
        "Увеличивает урон от разрыва спирали и увеличивает время её действия. Оглушение от разрыва спирали проходит сквозь невосприимчивость к магии.",
        "Не связывает существ с невосприимчивостью к магии. Получение невосприимчивости развеивает привязку. С Aghanim's Scepter привязывает врагов сквозь невосприимичивость, но не оглушает и не позволяет развеять привязку. Разрыв привязки оглушает и наносит урон сквозь невосприимичивость."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Волшебный дракончик сеет смятение в рядах врагов, заставляя их осознать свою смертность."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 17.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 2.5,
    "attrAgility": 22.0
  },
  "description": "Puck — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первой способностью, Illusory Orb, Puck запускает волшебный шар, летящий по прямой и поражающий всех противников на своем пути. Puck может в любой момент телепортироваться к шару с помощью Ethereal Jaunt. Вторая способность, Waning Rift, распыляет волшебный порошок, наносящий урон и запрещающий использовать магию всем врагам поблизости. Третья способность, Phase Shift, позволяет герою уйти в другое измерение, что делает героя неуязвимым для противников. Ультимативная способность, Dream Coil, создает магическую спираль, цепляющуюся за вражеских героев и кратковременно оглушающую их. Если противник растягивает спираль, отойдя слишком далеко, то она рвется, оглушая его и нанося ему урон. Улучшение с Aghanim's Scepter увеличивает урон от разрыва спирали, увеличивает время ее действия, а оглушение от разрыва спирали проходит сквозь невосприимчивость к заклинаниям.",
  "history": "На первый взгляд это существо обладает озорным, ребяческим характером, но за ним скрывается чужеродная личность. Волшебные дракончики живут целую вечность, и пусть эта особь провела в юном облике несчётные тысячелетия, она всё равно будет считаться молодой, даже когда города нашего времени обратятся в пыль. Посему побуждения этого создания непостижимы, а игривость может скрывать его тёмное начало. Истинная природа дракончика — в его бесконечных проказах.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Быстрые атаки по жертвам Dream Coil",
      "talentRight": "+250 к радиусу и дальности Waning Rift"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−4 сек. перезарядки Illusory Orb",
      "talentRight": "−6 сек. перезарядки Waning Rift"
    },
    {
      "talentLvl": "15",
      "talentLeft": "Атака от Phase Shift",
      "talentRight": "+12% к урону от заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0,75 сек. безмолвия от Waning Rift",
      "talentRight": "+25 к урону"
    }
  ]
}