{
  "abilities": [
    {
      "effects": [
        "Default Cast Range: 250",
        "Buffer Cast Range: 500",
        "Health Regen Bonus: 50",
        "Duration: 8"
      ],
      "notes": [
        "Double clicking the item casts it on self.",
        "If the target is more than 500 range away, the caster moves to the target until it is within 250 range before casting. If a cast order is given on a target which is within 500 range already, the caster does not need to move closer and casts it right away.",
        "Can only target heroes (including illusions) and creep-heroes.",
        "The owner does not have to face the target to use this on it.",
        "Successive casts on the same target do not stack, but refresh the duration instead.",
        "Can regenerate up to 400 health over its full duration.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan dispels the effect. Does not get dispelled by damage flagged as HP Removal."
      ],
      "elements": [
        "Ability Target Unit",
        "Affects Allied Heroes"
      ],
      "name": "Salve",
      "description": "Grants 50 health regeneration to the target for 8 seconds. If the unit is attacked by an enemy hero, tower, or Roshan, the effect is lost."
    }
  ],
  "cost": "110",
  "description": "A magical salve that can quickly mend even the deepest of wounds.",
  "trivia": [
    "Prior to patch 6.54 in the original DotA, Healing Salve was known as \"Flask of Sapphire Water\". The name, along with its icon, was likely changed to help visually differentiate it from Bottle."
  ],
  "tips": [
    "The Healing Salve's effect gets dispelled upon taking player-based damage, so do not use it in the middle of combat. In some situations however, it may be worth it to use it in combat. Even one second long of it healing can be enough to prevent deaths in some situations.",
    "Depending on the hero, in the early-game, one Salve can refill about 50%-100% of a hero's health. It spares the hero from having to move back to the team's fountain to heal back up, which can take a lot of time, or cost the player a Town Portal Scroll. Unlike Tangos, Healing Salves are more suited for a defensive lane. If the lane carry tries to farm and takes some damage, he can fall back for a short time to quickly heal back up and continue farming."
  ],
  "attrs": [
    "Active Salve",
    "Charges 1",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "Stacks with itself in the inventory, there is no stack limit. The sell value adapts based on the number of instances in a stack.",
    "Healing Salves are not shareable, however, they can be cast on allies."
  ]
}