{"abilities":[{"effects":["Number of Warriors: 1","Number of Archers: 1","Duration: 60"],"notes":["Interrupts the user's channeling spells upon cast.","The summons always spawn in front of the caster.","Recasting this with the same Necronomicon replaces the summons from the previous cast, no matter under whose control they are. However, recasting it with a second Necronomicon (or the same with a different level) creates two new summons.","The summons cannot be targeted by Helm of the Dominator, and the warrior cannot be targeted by Hand of Midas. However, they can be targeted by other converting or instantly killing spells like Holy Persuasion or Devour.","All 3 levels of Necronomicon share cooldown.","Does not share cooldown with Book of the Dead"],"elements":["Ability No Target"],"description":"Summons a Warrior and an Archer to fight for you for 60 seconds. Warrior: Burns mana every hit, and deals magical damage to whoever kills it. Gains True Sight at level 3. Archer: Has a passive movement and attack speed aura. Gains Purge at level 3."}],"contains":["Sage's_Mask","Sage's_Mask","Belt_of_Strength","Recipe"],"cost":"2250","description":"Summon","trivia":["This item is based on the Necronomicon, a fictional grimoire created by horror author H. P. Lovecraft. The summoning ability of the item is similar to the original book's role in summoning the ancient cosmic Old Ones in Lovecraft's Cthulhu Mythos.","The coloration of the two units may be a reference to the Japanese tradition of Oni being either Red or Blue, with the Red Oni traditionally more aggressive, emotional, and extroverted, while Blue Oni are traditionally more serene, intellectual, and introverted."],"further":["Necronomicon_2"],"attrs":["Level 5","Duration 60","Health 700\/800\/900","Health regeneration 5","Armor 4","Magic resistance 40%","Status resistance 0%","Attack damage 55\/85\/115‒65\/95\/125","Acquisition range 600","Attack range 450\/500\/550","Base attack time 1","Attack animation 0.7+0.3","Projectile speed 900","Movement speed 330\/360\/390","Follow range 100","Turn rate 0.5","Collision size 8","Vision range 1300\/1400\/1500 • 800 (G)","Bounty 100\/150\/200","Experience 100\/150\/200","Abilities Purge Archer Aura"],"info":["For strength heroes, it grants 200\/300\/400 health, 1\/1.5\/2 health regen, 0.8%\/1.2%\/1.6% magic resistance, 3\/3.5\/4 mana regen and 10\/15\/20 attack damage.","For agility heroes, it grants 200\/300\/400 health, 1\/1.5\/2 health regen, 0.8%\/1.2%\/1.6% magic resistance and 3\/3.5\/4 mana regen.","For intelligence heroes, it grants 200\/300\/400 health, 1\/1.5\/2 health regen, 0.8%\/1.2%\/1.6% magic resistance and 3\/3.5\/4 mana regen.","Upgrading the item improves its stats and strengthens the summons from Demonic Summoning. Can be upgraded twice.","The total gold cost for each level is 2250\/3550\/4850."]}