{
  "abilities": [],
  "additionalInformation": [
    "Для героев силы, даёт 320 здоровья, 1,6 регенерации здоровья, 2,67 брони, 32 скорости атаки, 10% скорости передвижения и 16 урона от атаки.",
    "Для героев ловкости, даёт 320 здоровья, 1,6 регенерации здоровья, 2,67 брони, 32 скорости атаки, 10% скорости передвижения и 16 урона от атаки.",
    "Для героев интеллекта, даёт 320 здоровья, 1,6 регенерации здоровья, 2,67 брони, 32 скорости атаки и 10% скорости передвижения.",
    "Сопротивление магии сочетается по закону убывающей полезности с другими источниками сопротивления магии.",
    "Усиление восстановления здоровья аддитивно сочетается с другими источниками усиления восстановления здоровья.",
    "Усиление вампиризма аддитивно сочетается с другими источниками усиления вампиризма.",
    "Дополнительная скорость передвижения от предметов основанных на Yasha ( Yasha, Sange and Yasha, Yasha and Kaya, Manta Style) не сочетаются."
  ],
  "cost": "4100",
  "lore": null,
  "consistFrom": [
    "Yasha",
    "Sange"
  ],
  "boughtFrom": "Артефакты",
  "name": "Sange and Yasha",
  "description": "Sange и Yasha, собранные вместе и ведомые лунным светом, становятся грозным оружием.",
  "trivia": [
    "Название предмета является данью уважения к серии игр Phantasy Star. Phantasy Star Online.",
    "Night Stalker обращается к Sange and Yasha как к \"сестрам\"[1], как и Ember Spirit.",
    "Набор косметических предметов для Riki — Sange and Yasha — основан на предмете Sange and Yasha и использует их названия."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+16 к силе",
    "+16 к ловкости",
    "+25% к сопротивлению эффектам",
    "+10% к скорости передвижения",
    "+16 к скорости атаки",
    "+30% к усилению регенерации здоровья",
    "+30% к усилению вампиризма"
  ],
  "tips": [
    "Этот предмет прилично усиливает героя в середине игры. Большое количество атрибутов и дополнительная скорость передвижения делает предмет отличным выбором для большинства героев роли Фарм ближнего боя.",
    "Если Sange and Yasha остался в стадии поздней игры, его можно разобрать и использовать Yasha в Manta Style, а Sange — в Heaven's Halberd. Активные способности этих предметов невероятно полезны, а дополнительные атрибуты также хороши."
  ]
}