{
  "abilities": [
    {
      "spell": "Герой впрыскивает во врага свои яйца и наносит ему урон. Если жертва умрёт, находясь под действием этой способности, из её трупа появятся несколько паучков.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд Spawn Spiderlings летит со скоростью 1200.",
        "Spawn Spiderlings сначала применяет дебафф, затем наносит урон.",
        "Паучки появляются только в случае смерти выбранного юнита под действием дебаффа.",
        "Не имеет значения, кто убьет цель, паучки все равно появятся.",
        "Количество появившихся паучков зависит от уровня способности на момент их появления, а не применения.",
        "Паучки получают все бонусы от Spin Web.",
        "Выбор таланта, увеличивающего урон, мгновенно обновит все летящие снаряды Spawn Spiderling.",
        "Выбор таланта на дополнительное здоровье или урон не усилит уже призванных паучков Broodmother."
      ],
      "mana": "100",
      "elements": [
        "Можно избежать.",
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "11\/10\/9\/8 ( 8.8\/8\/7.2\/6.4)",
      "name": "Spawn Spiderlings",
      "description": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: 700",
        "Урон: 70\/140\/210\/280 ( 145\/215\/285\/355)",
        "Количество пауков: 1\/2\/3\/4",
        "Длительность эффекта: 2",
        "Длительность паучков: 60"
      ],
      "hot_key": "Q",
      "legacy_key": "W"
    },
    {
      "spell": "Герой сплетает паутину, в которой он быстрее передвигается и восстанавливает здоровье, а также может проходить через препятствия. Заряды способности восстанавливаются 45 секунд. Новую паутину можно сплести из любой точки карты, если она будет касаться старой. Длительность существования паутин не ограничена по времени, и их можно уничтожить вручную. Если превысить максимальное число паутин, то самая старая из них исчезнет.",
      "effects": [
        "Способность Направленная на область",
        "Действует на Себя"
      ],
      "notes": [
        "Имеет глобальную дальность применения, если край новой паутины соприкасается с уже созданной паутиной.",
        "При первом изучении способности Broodmother сразу получает 2 заряда паутины. Последующее повышение уровня способности не дает готовых зарядов.",
        "Действует только на Broodmother и её паучков и паучонков. Не действует на других подконтрольных юнитов.",
        "Дополнительная скорость передвижения, беспрепятственное движение и регенерация здоровья активируется сразу же при вхождении в паутину.",
        "Восстанавливает здоровье в виде регенерации, восстанавливая 0.3\/0.5\/0.7\/0.9 здоровья с интервалом в 0,1 секунды, что в сумме дает 3\/5\/7\/9 в секунду.",
        "Может восстановить до 180\/300\/420\/540 единиц здоровья в минуту.",
        "Эффекты даются в виде ауры. Её бафф задерживается на 0.2 секунды.",
        "Паутина видна на миникарте Broodmother и ее союзникам. Паутина не дает обзора, но может быть выделена в тумане войны.",
        "Не действует на неуязвимых или спрятанных юнитов.",
        "Выбранную паутину можно разрушить с помощью Destroy Spin Web.",
        "Паутина не блокирует лагери нейтральных крипов."
      ],
      "mana": "50",
      "elements": [
        "Не может использоваться иллюзиями.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Spin Web",
      "description": [
        "Анимация применения: 0,4+0,4",
        "Дальность применения: 1000",
        "Радиус паутины: 900",
        "Макс. зарядов паутин: 2\/4\/6\/8",
        "Доп. восстановление здоровья: 3\/5\/7\/9",
        "Доп. скорость передвижения: 25%\/40%\/55%\/70%",
        "Длительность задержки ауры: 0.2",
        "Число зарядов: 2\/4\/6\/8",
        "Время восстановления заряда: 45 ( 36)"
      ],
      "hot_key": "W",
      "legacy_key": "B"
    },
    {
      "spell": "Яд героя ослабляет врагов, замедляя их и заставляя промахиваться при атаках.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Успешные атаки с Incapacitating Bite по одной и той же цели не складываются, но обновляют время действия дебаффа.",
        "Атаки сначала применяют дебафф, затем наносят свой урон.",
        "Не действует на строения, варды и союзных юнитов, атакованных Broodmother."
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Incapacitating Bite",
      "description": [
        "Замедление скорости передвижения: 16%\/26%\/36%\/46%",
        "Шанс промаха: 30%\/40%\/50%\/60%",
        "Длительность: 2"
      ],
      "hot_key": "E",
      "legacy_key": "P"
    },
    {
      "spell": "Неистовая жажда питательных соков увеличивает урон героя и наделяет его вампиризмом.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Дополнительный урон считается за обычный бонус к атаке.",
        "Складывается аддитивно с другими источниками вампиризма.",
        "Вампиризм не действует на строения, но лечит при атаке вардов и союзных юнитов."
      ],
      "mana": "100",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "45 ( 36)",
      "name": "Insatiable Hunger",
      "description": [
        "Анимация применения: 0,2+0,5",
        "Дополнительный урон: 60\/100\/140 ( 120\/160\/200)",
        "Вампиризм: 60%\/100%\/140% ( 120%\/160%\/200%)",
        "Длительность: 14"
      ],
      "hot_key": "R",
      "legacy_key": "T"
    },
    {
      "spell": "Уничтожает выбранную паутину.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Это заклинание от самой паутины, что позволяет Broodmother уничтожать паутины индивидуально вместо уничтожения старой паутины.",
        "Паутины не оставляют трупов."
      ],
      "mana": "0",
      "elements": [],
      "cooldown": "0",
      "name": "Destroy Spin Web",
      "description": [
        "Анимация применения: 0+0"
      ],
      "hot_key": "Q",
      "legacy_key": "D"
    },
    {
      "spell": "Отравляет и замедляет врагов каждым ударом.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Удачные атаки с Poison Sting по одной и той же цели не складываются, но обновляют длительность дебаффа.",
        "Атаки сначала наносят урон, затем применяют дебафф.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 2 (6) раз.",
        "Может нанести до 16 (48) единиц урона (до учета снижений).",
        "Действует на союзников и варды, но не на строения.",
        "Считает крипов-героев за крипов.",
        "Паучата не получают эту способность."
      ],
      "mana": "0",
      "elements": [
        "Не отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Poison Sting",
      "description": [
        "Урон в секунду: 8",
        "Замедление передвижения: 8%",
        "Длительность на героях: 2",
        "Длительность на крипах: 6"
      ]
    },
    {
      "spell": "Заражает жертву атаками. Если она умрет, из трупа появятся несколько паучат.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Успешные атаки с Spawn Spiderite по одной и той же цели не складываются, но обновляют длительность дебаффа.",
        "Атаки сначала наносят урон, затем применяют дебафф.",
        "Паучата появятся только когда атакованый юнит умер под действием дебаффа.",
        "Не важно, кто убил цель — паучата появятся в любом случае.",
        "Не действует на варды и строения, но действует на союзников.",
        "Паучата полностью попадают под влияние Spin Web",
        "Паучата не получают эту способность."
      ],
      "mana": "0",
      "elements": [
        "Не отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Spawn Spiderite",
      "description": [
        "Кол-во паучат: 1",
        "Длительность эффекта: 2",
        "Длительность паучат: 60"
      ]
    }
  ],
  "bio": "Веками чёрная паучиха Арахния скрывалась в пещерах, уходящих вглубь земли вплоть до лавы горы Пиротес, рождая миллионы маленьких паучков и отправляя их наверх за добычей. Позднее Фолопталис, визирь жадности, построил на склоне этого потухшего вулкана свой зиккурат, прекрасно зная, что любые грабители, которые ищут его богатства, сначала должны пройти через паучьи проходы. Тысячелетиями паучиха своими мохнатыми лапками затягивала в свою паутину жалких воришек, смелых рыцарей и благородных юношей — очень вкусных и полезных для маленьких паучков. Но, устав от вторжений, она назначила Фолопталису встречу; когда он пришел, матерь затянула его в свою паутину и отложила до банкета в честь дня рождения. К несчастью, отсутствие хозяина зиккурата вдохновило охотников за наживой на новые свершения. Когда один из них случайно раздавил маленького паучка, паучиха вышла из себя. Она вышла на поверхность и объявила, что намерена избавить мир от каждого, кто может посягнуть на её спокойствие, вплоть до последнего героя, если будет нужно, пока не обеспечит полную безопасность своим драгоценнейшим паучатам.",
  "talentsTips": [
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
    "Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."
  ],
  "trivia": [
    "В биографии героя из оригинальной DotA было заявлено, что Broodmother была влюблена в Anub'arak ( Nyx Assassin). В Dota 2 уже не упоминается этот факт.",
    "Альтернативное имя героя было — Broodmama.",
    "Одна из редких фраз \"Играть Some pig!\" является отсылкой к книге Паутинка Шарлотты."
  ],
  "talents": [
    "+350 к здоровью паучков:+60 к макс. урону\/лечению от Insatiable Hunger",
    "+50 к скорости атаки:+20 к урону паучков",
    "+35% к получаемому опыту:-20% перезарядки способностей",
    "+200 к здоровью:+75 к урону Spawn Spiderlings"
  ],
  "tips": [
    "Из сапог неплохим выбором будет Phase Boots. Они делают погоню и побег легче за счёт увеличения скорости передвижения, позволяют проходить сквозь юнитов (особенно сквозь большоие скопления паучков), а также проще добивать крипов и героев.",
    "Также можно купить Sange and Yasha, который даст большую скорость атаки и передвижения, даст немного урона и выживаемости, а также даст огромное замедление, что вкупе с пассивной способностью позволит держать врагов практически на месте. Также данный артефакт позволит бороться с теми героями, которые быстро и просто убивают паучков (даже если мы имеем Orchid Malevolence), в одиночку.",
    "Данный герой способен выстоять в одиночку практически на любой линии. Используйте паутину, чтобы увеличивать выживаемость на линии."
  ],
  "desc": "Broodmother — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Первая способность, Spawn Spiderlings, инфицирует врага, нанося урон. Если цель умрет, находясь под действием этого заклинания, из ее трупа появится несколько паучков. Вторая способность, Spin Web, плетет паутину, в которой Broodmother, быстрее передвигается, проходит через препятствия и быстрее восстанавливает здоровье. Пассивная способность, Incapacitating Bite, замедляет врагов и увеличивая шанс, что жертва промахнется при атаке. Ультимативная способность, Insatiable Hunger, увеличивает урон Broodmother и наделяет ее вампиризмом."
}