{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Усиление лечения: 14%"
      ],
      "notes": [
        "Даёт лишь усиление лечения. Не даёт усиление восстановления здоровья, усиление вампиризма или усиление вампиризма заклинаний. Восстановление здоровья, вампиризм и усиление вампиризма заклинаний даются самим предметом отдельно, а не этой способностью.",
        "Восстановление здоровья, вампиризм и усиление вампиризма заклинаний даются самим предметом отдельно, а не этой способностью.",
        "Greater Healing усиливает исходящее лечение, но не входящее лечение. Это значит, что она усиливает любое лечение от владельца, не зависимо от того кто является его целью. И наоборот, другие источники лечения, применяемые к владельцу, не усиливаются.",
        "Это значит, что она усиливает любое лечение от владельца, не зависимо от того кто является его целью.",
        "И наоборот, другие источники лечения, применяемые к владельцу, не усиливаются.",
        "Сочетается с другими источниками усиления лечения по закону убывающей полезности."
      ],
      "mana": null,
      "abilityName": "Greater Healing",
      "cooldown": null,
      "description": "Увеличивает на 14% количество здоровья, получаемом при его восстановлении, лечении и вампиризме.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Аддитивно сочетается с другими источниками вампиризма.",
    "Сочетается с другими источниками усиления восстановления здоровья по закону убывающей полезности.",
    "Сочетается с другими источниками усиления вампиризма по закону убывающей полезности.",
    "Сочетается с другими источниками усиления вампиризма заклинаний по закону убывающей полезности."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Paladin Sword",
  "description": "Клинок с печатями, которым пользовался легендарный Брат Йолс из Гаусры. Оружие покинуло свои ножны в день, когда произошло весьма спорное недопонимание.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}