{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Mirror_Shield_Echo_Shield.mp3\/revision\/latest?cb=20191227195712",
      "effects": [],
      "notes": [
        "The Spell Block has the following priorities: Echo Shield ➤ Transfer Spellblock ➤ Spellblock Does not trigger when Counterspell is active.",
        "Echo Shield ➤ Transfer Spellblock ➤ Spellblock",
        "Does not trigger when Counterspell is active.",
        "The Spell Reflection has the following priorities:",
        "Counterspell ➤ Echo Shell ➤ Echo Shield ➤ Planar Pocket If either of the higher priority Spell Reflection sources is active on the wielder, Echo Shield does not trigger at all, including its spell block. This means when affected by Lotus Orb, Linken's Sphere triggers instead.",
        "If either of the higher priority Spell Reflection sources is active on the wielder, Echo Shield does not trigger at all, including its spell block.",
        "This means when affected by Lotus Orb, Linken's Sphere triggers instead.",
        "Does not stack with Soulbind, preventing it from duplicating spells onto a chained ally."
      ],
      "mana": null,
      "abilityName": "Echo Shield",
      "cooldown": null,
      "description": "Block and reflect most targeted spells back to their caster once every 8 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "200 health and 1 health regeneration.",
    "120 mana and 0.5 mana regeneration.",
    "10 attack speed and 1.67 main armor.",
    "10 main attack damage to all \/ \/ heroes."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Mirror Shield",
  "description": "The shield that long ago robbed the old one of his first memories.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Best shared to your hard carries as the Echo Shield will block and reflect any single-targeted spell back to its caster, preventing them from getting disabled easily.",
    "Because Mirror Shield has a higher priority than Linken's Sphere and both items will simultaneously block a spell, it is wise to give this item to an another allied hero instead.",
    "You can also share a Mirror Shield to your supports if they have a powerful teamfight spell especially those that are channeled."
  ]
}