{
  "abilities": [
    {
      "notes": [
        "Применяет сон ко всем затронутым существам, предотвращая их действия до пробуждения",
        "Если существо попадет под два типа урона от способности, то оно получит 150\/200\/250\/300 ( 300\/350\/400\/450) единиц урона (до уменьшений)",
        "Способность сначала наносит урон, затем применяет дебафф",
        "Когда астральный дух призван, способность синхронно используется духом и героем\n Сон срабатывает на всех существ как вокруг героя, так и вокруг духа\n Даже если существо попало под действие способности героя и духа одновременно, длительность сна не увеличится\n Если дух не призван, оба типа урона — магический и физический — будут нанесены вокруг Elder Titan",
        "Астральный дух обладает идентичной способностью (с отличающейся иконкой)\n Приказав духу использовать ее, Elder Titan так же использует Echo Stomp\n Если указать духу использовать способность пока Elder Titan оглушен, способность начнет перезарядку, однако ничего не произойдет\n Тем не менее, использовав Echo Stomp после оглушения, дух выполнит свою часть заклинания, даже если она все еще перезаряжается\n Если Elder Titan применяет Echo Stomp, пока астральный дух остановлен (например,  Chronosphere), дух все равно выполнит свою часть заклинания\n Echo Stomp нельзя отменить приказом \"стоп\" духу\n Во время анимации способности дух не может действовать",
        "Затронутые существа не могут проснутся в первые 0,2 секунды сна\n После базового оглушения существа смогут проснутся только после получения 50\/100\/150\/200 суммарного урона\n Начинает сразу учитывать урон во время базового оглушения\n Учитывает урон после всех сопротивлений\n То есть если существо получит достаточно урона во время 0,2, то мгновенно пробудится во время получения следующего урона\n Не учитывает урон от астрального духа, но учитывает урон от  Earth Splitter",
        "Усыпленные существа никогда не будут целью для автоатаки вне зависимости от настроек\n Для их атаки необходимо напрямую отдать команду\n То есть этих существ никогда не будут атаковать линейные и нейтральные крипы, башни и фонтан\n Игроки все равно могут атаковать усыпленных юнитов",
        "При успешном произнесении и включении автоприменения, герой телепортируется на текущее место  астрального духа\n После телепортации Elder Titan смотрит в ту же сторону, куда он смотрел до неё\n Если дух не был призван, то ничего не произойдёт\n После телепортации героя, дух мгновенно вернётся к Elder Titan, дав ему все бонусы\n Нельзя избежать снаряды с помощью телепортации"
      ],
      "item_behaviour": [],
      "description": "Герой и его дух сотрясают землю, нанося окружающим противникам урон и усыпляя их. Герой наносит этой способностью физический урон, а его дух — магический.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0",
        "Время применения: 1,3",
        "Радиус: 500",
        "Физический урон: 75\/100\/125\/150 ( 150\/175\/200\/225)",
        "Магический урон: 75\/100\/125\/150 ( 150\/175\/200\/225)",
        "Урон для пробуждения: 50\/100\/150\/200 ( 500\/550\/600\/650)",
        "Длительность базового оглушения: 0,2",
        "Длительность сна: 2\/3\/4\/5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Elder_Titan_Echo_Stomp.mp3\/revision\/latest?cb=20191216013436",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": "14\/13\/12\/11 (TagTalent 12\/11\/10\/9)",
      "aghanim": null,
      "name": "Echo Stomp",
      "cooldown": "100",
      "legacy_key": "T",
      "story": "Мощь созидания до сих пор отражается эхом в топоте титана."
    },
    {
      "notes": [
        "Дух находится под контролем Elder Titan до конца действия способности",
        "Остальные игроки не могут выбрать духа, поэтому его нельзя использовать для блокировки выбора существ за ним",
        "Духа нельзя задержать никаким заклинанием (в том числе  Meat Hook,  Sacred Arrow,  Hookshot)",
        "Скорость передвижения духа приравнивается к скорости Elder Titan на момент призыва и не адаптируется при её изменении",
        "С изученным  Natural Order вокруг духа всегда распространяется дебафф ауры, усиливая наносимый духом урон",
        "Астральный дух сливается с Elder Titan как только оказывается в 100 единицах от него, позволяя возвращать духа, просто пройдя сквозь него",
        "Использование  Echo Stomp при возвращении духа заставит его остановится и начать произнесение его части заклинания\n Дух продолжит возвращение при завершении применения",
        "При возврате духа Elder Titan получает бафф Ancestral Spirit Buff, которые дает герою урон, скорость передвижении и броню на основе числа задетых врагов\n Не учитывает иллюзии и курьеров\n Считает крипов-героев за крипов\n Если при повторном применении бафф еще действует, то при возвращении духа он обновит длительность, но не значение\n Если дух не задел врагов, то бафф не применяется, а уже действующий — не обновляет длительность\n Талант 25-го уровня также дает баффу эффект иммунитета к заклинаниям\n Не применяет к герою развеивание",
        "Астральный дух не блокирует лагеря нейтральных крипов",
        "С <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter Elder Titan получает иммунитет к заклинаниям и базовое развеивание при возвращении духа\n За каждого пораженного героя (включая клонов, исключая иллюзии и крипов-героев) длительность иммунитета увеличивается на 2 секунды\n Если на героя действует бафф от предыдущего применения, то длительность увеличивается на 2 за каждого вражеского героя, задетого новым применением",
        "Чтобы узнать, сколько урона, скорости передвижения и брони даст Astral Spirit после поражения определенного числа героев, посмотрите таблицу ниже"
      ],
      "item_behaviour": [],
      "description": "Герой призывает астрального духа, который наносит урон каждому врагу, сквозь которого проходит. При воссоединении с владельцем дух дарует ему дополнительные урон, броню и скорость передвижения за каждого задетого им врага. Духом можно управлять, и он обладает способностями Echo Stomp, Return Spirit и Natural Order.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения:  1200",
        "Радиус урона: 275",
        "Урон: 50",
        "Доп\n скорость передвижения за крипа: 1,5%",
        "Доп\n скорость передвижения за героя: 5%\/6%\/7%\/8% ( 7%\/8%\/9%\/10%)",
        "Граница доп\n скорости передвижения: 40%",
        "Доп\n урон за крипа: 3\/7\/11\/15",
        "Доп\n урон за героя: 14\/36\/58\/80 ( 39\/61\/83\/105)",
        "Доп\n броня за крипа: 0,5",
        "Доп\n броня за героя: 1,5\/3\/4,5\/6",
        "Длительность духа: 10",
        "Длительность эффекта: 10",
        "Длительность иммунитета к заклинаниям за героя:  2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c0\/Elder_Titan_Astral_Spirit_1.mp3\/revision\/latest?cb=20191216013444",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "23\/21\/19\/17",
      "aghanim": null,
      "name": "Astral Spirit",
      "cooldown": "80\/90\/100\/110",
      "legacy_key": "C",
      "story": "Так же, как и четыре предвечных, титан существует во всех мирах одновременно, и может призывать другие свои сущности, когда ему это нужно."
    },
    {
      "notes": [
        "Заменяет  Astral Spirit до объединения духа с Elder Titan или до смерти героя",
        "* При использовании Return Astral Spirit не прерывает произносимые способности Elder Titan",
        "У астрального духа также есть эта способность",
        "Сам Elder Titan не может использовать способность при обезвреживании, но астральный дух при обезвреженном герое — может",
        "Дух возвращается со скоростью 900"
      ],
      "item_behaviour": [],
      "description": "Возвращает духа обратно к герою.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Скорость при возвращении: 900"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/03\/Elder_Titan_Return_Astral_Spirit_1.mp3\/revision\/latest?cb=20191216013438",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Return Astral Spirit",
      "cooldown": "0",
      "legacy_key": "C",
      "story": null
    },
    {
      "notes": [
        "Снижение брони действует только на базовую броню и броню, даваемую ловкостью\n Дополнительная броня игнорируется\n Адаптирует снижение брони с интервалом в 0,5 секунды, базируясь на том, как меняется броня затронутых существ от потери или получения ловкости",
        "Снижение сопротивления магии действует только на базовое сопротивление\n Дополнительное сопротивление магии игнорируется\n То есть для героев с базовым сопротивлением магии в 25% способность снижает его на 10%\/15%\/20%\/25% — до 15%\/10%\/5%\/0%",
        "С призванным астральным духом уменьшение сопротивления магии распространяется вокруг духа, а снижение брони — вокруг Elder Titan\n Если дух не призван или способность Astral Spirit не изучена, то оба дебаффа распространяются вокруг Elder Titan",
        "Дебафф от ауры задерживается на 1 секунду\n При этом, если способность Astral Spirit была использована, то враги вокруг Elder Titan, не попавшие в радиус действия ауры духа, мгновенно потеряют дебафф уменьшения сопротивления магии",
        "Не действует на древних крипов"
      ],
      "item_behaviour": [],
      "description": "Приводит сущность врагов к начальному небытию, снижая их базовый показатель брони и сопротивление магическому урону. Броню уменьшает сам герой, а сопротивление магии — дух от способности Astral Spirit.",
      "hot_key": "E",
      "params": [
        "Радиус: 350 ( 450)",
        "Снижение базовой брони: 40%\/60%\/80%\/100%",
        "Снижение базового сопротивления магии: 40%\/60%\/80%\/100%",
        "Длительность задержки ауры: 1"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Врагов"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Natural Order",
      "cooldown": null,
      "legacy_key": "N",
      "story": "Титан приводит все к первородному состоянию."
    },
    {
      "notes": [
        "Не прерывает прерываемые способности Elder Titan при применении",
        "Эта способность скрыта, пока  астральный дух не используется",
        "При применении отдаёт обычный приказ на передвижение астрального духа",
        "Нельзя использовать, если Elder Titan обезврежен"
      ],
      "item_behaviour": [],
      "description": "Направляет духа в указанную точку.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: Глобальная"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Астрального духа"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Move Astral Spirit",
      "cooldown": "0",
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Наносит 15%\/20%\/25% от максимального здоровья задетых существ в виде магического урона, а затем 15%\/20%\/25% — в виде физического",
        "Трещина распространяется со скоростью 910",
        "Может поражать существ на расстоянии до 2415 единиц (складывается из длины трещины и радиуса)",
        "Также задевает существ на расстоянии 315 единиц позади места применения заклинания Elder Titan",
        "Визуально трещина достигает длины до 2600 единиц, но эффекты заканчивают действие на 2100 единицах",
        "Earth Splitter сначала применяет дебафф, затем наносит урон",
        "Затронутые существа мгновенно притягиваются к трещине в момент взрыва",
        "Притягивание прерывает произносимые заклинания",
        "При притягивании отдается команда \"стоп\", поэтому текущие приказы на движение, атаки и использование заклинаний отменяются",
        "Не действует на древних крипов"
      ],
      "item_behaviour": [],
      "description": "Герой раскалывает землю, посылая трещину в выбранном направлении. Через 3 секунды разлом схлопывается, замедляя всех попавшихся врагов и нанося урон, зависящий от их максимального показателя здоровья. Половина урона будет физической, половина — магической.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,4+0,73",
        "Дальность применения:  2400",
        "Задержка: 2,7182",
        "Ширина трещины: 315",
        "Длина трещины: 2100",
        "Урон от макс\n здоровья: 30%\/40%\/50%",
        "Замедление скорости передвижения: 30%\/40%\/50%",
        "Длительность замедления: 3\/4\/5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9e\/Elder_Titan_Earth_Splitter.mp3\/revision\/latest?cb=20191216013435",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": "100 (TagTalent 40)",
      "aghanim": null,
      "name": "Earth Splitter",
      "cooldown": "125\/175\/225",
      "legacy_key": "E",
      "story": "Титан разрывает порознь всё, что когда-то создал."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 26.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.8,
    "attrAgility": 16.0
  },
  "description": "Наносит врагам урон и выводит их из строя своим астральным духом Даже величайшие из титанов допускают ошибки в своей работе. Пойманный в ловушку своего собственного несовершенного творения Прародитель вечно стремится восстановить разломленные миры. Его Natural Order сводит все до основания, разрушая любые защитные силы, которыми покрыты его враги. Из скрытого мира Elder Titan призывает свой Astral Spirit, направляя эту призрачную форму сквозь тела и мимо защитных сил. После расположения, Echo Stomp раздастся как из Titan, так и из духа, выбивая бессознательность у всех на своем пути. Поле боя треснуло под кузнечным молотом Titan, и проблеск творения рассматривается как Earth Splitter разрывая землю на части. За то, что совершает Прародитель, он также имеет право и разрушать.  Инициация Контроль Быстрый урон Стойкость ★★☆",
  "history": "Вы наверняка задавались вопросом: как этот мир стал таким, какой он есть? Почему среди всех миров именно этот такой странной формы, населен такими разношерстными пестрыми существами со столь богатой культурой и историей? «Ответ, — раздается шепот, — знают Титаны». Они существовали с начала времен, и если даже не созерцали создание сущего, то с рождения помнят его эхо. Клейменные самыми ранними силами вселенной, они не желали ничего иного, кроме как продолжать созидание самостоятельно. Они решили изменять материю по своему разумению: ударяя, нагревая, изгибая и разрывая ее. И когда материя стала для них слишком простой, они стали изменять сами себя и друг друга. Обостряя ум и перековывая дух, они достигли небывалого могущества. Новой целью стала переделка самой реальности. Но тут они иногда совершали ошибки — большие амбиции давали знать свое. Тот, кого зовут Elder Titan, был большим выдумщиком, постигшим искусство творения. Оттачивая мастерство, он случайно поколебал то, что уже было нельзя восстановить. Он провалился в изломанный мир — осколок собственной души. Там, среди зубчатых разломов, треснутых равнин, и других осколков, провалившихся через трещины раннего мира, он и пребывал. Именно поэтому мир, каким мы его знаем, напоминает горстку выживших в кораблекрушении, про которое все давно забыли. Забыли все, кроме одного, который винит себя. Целую вечность он безустанно ищет способ всё исправить, собрать воедино свою расколотую душу, часть которой может быть в каждом из нас. Именно его мы зовем Elder Titan."
}