{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9c\/Gleipnir_Eternal_Chains_1.mp3\/revision\/latest?cb=20210120233503",
      "effects": [
        "Дальность применения: 1100",
        "Радиус: 450",
        "Урон: 220",
        "Длительность: 2"
      ],
      "notes": [
        "Запускает снаряды во врагов в радиусе 450. Может выбрать в цель невидимых существ и существ в тумане войны.",
        "Может выбрать в цель невидимых существ и существ в тумане войны.",
        "Снаряд летит со скоростью 1900.",
        "Применяет к цели оцепенение, препятствуя её движению и использованию определенных заклинаний для передвижения. Раскрывает невидимость затронутых целей.",
        "Раскрывает невидимость затронутых целей.",
        "Eternal Chains сперва применяет урон, затем дебафф.",
        "Повторные применения на цель не складываются, но обновляют длительность.",
        "Делит перезарядку с предметами, основанными на Rod of Atos."
      ],
      "mana": "200",
      "abilityName": "Eternal Chains",
      "cooldown": "18",
      "description": "Накладывает оцепенение на всех врагов в радиусе 450 и наносит им 220 урона. Длительность: 2 сек.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Gleipnir_Chain_Lightning_1.mp3\/revision\/latest?cb=20210120233458",
      "effects": [
        "Шанс срабатывания: 30%",
        "Дальность отскоков: 650",
        "Число отскоков: 4",
        "Интервал отскока: 0,25",
        "Урон: 160"
      ],
      "notes": [
        "При наличии нескольки предметов со способностью Chain Lightning, работать будет лишь тот, что дольше находится в инвентаре.",
        "Молнии отскакивают с интервалом в 0,25 сек., так что поражение 4 целей занимает 0,75 сек. Все отскоки вместе могут нанести до 640 урона (до учёта сопротивлений). Против одной цели, Chain Lightning в среднем наносит 48 магического урона с каждой атакой.",
        "Все отскоки вместе могут нанести до 640 урона (до учёта сопротивлений).",
        "Против одной цели, Chain Lightning в среднем наносит 48 магического урона с каждой атакой.",
        "Chain Lightning может сработать пока отскакивает предыдущая Chain Lightning. Никогда не поражает одно и то же существо более чем один раз за срабатывание. Атаки, спровоцировавшие Chain Lightning не могут промахнуться. Может срабатывать на невидимых существ или существ в тумане войны, но не отскакивает к этим существам. Не срабатывает, если атаковавший мёртв. Тем не менее, может сработать если мертва цель. Chain Lightning использует псевдослучайное распределение.",
        "Никогда не поражает одно и то же существо более чем один раз за срабатывание.",
        "Атаки, спровоцировавшие Chain Lightning не могут промахнуться.",
        "Может срабатывать на невидимых существ или существ в тумане войны, но не отскакивает к этим существам.",
        "Не срабатывает, если атаковавший мёртв. Тем не менее, может сработать если мертва цель.",
        "Chain Lightning использует псевдослучайное распределение.",
        "modifier_maelstrom_chain это скрытый бафф, необходимый для отскакивания молнии.",
        "Chain Lightning использует систему изменённой перезарядки. Она не отображается на иконке предмета при срабатывании, и не подвержена действию манипуляции перезарядкой."
      ],
      "mana": null,
      "abilityName": "Chain Lightning",
      "cooldown": null,
      "description": "Каждая атака с вероятностью в 30% может создать разряд цепной молнии, которая 4 раз перескочит между случайными врагами в радиусе 650, нанося каждому по 160 магического урона. От атаки с цепной молнией нельзя уклониться.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "280 здоровья и 1,4 восстановления здоровья.",
    "288 маны и 1,2 восстановления маны.",
    "14 скорости атаки и 2,33 основной брони.",
    "14 \/ 14 \/ 24 основного урона от атаки всем \/ \/ героям соответственно."
  ],
  "cost": "6150",
  "lore": null,
  "consistFrom": [
    "Maelstrom",
    "Rod of Atos",
    "Recipe"
  ],
  "name": "Gleipnir",
  "description": "Оковы, созданные невозможным способом, чтобы сдержать древнее зло.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}