{"abilities":[{"spell":"Hurls a bolt of lightning that leaps through nearby enemy units.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The lightning bounces in 0.25 second intervals, so hitting all targets takes 1\/1.5\/2\/3.5 seconds.","Does not bounce on invisible units or units in the Fog of War.","Can never hit the same unit twice per cast.","All bounces together can deal up to 350\/665\/1080\/2175 ( 1125\/1750\/2475\/4500) damage (before reductions).","The Arc Lightning buff is a hidden buff required for the lightning to jump."],"mana":"80","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"1.6 ( 1.36)","name":"Arc Lightning","description":["Cast Animation: 0.2+0.63","Cast Range: 850 ( 1125)","Bounce Distance: 500","Number of Bounces: 5\/7\/9\/15","Bounce Interval: 0.25","Damage: 70\/95\/120\/145 ( 225\/250\/275\/300)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Calls down a bolt of lightning to strike an enemy unit, causing damage and a mini-stun. When cast, Lightning Bolt briefly provides unobstructed vision and True Sight around the target in a 750 radius. Can be cast on the ground, affecting the closest enemy hero in 375 range.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["When cast on the ground with no heroes within 375 radius, it still provides the 750 range flying vision and True Sight. Provides the True Sight first, so that invisible heroes still take damage.","The lightning first applies the damage, then the debuff.","When targeting a unit, vision and True Sight are provided at its position upon cast. The vision is stationary, it does not follow the unit. However, When the ground is targeted but the bolt hits a hero, the vision is centered on the targeted point, not the found hero.","The flying vision and True Sight last for 4.5 seconds. The True Sight is provided by an aura, and its debuff lingers for 0.5 seconds.","Searches for enemy heroes, illusions and creep-heroes when targeting ground. Whichever is the closest gets hit.","When targeting the ground, it can hit an enemy hero up to 1075\/1125\/1175\/1225 ( 1350\/1400\/1450\/1500) range away (cast range + search radius).","In order to hit a non-hero unit, it must be directly targeted.","Plays some lightning particles and a sound effect during the cast time, which are visible and audible to everyone."],"mana":"90\/105\/120\/135","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"6 ( 5.1)","name":"Lightning Bolt","description":["Cast Animation: 0.4+0.43","Cast Range: 700\/750\/800\/850 ( 975\/1025\/1075\/1125)","Hero Search Radius: 375","Vision & True Sight Radius: 750","Damage: 125\/200\/275\/350","Stun Duration: 0.2 ( 0.7)","Vision & True Sight Duration: 4.5","True Sight Aura Linger Duration: 0.5"],"hot_key":"W","legacy_key":"G"},{"spell":"Zeus shocks all nearby enemy units whenever he casts a spell, causing damage proportional to their current health.","effects":["Ability Passive","Affects Enemies","Damage Magical (HP Removal)"],"notes":["The damage from Static Field is flagged as HP Removal, so it does not trigger any on-damage effects.","Applies its damage before the triggering spell's damage is applied.","Static Field does not trigger on active item abilities.","Affects invisible units and units in the Fog of War.","Does not affect Roshan.","This is how many casts are required to bring units from full health below a certain health percentage with Static Field alone (before reductions): 75% Health: 8\/5\/4\/3 casts ( 6\/4\/3\/3 casts) 50% Health: 17\/12\/9\/7 casts ( 13\/9\/7\/6 casts) 25% Health: 34\/23\/17\/14 casts ( 25\/18\/14\/12 casts) 5% Health: 74\/49\/36\/29 casts ( 53\/39\/31\/25 casts)"],"mana":"0","elements":["Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Static Field","description":["Radius: 1200","Current Health as Damage: 4%\/6%\/8%\/10% ( 5.5%\/7.5%\/9.5%\/11.5%)"],"hot_key":"E","legacy_key":"F"},{"spell":"Strikes all enemy heroes with a bolt of lightning, no matter where they may be. Thundergod's Wrath also provides True Sight around each hero struck. If an enemy hero is invisible, it takes no damage, but the True Sight is still created at that hero's location.","effects":["Ability No Target","Affects Enemy Heroes","Damage Magical"],"notes":["Provides 500 range flying vision and 900 range True Sight around each struck hero.","Does not provide any vision around invulnerable or hidden heroes, but does around invisible heroes.","The flying vision and True Sight last for 3 seconds. The True Sight is provided by an aura, and its debuff lingers for 0.5 seconds.","Thundergod's Wrath first applies the damage on every hero (if possible), and then applies the vision around every enemy hero. This means it cannot damage invisible units, unless they are already revealed by another source of True Sight.","Hitting all 5 enemy heroes collectively deals 1125\/1625\/2125 damage (before reductions).","Does hit Tempest Doubles. Does not hit other clones or illusions.","Plays a visual and sound effects during the cast time, which is visible and audible to everyone.","The sound upon cast is global. Enemies can hear it when they have vision over Zeus. Else they can only hear the local hit sound.","Shifts the lighting of the whole map for a split second as another indicator of it being cast."],"mana":"225\/325\/450","elements":["Partially pierces spell immunity."],"cooldown":"90 ( 76.5)","name":"Thundergod's Wrath","description":["Cast Animation: 0.4+0.43","Effect Radius: Global","Vision Radius: 500","True Sight Radius: 900","Damage: 225\/325\/425","Vision & True Sight Duration: 3","True Sight Aura Linger Duration: 0.5"],"hot_key":"R","legacy_key":"W"},{"spell":"Creates a storm cloud anywhere on the map that automatically casts Lightning Bolt on nearby enemies.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Requires Aghanim's Scepter to be unlocked.","Casts regular Lightning Bolts on the closest valid enemy target, based on Lightning Bolt's current level. This means it also applies the mini-stun and provides vision and True Sight around the target. It also means that the Nimbus does nothing if Lightning Bolt is not learned.","The damage source is the Nimbus itself, meaning certain on-damage effects react on the Nimbus rather than on Zeus (e.g. Blade Mail). This also means that any outgoing damage amplification or damage reduction do not affect the Nimbus' bolt damage either.","Starts striking immediately upon cast if an enemy is within the area.","Also strikes immediately when the last strike was longer than an interval ago and an enemy enters the area.","Can strike up to 16 times over its full duration, considering default strike interval.","Does not require vision over the targets. The Nimbus can strike invisible units and units inside the Fog of War.","Always strikes the closest valid target. There are no priorities. Cannot target wards or buildings.","The visual effects on the ground which mark the area of effect are visible to everyone."],"mana":"275","elements":["Does not pierce spell immunity."],"cooldown":"35 ( 29.75)","name":"Nimbus","description":["Cast Animation: 0.2+0.64","Cast Range: Global","Radius: 450","Melee Hero Attacks to Destroy: 4","Ranged Hero Attacks to Destroy: 8","Non-Hero Attacks to Destroy: 16","Lightning Bolt Interval: 2.25","Duration: 35"],"hot_key":"D","legacy_key":"T"}],"bio":"Lord of Heaven, father of gods, Zeus treats all the Heroes as if they are his rambunctious, rebellious children. After being caught unnumbered times in the midst of trysts with countless mortal women, his divine wife finally gave him an ultimatum: 'If you love mortals so much, go and become one. If you can prove yourself faithful, then return to me as my immortal husband. Otherwise, go and die among your creatures.' Zeus found her logic (and her magic) irrefutable, and agreed to her plan. He has been on his best behavior ever since, being somewhat fonder of immortality than he is of mortals. But to prove himself worthy of his eternal spouse, he must continue to pursue victory on the field of battle.","talentsTips":["The cast range talent does not affect the jump distance of Arc Lightning.","The armor talent does not benefit illusions.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."],"trivia":["Zeus was the first hero to be implemented in Dota 2.","Zeus is based on the Greek mythological god of the same name.","As suggested by the game's files, Zeus's name was, at one time, Zuus. The possible reason being that 'Zuus' is the correct pronunciation of his name 'Zeus'.","Zeus' alternate\/fun name in DotA was \"Merlini\", a tribute to a professional DotA player.","Zeus' title in DotA was \"Lord of Olympus\".","Static Field is most likely a reference to the Sorceress' skill of the same name in Diablo II. In Diablo II, the spell also reduced enemies' HP by a percentage within a short radius.","Zeus' respawn line \"To err is human. To respawn, divine.\" is a reference to Alexander Pope, whose quote is \"To err is human; to forgive, divine.\"","Zeus' rival line towards Chen, \"Keep in mind, Chen, Godliness is next to deadliness.\" is a reference to an old and well-known saying \"Cleanliness is next to godliness.\"","Zeus' rare response line, \"In Me I Trust.\", refers to the national motto of the United States – \"In God We Trust\".","Zeus' rare response line, \"If I didn't exist, it would be necessary to invent me.\", is a reference to a similar quote by french philosopher Voltaire: \"If God did not exist, it would be necessary to invent him.\""],"talents":["+155 Arc Lightning Damage:+275 Cast Range","+0.5s Lightning Bolt Ministun:15% Cooldown Reduction","+1.5% Static Field Damage:+30 Movement Speed","+25% XP Gain:+6 Armor"],"desc":"Zeus, the Lord of Heaven, is a ranged intelligence hero who functions almost solely as a nuker. He is usually played as a semi-carry ganker type hero, who instead of utilizing disables, focuses solely on delivering tremendous amounts of magical damage to his foes. With the high cast range, and ease of use and low cooldown on his spells, he is able to deliver the most superb and consistent magical damage of any hero in the game. Arc Lightning is a highly spammable nuke that creates a stream of lightning that bounces between enemy foes (up to fifteen times at max level), dealing minor damage. Lightning Bolt is more focused, dealing heavy damage to a single target, also on a very low cooldown. It can also be targeted on the ground, providing vision and True Sight and potentially striking a nearby enemy, making him effective even against fogged and invisible enemies as well and allowing him to locate enemy wards. Static Field is a potent passive ability that allows Zeus's magical damage to scale into late game, dealing damage to all enemies within a decent AoE equal to a certain percentage of nearby targets' health whenever he casts a spell. Finally, his ultimate Thundergod's Wrath allows him to strike all enemy heroes with a bolt of lightning, no matter their position, inflicting heavy damage. It can be used for multiple purposes: to finish off low-health enemy heroes limping away, to soften up the entire enemy team during a teamfight, or even to scout out the enemy's position. With the ability to strike down enemies both near and afar, the Lord of Heaven ensures that nobody can escape his wrath."}