{"abilities":[{"spell":"Выпускает молнию, которая перескакивает с одного врага на другого.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Прыжки происходят с интервалом в 0.25 секунды; требуется 1\/1.5\/2\/3.5 секунды для поражения всех целей.","Не перескакивает на невидимых юнитов или юнитов в тумане войны.","Нельзя нанести нанести урон юниту дважды за одно использование.","Все отскоки могут нанести до 350\/665\/1080\/2175 ( 1125\/1750\/2475\/4500) единиц урона (до учёта сопротивления).","У способности есть скрытый бафф - Arc Lightning, необходимый для прыжка молнии."],"mana":"80","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"1.6 ( 1.36)","name":"Arc Lightning","description":["Анимация применения: 0,2+0,63","Дальность применения: 850 ( 1125)","Радиус отскакивания: 500","Количество отскоков: 5\/7\/9\/15","Интервал отскоков: 0.25","Урон: 70\/95\/120\/145 ( 225\/250\/275\/300)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Ударом молнии наносит врагу урон и ненадолго его оглушает. В радиусе 750 вокруг цели на время раскрываются туман войны и невидимость. Способность можно применить на землю — тогда она подействует на ближайшего вражеского героя в радиусе 375.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Когда Lightning Bolt применяется на землю и в радиусе 375 единиц нет героев, то она по-прежнему обеспечивает летающий обзор в радиусе 750 единиц и даёт True Sight. Способность сначала дает эффект True Sight, поэтому невидимые герои получают урон.","Молния сначала наносит урон, затем применяет дебафф.","Когда целью является юнит, обзор и True Sight появляются в области при использования заклинания. Летающий обзор стационарен и не будет следовать за юнитом. При этом в случае, когда выбиралась точка на земле, но был поражен юнит, то обзор будет сосредоточен на точке использования, а не на найденном герое.","Летающий обзор и True Sight длятся 4,5 секунды. True Sight является аурой, а его дебафф задерживается на 0,5 секунды.","Если использовать Lightning Bolt на землю, то оно будет искать вражеских героев, иллюзии и крипов-героев. Тот, кто находится ближе всего, тот и получит урон.","При нацеливании на землю заклинание может поразить врага на расстоянии до 1075\/1125\/1175\/1225 ( 1350\/1400\/1450\/1500) единиц (складывается из дальности применения и радиуса поиска).","Чтобы поразить юнита не-героя, нужно непосредственно нацелится на него.","При использовании Lightning Bolt появляются частицы молний и воспроизводятся звуковые эффекты, которые видны и слышны для всех."],"mana":"90\/105\/120\/135","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"6 ( 5.1)","name":"Lightning Bolt","description":["Анимация применения: 0,4+0,43","Дальность применения: 700\/750\/800\/850 ( 975\/1025\/1075\/1125)","Радиус поиска цели: 375","Радиус обзора и True Sight: 750","Урон: 125\/200\/275\/350","Длительность оглушения: 0.2 ( 0.7)","Длительность обзора и True Sight: 4,5","Длительность задержки ауры True Sight: 0,5"],"hot_key":"W","legacy_key":"G"},{"spell":"Герой поражает током врагов поблизости каждый раз, когда произносит заклинание. Урон пропорционален уровню текущего здоровья жертв.","effects":["Способность Пассивная","Действует на Врагов","Урон Магический (Отнимающий здоровье)"],"notes":["Урон Static Field помечен как отнимающий здоровье, поэтому на него не реагируют эффекты, реагирующие на урон.","Урон, отнимающий здоровье, накладывается раньше, чем урон от заклинания, вызвавшего срабатывание.","Static Field не срабатывает при активации способностей предметов.","Действует на невидимых юнитов и юнитов в тумане войны.","Не действует на Рошана.","Здесь указано, сколько использований потребуется, чтобы снизить полное значение здоровья юнитов до определенного процента одним Static Field (до учета сопротивления): 75% здоровья: 6\/4\/4\/3 использований ( 5\/4\/3\/3 использований) 50% здоровья: 14\/10\/8\/6 использований ( 11\/8\/7\/6 использований) 25% здоровья: 28\/20\/15\/12 использований ( 21\/16\/13\/11 использований) 5% здоровья: 59\/42\/32\/26 использований ( 45\/34\/28\/23 использований)"],"mana":"0","elements":["Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Static Field","description":["Радиус: 1200","Урон от текущего здоровья: 5%\/7%\/9%\/11% ( 6.5%\/8.5%\/10.5%\/12.5%)"],"hot_key":"E","legacy_key":"F"},{"spell":"Поражает всех вражеских героев молнией вне зависимости от их местоположения. Способность также раскрывает невидимость вражеских существ вокруг каждого ударенного противника. Если герой врага невидим, то он не получит урона, но невидимость всё равно раскроется.","effects":["Способность Ненаправленная","Действует на Вражеских героев","Урон Магический"],"notes":["Дает летающий обзор в радиусе 500 единиц и True Sight в радиусе 900 единиц вокруг каждого пораженного героя.","Не дает обзор на неуязвимых и скрытых героев, но освещает невидимых героев.","Летающий обзор и True Sight длятся 3 секунды. True Sight является аурой, а её дебафф задерживается на 0,5 секунды.","Thundergod's Wrath сначала наносит урон всем вражеским героям (если это возможно), а потом дает на них обзор. Это означает, что способность не может нанести урон невидимым героям, если они не были обнаружены другим источником True Sight.","В совокупности Thundergod's Wrath"],"mana":"225\/325\/450","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"90 ( 76.5)","name":"Thundergod's Wrath","description":["Анимация применения: 0,4+0,43","Радиус действия: Глобальная","Радиус обзора: 500","Радиус True Sight: 900","Урон: 225\/325\/425","Длительность обзора и True Sight: 3","Длительность задержки ауры True Sight: 0,5"],"hot_key":"R","legacy_key":"W"},{"spell":"Создает в любом месте карты грозовое облако, которое автоматически применяет способность Lightning Bolt на врагов неподалеку.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Для разблокировки требуется Aghanim's Scepter.","Использует Lightning Bolt текущего уровня на ближайшую подходящую вражескую цель. То есть способность также применяет мини-оглушение и дает эффект True Sight на цель. Также это означает, что Nimbus не будет ничего делать, если Lightning Bolt не изучена.","Источником урона считается сам Nimbus, поэтому эффекты, реагирующие на урон, будут срабатывать на Nimbus, а не на Zeus (например, Blade Mail). Также на урон Nimbus не влияют никакие внешние усиления или уменьшения урона.","Сразу наносит урон после использования, если противник находится в радиусе действия.","Также бьёт мгновенно, если последний удар был длиннее интервала, т.е если противник зайдёт в радиус, то получит урон.","Может нанести до 16 ударов в течении всего времени действия, учитывая базовый интервал ударов.","Не требует обзора на цели. Nimbus может поражать невидимых юнитов и юнитов в тумане войны.","Всегда атакует ближайшую подходящую цель. Приоритет не закрепляется. Не выбирает варды и строения.","Визуальные эффекты на земле, которые отмечают область действия, видны каждому."],"mana":"275","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"35 ( 29.75)","name":"Nimbus","description":["Анимация применения: 0,2+0,64","Дальность применения: Глобальная","Радиус облака: 450","Атак героев с ближней атакой для разрушения: 4","Атак героев с дальней атакой для разрушения: 8","Атак не-героев для разрушения: 16","Интервал выстрелов Lightning Bolt: 2.25","Длительность: 35"],"hot_key":"D","legacy_key":"T"}],"bio":"Повелитель небес и отец богов видит во всех героях своих буйных, мятежных детей. Неисчислимы свидания со смертными женщинами, где заставала его супруга. Поставила богиня бессмертного перед выбором: «Если нравятся смертные, иди и сам стань среди них. Докажи свою верность, и приму тебя своим мужем бессмертным. Если же нет — иди и умри средь созданий своих». Согласился с ней бог: неоспоримы были её слова (да и магия тоже). С тех пор он вёл себя примерно, проявляя к бессмертию чуть больше любви, чем к смертным. Но чтобы умолить вечную свою супругу, он должен стремиться к победам на поле боя.","talentsTips":["Талант на дальность применения не влияет на дальность отскоков Arc Lightning.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["Zeus был одним из первых добавленных в игру героев.","Zeus основан на древнегреческом боге, с тем же именем.","Согласно данным игры одно время у Zeus было другое имя - Zuus. Возможно причина в том, что Zuus является правильным произношением.","Нигде в описании героя не сказано, что Zeus был против отказа от бессмертия. Его реплики указывают на то, что ему (по крайней мере, через какое-то время) смертность кажется более...подходящей.","У Zeus в DotA Allstars имеется альтернативное\/шуточное имя - «Merlini», имя профессионального Dota-игрока.","В ранних версия DotA, у Zeus было альтернативное имя - \"Lord of Olympus\" (Владыка Олимпа).","Возможно, что способность Static Field является отсылкой на одноименную волшебницу из Diablo II. В Diablo II заклинание также уменьшало здоровье врага на определенный процент в пределах короткого радиуса.","Фраза Zeus при возрождении: \"Человек ошибается – Бог возрождается.\" является отсылкой на фразу Александра Поупа, который говорил \"Человеку свойственно ошибаться, Богу - прощать.\".","Фраза Zeus, адресованная Chen: \"Учти, Чен, хороший святой – мертвый святой.\" является отсылкой на известную поговорку \"Чистота - залог здоровья.\"","Редкая фраза Zeus: \"Верую в себя.\" является отсылкой к национальному девизу Соединённых Штатов Америки – \"Мы верим в Бога\"."],"talents":["+155 к урону от Arc Lightning:+275 к дальности способностей","+0,5 сек. оглушения от Lightning Bolt:-15% перезарядки способностей","+1,5% к урону от Static Field:+30 к скорости передвижения","+25% к получаемому опыту:+3 маны в секунду"],"desc":"Zeus — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, три из которых активные, а одна пассивная. Его первая способность Arc Lightning, бросает молнию, которая перескакивает с одного врага на другого, при этом нанося урон каждому задетому врагу. Вторая способность Lightning Bolt, ударяет врага молнией, нанося урон и кратковременно оглушая. В радиусе вокруг цели способность ненадолго раскрывает туман войны и невидимых юнитов. Может быть применена на землю. Третья, пассивная способность Static Field, ошеломляет врагов поблизости каждый раз, когда Zeus произносит заклинание, при этом нанося урон, пропорциональный уровню их текущего здоровья. Ультимативная способность Thundergod's Wrath, ударяет каждого врага молнией вне зависимости от его местоположения. Thundergod's Wrath также дает True Sight вокруг каждого ударенного героя в радиусе. Улучшение с Aghanim's Scepter добавляет новую способность Nimbus, которая создает грозовое облако в любой точке карты, в котором на всех врагов попавших под его действие применяется способность Lightning Bolt. Урон зависит от текущего уровня прокачки этой способности."}