{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Axe_Berserker%27s_Call.mp3\/revision\/latest?cb=20191216010834",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self"
      ],
      "notes": [
        "Taunts affected enemies, forcing them to attack Axe. Has the same taunt priority with Little Friends, Life Break and Winter's Curse, but lower than Duel. Does not silence, so active attack modifiers with Autocast on are still applied. Affects invisible units and units in the Fog of War. Does not affect towers, wards, invulnerable or hidden units. Does not affect lane creeps from the very first creep wave that spawns, until they meet the opposing creeps in the lane. Does not affect Couriers.",
        "Has the same taunt priority with Little Friends, Life Break and Winter's Curse, but lower than Duel.",
        "Does not silence, so active attack modifiers with Autocast on are still applied.",
        "Affects invisible units and units in the Fog of War. Does not affect towers, wards, invulnerable or hidden units.",
        "Does not affect lane creeps from the very first creep wave that spawns, until they meet the opposing creeps in the lane.",
        "Does not affect Couriers.",
        "When cast on a unit under the taunt effect of Berserker's Call refreshes the duration.",
        "When Axe dies, the taunt ends immediately.",
        "Berserker's Call effectively increases Battle Hunger's damage per second by 25 (TagTalent 50) for its duration. Can increase Battle Hunger's total damage by up to 50\/50\/50\/75 ‒ 50\/75\/75\/100 (TagTalent 66\/66\/66\/99 ‒ 66\/99\/99\/132), depending on the tick timings.",
        "Can increase Battle Hunger's total damage by up to 50\/50\/50\/75 ‒ 50\/75\/75\/100 (TagTalent 66\/66\/66\/99 ‒ 66\/99\/99\/132), depending on the tick timings.",
        "SCEPTER NOTES Battle Hunger of its current level is now applied to all enemies within 300 (TagTalent 400) radius upon cast. Both the taunt and Battle Hunger debuff are applied at the same time. Battle Hunger notes fully apply. If it is not leveled, Battle Hunger is not applied.",
        "Both the taunt and Battle Hunger debuff are applied at the same time.",
        "Battle Hunger notes fully apply. If it is not leveled, Battle Hunger is not applied."
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "item_behaviour": [],
      "name": "Berserker's Call",
      "cooldown": "80\/90\/100\/110",
      "description": "Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Radius: 300 ( 400)",
        "Armor Bonus: 25 ( 33)",
        "Duration: 2\/2.4\/2.8\/3.2"
      ],
      "legacy_key": "E",
      "story": "Mogul Khan's warcry taunts opponents into engaging in an unconquerable battle with the Axe."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Axe_Battle_Hunger.mp3\/revision\/latest?cb=20191216010833",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies ",
        "Damage: Physical"
      ],
      "notes": [
        "The debuff can be removed by killing any unit that is not an illusion, in any way. This includes buildings, wards, and denying allied units. The affected unit itself has to make the kill to remove the debuff. Summons, player-controlled units and illusions owned by the same player do not remove the debuff when they make a kill.",
        "The affected unit itself has to make the kill to remove the debuff. Summons, player-controlled units and illusions owned by the same player do not remove the debuff when they make a kill.",
        "Enemies are not slowed when they have Axe within 90° in front of them, regardless of distance or Fog of War. This does not apply to the movement speed bonus granting talent. Reduces non-hero units' movement speed by 5.5%\/9.5%\/13.5%\/17.5% and armor by 3.5, while granting self 6% movement speed bonus per affected non-hero units. Treats creep-heroes as creeps.",
        "This does not apply to the movement speed bonus granting talent.",
        "Reduces non-hero units' movement speed by 5.5%\/9.5%\/13.5%\/17.5% and armor by 3.5, while granting self 6% movement speed bonus per affected non-hero units.",
        "Treats creep-heroes as creeps.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 12 instances. Can deal up to 120\/180\/240\/300 + 12x (TagTalent 24x) armor as damage (before reductions) when lasting its full duration. Leveling up Battle Hunger does not update the base damage of already placed debuffs. However, Axe's armor is checked periodically and the armor-based damage updated immediately. The armor-based damage is not capped at 0 armor, meaning if Axe has 10\/15\/20\/25 (TagTalent 5\/7.5\/10\/12.5) negative armor, it deals 0 damage per second.",
        "Can deal up to 120\/180\/240\/300 + 12x (TagTalent 24x) armor as damage (before reductions) when lasting its full duration.",
        "Leveling up Battle Hunger does not update the base damage of already placed debuffs.",
        "However, Axe's armor is checked periodically and the armor-based damage updated immediately.",
        "The armor-based damage is not capped at 0 armor, meaning if Axe has 10\/15\/20\/25 (TagTalent 5\/7.5\/10\/12.5) negative armor, it deals 0 damage per second.",
        "Leveling up Battle Hunger does not update the slow value of already placed debuffs.",
        "Re-casting Battle Hunger on the same target refreshes and updates the debuff.",
        "SCEPTER NOTES Battle Hunger has a passive modifier that is present on Axe at all times, but hidden when no enemies are debuffed. By default, this modifier serves no purpose. With Aghanim's Scepter, this modifier now grants Axe the armor bonus and movement speed bonus for each debuffed enemy. Effectively increases Battle Hunger's damage per second by 7 (TagTalent 14) and total damage by 84 (TagTalent 168) per affected hero.",
        "With Aghanim's Scepter, this modifier now grants Axe the armor bonus and movement speed bonus for each debuffed enemy.",
        "Effectively increases Battle Hunger's damage per second by 7 (TagTalent 14) and total damage by 84 (TagTalent 168) per affected hero.",
        "TALENT NOTES The armor multiplier increasing talent immediately updates already placed debuffs as well. Both the self movement speed increasing and the slow increasing talents do not update the value of already placed debuffs.",
        "Both the self movement speed increasing and the slow increasing talents do not update the value of already placed debuffs."
      ],
      "mana": "20\/15\/10\/5",
      "item_behaviour": [],
      "name": "Battle Hunger",
      "cooldown": "50\/60\/70\/80",
      "description": "Enrages an enemy unit, causing it to take damage over time until it kills another unit or the duration ends. The damage is increased by a factor of Axe's armor. The enemy is also slowed as long as he's facing away from Axe.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  700\/775\/850\/925",
        "Base Damage per Second: 10\/15\/20\/25",
        "Armor as Damage per Second: 100% ( 200%)",
        "Move Speed Slow: 11%\/19%\/27%\/35% ( 23%\/31%\/39%\/47%)",
        "Non-Hero Speed\/Armor Multiplier: 0.5",
        "Facing Angle: 90°",
        "Duration: 12",
        "Enemy Armor Reduction: 7",
        "Self Armor Bonus per Affected Enemy: 7",
        "<span image=\"images\\Talent\"><\/span> Self Move Speed Bonus per Affected Enemy: 12%"
      ],
      "legacy_key": "R",
      "story": "Ordinary heroes cannot withstand Mogul Khan's rage for battle, such that it injures them until it is satisfied."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8e\/Axe_Counter_Helix.mp3\/revision\/latest?cb=20191216010823",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "notes": [
        "Can only proc when an enemy unit lands an attack on Axe, regardless of distance. This means it cannot proc on missed attacks.",
        "Can proc on the secondary attacks from other instant attacks. Except from the following instant attacks that cannot proc attack modifiers: Split Shot (without the Split Shot uses modifiers talent) and Flak Cannon. Cannot proc on attacks from buildings, wards and allies. Cannot proc on spell damage.",
        "Except from the following instant attacks that cannot proc attack modifiers: Split Shot (without the Split Shot uses modifiers talent) and Flak Cannon.",
        "Cannot proc on attacks from buildings, wards and allies.",
        "Cannot proc on spell damage.",
        "Despite the visual effects, the damage is applied instantly within the radius.",
        "Counter Helix uses pseudo-random distribution.",
        "Counter Helix does not use a regular cooldown. It is neither displayed on the ability icon when proccing, nor is it affected by cooldown manipulating effects.",
        "SHARD NOTES Counter Helix now places a debuff that refreshes on successive procs on enemies within its radius. Successive procs refresh the entire stack's duration. The debuff can stack up to 6 times. A number on the icon shows the current number of stacks. Applies unique incoming damage reduction on the attack damage source that is targeting Axe. Stacks multiplicatively with all other sources of incoming damage manipulation. Can reduce an enemy's attack damage by 15%\/30%\/45%\/60%\/75%\/90% with each amount of stacks.",
        "Successive procs refresh the entire stack's duration.",
        "The debuff can stack up to 6 times. A number on the icon shows the current number of stacks.",
        "Applies unique incoming damage reduction on the attack damage source that is targeting Axe. Stacks multiplicatively with all other sources of incoming damage manipulation.",
        "Can reduce an enemy's attack damage by 15%\/30%\/45%\/60%\/75%\/90% with each amount of stacks."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Counter Helix",
      "cooldown": null,
      "description": "When attacked, Axe has a chance to perform a helix counter attack, dealing pure damage to all nearby enemies.",
      "hot_key": "E",
      "params": [
        "Radius: 275",
        "Proc Chance: 17%\/18%\/19%\/20% ( 27%\/28%\/29%\/30%)",
        "Damage: 60\/100\/140\/180 ( 90\/130\/170\/210)",
        "Max Stacks: 6",
        "Incoming Attack Damage Reduction per Stack: 15%",
        "Stacks Duration: 6"
      ],
      "legacy_key": "X",
      "story": "Axe is the only reinforcement this army needs."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Axe_Culling_Blade_1.mp3\/revision\/latest?cb=20191216010823",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Allies",
        "Damage: Pure"
      ],
      "notes": [
        "Checks the target's current health upon cast. If the current health is lower than the final outgoing damage of Culling Blade, its damage gets flagged as HP Removal. This ensures that incoming damage reductions on the target do not prevent Culling Blade from killing the target. Since it uses the final outgoing damage, outgoing damage amplifications and reductions on Axe affects the kill threshold as well. Incoming damage amplification affect the threshold as well, since HP Removal does not cause damage to bypass amplifications.",
        "This ensures that incoming damage reductions on the target do not prevent Culling Blade from killing the target.",
        "Since it uses the final outgoing damage, outgoing damage amplifications and reductions on Axe affects the kill threshold as well.",
        "Incoming damage amplification affect the threshold as well, since HP Removal does not cause damage to bypass amplifications.",
        "When the target dies to Culling Blade's damage, the following effects are applied: Removes all death preventing modifiers (e.g. Borrowed Time, Shallow Grave, False Promise and Battle Trance). However, Wraith Delay is not removed, meaning the target still enters Wraith form. It applies the movement and attack speed bonus to all nearby allies, excluding invulnerable and hidden allies. If the target was a hero, clone, or an illusion, its cooldown gets reset. Courier kills with Culling Blade reset its cooldown but does not apply the speed bonus. If the target was a hero, its cooldown gets reset and grants Axe a permanent armor bonus stack.",
        "Removes all death preventing modifiers (e.g. Borrowed Time, Shallow Grave, False Promise and Battle Trance).",
        "However, Wraith Delay is not removed, meaning the target still enters Wraith form.",
        "It applies the movement and attack speed bonus to all nearby allies, excluding invulnerable and hidden allies.",
        "If the target was a hero, clone, or an illusion, its cooldown gets reset.",
        "Courier kills with Culling Blade reset its cooldown but does not apply the speed bonus.",
        "If the target was a hero, its cooldown gets reset and grants Axe a permanent armor bonus stack.",
        "Upon culling an enemy for the first time, Axe gains a permanent buff that grants armor. Following successful kills update this buff. The number of stacks is visible on the ability icon, while the armor bonus is visible in the buff's description. Does not gain a stack if the culled enemy is an illusion or the Tempest Double, or is affected by Wraith Delay. Gains a stack even when the culled enemy has Reincarnation. The armor bonus is retroactive, leveling up the ability and learning the armor per kill increasing talent update the value. The armor bonus effectively increases Battle Hunger's damage per second by 1\/1.5\/2 (TagTalent 2\/3\/4) permanently. With the armor per kill increasing talent, this further increases to 2\/2.5\/3 (TagTalent 4\/5\/6).",
        "The number of stacks is visible on the ability icon, while the armor bonus is visible in the buff's description.",
        "Does not gain a stack if the culled enemy is an illusion or the Tempest Double, or is affected by Wraith Delay.",
        "Gains a stack even when the culled enemy has Reincarnation.",
        "The armor bonus is retroactive, leveling up the ability and learning the armor per kill increasing talent update the value.",
        "The armor bonus effectively increases Battle Hunger's damage per second by 1\/1.5\/2 (TagTalent 2\/3\/4) permanently. With the armor per kill increasing talent, this further increases to 2\/2.5\/3 (TagTalent 4\/5\/6).",
        "With the armor per kill increasing talent, this further increases to 2\/2.5\/3 (TagTalent 4\/5\/6).",
        "Cannot be cast on units under the effect of Wraith Delay.",
        "The jungle weapon gesture modifier is responsible for the sound and animation used by Fists of Axe Unleashed.",
        "SPELL STEAL The armor bonus per kill buff is not lost upon losing the ability.",
        "SOULBIND Culling Blade's cooldown reset depends if the primary target dies to the damage. If only the secondary target dies to the ability's damage, Culling Blade grants only the speed bonus with the ability going on cooldown."
      ],
      "mana": "100\/85\/70",
      "item_behaviour": [],
      "name": "Culling Blade",
      "cooldown": "100\/125\/150",
      "description": "Axe spots a weakness and strikes, dealing pure damage. When an enemy hero is killed with Culling Blade, its cooldown is reset, Axe gains bonus armor permanently and all nearby allied units gain bonus movement speed.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  175",
        "Kill Move Speed Bonus Radius: 900",
        "Damage\/Kill Threshold: 250\/350\/450 ( 400\/500\/600)",
        "Armor Bonus per Kill: 1\/1.5\/2 ( 2\/2.5\/3)",
        "Kill Move Speed Bonus: 20%\/25%\/30%",
        "Kill Attack Speed Bonus: 20\/30\/40",
        "Kill Bonus Buff Duration: 6"
      ],
      "legacy_key": "C",
      "story": "Mogul Khan is the embodiment of battle and fury, launching into a gruesome fatality against those who dare engage the Axe in combat."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 25.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.0,
    "attrAgility": 20.0
  },
  "description": "Taunts and forces enemies to attack him. One by one the soldiers of the Red Mist fell, some in battle, others to Mogul Khan's ambitions, until the self-declared general found himself a commander without troops. \"No matter\", Axe thought, \"For a one-man army is the best army of all.\" — Leaping into battle, Mogul Khan compels nearby foes to attack him with a taunting Berserker's Call. Absorbing blows from every direction, the indomitable Axe reacts by swinging his axe full circle in a Counter Helix, easily dispatching the swarm he had gathered. But alas, not all stay long enough to meet their end. The few limping away from Mogul Khan feel an inexplicable Battle Hunger, a hunger never sated before Axe slams his Culling Blade through a weakened enemy, sending them to an early grave. Axe, Axe is always charging onward.  Initiator Durable Disabler Jungler Carry ★☆☆",
  "trivia": [
    "Axe's alternate\/fun name was \"Mogul Kahnt Touch This\", a reference to MC Hammer's famous song U Can't Touch This.",
    "Axe, Disruptor, and Warlock are all related as they come from the Oglodi race.",
    "Axe's phrase Link▶️ \"Better red than dead!\" is a reversed reference to an American Cold War slogan stating \"Better dead than Red\".",
    "Several of Axe's deny and Culling Blade killing blow responses (such as Link▶️ \"You get nothing. Good day, sir!\") are references to Willy Wonka's infamous rage scene in the 1971 movie Willy Wonka & the Chocolate Factory.[1]",
    "Axe's name, lore and \"one-man army\" image may have been inspired by Khan Noonien Singh in the Star Trek series, who was also described as a \"one-man army\" and killed uncooperative subordinates (along with used-to wearing a red shirt).",
    "Axe was once the mascot of Dota 2, featuring only himself in several Dota 2 pages and game arts. This was removed in November 2013 for unknown reasons. Such was his popularity that Valve once considered creating a Dota 2 spinoff RPG, before coming up with a single player RPG featuring him as the main character, dating way back in 2013 when Valve was preparing new games for the Source 2 engine. This never left the conceptual stage, however.[2]",
    "Such was his popularity that Valve once considered creating a Dota 2 spinoff RPG, before coming up with a single player RPG featuring him as the main character, dating way back in 2013 when Valve was preparing new games for the Source 2 engine. This never left the conceptual stage, however.[2]",
    "In The Lab, a VR game by Valve, there are some Bendies who wield Axe's war axe, along with other Dota 2 weapons like a Stout Shield, Huskar's spear and Legion Commander's sword."
  ],
  "history": "As a grunt in the Army of Red Mist, Mogul Khan set his sights on the rank of Red Mist General. In battle after battle he proved his worth through gory deed. His rise through the ranks was helped by the fact that he never hesitated to decapitate a superior. Through the seven year Campaign of the Thousand Tarns, he distinguished himself in glorious carnage, his star of fame shining ever brighter, while the number of comrades in arms steadily dwindled. On the night of ultimate victory, Axe declared himself the new Red Mist General, and took on the ultimate title of 'Axe.' But his troops now numbered zero. Of course, many had died in battle, but a significant number had also fallen to Axe's blade. Needless to say, most soldiers now shun his leadership. But this matters not a whit to Axe, who knows that a one-man army is by far the best.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+100 Berserker's Call AoE",
        "talent_left": "2x Battle Hunger Armor Multiplier"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+150 Culling Blade Damage",
        "talent_left": "+1 Bonus Armor per Culling Blade Stack"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+12% Battle Hunger Slow",
        "talent_left": "+30 Counter Helix Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+8 Berserker's Call Armor",
        "talent_left": "+12% Movement Speed per Active Battle Hunger"
      }
    ]
  }
}