{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Solar_Crest_ally.mp3\/revision\/latest?cb=20150428153419",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Нельзя применить на себя.",
        "Делит перезарядку с Medallion of Courage.",
        "Эффект на себе и модификатор на цели не связаны друг с другом. Развеивание одного не развеивает другой.",
        "В отличии от Medallion of Courage, Solar Crest не применяет дебафф к заклинателю. Вместо этого его эффекты напрямую связаны с перезарядкой. Их длительность на цели всегда равна 12 секундам, в то время как длительность на заклинателе может различаться, если с перезарядкой взаимодействуют. То есть, при уменьшении перезарядки эффекты для заклинателя длятся меньше. Эффекты также мгновенно сбрасываются с сбросом перезарядки. Также эффекты применяются при использовании Medallion of Courage, поскольку предметы делят перезарядку.",
        "Их длительность на цели всегда равна 12 секундам, в то время как длительность на заклинателе может различаться, если с перезарядкой взаимодействуют.",
        "То есть, при уменьшении перезарядки эффекты для заклинателя длятся меньше. Эффекты также мгновенно сбрасываются с сбросом перезарядки.",
        "Также эффекты применяются при использовании Medallion of Courage, поскольку предметы делят перезарядку.",
        "Снижение брони заклинателя складывается само с собой. При наличии нескольких Solar Crest каждый предмет снижает броню, пока находится на перезарядке.",
        "Бафф и дебафф на цели складываются. Эффект для заклинателя также складывается с дебаффом цели. Если на существо одновременно действует союзный и вражеский Solar Crest, то модификаторы отменяют друг друга. Если противники применяют эффекты друг на друга, то на них действует -16 брони, -10% скорости передвижения и -80 скорости атаки. Несколько дебаффов\/баффов на цели не складываются, но обновляют длительность. Бафф\/дебафф на цели и дебафф на заклинателе сочетаются с эффектом, применяемым Medallion of Courage.",
        "Если на существо одновременно действует союзный и вражеский Solar Crest, то модификаторы отменяют друг друга.",
        "Если противники применяют эффекты друг на друга, то на них действует -16 брони, -10% скорости передвижения и -80 скорости атаки.",
        "Несколько дебаффов\/баффов на цели не складываются, но обновляют длительность.",
        "Бафф\/дебафф на цели и дебафф на заклинателе сочетаются с эффектом, применяемым Medallion of Courage.",
        "Можно использовать на любое существо, за исключением вардов и строений."
      ],
      "mana": null,
      "abilityName": "Shine",
      "cooldown": "12",
      "description": "Если использовать на союзника, увеличит его броню на 8, скорость атаки на 80 и скорость передвижения на 10%. Если использовать на врага, уменьшит его броню на 8, скорость атаки на 80 и скорость передвижения на 10%. Лишает владельца дополнительной брони. Не действует на невосприимчивых к заклинаниям противников.",
      "params": [
        "Дальность применения: 1000",
        "Снижение брони себе: 8",
        "Доп. броня союзнику: 8",
        "Доп. скорость передвижения союзнику: 10%",
        "Доп. скорость атаки союзнику: 80",
        "Снижение брони противника: 8",
        "Снижение скорости передвижения врага: 10%",
        "Снижение скорость атаки противника: 80",
        "Длительность: 12",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя использовать на врагов с иммунитетом."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 200 здоровья, 1 регенерации здоровья, 9,67 брони, 10 скорости атаки, 120 маны, 2,25 регенерации маны и 10 урона от атаки.",
    "Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья, 9,67 брони, 10 скорости атаки, 120 маны, 2,25 регенерации маны и 10 урона от атаки.",
    "Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья, 9,67 брони, 10 скорости атаки, 120 маны, 2,25 регенерации маны и 10 урона от атаки.",
    "Бонусы к скорости передвижения от нескольких Solar Crest складываются.",
    "Сочетается со всеми другим бонусами к скорости передвижения.",
    "Solar Crest не перенимает пассивное уменьшение брони от Blight Stone."
  ],
  "cost": "3725",
  "lore": null,
  "consistFrom": [
    "Medallion of Courage",
    "Ultimate Orb",
    "Wind Lace",
    "Recipe"
  ],
  "boughtFrom": "Магия",
  "name": "Solar Crest",
  "description": "Талисман, выкованный во хвалу дневного неба.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 к силе",
    "+10 к ловкости",
    "+10 к интеллекту",
    "+1,75 к регенерации маны",
    "+8 к броне",
    "+20 к скорости передвижения"
  ],
  "tips": null
}