{"abilities":[{"spell":"Creates vines towards the target location. Vines slow down and deal damage to enemies that walk through. Vines deal 50% more damage if they touch a tree. Does half damage to creeps.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Can deal up to 360\/480\/600\/720 damage (before reductions)."],"mana":"60\/70\/80\/90","elements":["Does not pierce spell immunity."],"cooldown":"20\/19\/18\/17","name":"Nature's Grasp","description":["Cast Animation: 0.6+[ Info Needed ]","Cast Range: 1500","Movement Slow: 25%\/30%\/35%\/40%","Damage Per Second: 30\/40\/50\/60","Bonus Tree Damage: 50%","Duration: 12"],"hot_key":"Q","legacy_key":"T"},{"spell":"Treant saps life from a random nearby enemy unit every second, prioritizing heroes. Drains health and slows enemies.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Deals damage and sends healing projectiles in 0.5-second intervals, starting 0.5 seconds after cast, resulting in 10 pulses.","Can drain up to Can deal up to 75\/150\/225\/300 ( 275\/350\/425\/500) health (before reductions)","Healing projectiles travel at a speed of 400.","If the target turns invisible, the pulses continue coming from its current actual position, making it possible to track it.","Healing pulse projectiles cannot target invulnerable or hidden units, but already flying projectiles still heal them."],"mana":"80","elements":["Cannot be disjointed.","Does not pierce spell immunity."],"cooldown":"16\/15\/14\/13 ( 14.4\/13.5\/12.6\/11.7)","name":"Leech Seed","description":["Cast Animation: 0.5+0.4","Range: 700","Pulse Interval: 0.5","Lifedrain Per Second: 15\/30\/45\/60 ( 55\/70\/85\/100)","Move Speed Slow: 26%\/34%\/42%\/50%","Move Speed Slow Duration: 0.5","Duration: 5"],"hot_key":"W","legacy_key":"E"},{"spell":"Infuses the target hero or structure with a protective coating which heals the target and provides bonus armor.","effects":["Ability Target Point \/ Target Unit ( Target Area)","Affects Allies"],"notes":["When targeting the ground, the closest unit to the target point is targeted instead.","Can be cast on buildings, providing all its effects to them.","The talent turns Living Armor into an area-targeted spell, so that it cannot directly target units anymore. In this form, it only affects heroes (including illusions and clones, excluding creep-heroes) and buildings. It can no longer be used on creeps. Among buildings, shrines and effigy buildings are not affected."],"mana":"50","elements":["Pierces spell immunity."],"cooldown":"26\/22\/18\/14 ( 23.4\/19.8\/16.2\/12.6)","name":"Living Armor","description":["Cast Animation: 0.4+0.4","Cast Range: 700","Effect Radius: 0 ( 700)","Maximum Heal: 60\/120\/180\/240 ( 120\/180\/240\/300)","Bonus Armor: 7\/10\/13\/16","Duration: 8"],"hot_key":"E","legacy_key":"V"},{"spell":"Summons an overgrowth of vines and branches around Treant that prevent afflicted enemies from moving, blinking, going invisible, or attacking.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Roots and disarms the targets, preventing them from moving, attacking and casting certain mobility spells. Provides True Sight over the targets, but does not affect already invisible targets.","Forces a stop command onto the targets upon cast, so that their current move, attack and spell cast orders get canceled.","When upgraded, also affects enemies which are within range of a tree enchanted by Eyes In The Forest.","Deals damage in 1-second intervals, starting 1 second after cast, resulting in 3\/4\/5 ( 4\/5\/6) instances.","Can deal up to 300\/400\/500 ( 800\/1000\/1200) damage per affected unit (before reductions)."],"mana":"150\/175\/200","elements":["Pierces spell immunity."],"cooldown":"100\/85\/70 ( 90\/76.5\/63)","name":"Overgrowth","description":["Cast Animation: 0.5+1.17","Radius: 800","Duration: 3\/4\/5 ( 4\/5\/6)","Damage per Second: 100 ( 200)"],"hot_key":"R","legacy_key":"R"},{"spell":"Treant Protector enchants a tree, which grants him unobstructed vision in that location. If Overgrowth is cast, units within a 800 radius of an enchanted tree will be entangled and damaged.","effects":["Ability Target Unit","Affects Trees"],"notes":["Requires Aghanim's Scepter to be unlocked.","There is no limit on how many enchanted trees can be up at one time.","The Enchantment of a tree has no expire time; it lasts until the tree gets destroyed.","Enchanted trees have distinct icons on the minimap. Just like buildings, it is colored green if allied.","Enchanted trees have 800 range flying vision and are invisible (0-second fade time).","If the enemy has True Sight over the enchanted tree, they are able to see the visual effects on both the affected tree and the 800 radius around it.","The sound effect upon cast is audible to allies only.","Upon dropping, selling or destroying Aghanim's Scepter, the enchanted trees still provide vision, and are not removed. However, Overgrowth does not root enemies around enchanted trees, and does not deal damage."],"mana":"100","elements":[],"cooldown":"35 ( 31.5)","name":"Eyes In The Forest","description":["Cast Animation: 0.2+0.83","Cast Range: 160","Vision\/Overgrowth Radius: 800"],"hot_key":"D","legacy_key":"D"}],"bio":"Far to the west, in the mountains beyond the Vale of Augury, lie the remains of an ancient power, a fount of eldritch energy nestled deep in the high woods. It is said that the things that grow here, grow strangely. To the forces of nature this is a sacred place, made to stay hidden and unknown. Many are the traps and dangers of this land--all-consuming grasses and crossbred fauna and poisonous flowers--but none are so fierce as the mighty Treant Protectors. These ageless, titanic beings, charged with keeping the peace in this dangerous land, ensure that none within encroach without reason, and none without poach their secrets. For time untold they tended to their holy ground, uninterrupted, only dimly aware of the changing world beyond. Yet inevitably the wider world grew aware of this untamed land, and with each passing winter the outsiders grew bolder. Soon they arrived with tools to cut and with flames to burn, and often the Treants would ponder: who are these fragile, industrious creatures? What now had become of the wild, green world? There came and went an age of questions and of doubts, a thousand summers of long traditions set to scrutiny, while more and more the outsiders died and fed their earth. When all that bloomed had finally finished their stay, curiosity had overcome caution. It was decided: a lone Protector would be sent into the wider world, and instructed to wander until the glaciers arose once more, to observe the changing land and its creatures, and to discover what unknown dangers could threaten their sacred ground.","talentsTips":["The cooldown reduction talent stacks multiplicatively with other sources cooldown reduction.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Treant Protector has \"Riki was here\" carved into his side (near the left-handed runes on his belt).","Treant Protector's appearance, name, and voice are based heavily on Treebeard, the eldest of the Ent race, who appears in the Lord of the Rings books and movies.","Treant Protector's response \"They say my bark is worse than my bite. I wonder what that means.\" is a reference to the speaking tree \"Grandmother Willow\" from Pocahontas.","Treant Protector's response \"You were nasty, brutal, and most of all short\", in reply to killing Pugna, is a reference to the 1651 book, Leviathan by Thomas Hobbes"],"talents":["700 AoE Living Armor:+1s and +100 DPS Overgrowth","+40 Leech Seed Damage\/Heal:Gain Tree Walking","+30 Nature's Grasp DPS:+90 Damage","10% Cooldown Reduction:+60 Living Armor Heal"],"desc":"Hero   Strategy   Counters   Equipment   Gear   Talents   Relics   Responses   Sounds   Lore   Old Abilities   Changelogs   Known Bugs  "}