{"abilities":[{"spell":"Turns Treant invisible after a short delay when he is within close radius of a tree. Increases movement speed while invisible, and causes a disarming root when attacking out of invisibility.","effects":["Ability Passive","Affects Self \/ Enemies","Damage Magical"],"notes":["Casting spells or using items does not break the invisibility.","Damage greater than 0 from any player (including allies, excluding self) or Roshan resets the fade delay.","The ability icon shows a cooldown whenever a tree is within the radius while not invisible. This has only informative purposes. This means it is not affected by the cooldown reductions of Octarine Core, Arcane Rune and the level 10 talent. However, it is affected by cooldown resets like Refresher Orb, but doing so does not affect the fade delay in any way. Time Dilation and Chakra Magic affect the cooldown visually, but do not affect the fade delay either. The cooldown starts over whenever Treant Protector attacks, to indicate that the fade delay has reset due to the attack.","Treant Protector stays invisible as long as there are trees within 265 radius around him. A status buff appears on Treant Protector whenever he is near a tree, and immediately disappears as soon as no tree is found.","The invisibility is not instantly lost upon getting too far from trees. There is a 0.75-second-long grace time. This means Treant Protector can stay up to 0.75 seconds long away from trees and still be invisible. The grace time resets whenever a tree is within range again. The grace time is not indicated anywhere.","Treant protector is phased while invisible, and can also walk through trees.","While invisible, Treant Protector's next attack has True Strike, and roots and disarms the target, preventing it from moving, attacking, and casting certain mobility spells. The attack first applies its damage, then the debuff. Does not work against buildings and wards. Provides True Sight over the target.","The root deals 10\/30\/50\/70 a total of 3 times, starting 1 interval after the debuff is placed. The interval adapts to the durations. This results in an interval of 0.13\/0.33\/0.53\/0.73 ( 0.8\/1\/1.2\/1.4)."],"mana":"0","elements":["Partially usable by illusions.","Not disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Nature's Guise","description":["Tree Search Radius: 265","Fade Delay: 4\/3.5\/3\/2.5","Movement Speed Bonus: 14%\/18%\/22%\/26%","Root Total Damage: 30\/90\/150\/210","Root Duration: 0.4\/1\/1.6\/2.2 ( 2.4\/3\/3.6\/4.2)","Invisibility Linger Duration: 0.75"],"hot_key":"Q","legacy_key":"T"},{"spell":"Treant plants a life-sapping seed in an enemy unit, draining its health, while simultaneously slowing it. The seed heals friendly units around it. Pulses 7 times.","effects":["Ability Target Unit","Affects Enemies \/ Allies","Damage Magical"],"notes":["Deals damage and sends healing projectiles in 0.75-second intervals, starting 0.75 seconds after cast, resulting in 7 pulses.","Can deal up to 84\/168\/252\/336 ( 434\/518\/602\/686) damage (before reductions) and heal a single unit for up to 84\/168\/252\/336 ( 434\/518\/602\/686) health.","The heal is independent from the damage and always heals for the same amount, regardless of how much damage the target takes.","Healing projectiles travel at a speed of 400.","Always emits 7 pulses, even when the target dies earlier.","If the target turns invisible, the pulses continue coming from its current actual position, making it possible to track it.","Healing pulse projectiles cannot target invulnerable or hidden units, but already flying projectiles still heal them."],"mana":"100\/110\/120\/130","elements":["Cannot be disjointed.","Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"16\/13\/10\/7 ( 14.4\/11.7\/9\/6.3)","name":"Leech Seed","description":["Cast Animation: 0.5+0.4","Cast Range: 350","Radius: 500","Pulse Interval: 0.75","Damage per Pulse: 12\/24\/36\/48 ( 62\/74\/86\/98)","Heal per Pulse: 12\/24\/36\/48 ( 62\/74\/86\/98)","Move Speed Slow: 16%\/20%\/24%\/28%","Duration: 5.25"],"hot_key":"W","legacy_key":"E"},{"spell":"Infuses the target hero or structure with a protective coating which grants bonus regeneration. Also blocks some damage from all sources. Dispels when a number of damage instances are taken.","effects":["Ability Target Point \/ Target Unit ( Target Area)","Affects Allies"],"notes":["When targeting the ground, the closest unit to the target point is targeted instead.","Can be cast on buildings, providing all its effects to them.","Can regenerate up to 60\/120\/180\/240 health over its full duration.","Living Armor belongs to the group of damage negating effects. However, unlike the others in that group, Living Armor only negates a certain amount of damage per instance.","If a damage instance is low enough to get fully negated, it causes several on-damage effects to not trigger.","Living Armor has the lowest priority in the group of damage negating effects. This means when coupled with any other form of damage negation, Living Armor neither blocks damage nor loses any charges. When combined with Aphotic Shield however, it does lose charges without blocking any damage. When combined with the Glyph of Fortification, it does not lose any charges until the Glyph's effect expires.","As with all damage manipulating effects, Living Armor only blocks the 3 damage types. It does not react on HP Removal.","Blocks damage after all kinds of reductions. Fully ignores damage lower than 5 (after reductions).","Can block up to 100\/250\/450\/700 ( 150\/350\/600\/900) damage.","The talent turns Living Armor into an area-targeted spell, so that it cannot directly target units anymore. In this form, it only affects heroes (including illusions and clones, excluding creep-heroes) and buildings. It can no longer be used on creeps. Among buildings, shrines and effigy buildings are not affected."],"mana":"50","elements":["Pierces spell immunity."],"cooldown":"30\/24\/18\/12 ( 27\/21.6\/16.2\/10.8)","name":"Living Armor","description":["Cast Animation: 0.5+0.4","Cast Range: Global","Effect Radius: 0 ( 700)","Damage Block Instances: 4\/5\/6\/7 ( 6\/7\/8\/9)","Damage Block: 25\/50\/75\/100","Health Regeneration Bonus: 4\/8\/12\/16","Duration: 15"],"hot_key":"E","legacy_key":"V"},{"spell":"Summons an overgrowth of vines and branches around Treant that prevent afflicted enemies from moving, blinking, going invisible, or attacking.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Roots and disarms the targets, preventing them from moving, attacking and casting certain mobility spells. Provides True Sight over the targets, but does not affect already invisible targets.","Forces a stop command onto the targets upon cast, so that their current move, attack and spell cast orders get canceled.","When upgraded, also affects enemies which are within ( ) range of a tree enchanted by Eyes In The Forest. These enemies also take damage over time. The Overgrowth damage from multiple overlapping Eyes in the Forest areas does not stack. Deals damage in 1-second intervals, starting 1 second after cast, resulting in 3\/3\/4 instances. Can deal up to 0\/0\/0 damage per affected unit (before reductions)."],"mana":"150\/175\/200","elements":["Pierces spell immunity."],"cooldown":"100\/85\/70 ( 90\/76.5\/63)","name":"Overgrowth","description":["Cast Animation: 0.5+1.17","Radius: 800 ( 1150)","Duration: 3\/3.75\/4.5","Damage per second: 0 ( 175)"],"hot_key":"R","legacy_key":"R"},{"spell":"Treant Protector enchants a tree, which grants him unobstructed vision in that location. If Overgrowth is cast, units within a 800 radius of an enchanted tree will be entangled and damaged.","effects":["Ability Target Unit","Affects Trees"],"notes":["Requires Aghanim's Scepter to be unlocked.","There is no limit on how many enchanted trees can be up at one time.","The Enchantment of a tree has no expire time; it lasts until the tree gets destroyed.","Enchanted trees have distinct icons on the minimap. Just like buildings, it is colored green if allied.","Enchanted trees have 800 ( 1150) range flying vision and are invisible (0-second fade time).","If the enemy has True Sight over the enchanted tree, they are able to see the visual effects on both the affected tree and the 800 ( 1150) radius around it.","The sound effect upon cast is audible to allies only.","Upon dropping, selling or destroying Aghanim's Scepter, the enchanted trees still provide vision, and are not removed. However, Overgrowth does not root enemies around enchanted trees, and does not deal damage."],"mana":"100","elements":[],"cooldown":"35 ( 31.5)","name":"Eyes In The Forest","description":["Cast Animation: 0.2+0.83","Cast Range: 160","Vision\/Overgrowth Radius: 800 ( 1150)"],"hot_key":"D","legacy_key":"D"}],"bio":"Far to the west, in the mountains beyond the Vale of Augury, lie the remains of an ancient power, a fount of eldritch energy nestled deep in the high woods. It is said that the things that grow here, grow strangely. To the forces of nature this is a sacred place, made to stay hidden and unknown. Many are the traps and dangers of this land--all-consuming grasses and crossbred fauna and poisonous flowers--but none are so fierce as the mighty Treant Protectors. These ageless, titanic beings, charged with keeping the peace in this dangerous land, ensure that none within encroach without reason, and none without poach their secrets. For time untold they tended to their holy ground, uninterrupted, only dimly aware of the changing world beyond. Yet inevitably the wider world grew aware of this untamed land, and with each passing winter the outsiders grew bolder. Soon they arrived with tools to cut and with flames to burn, and often the Treants would ponder: who are these fragile, industrious creatures? What now had become of the wild, green world? There came and went an age of questions and of doubts, a thousand summers of long traditions set to scrutiny, while more and more the outsiders died and fed their earth. When all that bloomed had finally finished their stay, curiosity had overcome caution. It was decided: a lone Protector would be sent into the wider world, and instructed to wander until the glaciers arose once more, to observe the changing land and its creatures, and to discover what unknown dangers could threaten their sacred ground.","talentsTips":["The tree respawn talent sets the respawn time of all trees on the map to 2 seconds. This does not include trees created by abilities and items. If the talent is chosen while there already are destroyed trees, they respawn immediately if they have been destroyed more than 2 seconds ago.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Treant Protector has \"Riki was here\" carved into his side (near the left-handed runes on his belt).","Treant Protector's appearance, name, and voice are based heavily on Treebeard, the eldest of the Ent race, who appears in the Lord of the Rings books and movies.","Treant Protector's response \"They say my bark is worse than my bite. I wonder what that means.\" is a reference to the speaking tree \"Grandmother Willow\" from Pocahontas.","Treant Protector's response \"You were nasty, brutal, and most of all short\", in reply to killing Pugna, is a reference to the 1651 book, Leviathan by Thomas Hobbes"],"talents":["700 AoE Living Armor:+350 Eyes and Overgrowth AoE","+50 Leech Seed Damage\/Heal:+2s Nature's Guise Root","2s Tree Respawn Time:+90 Damage","10% Cooldown Reduction:+2 Living Armor Block Instances"],"desc":""}