{"abilities":[{"spell":"Протягивает лозы до указанной области. Они замедляют проходящих по ним врагов и наносят им урон (крипам - на 50% меньше). Лозы наносят на 50% больше урона, если касаются дерева.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Может наносить до 360\/480\/600\/720 урона (до уменьшения). Лозы Nature's Grasp появляются не сразу в пределах всей его области. Есть время пути."],"mana":"60\/70\/80\/90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/19\/18\/17 ( 17\/16,15\/15,3\/14,45)","name":"Nature's Grasp","description":["Анимация применения: 0,2+0,7","Дальность применения: 1500","Длина лоз: 1500","Радиус лоз: 135","Урон в секунду: 30\/40\/50\/60 ( 60\/70\/80\/90)","Увеличение урона от контакта с деревом: 50%","Снижение урона по крипам: 50%","Замедление передвижения: 25%\/30%\/35%\/40%","Длительность лоз: 12","Длительность задержки ауры: 0,5"],"hot_key":"Q","legacy_key":"T"},{"spell":"Герой каждую секунду высасывает жизнь из случайного врага (сначала из героев). Забирает здоровье жертв и замедляет их.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Наносит урон и отправляет лечащие снаряды с интервалом в 0,5 сразу после применения, срабатывая 10 раз."],"mana":"110","elements":["Нельзя избежать.","Блокируется иммунитетом к заклинаниям."],"cooldown":"22\/19\/16\/13 ( 18,7\/16,15\/13,6\/11,05)","name":"Leech Seed","description":["Анимация применения: 0,4+0,5","Радиус: 700","Интервал пульсаций: 0,5","Лечение\/урон за пульсацию: 15\/30\/45\/60 ( 65\/80\/95\/110)","Замедление скорости передвижения: 18%\/24%\/30%\/36%","Длительность: 5","Длительность замедления: 0,5"],"hot_key":"W","legacy_key":"E"},{"spell":"Накладывает на выбранного героя или сооружение защитный покров, увеличивая его регенерацию здоровья и броню.","effects":["Способность Направленная на точку \/ Способности#Направленная на юнита ( Направленная на область)","Действует на Союзников"],"notes":["При выборе области на земле способность выбирает ближайшее к ней существо.","Можно применить на строения, применяя к ним все эффекты.","Лечит 5\/8,33\/11,67\/15 с интервалом в 1 секунду, срабатывая 12 раз.","Талант превращает Living Armor в заклинание, направленное на область, после чего его нельзя применить на существо напрямую. В этом случае способность действует только на героев (включая иллюзии и клонов, но исключая крипов-героев) и строения. Заклинание больше нельзя использовать на крипов. Исключением из строений являются святыни и постройки."],"mana":"50","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"26\/22\/18\/14 ( 22,1\/18,7\/15,3\/11,9)","name":"Living Armor","description":["Анимация применения: 0,4+0,5","Дальность применения: Глобальная","Радиус: 0 ( 550)","Суммарное лечение: 60\/100\/140\/180 ( 120\/160\/200\/240)","Дополнительная броня: 4\/6\/8\/10","Длительность: 12"],"hot_key":"E","legacy_key":"V"},{"spell":"Позволяет ходить сквозь деревья, если герой не получал урон последние 3 секунд. При этом он будет быстрее передвигаться и иметь усиленное лечение и восстановление здоровья.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Эта способность отключается только при получении урона, когда она еще не активна. Это означает, что когда вы находитесь в радиусе 150 от дерева, получение урона не отключает способность.","При отключении способность перезаряжается, показывая, что она отключена. Это обычная перезарядка и полностью зависит от всего, что обычно взаимодействует с временем восстановления.","При получении урона от источников, принадлежащих игрокам, или Рошана и превышающего 0, способность уходит на перезарядку.","При выборе соответствующего таланта на 10 уровне, Treant Protector также получает невидимость пока в радиусе 150 от него есть деревья. В отличие от других бонусов, невидимость имеет время отсрочки отключения 0,75 секунд. Это значит что невидимость не теряется мгновенно при выходе их радиуса поиска деревьев. Она задерживается на 0,75 секунд, и может быть не потеряна вообще, при повторном сближении с деревом в течение этого времени. Использование заклинаний или предметов не прерывает невидимость. Атаки прерывает невидимость, независимо от того, была ли она совершена или нет. Во время атаки если вы все еще находитесь в радиусе дерева, невидимость снова применяется через 0,75 секунд."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением."],"cooldown":"0","name":"Nature's Guise","description":["Радиус поиска дерева: 150","Задержка до невидимости: 0","Доп. скорость передвижения: 15","Усиление лечения: 25%","Усиление регенерации здоровья: 25%","Длительность задержки выхода из невидимости: 0 ( 0,75)","Перезарядка при получении урона:: 3"]},{"spell":"Вокруг героя разрастаются корни и лозы, опутывая врагов и не давая им перемещаться, уходить в невидимость или атаковать.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Применяет к целям оцепенение и обезоруживание, предотвращая их передвижение, атаки и использование определенных заклинаний для передвижения.","Дает эффект True Sight на цель, но лишь в случае, если при применении цель не была невидима.","При применении отдает команду \"стоп\" целям, поэтому текущие приказы на передвижение, атаку и применение заклинаний отменяются.","При улучшении также действует на врагов, оказавшихся в радиусе от зачарованных Eyes In The Forest деревьев. Урон от нескольких областей Eyes In The Forest не складывается. Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 3\/4\/5 раз. Может нанести до 225\/300\/375 ( 525\/700\/875) единиц урона затронутым существам (до учета сопротивлений)."],"mana":"200\/250\/300","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"100 ( 85)","name":"Overgrowth","description":["Радиус: 800","Урон в секунду: 75 ( 175)","Длительность: 3\/4\/5"],"hot_key":"R","legacy_key":"R"},{"spell":"Герой зачаровывает дерево, получая беспрепятственный обзор вокруг него. При применении способности Overgrowth существа в радиусе 800 вокруг зачарованных деревьев будут скованы и получат урон.","effects":["Способность Направленная на юнита","Действует на Деревья"],"notes":["Для разблокировки требует Aghanim's Scepter.","У способности нет лимита на количество одновременно зачарованных деревьев.","Длительность зачаровывания дерева неограничено и длится до его разрушения.","Деревья отмечаются отдельными иконками на мини-карте. Как и строения, они окрашены зеленым, если зачарованы союзником.","Деревья дают летающий обзор в радиусе 800 единиц и невидимы (с задержкой до невидимости в 0 секунд).","Если у врага есть источник True Sight на зачарованные деревья, то ему будет видны визуальные эффекты как на дереве, так и в радиусе 800 ( ) единиц вокруг него.","Звуковой эффект при применении слышен только союзникам.","При выкладывании, продаже или разрушении Aghanim's Scepter зачарованные деревья продолжают давать обзор и не разрушаются. При этом Overgrowth вокруг этих деревьев не применяется.","Устанавливает время восстановления всех деревьев на карте в 10 секунд. Не распространяется на деревья, созданные способностями и предметами. Если Aghanim's Scepter был куплен при уже срубленных деревьях, то они мгновенно появятся если были разрушены более 10 секунд назад."],"mana":"100","elements":[],"cooldown":"35 ( 29,75)","name":"Eyes In The Forest","description":["Анимация применения: 0,2+0,83","Дальность применения: 160","Радиус действия Overgrowth\/обзора: 800","Глобальное время восстановление деревьев: 10"],"hot_key":"D","legacy_key":"D"}],"bio":"Далеко на западе, в горах за Долиной прорицаний, лежат остатки древней силы, источник первозданной энергии, прорастающей глубоко в высокогорных лесах. Говорят, что то, что там растет — растет странно. Это место свято для сил природы, и его держат сокрытым и недоступным. Бесчисленны ловушки и опасности, покрывающие ту землю — всепоглощающие травы, смешанные животные и ядовитые цветы — но нет среди них ничего настолько же грозного, как могучие энты-защитники. Они — старцы-исполины, которым поручено сохранять мир в этих опасных землях, и не давать тем, кто живет в них, позариться на то, на что не положено, а тем, кто снаружи — вторгаться без причины. Неисчислимые века они сторожили свою землю, несокрушимые и непотревоженные, едва лишь знающие об изменениях мира вокруг. Однако с расширением внешнего мира живущие снаружи прознали о святой земле и с каждой зимой становились всё наглее. Вскоре они нагрянули с устройствами, чтобы рубить, и пламенем, чтобы жечь, и часто энты задумывались: что это за хрупкие, изобретательные существа? Что же случилось с тем зелёным миром? Пришёл и ушёл век раздумий, тысяча лет традиций подверглась исследованиям, а между тем всё больше и больше вторженцев приходили и питали их землю. Когда всё, что когда-то цвело, уже завяло, любопытство перебороло осторожность. Было решено: единственный защитник будет отправлен во внешний мир, и ему будет поручено бродить по нему до нового ледникового периода, следя за меняющейся землёй и населяющими её существами и узнавая, какие ещё неизвестные опасности могут грозить священной земле энтов.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."],"trivia":["У Treant Protector на коре, с левой стороны над рунами на поясе, вырезана фраза \"Riki was here\" (\"Здесь был Riki\").","При использовании Tango, Treant Protector может произнести фразу \" Sorry, friend.\"."],"talents":["Living Armor применяется по области радиусом 550:+100 урона в секунду от Overgrowth","+50 к урону\/лечению от Leech Seed:-15% перезарядки способностей","+30 к урону от Nature's Grasp:+60 к лечению от Living Armor","Невидимость от Nature's Guise:+50 к урону"],"desc":"Treant Protector — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Nature's Grasp, взращивает перед Treant Protector длинную тропу из лоз. Враги при контакте с ними замедляются и получают периодический урон. Вторая способность, Leech Seed, сажает в тело жертвы истощающее семя, которое замедляет цель и отнимает ее здоровье. Также семя излечивает всех союзников поблизости. Третья способность, Living Armor, защищает выбранного героя или сооружение аурой, увеличивающей регенерацию здоровья. Также дает защиту от любых атак. Заклинание спадает при получении некоторого количества ударов либо после окончания действия. Ультимативная способность, Overgrowth, разрастаются корни и лозы вокруг Trean Protector, опутывая врагов и не давая им перемещаться, телепортироваться, уходить в невидимость или атаковать. Улучшение с Aghanim's Scepter дает новую способность, Eyes In The Forest, позволяющую герою заколдовывать деревья и получать обзор вокруг них. При использовании способности Overgrowth существа в радиусе от заколдованного дерева будут связаны и получат урон."}