{"abilities":[{"spell":"Делает героя невидимым, если он некоторое время находится рядом с деревом. Невидимость увеличивает скорость передвижения, а атака из неё лишит жертву возможности двигаться или атаковать.","effects":["Способность Пассивная","Действует на Себя \/ Врагов"],"notes":["Использование заклинаний или предметов не прерывает невидимость.","Получение урона, превышающего 0 от любого игрока (включая союзников, но исключая себя) или Рошана, сбросит задержку до невидимости.","Иконка способности показывает таймер перезарядки около деревьев в радиусе, когда герой ещё видим. Он нужен только для индикации. То есть на него не влияет уменьшение перезарядки от Octarine Core, Руна волшебства и таланта на 10-ом уровне. При этом на него действует сброс перезарядки от Refresher Orb, но предмет всё равно не влияет на задержку перед невидимостью. Time Dilation и Chakra Magic визуально влияют на перезарядку, но не на задержку перед невидимостью. Перезарядка начинается заново, когда Treant Protector атакует, показывая, что задержка перед невидимостью из-за неё сбросилась.","Treant Protector остается невидимым, пока в радиусе 265 от него есть деревья. Бафф состояния появляется у Treant Protector, если рядом с ним есть дерево, и мгновенно исчезает, если деревьев вокруг нет.","Невидимость не прерывается мгновенно при уходе от деревьев. Она задерживается на 0.75 секунды. То есть Treant Protector может отойти от деревьев на 0.75 дольше и оставаться невидимым. Задержка сбрасывается, если около героя вновь будет дерево. Это время нигде не отображается.","В невидимости на Treant Protector действует эффект сквозного передвижения и он может проходить сквозь деревья.","В невидимости следующая атака Treant Protector будет с эффектом True Strike, применяя оцепенение и обезоруживание к цели, предотвращая её передвижение, атаки и использование определенных заклинаний для передвижения. Атака сначала наносит урон, затем применяет дебафф. Не действует на строения и варды. Дает эффект True Sight на цель.","Оцепенение наносит 10\/30\/50\/70 урона 3 раза спустя 1 интервал после применения дебаффа. Интервал адаптируется к длительности. В итоге интервал равен 0.13\/0.33\/0.53\/0.73 ( 0.8\/1\/1.2\/1.4)."],"mana":"0","elements":["Частично используется иллюзиями.","Не отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Nature's Guise","description":["Радиус поиска дерева: 265","Задержка до невидимости: 4\/3.5\/3\/2.5","Доп. скорость передвижения: 14%\/18%\/22%\/26%","Общий урон от оцепенения: 30\/90\/150\/210","Длительность оцепенения: 0.4\/1\/1.6\/2.2 ( 2.4\/3\/3.6\/4.2)","Длительность задержки выхода из невидимости: 0.75"],"hot_key":"Q","legacy_key":"T"},{"spell":"Герой сажает в тело жертвы истощающее семя, которое замедляет цель и отнимает её здоровье. Также семя излечивает всех союзников вокруг цели. Срабатывает 7 раз.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Наносит урон и отправляет лечащие снаряды с интервалом в 0.75 секунды спустя 0.75 секунды после применения, срабатывая 7","Может нанести до 84\/168\/252\/336 ( 434\/518\/602\/686) единиц урона (до учета сопротивления) и вылечить одному юниту до 105\/210\/315\/420 ( 455\/560\/665\/770) единиц здоровья.","Лечение не связано с уроном и всегда излечивает на фиксированное значение, не зависящее от полученного целью урона.","Лечащие снаряды летят со скоростью в 400 единиц.","Всегда выпускает 7","Если цель стала невидимой, волны все равно исходят от актуального расположения цели, позволяя её отследить.","Лечащая волна не может выбрать неуязвимых или спрятанных юнитов, но уже вылетевшие снаряды юнитов излечат."],"mana":"100\/110\/120\/130","elements":["Нельзя избежать.","Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/13\/10\/7 ( 14.4\/11.7\/9\/6.3)","name":"Leech Seed","description":["Анимация применения: 0,5+0,4","Дальность применения: 350","Радиус: 500","Интервал пульсаций: 0.75","Урон за пульсацию: 12\/24\/36\/48 ( 62\/74\/86\/98)","Лечение за пульсацию: 15\/30\/45\/60 ( 65\/80\/95\/110)","Замедление скорости передвижения: 16%\/20%\/24%\/28%","Длительность: 5.25"],"hot_key":"W","legacy_key":"E"},{"spell":"Накладывает на выбранного героя или сооружение защитный покров, увеличивая его регенерацию здоровья. Покров блокирует часть любого получаемого урона. Эффект спадает, если получить урон несколько раз.","effects":["Способность Направленная на точку \/ Способности#Направленная на юнита ( Направленная на область)","Действует на Союзников"],"notes":["При выборе области на земле способность выбирает ближайшего к ней юнита.","Можно применить на строения, применяя к ним все эффекты.","Восстанавливает здоровье в виде регенерации, регенерируя 0.4\/0.8\/1.2\/1.6 единиц здоровья с интервалом в 0,1 секунды.","Может вылечить до 60\/120\/180\/240 единиц здоровья, если броня оставалась на цели всю длительность.","Living Armor относится к группе эффектов, отрицающих урон. При этом, в отличии от других заклинаний, способность отрицает лишь определенное количество урона за раз.","Если наносимый урон достаточно мал для полного отрицания, то определенные эффекты, реагирующие на урон, не срабатывают.","У Living Armor самый низкий приоритет среди отрицающих урон эффектов. То есть при действии с другим эффектом из группы Living Armor не будет ни блокировать урон, ни терять заряды. При этом в комбинации с Aphotic Shield способность теряет заряды без блокирования урона. При комбинации со способностью \"Укрепление строений\" Living Armor не теряет заряды до завершения действия эффекта укрепления.","Как и другие манипулирующие уроном эффект Living Armor блокирует только 3 типа урона. Заклинание не реагирует на отнимающий здоровье урон.","Блокирует урон после учета всех сопротивлений. Игнорирует урон меньше 5 (после сопротивлений).","Может заблокировать до 160\/300\/480\/700 ( 240\/420\/640\/900) единиц урона.","Талант превращает Living Armor в заклинание, направленное на область, после чего его нельзя применить на юнита напрямую. В этом случае способность действует только на героев (включая иллюзии и клонов, но исключая крипов-героев) и строения. Заклинание больше нельзя использовать на крипов. Исключением из строений являются святыни и постройки."],"mana":"50","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"30\/24\/18\/12 ( 27\/21.6\/16.2\/10.8)","name":"Living Armor","description":["Анимация применения: 0,5+0,4","Дальность применения: Глобальная","Радиус: 0 ( 700)","Блокирует ударов: 4\/5\/6\/7 ( 6\/7\/8\/9)","Блокирует урона: 40\/60\/80\/100","Доп. восстановление здоровья: 4\/8\/12\/16","Длительность: 15"],"hot_key":"E","legacy_key":"V"},{"spell":"Вокруг героя разрастаются корни и лозы, опутывая врагов и не давая им перемещаться, уходить в невидимость или атаковать.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Если у вас есть Aghanim's Scepter, то Overgrowth наносит урон даже без Enchanted Trees поблизости Применяет к целям оцепенение и обезоруживание, предотвращая их передвижение, атаки и использование определенных заклинаний для передвижения.","Прерывает произносимые заклинания цели, но юнит может их произносить во время действия заклинания. Дает эффект True Sight на цель, но лишь в случае, если при применении цель не была невидима.","При применении отдает команду \"стоп\" целям, поэтому текущие приказы на передвижение, атаку и применение заклинаний отменяются.","При улучшении также действует на врагов, оказавшихся в радиусе ( ) от зачарованных Eyes In The Forest деревьев. Эти враги также получают периодический урон. Враги вокруг Treant Protector этот урон не получают. Урон от нескольких областей Eyes in the Forest не складывается. Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 3\/4\/4 раз. Может нанести до 0\/0\/0 единиц урона затронутым юнитам (до учета сопротивлений)."],"mana":"150\/175\/200","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"100\/85\/70 ( 90\/76.5\/63)","name":"Overgrowth","description":["Анимация применения: 0,5+1,17","Радиус: 800 ( 1150)","Длительность: 3.25\/4\/4.75","Урон в секунду от Eyes in the Forest: 0 ( 175)"],"hot_key":"R","legacy_key":"R"},{"spell":"Герой зачаровывает дерево, получая беспрепятственный обзор вокруг него. При применении способности Overgrowth существа в радиусе 800 вокруг зачарованных деревьев будут скованы и получат урон.","effects":["Способность Направленная на юнита","Действует на Деревья"],"notes":["Для разблокировки требует Aghanim's Scepter.","У способности нет лимита на количество одновременно зачарованных деревьев.","Длительность зачарования дерева неограничено и длится до его разрушения.","Деревья отмечаются отдельными иконками на миникарте. Как и строения, они окрашены зеленым, если зачарованы союзником.","Деревья дают летающий обзор в радиусе 800 ( 1150) единиц и невидимы (с задержкой до невидимости в 0 секунд).","Если у врага есть источник True Sight на зачарованные деревья, то ему будет видны визуальные эффекты как на дереве, так и в радиусе 800 ( 1150) единиц вокруг него.","Звуковой эффект при применении слышен только союзникам.","При выкладывании, продаже или разрушении Aghanim's Scepter зачарованные деревья продолжают давать обзор и не разрушаются. При этом Overgrowth вокруг этих деревьев не применяется и не наносит урон."],"mana":"100","elements":[],"cooldown":"35 ( 31.5)","name":"Eyes In The Forest","description":["Анимация применения: 0,2+0,83","Дальность применения: 160","Радиус действия Overgrowth\/обзора: 800 ( 1150)"],"hot_key":"D","legacy_key":"D"}],"bio":"Далеко на западе, в горах за Долиной прорицаний, лежат остатки древней силы, источник первозданной энергии, прорастающей глубоко в высокогорных лесах. Говорят, что то, что там растет — растет странно. Это место свято для сил природы, и его держат сокрытым и недоступным. Бесчисленны ловушки и опасности, покрывающие ту землю — всепоглощающие травы, смешанные животные и ядовитые цветы — но нет среди них ничего настолько же грозного, как могучие энты-защитники. Они — старцы-исполины, которым поручено сохранять мир в этих опасных землях, и не давать тем, кто живет в них, позариться на то, на что не положено, а тем, кто снаружи — вторгаться без причины. Неисчислимые века они сторожили свою землю, несокрушимые и непотревоженные, едва лишь знающие об изменениях мира вокруг. Однако с расширением внешнего мира живущие снаружи прознали о святой земле и с каждой зимой становились всё наглее. Вскоре они нагрянули с устройствами, чтобы рубить, и пламенем, чтобы жечь, и часто энты задумывались: что это за хрупкие, изобретательные существа? Что же случилось с тем зелёным миром? Пришёл и ушёл век раздумий, тысяча лет традиций подверглась исследованиям, а между тем всё больше и больше вторженцев приходили и питали их землю. Когда всё, что когда-то цвело, уже завяло, любопытство перебороло осторожность. Было решено: единственный защитник будет отправлен во внешний мир, и ему будет поручено бродить по нему до нового ледникового периода, следя за меняющейся землёй и населяющими её существами и узнавая, какие ещё неизвестные опасности могут грозить священной земле энтов.","talentsTips":["Талант на рост деревьев устанавливает время восстановления всех деревьев на карте равным 2 секундам. Талант не распространяется на деревья, созданные способностями и предметами. Если талант был выбран при уже срубленных деревьях, то они мгновенно появятся если были разрушены более 2 секунд назад.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["У Treant Protector на коре, с левой стороны над рунами на поясе, вырезана фраза \"Riki was here\" (\"Здесь был Riki\").","При использовании Tango, Treant Protector может произнести фразу \"Играть Sorry, friend.\"."],"talents":["Living Armor применяется по области в 700:+350 к радиусу Eyes и Overgrowth","+50 к урону\/лечению от Leech Seed:+2 сек. оцепенения от Nature's Guise","Деревья вырастают за 2 секунды:+90 к урону","-10% перезарядки способностей:+2 блокируемых атаки у Living Armor"],"desc":"Treant Protector — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Nature's Guise, сливает цель заклинания с лесом, делая ее невидимой и дает дополнительную скорость передвижения, если рядом с ней есть дерево. Как только цель отойдет от дерева или это заклинание будет применено на юните, рядом с которым нет деревьев, Nature's Guise рассеется. Treant Protector может применять заклинания и оставаться невидимым под Nature's Guise. Вторая способность, Leech Seed, сажает в тело жертвы истощающее семя, которое замедляет цель и отнимает ее здоровье. Также семя излечивает всех союзников поблизости. Третья способность, Living Armor, защищает выбранного героя или сооружение аурой, увеличивающей регенерацию здоровья. Также дает защиту от любых атак. Заклинание спадает при получении некоторого количества ударов либо после окончания действия. Ультимативная способность, Overgrowth, разрастаются корни и лозы вокруг Trean Protector, опутывая врагов и не давая им перемещаться, телепортироваться, уходить в невидимость или атаковать. Улучшение с Aghanim's Scepter дает новую способность, Eyes In The Forest, позволяющую герою заколдовывать деревья и получать обзор вокруг них. При использовании способности Overgrowth юниты в радиусе от заколдованного дерева будут связаны и получат урон."}