{"abilities":[{"spell":"Бросает бочонок с парализующим порошком, который отскакивает от противников, оглушая их и нанося им урон.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Бочонок летит со скоростью 1000.","Каждый бочонок отскакивает с интервалом в 0.3 секунды.","Бочонок может отскочить на одного и того же персонажа несколько раз, но только тогда, когда рядом с ним присутствует другой персонаж.","Не может отскочить на невидимых, неуязвимых или скрытых персонажей, но может отскочить на юнитов в тумане войны.","Может нанести до 150\/300\/500\/750 ( 225\/400\/625\/900) (100\/150\/200\/250 ( 150\/200\/250\/300) героям) единиц урона одному юниту (до учета сопротивления).","Все отскоки могут нанести до 225\/500\/875\/1350 ( 375\/700\/1125\/1650) (150\/250\/350\/450 ( 250\/350\/450\/550) героям) единиц урона (до учета сопротивления).","Бочонок сначала применяет дебафф, затем наносит урон.","Иллюзии считаются за крипов, когда Рошан и крипы-герои считаются за героев."],"mana":"110\/120\/130\/140","elements":["Нельзя избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Paralyzing Cask","description":["Анимация применения: 0,35+0,37","Дальность применения: 700","Радиус отскока: 575","Количество отскоков: 2\/4\/6\/8 ( 4\/6\/8\/10)","Урон героям: 50","Урон крипам: 75\/100\/125\/150","Длительность оглушения героев: 1","Длительность оглушения крипов: 5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Witch Doctor направляет свои магические способности на лечение ближайших союзников.","effects":["Способность Переключаемая \/ Аура","Действует на Союзников"],"notes":["Voodoo Restoration не прерывает произносимые заклинания при переключении.","Обезвреживание не отключает лечение от Voodoo Restoration, но при этом Witch Doctor также не может отключить эту способность.","Лечит 5.28\/7.92\/10.56\/13.2 ( +0.495% от максимального здоровья) единиц здоровья и расходует 2.64\/3.96\/5.28\/6.6 единиц маны с интервалом в 0,33 секунды спустя 0,33 секунды после переключения.","Лечение предоставлено в виде ауры. Эффект после лечения задерживается на 0.5 секунд."],"mana":"35\/40\/45\/50","elements":["Не провоцирует эффекты своим применением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Voodoo Restoration","description":["Анимация применения: 0+0","Радиус: 500","Потребление маны в секунду: 8\/12\/16\/20","Базовое лечение в секунду: 16\/24\/32\/40","Макс. здоровья в лечение в секунду: 0% ( 1.5%)","Длительность задержки ауры: 0.5"],"hot_key":"W","legacy_key":"V"},{"spell":"Проклинает всех вражеских героев в небольшой области, после чего они получают урон каждую секунду. Помимо этого, каждые 4 секунды им наносится периодический урон, зависящий от количества здоровья, потерянного с момента наложения проклятия.","effects":["Способность Направленная на область","Действует на Вражеских героев","Урон Магический"],"notes":["Проверяет значение текущего здоровья задетых юнитов 4 ( 5) раза, первый - когда проклятье применяется, а остальные - каждые 4 секунды в течение длительности способности.","Урон основан на разнице между текущим здоровьем героя и его здоровье на момент применения проклятья. То есть, чем больше разница между текущим здоровьем и здоровьем после получения дебаффа, тем больше урона проклятье нанесет. И наоборот, чем больше здоровья стало, после применения заклинания, тем меньше урона нанесёт способность. Любое лечение уменьшает урон. Также не имеет значения, как именно персонаж потерял здоровье, так как способность учитывает значение здоровья, а не количество полученного урона. Здесь указано, сколько урона повторно наносится проклятьем из-за потери здоровья в зависимости от того, сколько здоровья было сожжено на каждом уровне способности (до учета сопротивления): 0–3,9 секунды: 48%\/72%\/97%\/121% ( 64%\/97%\/129%\/161%) 3,9–7,9 секунды: 32%\/48%\/64%\/80% ( 48%\/72%\/97%\/121%) 7,9–11,9 секунды: 16%\/24%\/32%\/40% ( 32%\/48%\/64%\/80%) ( 11,9-15,9 секунды: 16%\/24%\/32%\/40%)","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 12 ( 16) раз.","Вместе с сжиганием здоровья способность срабатывает 15 ( 20) раз.","Сжигание здоровья происходит за 0,1 секунды каждый 4-й тик, поэтому здоровье сжигается после 3-го, 7-го и 11-го ( 15-го) тика.","Без остальных источников потери здоровья или лечения Maledict может нанести до 109.9\/249.6\/423.1\/634.8 ( 137.9\/305.6\/507.1\/746.8) единиц урона по юниту (до учета сопротивления).","Дебафф можно наложить на иллюзии и крипов-героев.","Дебафф не накладывается на неуязвимых и скрытых юнитов. Действует на невидимых юнитов."],"mana":"105\/110\/115\/120","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"30\/26\/22\/18","name":"Maledict","description":["Анимация применения: 0,35+0","Дальность применения: 575","Радиус: 180","Урон в секунду: 7\/14\/21\/28","Урон от количества потерянного здоровья: 16%\/24%\/32%\/40%","Интервал нанесения урона: 4","Длительность проклятья: 12 ( 16)"],"hot_key":"E","legacy_key":"E"},{"spell":"призывает смертоносный тотем, атакующий вражеских героев в радиусе 700. Действует 8 секунд.","effects":["Способность Направленная на точку \/ Произносимая","Действует на Вражеских героев","Урон Физический"],"notes":["Death Ward автоматически атакует вражеских героев в пределах своей дальности атаки, используя стандартные правила авто-атаки. При создании вард атакует ближайшего вражеского героя. После этого он следует стандартным правилам авто-атаки. Можно вручную выбрать цель для атаки варда через нажатие правой клавиши мышки в пределах дальности атаки. Отдача приказа на атаку при выбранных Witch Doctor и вард не прервет произнесение. Также можно остановить атаку варда, отдав команду \"стоп\" (работает только при отключенной в настройках авто-атаке).","Атаки варда могут действовать и отскакивать только от героев (включая клонов Meepo и Tempest Double) и иллюзий.","Источником урона является сам Death Ward, а это означает, что эффекты, реагирующие на урон, будут реагировать на вард, а не на самого Witch Doctor (к примеру, Blade Mail).","Основную атаку можно избежать, а также она может промахнуться, предотвращая отскоки снаряда. Не может промахнутся при улучшении Aghanim's Scepter.","При этом после первого отскока вард больше не будет промахиваться, но его атаки все ещё можно избежать. При избегании атаки продолжает считаться отскоком и может отскочить обратно к увернувшемуся герою.","Атаки не отскакивают от невидимых героев и героев в тумане войны. Один снаряд никогда не сможет отскочить дважды от одного и того же юнита.","С базовым временем атаки, равному 0.22, вард может атаковать до 36 раз. С учетом отскоков, добавляемых Aghanim's Scepter, вард может нанести урон 180 раз.","С текущим базовым временем атаки и уроном вард может нанести до 386.4\/613.6\/840.9 ( 727.3\/954.5\/1181.8) единиц урона в секунду в одного героя.","Может нанести до 3060\/4860\/6660 ( 5760\/7560\/9360) единиц урона одному герою (до учета сопротивлений).","При попадании всех атак и отскоков вард может нанести до 3060\/4860\/6660 ( 15300\/24300\/33300) единиц урона (до учета сопротивлений). При выборе таланта, увеличивающего урон, вард может нанести до 5760\/7560\/9360 ( 28800\/37800\/46800) единиц урона (до учета сопротивления).","Урон Death Ward не снижается блокировкой урона.","Дает наземный обзор в радиусе 1200\/800 единиц в месте размещения в течении 5-ти секунд после завершения произнесения."],"mana":"200","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"80","name":"Death Ward","description":["Анимация применения: 0,35+0","Дальность применения: 600","Максимальная длительность произнесения: 8","Радиус отскока: 0 ( 650)","Количество отскоков: 0 ( 4)"],"hot_key":"R","legacy_key":"D"}],"bio":"Вдали ковыляет тонкий силуэт — конечности его свисают, а походка виляет: это колдун неустанно ищет на поле боя слабину, где его умения принесут больше всего пользы и вреда. Неясно, уродилось ли это существо таким или его что-то обезобразило, но никто не усомнится в силах, что держит в себе такой неопрятный каркас. Громко стуча посохом оземь, Жарвакко вышагивает по полю боя, пользуясь внушительным арсеналом амулетов, проклятий, заговоров и заклинаний. В его теле — магические знания, добытые за несколько жизненных циклов на взгорье острова Арктура, и теперь колдун мастерски разит этими знаниями противников. Жарвакко может стать и лучшим другом, и злейшим врагом: он исцеляет союзников, но сеет смерть для тех, кто встаёт у него на пути.","talentsTips":["Талант на броню не дается иллюзиям.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Золото с таланта является ненадёжным."],"trivia":["Witch Doctor очень редко произносит фразу \"Пилюли!\". Она взята из реплик персонажа Louis (Луиса) — героя другой игры корпорации Valve, Left 4 Dead."],"talents":["+75 к урону от Death Ward:+1.5% к макс. лечению от Voodoo Restoration","+1 тик от Maledict:+125 к дальности атаки Death Ward","+120 золота в минуту:+2 отскока у Paralyzing Cask","+6 к броне:+75 к урону"],"desc":"Witch Doctor — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, каждая из которых - активная. Первой способностью, Paralyzing Cask, герой бросает бочонок с парализующим порошком, который отскакивает от противников, оглушая их и нанося им урон. Урон и оглушение для крипов и героев - разные. Второй способностью, Voodoo Restoration, Witch Doctor создаёт небольшую область, в которой все персонажи исцеляются. Третья способность, Maledict, проклинает вражеских героев в небольшой области, после чего они получают урон каждую секунду. Помимо этого, им наносится периодический урон, зависящий от количества здоровья, потерянного с момента наложения проклятия. Ультимативная способность Death Ward, призывает Death Ward, атакующий вражеских героев а радиусе 700. Улучшение с Aghanim's Scepter даёт Death Ward эффект True Strike, позволяющий не промахиваться и не позволять персонажам избежать атаки Death Ward, а также позволяет его атакам отскакивать от вражеских героев."}