{"abilities":[{"spell":"Spirit Breaker фокусируется на враге и кидается в атаку на него, игнорируя препятствия на своем пути. Любой враг, которого он заденет, и цель заклинания попадут под воздействие Greater Bash. Если цель умрет раньше, чем Spirit Breaker добежит до нее, фокус сменится на другую ближайшую цель.","effects":["Способность Направленная на юнита","Действует на Себя \/ Врагов"],"notes":["Увеличивает скорость передвижения Spirit Breaker на указанное значение и позволяет во время разбега превышать лимит скорости. То есть дополнительная скорость от Charge of Darkness не влияет на урон от Greater Bash.","Скорость разгона основана на текущей скорости передвижения героя. Скорость разгона периодически проверяет скорость передвижения и мгновенно под неё адаптируется.","Уходит на перезарядку только в случае завершения или отмены разбега, а не при использовании.","Указатель над целью виден только союзникам.","Пока активна Charge of Darkness, Spirit Breaker проходит сквозь других юнитов и по непроходимой территории.","Разбег отменяется, если Spirit Breaker получил оглушение, проклятие, оцепенение, сон, был спрятан, попал в ураган, под действие страха или гипноза или на него воздействовали принудительным движением.","Разбег не отменяется провокацией. Spirit Breaker начинает атаковать спровоцировавшего его юнита только при остановке разбега. Charge of Darkness не может быть вручную отменен, пока действует провокация.","Игрок может вручную отменить разбег, дав герою команду \"стоп\", \"удерживать позицию\" или приказом с выбором цели. Ненаправленные способности и предметы не отменяют разбег.","Поскольку способность не является произносимым заклинанием, то приказы, поставленные в очередь, не работают и отменяют разбег. Исключением является поставленная в очередь команда патрулирования, в этом случае разбег не отменяется. При этом при завершении разбега Spirit Breaker получит приказ атаковать цель, который перезапишет поставленное в очередь патрулирование.","При включенной автоатаке Spirit Breaker может автоматически атаковать без отмены разбега юнитов, которые будут достаточно близко к нему.","Любой юнит, оказавшийся в радиусе 300 единиц от Spirit Breaker в момент его разбега, получит урон, равный текущему уровню Greater Bash.","Радиус оглушения находится в 20 единицах перед Spirit Breaker, поэтому он может задевать юнитов в 280 единицах перед ним и в 320 единицах позади Spirit Breaker.","Если цель умирает в момент разбега, то способность переключается на ближайшую подходящую цель в радиусе 4000 единиц от предыдущей.","Разбег дает общий обзор на выбранного юнита. Поэтому он продолжает его давать, даже если цель стала невидимой.","Не дает общий обзор при выборе нейтральных крипов.","При завершении разбега разрушает деревья в небольшом радиусе от Spirit Breaker.","Бафф Special Attack применяется при достижении цели и длится 0,1 секунды. Его назначение неизвестно."],"mana":"70\/80\/90\/100","elements":["Нельзя применять в оцепенении.","Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"17\/15\/13\/11","name":"Charge of Darkness","description":["Анимация применения: 0,47+0,5","Дальность применения: Глобальная","Радиус Greater Bash: 300","Скорость при фокусе: 300\/325\/350\/375","Длительность оглушения: 1,2\/1,6\/2\/2,4"],"hot_key":"Q","legacy_key":"C"},{"spell":"Герой увеличивает свои скорость передвижения и сопротивление эффектам, чтобы пробиваться через ряды врагов. Можно применить во время разбега.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["При применении Bulldoze прерывает произносимые заклинания Spirit Breaker."],"mana":"25\/30\/35\/40","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"22 ( 15)","name":"Bulldoze","description":["Анимация применения: 0+0","Доп. скорость передвижения: 14%\/20%\/26%\/32%","Сопротивление эффектам: 34%\/46%\/58%\/70%","Длительность: 8"],"hot_key":"W","legacy_key":"D"},{"spell":"Дает шанс оглушить врага и отбросить его, а также, в случае успешного оглушения, увеличивает скорость передвижения. Наносит дополнительный урон, равный некоторому проценту от скорости передвижения.","effects":["Способность Пассивная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Не сочитается с другими эффектами, дающими оглушающий удар. Оглушение от Skull Basher и Abyssal Blade отключено для Spirit Breaker.","Отбрасывает оглушенных юнитов на 143\/152\/158\/162 единиц за 0,5 секунды со скоростью в 286\/304\/316\/324 единиц. Также подбрасывает затронутых врагов на 50 единиц вверх, образуя небольшую арку. Это действие имеет лишь визуальное значение.","С ограничением скорости передвижения в рамках 100 и 550 единиц минимальный и максимальный возможный урон урон (до учета сопротивления) будет составлять 14\/20\/26\/32 и 77\/110\/143\/176 ( 29\/35\/41\/47 и 159.5\/192.5\/225.5\/258.5).","Урон от Greater Bash наносится отдельным источником, поэтому его нельзя усилить с помощью способностей. То есть он не может быть критическим, прорубающим и от него не работает вампиризм и он считается за урон заклинаний.","Может срабатывать на Рошана, уходя на перезарядку и давая дополнительную скорость передвижения герою, но ни отбрасывание, ни оглушение к Рошану не применяются.","В среднем добавляет к каждой атаке 2.38%\/3.4%\/4.42%\/5.44% от скорости передвижения Spirit Breaker в виде магического урона. В среднем добавляет к каждой атаке 4.93%\/5.95%\/6.97%\/7.99% от скорости передвижения Spirit Breaker в виде магического урона при выборе таланта на дополнительный урон. В среднем добавляет к каждой атаке 5.88%\/8.4%\/10.92%\/13.44% от скорости передвижения Spirit Breaker в виде магического урона при выборе таланта на дополнительный шанс срабатывания. В среднем добавляет к каждой атаке 5.88%\/8.4%\/10.92%\/13.44% от скорости передвижения Spirit Breaker в виде магического урона при выборе двух талантов.","Не работает на варды, строения и союзных юнитов.","Greater Bash использует псевдослучайное распределение."],"mana":"0","elements":["Не может использоваться иллюзиями.","Частично отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"1,5","name":"Greater Bash","description":["Шанс оглушения: 17% ( 42%)","Урон от скорости передвижения: 14%\/20%\/26%\/32% ( 29%\/35%\/41%\/47%)","Продолжительность отбрасывания: 0,5","Длительность оглушения: 0,9\/1,2\/1,5\/1,8"],"hot_key":"E","legacy_key":"T"},{"spell":"Spirit Breaker ускользает в преисподнюю, по возвращении появляясь рядом с жертвой и применяя на нее Greater Bash текущего уровня с дополнительным уроном и отбрасывая жертву вдвое дальше обычного.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Nether Strike не позволяет при использовании избегать снаряды.","В момент задержки перед применением размещает дебафф Nether Strike Vision на цель. Этот дебафф раскрывает модель цели в тумане войны, но не дает на неё эффект True Sight.","Nether Strike мгновенно передвигает Spirit Breaker на противоположную сторону от цели на расстояние в 54 единицы.","Мгновенно применяет к цели Greater Bash текущего уровня. Оглушение применяется до нанесения урона.","Если Greater Bash не изучен, то Nether Strike не будет оглушать цель. Все остальные эффекты способности применяются как обычно.","Spirit Breaker получает приказ атаковать цель. Этот приказ игнорирует настройки автоатаки.","Можно применить на курьера, применяя к нему все эффекты, хоть магический урон наноситься не будет.","Радиус Greater Bash, добавляемый Aghanim's Scepter, закреплен за Spirit Breaker.","Бафф Special Attack размещается после достижения цели и длится 0,1 секунды. Его назначение неизвестно."],"mana":"125\/150\/175","elements":["Нельзя применять в оцепенении.","Частично блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"80\/70\/60 ( 20)","name":"Nether Strike","description":["Анимация применения: 1,2+0","Дальность применения: 700 ( 950)","Радиус Greater Bash: 0 ( 350)","Урон: 120\/185\/250"],"hot_key":"R","legacy_key":"E"}],"bio":"Баратрум — гордое и могущественное существо, яростный первичный разум. В мир материи он пришёл, чтоб участвовать в событиях, отзвуки которых донесутся до его родной первичной вселенной. Сам собрал своё тело Баратрум, и послужит оно ему как в нашем мире, так и за его пределами. Его бренная оболочка черпает силы из нашей вселенной, объединяет она формы быка и обезьяны: рога, копыта и лапы воплощают его силу, скорость и ловкость. Кольцо в носу напоминает Баратруму, что служит он тайному господину и что мир, где трудится он, — лишь тень настоящего бытия.","talentsTips":["Талант на броню не дается иллюзиям.","Талант на ночной обзор не поддается никакому эффекту уменьшения обзора.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Любительское\/альтернативное имя Spirit Breaker было \"Roadrunner\" (\"Марафонец\"), ссылаясь на его бешеную скорость передвижения по карте.","На Латинском языке, \"Barathrum\" означает \"потусторонний\".","His response \"Rampage\" might be a reference to who used to be his equivalent in Heroes of Newerth (most of the HoN hero abilities changed since the port)","При использовании Charge of Darkness, над противником появляется астрологический знак Тельца."],"talents":["+800 к здоровью:+25% к шансу Greater Bash","-7 сек. перезарядки Bulldoze:+15% к урону от Greater Bash","+40 к урону:+12 здоровья в секунду","+5 к броне:+600 к ночному обзору"],"desc":"Spirit Breaker — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Charge of Darkness, фокусируется на враге и кидается в атаку на него, игнорируя препятствия на своем пути. Любой враг, которого он заденет, и цель заклинания попадут под воздействие Greater Bash. Если цель умрет раньше, чем Spirit Breaker добежит до нее, фокус сменится на другую ближайшую цель. Вторая способность, Bulldoze, увеличивает герою скорость передвижения и сопротивление к эффектам. Третья способность, Greater Bash, дает шанс оглушить врага и отбросить его, а также, в случае успешного оглушения, увеличивает скорость передвижения. Наносит дополнительный урон, равный некоторому проценту от скорости передвижения. Ультимативной способностью, Nether Strike, Spirit Breaker ускользает в преисподнюю, по возвращении появляясь рядом с жертвой и применяя на нее Greater Bash текущего уровня с дополнительным уроном. Улучшение с Aghanim's Scepter будет использовать Greater Bash на всех врагов рядом с целью. Также увеличивается дальность применения способности и уменьшается время перезарядки."}