{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Clarity_Replenish.mp3\/revision\/latest?cb=20191227195405",
      "effects": [
        "Ability Target Unit",
        "Affects Allied Heroes"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self.",
        "If the target is more than 500 range away, the caster moves to the target until it is within 250 range before casting. If a cast order is given on a target which is within 500 range already, the caster does not need to move closer and casts it right away.",
        "If a cast order is given on a target which is within 500 range already, the caster does not need to move closer and casts it right away.",
        "Can only target heroes (including illusions) and creep-heroes.",
        "The owner does not have to face the target to use this on it.",
        "Successive casts on the same target do not stack, but refresh the duration instead.",
        "Can regenerate up to 180 mana over its full duration.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan dispels the effect. Does not get dispelled by damage flagged as HP Removal.",
        "Does not get dispelled by damage flagged as HP Removal."
      ],
      "mana": null,
      "abilityName": "Replenish",
      "cooldown": "0",
      "description": "Grants 6 mana regeneration to the target for 30 seconds. If the unit is attacked by an enemy hero or Roshan, the effect is lost.",
      "params": [
        "Default Cast Range: 250",
        "Buffer Cast Range: 500",
        "Mana Regen Bonus: 6",
        "Duration: 30"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks with itself in the inventory, there is no stack limit. The sell value adapts based on the number of instances in a stack.",
    "Clarities are not shareable, however, they can be cast on allies."
  ],
  "cost": "50",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Consumables",
  "name": "Clarity",
  "description": "Clear water that enhances the ability to meditate.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Clarity's effect is dispelled upon taking player damage, so do not use it in the middle of combat. In some situations however, it may be worth it to use it in combat. Even one second of regeneration can be enough to squeeze out one more ability, which can prevent deaths or result in kills.",
    "In some situations however, it may be worth it to use it in combat. Even one second of regeneration can be enough to squeeze out one more ability, which can prevent deaths or result in kills.",
    "Although it regenerates quite a lot of mana, it takes long to do so. It is best used while doing other out-of-combat things, so you do not stand and wait for it to finish regenerating. This makes them perfect for roaming heroes, who can use a Clarity while moving between the lanes, allowing them to roam for longer and not have to retreat to the fountain to refill their mana. They are also great for jungling heroes who can use them while killing neutral creeps.",
    "This makes them perfect for roaming heroes, who can use a Clarity while moving between the lanes, allowing them to roam for longer and not have to retreat to the fountain to refill their mana.",
    "They are also great for jungling heroes who can use them while killing neutral creeps.",
    "Due to its low cost, don't hesitate to buy and use a Clarity on an ally in lane, especially if it will give them enough mana to get off another escape or nuke ability.",
    "You could also buy it for speeding up regenerating mana in your fountain."
  ]
}