{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Aeon_Disk_Combo_Breaker.mp3\/revision\/latest?cb=20191227195346",
      "effects": [
        "Health Threshold: 70%",
        "Incoming Damage Reduction: 100%",
        "Outgoing Damage Reduction: 100%",
        "Status Resistance: 75%",
        "Duration: 2.5"
      ],
      "notes": [
        "Triggers upon taking damage greater than 0 (before reductions) from enemy and allied players. Does not trigger on self-inflicted damage, or on damage flagged as HP Removal.",
        "Does not trigger on self-inflicted damage, or on damage flagged as HP Removal.",
        "Applies a strong dispel on the wielder upon activating. Does not continuously dispel the unit.",
        "Applies generic incoming damage reduction on the wielder. Stacks additively with other sources of generic incoming damage manipulation. This means that sources of generic incoming damage amplification can be used to counter the effect. The reduction affects all damage the wielder takes that is not flagged as HP removal.",
        "This means that sources of generic incoming damage amplification can be used to counter the effect.",
        "The reduction affects all damage the wielder takes that is not flagged as HP removal.",
        "Also applies unique outgoing damage reduction. Stacks multiplicatively with all other sources of outgoing damage manipulation. This means unlike the incoming damage reduction, the outgoing reduction cannot be countered by any outgoing damage amplifiers. The reduction affects all damage the wielder deals, including damage flagged as HP removal.",
        "This means unlike the incoming damage reduction, the outgoing reduction cannot be countered by any outgoing damage amplifiers.",
        "The reduction affects all damage the wielder deals, including damage flagged as HP removal.",
        "Stacks multiplicatively with other sources of status resistance.",
        "The damage instance triggering Combo Breaker is negated. However, if the owner has above 70% health, it is negated so that their health does not drop below 70%.",
        "However, if the owner has above 70% health, it is negated so that their health does not drop below 70%.",
        "Does not prevent instant kill effects.",
        "The cooldown of Combo Breaker is bound to the hero. Purchasing the item again does not reset it."
      ],
      "mana": "0",
      "abilityName": "Combo Breaker",
      "cooldown": "105\/125\/145\/165",
      "description": "When you take damage and your health falls below 70%, a strong dispel is applied and you gain a 2.5 second buff that provides +75% Status Resistance and causes all damage you deal and are dealt to be reduced to zero. Only triggers on player based damage. Cooldown increases every time it triggers.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3000",
  "lore": null,
  "consistFrom": [
    "Vitality Booster",
    "Energy Booster",
    "Recipe"
  ],
  "name": "Aeon Disk",
  "description": "A powerful artifact long ago smuggled out of the Ivory Incubarium. Or so many believe.",
  "trivia": [
    "The item's internal name was Combo Breaker until November 30, 2017 Patch."
  ],
  "upgradeIn": null,
  "tips": [
    "Aeon Disk can be a good choice for tanks, initiators\/counter-initiators or supports who have strong defensive abilities.",
    "Aeon Disk is effective against heroes that rely on ambush and\/or disables followed up by quick, sudden bursts of damage to finish their prey off, wasting their efforts (and possibly lengthy cooldowns), and allowing their target to escape quickly. Such heroes include Nyx Assassin, Skywrath Mage, Necrophos or Templar Assassin. Conversely, heroes that rely on quick bursts of damage may be better off not buying Aeon Disk, as they could waste their own spells upon attempted retaliation. Aeon Disk also provides protection from heroes with strong initiation tools like Earthshaker or Magnus, as (most of) their disable durations will be reduced and their team cannot provide immediate follow-up damage to their initiation.",
    "Conversely, heroes that rely on quick bursts of damage may be better off not buying Aeon Disk, as they could waste their own spells upon attempted retaliation.",
    "Aeon Disk also provides protection from heroes with strong initiation tools like Earthshaker or Magnus, as (most of) their disable durations will be reduced and their team cannot provide immediate follow-up damage to their initiation.",
    "Consider purchasing a Blink Dagger or other mobility items with Aeon Disk, as one can use it during Combo Breaker's duration, allowing a quick escape, provided it has not been disabled beforehand. It can also be used to initiate with, protecting you should you either miss your ability or if there are enemy heroes that you missed.",
    "Summoned units are not affected by the outgoing damage negation by Combo Breaker. Heroes such as Witch Doctor, Shadow Shaman or Lone Druid can still be able to retaliate on their attacker while being briefly protected.",
    "Other protective items like Linken's Sphere or Black King Bar can help delay Combo Breaker's activation in a teamfight, preventing it from being wasted by either a stray spell or a long-distance attack.",
    "The item can save a split pusher from getting killed while being far from his team to run back or teleport to base.",
    "Aeon Disk might not be a good choice against disables that can't be dispelled like Black Hole, Chronosphere, Static Storm, Doom, etc. It can also be dispelled by Nullifier which makes it less effective in the late game.",
    "Techies mines deal full damage while they are under the effect of Combo Breaker."
  ]
}