{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0b\/Boulder_Smash.mp3\/revision\/latest?cb=20140525152219",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "notes": [
        "У Boulder Smash разные правила для выбора цели, основанные на том, кого герой хочет ударить: дальнюю копию, ближайшую копию или юнита.",
        "Удар по дальней копии: Чтобы это сделать, нужно выбрать область на земле. Вокруг этой точки в радиусе 200 единиц должен быть Stone Remnant. Если копия обнаружена, то Earth Spirit шагает напрямую к точке до достижения расстояния до копии в 200 единиц. Остальные копии, которые будут на пути, герой игнорирует. Запущена будет только ближайшая копия к выбранной точке. При достижении копии Earth Spirit ударяет её в направлении, куда он пришел.",
        "Чтобы это сделать, нужно выбрать область на земле. Вокруг этой точки в радиусе 200 единиц должен быть Stone Remnant.",
        "Если копия обнаружена, то Earth Spirit шагает напрямую к точке до достижения расстояния до копии в 200 единиц.",
        "Остальные копии, которые будут на пути, герой игнорирует. Запущена будет только ближайшая копия к выбранной точке.",
        "При достижении копии Earth Spirit ударяет её в направлении, куда он пришел.",
        "Удар по ближайшей копии: Чтобы это сделать, нужно выбрать область на земле. Вокруг этой точки в радиусе 200 единиц может не быть Stone Remnant. Вокруг Earth Spirit в радиусе 200 единиц должен быть Stone Remnant. У Boulder Smash стандартная дальность применения - 2000. Эта дальность позволяет Earth Spirit точно прицелится Stone Remnant. При выборе области, находящейся более чем в 2000 единицах, Earth Spirit будет двигаться до точки, входящей в эту дальность. Если поблизости будет копия, то он её ударит.",
        "Чтобы это сделать, нужно выбрать область на земле. Вокруг этой точки в радиусе 200 единиц может не быть Stone Remnant.",
        "Вокруг Earth Spirit в радиусе 200 единиц должен быть Stone Remnant.",
        "У Boulder Smash стандартная дальность применения - 2000. Эта дальность позволяет Earth Spirit точно прицелится Stone Remnant.",
        "При выборе области, находящейся более чем в 2000 единицах, Earth Spirit будет двигаться до точки, входящей в эту дальность. Если поблизости будет копия, то он её ударит.",
        "Удар по юниту: Чтобы это сделать, нужно выбрать непосредственно юнита. Между выбранным существом и Earth Spirit не должно быть копии. Earth Spirit будет двигаться до достижения расстояния в 150 единиц и ударяет её в направлении, куда он пришел. Если на пути к цели Earth Spirit будет копия, то герой запустит её напрямую к выбранному юниту.",
        "Чтобы это сделать, нужно выбрать непосредственно юнита.",
        "Между выбранным существом и Earth Spirit не должно быть копии.",
        "Earth Spirit будет двигаться до достижения расстояния в 150 единиц и ударяет её в направлении, куда он пришел.",
        "Если на пути к цели Earth Spirit будет копия, то герой запустит её напрямую к выбранному юниту.",
        "Замедление применяется ко всем вражеским существам в радиусе запущенного Stone Remnant. Запущенное существо не замедляет и не замедляется.",
        "Урон наносится всем вражеским существам в радиусе запущенного Stone Remnant или юнита.",
        "При использовании запущенный враг также мгновенно получает урон. Запущенные союзники урона не получают.",
        "Запущенные существа не обезвреживаются в момент отбрасывания и могут свободно действовать. Не прерывает произнесение заклинаний.",
        "Boulder Smash сначала наносит урон, затем применяет отбрасывающий дебафф. Запущенные копии сначала наносят урон, затем применяют замедляющий дебафф.",
        "Нельзя применять к древним крипам.",
        "Может передвигать существ и Stone Remnants через непроходимую территорию.",
        "Разрушает деревья при столкновении с ними выбранных существ или Stone Remnant."
      ],
      "mana": "22\/18\/14\/10",
      "item_behaviour": [],
      "name": "Boulder Smash",
      "cooldown": "100",
      "description": "Герой бьёт по указанному врагу или союзнику, отталкивая его в ту сторону, в которую смотрит. Если способность применить на область, герой ударит ближайшую каменную копию в радиусе 200. Оттолкнутый объект наносит урон всем врагам, по которым попадает. Каменные копии летят дальше и замедляют всех жертв на пути.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения на юнитов: 150",
        "Дальность применения на камень: 200",
        "Радиус урона и замедления: 180",
        "Урон: 105\/170\/235\/300",
        "Скорость отталкивания: 900",
        "Дальность отталкивания юнитов: 480\/600\/680\/800",
        "Дальность отталкивания камней: 2000",
        "Замедление скорости передвижения: 60%",
        "Длительность замедления камнем: 1,25\/2,5\/3,25\/4"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/42\/Rolling_Boulder.mp3\/revision\/latest?cb=20141127011119",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Катится со скоростью в 800 единиц и всегда проходит полную дистацию в случае, если не сталкивается с вражеским героем.",
        "Когда герой прокатывается через Stone Remnant, его скорость удваивается, а общая дистанция увеличивается до 1600 (TagTalent 2250). Длительность оглушения также увеличивается до 0,8\/1,2\/1,6\/2 (TagTalent 1,4\/1,8\/2,2\/2,6).",
        "Длительность оглушения также увеличивается до 0,8\/1,2\/1,6\/2 (TagTalent 1,4\/1,8\/2,2\/2,6).",
        "Оглушение применяется ко всем вражеским существам (за исключением курьера) на пути, а не только к героям.",
        "Rolling Boulder сначала наносит урон, затем применяет дебафф.",
        "В момент переката на Earth Spirit действует оцепенение и обезоруживание, поэтому он не может двигаться, использовать блинк или атаковать. Остальные способности и предметы можно использовать как обычно, за исключением Rolling Boulder, которую нельзя повторно использовать в момент переката.",
        "Остальные способности и предметы можно использовать как обычно, за исключением Rolling Boulder, которую нельзя повторно использовать в момент переката.",
        "При столкновении с вражеским героем Earth Spirit возникает в 80 единицах от него с противоположной от позиции стороны столкновения.",
        "Не действует на неуязвимых существ и героев. Не может столкнутся с неуязвимыми героями. Полностью действует на невидимых юнитов.",
        "Может передвинуть Earth Spirit через непроходимую территорию. При столкновении разрушает деревья вокруг Earth Spirit.",
        "Rolling Boulder отменяется при получении Earth Spirit оглушения, сна, проклятия или попадании им в ураган. Несмотря на то, что Rolling Boulder отменяется, Earth Spirit все равно появляется позади вражеского героя, если тот был на его пути, как в случае, если Earth Spirit достиг героя без отмены.",
        "Несмотря на то, что Rolling Boulder отменяется, Earth Spirit все равно появляется позади вражеского героя, если тот был на его пути, как в случае, если Earth Spirit достиг героя без отмены.",
        "Принудительное движение отменяет Rolling Boulder только в случае, если оно обезвреживающее.",
        "Необезвреживающее принудительное движение не отменяет способность в неподвижном состоянии, но перезаписывает движение при применении в движении."
      ],
      "mana": "16\/12\/8\/4",
      "item_behaviour": [],
      "name": "Rolling Boulder",
      "cooldown": "50",
      "description": "Герой сворачивается в валун, который после задержки в 0,6 сек. катится в выбранном направлении, наносит урон врагам и оглушает их. Он остановится, если попадёт во вражеского героя или будет оглушён. Валун станет сильнее, если попадёт на каменную копию: он покатится быстрее и дальше, а оглушение от него будет дольше.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения: 3000",
        "Радиус эффекта и столкновения: 160",
        "Задержка эффекта: 0,6",
        "Базовая дистанция: 800 ( 1125)",
        "Дистанция с камнем: 1600 ( 2250)",
        "Урон: 70\/80\/90\/100 ( 190\/200\/210\/220)",
        "Длительность оглушения: 0,4\/0,6\/0,8\/1 ( 1\/1,2\/1,4\/1,6)",
        "Доп. длительность оглушения камнем: 0,4\/0,6\/0,8\/1"
      ],
      "legacy_key": "F",
      "story": "Используя свою связь с землей, Каолин притягивает к себе камни, образуя защитный шар, в котором он может перекатываться на небольшие расстояния."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/15\/Frozen_Sigil_cast.mp3\/revision\/latest?cb=20141126122459",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов ",
        "Урон: Магический"
      ],
      "notes": [
        "При выборе точки на земле в радиусе 180 единиц от нее притягивается Stone Remnant.",
        "Если копий нет, ничего не происходит. Заклинание не используется.",
        "Чтобы притянуть юнита, нужно выбрать его напрямую. Не может выбрать союзных героев без изучения необходимого таланта. Считает крипов-героев за крипов.",
        "Безмолвие применяется ко всем вражеским существам в радиусе притянутого Stone Remnant. Притянутое существо не получает урон и не наносит его.",
        "Урон наносится всем вражеским существам в радиусе притянутого Stone Remnant. Притянутое существо не получает урон и не наносит его.",
        "Выбранные существа не обезвреживаются при притягивании. Они могут поворачиваться, атаковать, использовать заклинания и предметы.",
        "То есть способностью нельзя прерывать произносимые заклинания цели.",
        "Geomagnetic Grip не притягивает цель, если на неё действует Black Hole, Chronosphere, Duel или Flaming Lasso. В двух последних случаях герой не притянет цель, даже если на неё действует Enchant Remnant.",
        "В двух последних случаях герой не притянет цель, даже если на неё действует Enchant Remnant.",
        "Притянутая копия сначала применяет дебафф, затем наносит урон.",
        "При использовании на союзников или Stone Remnants под действием Boulder Smash удар прерывается.",
        "Может передвигать существ и Stone Remnants через непроходимую территорию.",
        "При притягивании разрушает деревья в радиусе 200 единиц вокруг выбранного юнита."
      ],
      "mana": "13",
      "item_behaviour": [],
      "name": "Geomagnetic Grip",
      "cooldown": "100",
      "description": "Earth Spirit притягивает каменную копию к себе. Враги, в которых попадет цель заклинания, будут обезмолвлены, а также получат урон, если цель — каменная копия.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения: 1100",
        "Радиус: 180",
        "Урон от камня: 50\/100\/150\/200",
        "Скорость притягивания камня: 1000",
        "Скорость притягивания юнита: 600",
        "Длительность безмолвия: 2\/2,5\/3\/3,5 ( 5\/5,5\/6\/6,5)"
      ],
      "legacy_key": "R",
      "story": "Подобное притягивается подобным. Ничто не устоит перед зовом Каолина - даже минералы в крови и костях живых существ."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Stone_Remnant.mp3\/revision\/latest?cb=20140525152232",
      "effects": [
        "Способность: Направленная на точку"
      ],
      "notes": [
        "Эта способность является врожденной и её не надо изучать.",
        "Earth Spirit начинает игру со всеми 7 зарядами.",
        "Двойной щелчок на способность размещает Stone Remnant в 100 единицах перед Earth Spirit.",
        "Можно разместить до 11 копий, если разместить все 7 одновременно, а затем устанавливать новую через каждые 25 секунд восстановления заряда.",
        "Копии нельзя чем-либо атаковать или разрушить. Они разрушаются только Rolling Boulder, Magnetize или при истечении длительности.",
        "При использовании Magnetize копии остаются на 8 секунд до разрушения. Rolling Boulder разрушает их мгновенною",
        "Вражеский Rubick может использовать те же копии, что и Earth Spirit, при краже его заклинаний.",
        "Stone Remnants видны всем игрокам через туман войны.",
        "Враги также могут увидеть и услышать через туман войны следующие эффекты: Удар по Stone Remnants с помощью Boulder Smash. Поглощение Stone Remnants Rolling Boulder для увеличения дальности движения. Притягивание Stone Remnants с помощью Geomagnetic Grip.",
        "Удар по Stone Remnants с помощью Boulder Smash.",
        "Поглощение Stone Remnants Rolling Boulder для увеличения дальности движения.",
        "Притягивание Stone Remnants с помощью Geomagnetic Grip."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Stone Remnant",
      "cooldown": null,
      "description": "Создаёт свою каменную копию в указанном месте, расходуя один заряд способности, которые постепенно восстанавливаются. Копии не раскрывают туман войны, они неуязвимы и используются для других способностей героя.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 1100",
        "Длительность копии: 120",
        "Число зарядов: 7",
        "Время восстановления заряда: 25"
      ],
      "legacy_key": "E",
      "story": "Каолин взывает к остаткам каменной армии, погребенной вместе с ним в темных объятиях земли."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/82\/Magnetize.mp3\/revision\/latest?cb=20141127011032",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Проверяет наличие поблизости Stone Remnant каждые 0,5 секунды спустя 0,5 секунды после использования.",
        "Если копия найдена около затронутого юнита, Magnetize начнет распространяться по врагам в радиусе 600 единиц от копии.",
        "Если на врага в радиусе уже действует Magnetize, то дебафф на нем обновится.",
        "Наносит 20\/40\/60 единиц урона с интервалом в 0,5 секунды спустя 0,5 секунды после использования.",
        "После распространения Magnetize Earth Spirit может использовать Stone Remnant еще 8 секунд до их разрушения.",
        "Без обновления длительности Magnetize может нанести до 240\/480\/720 единиц урона каждому затронотому существу (до учета сопротивления).",
        "Дебафф Magnetize может размещаться и распространятся от невидимых и неуязвимых юнитов, но не от или на скрытых существ и курьеров.",
        "Число, отсчитывающее длительность, видно над всеми намагниченными врагами. Оно видно только союзникам. Обновление длительности с помощью копии также сбросит таймер.",
        "Обновление длительности с помощью копии также сбросит таймер."
      ],
      "mana": "100\/90\/80",
      "item_behaviour": [],
      "name": "Magnetize",
      "cooldown": "100",
      "description": "Намагничивает существ в небольшой области вокруг себя, из-за чего они несколько секунд получают периодический урон. Если намагниченный герой приблизится к каменной копии, она выпустит мощный разряд, применяя эту способность на всех врагов вокруг и запуская её заново, и уничтожится спустя несколько секунд. Это может повторяться по нескольку раз. Если вражеский герой замедлен или обезмолвлен способностями Rolling Boulder или Geomagnetic Grip, то эффект передастся остальным намагниченным героям.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,01+0",
        "Радиус: 350",
        "Радиус поиска камня: 400",
        "Радиус обновления камня: 600",
        "Урон в секунду: 40\/80\/120",
        "Длительность: 6"
      ],
      "legacy_key": "T",
      "story": "Откликаясь на зов Каолина, минералы в крови и костях его врагов восстают против тел, в которых они находятся."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4a\/Enchant_Remnant.mp3\/revision\/latest?cb=20141127011143",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "notes": [
        "Требуется Aghanim's Scepter для разблокировки.",
        "Можно использовать только на союзных и вражеских героев, включая их иллюзии. Можно использовать на иллюзии Earth Spirit, но не на самого героя. Считает крипов-героев за крипов.",
        "Дает эффект True Sight на цель на всю длительность.",
        "Заколдованный герой полностью обезврежен, неуязвим и реагирует на заклинания Earth Spirit как обычный Stone Remnant. Boulder Smash: Заколдованные герои отбрасываются назад на расстояние в 2000 единиц, замедляя и нанося урон при столкновении с врагами. Rolling Boulder:Заколдованные герои усиливают движение. Earth Spirit не сталкивается с ними и преждевременно завершает окаменение. Geomagnetic Grip: Заколдованные герои притягиваются со скоростью в 1000 единиц и наносят урон. Можно притягивать заколдованных врагов. Magnetize: Заколдованные герои получают, обновляют и распространяют Magnetize, если находятся в радиусе поиска камня.",
        "Boulder Smash: Заколдованные герои отбрасываются назад на расстояние в 2000 единиц, замедляя и нанося урон при столкновении с врагами.",
        "Rolling Boulder:Заколдованные герои усиливают движение. Earth Spirit не сталкивается с ними и преждевременно завершает окаменение.",
        "Geomagnetic Grip: Заколдованные герои притягиваются со скоростью в 1000 единиц и наносят урон. Можно притягивать заколдованных врагов.",
        "Magnetize: Заколдованные герои получают, обновляют и распространяют Magnetize, если находятся в радиусе поиска камня.",
        "Если зачаровывание завершается в момент удара от Boulder Smash, юнит продолжит двигаться на всю дистанцию, но перестанет оглушать существ вокруг себя. Если зачаровывание завершается при ударе, то враги получат урон, но не оглушатся.",
        "Если зачаровывание завершается при ударе, то враги получат урон, но не оглушатся.",
        "Если зачаровывание завершается в момент притягивания от Geomagnetic Grip, то юнит продолжит притягиваться на высокой скорости, но прекратит наносить урон.",
        "Урон по области наносится всем врагам, а не только героям."
      ],
      "mana": "45",
      "item_behaviour": [],
      "name": "Enchant Remnant",
      "cooldown": "150",
      "description": "Earth Spirit на время заколдовывает героя, делая из него каменную копию. Через 3 секунды копия раскалывается, выпуская героя и нанося урон противникам поблизости.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 125",
        "Радиус урона: 300",
        "Урон: 300",
        "Длительность: 3"
      ],
      "legacy_key": "W",
      "story": "Каолин использует силу земли, на время покрывая живых существ камнем, чтобы призвать их в свою погребённую каменную армию."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.8,
    "attrStrength": 22.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 2.4,
    "attrAgility": 17.0
  },
  "description": "+0,6 сек. оглушения от Rolling Boulder +25% к урону от заклинаний +3 сек. безмолвия от Geomagnetic Grip Geomagnetic Grip действует на союзников +120 к урону от Rolling Boulder +15 к урону в секунду от Magnetize +3 сек. действия Magnetize +325 к дальности Rolling Boulder",
  "history": "Глубоко среди скал и утёсов Повершья есть заброшенный рудокопами разрез, где давным-давно добывали священный нефрит. Когда-то из этого редкого материала вырезали изваяние великого генерала Каолина, и легло оно во главе могилы десяти тысяч каменных воинов: солдатов и священников, шутов и акробатов — мастера высекли великое множество статуй и на веки вечные опустили их в тёмные объятья почвы. Но не знали ремесленники, что разрез тот был необыкновенным: в нём обитал дух самой земли, единый с планетой. Долго копилась мощь в нефритовом изваянии, отрезанном от живительного источника, и спустя тысячу лет оно проложило себе путь на поверхность. Теперь вновь рождённый великий Каолин путешествует по дорогам Повершья, борясь во имя духа земли и при нужде призывая остатки великой армии, что и по сей день сокрыта в любящих объятьях земляной толщи."
}