{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Ghost_Scepter_Ghost_Form.mp3\/revision\/latest?cb=20191227195419",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "Turns the user ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance.",
        "Reduces most heroes' total magic resistance to -5%, assuming basic 25% magic resistance and no other sources of magic resistance.",
        "Ghost Form's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.",
        "Shares cooldown with Ethereal Blade."
      ],
      "mana": "0",
      "abilityName": "Ghost Form",
      "cooldown": "20",
      "description": "You enter ghost form for 4 seconds, becoming immune to physical damage, but are unable to attack and 40% more vulnerable to magic damage.",
      "params": [
        "Magic Resistance Reduction: 40%",
        "Duration: 4",
        "Can be cast while spell immune. However, the buff gets immediately removed if spell immunity is detected."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 100 health, 0.5 health regen, 0.83 armor, 5 attack speed, 60 mana, 0.25 mana regen and 5 attack damage.",
    "For agility heroes, it grants 100 health, 0.5 health regen, 0.83 armor, 5 attack speed, 60 mana, 0.25 mana regen and 5 attack damage.",
    "For intelligence heroes, it grants 100 health, 0.5 health regen, 0.83 armor, 5 attack speed, 60 mana, 0.25 mana regen and 5 attack damage."
  ],
  "cost": "1500",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Miscellaneous",
  "name": "Ghost Scepter",
  "description": "Imbues the wielder with a ghostly presence, allowing them to evade physical damage.",
  "trivia": null,
  "upgradeIn": [
    "Ethereal Blade"
  ],
  "bonuses": [
    "+5 Strength",
    "+5 Agility",
    "+5 Intelligence"
  ],
  "tips": [
    "Use Ghost Scepter after baiting an enemy carry to attack you, causing them to waste time switching between targets.",
    "Try to keep track of the cooldown on enemy nuke abilities. Think twice before using Ghost Scepter if you believe that a powerful magical nuke, such as Finger of Death, has not yet been used."
  ]
}