{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Шанс в 50% применить Anchor Smash при атаке",
          "talentRight": "+1 сек. оглушения от Ravage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+4 к снижению брони от Gush",
          "talentRight": "+30 к блокируемому урону у Kraken Shell"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−20% к урону врагов от Anchor Smash",
          "talentRight": "+120 к урону от Gush"
        },
        {
          "talentLvl": "10",
          "talentLeft": "−100 к границе урона у Kraken Shell",
          "talentRight": "+10% к замедлению от Gush"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/40\/Tidehunter_Gush_1.mp3\/revision\/latest?cb=20191216025132",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на точку)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд от Gush движется со скоростью в 2500. С максимальной дальности применения снаряд долетает за 0.28 сек.",
        "С максимальной дальности применения снаряд долетает за 0.28 сек.",
        "Gush сначала применяет дебафф, затем наносит урон.",
        "С Aghanim's Scepter Gush выпускает большую волну вместо снаряда, действующего на одиночную цель. Волна всегда преодолевает всё расстояние. При выборе существа волна выпускается в его сторону. При этом оно не считается за начальную точку волны. Улучшенная волна движется со скоростью в 1500 вместо базовой скорости в 2500, преодолевая всё расстояние за 1.47 сек. Волна поражает существ на расстоянии до 2460 единиц (складывается из дальности прохождения и радиуса). Волна действует на невидимых врагов и врагов в тумане войны. Дает наземный обзор в радиусе 200 единиц вокруг каждого задетого врага на 2 секунды. Сама волна не дает обзора. Для улучшенной волны используется второй звуковой эффект.",
        "При выборе существа волна выпускается в его сторону. При этом оно не считается за начальную точку волны.",
        "Улучшенная волна движется со скоростью в 1500 вместо базовой скорости в 2500, преодолевая всё расстояние за 1.47 сек.",
        "Волна поражает существ на расстоянии до 2460 единиц (складывается из дальности прохождения и радиуса).",
        "Волна действует на невидимых врагов и врагов в тумане войны.",
        "Дает наземный обзор в радиусе 200 единиц вокруг каждого задетого врага на 2 секунды.",
        "Сама волна не дает обзора.",
        "Для улучшенной волны используется второй звуковой эффект."
      ],
      "mana": "100\/105\/110\/115",
      "item_behaviour": [],
      "name": "Gush",
      "cooldown": "12 (TagTalent 11,88) (TagTalent 7, 6,93)",
      "description": "Призывает водяной поток, наносящий противникам урон и уменьшающий их скорость передвижения и броню. Эффект длится секунды.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,6",
        "Дальность применения: 700 (TagAghanim 2200)",
        "Урон: 110\/160\/210\/260 (TagTalent 230\/280\/330\/380)",
        "Снижение брони: 4\/5\/6\/7 (TagTalent 8\/9\/10\/11)",
        "Снижение скорости передвижения: 40%",
        "Длительность: 4",
        "Дальность прохождения волны: 2200",
        "Радиус волны: 260",
        "Уменьшает перезарядку, а также делает способность направляемой на точку. Она подействует на всех врагов на своём пути.",
        "Замедление и снижение брони остаются, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется при попадании. Не блокируется при улучшении."
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Tidehunter_Kraken_Shell.mp3\/revision\/latest?cb=20191216025135",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Снижение урона представлено блокировкой урона, а снятие дебаффов - сильным развеиванием. Снижение урона всегда активно и не связано с границей урона для снятия дебаффов. Блокировка урона игнорирует урон от вардов (TagTalent Plague Ward, Mass Serpent Ward, Death Ward и т.д.). Не снижает физический урон от заклинаний за исключением Moon Glaives и The Swarm.",
        "Снижение урона всегда активно и не связано с границей урона для снятия дебаффов.",
        "Блокировка урона игнорирует урон от вардов (TagTalent Plague Ward, Mass Serpent Ward, Death Ward и т.д.).",
        "Не снижает физический урон от заклинаний за исключением Moon Glaives и The Swarm.",
        "При подсчете полученного урона учитывается только нанесенный источниками, подконтрольными игроку (после уменьшений).",
        "Счетчик урона сбросится, если Tidehunter не получает урон от игроков в течение 6 сек.",
        "Если Kraken Shell сработает от способности, наносящей урон до дебаффа (например, Storm Hammer), то развеивание применится к Tidehunter до применения дебаффа.",
        "Срабатывание развеивания отмечается звуковым эффектом и частицами воды на коже Tidehunter."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Kraken Shell",
      "cooldown": null,
      "description": "Утолщает шкуру героя, блокируя часть физического урона. Когда полученный урон достигает определенного предела, способность сбрасывает все отрицательные эффекты. Эффект не сочетается с другими предметами, блокирующими физический урон.",
      "hot_key": "W",
      "params": [
        "Шанс срабатывания блокировки урона: 100%",
        "Блок урона: 18\/30\/42\/54 (TagTalent 48\/60\/72\/84)",
        "Граница урона: 600\/550\/500\/450",
        "Время перезарядки: 6",
        "У иллюзий работает блокировка урона, но не эффект развеивания."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Tidehunter_Anchor_Smash.mp3\/revision\/latest?cb=20191216025130",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Позволяет Tidehunter совершать мгновенные атаки по всем врагам в радиусе действия. На эти атаки могут сработать модификаторы, за исключением прорубания. Они обладают эффектом True Strike и игнорируют обезоруживание.",
        "На эти атаки могут сработать модификаторы, за исключением прорубания. Они обладают эффектом True Strike и игнорируют обезоруживание.",
        "Снижает только базовый урон и урон, даваемый основным атрибутом задетых существ. Дополнительный урон не снижается.",
        "Способность сначала применяет дебафф, затем активирует мгновенную атаку.",
        "Действует на древних крипов, но не на Рошана.",
        "С Aghanim's Shard Anchor Smash также действует на постройки. Не действует на варды.",
        "Не действует на варды."
      ],
      "mana": "30\/40\/50\/60",
      "item_behaviour": [],
      "name": "Anchor Smash",
      "cooldown": "7\/6\/5\/4 (TagTalent 6,93\/5,94\/4,95\/3,96) (TagTalent 6\/5\/4\/3, 5,94\/4,95\/3,96\/2,97)",
      "description": "Взмах могучего якоря наносит противникам вокруг урон, равный увеличенной атаке героя, и уменьшает урон от их атак.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0,3",
        "Радиус: 375",
        "Доп. урон: 45\/90\/135\/180 (TagTalent 135\/180\/225\/270)",
        "Снижение урона: 30%\/40%\/50%\/60% (TagTalent 50%\/60%\/70%\/80%)",
        "Длительность: 6",
        "Уменьшает перезарядку на 1 секунду. Способность действует на постройки и наносит на 90 урона больше."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Tidehunter_Ravage_1.mp3\/revision\/latest?cb=20191216025128",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Щупальца расходятся в стороны со скоростью в 725.",
        "Задетые существа подбрасываются вверх на 350 единиц на базовые 0,5 секунды оглушения.",
        "Пока задетые существа находятся в воздухе, то другие могут под ними проходить.",
        "Урон наносится при приземлении, а не при поражении.",
        "Эффект от Ravage расходится кольцом шириной в 250 единиц от места использования с заданной скоростью. То есть существа в радиусе 250 единиц поражаются мгновенно. Кольцу требуется 1,38 секунды, чтобы покрыть оставшееся расстояние. Также эффект можно избежать, телепортировавшись в расширяющееся кольцо после применения.",
        "То есть существа в радиусе 250 единиц поражаются мгновенно.",
        "Кольцу требуется 1,38 секунды, чтобы покрыть оставшееся расстояние.",
        "Также эффект можно избежать, телепортировавшись в расширяющееся кольцо после применения."
      ],
      "mana": "150\/225\/325",
      "item_behaviour": [],
      "name": "Ravage",
      "cooldown": "150 (TagTalent 148,5)",
      "description": "Сотрясает землю и выпускает во все стороны щупальца, нанося всем врагам вокруг урон и оглушая их.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,57",
        "Радиус: 1250",
        "Ширина шупальца: 250",
        "Урон: 200\/300\/400",
        "Длительность оглушения: 2,4\/2,6\/2,8",
        "Пытается нанести урон, если уже задетые враги получили иммунитет к заклинаниям до приземления."
      ],
      "legacy_key": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 27.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.5,
    "attrAgility": 15.0
  },
  "description": "Tidehunter — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Gush, призывает водяной поток, наносящий противникам урон и уменьшающий их скорость и броню. Пассивная способность, Kraken Shell, покрывает Tidehunter защитным покрытием, блокирующим часть физического урона. Когда полученный урон достигает определенного предела, способность сбрасывает все негативные эффекты. Второй способностью, Anchor Smash, Tidehunter вращает якорь, нанося урон окружающим его противникам и уменьшая наносимый ими урон. Ультимативная способность, Ravage, сотрясает землю, выпуская во все стороны щупальца, нанося при этом урон и оглушая рядом стоящих вражеских юнитов.",
  "history": "Когда-то Левиафан был защитником Затонувших островов, но намерения его народа крайне расплывчаты. Все мы знаем о том, как для жителей суши важны морские торговые пути и как борьба за открытые воды воздвигает и низвергает целые империи. Куда меньше нам известно о подводных маршрутах, о враждующих племенах мерансской общины, образовавших поселения в бесчисленных подводных стычках. В хрупком перемирии меж сушей и мерансами мы едва ли можем оценить размах морских империй, и политика их сложна и смутна. Вполне возможно, что Левиафан устал от мелочных распрей и стал жить отдельно, преданный лишь своему глубоководному богу Мэльрону Щупальцеликому. Теперь он рыскает по мелководью в поисках людей и мерансов, смеющих перейти ему дорогу, — и в особенности не жалует одного кладдского адмирала, вражда с которым древна и загадочна, как самые глубокие морские впадины.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Шанс в 50% применить Anchor Smash при атаке",
      "talentRight": "+1 сек. оглушения от Ravage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+4 к снижению брони от Gush",
      "talentRight": "+30 к блокируемому урону у Kraken Shell"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−20% к урону врагов от Anchor Smash",
      "talentRight": "+120 к урону от Gush"
    },
    {
      "talentLvl": "10",
      "talentLeft": "−100 к границе урона у Kraken Shell",
      "talentRight": "+10% к замедлению от Gush"
    }
  ]
}