{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/94\/Bloodthorn.mp3\/revision\/latest?cb=20160518071900",
      "effects": [
        "Дальность применения: 900",
        "Усиление урона: 30%",
        "Шанс крита: 100%",
        "Критический урон: 130%",
        "Длительность: 5"
      ],
      "notes": [
        "Не увеличивает урон непосредственно в момент нанесения, а сохраняет все значения урона и наносит 30% от него через 5 секунд после применения. То есть урон можно избежать, получив иммунитет к заклинаниям, став неуязвимым или исчезнув под конец действия дебаффа.",
        "То есть урон можно избежать, получив иммунитет к заклинаниям, став неуязвимым или исчезнув под конец действия дебаффа.",
        "Урон наносится сразу после окончания дебаффа. При этом развеивание не наносит его. Повторное наложение Soul Burn на цель обновить длительность дебаффа. Это действие отложит урон и даст больше времени для его нанесения по цели. Урон начисляется последнему герою наложившему Soul Burn на цель.",
        "Повторное наложение Soul Burn на цель обновить длительность дебаффа.",
        "Это действие отложит урон и даст больше времени для его нанесения по цели.",
        "Урон начисляется последнему герою наложившему Soul Burn на цель.",
        "Учитывает только магический, физический и чистый тип урона (после всех уменьшений). Другие источники потери здоровья не учитываются.",
        "Применяет эффект точности к цели, позволяя всем атакам не промахиваться при наличии эффектов уклонения или ослепления.",
        "Критический удар применяется только к атакам, запущенным в выбранного героя. К ранее запущенным атакам эффект не применяется. И наоборот, снаряды, запущенные во время действия дебаффа, все равно будут критическими даже после его завершения.",
        "И наоборот, снаряды, запущенные во время действия дебаффа, все равно будут критическими даже после его завершения.",
        "Делит перезарядку с Orchid Malevolence."
      ],
      "mana": "100",
      "abilityName": "Soul Rend",
      "cooldown": "15",
      "description": "Запрещает выбранной цели использовать способности на 5 сек. По окончании эффекта жертве наносится магический урон в размере 30% от урона, полученного за время действия. По цели невозможно промахнуться, а все атаки по ней с вероятностью в 100% наносят 130% урона.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Уменьшение урона заклинаний: 35%",
        "Длительность: 6"
      ],
      "notes": [
        "Несколько атак с Mage Slayer не усиливают эффект, но обновляют его длительность.",
        "Сначала применяется негативный эффект, после наносится урон от атаки.",
        "Уменьшает любой тип урона от заклинаний жертвы, поэтому влияет на магический, физический и чистый урон заклинаний. Не взаимодействует со способностями, которые не поддаются усилению, например Damage Return и Moon Glaives.",
        "Не взаимодействует со способностями, которые не поддаются усилению, например Damage Return и Moon Glaives.",
        "Не работает на варды, постройки и союзных существ.",
        "Сочетается по закону убывающей полезности с другими источниками усиления заклинаний."
      ],
      "mana": null,
      "abilityName": "Mage Slayer",
      "cooldown": null,
      "description": "Атакуемые вами враги наносят на 35% меньше урона заклинаниями. Действует 6 сек.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6800",
  "lore": null,
  "consistFrom": [
    "Orchid Malevolence",
    "Mage Slayer",
    "Recipe"
  ],
  "name": "Bloodthorn",
  "description": "Этот ненавистный клинок топит врага в агонии, впиваясь в тело извивающейся жертвы всё сильнее и сильнее с каждым ее движением.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}