{
  "abilities": [
    {
      "notes": [
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Axe's magic resistance to 34%.",
        "Increases Axe's magic resistance to 34%."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+100 Battle Hunger DPS",
          "talentRight": "+100 Berserker's Call AoE"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 Health Regen",
          "talentRight": "+150 Culling Blade Threshold"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 Counter Helix Damage",
          "talentRight": "+25 Movement Speed"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+12% Magic Resistance",
          "talentRight": "+1.5 Mana Regen"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Axe_Berserker%27s_Call.mp3\/revision\/latest?cb=20191216010834",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Taunts affected enemies, forcing them to attack Axe. Does not silence, so active attack modifiers with Autocast on are still applied. Affects invisible units and units in the Fog of War. Does not affect towers, wards, invulnerable or hidden units. Does not affect lane creeps from the very first creep wave that spawns, until they meet the opposing creeps in the lane.",
        "Does not silence, so active attack modifiers with Autocast on are still applied.",
        "Affects invisible units and units in the Fog of War. Does not affect towers, wards, invulnerable or hidden units.",
        "Does not affect lane creeps from the very first creep wave that spawns, until they meet the opposing creeps in the lane.",
        "When cast on a unit under the taunt effect of Berserker's Call refreshes the duration.",
        "When Axe dies, the taunt ends immediately.",
        "With Aghanim's Scepter, Battle Hunger of its current level is applied to all enemies within 300 (TagTalent 400) radius."
      ],
      "mana": "80\/90\/100\/110",
      "item_behaviour": [],
      "name": "Berserker's Call",
      "cooldown": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "description": "Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.4+0.5",
        "Radius: 300 (TagTalent 400)",
        "Armor Bonus: 30",
        "Duration: 2\/2.4\/2.8\/3.2",
        "Berserker's Call applies Battle Hunger to affected units. Reduces Berserker's Call cooldown by 3."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Axe_Battle_Hunger.mp3\/revision\/latest?cb=20191216010833",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Magical"
      ],
      "notes": [
        "Reduces non-hero units' movement speed by 6%\/6.5%\/7%\/7.5% and armor by 3.5. Battle Hunger treats creep-heroes as creeps.",
        "Battle Hunger treats creep-heroes as creeps.",
        "Battle Hunger has a passive modifier that is present at all times, but hidden when the stack count is at 0. This modifier gains 1 stack for every affected creep, and 2 for every affected hero. Each stack grants Axe 6%\/6.5%\/7%\/7.5% movement speed and 3.5 armor. This means each affected hero effectively grants Axe 12%\/13%\/14%\/15% movement speed and 7 armor. This modifier has no stack limit.",
        "This modifier gains 1 stack for every affected creep, and 2 for every affected hero.",
        "Each stack grants Axe 6%\/6.5%\/7%\/7.5% movement speed and 3.5 armor.",
        "This means each affected hero effectively grants Axe 12%\/13%\/14%\/15% movement speed and 7 armor.",
        "This modifier has no stack limit.",
        "Casting Battle Hunger multiple times on the same target does not stack, but refreshes the duration instead.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in 12 instances.",
        "Can deal up to 192\/288\/384\/480 (TagTalent 1392\/1488\/1584\/1680) damage (before reductions) when lasting its full duration.",
        "The debuff can be removed by killing any unit that is not an illusion, in any way. This includes buildings, wards, and denying allied units. The affected unit itself has to make the kill to remove the debuff. Summons or illusions owned by the same player do not remove it when they make a kill.",
        "The affected unit itself has to make the kill to remove the debuff. Summons or illusions owned by the same player do not remove it when they make a kill.",
        "Leveling up Battle Hunger does not update the damage of already placed debuffs. However, the damage upgrading talent immediately upgrades all current active Battle Hunger debuffs.",
        "However, the damage upgrading talent immediately upgrades all current active Battle Hunger debuffs."
      ],
      "mana": "50\/60\/70\/80",
      "item_behaviour": [],
      "name": "Battle Hunger",
      "cooldown": "20\/15\/10\/5",
      "description": "Enrages an enemy unit, causing it to be slowed and take damage over time until it kills another unit or the duration ends. Axe gains movement speed for each unit affected with Battle Hunger, half speed from creeps.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 700\/775\/850\/925",
        "Damage per Second: 16\/24\/32\/40 (TagTalent 116\/124\/132\/140)",
        "Enemy Move Speed Slow: 12%\/13%\/14%\/15%",
        "Self Move Speed Bonus per Affected Enemy: 12%\/13%\/14%\/15%",
        "Non-Hero Speed Multiplier: 0.5",
        "Duration: 12",
        "Enemy Armor Reduction: 7",
        "Self Armor Bonus per Affected Enemy: 7",
        "Battle Hunger also reduces enemy armor by 7 and grants Axe 7 armor per affected targeted.",
        "Slow persists, and attempts to damage if debuff was placed before spell immunity and when not dispelled."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8e\/Axe_Counter_Helix.mp3\/revision\/latest?cb=20191216010823",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Can only proc when an enemy unit lands an attack on Axe, regardless of distance. This means it cannot proc on missed attacks.",
        "Can proc on the secondary attacks from other instant attacks. Secondary attacks from Moon Glaives, Death Ward, Split Shot and Flak Cannon cannot trigger Counter Helix. Cannot proc on attacks from buildings, wards and allies.",
        "Secondary attacks from Moon Glaives, Death Ward, Split Shot and Flak Cannon cannot trigger Counter Helix.",
        "Cannot proc on attacks from buildings, wards and allies.",
        "Despite the visual effects, the damage is applied instantly within the radius.",
        "Counter Helix uses pseudo-random distribution.",
        "Counter Helix does not use a regular cooldown. It is neither displayed on the ability icon when proccing, nor is it affected by cooldown manipulating effects.",
        "With Aghanim's Shard, Counter Helix places one debuff on enemies within its radius. This debuff gets stronger when it gets refreshed with successive procs. The debuff can stack up to 5 times. A number on the icon shows the current number of stacks. Successive procs refresh the entire stack's duration. Can reduce an enemy's attack damage by 20%\/40%\/60%\/80%\/100% with each amount of stacks. Reduces hit enemies' total attack damage, including raw attack damage bonuses.",
        "The debuff can stack up to 5 times. A number on the icon shows the current number of stacks.",
        "Successive procs refresh the entire stack's duration.",
        "Can reduce an enemy's attack damage by 20%\/40%\/60%\/80%\/100% with each amount of stacks.",
        "Reduces hit enemies' total attack damage, including raw attack damage bonuses."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Counter Helix",
      "cooldown": null,
      "description": "When attacked, Axe has a chance to perform a helix counter attack, dealing pure damage to all nearby enemies.",
      "hot_key": "E",
      "params": [
        "Radius: 275",
        "Proc Chance: 17%\/18%\/19%\/20% (TagTalent 27%\/28%\/29%\/30%)",
        "Damage: 60\/100\/140\/180 (TagTalent 90\/130\/170\/210)",
        "Max Stacks: 5",
        "Attack Damage Reduction per Stack: 20%",
        "Stacks Duration: 6",
        "Counter Helix now applies a stacking -20% Attack Damage debuff for 6s to enemies hit by it. Increases Counter Helix Chance by 10%.",
        "If Break is applied by an attack, Counter Helix may trigger first on that attack before getting disabled.",
        "Axe illusions have a fully functional Counter Helix."
      ],
      "legacy_key": "X",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Axe_Culling_Blade_1.mp3\/revision\/latest?cb=20191216010823",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical \/ Instant Kill"
      ],
      "notes": [
        "When the target's health is above the threshold, it deals its regular magical damage to the target and plays a different sound. Even when the target dies to the regular damage (possible with damage amplifications), the other bonuses of Culling Blade are not granted.",
        "Even when the target dies to the regular damage (possible with damage amplifications), the other bonuses of Culling Blade are not granted.",
        "When the target's health is below the 250\/350\/450 (TagTalent 400\/500\/600) threshold, it does the following: It deals pure damage, flagged as HP Removal, to the target equal to the health threshold value. It applies the movement and attack speed bonus to Axe and nearby allies. If the target was a hero, clone or illusion, its cooldown gets reset.",
        "It deals pure damage, flagged as HP Removal, to the target equal to the health threshold value.",
        "It applies the movement and attack speed bonus to Axe and nearby allies.",
        "If the target was a hero, clone or illusion, its cooldown gets reset.",
        "The target's health is checked upon reaching the cast point, so if it gained health during that time so it exceeds the health threshold, Culling Blade fails.",
        "Culling Blade is able to kill targets affected by Shallow Grave, False Promise, Borrowed Time and Battle Trance but not Wraith Delay.",
        "The jungle weapon gesture modifier is responsible for the sound and animation used by Fists of Axe Unleashed."
      ],
      "mana": "60\/120\/180",
      "item_behaviour": [],
      "name": "Culling Blade",
      "cooldown": "75\/65\/55",
      "description": "Axe spots a weakness and strikes, instantly killing an enemy unit with low health, or dealing moderate damage otherwise. When an enemy hero is killed with Culling Blade, its cooldown is reset, and Axe and nearby allied units gain bonus movement speed.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 150",
        "Kill Move Speed Bonus Radius: 900",
        "Damage: 150\/250\/300",
        "Kill Health Threshold: 250\/350\/450 (TagTalent 400\/500\/600)",
        "Kill Move Speed Bonus: 30%",
        "Kill Attack Speed Bonus: 30",
        "Kill Bonus Buff Duration: 6"
      ],
      "legacy_key": "C",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 25.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.2,
    "attrAgility": 20.0
  },
  "description": "Mogul Khan, the Axe, is a melee strength hero, infamous for creating chaos in battle and thriving off of it.",
  "history": "As a grunt in the Army of Red Mist, Mogul Khan set his sights on the rank of Red Mist General. In battle after battle he proved his worth through gory deed. His rise through the ranks was helped by the fact that he never hesitated to decapitate a superior. Through the seven year Campaign of the Thousand Tarns, he distinguished himself in glorious carnage, his star of fame shining ever brighter, while the number of comrades in arms steadily dwindled. On the night of ultimate victory, Axe declared himself the new Red Mist General, and took on the ultimate title of 'Axe.' But his troops now numbered zero. Of course, many had died in battle, but a significant number had also fallen to Axe's blade. Needless to say, most soldiers now shun his leadership. But this matters not a whit to Axe, who knows that a one-man army is by far the best.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+100 Battle Hunger DPS",
      "talentRight": "+100 Berserker's Call AoE"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 Health Regen",
      "talentRight": "+150 Culling Blade Threshold"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 Counter Helix Damage",
      "talentRight": "+25 Movement Speed"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+12% Magic Resistance",
      "talentRight": "+1.5 Mana Regen"
    }
  ]
}