{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7f\/Manta_Style_Mirror_Image.mp3\/revision\/latest?cb=20191227195454",
      "effects": [
        "Время разделения: 0,1",
        "Количество иллюзий: 2",
        "Наносимый иллюзиями урон (TagAghanimближний бой): 33%",
        "Наносимый иллюзиями урон (TagAghanimдальний бой): 28%",
        "Получаемый иллюзиями урон: 300%",
        "Длительность иллюзий: 20"
      ],
      "notes": [
        "При применении на игрока действует неуязвимость, исчезновение и иммунитет к заклинаниям во время разделения.",
        "При применении позволяет избегать снаряды и применяет к владельцу базовое развеивание.",
        "После разделения заклинатель появляется со своими иллюзиями. Место появления основано на позиции при применении: один из юнитов появляется на месте использования, а остальные — на севере, западе, юге или востоке от этой точки. Расстояние между существами составляет 108, если размер столкновения героя равен 24, и 72 — если размер столкновения равен 8. Поскольку порядок появления всегда одинаков, то заклинатель и иллюзии занимают случайную позицию и смотрят в одну сторону.",
        "Место появления основано на позиции при применении: один из юнитов появляется на месте использования, а остальные — на севере, западе, юге или востоке от этой точки.",
        "Расстояние между существами составляет 108, если размер столкновения героя равен 24, и 72 — если размер столкновения равен 8.",
        "Поскольку порядок появления всегда одинаков, то заклинатель и иллюзии занимают случайную позицию и смотрят в одну сторону.",
        "Отдаёт заклинателю команду остановки после времени разделения, отменяя все приказы в очереди и приказы отданные во время разделения. Также останавливает все нацеленные приказы другим существам, которые были отданы до применения Mirror Image.",
        "Также останавливает все нацеленные приказы другим существам, которые были отданы до применения Mirror Image.",
        "При применении даёт наземный обзор в радиусе 1000 единиц на 0,1 сек.",
        "Повторное применение заменит иллюзии, находящиеся под контролем заклинателя."
      ],
      "mana": "125",
      "abilityName": "Mirror Image",
      "cooldown": "30",
      "description": "Создаёт 2 иллюзии вашего героя, которые существуют 20 сек. Иллюзии ближнего боя наносят 33% урона, а иллюзии дальнего боя наносят 28% урона. Иллюзии получают 300% урона.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4600",
  "lore": null,
  "consistFrom": [
    "Yasha",
    "Ultimate Orb",
    "Recipe"
  ],
  "name": "Manta Style",
  "description": "Топор, созданный из отражающих материалов, которые вызывает смятение во вражеских рядах.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}