{"abilities":[{"spell":"Drenches an area in sticky oil, amplifying damage from Batrider's attacks and abilities and slowing the movement speed and turn rate of enemies in the area. Additional casts of Sticky Napalm continue to increase damage, up to 10 stacks. The extra damage is halved against creeps.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Applies a debuff to enemies inside the area. Leaving or entering the area afterwards has no effect.","Each cast refreshes the duration of the whole stack while adding one more instance.","The debuff slows and causes the damage. It also shows the amount of current Sticky Napalm stacks on the target.","Affected units also have a number above them, showing the amount of stacks. This number is only visible to Batrider and his allies, however, they require vision over the target to see it.","Can slow movement speed for up to 30%\/50%\/70%\/90%. One stack is enough to apply the 70% turn rate slow.","Can deal up to 100\/150\/200\/250 (50\/75\/100\/125 to creeps) damage per triggering damage instance (before reductions).","Sticky Napalm triggers on any damage instance caused by Batrider, except from Orb of Venom, Radiance, Spirit Vessel, Urn of Shadows and damage with the no-reflection flag.","Batrider himself has to cause the damage. Other units under his control do not trigger Sticky Napalm.","Sticky Napalm deals its damage in a separate damage instance, right after the triggering damage.","Provides 400 radius flying vision at the targeted point upon cast for 2 seconds."],"mana":"20","elements":["Does not pierce spell immunity."],"cooldown":"3 ( 2.55)","name":"Sticky Napalm","description":["Cast Animation: 0.2+0","Cast Range: 550\/600\/650\/700","Effect Radius: 375","Max Stacks: 10","Hero Damage per Stack: 10\/15\/20\/25","Creep Damage per Stack: 5\/7.5\/10\/12.5","Move Speed Slow per Stack: 3%\/5%\/7%\/9%","Turn Rate Slow: 70%","Stack Duration: 8"],"hot_key":"Q","legacy_key":"C"},{"spell":"Hurls an explosive cocktail that explodes when it reaches the target location, knocking back, and dealing damage over time to enemies in the area.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Flamebreak travels at a speed of 900 until reaching the targeted point.","The projectile has 175 radius flying vision. This vision does not last.","The knockback is not a set distance. It pushes every enemy so they are 400 range away from the center of the targeted area. So the minimum knockback distance is 25.","The knockback duration is always 0.25, so the speed varies between 100 and 1600, depending on the knockback distance.","Enemies are not disabled during the knockback, and are, besides moving, able to act freely during it.","Can push units over impassable terrain. Any tree a knocked back unit collides with gets destroyed.","Applies a debuff to the affected targets upon projectile impact which deals damage in 1 second intervals, starting 1 second after it is placed, resulting in 4\/5\/6\/7 ( 6\/7\/8\/9) instances.","Can deal up to 100\/150\/210\/280 ( 150\/210\/280\/360) damage (before reductions).","The burn debuff from successive casts fully stacks.","Choosing the duration upgrading talent does not update the duration of already placed Flamebreak damage debuffs.","Does not affect Roshan."],"mana":"110\/120\/130\/140","elements":["Does not pierce spell immunity."],"cooldown":"17 ( 4)","name":"Flamebreak","description":["Cast Animation: 0.2+0.63","Cast Range: 1500","Effect Radius: 375","Damage per Second: 25\/30\/35\/40","Max Knockback Distance: 400","Knockback Duration: 0.25","Damage Duration: 4\/5\/6\/7 ( 6\/7\/8\/9)"],"hot_key":"W","legacy_key":"R"},{"spell":"Batrider takes to the skies, laying down a trail of flames from the air. The fire damages any enemies it touches, and destroys trees below Batrider. While flying, Batrider gains unobstructed movement and vision.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Firefly interrupts Batrider's channeling spells upon cast.","Temporarily turns Batrider into a flying unit, allowing him to fly over impassable terrain, units and buildings and have flying vision.","The entire spell effect lasts 15 ( 23) seconds, meaning when the duration ends, the entire flame trail disappears at once as well.","Damage is dealt to every enemy unit which comes within 200 radius of the fire trail.","Deals 5\/15\/25\/35 damage in 0.4 or 0.5 seconds intervals, starting 0.1 seconds after cast, the first interval is 0.4 seconds, the rest are 0.5 seconds, resulting in 31 ( 47) damage instances.","Can deal up to 155\/465\/775\/1085 ( 235\/705\/1175\/1645) damage to a single unit (before reductions) when it stays in range for the full duration.","During Firefly, every tree within 100 radius of Batrider is destroyed.","The fire trails from successive casts fully stack. Each cast creates its buff with its own fire trail.","When Batrider dies during Firefly, the already existing fire on the ground still stays for the remaining duration. The buffs remain visible in the HUD, and are now only responsible for keeping the already existing fire up. This means when respawning before they expire, they do not make Batrider fly again or make him leave fire behind again.","During Firefly, Batrider can neither trigger nor take damage from Proximity Mines.","Choosing the duration upgrading talent does not affect any of Batrider's currently ongoing Firefly instances.","Does not affect Roshan."],"mana":"125","elements":["Cannot be used by illusions.","Does not pierce spell immunity."],"cooldown":"40\/38\/36\/34 ( 34\/32.3\/30.6\/28.9)","name":"Firefly","description":["Cast Animation: 0+0","Damage Radius: 200","Damage per Second: 10\/30\/50\/70","Movement speed bonus: 4%\/7%\/10%\/13%","Duration: 15 ( 23)"],"hot_key":"E","legacy_key":"E"},{"spell":"Lassoes an enemy and drags them in Batrider's wake. Victims cannot be dragged over impassable terrain. Dragged units cannot move, attack, or use abilities. Teleporting or blinking will break the lasso.","effects":["Ability Target Unit","Affects Enemies ( Enemy Heroes)","Damage Magical"],"notes":["Flaming Lasso fully disables the target for its duration.","Drags the targeted unit with a 300 distance behind Batrider. Despite the description, can drag the target over impassable terrain.","If Batrider teleports a distance greater than 425, the lasso breaks.","If the target gets teleported any distance (even a 0 range teleport is enough), the lasso breaks.","Flaming Lasso overrides every other position changing effect, making only teleports able to break the lasso.","The lasso also breaks when either Batrider or the target dies. Casting Dismember or Walrus Kick on the lasso target breaks the lasso as well.","Batrider is disarmed during Flaming Lasso. The disarm either lasts 3\/3.5\/4 seconds, or until the lasso is broken, whichever is shorter.","Deals damage in 1 second intervals, starting immediately upon cast, with a total of 3\/3\/4 instances. Can deal up to 60\/120\/240 damage per target (before reductions).","Cannot be cast on, but can drag invulnerable and hidden units.","Can be cast on Roshan, but he is neither disabled nor dragged ( nor damaged). Batrider is still disarmed.","It is possible to have multiple units lassoed at the same time (e.g. by using Refresher Orb).","Aghanim's Scepter causes the closest allied hero (including creep-heroes and illusions) of the target within a 450 range to get lassoed as well. It does not lasso any non-hero units. The secondary target is bound to the first, so it is dragged after it, at the same distance as the primary target is dragged behind Batrider. This means the secondary target is dragged 600 distance behind Batrider. The secondary lasso is independent from the primary. When the primary lasso is broken, its target can act freely while the secondary target remains being dragged by it."],"mana":"225","elements":["Partially blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"100\/90\/80 ( 85\/76.5\/68)","name":"Flaming Lasso","description":["Cast Animation: 0.2+0.63","Cast Range: 100","Secondary Target Search Radius: 0 ( 450)","Break Distance: 425","Damage per Second: 20\/40\/60","Duration: 3\/3.5\/4"],"hot_key":"R","legacy_key":"F"}],"bio":"There is no such thing as harmony among the creatures of the Yama Raskav Jungle. By bite, or claw, or pincer, or hoof, even the slightest sign of weakness means a swift death. They say the Rider was just a lad cutting chaff in his family's field when he was taken, swept up by a massive morde-bat looking for take-out. But this boy had a better idea, and wriggled his way from his captor's grip, onto the beast's back, and hacked it down with his tools. Emerging from the bloody wreckage and intoxicated by the thrill of flight, the boy realized he'd found his calling. The boy grew, and every summer he'd return to his family's field, often setting out into the bush seeking to reclaim that first thrill of facing death in the form of jaws or a fatal fall. The years went on, but his fire only grew stronger. He studied the overgrowth, plunging deeper with each expedition, until finally he found his way to the caves at the heart of hostility. They say the Rider, on the eve of a scorching summer night, had nothing but a rope, a bottle of liquid courage and a burning determination to feel the skies once more, when he plunged inside....","talentsTips":["The armor talent does not benefit illusions.","The health talent increases maximum health capacity, and keeps the current health percentage.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."],"trivia":["Batrider is occasionally referred to as \"Batman\" in game, mostly due to the recent popularity of Christopher Nolan's Dark Knight trilogy starring Christian Bale and Gary Oldman.","In DotA, Batrider's full name was \"Jin'zakk, the Batrider\". In Dota 2, his name was removed for unspecified reasons.","After killing Faceless Void, Batrider says \"Hey Void! Have you seen Bat to the Future?\", which is a reference to the film \"Back to The Future\"","Batrider's concept may well be based on Project X-Ray, a military strategy developed during World War II which involved using bats equipped with small, timed, napalm-like incendiaries to decimate towns (See Alexis C. Madrigal's \"Old, Weird Tech: The Bat Bombs of World War II,\" in The Atlantic, 14 April 2011)."],"talents":["-13s Flamebreak Cooldown:+8s Firefly Duration","+40 Movement Speed:15% Cooldown Reduction","+300 Health:+2s Flamebreak Burn Duration","+5 Armor:+6% Spell Amplification"],"desc":"Batrider is a ranged intelligence hero who excels at initiation and harassing enemies. He is a mobile raider, capable of dealing enormous amounts of damage albeit he must close in on targets to pull it off. Batrider begins by spraying areas with Sticky Napalm, a stacking debuff useful for hindering enemies or gaining vision. In order to get a better view he activates Firefly, leaving a burning trail of liquid fire that scorches those who dare cross his path. Now able to cross through previously impassable terrain Batrider has free reign to decide how to continue his reign of terror. If he's feeling generous he'll hurl an explosive clocktail as a parting shot. More often, he seizes victims with Flaming Lasso and drags them back through his burning trail to the clutches of merciless allies. Used properly, Batrider is a fearsome hero constantly risking his own safety to incite fiery chaos and destruction."}