{"abilities":[{"spell":"Выплескивает в выбранную область вязкое масло, которое увеличивает урон от всех атак и способностей героя. Масло замедляет передвижение и поворот врагов. Эффект от масла складывается до 10 раз. Дополнительный урон по крипам уменьшается вдвое.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Применяется на всех врагов в области применения. Покидание или возвращение в область применения после использования не даст никакого эффекта.","Каждое повторное применение обновляет длительность зарядов и добавляет дополнительный.","Дебафф замедляет и наносит урон. Также показывается, сколько зарядов Sticky Napalm уже действует на цель.","Над юнитами под действием способности отображается число, показывающее количество зарядов. Число видно только Batrider и его союзникам, но союзникам для этого нужен обзор на цель.","Может снизить скорость передвижения до 30%\/50%\/70%\/90%. Одного заряда достаточно для снижения скорости поворота до 70%.","Может нанести до 100\/150\/200\/250 (крипам до 50\/75\/100\/125) единиц урона за все применения (до учета сопротивления).","Увеличивает весь урон, который наносит герой, за исключением урона от Orb of Venom, Radiance, Spirit Vessel, Urn of Shadows и неотражаемых способностей.","Batrider должен сам наносить урон, другие юниты под его контролем не активируют срабатывание Sticky Napalm.","Sticky Napalm наносит урон как отдельный источник, сразу после урона, активировавшего срабатывание способности.","Дает летающий обзор в радиусе 400 единиц на 2 секунды."],"mana":"20","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"3 ( 2.55)","name":"Sticky Napalm","description":["Анимация применения: 0,2+0","Дальность применения: 700","Радиус: 375","Максимально эффектов: 10","Доп. урон героям за эффект: 10\/15\/20\/25","Доп. урон крипам за эффект: 5\/7.5\/10\/12.5","Замедление передвижения за эффект: 3%\/5%\/7%\/9%","Замедление скорости поворота: 70%","Длительность: 8"],"hot_key":"Q","legacy_key":"C"},{"spell":"Кидает бутылку горючей смеси, которая взрывается в указанном месте и отталкивает всех врагов в области действия, после чего им наносится периодический урон.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Flamebreak летит со скоростью 900 единиц, пока не достигнет точки применения. Траектория снаряда видна противникам.","Снаряд дает летающий обзор в 175 единиц, пока летит.","У отбрасывания нет фиксированного расстояния. Оно толкает каждого врага на расстоянии 400 единиц от центра точки применения, поэтому минимальное расстояние может быть в 25 единиц.","Длительность отбрасывания всегда равна 0.25, поэтому скорость отбрасывания может варьироваться от 100 до 1600 в зависимости от дальности отбрасывания.","Враги не обезвреживаются при отбрасывании, поэтому могут в этот момент свободно двигаться.","Способность может толкать юнитов на непроходимую местность. Любое дерево, стоящее на пути отброшенного юнита, разрушается.","Накладывает дебафф на цели, на которых сработал снаряд, нанося урон спустя 1 секунду после применения с интервалом в 1 секунду, срабатывая 4\/5\/6\/7 ( 6\/7\/8\/9) раз.","Может нанести до 100\/150\/210\/280 (150\/210\/280\/360) единиц урона (до учета сопротивления).","Эффект горения при нескольких применениях Flamebreak складывается.","Выбор таланта на увеличение длительности горения не обновляет длительность уже примененного эффекта от Flamebreak.","Не работает на Рошана."],"mana":"110\/120\/130\/140","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"17 ( 4)","name":"Flamebreak","description":["Анимация применения: 0,2+0,63","Дальность применения: 1500","Радиус эффекта: 375","Урон в секунду: 25\/30\/35\/40","Макс. расстояние отбрасывания: 400","Длительность отбрасывания: 0.25","Длительность урона: 4\/5\/6\/7 ( 6\/7\/8\/9)"],"hot_key":"W","legacy_key":"R"},{"spell":"Герой поднимается в воздух, оставляя за собой огненный след. Огонь наносит урон врагам и уничтожает деревья. Во время полёта герой имеет свободное передвижение и обзор.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Применение Firefly прерывает чтение заклиний.","Временно превращает Batrider в летающего юнита, позволяя ему перелетать через непроходимые территории, юнитов и строения и давая ему летающий обзор.","Огненный след от способности работает 18 ( 26) секунд, то есть при завершении действия весь огонь сразу пропадет.","Урон наносится каждому вражескому юниту в радиусе 200, если он пройдет по огненной дорожке.","Наносит 5\/15\/25\/35 урона с интервалом в 0,4 или 0,5 секунды спустя 0,1 секунды после применения; первый интервал составляет 0,4 секунды, следующие - 0,5 секунду, срабатывая 37 ( 53) раз.","Может нанести до 185\/555\/925\/1295 ( 265\/795\/1325\/1855) единиц урона единичной цели (до учета сопротивления), если цель остается в огненной дорожке всё время действия способности.","Пока действует Firefly, деревья в радиусе 100 единиц вокруг Batrider разрушаются.","Несколько применений огненных дорожек складываются. Каждое применение создает отдельную дорожку.","Огненный след остается на все время действия способности даже после смерти героя.","При полете с помощью Firefly Batrider не получает урона от сработавших Proximity Mines.","Выбор таланта на увеличение длительности не работает на уже существующие огненный дорожки.","Не работает на Рошана."],"mana":"100","elements":["Не может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"40 ( 34)","name":"Firefly","description":["Анимация применения: 0+0","Радиус: 200","Урон в секунду: 10\/30\/50\/70","Длительность: 18 ( 26)"],"hot_key":"E","legacy_key":"E"},{"spell":"Захватывает врага в огненное лассо, не давая ему атаковать, двигаться или использовать способности. Жертву можно перетаскивать за собой, однако нельзя затянуть на непроходимую территорию. Телепортация или использование Blink Dagger разорвёт лассо.","effects":["Способность Направленная на юнита","Действует на Врагов ( Вражеских героев)","Урон Магический"],"notes":["Flaming Lasso полностью обезвреживает цель на всё время действия.","Тащит выбранного юнита на расстоянии 300 единиц позади Batrider. Вопреки описанию, может затащить цель на непроходимую территорию.","Если Batrider телепортируется на расстояние, превышающее 400 единиц, лассо порвется.","Если цель телепортируют на любое расстояние, равное или превышающее 0 единиц, лассо порвется.","Flaming Lasso прерывается другими способностям, дающие эффект принудительного движения, поэтому только телепортация может разорвать лассо.","Flaming Lasso также перестает действовать в случае, если Batrider или цель умирают. Использование Dismember и Walrus Kick на цель лассо также разрывает его.","Batrider обезврежен, пока действует Flaming Lasso. Обезвреживание действует 3\/3.5\/4 секунды или до разрыва лассо, в зависимости от того, что случится быстрее.","Наносит урон с интервалом в 1 секунду сразу после применения, нанося урон до 3\/3\/4 раз. Может нанести до 60\/120\/240 урона цели (до учета снижений).","Нельзя применить, но можно передвигать неуязвимых и скрытых юнитов.","Можно применить на Рошана, но на него не сработает ни обезвреживание, ни перемещение (а урон от не наносится); при этом Batrider будет обезврежен.","Можно связать несколько юнитов в одно и то же время (используя, к примеру, Refresher Orb).","Aghanim's Scepter привязывает ближайшего союзного для цели героя (включая крипов-героев и иллюзии) к изначальной цели на расстоянии 400 единиц. Не действует на юнитов-не-героев. Вторичная цель привязывается к первичной, двигаясь за ней на том же расстоянии, что и первичная цель за Batrider. То есть, вторичная цель находится в 600 единицах позади Batrider. Второе лассо не зависит от состояния первого. При разрыве первого лассо первичная цель можно свободно перемещать привязанную к ней вторичную цель."],"mana":"225","elements":["Частично блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"100\/80\/60 ( 85\/68\/51)","name":"Flaming Lasso","description":["Анимация применения: 0,2+0,63","Дальность применения: 100","Радиус поиска вторичной цели: 0 ( 400)","Дальность разрыва: 400","Урон в секунду: 20\/40\/60","Длительность: 3\/3.5\/4"],"hot_key":"R","legacy_key":"F"}],"bio":"Среди тварей, обитающих в джунглях Йама Раскав, такой вещи, как гармония, попросту нет. Любое проявление слабости приведет к мгновенной смерти от клювов, когтей, жвал или копыт. Поговаривают, что давным-давно, когда Batrider еще был простым пареньком, выкапывающим сорняки с семейного поля, его схватила огромная летучая мышь, искавшая себе пищу. Но у парня были другие планы, и, вырвавшись из лап хищника, он вскарабкался на спину зверя и зарубил его своими инструментами. Выбравшись из кровавых ошметков, пьяный от ощущения полета, мальчик осознал, что нашел свое призвание. Он рос и каждое лето выходил на то же поле, частенько лез в кусты в поиске тех же ощущений, которые он испытывал, стоя на пороге смерти от падения либо острых клыков. Годы шли, но пламя в его душе разгоралось только сильнее. Он исследовал заросли, забираясь все глубже и глубже с каждым своим походом, пока, наконец, не нашел путь к пещерам — самому сердцу враждебности. Легенда гласит, что той знойной ночью всадник имел с собой только веревку, бутылку жидкой отваги и собственную решимость, когда, мечтая почувствовать небеса снова, прыгнул внутрь...","talentsTips":["Талант на броню не дается иллюзиям.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["В оригинальной DotA имя героя было Джин'закк","Убив Faceless Void, Batrider говорит: Играть \"Hey Void! Have you seen Bat to the Future?\", что созвучно к названию фильма Back To The Future (Назад в будущее).","Batrider is occasionally referred to as \"Batman\" in game, mostly due to the recent popularity of Christopher Nolan's Dark Knight trilogy starring Christian Bale and Gary Oldman."],"talents":["-13 сек. к перезарядке Flamebreak:+8 сек. к длительности Firefly","+40 к скорости передвижения:-15% перезарядки способностей","+300 к здоровью:+2 сек. к длительности горения от Flamebreak","+5 к броне:+6% к урону от способностей"],"tips":["В оригинальной DotA имя героя было Джин'закк","Убив Faceless Void, Batrider говорит: Играть \"Hey Void! Have you seen Bat to the Future?\", что созвучно к названию фильма Back To The Future (Назад в будущее).","Batrider is occasionally referred to as \"Batman\" in game, mostly due to the recent popularity of Christopher Nolan's Dark Knight trilogy starring Christian Bale and Gary Oldman."],"desc":"Batrider — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность Sticky Napalm позволяет Batrider выплескивать на землю вязкое масло, которое увеличивает урон от всех атак и способностей Batrider. Масло замедляет скорость передвижения и поворота врагов. Эффект от масел складывается до 10 раз, продолжая увеличивать урон. Второй способностью Flamebreak герой кидает бутылку с коктейлем, которая взрывается, достигнув указанного места, отталкивая и ненадолго оглушая всех врагов в области действия, после чего им наносится периодический урон. Третья способность Firefly поднимает в воздух Batrider, оставляя за собой огненный след. Огонь уничтожает деревья и наносит урон врагам. Во время полета Batrider имеет свободное передвижение и обзор. Ультимативная способность Flaming Lasso захватывает вражеского героя в огненное лассо, не давая ему атаковать, двигаться и использовать способности. Batrider может перетаскивать жертву по своему усмотрению, однако не может затянуть ее на непроходимую территорию. Телепортация или использование Blink Dagger прервет заклинание."}