{"abilities":[{"spell":"Skywrath Mage выпускает во врага медленный заряд магической энергии, который наносит урон, зависящий от уровня интеллекта мага.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Заряд летит со скоростью в 500 единиц.","Проверяет интеллект Skywrath Mage при запуске снаряда.","Это значит, что урон снаряда устанавливается при запуске и не меняется при потере или получении интеллекта.","Здесь указано, сколько урона наносит Arcane Bolt с определенным количеством интеллекта, включая усиление заклинаний (до учета сопротивления): 25 интеллекта (1-ый уровень): 102\/122\/142\/163 единиц урона 45 интеллекта (6-ой уровень): 136\/157\/177\/198 единиц урона 70 интеллекта (12-ый уровень): 180\/201\/222\/243 единиц урона 94 интеллекта (18-ый уровень): 224\/246\/267\/288 единиц урона 123 интеллекта (25-ый уровень): 279\/301\/322\/344 единиц урона","Снаряд дает летающий обзор в радиусе 325 единиц пока летит.","Также дает летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания.","С Aghanim's Scepter при использовании способности выбирается другая случайная цель в радиусе поиска для второго Arcane Bolt. Радиус поиска закреплен за начальной целью, а не Skywrath Mage. Поскольку снаряд использует радиус поиска, а не дальность применения способности, то на него не влияет способности, меняющие дальность (к примеру, Aether Lens). У героев и иллюзий приоритет выше, чем у остальных юнитов. Считает крипов-героев за крипов. Талант добавляет к способности третью цель, выбирающуюся по тем же правилам, что и второй снаряд."],"mana":"90","elements":["Нельзя избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"5\/4\/3\/2","name":"Arcane Bolt","description":["Анимация применения: 0,1+0,9","Дальность применения: 875","Радиус поиска вторичной цели: 0 ( 700) ( 700)","Количество целей: 1 ( 2) ( 2, 3)","Базовый урон: 60\/80\/100\/120","Множитель урона от интеллекта: 160%"],"hot_key":"Q","legacy_key":"C"},{"spell":"Skywrath Mage делает выстрел на дальнюю дистанцию, который бьет по ближайшему вражескому герою. При попадании наносит урон и замедляет всех попавших в область действия врагов.","effects":["Способность Ненаправленная","Действует на Вражеских героев","Урон Магический"],"notes":["При использовании Concussive Shot прерывает произносимые способности Skywrath Mage.","Concussive Shot летит со скоростью в 800 единиц.","Не выбирает в качестве цели невидимых, неуязвимых и спрятанных юнитов или юнитов в тумане войны. Считает целями клонов Meepo.","Если поблизости нет подходящих героев, то способность выбирает ближайшего крипа.","Урон по области и замедление полностью работают на ближайших крипов и призванных существ, нанося им 75\/120\/165\/210 единиц урона.","Снаряд сначала наносит урон, а затем применяет дебафф.","Снаряд дает летающий обзор в радиусе 300 единиц пока летит.","Также дает летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания.","С Aghanim's Scepter при использовании способности другая случайная цель в радиусе поиска выбирается для второго Concussive Shot. Радиус поиска закреплен за начальной целью, а не Skywrath Mage. В отличии от первого снаряда, второй может выбирать в качестве целей юнитов не-героев. При этом у героев и иллюзий приоритет выше, чем у остальных юнитов. Считает крипов-героев за крипов. И, в отличии от первого снаряда, второй не выбирает неуязвимых юнитов или юнитов с иммунитетом к заклинаниям."],"mana":"80\/85\/90\/95","elements":["Можно избежать.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"18\/16\/14\/12","name":"Concussive Shot","description":["Анимация применения: 0+1,03","Радиус поиска: 1600 ( Глобальная)","Радиус поиска вторичной цели: 0 ( 700, Глобальная)","Радиус урона и замедления: 250","Количество целей: 1 ( 2)","Урон по героям: 100\/160\/220\/280","Процент урона по крипам: 75%","Замедление скорости передвижения: 30%\/35%\/40%\/45%","Длительность замедления: 4"],"hot_key":"W","legacy_key":"T"},{"spell":"Skywrath Mage оставляет печать древней руны на выбранном существе, запрещая произносить заклинания и увеличивая магический урон от заклинаний.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Применяет к цели безмолвие.","Снижает общее сопротивление магии героев до 2.5%\/-1.25%\/-5%\/-8.75% ( -8.75%\/-12.5%\/-16.25%\/-20%), принимая во внимание базовое значение в 0.25 и не учитывая другие источники сопротивления.","Уменьшение сопротивления магии не действует на юнитов не-героев.","Несколько применений на одну и ту же цель не складываются, но обновляют длительность.","С Aghanim's Scepter при использовании способности другая случайная цель в радиусе поиска выбирается для второго Ancient Seal. Радиус поиска закреплен за начальной целью, а не Skywrath Mage. У героев и иллюзий приоритет выше, чем у остальных юнитов. Считает крипов-героев за крипов."],"mana":"80\/90\/100\/110","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"14 ( 6)","name":"Ancient Seal","description":["Анимация применения: 0,1+0,97","Дальность применения: 750","Радиус поиска вторичной цели: 0 ( 700)","Количество целей: 1 ( 2)","Уменьшение сопротивления магии: 30%\/35%\/40%\/45% ( 45%\/50%\/55%\/60%)","Длительность: 3\/4\/5\/6"],"hot_key":"E","legacy_key":"R"},{"spell":"Skywrath Mage создает направленное поле сверхъестественной силы, чтобы сокрушить своих врагов. Поле наносит огромный урон, который равномерно распределяется между героями в области действия заклинания в течение 2.4 секунды.","effects":["Способность Направленная на область","Действует на Вражеских героев","Урон Магический"],"notes":["Вопреки визуальным эффектам способность полностью игнорирует иллюзий и крипов-героев.","Поражает вражеских героев и крипов, не находящихся под действием иммунитета к заклинаниям, неуязвимости или спрятанного состояния.","Наносит урон с интервалом в 0,1 секунды спустя 0,1 секунды после применения, нанося урон 24 раз.","Здесь указано, сколько урона нанесет Mystic Flare при поражении определенного числа героев за всю длительность (до учета сопротивления): 1 герой: 31.25\/48.96\/66.67 ( 56.25\/73.96\/91.67) единиц за интервал, 750\/1175\/1600 ( 1350\/1775\/2200) единиц в общем 2 героя: 15.63\/24.48\/33.33 ( 28.13\/36.98\/45.83) единиц за интервал, 375\/587.5\/800 ( 675\/887.5\/1100) единиц в общем 3 героя: 10.42\/16.32\/22.22 ( 18.75\/24.65\/30.56) единиц за интервал, 250\/391.67\/533.33 ( 450\/591.67\/733.33) единиц в общем 4 героя: 7.81\/12.24\/16.67 ( 14.06\/18.49\/22.92) единиц за интервал, 187.5\/293.75\/400 ( 337.5\/443.75\/550) единиц в общем 5 героев: 6.25\/9.79\/13.33 ( 11.25\/14.79\/18.33) единиц за интервал, 150\/235\/320 ( 270\/355\/440) единиц в общем","Дебафф Mystic Flare Effect отвечает за частицы эффектов на пораженных врагах. Он имеет только визуальное значение. Дебафф размещается аурой и задерживается на 0,5 секунды.","Улучшение Aghanim's Scepter для Skywrath Mage не требует изученного Mystic Flare, так как работает с каждой его способностью отдельно.","С Aghanim's Scepter при использовании способности автоматически применяется второй Mystic Flare на случайную цель в радиусе поиска, но вне радиуса поля в 170. Радиус поиска закреплен за выбранной областью, а не Skywrath Mage. При выборе второй цели у героев и иллюзий приоритет выше, чем у остальных юнитов. Считает крипов-героев за крипов. Игнорирует неуязвимых юнитов или юнитов с иммунитетом к заклинаниям, находящихся в радиусе поиска."],"mana":"350\/575\/800","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"60\/40\/20","name":"Mystic Flare","description":["Анимация применения: 0,1+0","Дальность применения: 1200","Радиус поиска вторичной цели: 0 ( 700)","Радиус поля: 170","Количество полей: 1 ( 2)","Урон: 750\/1175\/1600 ( 1350\/1775\/2200)","Длительность: 2.4"],"hot_key":"R","legacy_key":"E"}],"bio":"Драгонас занимает высокий пост мага при дворе Жуткого гнезда, но дни его полны печали. По праву рождения он обязан защищать любого, кто займёт Терновое гнездо, но действующую королеву скайрасов он ненавидит всем сердцем. Будучи юношей знатного происхождения, он общался и дружил со старшей принцессой скайрасов, Шенделезарой, следующей в очереди на престол. Нежно и непоколебимо он любил её, но когда пришла пора приступить к учёбе, Драгонас с головой погрузился в тайны скайрасской магии. Одержимый неземными материями, он проглядел знаки вполне приземлённых интриг — заговора против Шенделезары — и уже не смог предотвратить его. Когда двор потряс стремительный и жестокий переворот, Драгонас бросил обучение и обнаружил, что потерял своего самого старого и дорогого друга. Терновое Гнездо теперь принадлежало беспощадной младшей сестре Шенделезары, и Драгонас был бессилен что-либо сделать. Магия его служит лишь верным защитникам племени скайрасов, поэтому любые действия против Жуткого гнезда были бы тщетны. Он остался верен своему положению, надеясь, что однажды придёт день, когда его любовь вернёт свое принадлежащее по праву место. Но его тайные помыслы известны лишь богине Скриок, чья магия превратила искалеченное тело Шенделезары в воплощение чистой мести. Драгонас грезит мыслями о возвращении своей возлюбленной королевы в Жуткое гнездо, но ещё более отчаянно мечтает вернуть Шенделезаре полностью исцеленное тело. Будучи благородным и добросердечным существом, он страдает от своего же двуличия, но самая жуткая пытка — представлять ту ненависть к нему, которую хранит в своем сердце Vengeful Spirit.","talentsTips":["Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.","Талант вампиризма заклинаний лечит на 4% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.","Золото с таланта является ненадёжным."],"trivia":["Skywrath Mage влюблен в Vengeful Spirit. И они оба родом из одного и того же места.","Skywrath Mage в DotA является кузеном Invoker и его давним соперником. Среди реплик есть отсылки к этому."],"talents":["+600 к урону от Mystic Flare:+300 золота в минуту","+15% к доп. магическому урону от Ancient Seal:Неограниченная дальность применения Concussive Shot","+1 снаряд Arcane Bolt:-8 сек. к перезарядке Ancient Seal","+8% к вампиризму способностями:+20 к скорости передвижения"],"desc":"Skywrath Mage — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Данный герой обладает сильными магическими способностями, с помощью которых герой сможет расправиться как с одним, так и несколькими противниками. Способность Arcane Bolt позволяет герою выпускать медленно движущийся сгусток мистической энергии, который наносит урон врагам в зависимости от своего уровня интеллекта. Чем больше показатель интеллекта у Skywrath Mage, тем больше урона он сможет нанести способностью. Concussive Shot - данной способностью герой выстреливает магическим выстрелом в случайного ближайшего врага, замедляя его и нанося урон. Способность не сработает, если поблизости нет противников, или они невидимы. Способность Ancient Seal позволяет герою обезмолвить противника, а также увеличить наносимый ей магический урон на некоторый процент. С помощью Mystic Flare герой создаёт магическое поле, которое наносит немалый урон противникам. Урон от поля равномерно распределяется между противниками, попавших в поле."}