{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Healing_Salve_Salve.mp3\/revision\/latest?cb=20191227195430",
      "effects": [
        "Cast Animation: 0+0",
        "Cast Range: 250",
        "Health Regen Bonus: 30",
        "Self Duration: 13",
        "Allied Duration: 6.5"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self. Can be cast on allies with Ctrl.",
        "Can be cast on allies with Ctrl.",
        "Can only target heroes, illusions and creep-heroes. Can be cast on untargetable units (e.g. when affected by Shadow Realm) indirectly through their hero portrait. The owner of the item does not have to face the selected target to use Salve on them.",
        "Can be cast on untargetable units (e.g. when affected by Shadow Realm) indirectly through their hero portrait.",
        "The owner of the item does not have to face the selected target to use Salve on them.",
        "Successive casts on the same target do not stack but refresh the duration.",
        "Can regenerate up to 390 health over its full duration when cast on self. Can regenerate up to 195 health over its full duration when cast on allies. Targeting own creep-heroes, clones or illusions also regenerates for half value.",
        "Can regenerate up to 195 health over its full duration when cast on allies.",
        "Targeting own creep-heroes, clones or illusions also regenerates for half value.",
        "Player-based damage, regardless of factions, and Roshan-based damage greater than 0 (after reductions) dispels the effect. Does not get dispelled by self-damage sources and damage flagged as HP Removal.",
        "Does not get dispelled by self-damage sources and damage flagged as HP Removal."
      ],
      "mana": "0",
      "abilityName": "Salve",
      "cooldown": "0",
      "description": "Grants 30 health regeneration to the target for 13 seconds. If the unit is attacked by an enemy hero or Roshan, the effect is lost. Heals for half the amount when cast on an ally.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Healing Salves dug up with Trusty Shovel are fully shareable, but cannot be sold."
  ],
  "cost": "100",
  "lore": null,
  "consistFrom": null,
  "name": "Healing Salve",
  "description": "A magical salve that can quickly mend even the deepest of wounds.",
  "trivia": [
    "Prior to version 6.54 in DotA, Healing Salve was known as \"Flask of Sapphire Water\". The name, along with its icon, was likely changed to help visually differentiate it from Bottle."
  ],
  "upgradeIn": null,
  "tips": [
    "The Healing Salve's effect gets dispelled upon taking player-based damage, so do not use it in the middle of combat. In some situations, however, it may be worth it to use it in combat. Even one second long of its healing can be enough to prevent deaths in some situations.",
    "In some situations, however, it may be worth it to use it in combat. Even one second long of its healing can be enough to prevent deaths in some situations.",
    "Depending on the hero, in the early-game, one Salve can refill almost all of a hero's health. It spares the hero from having to move back to the team's fountain to heal back up, which can take a lot of time, or cost the player a Town Portal Scroll. Unlike Tango, Healing Salve is more suited for a defensive lane. If the lane carry tries to farm and takes some damage, he can fall back for a short time to quickly heal back up and continue farming.",
    "Unlike Tango, Healing Salve is more suited for a defensive lane. If the lane carry tries to farm and takes some damage, he can fall back for a short time to quickly heal back up and continue farming."
  ]
}