{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Oracle_Fortune%27s_End_1.mp3\/revision\/latest?cb=20191216021406",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "notes": [
        "Скорость полета снаряда - 1000.",
        "Если цель — союзник, то эффект от способности все равно применится на ближайших врагов. На союзника будет наложено только развеивание. Накладывает развеивание на всех врагов в радиусе, тогда как союзник получает развеивание только будучи выбранным. Поэтому за применение очищает только одного союзника. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "Накладывает развеивание на всех врагов в радиусе, тогда как союзник получает развеивание только будучи выбранным. Поэтому за применение очищает только одного союзника.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Всегда снимает эффект Fate's Edict с затронутых целей. С Aghanim's Scepter Fate's Edict развеивается только с врагов в области.",
        "С Aghanim's Scepter Fate's Edict развеивается только с врагов в области.",
        "Fortune's End сначала применяет развеивание, затем дебафф, а затем наносит урон.",
        "Можно напрямую применить к неуязвимым существам, даже если урон от способности отрицается неуязвимостью. Не действует на спрятанные цели. Когда снаряд попадает в неуязвимое, исчезнувшее или невосприимчивое к магии существо, то эффект от него все равно применяется ко всем существам в радиусе, но не к цели.",
        "Когда снаряд попадает в неуязвимое, исчезнувшее или невосприимчивое к магии существо, то эффект от него все равно применяется ко всем существам в радиусе, но не к цели.",
        "Не может ни выбрать, ни воздействовать на варды и постройки.",
        "При применении создает визуальный эффект на существе, информируя о выборе цели. Этот эффект виден всем. Звук во время произнесения тоже слышен всем.",
        "Звук во время произнесения тоже слышен всем.",
        "Произнесение не отменяется, если цель стала невосприимчивой к магии, невидимой или неуязвимой, спряталась или умерла. Если произнесение прерывается из-за обезвреживания, то снаряд выпускается преждевременно. Урон и эффект развеивания фиксированы, только длительность оцепенения зависит от времени, потраченного на произнесение.",
        "Если произнесение прерывается из-за обезвреживания, то снаряд выпускается преждевременно.",
        "Урон и эффект развеивания фиксированы, только длительность оцепенения зависит от времени, потраченного на произнесение.",
        "Длительность оцепенения начинается с 0,5 (TagTalent 1) сек. и увеличивается на 0,08 за каждые 0,1 секунды произнесения, достигая 2,5 (TagTalent 3) за 2,5 сек. Талант на мгновенное срабатывание Fortune's End убирает произнесение; снаряд мгновенно выпускается с максимальным зарядом. Выбор таланта во время произнесения Fortune's End визуально убирает полосу заряда, но не взаимодействует с произнесением.",
        "Талант на мгновенное срабатывание Fortune's End убирает произнесение; снаряд мгновенно выпускается с максимальным зарядом.",
        "Выбор таланта во время произнесения Fortune's End визуально убирает полосу заряда, но не взаимодействует с произнесением.",
        "Fortune's End применяет оцепенение к целям, предотвращая их передвижение и использование способностей для перемещения. Раскрывает невидимость целей, но только в случае, если они не невидимы или не ушли в невидимость до попадания.",
        "Раскрывает невидимость целей, но только в случае, если они не невидимы или не ушли в невидимость до попадания."
      ],
      "mana": "15\/12\/9\/6",
      "item_behaviour": [],
      "name": "Fortune's End",
      "cooldown": "100",
      "description": "Собирает мощь героя в заряд выжигающей энергии, который накладывает оцепенение на цель и врагов вокруг неё, наносит им урон и снимает с них положительные эффекты. Если целью является союзник, то способность только развеет отрицательные эффекты. Длительность оцепенения врагов равна времени применения способности — до 2,5 сек.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 850",
        "Радиус эффекта: 300",
        "Макс. длительность: 2,5 ( 0)",
        "Урон: 100\/160\/220\/280",
        "Мин. длительность оцепенения: 0,5 ( 1)",
        "Макс. длительность оцепенения: 2,5 ( 3)"
      ],
      "legacy_key": "T",
      "story": "Астральная сфера трещит от мощности, и из неё вырывается чистая энергия, временно разрывая связь врага с его собственным телом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3a\/Oracle_Fate%27s_Edict.mp3\/revision\/latest?cb=20191216021405",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников"
      ],
      "notes": [
        "Применяет к цели обезоруживание и приравнивает её сопротивление магии к 100%. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Fate's Edict всегда применяет к цели дебафф, независимо от того враг это или союзник. То есть при применении на союзника или себя способность можно развеять, но враги это сделать не могут. И наоборот, при применении на врага противники смогут развеять эффект, а союзники заклинателя — нет.",
        "То есть при применении на союзника или себя способность можно развеять, но враги это сделать не могут.",
        "И наоборот, при применении на врага противники смогут развеять эффект, а союзники заклинателя — нет.",
        "Fortune's End всегда развеивает модификатор независимо от цели.",
        "С Aghanim's Scepter применяет к врагу только обезоруживание, а к союзнику — только сопротивление магии. Мгновенно улучшает все существующие на существах модификаторы. Теперь Fate's Edict применяет к союзнику бафф вместо дебаффа. То есть теперь союзники его развеять не могут, в отличии от врагов. Fortune’s End больше не развеивает бафф с союзников\/себя.",
        "Мгновенно улучшает все существующие на существах модификаторы.",
        "Теперь Fate's Edict применяет к союзнику бафф вместо дебаффа. То есть теперь союзники его развеять не могут, в отличии от врагов.",
        "Fortune’s End больше не развеивает бафф с союзников\/себя."
      ],
      "mana": "16\/13\/10\/7",
      "item_behaviour": [],
      "name": "Fate's Edict",
      "cooldown": "50",
      "description": "Наполняет цель счастьем, обезоруживая ее и даруя сопротивление магии в 100%. Можно применять как на союзников, так и на врагов.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+1,1",
        "Дальность применения: 500\/600\/700\/800",
        "Сопротивление магии врагов: 100% ( 0%)",
        "Сопротивление магии союзников: 100%",
        "Длительность: 3\/3,5\/4\/4,5"
      ],
      "legacy_key": "F",
      "story": "Нерушимое пророчество гласит: не страдать от магии избранному бойцу. Что же касается других страданий..."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0c\/Oracle_Purifying_Flames.mp3\/revision\/latest?cb=20191216021409",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "notes": [
        "При использовании урон наносится мгновенно, затем действует периодическое лечение. Урон смертелен для врагов, но не для союзников, поэтому им нельзя добить. Нельзя использовать на союзников, которые отключили помощь от Oracle. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "Урон смертелен для врагов, но не для союзников, поэтому им нельзя добить.",
        "Нельзя использовать на союзников, которые отключили помощь от Oracle.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Эффекты от нескольких применений на одну и ту же цель складываются.",
        "Лечит с интервалом в 1 секунду спустя 1 секунду после применения, излечивая 9 раз.",
        "Восстанавливает до 99\/198\/297\/396 здоровья за применение. Излечивает до 9\/18\/27\/36 здоровья, учитывая начальный урон (до уменьшений). С талантом на дополнительный урон по врагам наносит до 18\/36\/54\/72 урона, учитывая базовый урон (до уменьшений).",
        "Излечивает до 9\/18\/27\/36 здоровья, учитывая начальный урон (до уменьшений).",
        "С талантом на дополнительный урон по врагам наносит до 18\/36\/54\/72 урона, учитывая базовый урон (до уменьшений)."
      ],
      "mana": "2,25 (TagTalent 1)",
      "item_behaviour": [],
      "name": "Purifying Flames",
      "cooldown": "80\/85\/90\/95",
      "description": "Выжигает скверну цели, нанося ей значительный магический урон, а затем постепенно восстанавливает ее жизненные силы. Количество восстанавливаемого здоровья больше нанесённого урона. Можно применять как на врагов, так и на союзников.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,15+1,14",
        "Дальность применения: 850",
        "Урон врагам: 90\/180\/270\/360 ( 117\/234\/351\/468)",
        "Урон союзникам: 90\/180\/270\/360",
        "Лечение в секунду: 11\/22\/33\/44",
        "Длительность: 9"
      ],
      "legacy_key": "E",
      "story": "Как зеркальные залы умножают свет одной свечи, так и разбитые стены вселенной превращают огонёк пророчества в жгучий факел."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e9\/Oracle_False_Promise_1.mp3\/revision\/latest?cb=20191216021412",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзных героев",
        "Урон: Чистый"
      ],
      "notes": [
        "При использовании применяет к цели сильное развеивание. Можно применить к иллюзиям и крипам-героям. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "False Promise отрицает урон после учета всех уменьшений, предотвращая срабатывание эффектов, реагирующих на урон.",
        "У False Promise второй по счету приоритет в группе заклинаний, отрицающих урон. Также способность отрицает эффекты лечения. То есть в комбинации с Aphotic Shield или Refraction False Promise будет отрицать урон, а перечисленные способности - нет. У способности приоритет ниже, чем у Borrowed Time; Borrowed Time сначала переведет урон в лечение, а затем лечение будет заблокировано False Promise.",
        "То есть в комбинации с Aphotic Shield или Refraction False Promise будет отрицать урон, а перечисленные способности - нет.",
        "У способности приоритет ниже, чем у Borrowed Time; Borrowed Time сначала переведет урон в лечение, а затем лечение будет заблокировано False Promise.",
        "Как и все эффекты, отрицающие урон, False Promise отрицает и откладывает только 3 типа урона. Способность игнорирует урон, отнимающий здоровье (за исключением Heartstopper Aura и Static Field).",
        "Не предотвращает срабатывание мгновенно убивающих эффектов: Culling Blade, Ice Blast.",
        "False Promise откладывает не только нанесение урона, но и увеличение здоровья героя с некоторыми исключениями. В отличии от отрицания урона, отрицание эффектов лечения действует до любых усилений или уменьшений (например, Ghost Shroud и Ice Blast). False Promise учитывает непосредственно лечение. Другие способы увеличения здоровья не учитываются, хотя их все еще можно предотвратить (например, здоровье, даваемое силой). Не предотвращает увеличение здоровья героя для следующих заклинаний: Supernova, Ошибка Lua в Модуль:Ability_ID на строке 62: Не найдено данных Cargo для \"Soul Catcher\"., Sunder, Whirling Death, Decay, Time Lapse, Armlet of Mordiggian и Essence Ring.",
        "В отличии от отрицания урона, отрицание эффектов лечения действует до любых усилений или уменьшений (например, Ghost Shroud и Ice Blast).",
        "False Promise учитывает непосредственно лечение. Другие способы увеличения здоровья не учитываются, хотя их все еще можно предотвратить (например, здоровье, даваемое силой).",
        "Не предотвращает увеличение здоровья героя для следующих заклинаний: Supernova, Ошибка Lua в Модуль:Ability_ID на строке 62: Не найдено данных Cargo для \"Soul Catcher\"., Sunder, Whirling Death, Decay, Time Lapse, Armlet of Mordiggian и Essence Ring.",
        "В конце длительности цель излечивается (проигрывается первый звук), если лечение превысило урон, или получает урон (проигрывается второй звук), если урона было больше. Все полученное лечение складывается в один источник и удваивается. Затем из суммы лечения вычитается каждый источник урона из очереди. Операция будет повторяться до того, пока урон от всех источников не будет отменен, либо пока не закончится сумма лечения. Если сумма лечения закончилась, то нанесутся все оставшиеся в очереди источники урона. Этот урон отмечен как отнимающий здоровье. При этом, если цель умрет, убийство засчитывается тому, чей урон привел к смерти (это может быть как первый или последний источник, так и любой между ними). Нелетальные источники урона, заблокированные во время действия False Promise остаются нелетальными, когда наносятся в конце действия способности. Если все источники урона были отменены, то оставшееся лечение будет применено общим источником к цели. Это лечение всегда приписывается Oracle.",
        "Все полученное лечение складывается в один источник и удваивается. Затем из суммы лечения вычитается каждый источник урона из очереди.",
        "Операция будет повторяться до того, пока урон от всех источников не будет отменен, либо пока не закончится сумма лечения.",
        "Если сумма лечения закончилась, то нанесутся все оставшиеся в очереди источники урона. Этот урон отмечен как отнимающий здоровье.",
        "При этом, если цель умрет, убийство засчитывается тому, чей урон привел к смерти (это может быть как первый или последний источник, так и любой между ними).",
        "Нелетальные источники урона, заблокированные во время действия False Promise остаются нелетальными, когда наносятся в конце действия способности.",
        "Если все источники урона были отменены, то оставшееся лечение будет применено общим источником к цели. Это лечение всегда приписывается Oracle.",
        "Несмотря на урон, отнимающий здоровье, Shallow Grave может спасти цель от смерти, а Borrowed Time превратит этот урон в лечение.",
        "Если цель стала неуязвимой при истечении действия False Promise, то отложенное лечение и урон будут нанесены при возвращении существу уязвимости.",
        "Повторные применения на цель не складываются, но обновляют длительность. Заблокированное лечение и урон не сбрасываются.",
        "Если общий урон превышает общее лечение и текущее здоровье цели, то сфера над целью горит красным и испускает огонь, информируя о предстоящем уроне.",
        "Талант на дополнительную броню от False Promise мгновенно улучшает все действующие модификаторы на союзниках.",
        "С Aghanim's Shard дает цели невидимость с задержкой в 0,15 сек. Атака, использование заклинаний или предметов выводят из невидимости и сбрасывают время до невидимости.",
        "Атака, использование заклинаний или предметов выводят из невидимости и сбрасывают время до невидимости."
      ],
      "mana": "120\/90\/60 (TagTalent 100\/70\/40)",
      "item_behaviour": [],
      "name": "False Promise",
      "cooldown": "100\/150\/200",
      "description": "Отсрочивает судьбу союзника, откладывая любое лечение и получение урона до конца действия этой способности. Любое лечение во время действия этой способности удваивается. Применение снимает с цели большинство отрицательных эффектов.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,97",
        "Дальность применения: 700\/850\/1000",
        "Отложенное усиление лечения: 100%",
        "Длительность: 8\/9\/10 ( 9,5\/10,5\/11,5)",
        "Доп. броня: 80",
        "Задержка до невидимости: 0,15"
      ],
      "legacy_key": "R",
      "story": "Предсказания лжепророков и неприятелей обманчивы."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 20.0,
    "attrIntelligence": 26.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.7,
    "attrAgility": 15.0
  },
  "description": "+1,5 сек. к длительности False Promise Fortune's End срабатывает мгновенно +30% к урону врагам от Purifying Flames −20 сек. к перезарядке False Promise −1,25 сек. перезарядки Purifying Flames +80 к урону от Fortune's End Fortune's End даёт 10 брони +0,5 сек. действия Fortune's End",
  "history": "Веками наследники Великого трона Симурри импортировали оракулов исключительно из Белого инкубатория, что в полых вершинах Гребня фанатиков. Вступительный взнос давался при зачатии эмбриона, а остальное, по доставке к Вратам высеченного короля зрелого, хорошо-тренированного пророка. Бледные предсказательницы выводят всех разрешенных оракулов, рождая и воспитывая их, и своей физической формой оракулы закреплены в мире, общем для большинства из нас. Души же их бродят далеко, едва связанные легчайшими астральными пуповинами. Возращаясь из своих вселенских странствий, пророки вещают огненные слова языками плоти. Симуррийские советники анализируют мистические речи пророков и находят в них видения будущего, дипломатические советы и прочие сверхъестественные надобности, дающие династии Высеченных королей победы при дворе и в бою. И так продолжалось поколениями, заполняя страницы Хроники высеченных королей именами королей-победителей и покоренных ими земель. Так продолжалось до тех пор пока один оракул, по имени Нериф, не прибыл для служения последнему из владык в каменных шлемах. С самого начала пророчества Нерифа были необычны. Казалось, они не предсказывают будущее а вершат его. Странный предсказатель выкаркивал советы когда их никто не просил, и неожиданно симуррийцы оказывались ввязаны в конфликты с новыми врагами. Советники, ощущая угрозу своей власти, быстро осознали в последнем оракуле источник нежелательных свар. Они потребовали его устранения, запросив предсказательниц взять обратно неполноценного пророка и предоставив достойную замену. Но в зловещем сне Нериф описал гибель Инкубатория и через несколько часов пришли вести что страшный обвал погубил древную школу. Опасаясь разделить участь Бледных предсказательниц, советники удалились в свои палаты для совещаний, желая избежать внимания оракула. Но Высеченный король всегда отличался практичностью. Он не полностью доверял своим сверхосторожным Советникам. Оракул такой редкости, думал он, должен быть использован для расширения владений. Исходя из этого, он сместил своих излишне робких советников и приблизил Нерифа. Плохо понимая свойства Нерифа, он попросту заявлял о своих желаниях и вынуждал Нерифа высказать эти желания как предсказания. Сначала все шло хорошо. Последний из Высеченных королей хвалился что взяв себе баловня судьбы он овладел самой судьбой. Следовала бы принять за предупреждение, когда накануне вторжения в земли Неудовлетворимого сатрапа, он пытался выудить у своего оракула предсказание несомненной победы, но Нериф лишь негромко прошептал, «все может быть». Более твердых слов король не смог заставить слететь с его губ. Тем не менее, король был уверен в своем войске. Сатрапия не имела выходов к морю, была слабо вооружена и лишена всех потенциальных союзников. Слова «все может быть» Король понял как то, что с перевесом в военной мощи, его план не несет серьезного риска. Конечно, теперь мы знаем что он должен был понять слова предсказателя более буквально. Даже при тщательном изучении Аннотированных анналов возможного, то что произошло на поле брани у дворца Неудовлетворимого сатрапа почти невозможно представить. Было похоже, что среди резни битва начала раздваиваться. В каждый решающий момент реальность разделялась и распадалась на осколки. Отступающие и падающие бойцы в тоже время держались крепко и смело вступали в бой. Разделилось и сознание солдат, они чувствовали себя и живыми и мертвыми, существующими и несуществующими. Победа и поражение разделились, и то и другое ощущалась одновременно обоими сторонами. Вселенная обратилась в зал зеркал, каждое из них бесконечно разбивающееся. Непосредственным эффектом происходящего стало сумасшествие. Не в силах понять состояние победы и поражения одновременно, сознание Высеченного короля распалось на лоскуты безумства. Наивному сатрапу досталось не меньше. Противоположные реальности продолжали разделяться и разделяться, как эхо они заполняли бесконечные варианты случившегося, каждый населенный непонимающими жителями которые вскоре потеряли способность кормить себя, одеваться, защищаться или размножаться обычным образом. Тем не менее, задолго до того как последствия случившегося полностью проявились, цимуррийские советники схватили Нерифа, связали его, заткнули рот и вышвырнули из своей вселенной на барке способной пересекать измерения, в надежде навсегда оставить его где-то где он не сможет им навредить. Конечно, для них это было слишком поздно. Возможно, для нас тоже."
}