{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/41\/Witch_Blade_Witch_Blade.mp3\/revision\/latest?cb=20210120233457",
      "effects": [
        "Интеллекта в урон за секунду: 75%",
        "Замедление скорости передвижения: 25%",
        "Длительность: 4"
      ],
      "notes": [
        "Успешные атаки с Witch Blade не складываются, но обновляют длительность эффекта.",
        "Атака сначала применяет дебафф, а потом урон.",
        "Не действует на варды и постройки или союзных существ.",
        "Наносит урон в 1-секундных интервалах, начиная через 1 секунду после применения дебаффа, срабатывая 4 раза.",
        "Может нанести цели до 300% от интеллекта в урон (до уменьшений).",
        "Делит перезарядку с Witch Blade. Witch Blade использует изменённую систему перезарядки. Она применяет на использовавшего дебафф, который не даёт способности снова сработать. Длительность этого дебаффа подвергается процентным уменьшениям перезарядки в начале применения. Он также не подвергается источникам сброса перезарядки или источникам прямого уменьшения перезарядки. Это значит, что возможно получить рассинхронизацию с перезарядкой Revenant's Brooch.",
        "Witch Blade использует изменённую систему перезарядки. Она применяет на использовавшего дебафф, который не даёт способности снова сработать.",
        "Длительность этого дебаффа подвергается процентным уменьшениям перезарядки в начале применения.",
        "Он также не подвергается источникам сброса перезарядки или источникам прямого уменьшения перезарядки.",
        "Это значит, что возможно получить рассинхронизацию с перезарядкой Revenant's Brooch."
      ],
      "mana": null,
      "abilityName": "Witch Blade",
      "cooldown": null,
      "description": "Следующая атака отравит жертву на 4 сек., замедлив её на 25% и каждую секунду нанося ей урон, равный интеллекту владельца, помноженному на 0,75. Этой атакой невозможно промахнуться.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2600",
  "lore": null,
  "consistFrom": [
    "Blitz Knuckles",
    "Robe of the Magi",
    "Chainmail",
    "Recipe"
  ],
  "name": "Witch Blade",
  "description": "Коварный клинок, в котором оказалась заключена душа его неосторожного создателя.",
  "trivia": null,
  "upgradeIn": [
    "Revenant's Brooch"
  ],
  "tips": null
}