{
  "abilities": [
    {
      "notes": [
        "Бомба-липучка всегда достигает цель за 1,2 секунды вне зависимости от расстояния. Существа могут проходить под бомбой во время её полёта. Если бомба-липучка попадает в  Chronosphere до достижения цели, то она мгновенно исчезает. Бомба уничтожает деревья в радиусе 100 при приземлении",
        "Techies бросает бомбу-липучку по дуге высотой ? со скоростью 2000, поэтому существа могут пройти под ней. Не может зацепиться за какую-либо цель во время броска. После приземления бомба-липучка кружится со скоростью 500 вокруг точки приземления в течение 90\/180\/270\/360 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 375) секунд или пока не зацепится за вражескую цель",
        "При приземлении бомба-липучка приклеивается к ближайшему вражескому герою, включая иллюзии и клонов и крипов-героев. Поиск цели происходит только раз в момент приземления, после чего бомба больше не ищет жертв. Может найти и прикрепиться к невидимым врагам или противникам, находящемся в тумане войны, но не к неуязвимым или спрятанным героям. Если бомба-липучка обнаруживает подходящую цель, то она движется напрямую к ней с задержкой в 0,1 сек. Бомба движется с начальной скоростью 500 и ускоряется на 2000 каждую секунду, пока не достигнет цели. Максимальная скорость передвижения не имеет предела. После начала движения к цели ничто, кроме смерти, не может предотвратить прикрепление бомбы-липучки к герою",
        "Бомба прикрепляется к противнику, когда находится на расстоянии 100 от него. Это расстояние сохраняется до момента взрыва. После прикрепления бомбу невозможно убрать даже смертью персонажа. Несмотря на то, что дебафф замедления можно развеять, это действие не удалит бомбу. Бомба взрывается спустя 2 после прикрепления к цели",
        "Несколько применений Sticky Bomb увеличивает число эффектов на цель, замедление скорости передвижения не сочетается, но обновляет длительность. Однако урон от взрыва полностью сочетается",
        "Если после приземления бомба-липучка не находит цель для прикрепления, то она остаётся в выбранной облати. На самом деле бомба не движется по кругу, анимация кружения не влияет на реальное местонахождение бомбы. Бомба взорвётся спустя 2 после приземления, если она не нашла цель для прикрепления",
        "Взрыв сначала наносит урон, затем применяет замедляющий дебафф. После 2 сек. задержки перед активацией бомба взрывается, нанося урон в размере 90\/180\/270\/360 и замедляя всех задетых вражеских существ на 15%\/25%\/35%\/45% в радиусе 300 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 425). Суммарно может замедлить цель заклинания на 5 секунд",
        "Эта способность не даёт раскрытие невидимости или любой обзор на цель. Однако бомба имеет собственный наземный обзор с радиусом в 700, который действует всё время существования бомбы",
        "Бомбу можно выбрать при помощи Tab ↹. Хотя бомбы обладают способностью  Pinpoint Detonate, её нельзя применить"
      ],
      "item_behaviour": [],
      "description": "Герой бросает в выбранную область бомбу-липучку. Если она приземлится рядом с врагом, то приклеится к нему и замедлит его передвижение. Через несколько секунд бомба взорвётся, нанеся урон всем врагам вокруг и замедлив их на 3 сек.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,1+0,7",
        "Дальность применения:  1000",
        "Радиус приклеивания: 250 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 375)",
        "Замедление передвижения при приклеивании: 25%\/35%\/45%\/55%",
        "Радиус взрыва: 300 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 425)",
        "Задержка до взрыва: 2",
        "Урон: 90\/180\/270\/360",
        "Замедление от взрыва: 15%\/25%\/35%\/45%",
        "Длительность замедления от взрыва: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Techies_Sticky_Bomb_1.mp3\/revision\/latest?cb=20220412212710",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "12\/10\/8\/6",
      "aghanim": null,
      "name": "Sticky Bomb",
      "cooldown": "100\/115\/130\/145",
      "legacy_key": "E",
      "story": "Столь революционным прорывом обязательно нужно поделиться с окружающими."
    },
    {
      "notes": [
        "Reactive Tazer срабатывания только после попадания атаки вне зависимости от расстояния. Это значит, что способность не срабатывает при промахе. Не срабатывает на мгновенные атаки, которые не могут спровоцировать срабатывание модификаторов атаки (например,  Split Shot до изучения соответствующего <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта или  Flak Cannon). Не работает против построек, вардов и союзников. Если атакующее существо станет невидимым, то визуальные эффекты будут отображаться на его текущем местоположении. Однако эти эффекты будут появляться только в последнем известном местоположении противника",
        "Любая потеря эффекта приведёт к взрыву в радиусе 400 с накладыванием нормального развеивания, обезоруживания и нанесением урона",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER ↓↓ Двойное нажатие автоматически применит на себя. Reactive Tazer сначала применяет дебафф, затем наносит урон. Получение  Aghanim's Scepter мгновенно улучшает действующий бафф от Reactive Tazer, нанося урон противникам при нанесении ими урона и при окончании дебаффа"
      ],
      "item_behaviour": [],
      "description": "Герой окружает себя зарядом электричества, ненадолго повышая свою скорость передвижения. Если атаковать заряженного героя, то на обидчика применится бессилие и нормальное развеивание. Когда заряд заканчивает своё действие, он взрывается, накладывая бессилие на всех врагов вокруг.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,1+0,5",
        "Радиус взрыва:  400",
        "Доп. скорость передвижения: 18%\/22%\/26%\/30%",
        "Длительность заряда: 6",
        "Длительность бессилия: 2,4\/2,7\/3\/3,3",
        "Дальность применения:  500",
        "Урон:  300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Techies_Reactive_Tazer.mp3\/revision\/latest?cb=20220412212708",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: "
      ],
      "mana": "28\/24\/20\/16",
      "aghanim": null,
      "name": "Reactive Tazer",
      "cooldown": "60",
      "legacy_key": "T",
      "story": "Твёрдая рука подрывника не терпит отсутствия личного пространства."
    },
    {
      "notes": [
        "Прыжок всегда занимает 0,75 сек., поэтому скорость полета варьируется между 0 и 1333,33",
        "Траектория прыжка — арка высотой в 281,108 единиц, поэтому другие существа могут проходить под героем",
        "Урон по себе несмертелен, поэтому Techies не может добить себя с помощью этой способности. Урон по себе — магический, отмеченный как отнимающий здоровье; большинство источников манипуляцим уроном его игнорируют (за исключением сопротивления магии и магического барьера). Только следующие способности взаимодействуют с подобным уроном: <span image=\"images\/Borrowed_Time.webp\">Borrowed_Time<\/span> Borrowed Time, <span image=\"images\/Aphotic_Shield.webp\">Aphotic_Shield<\/span> Aphotic Shield,  Ghostship и  False Promise",
        "Взрыв сначала применяет дебафф, затем урон по области, урон Techies, а затем оглушение. Наносит урон врагам по области до нанесения урона самому Techies, поэтому заклинатель получает опыт за героев, умерших от заклинания. То есть Techies может умереть от  Blade Mail,  Spiked Carapace,  Dispersion,  Last Will и  Static Charge, если его здоровье было достаточно низким при применении",
        "При приземлении разрушает деревья в радиусе 150 вокруг Techies",
        "Можно прервать с помощью принудительного движения во время прыжка, но способность не прерывается другими типами обезвреживания",
        "Нельзя использовать при оцепенении или в привязке. ПРИМЕЧАНИЯ К SPELL STEAL Анимация применения не изменяется при получении способности"
      ],
      "item_behaviour": [],
      "description": "Герой бросается в гущу врагов и при приземлении взрывает свой боезапас, нанося задетым врагам огромный урон и запрещая им применять способности. Владелец способности получает при взрыве урон в размере доли от своего текущего запаса здоровья, но не может от него умереть.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 1+0,9",
        "Дальность применения:  1000 ( 1300)",
        "Радиус урона\/безмолвия: 400",
        "Урон себе от текущего здоровья: 35%\/30%\/25%\/20%",
        "Урон по области: 200\/300\/400\/500 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 400\/500\/600\/700)",
        "Длительность прыжка: 0,75",
        "Длительность безмолвия: 4\/5\/6\/7",
        "Длительность оглушения:  1,75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/74\/Techies_Blast_Off%21_1.mp3\/revision\/latest?cb=20191216024800",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "39\/36\/33\/30 (TagTalent 24\/21\/18\/15)",
      "aghanim": null,
      "name": "Blast Off!",
      "cooldown": "100\/125\/150\/175",
      "legacy_key": "C",
      "story": "Куда это мы?"
    },
    {
      "notes": [
        "Эта способность присутствует изначально: её нельзя изучить или увеличивать её уровень",
        "Табличку нельзя разместить на фонтане",
        "Одновременно на карте может присутствовать только 1 табличка. Размещение второй моментально уничтожит предыдущую (хоть и с визуальной задержкой). Табличка не имеет анимации смерти. После окончания длительности действия она визуально стоит ещё несколько секунд, после чего просачивается под землю",
        "Неуязвимость даётся аурой с задержкой в 0,5 сек. Аура действует только на  Proximity Mines. Другие варды не подвергаются воздействию ауры",
        "Табличка не имеет размера столкновения и не может заблокировать проход существ",
        "Табличка не блокирует лагери нейтральных крипов"
      ],
      "item_behaviour": [],
      "description": "На 60 сек. устанавливает предостерегающую табличку, мины в области действия которой неуязвимы. Нельзя ставить больше одной таблички одновременно.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения:  10",
        "Радиус действия: 500",
        "Максимум табличек: 1",
        "Длительность: 60",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Techies_Minefield_Sign.mp3\/revision\/latest?cb=20191216024803",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Неконтактную мину"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Minefield Sign",
      "cooldown": null,
      "legacy_key": "G",
      "story": "Смотри под ноги!"
    },
    {
      "notes": [
        "При изучении Proximity Mines Techies сразу получает все 3 заряда",
        "Неконтактные мины нельзя разместить в радиусе 350 от остальных союзных неконтактных мин. При выборе заклинания все принадлежащие заклинателю неконтактные мины обрамлены красными кругами, отображающими радиус невозможной установки мин",
        "Мины не могут сработать в течение 1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,2) сек. после установки. Во время задержки мины видны врагам; после нее они становятся невидимыми",
        "Для взрыва неконтактной мины нужно 2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1,2) сек. при установке мины прямо перед вражеским существом или строением",
        "Мины взрываются только если враг задерживается в радиусе 500 на 1 сек. То есть быстрый вход и выход из области срабатывания не активирует их. При входе в радиус мина издает звук, предупреждая врага о попадании в радиус срабатывания. Звук слышен всем даже через туман войны. Взрыв мины также слышен сквозь туман войны. Мины срабатывают от невидимых существ, но не от неуязвимых или спрятанных. Летающие существа и варды не могут активировать или получить урон от мин. Если противник покинет радиус срабатывания или станет неуязвимым, то мина снова станет невидимой, а задержка перед детонацией обнулится",
        "Неконтактная мина наносит урон и накладывает дебафф только при срабатывании. При уничтожении мин атаками этого не происходит. Источником урона является сама мина, поэтому определенные эффекты, реагирующие на урон, реагируют на мины, а не на Techies (например,  Blade Mail). По этой причине урон мин не увеличивается с усилением урона от заклинаний. Урон мин связан с текущим уровнем Proximity Mines, а не с уровнем на момент установки. Мины наносят 200\/287,5\/375 ‒ 400\/575\/750 ( 60\/86,25\/112,5 ‒ 120\/172,5\/225) урона (до учёта сопротивлений) в зависимости от расстояния между миной и противником, нанося максимальный урон в радиусе 150. Даёт летающий обзор в радиусе 300 единиц на 1 секунду в месте взрыва",
        "Несмотря на описание, неконтактные мины не имеют иммунитет к раскрытию невидимости от следующих способностей:  Chronosphere и   Waning Rift. Хотя неконтактную мину можно увидеть при помощи  Reveal, они всё равно имеют иммунитет к атакам",
        "Неконтактная мина сначала снижают сопротивление магии, затем наносят урон. Снижает сопротивление магии большинства героев до 14%\/10%\/6%. Сочетается мультипликативно с другими источниками снижения сопротивления магии. Несколько срабатываний Proximity Mines не сочетаются, но обновляют длительность эффекта. Однако не снижает сопротивлении магии у построек",
        "Мины не блокируют лагери нейтральных крипов",
        "Повышение уровня способности мгновенно улучшает все установленные мины"
      ],
      "item_behaviour": [],
      "description": "Устанавливает невидимую мину. Её невидимость невозможно раскрыть, но она станет видна, если противник зайдёт в область действия. Мина взорвётся, если противник будет 1 сек. находиться на расстоянии в 500 от неё. Взрыв уменьшает сопротивление магии врагов и наносит им урон, зависящий от близости к мине: на расстоянии в 150 достигается полный урон, а на краю области действия он составит 50%. Наносит постройкам 30% урона.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0,47",
        "Дальность применения:  400",
        "Радиус невозможной установки: 350",
        "Радиус максимального урона: 150",
        "Радиус срабатывания\/минимального урона: 500",
        "Время до активации: 1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 0,2)",
        "Задержка взрыва: 1",
        "Урон: 400\/575\/750",
        "Минимальный урон: 50%",
        "Урон постройкам: 30%",
        "Уменьшение сопротивления магии: 15%\/20%\/25%",
        "Длительность эффекта: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Techies_Proximity_Mines_1.mp3\/revision\/latest?cb=20191216024807",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Proximity Mines",
      "cooldown": "19\/17\/15 ( 16\/14\/12)",
      "legacy_key": "R",
      "story": "Ночной кошмар Тотерина!"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 19.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.0,
    "attrAgilityInc": 1.3,
    "attrAgility": 14.0
  },
  "description": "Застаёт врагов врасплох невидимыми минами и взрывными атаками Озорные Techies любят как следует подгадить врагу. С хихиканьем они швыряются бомбами-липучками, а невидимые мины, электрические разряды и беспечные полёты на взрывчатке сведут любого противника в могилу. Или с ума. Одно другому не мешает.  Быстрый урон Контроль ★★☆",
  "history": "За всю историю Устричной бухты никого не ненавидели так, как подрывников Techies. Но — вот незадача — Устричной бухты больше нет. Как и города Тотерина. И даже Охотограда. Вообще, если бы кто-нибудь следил за похождениями подрывников, он бы заметил, что там, где появляются Techies, исчезают города. Как и все остальные неизбежные бедствия, происходившие вокруг них, отправной точкой для уничтожения Устричной бухты стало изобретение. Гении пиротехники — Скви, Сплин и Спун — искали безопасный метод пробить шахты под городом взрывчаткой и создали самое диковинное свое устройство — кнопку, позволяющую зажечь фитиль издалека. Троица, решившая во что бы то ни стало испытать свое изобретение, заставила всю свою крохотную мастерскую радиоуправляемыми бочками с огненной солью. Набив тележку этими бомбами, они закопали их в пустынном поле. Спрятавшись в траншее, Сплин вдавил кнопку детонатора. Но ничего не произошло. Смутившись, он поднялся на ноги и нажимал кнопку еще и еще, пока наконец не прогремел взрыв, оставивший на поле воронку. Радостные Скви и Сплин уж было направились в сторону дома, но тут их накрыла мощная ударная волна. Сбитые с толку неожиданным взрывом, они пробрались через едкий дым и увидели, что от их мастерской остались одни руины. С неба падали куски дерева и камня, а воронка под мастерской начала углубляться. Вся Устричная бухта содрогнулась и начала оседать в шахты, а паникующие жители спасались бегством. Присев на краю своего тонущего дома, подрывники ухмылялись и хихикали, уже представляя себе, на что они способны, и совсем не думали о гневе их бывших соседей. Им было интересно только одно: а как можно сделать взрыв еще сильнее?"
}