{"abilities":[{"spell":"Rushes to a target location while backtracking any damage taken in the last 2 seconds.","effects":["Ability Target Point","Affects Self ( Enemies)"],"notes":["Time Walk moves Faceless Void with a speed of 3000.","Faceless Void is invulnerable during Time Walk.","Does not disjoint projectiles upon cast.","Does not travel the full distance, when targeting closer than the max distance.","Upon cast, any damage Faceless Void took in the last 2 seconds gets healed back up. This includes damage dealt by allies.","Since it is a heal, it is fully affected by heal manipulation.","Only backtracks the 3 damage types. Heals and HP Removal are not backtracked. This means it cannot backtrack e.g. Sunder, False Promise, Soul Ring and Armlet of Mordiggian.","Status buffs and debuffs, cooldowns and mana are completely unaffected.","When upgraded by Aghanim's Scepter, enemies within 250 range of the destination will receive Time Lock's stun debuff and instant attack. Does not pierce spell immunity."],"mana":"40","elements":["Cannot be cast while rooted or leashed."],"cooldown":"24\/18\/12\/6 ( 22.5\/16.5\/10.5\/4.5)","name":"Time Walk","description":["Cast Animation: 0.3+0.2","Cast Range: Global","Max Travel Distance: 675 ( 1125)","Backtracked Time: 2","Time Lock Area of Effect: 0 ( 250)"],"hot_key":"Q","legacy_key":"W"},{"spell":"Faceless Void traps all nearby enemies in a time dilation field for 8\/10\/12\/14 seconds, extending their cooldowns and slowing their movement and attack speed by 10% for each cooldown extended.","effects":["Ability No Target","Affects Enemies"],"notes":["Affects units in the Fog of War and invisible units, but not invulnerable and hidden units.","Causes enemy cooldowns to recharge 75% slower while they have the debuff.","Abilities cast by affected units after the debuff is applied are affected by the debuff.","Does not affect the cooldown of items or abilities without a cooldown. Does affect cooldowns of passive abilities.","Does not affect the recharge time of charge-based spells. However, if the last charge of a spell was used and the icon shows a cooldown, that cooldown is affected. Freezing that cooldown causes the recharge timer and the cooldown to desynchronize, so that the spell is still on cooldown even after gaining a charge back.","The slow has no stack limit. Each ability on cooldown adds a stack. Also counts the cooldown of hidden abilities, like Invoker's uninvoked spells, Lua error in Module:Ability_ID at line 44: Could not find Cargo data for \"Entangling Claws\". (on a hero), Morph or abilities granted by Aghanim's Scepter. Rubick's stolen spells which are on cooldown and already lost do not count, as they are not hidden, but removed. The stack count can only increase, and never decline. If an ability gets refreshed, the slow still keeps all the current stacks.","Abilities can still be reset (e.g. Refresher Orb) while affected by Time Dilation. However, when reset in any other way than a Refresher Orb or Refresher Shard (e.g. Rearm), abilities go back on cooldown again upon losing the debuff.","Multiple instances of Time Dilation do not stack, but refresh the duration."],"mana":"75","elements":["Does not pierce spell immunity."],"cooldown":"40\/34\/28\/22","name":"Time Dilation","description":["Cast Animation: 0.1+0.77","Radius: 775","Slow per Cooldown: 10%","Cooldown Progression Slow: 75%","Duration: 8\/10\/12\/14"],"hot_key":"W","legacy_key":"R"},{"spell":"Adds the chance for an attack to lock an enemy unit in time while attacking it a second time.","effects":["Ability Passive","Affects Enemies","Damage Magical \/ Instant Attack"],"notes":["Does not stack with other bashes. The bash from Skull Basher and Abyssal Blade is completely disabled for Faceless Void.","The proccing attack first applies the debuff, then its own damage.","Time Lock works against allied units, but not against wards and buildings.","Upon proccing, the stun debuff gets applied. 0.33 seconds later, the second attack, and the damage applies. The bash damage is dealt in a separate instance and is spell damage. It is not added as attack damage. This means bash works with spell lifesteal and spell damage amplification, but not with lifesteal, crit, or cleave. The second attack is an instant attack, which is allowed to trigger attack modifiers normally. This means it can trigger itself as well. Applies the instant attack first, then Time Lock's own damage.","Despite the visual effect, the angle of the second attack is still based on Faceless Void's position, so cleave hits towards where he is facing, and not the image that appears.","Adds an average of 3\/4.8\/7\/9.6 ( 11.4\/16\/21\/26.4) damage to every attack.","Time Lock uses pseudo-random distribution."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Time Lock","description":["Proc Chance: 12%\/16%\/20%\/24%","Damage: 25\/30\/35\/40 ( 95\/100\/105\/110)","Second Attack Delay: 0.33","Hero Duration: 0.65","Non-Hero Duration: 2"],"hot_key":"E","legacy_key":"E"},{"spell":"Creates a blister in spacetime, trapping all units caught in its sphere of influence and causes you to move very quickly inside it. Only Faceless Void and any units he controls are unaffected. Invisible enemies in the sphere will be revealed.","effects":["Ability Target Area","Affects Enemies \/ Allies"],"notes":["Chronosphere affects all units which are not owned by Faceless Void, including buildings, wards and allies.","Does not affect couriers, hidden units and invulnerable heroes. All other invulnerable units are fully affected.","Instantly destroys Homing Missiles and The Swarm beetles.","Instantly causes already latched Phantoms to return to their caster, and freezes traveling phantoms.","While in the Chronosphere, Faceless Void and any units he controls are phased and hasted, meaning they cannot be slowed below the set value.","Faceless Void and illusions of him (be it his own, enemy or allied illusions) are never disabled by any Chronosphere.","However, the movement speed and phase is only provided to the caster of it.","Provides flying vision and True Sight over the whole affected area for its duration.","Affected units are stunned. When other units walk inside the area, they also get affected for its remaining duration.","Cancels most sources of Forced Movement upon applying the disabling debuff on a unit.","Units inside Chronosphere can be pulled out by various spells. Force Staff, Hurricane Pike, Snowball and Geomagnetic Grip cannot move units out of Chronosphere.","Despite its visual effects, the effective area is a cylinder not a sphere."],"mana":"150\/225\/300","elements":["Not disabled by Break.","Pierces spell immunity."],"cooldown":"160","name":"Chronosphere","description":["Cast Animation: 0.35+0.7","Cast Range: 600","Radius: 450 ( 625)","Haste Speed: 1000","Duration: 4\/4.5\/5"],"hot_key":"R","legacy_key":"C"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Self"],"notes":["Grants Faceless Void a chance to avoid damage completely.","Backtrack belongs to the group of damage negating effects. It is not evasion. This means it only negates damage, it does not evade any side effects of spells or attacks, like disables. When an attack has e.g. Mana Break and Backtrack triggers on the attack, the damage is avoided, but the mana burn still takes effect. This also means that True Strike or Accuracy does not stop Backtrack from avoiding attack damage. Evasion has priority over Backtrack. When evasion procs, Backtrack cannot proc on that attack.","Backtrack has the third highest priority in the group of damage negating effects. This means when combined with e.g. Aphotic Shield or Living Armor, Backtrack negates damage while the shield or armor do not.","As with all damage manipulating effects, Backtrack can negate all 3 damage types. Increases Faceless Void's effective health by an average of 33% against those.","Fully ignores damage which is flagged as HP Removal.","Backtrack uses pseudo-random distribution."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break."],"cooldown":"0","name":"Backtrack","description":["Proc Chance: 25%"]}],"bio":"Darkterror the Faceless Void is a visitor from Claszureme, a realm outside of time. It remains a mystery why this being from another dimension believes the struggle for the Nemesis Stones is worth entering our physical plane, but apparently an upset in the balance of power in this world has repercussions in adjacent dimensions. Time means nothing to Darkterror, except as a way to thwart his foes and aid his allies. His long-view of the cosmos has given him a remote, disconnected quality, although in battle he is quite capable of making it personal.","talentsTips":["The strength talent effectively grants Faceless Void 200 health, 1 health regen and 0.8% magic resistance.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["In DotA, Faceless Void's alternate\/fun name is Gorzerk.","Faceless Void's death response, \"Unkind…Rewind\" is likely a reference to the old saying, \"Be Kind, Rewind\", a saying used to remind customers to rewind rented VHS tapes before returning them to the store.","Faceless Void's respawn line \"In the land of time, the no-eyed man is king.\" refers to the famous adage by Desiderius Erasmus: \"In the land of the blind, the one-eyed man is king.\""],"talents":["+175 Chronosphere AoE:+25% Backtrack","+450 Time Walk Cast Range:+45 Attack Speed","-1.5s Time Walk:+70 Time Lock Damage","+10 Strength:+15 Damage"],"desc":"Darkterror the Faceless Void is a melee agility hero played as an offlaner or carry. Given a little time, he becomes a terrifying hero capable of destroying entire enemy teams in seconds."}