{"abilities":[{"spell":"Совершает рывок к указанной точке и восстанавливает здоровье, потерянное за последние 2 секунды.","effects":["Способность Направленная на точку","Действует на Себя"],"notes":["Во время рывка Faceless Void движется со скоростью 3000.","Во время действия этой способности Faceless Void неуязвим.","Не даёт возможность избежать снаряда.","Не перемещает на полную дистанцию при выборе точки, находящейся ближе, чем максимальная дистанция.","При использовании отменяет любой урон, полученный Faceless Void за последние 2 секунды, возвращая здоровье. Также учитывается урон, нанесенный союзниками.","Так как это эффект лечения, то Ice Blast препятствует восстановлению.","Отменяет только 3 типа урона. Лечение и отнимание здоровья не отменяются. То есть нельзя отменить Sunder, False Promise, Soul Ring и Armlet of Mordiggian.","Не влияет на баффы и дебаффы, время перезарядки и ману."],"mana":"40","elements":["Нельзя применять в оцепенении или будучи связанным."],"cooldown":"24\/18\/12\/6 ( 22.5\/16.5\/10.5\/4.5)","name":"Time Walk","description":["Анимация применения: 0,3+0,2","Дальность применения: Глобальная","Дальность перемещения: 675 ( 1125)","Период возврата: 2"],"hot_key":"Q","legacy_key":"W"},{"spell":"Накладывает на окружающих врагов временное поле, продлевая перезарядку их способностей на 8\/10\/12\/14 секунд. Жертвы передвигаются и атакуют на 14% медленнее за каждую поражённую способность.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Действует на невидимых существ и существ в тумане войны, но не на неуязвимых или спрятанных.","На самом деле не замораживает перезарядку способностей, а добавляет 8\/10\/12\/14 секунд к уже действующей перезарядке.","У способностей, используемых пораженными существами уже после применения дебаффа, длительность перезарядки не меняется.","Не влияет на время перезарядки предметов и способностей без перезарядки. Влияет на перезарядку пассивных способностей.","Не влияет на время восстановления способностей, имеющих заряды. Если был использован последний заряд способности и её иконка показала перезарядку, то дебафф будет наложен. Заморозка этой перезарядки означает, что таймер восстановления заряда и время перезарядки рассинхронизируются, поэтому способность остается на перезарядке даже после того как заряд появится.","У замедления нет лимита по зарядам. Каждая способность на перезарядке добавляет заряд. Также учитывает перезарядку скрытых способностей, такие как неактивные заклинания у Invoker, Battle Cry, Morph или способности, даваемые Aghanim's Scepter. Украденные Rubick способности, которые имеют перезарядку, но которые уже заменены или время действия которых закончилось, в счёт не идут, поскольку они не скрываются, а убираются. Замедление от Time Dilation не может уменьшиться, оно может только увеличиваться. Если способность была обновлена, то замедление продолжится с учетом всех текущих зарядов.","Перезарядка способностей может быть сброшена ( Refresher Orb) под эффектом от Time Dilation. При этом, если они были сброшены любым другим способом, отличным от Refresher Orb или Refresher Shard (например, Rearm), то способности уйдут на перезарядку после потери дебаффа.","Несколько использований Time Dilation не складываются, но обновляют длительность."],"mana":"75","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"40\/34\/28\/22","name":"Time Dilation","description":["Анимация применения: 0,1+0,77","Радиус: 775","Замедление за способность: 14%","Длительность: 8\/10\/12\/14","Замедление перезарядки: 75%"],"hot_key":"W","legacy_key":"R"},{"spell":"Атака может остановить время для вражеского существа, отчего оно получает ещё один удар.","effects":["Способность Пассивная","Действует на Врагов","Урон Магический \/ Instant Attack"],"notes":["Не сочетается с остальными источниками оглушающего удара. Оглушение от Skull Basher и Abyssal Blade отключено для Faceless Void.","Сработавшая атака сначала применяет дебафф, а затем наносит урон.","Time Lock работает на союзных юнитов, но не на варды и строения.","При срабатывании применяется оглушающий дебафф. Спустя 0.33 секунды наносится вторая атаки и урон. Урон наносится отдельным источником и считается уроном заклинания. Он не добавляется к основному урону. То есть на него действует вампиризм и усиление урона заклинаний, но не вампиризм, критический или прорубающий удар. Вторая атака — мгновенная, также активирующая модификаторы атаки. То есть она также может активировать свою же способность. Сначала применяет мгновенную атаку, затем урон Time Lock.","Несмотря на визуальный эффект, угол второй атаки продолжает основываться на позиции Faceless Void, поэтому прорубание поражает те цели, что находится герой, а не возникает иллюзия.","В среднем добавляет к каждой атаке 12%\/16%\/20%\/24% + 3\/4.8\/7\/9.6 ( 11.4\/16\/21\/26.4) единиц магического урона.","Time Lock использует псевдослучайное распределение."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Time Lock","description":["Шанс срабатывания: 12%\/16%\/20%\/24%","Урон: 25\/30\/35\/40 ( 95\/100\/105\/110)","Задержка второй атаки: 0.33","Длительность на героях: 0.65","Длительность на не-героях: 2"],"hot_key":"E","legacy_key":"E"},{"spell":"Создаёт сферу, которая останавливает действие пространства и времени. Внутри неё застывает всё, кроме владельца сферы и подконтрольных ему существ, которые передвигаются в ней с увеличенной скоростью. Внутри сферы раскрывается невидимость.","effects":["Способность Направленная на область","Действует на Врагов \/ Союзников"],"notes":["Chronosphere действует на всех юнитов, которые не находятся под контролем Faceless Void, включая строения, варды и союзников.","Не действует на курьеров, спрятанных существ и неуязвимых героев. На всех остальных неуязвимых существ способность действует.","Мгновенно разрушает Homing Missiles и жуков от The Swarm.","В Chronosphere на Faceless Void и подконтрольных ему существ действует ускорение (и их нельзя замедлить ниже установленного значения) и они могут проходить сквозь других юнитов.","Иллюзии Faceless Void (подконтрольные ему, созданные союзниками или противниками) никогда не обезвреживаются любой Chronosphere.","При этом скорость передвижения и возможность проходить сквозь существ дается только использовавшему способность.","Дает летающий обзор и эффект True Sight в радиусе 450 ( 625) единиц на всю длительность.","Затронутые существа оглушаются. Когда остальные существа входят в область, они также оглушаются на оставшуюся длительность.","Отменяет большинство источников принудительного движения при применении обезвреживающего дебаффа к юниту.","Юнитов можно вытащить из Chronosphere некоторыми заклинаниями. Force Staff, Hurricane Pike, Snowball и Geomagnetic Grip этого сделать не могут."],"mana":"150\/225\/300","elements":["Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"160","name":"Chronosphere","description":["Анимация применения: 0,35+0,7","Дальность применения: 600","Радиус: 450 ( 625)","Скорость ускорения: 1000","Длительность: 4\/4,5\/5"],"hot_key":"R","legacy_key":"C"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Дает Faceless Void шанс полностью избежать урона.","Backtrack относится к группе эффектов, отрицающих урон. Способность не относится к уклонению. То есть она лишь отрицает урон, а не уклоняется от любых побочных эффектов (например оглушений) от заклинаний или атак. При срабатывании Backtrack на атаки с эффектом сжигания маны избегается лишь урон, а мана все равно сжигается. Также это означает, что атаки с эффектом True Strike и точность не мешают Backtrack избегать урона. У уклонения приоритет выше, чем у Backtrack. При срабатывании уклонения Backtrack на эту атаку не срабатывает.","У Backtrack третий высочайший приоритет в группе эффектов, отрицающих урон. То есть в комбинации с Aphotic Shield или Living Armor Bactrack отрицает урон, в то время, как способности этого не делают.","Вместе с всеми эффектами, манипулирующими уроном, Bactrack может отрицать все 3 типа урона. В среднем усиливает эффективное здоровье Faceless Void на 33%.","Полностью игнорирует урон, помеченный как отнимающий здоровье."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением."],"cooldown":"0","name":"Backtrack","description":["Шанс срабатывания: 25%"]}],"bio":"Дарктеррор явился из Класзурема, мира вне времени. Остаётся загадкой, почему битва за Осколки привлекла существо из иного измерения в наш физический мир. Вероятно, разлад в гармонии нашей вселенной ощутим и в соседних измерениях. Для Дарктеррора время ничтожно. Это лишь инструмент, что помогает союзникам и обременяет противников. Способность видеть прошлое и будущее бытия сделала гостя из иного мира отстранённым, даже безразличным, однако в бой он стремится с необычайным рвением.","talentsTips":["Талант на силу в общем даёт Faceless Void: 200 здоровья, 1 регенерации здоровья и 0,8% сопротивления магии.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["В DotA, любительское\\шуточное имя Faceless Void было Gorzerk.","При смерти Faceless Void произносит фразу, \"Unkind…Rewind\" является отсылкой к одной фразе, \"Be Kind, Rewind\", которую говорили работники видеопроката, чтобы напомнить клиентам отмотать к началу взятые напрокат VHS-кассеты, перед возвращением в магазин. Нечестным, в отношении к нему, является то, что он уже не может отмотать всё к началу.","Фраза, которую Faceless Void произносит при возрождении, \"In the land of time, the no-eyed man is king.\" является отсылкой к фразе Дезидерия Эразма: \"В стране слепых, одноглазый будет Королём.\""],"talents":["+175 к радиусу Chronosphere:+25% к универсальному уклонению от Backtrack","+450 к дальности Time Walk:+45 к скорости атаки","-1,5 сек. перезарядки Time Walk:+70 к урону от Time Lock","+10 к силе:+15 к урону"],"desc":"Faceless Void — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Time Walk, совершает рывок к указанной точке, давая Вам возможность легко заходить и выходить из сражений и вернуть полученный недавно урон. С помощью Time Dilation, Вы можете остановить перезарядку способностей противника, также понизить скорость их атаки и передвижения. Пассивная способность, Time Lock, дает шанс оглушить противника нанося при этом дополнительный урон. Ультимативная способность, Chronosphere, позволяет создавать сферу, которая останавливает всех существ внутри, раскрывает невидимость противников и сильно увеличивает скорость передвижения героя внутри. Улучшение Aghanim's Scepter уменьшает время перезарядки сферы."}