{"abilities":[{"spell":"Burns an opponent's mana on each attack. Mana Break deals 50% of the mana burned as damage to the target.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of and cleave, but it is not considered by crit. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.","Applies the mana loss first, and then the damage.","Does not work against allied units when attacking them.","Does not stack with Diffusal Blade's Manabreak."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Mana Break","description":["Mana Burned per Hit: 25\/30\/35\/40","Max Mana Burned per Hit: 1%\/2%\/3%\/4%","Burned Mana as Damage: 50%"],"hot_key":"Q","legacy_key":"R"},{"spell":"Short distance teleportation that allows Anti-Mage to move in and out of combat.","effects":["Ability Target Point","Affects Self"],"notes":["Blink disjoints projectiles upon cast.","Does not blink for the full distance when targeting closer than the max distance.","When targeting beyond the max blink distance, Anti-Mage will blink for the max distance towards the targeted point.","The illusion created by the talent is created on Anti-Mage's original cast location, facing the direction he blinked to. The illusion cannot act, so it is completely uncontrollable. The illusion is not invulnerable, and can be attacked and killed normally. The illusion automatically attacks the first enemy coming within its acquisition range. It uses default auto-attack rules, meaning it always attacks the closest enemy, and does not stick to the first target it attacks. When no enemies are nearby, the illusion just idles in place, only moving when getting aggroed. The illusion ignores the player's auto-attack settings and is always in auto-attack mode. When Enchanting the illusion, it still dies within 10 seconds, despite its timer being visually increased."],"mana":"60","elements":["Cannot be cast while rooted or leashed."],"cooldown":"15\/12\/9\/6 ( 12.5\/9.5\/6.5\/3.5)","name":"Blink","description":["Cast Animation: 0.4+0.53","Cast Range: Global","Max Blink Distance: 925\/1000\/1075\/1150 ( 1325\/1400\/1475\/1550)","Illusion Damage Dealt: 0% ( 25%)","Illusion Damage Taken: 0% ( 350%)","Illusion Duration: 0 ( 10)"],"hot_key":"W","legacy_key":"B"},{"spell":"Passively grants you magic resistance. Can be activated to create an anti-magic shell around you that sends any targeted spells back towards enemies instead of affecting you.","effects":["Ability No Target","Affects Self"],"notes":["Stacks multiplicatively with other sources of magic resistance.","Increases Anti-Mage's total magic resistance to 36.25%\/43.75%\/51.25%\/58.75% ( 55%\/62.5%\/70%\/77.5%).","Interrupts Anti-Mage's channeling spells on cast.","Linken's Sphere, Lotus Orb, and Mirror Shield do not trigger for Anti-Mage while Counterspell is active.","Unlike Lotus Orb, does not reflect Phantom Strike and Blink Strike. They do get blocked still."],"mana":"45\/50\/55\/60","elements":["Cannot be used by illusions.","Disabled by Break."],"cooldown":"15\/11\/7\/3","name":"Counterspell","description":["Cast Animation: 0+0","Magic Resistance Bonus: 15%\/25%\/35%\/45% ( 40%\/50%\/60%\/70%)","Shell Duration: 1.2"],"hot_key":"E","legacy_key":"C"},{"spell":"For each point of mana missing by the target unit, damage is dealt to it and surrounding enemies. The main target is also mini-stunned.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The targeting reticule must be centered over an enemy unit.","The damage is calculated based on the primary target's mana, but applied to all enemies within the radius.","Mana Void first applies the debuff, then the damage.","Only the primary target gets stunned.","Can be cast on units without a mana pool, applying the mini-stun only.","Plays a sound effect during the cast time, which is audible to everyone.","When upgraded with Aghanim's Scepter, places the Mana Void buffer debuff on all hit enemy heroes (including illusions and clones, excluding creep-heroes) within the area. This debuff lasts for 1.3 seconds, just like the increased stun duration. If an enemy dies with this debuff, the duration of it gets extended until they respawn. When a hero respawns with that debuff, it gets replaced by the Mana Void debuff, which puts the hero's highest cooldown ability on a 100-second cooldown. If that ability already is on cooldown, 100 seconds get added on top of it instead. If the hero has multiple highest cooldown abilities with the same cooldown, the left-most one of them has its cooldown increased. The debuff's icon is based on whatever ability's cooldown it increased. The debuff persists death. Only Cooldown resetting effects can remove it. The cooldown cannot be reduced with Chakra Magic, but can be further increased with Time Dilation."],"mana":"125\/200\/275","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"70 ( 20)","name":"Mana Void","description":["Cast Animation: 0.3+0.63","Cast Range: 600","Radius: 500","Damage per Missing Mana: 0.8\/0.95\/1.1","Kill Cooldown Increase: 0 ( 100)","Stun Duration: 0.3 ( 1.3)"],"hot_key":"R","legacy_key":"V"}],"bio":"The monks of Turstarkuri watched the rugged valleys below their mountain monastery as wave after wave of invaders swept through the lower kingdoms. Ascetic and pragmatic, in their remote monastic eyrie they remained aloof from mundane strife, wrapped in meditation that knew no gods or elements of magic. Then came the Legion of the Dead God, crusaders with a sinister mandate to replace all local worship with their Unliving Lord's poisonous nihilosophy. From a landscape that had known nothing but blood and battle for a thousand years, they tore the souls and bones of countless fallen legions and pitched them against Turstarkuri. The monastery stood scarcely a fortnight against the assault, and the few monks who bothered to surface from their meditations believed the invaders were but demonic visions sent to distract them from meditation. They died where they sat on their silken cushions. Only one youth survived--a pilgrim who had come as an acolyte, seeking wisdom, but had yet to be admitted to the monastery. He watched in horror as the monks to whom he had served tea and nettles were first slaughtered, then raised to join the ranks of the Dead God's priesthood. With nothing but a few of Turstarkuri's prized dogmatic scrolls, he crept away to the comparative safety of other lands, swearing to obliterate not only the Dead God's magic users--but to put an end to magic altogether.","talentsTips":["The strength talent effectively grants Anti-Mage 260 health, 1.3 health regen and 1.04% magic resistance.","The agility talent effectively grants Anti-Mage 2.4 armor, 15 attack speed, 0.75% movement speed and 15 attack damage."],"trivia":["In DotA, Anti-Mage's full name and title was \"Magina, the Anti-Mage\"; in Dota 2, his name was removed for unspecified reasons. In DotA, Anti-Mage has a chance to spawn with \"BurNIng\" as name, instead of Magina, which is a tribute to the professional DotA player BurNIng.","In DotA, Anti-Mage and Terrorblade were brothers. This was to be kept in Dota 2 based on certain responses Anti-Mage made in Terrorblade's presence, but upon Terrorblade's release, these relations were severed and thus the lines went unused.","In DotA, Anti-Mage was blind, due to the model of the Warcraft III character he used, Illidan Stormrage, who was blind."],"talents":["-50s Mana Void Cooldown:+25% Counterspell Magic Resistance","-2.5s Blink Cooldown:Blink Uncontrollable Illusion","+15 Agility:+400 Blink Cast Range","+20 Attack Speed:+13 Strength"],"desc":"Anti-Mage is a fast melee agility hero with an emphasis on disrupting and killing high-mana enemies. He has notably high agility and low base attack time, giving him high damage and scaling with his basic attacks. His signature ability is Mana Break, a passive attack modifier that makes him a huge threat to mana-reliant heroes, mainly Intelligence-based casters. In addition to granting substantial bonus damage on each attack, its mana burn sets enemies up to be devastated by his ultimate ability, Mana Void. Blink is a highly versatile ability that allows Anti-Mage to instantly teleport short distances, thereby allowing him to escape, chase, and even farm with ease. Combined with his high base movement speed, this makes Anti-Mage a highly mobile hero at all points in the game. Counterspell greatly increases Anti-Mage's magic resistance, allowing him to sustain more damage from enemy casters. Finally, Mana Void finishes off targets after their mana has been burned, inflicting heavy damage to both the target and enemies surrounding the target. The damage Mana Void can potentially deal scales extremely well into the late game, as enemies' mana pools only grow larger over time. His naturally fast basic attacks combined with his powerful abilities make him extremely dangerous in the late game, allowing him to devastate enemies with ease if he is allowed to farm as a hard carry."}