{"abilities":[{"spell":"Сжигает ману врага с каждым ударом. Mana Break наносит противнику урон в размере 50% от сожженной маны.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.","В среднем усиливает урон Anti-Mage на 14\/20\/26\/32, если у юнита достаточно маны для выжигания.","Сначала сжигает ману, затем наносит урон.","Не действует на союзных юнитов при атаке.","Не складывается с Manabreak Diffusal Blade."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Mana Break","description":["Сжигает маны за удар: 28\/40\/52\/64","Урон от сожженной маны: 50%"],"hot_key":"Q","legacy_key":"R"},{"spell":"Телепортация на короткую дистанцию, позволяющая Anti-Mage врываться в схватку и быстро возвращаться назад.","effects":["Способность Направленная на точку","Действует на Себя"],"notes":["Blink можно использовать для избегания летящих снарядов.","Не телепортирует на полное расстояние при выборе точки, находящейся на меньшем расстоянии, чем максимальное.","При выборе точки, находящейся дальше, чем это позволяет способность, дистанция перемещения будет максимальной.","Иллюзия от таланта создается на месте использования Anti-Mage способности, обращенная в направлении конечной точки. Иллюзия не может действовать, поэтому она неподконтрольная. Иллюзия не неуязвимая, поэтому её можно атаковать и убить как обычную. Иллюзия автоматически атакует ближайшего врага, оказавшегося в пределах дальности обнаружения. Иллюзия использует стандартные правила авто-атаки, то есть всегда атакует ближайшего врага и не следует за первой атакованной целью. Если поблизости нет врагов, то иллюзия будет оставаться на месте и двигаться только в случае, если кто-то окажется поблизости. Иллюзия игнорирует настройки авто-атаки игрока, для неё авто-атака всегда включена. При приручении с помощью Enchant иллюзия все равно умирает через 10 секунд, несмотря на визуально увеличенный таймер."],"mana":"60","elements":["Нельзя применять в оцепенении."],"cooldown":"15\/12\/9\/6 ( 12.5\/9.5\/6.5\/3.5)","name":"Blink","description":["Анимация применения: 0,4+0,53","Дальность применения: Глобальная","Макс. дальность телепортации: 925\/1000\/1075\/1150 ( 1325\/1400\/1475\/1550)","Иллюзия наносит урона: 0% ( 25%)","Иллюзия получает урона: 0% ( 350%)","Длительность иллюзии: 0 ( 10)"],"hot_key":"W","legacy_key":"B"},{"spell":"Увеличивает сопротивление магическому урону. Можно применить, чтобы создать вокруг себя противомагический щит, который полностью отражает все направленные заклинания обратно во врага.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Сочетается мультипликативно с другими источниками сопротивления магии.","Увеличивает общее значение сопротивления магии Anti-Mage до 36.25%\/43.75%\/51.25%\/58.75% ( 55%\/62.5%\/70%\/77.5%).","Counterspell уходит на перезарядку только при успешной блокировке заклинания, а не при отражении (как, например, Toss). Если у Anti-Mage есть предмет или бафф от Linken's Sphere, то он заблокирует заклинание только если Counterspell находится на перезарядке. Если у Anti-Mage есть бафф Echo Shell от Lotus Orb, то он заблокирует заклинание только если Counterspell находится на перезарядке. Counterspell не отражает заклинания, отраженные Echo Shell (отраженные заклинания повторно не отражаются). Эффект использует обычную перезарядку, поэтому на неё действуют любые эффекты, манипулирующие перезарядкой. В отличии от Lotus Orb способность не отражает Phantom Strike и Blink Strike. Эти способности просто блокируются."],"mana":"45\/50\/55\/60","elements":["Не может использоваться иллюзиями.","Отключается истощением."],"cooldown":"15\/11\/7\/3","name":"Counterspell","description":["Анимация применения: 0+0","Доп. сопротивление магии: 15%\/25%\/35%\/45% ( 40%\/50%\/60%\/70%)","Длительность: 1,2"],"hot_key":"E","legacy_key":"E"},{"spell":"За каждую отсутствующую у цели единицу маны ей и окружающим противникам наносится урон. Основная цель кратковременно оглушается.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Перекрестие указателя должно выделять вражеского юнита.","Урон основывается на количестве маны у основной цели, но урон наносится всем противникам в радиусе действия способности.","Mana Void сначала применяет дебафф, затем наносит урон.","Только основная цель будет оглушена.","При использовании на юнитов без запаса маны применяет только мини-оглушение.","Звуковой эффект проигрывается во время применения и слышен всем."],"mana":"125\/200\/275","elements":["Частично блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"70 ( 20)","name":"Mana Void","description":["Анимация применения: 0,3+0,63","Дальность применения: 600","Радиус: 500","Урон за единицу отсутствующей маны: 0.8\/0.95\/1.1","Длительность оглушения: 0.3"],"hot_key":"R","legacy_key":"V"}],"bio":"Монахи Турстаркури смиренно глядели на неровные долины, раскинувшиеся под их горным монастырём, пока вторженцы волна за волной опустошали стоявшие в низинах королевства. Аскетичные и приземлённые, монахи оставались в своём далёком от суетного мира высокогорном гнезде и пребывали в медитации, не знавшей никаких богов и никакого волшебства. Прошло время, и грянул легион Мертвого бога — крестоносцы родом из земель, уж тысячу лет знавших лишь кровь и войну, уничтожающие все местные культы и заменяющие их губительным замыслом неживого властителя. Легионы мертвецов, лишённых душ и костей, осадили Турстаркури. Две недели монастырь едва сдерживал натиск врагов. Те немногие отшельники, что прервали медитацию, лишь приняли битву за бесовские видения, отвлекающие от раздумий. Их убили прямо на шёлковых монашеских подстилках. Выжил лишь один юный послушник — пилигрим, пришедший в поисках мудрости, но еще не принятый в монастырь. С ужасом он смотрел, как гибли монахи, которым он еще недавно подавал чаи и травы, и как они восставали вновь, единые со служителями Мёртвого бога. Схватив охапку ценнейших священных писаний, он бежал в тогда ещё благополучные земли, поклявшись не только искоренить армию колдунов Мёртвого бога, но и положить конец любой магии.","talentsTips":["Талант на силу в общем даёт Anti-Mage: 200 здоровья, 1 регенерации здоровья и 0.8% сопротивления магии.","Талант на ловкость в общем даёт Anti-Mage: 2.4 брони, 15 скорости атаки, 0.75% скорости передвижения и 15 урона от атаки."],"trivia":["В DotA имя Anti-Mage было Magina, но в Dota 2 его имя было удалено без указания причин.","В DotA, Anti-Mage был братом Terrorblade, однако в Dota 2 они не братья. В репликах героя есть упоминания о том, что Terrorblade является ему братом, однако, в биографии и репликах Terrorblade это не упоминается. В обновлении от 29 января 2014 года, реплики Anti-Mage, связанные с героем Terrorblade, были удалены из игры."],"talents":["-50 сек. перезарядки Mana Void:+25% к сопротивлению от Counterspell","-2,5 сек. перезарядки у Blink:Blink создает неконтролируемую иллюзию","+15 к ловкости:+400 к дальности Blink","+20 к скорости атаки:+10 к силе"],"tips":["Blink на 1 уровне нужно качать в любом случае. Качайте Counterspell, если вы столкнулись с сильными соперниками. Если вам хорошо живется на линии, то качайте Mana Break и пытайтесь атаковать соперников на линии (ведя себя агрессивно).","Blink лучший механизм спасения\/нападения в игре. Вы также можете использовать его, чтобы уклоняться от готовящихся заклинаний противника. Также, данной способностью можно телепортироваться в леса, за «пределы карты». Задержка перед телепортацией составляет 0.4 секунды, и минимальная дальность, на которую герой способен телепортироваться составляет 200 единиц.","Anti-Mage имеет относительно низкий запас здоровья. Если у вас ещё не собраны основные артефакты и вы не можете убить врага за пару ударов, то не гонитесь за ним слишком долго. В любое время ситуация может выйти из под контроля, и враги убьют вас.","Хотя Counterspell защищает вас от магического урона, помните, что это не избавит вас от замедлений, оглушений и других обездвиживающих заклинаний. Общая магическая защита героя на максимальном уровне Counterspell составляет 62.50%.","Mana Void трудно использовать в полную силу. Постоянно проверяйте врагов с большим количеством маны и используйте заклинание на врага, когда тот потратит много своей маны. Оглушение данной способности срабатывает и против героев с неуязвимостью к магии.","Быстрая покупка Battle Fury значительно упростит добычу золота. Собрав данный предмет на ранней стадии игры позволит быстро добивать лесных крипов, что с свою очередь, увеличит скорость покупки других предметов."],"desc":"Anti-Mage — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Его первая пассивная способность, Mana Break, сжигает ману врага за каждый удар. Mana Break наносит противнику урон в размере 50% от сожженной маны. Вторая способность, Blink, позволяет Anti-Mage телепортироваться на короткое расстояние. Третья способность, Counterspell, увеличивает сопротивление Anti-Mage магическому урону, а также даёт ему возможность блокировать и отразить любое направленное вражеское заклинание. Ультимативная способность, Mana Void, наносит урон цели за каждую отсутствующую у нее единицу маны. Окружающим противникам также наносится урон. Основная цель кратковременно оглушается."}