{
  "abilities": [
    {
      "notes": [
        "Despite the visual effects, the Searing Chains' effects are applied instantly and cannot be disjointed",
        "The units are selected randomly within its search radius\n There are no priorities",
        "Roots the targets, preventing them from moving and casting certain mobility abilities\n Provides True Sight over the targets",
        "Does not target invisible units or units inside the Fog of War",
        "Deals damage in 0.5-second intervals, starting 0.5 seconds after cast, resulting in 3\/4\/5\/6 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 5\/6\/7\/8) damage instances\n Can deal up to 75\/140\/225\/330 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 125\/210\/315\/440) damage to each unit",
        "Successive casts do not update the current debuff instance but refresh the duration instead\n The current debuff instance must expire first for the ability values to be updated"
      ],
      "item_behaviour": [],
      "description": "Ember Spirit unleashes fiery bolas that wrap around nearby enemies, anchoring them in place and dealing damage each second.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0.5",
        "Search Radius: 400",
        "Max Targets: 2 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3)",
        "Damage per Second: 50\/70\/90\/110",
        "Duration: 1.5\/2\/2.5\/3 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 2.5\/3\/3.5\/4)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Ember_Spirit_Searing_Chains_1.mp3\/revision\/latest?cb=20191216013535",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "13\/12\/11\/10",
      "aghanim": null,
      "name": "Searing Chains",
      "cooldown": "80\/90\/100\/110",
      "legacy_key": "C",
      "story": "Xin's harshest lessons often employed the use of red-hot chains."
    },
    {
      "notes": [
        "Does not disjoint projectiles upon cast",
        "Ember Spirit is invulnerable during Sleight of Fist",
        "During Sleight of Fist, this ability is inactive, so it cannot be recast until the current cast finishes\n Ember Spirit is only disarmed during Sleight of Fist, other actions besides attacking can be performed normally during it",
        "Upon cast, all targets within the area are marked at the same time\n A flaming sword appears above them as an indicator, which lasts until they get hit\n Units entering the effect radius afterward are neither marked nor attacked\n Sleight of Fist has no range limit\n Once a target is marked, it cannot escape Sleight of Fist with distance\n Does not mark invisible or attack immune units\n A marked target is fully skipped, when they turn invisible, turn attack immune, or when they die\n Fully affects units in the Fog of War, they are also marked on cast and get hit as well",
        "Jumps in 0.2-second intervals\n The jumps are random between all marked units, there are no priorities\n On each jump, Ember Spirit is positioned 50 range away from his target, on a line between the target and the cast location of Sleight of Fist\n Causes Ember Spirit to perform an instant attack on each jump against the targets\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They do not have True Strike\n If Ember Spirit is disarmed, no instant attack is performed on the jump\n The instant attack of Sleight of Fist does not break <span image=\"items\/smoke_of_deceit\/full.webp\">[picture:smoke_of_deceit]<\/span> Disguise only when attacking creeps\n Fully ignores <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers",
        "Sleight of Fist's damage is considered as a conditional attack damage bonus\n Although the hero attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Ember Spirit's attack damage\n The attack damage bonus is considered by critical strike, cleave, and lifesteal, and it can be reduced only by flat reductions (e.g\n damage block)\n Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions\n Treats creep-heroes as creeps",
        "After all marked targets have been slashed, Ember Spirit returns to the position he had upon casting Sleight of Fist\n That position is marked by a fiery replica of Ember Spirit for the duration",
        "Casting <span image=\"images\/activate_fire_remnant.webp\">[picture:activate_fire_remnant]<\/span> Activate Fire Remnant cancels Sleight of Fist\n However, other sources of forced movement do not",
        "TALENT NOTES Acquiring the Sleight of Fist charges <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent instantly grants 1 extra charge"
      ],
      "item_behaviour": [],
      "description": "Ember Spirit dashes around with blazing speed, attacking all enemies in the targeted area of effect, then returning to his start location. Deals bonus damage to heroes.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0.7",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 650",
        "Effect Radius: 250\/350\/450\/550",
        "Jump Interval: 0.2",
        "Hero Attack Damage Bonus: 45\/80\/115\/150 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 110\/145\/180\/215)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Ember_Spirit_Sleight_of_Fist.mp3\/revision\/latest?cb=20191216013536",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies \/ Self",
        "Damage: Instant Attack"
      ],
      "mana": "15\/12\/9\/6 (TagTalent 0)",
      "aghanim": null,
      "name": "Sleight of Fist",
      "cooldown": "15\/12\/9\/6",
      "legacy_key": "T",
      "story": "The studied warrior must whip and weave through its enemies, burning each without pause."
    },
    {
      "notes": [
        "Deals 5\/7\/9\/11 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 15\/17\/19\/21) damage in 0.2-second intervals, starting 0.2 seconds after cast\n Can deal a total of 275\/490\/765\/1100 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 825\/1190\/1615\/2100) damage to a single unit, if it lasts the full duration (before reductions)",
        "Only blocks 70% of incoming magical damage from abilities and attacks\n Does not block any physical or pure damage\n Blocks damage before reductions, except <span image=\"images\/mana_shield.webp\">[picture:mana_shield]<\/span> Mana Shield\n The buff is lost upon collectively taking 121\/271\/421\/571 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 407\/557\/707\/857) magical damage\n This means a total of 36\/81\/126\/171 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 122\/167\/212\/257) magical damage bypasses the shield before its capacity is reached",
        "Successive casts refresh the buff and reset the magical damage absorb capacity",
        "Does not stack with other magical damage barriers\n If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance\n However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity"
      ],
      "item_behaviour": [],
      "description": "Ember Spirit surrounds himself with a ring of fire that consumes incoming magic damage, absorbing a percentage of the damage taken. Flame Guard deals damage per second in an area around Ember Spirit while Flame Guard is active. If the shield is broken, the damage is also lost.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0.6",
        "Damage Radius: 400",
        "Damage per Second: 25\/35\/45\/55 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 75\/85\/95\/105)",
        "Absorb Percentage: 70%",
        "Magical Damage Absorbed: 85\/190\/295\/400 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 285\/390\/495\/600)",
        "Duration: 11\/14\/17\/20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Ember_Spirit_Flame_Guard.mp3\/revision\/latest?cb=20191216013533",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "35",
      "aghanim": null,
      "name": "Flame Guard",
      "cooldown": "65\/80\/95\/110",
      "legacy_key": "E",
      "story": "An enemy should never be allowed to approach without difficulty."
    },
    {
      "notes": [
        "Ember Spirit travels to a <span image=\"images\/fire_remnant.webp\">[picture:fire_remnant]<\/span> Fire Remnant with a speed of 1300 if it can be reached within 1 second at that speed, or reaches it in 0.4 seconds\n Therefore, Ember Spirit travels even faster when the distance between two Fire Remnants is greater than 520\n Ember Spirit is invulnerable while traveling to a Fire Remnant",
        "The mana cost of Activate Fire Remnant is always the same, regardless of how many remnants he is traveling to with a single cast",
        "Always travels to the Fire Remnant furthest away from the targeted point first\n While traveling, Ember Spirit cannot turn but can attack, cast abilities, and use items\n Using items still requires Ember Spirit to face his targets",
        "Other forced movement sources cancels the movement of Activate Fire Remnant and removes its invulnerability\n However, the remnants still get used up and Ember Spirit is teleported instantly to the last remnant's location once it explodes",
        "Ember Spirit damages enemies within a 225 radius around him as he travels, and in a 450 radius around a remnant upon reaching it\n Enemies may only be damaged once per remnant, either by Ember Spirit as he travels towards the remnant, or by him upon reaching the remnant",
        "Destroys trees Ember Spirit come in contact with within 200 radius while traveling to a remnant\n Though at high traveling speeds, some trees may be skipped and not destroyed\n SPELL STEAL Upon losing this ability while traveling to a Rubick Remnant, <span image=\"images\/rubick_minimap.png\">[picture:rubick_minimap]<\/span> Rubick stops after reaching to the current remnant"
      ],
      "item_behaviour": [],
      "description": "Select the Fire Remnant to arrive at.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.1+0.5",
        "Cast Range: Global",
        "Remnant Damage Radius: 450",
        "Remnant Damage: 100\/200\/300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Ember_Spirit_Activate_Fire_Remnant.mp3\/revision\/latest?cb=20191216013542",
      "effects": [
        "Ability: Target Point",
        "Affects: Self \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Activate Fire Remnant",
      "cooldown": "100\/125\/150",
      "legacy_key": "R",
      "story": "With blazing speed does a spirit fly!"
    },
    {
      "notes": [
        "Ember Spirit gets all 3 charges immediately upon learning Fire Remnant\n SCEPTER NOTES Acquiring <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter the first time instantly grants 2 charges as well\n This only happens once, so re-acquiring it does not grant them again\n Losing the item does not reduce the current number of available charges",
        "Fire Remnants move to their targeted location at a speed of based on Ember Spirit's current movement speed\n With the movement speed limits, the remnant's minimum and maximum travel speed to their targeted location is 250 ‒ 1375 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 500 ‒ 2750) respectively\n The movement speed is set upon cast and does not adapt",
        "Since Fire Remnants last for 45 seconds and the replenish time is 38 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 26) seconds, it is possible to have 4 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 4) (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 6, <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 6) remnants up at a time",
        "Every time a Fire Remnant is placed, Ember Spirit gets a status buff, showing the duration of the remnant\n The status buff disappears once the Remnant expires or is used",
        "Fire Remnants are visible to everyone\n They do not grant any vision and cannot be seen when sent into the Fog of War",
        "Fire Remnants deal no damage when they expire",
        "SHARD NOTES Fire Remnants now deal 22.5 damage in 0.5-second intervals, starting 0.5 seconds after receiving the debuff\n The fire remnants start dealing damage as soon as they are created, so they already deal damage while traveling toward their destination\n The damage from multiple remnants with overlapping areas does not stack\n Can deal up to 2047.5 damage within 600 radius for the entire duration\n The damage is sourced to Ember Spirit, and not to the remnants themselves\n The damage is provided by an aura and its debuff lingers for 0.5 seconds",
        "SHARD NOTES Fire Remnant now also replenishes a single charge in the following conditions: Any enemy hero kill, including clones, done by the Fire Remnant's owner\n Does not replenish charges when enemies or allies are being denied, killing an illusion or creep-hero unit\n A charge is replenished even if the dying hero has Reincarnation\n Whenever an enemy hero dies within 400 range",
        "SHARD NOTES When Ember Spirit dies, he also leaves behind a Fire Remnant at his death location\n The Fire Remnant cast does not use up a charge, lasts its full duration, is not bound to Ember Spirit's death timer, and does not disappear when he respawns\n It also triggers with Reincarnation sources\n SPELL STEAL Creates a <span image=\"images\/rubick_minimap.png\">[picture:rubick_minimap]<\/span> Rubick remnant instead\n Existing remnants from previous cast cannot be used again despite re-acquring the ability"
      ],
      "item_behaviour": [],
      "description": "Sends a Fire Remnant that runs to the target location at 250% Ember Spirit's speed. Using Activate Fire Remnant, Ember Spirit will dash out to all active Fire Remnants, destroying them and dealing damage in an area and then moving to the nearest Remnant. Ember Spirit will end at the Remnant closest to the targeted location.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.1+0.5",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 1400 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 3000)",
        "Remnant Travel Speed: 250% (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 500%)",
        "Remnant Duration: 45",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Enemy Death Radius:  400",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Damage Radius:  600",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Damage per Second:  45"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Ember_Spirit_Fire_Remnant_1.mp3\/revision\/latest?cb=20191216013530",
      "effects": [
        "Ability: Target Point",
        "Affects: ",
        "Damage: "
      ],
      "mana": "0.5",
      "aghanim": null,
      "name": "Fire Remnant",
      "cooldown": "38 ( 26)",
      "legacy_key": "F",
      "story": "By the spirit's power are Xin's teachings spread anew."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 3.2,
    "attrAgility": 22.0
  },
  "description": "Rapidly strikes and chains his foes. Impressed by the teachings of Xin, the Burning Celestial breathed life into the warrior-poet's ashes, and from there an image of Xin appeared, born anew as the Ember Spirit. Swift and elusive, the great teacher dashes through his opponents, striking each foe once with a Sleight of Fist before returning to his original spot. He immobilizes enemies with Searing Chains, holding them in place against the scorching heat of his Flame Guard. Across the land, Xin's glowing likenesses stand silent guard. The Ember Spirit arrives at his Fire Remnant from impossible distances, catching the unprepared in a burst of flame before they surrender their lives to Xin's burning blades.  Carry Escape Nuker Disabler Initiator ★★☆",
  "trivia": [
    "Ember Spirit, like Brewmaster, Earth Spirit, and Storm Spirit, was a Pandaren in DotA. However, he was re-skinned to avoid copyright issues with Blizzard Entertainment, since Pandaren are a race of creatures in the Warcraft Universe.",
    "The hat on Ember Spirit's back was originally intended to be worn on his head. This model and positioning can still be seen when using Ember Spirit's Hat, a cosmetic item that was made available via drops when Ember Spirit was released.",
    "Most of Ember Spirit's responses are exactly four words long, a reference to four-character Chinese idioms known as chengyu. According to Xin himself: Link▶️ \"Four words is plenty.\""
  ],
  "history": "Lost within the Wailing Mountains, the Fortress of Flares lay abandoned, its training halls empty, its courtyard covered in leaves and dust. Upon a dais in its sealed temple rests a topaz cauldron filled with ancient ash, remnants of a pyre for the warrior-poet Xin. For three generations, Xin taught his acolytes the Bonds of the Guardian Flame, a series of mantras to train the mind and body for the harsh realities beyond the fortress walls. However, in teaching a warrior's way he earned a warrior's rivals, and in his autumn Xin was bested and slain. His followers spread to the wind. Yet as years turned to centuries and followers to descendants, his teachings endured by subtle whisper and deed. Touched by the teacher's lasting legacy, the Burning Celestial, inquisitive aspect of fire, cast himself to the Fortress of Flares and reignited the pyre ash. From these glowing embers emerged an image of Xin, wreathed in flame, his thoughtful countenance prepared to train and to teach, and to spread the fires of knowledge to all who seek guidance.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "2 Sleight of Fist Charges",
        "talent_left": "-12s Remnant Charge Restore Time"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+1 Searing Chains Target",
        "talent_left": "+65 Sleight of Fist Hero Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+50 Flame Guard DPS",
        "talent_left": "+1s Searing Chains"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+15 Damage",
        "talent_left": "+200 Flame Guard Absorption"
      }
    ],
    "notes": [
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
    ]
  }
}