{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Orchid_Malevolence_Soul_Burn.mp3\/revision\/latest?cb=20191227195517",
      "effects": [
        "Дальность применения: 900",
        "Увеличение урона: 30%",
        "Длительность: 5"
      ],
      "notes": [
        "Не усиливает урон напрямую при нанесении, вместо этого сохраняет все значения урона и наносит 30% от него через 5 секунд после применения. То есть урон можно избежать, получив в конце действия иммунитет к заклинаниям или став неуязвимым\/спрятанным.",
        "То есть урон можно избежать, получив в конце действия иммунитет к заклинаниям или став неуязвимым\/спрятанным.",
        "Урон наносится сразу после исчезновения дебаффа. При этом развеивание дебаффа, однако, пропускает урон. Повторное применение Soul Burn на одну и ту же цель обновит длительность. Это отложит урон и даст больше времени для нанесения урона цели. Урон засчитывается последнему применившему Soul Burn на цель.",
        "Повторное применение Soul Burn на одну и ту же цель обновит длительность.",
        "Это отложит урон и даст больше времени для нанесения урона цели.",
        "Урон засчитывается последнему применившему Soul Burn на цель.",
        "Учитывает только магический, физический и чистый урон (после всех уменьшений). Другие источники потери здоровья игнорируются.",
        "Делит перезарядку с Bloodthorn."
      ],
      "mana": "100",
      "abilityName": "Soul Burn",
      "cooldown": "18",
      "description": "Запрещает выбранной цели использовать способности на 5 сек. По окончании эффекта жертве наносится магический урон в размере 30% от урона, полученного за время действия.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3475",
  "lore": null,
  "consistFrom": [
    "Blitz Knuckles",
    "Claymore",
    "Void Stone",
    "Recipe"
  ],
  "name": "Orchid Malevolence",
  "description": "Гранатовый посох, выкованный из сущности огненного демона.",
  "trivia": null,
  "upgradeIn": [
    "Bloodthorn"
  ],
  "tips": null
}