{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Dust_of_Appearance_Reveal.mp3\/revision\/latest?cb=20191227195411",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания.",
        "Накладывает негативный эффект на врагов, в том числе видимых (только значок), в радиусе действия при применении. Вход или выход из радиуса действия после применения не имеет никакого эффекта.",
        "Несмотря на визуальный эффект, негативный эффект, раскрывающий невидимых существ, применяется по всему радиусу мгновенно после использования.",
        "Несколько негативных эффектов не складываются, но обновляют длительность.",
        "Негативный эффект применяется на неуязвимых существ и существ в тумане войны, но не применяется на спрятанных существ и Варды.",
        "Нельзя обнаружить существ под действием Shadow Dance и Smoke of Deceit (хотя негативный эффект применяется на них).",
        "Замедляет только невидимых существ. То есть в момент ухода в невидимость или задержки до неё существо не замедляется."
      ],
      "mana": null,
      "abilityName": "Reveal",
      "cooldown": "30",
      "description": "Делает всех невидимых героев в радиусе 1050 видимыми и замедляет их на 20%. Эффект длится 12 сек.",
      "params": [
        "Радиус: 1050",
        "Замедление скорости передвижения: 20%",
        "Длительность: 12"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складывается с другими Dust of Appearance в инвентаре.",
    "Dust of Appearance полностью передаваемый предмет.",
    "Стоимость продажи зависит от оставшегося количества Dust of Appearance. Один Dust of Appearance имеет стоимость продажи в 40 золота."
  ],
  "cost": "80",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Dust of Appearance",
  "description": "Как ни прячься, а своей плоти не скрыть.",
  "trivia": [
    "До обновления от 14 июля 2017 активная способность Dust of Appearance Reveal не имела официального названия. Название было взято из Dota 2 Wiki и официально выпущено в Dota 2."
  ],
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Негативный эффект легко развеивается некоторыми героями, такими как Weaver.",
    "Предметы, такие как Black King Bar, Lotus Orb, Eul's Scepter of Divinity и Manta Style могут снять негативный эффект. Также рассмотрите другие предметы, которые помогут обнаружить невидимых героев (например, Sentry Ward или Gem of True Sight)."
  ]
}