{
  "abilities": [
    {
      "notes": [
        "The \/ \/ all stats talent effectively grants Spectre 100 health, 0.5 health regeneration, 0.83 armor, 5 attack speed, 60 mana, 0.25 mana regeneration, and 5 main attack damage.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+5% Dispersion",
          "talentRight": "+32% Haunt Illusion Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+14% Spectral Dagger Slow\/Bonus",
          "talentRight": "+400 Health"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 Spectral Dagger Damage",
          "talentRight": "+12 Desolate Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+5 All Stats",
          "talentRight": "-4s Spectral Dagger Cooldown"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Spectre_Spectral_Dagger_1.mp3\/revision\/latest?cb=20191216024330",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The Spectral Dagger travels at a speed of 800.",
        "Can directly target heroes and creep-heroes. When targeting a hero, the dagger homes in on the target until reaching it. When ground-targeted or targeting creep-heroes, the dagger travels 1800 range in a straight line. It does not home in on creep-heroes.",
        "When targeting a hero, the dagger homes in on the target until reaching it.",
        "When ground-targeted or targeting creep-heroes, the dagger travels 1800 range in a straight line. It does not home in on creep-heroes.",
        "Every enemy unit which comes within 125 range of the travelling dagger gets damaged.",
        "Hit enemy heroes and illusions also receive the Dagger Path Creator debuff, making them trail a shadow path like the dagger itself. This debuff also grants shared vision over the enemy heroes, revealing their silhouette when they become invisible.",
        "This debuff also grants shared vision over the enemy heroes, revealing their silhouette when they become invisible.",
        "Spectre and enemies gain the Spectral Dagger Path modifier while on the path, increasing hers while decreasing the enemies' movement speed. This modifier lingers for 4 seconds after leaving the path. The modifier only refreshes from the same source. Meaning that Spectre will not be slowed by an enemy Spectral Dagger when she has the buff modifier.",
        "This modifier lingers for 4 seconds after leaving the path.",
        "The modifier only refreshes from the same source. Meaning that Spectre will not be slowed by an enemy Spectral Dagger when she has the buff modifier.",
        "Spectre also gains a hidden buff, which grants her unobstructed movement. This buff lingers for 1 second after leaving the path.",
        "This buff lingers for 1 second after leaving the path.",
        "The shadow path's segments last 12 seconds from the moment on they were created, not as the ability was cast.",
        "The shadow path grants 200 radius flying vision around itself.",
        "The movement speed changing modifier on Spectre and enemies on the path is dispellable. However, as long as Spectre stays on the path, it immediately gets re-applied on her again. For enemies, the slow debuff does not get re-applied immediately, but does get applied again if they leave the path and enter it again. Dispelling the path creating debuff on enemy heroes stops them from creating or extending the path, but does not remove already created paths.",
        "However, as long as Spectre stays on the path, it immediately gets re-applied on her again.",
        "For enemies, the slow debuff does not get re-applied immediately, but does get applied again if they leave the path and enter it again.",
        "Dispelling the path creating debuff on enemy heroes stops them from creating or extending the path, but does not remove already created paths."
      ],
      "mana": "130\/140\/150\/160",
      "item_behaviour": [],
      "name": "Spectral Dagger",
      "cooldown": "22\/20\/18\/16 (TagTalent 18\/16\/14\/12)",
      "description": "Spectre flings a dagger to draw a Shadow Path, dealing damage and slowing the movement speed of any enemies along the trail. Units hit by the dagger also trail a Shadow Path. While treading the path, Spectre phases through otherwise impassable terrain.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.37",
        "Cast Range: 1800",
        "Effect Radius: 125",
        "Damage: 75\/130\/185\/240 (TagTalent 175\/230\/285\/340)",
        "Move Speed Slow\/Bonus: 10%\/14%\/18%\/22% (TagTalent 24%\/28%\/32%\/36%)",
        "Path Duration: 12",
        "Path Creator Duration: 7",
        "Move Speed Slow\/Bonus Linger Duration: 4",
        "Free Pathing Linger Duration: 1",
        "Can target spell immune enemies, placing the trail and slow debuff on them. The slow debuff is inactive while spell immune.",
        "Procs only when secondary target while a hero was directly targeted. However, Spectral Dagger instantly reattempts to apply the debuff, thus wasting Linken's cooldown. No interaction with the primary target or when hit while the ground was targeted."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Spectre_Desolate.mp3\/revision\/latest?cb=20210103161358",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Desolate's effects are applied upon finishing an attack, regardless of whether the attack actually hits the target or not. This means Desolate applies its effects even when the leading attack misses the target. When used by ranged heroes, Desolate is applied on projectile launch, not when the projectile hit.",
        "This means Desolate applies its effects even when the leading attack misses the target.",
        "When used by ranged heroes, Desolate is applied on projectile launch, not when the projectile hit.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "Works against any enemy unit, except for wards and buildings.",
        "Desolate completely ignores nearby wards, buildings, invulnerable and hidden units. This means that Desolate still deals its damage when the target only has any of the above as allies nearby.",
        "This means that Desolate still deals its damage when the target only has any of the above as allies nearby.",
        "Only checks for allies of the target, meaning nearby neutral creeps do not prevent it from dealing damage to units of the enemy team, and vice versa."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Desolate",
      "cooldown": null,
      "description": "Deals bonus damage whenever Spectre attacks an enemy that does not have any allied units within a 425 radius around them.",
      "hot_key": "W",
      "params": [
        "Radius: 425",
        "Damage: 18\/32\/46\/60 (TagTalent 30\/44\/58\/72)"
      ],
      "legacy_key": "L",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Spectre_Spectral_Dagger_1.mp3\/revision\/latest?cb=20191216024330",
      "effects": [
        "Ability Passive",
        "Affects Self \/ Enemies",
        "Damage Source Type (TagAghanimNo-reflection) (TagAghanimHP Removal)"
      ],
      "notes": [
        "Applies generic incoming damage reduction on Spectre. Stacks additively with other sources of generic incoming damage manipulation. Reflects the 3 damage types, but not HP Removal effects (e.g. Sunder, Soul Ring etc.). Increases Spectre's survivability against any damage by 9%\/14%\/19%\/25% (TagTalent 15%\/20%\/27%\/33%).",
        "Reflects the 3 damage types, but not HP Removal effects (e.g. Sunder, Soul Ring etc.).",
        "Increases Spectre's survivability against any damage by 9%\/14%\/19%\/25% (TagTalent 15%\/20%\/27%\/33%).",
        "Dispersed damage is returned as the same damage type as it was received.",
        "Reflected physical damage is affected by damage block.",
        "The damage from Dispersion is flagged as HP Removal, so it does not trigger any on-damage effects.",
        "Reflects a percentage of the full damage value before Spectre actually takes the damage. This means that it reflects damage before all manipulations, so that it may only be affected by incoming damage manipulation the enemy has. This also means it reflects overkill damage dealt to Spectre. If a damage source exceeded Spectre's current health and killed her, the damage reflected will be the same damage value. If both Spectre and an enemy would die to the damage simultaneously, the enemy is always killed first.",
        "This means that it reflects damage before all manipulations, so that it may only be affected by incoming damage manipulation the enemy has.",
        "This also means it reflects overkill damage dealt to Spectre. If a damage source exceeded Spectre's current health and killed her, the damage reflected will be the same damage value.",
        "If both Spectre and an enemy would die to the damage simultaneously, the enemy is always killed first.",
        "Reflected damage is not shared between enemies within the radius, all of them take the full amount of damage based on their distance.",
        "Reflects the full 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%) within a 300 radius from Spectre. Then the reflected damage decreases linearly up to a 700 radius from Spectre. This is how much damage Dispersion reflects to enemies at certain distances: 300 Distance: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%) of dealt damage. 400 Distance: 6%\/9%\/12%\/15% (TagTalent 9.75%\/12.75%\/15.75%\/18.75%) of dealt damage. 500 Distance: 4%\/6%\/8%\/10% (TagTalent 6.5%\/8.5%\/10.5%\/12.5%) of dealt damage. 600 Distance: 2%\/3%\/4%\/5% (TagTalent 3.25%\/4.25%\/5.25%\/6.25%) of dealt damage.",
        "This is how much damage Dispersion reflects to enemies at certain distances: 300 Distance: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%) of dealt damage. 400 Distance: 6%\/9%\/12%\/15% (TagTalent 9.75%\/12.75%\/15.75%\/18.75%) of dealt damage. 500 Distance: 4%\/6%\/8%\/10% (TagTalent 6.5%\/8.5%\/10.5%\/12.5%) of dealt damage. 600 Distance: 2%\/3%\/4%\/5% (TagTalent 3.25%\/4.25%\/5.25%\/6.25%) of dealt damage.",
        "300 Distance: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%) of dealt damage.",
        "400 Distance: 6%\/9%\/12%\/15% (TagTalent 9.75%\/12.75%\/15.75%\/18.75%) of dealt damage.",
        "500 Distance: 4%\/6%\/8%\/10% (TagTalent 6.5%\/8.5%\/10.5%\/12.5%) of dealt damage.",
        "600 Distance: 2%\/3%\/4%\/5% (TagTalent 3.25%\/4.25%\/5.25%\/6.25%) of dealt damage.",
        "",
        "With Aghanim's Shard, a passive Spectral Dagger triggers when Dispersion collectively reduces 300 damage. Spectral Dagger notes fully apply. If it is not leveled, no dagger is launched. Only counts player-based damage and damage dealt by Roshan. Does not count damage which has the HP removal or the no-reflection flag. Counts damage even while on cooldown, and may instantly release a dagger on the next damage instance once Dispersion is off cooldown again. Counts damage from any distance, but the Spectral Dagger is only released when a damage source is within 700 range of Spectre. The damage counter has no time limit. It only resets once a passive Spectral Dagger is launched. Any exceeding damage is completely ignored. For example, if an enemy deals an instance of 450 damage, it does not carry over to the damage counter for the next proc. The Spectral Dagger is launched towards the location of the last damage source that reached the damage threshold. Does not directly target the unit that procs the passive cast, the dagger always flies in a straight path. Uses a regular cooldown, so it is fully affected by cooldown reductions sources and it can be refreshed as well. Passive Spectral Dagger procs do not cost mana and are independent from the active ability's cooldown.",
        "Spectral Dagger notes fully apply. If it is not leveled, no dagger is launched.",
        "Only counts player-based damage and damage dealt by Roshan. Does not count damage which has the HP removal or the no-reflection flag.",
        "Counts damage even while on cooldown, and may instantly release a dagger on the next damage instance once Dispersion is off cooldown again.",
        "Counts damage from any distance, but the Spectral Dagger is only released when a damage source is within 700 range of Spectre.",
        "The damage counter has no time limit. It only resets once a passive Spectral Dagger is launched.",
        "Any exceeding damage is completely ignored. For example, if an enemy deals an instance of 450 damage, it does not carry over to the damage counter for the next proc.",
        "The Spectral Dagger is launched towards the location of the last damage source that reached the damage threshold.",
        "Does not directly target the unit that procs the passive cast, the dagger always flies in a straight path.",
        "Uses a regular cooldown, so it is fully affected by cooldown reductions sources and it can be refreshed as well.",
        "Passive Spectral Dagger procs do not cost mana and are independent from the active ability's cooldown."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Dispersion",
      "cooldown": null,
      "description": "Damage done to Spectre is reflected on her enemies, leaving her unharmed. The effect lessens with distance.",
      "hot_key": "E",
      "params": [
        "Min Radius: 300",
        "Max Radius: 700",
        "Damage Reflected: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%)",
        "Spectral Dagger Max Trigger Distance: 700",
        "Spectral Dagger Damage Threshold: 300",
        "Causes dispersion to fire a spectral dagger every 300 damage absorbed in the direction of the last source of damage. Can fire a maximum of one dagger every 7 seconds and only triggers off player based damage within 700 range",
        "All aspects ignore spell immunity, including the passive Spectral Dagger, which are launched on spell immune units as well.",
        "All aspects are disabled, including the passive Spectral Daggers."
      ],
      "legacy_key": "I",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Spectre_Reality.mp3\/revision\/latest?cb=20191216024328",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Self"
      ],
      "notes": [
        "Reality is unlocked upon learning Haunt and always stays active.",
        "Does not disjoint projectiles upon cast.",
        "When ground-targeted, Spectre exchanges places with the closest Haunt-based illusion from the targeted point.",
        "Can be cast multiple times until Haunt ends or all Haunt illusions are dead.",
        "After swapping positions, the Haunt illusion still walks towards its target and attacks it."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Reality",
      "cooldown": null,
      "description": "Spectre exchanges places with a chosen Haunt.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0.7",
        "Cast Range: Global"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1a\/Spectre_Shadow_Step_1.mp3\/revision\/latest?cb=20210103160705",
      "effects": [
        "Ability Target Unit",
        "Affects Enemy Heroes",
        "Damage Magical"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Shadow Step's level is always equal to Haunt's level. The illusion notes of Haunt apply to Shadow Step as well.",
        "The illusion notes of Haunt apply to Shadow Step as well.",
        "Instantly applies the current level of Spectral Dagger on the target, without using a projectile. Spectral Dagger notes fully apply. If it is not leveled, no buffs or debuffs are applied.",
        "Spectral Dagger notes fully apply. If it is not leveled, no buffs or debuffs are applied.",
        "Cannot be cast on creep-heroes."
      ],
      "mana": "180",
      "item_behaviour": [],
      "name": "Shadow Step",
      "cooldown": "40",
      "description": "Allows Spectre to perform a single target unit Haunt. Casts Spectral Dagger on the target.",
      "hot_key": "F",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: Global",
        "Illusion Damage Dealt: 40%\/60%\/80% (TagTalent 72%\/92%\/112%)",
        "Illusion Damage Taken: 200%",
        "Haunt Duration: 5\/6\/7"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Spectre_Haunt_1.mp3\/revision\/latest?cb=20191216024324",
      "effects": [
        "Ability No Target",
        "Affects Enemy Heroes"
      ],
      "notes": [
        "Haunt illusions are selectable, but uncontrollable.",
        "The illusions have unobstructed pathing.",
        "The illusions spawn 58 range away from their targets, at a random spot around them.",
        "They do not attack but still follow invisible units. They also spawn on and follow invulnerable and hidden units.",
        "Haunt illusions spawn for enemy Meepo clones, but not for other clones or illusions.",
        "The illusions disappear once their target dies."
      ],
      "mana": "150\/200\/250",
      "item_behaviour": [],
      "name": "Haunt",
      "cooldown": "180\/160\/140",
      "description": "Creates a spectral nemesis to attack each enemy hero. At any moment during the duration, Spectre can use Reality to exchange places of a given haunt. Haunt illusions are uncontrollable, take extra damage, and deal less damage than Spectre herself. They ignore terrain.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Radius: Global",
        "Illusion Damage Dealt: 40%\/60%\/80% (TagTalent 72%\/92%\/112%)",
        "Illusion Damage Taken: 200%",
        "Haunt Duration: 5\/6\/7",
        "Grants a new ability: Shadow Step."
      ],
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Mercurial, the Spectre, is a melee agility hero, adept at dealing pure damage to lone targets, and is powerful both offensively and defensively. Spectral Dagger provides a significant amount of mobility, allowing Spectre to go through objects, units and terrain while slowing foes that come in contact with the shadowy path left by her Spectral Dagger. Desolate allows her to inflict high pure damage to enemy heroes when she catches them alone. Dispersion reduces and reflects all damage, whether by attacks or spells, to an area around her. Dispersion gives her great durability, especially when equipped with items that provide health, armor, and damage block. Finally, her Haunt creates a malevolent spectral illusion to all enemy heroes in the map. Haunt lets Spectre wreak havoc in clashes and ganks, while her allies take advantage of the confusion. Spectre can use Reality during the Haunt, instantly teleporting her to her illusion to take its form. This lets her hound her victim anywhere on the map. Mercurial is a dangerous supernatural being, relentless as she can chase and stalk down her victim to a global range, unhindered by boundaries. Her kit allows her to play the role of the team's hard carry by applying an immense amount of pressure in late game team fights. More specifically, the damage reflection from Dispersion makes it disadvantageous for teams to focus her. Her abilities have a complex nature, and newer players should generally not play Spectre as she is extremely farm and level dependent. It is best to face Spectre with allied help and strength, as encountering her alone is not always the best option.",
  "history": "Just as higher states of energy seek a lower level, the Spectre known as Mercurial is a being of intense and violent energy who finds herself irresistibly drawn to scenes of strife as they unfold in the physical world. While her normal spectral state transcends sensory limitations, each time she takes on a physical manifestation, she is stricken by a loss of self--though not of purpose. In the clash of combat, her identity shatters and reconfigures, and she begins to regain awareness. She grasps that she is Mercurial the Spectre--and that all of her Haunts are but shadows of the one true Spectre. Focus comes in the struggle for survival; her true mind reasserts itself; until in the final moments of victory or defeat, she transcends matter and is restored once more to her eternal form.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+5% Dispersion",
      "talentRight": "+32% Haunt Illusion Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+14% Spectral Dagger Slow\/Bonus",
      "talentRight": "+400 Health"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 Spectral Dagger Damage",
      "talentRight": "+12 Desolate Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+5 All Stats",
      "talentRight": "-4s Spectral Dagger Cooldown"
    }
  ]
}