{"abilities":[{"spell":"Bombards an area with rocks, continuously doing small intervals of damage and stun to enemy units. Avalanche does 3x damage to units being tossed.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Deals 12.5\/25\/37.5\/50 ( 29.17\/41.67\/54.17\/66.67) damage in 0.3 second intervals, starting 0.5 seconds after cast, resulting in 6 instances.","If a unit is affected by Toss, it takes 3 times the damage from Avalanche, which is 37.5\/75\/112.5\/150 ( 87.5\/125\/162.5\/200) per instance.","No matter how close or far Avalanche gets targeted, the targeted area is always hit 0.5 seconds after cast.","On each instance, Avalanche first applies the damage, then the debuff."],"mana":"120","elements":["Does not pierce spell immunity."],"cooldown":"26\/22\/18\/14 ( 17\/13\/9\/5)","name":"Avalanche","description":["Cast Animation: 0+0.53","Cast Range: 600","Effect Radius: 325\/350\/375\/400","Effect Interval: 0.3","Total Damage: 75\/150\/225\/300 ( 175\/250\/325\/400)","Stun Duration: 0.2","Avalanche Duration: 1.8"],"hot_key":"Q","legacy_key":"V"},{"spell":"Grabs the nearest unit in a 275 radius around Tiny, ally or enemy, and launches it at the target unit or rune to deal damage where they land. If the tossed unit is an enemy, it will take an extra 30% damage.","effects":["Ability Target Unit ( Target Point)","Affects Enemies \/ Allies","Damage Magical"],"notes":["The tossed unit travels at a speed based on the distance between it and the target, capped at 2308. The speed does not instantly adapt if the distance changes, but rather accelerates or decelerates at a slow rate.","The tossed unit can be avoided by blinking or moving rapidly, but cannot technically be disjointed. This means the tossed unit can fly up to 3000 range away when the target teleports far enough away.","If the tossed unit dies in mid-air, it still deals the area damage upon landing.","Forcefully moves the unit, disabling it and canceling channeling spells and other position changing effects.","Buildings cannot be targeted, but take 33.33% damage (30\/53\/77\/100) from a tossed unit landing near them.","The 30% extra damage is only applied to the tossed enemy unit, increasing the damage it takes to 117\/208\/299\/390. Other enemy units (including buildings) within the radius only take the basic damage.","Can toss any unit, except for ancient creeps and wards. Invisible enemy units cannot be tossed, but still take damage from a unit being tossed onto or near them.","Units in the Fog of War can be tossed if they are within a 275 radius of Tiny, but cannot be selected as a target.","While in the air, other units may pass below the tossed unit.","Can directly target and toss towards runes, but cannot toss runes.","The buff or debuff of Toss is hidden, means it is not visible in the HUD.","When the talent is chosen, Toss can target the ground, throwing the unit towards the targeted point. Runes can no longer be directly targeted when this talent is chosen, but other units still can."],"mana":"90\/100\/110\/120","elements":["Cannot be disjointed.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"17\/15\/13\/11 ( 0)","name":"Toss","description":["Cast Animation: 0+0.53","Cast Range: 1300","Grab Radius: 275","Damage Radius: 275","Damage: 90\/160\/230\/300","Tossed Unit Bonus Damage: 30%","Building Damage Percentage: 33.33%","Avalanche Damage Multiplier: 3","Toss Duration: 1.3","Number of Charges: 0 ( 3)","Charge Replenish Time: 0 ( 17\/15\/13\/11)"],"hot_key":"W","legacy_key":"T"},{"spell":"Grabs a tree to whack enemies on the head. Grants bonus attack range but Tiny is slowed by 25. Attacks deal more damage and fully splash on units along the way. The tree can be thrown, to deal your attack to a unit at a distance.","effects":["Ability Target Unit","Affects Trees \/ Enemies","Damage Physical"],"notes":["Has no set duration. The buff lasts until Tree Throw is used or until Tiny dies.","The cooldown of Tree Grab only starts upon losing the tree in any way. Does not go on cooldown upon cast. The mana is expended upon cast.","Sets the caster's base attack range to 350, meaning if used by other heroes than Tiny, they may have their range reduced. Attack range bonuses are not overriden and still work normally.","Only increases base damage and that given by the primary attribute of Tiny. Raw bonus damage is not increased.","The bonus damage is not applied when attacking allied units.","Checks Tiny's main attack damage periodically and adapts the attack damage bonus instantly.","Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","The area has a rectangular shape with a semi-circle at the side away from Tiny. Like cleave, the area always starts in front of the attacking unit. The rectangle has a length of 400 and a width of 400. The semi-circle has a radius of 200. This means the area damage can reach up to 600 range away from Tiny.","Fully stacks with other sources of cleaves. Each source of cleave works completely independent.","Applies the area damage upon attacking wards, or buildings, but not on allies and items. Wards and buildings are unaffected by the area damage.","Despite the visual effect, cleave damage is applied instantly in the whole area."],"mana":"50","elements":["Cannot be used by illusions.","Pierces spell immunity."],"cooldown":"25\/20\/15\/10","name":"Tree Grab","description":["Cast Animation: 0.2+1.24","Cast Range: 165","Area Damage Length: 400","Area Damage Radius: 200","Self Movement Speed Slow: 25","Attack Range: 350","Unit Attack Damage Bonus: 10%\/20%\/30%\/40%","Building Attack Damage Bonus: 20%\/50%\/80%\/110%","Attack Damage as Area Damage: 30%\/40%\/50%\/60%"],"hot_key":"E","legacy_key":"C"},{"spell":"Throws the tree at the target unit, proccing your attack on it and splashing damage around the target.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Instant Attack"],"notes":["Replaces Tree Grab until Tiny loses the tree.","The tree travels at a speed of 900.","When targeting a unit, the projectile homes in on the target. This way, the tree hits the target upon fully reaching it.","When targeting the ground, the tree travels in a straight line up to 1300 range before it disappears. This way, the tree uses a 300 radius collision size. This means this way, the tree may hit the intended target earlier. Can hit units up to 1600 (travel distance + collision radius). The splash damage is centered around the first unit it hits, and not around where the tree was as it hit.","Applies an instant attack on the targeted unit, or the first enemy it finds. This instant attack deals 10%\/20%\/30%\/40% bonus damage, like the attacks with Tree Grab do. It also applies splash damage around the target. The instant attack can proc attack modifier and on-hit effects on the primary target normally. Since the area damage is splash, no modifiers are applied here. Cleave effects are based on the target's position, damaging a trapezoid area the opposite direction where the tree came from. Although the tree may make it look like a ranged attack, the attack still counts as melee. This means all abilities which differentiate between ranged and melee, use their melee effects\/values, not ranged. The performed instant-attack has True Strike, so it cannot miss. However, when the tree is avoided, no attack is performed.","When targeting the ground, the tree provides 200 radius flying vision around itself while traveling. Does not provide vision when directly targeting a unit. When the tree hits a unit, no matter if ground or directly targeted, it grants the same vision at its location for 2 seconds."],"mana":"0","elements":["Can be disjointed.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"0","name":"Tree Throw","description":["Cast Animation: 0.2+1.13","Cast Range: 1300","Tree Collision Radius: 300","Splash Radius: 275","Splash Damage: 150%"],"hot_key":"E","legacy_key":"C"},{"spell":"Tiny gains craggy mass, increasing his attack damage, and armor, while slowing his attack speed.","effects":["Ability Passive","Affects Self"],"notes":["Each level changes Tiny's appearance, making him bigger and making his voice deeper.","The attack damage bonus is directly added to the main attack damage value, and therefore does not count as a raw attack damage bonus. This means it fully benefits from percentage-based attack damage bonuses. This also means that Tiny's illusion benefit from it as well."],"mana":"0","elements":["Can be used by illusions.","Not disabled by Break."],"cooldown":"0","name":"Grow","description":["Attack Damage Bonus: 30\/45\/60","Attack Speed Loss: 20\/35\/50","Armor Bonus: 10\/18\/26"],"hot_key":"R","legacy_key":"W"},{"spell":"Tiny throws random trees within range towards the targeted aoe. Deals Tiny's attack damage plus a bonus to enemies in that area with each tree thrown.","effects":["Ability Target Area \/ Channeled","Affects Enemies","Damage Instant Attack"],"notes":["Requires Aghanim's Scepter to be unlocked.","Throws trees in 0.4-second intervals, starting immediately upon cast begin, resulting in up to 6 trees being thrown. Checks for trees in the same intervals. If no tree is found within the area, the channeling ends prematurely.","The trees within the area are chosen randomly.","Performs an instant attack on all enemies within the damage area. This instant attacks deal 0% bonus damage. The instant attack can proc attack modifier and on-hit effects on normally. Cleave effects are based on the target's position, damaging a trapezoid area the opposite direction where the tree came from. Although the trees may make it look like a ranged attacks, the attack still counts as melee. This means all abilities which differentiate between ranged and melee, use their melee effects\/values, not ranged. The performed instant-attacks have True Strike, so they cannot miss."],"mana":"200","elements":["Pierces spell immunity."],"cooldown":"15","name":"Tree Volley","description":["Cast Animation: 0.2+2.4","Cast Range: 1300","Tree Grab Radius: 525","Damage Radius: 400","Max Channel Time: 2.4","Tree Throw Interval: 0.4","Attack Damage as Damage: 100%"],"hot_key":"D","legacy_key":"R"}],"bio":"Coming to life as a chunk of stone, Tiny's origins are a mystery on which he continually speculates. He is a Stone Giant now, but what did he used to be? A splinter broken from a Golem's heel? A shard swept from a gargoyle-sculptor's workshop? A fragment of the Oracular Visage of Garthos? A deep curiosity drives him, and he travels the world tirelessly seeking his origins, his parentage, his people. As he roams, he gathers weight and size; the forces that weather lesser rocks, instead cause Tiny to grow and ever grow.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The health talent increases maximum health capacity, and keeps the current health percentage.","The strength talent effectively grants Tiny 400 health, 2 health regen, 1.6% magic resistance and 20 attack damage."],"trivia":["Tiny's quote \" Tiny Smash!\" is a reference to Hulk, a well-known superhero from the Marvel Universe.","Tree Grab is still called Craggy Exterior after his old passive ability in the game files."],"talents":["3 Toss Charges:-9s Avalanche Cooldown","Toss Requires No Target:+20 Strength","+100 Avalanche Damage:+400 Health","+30 Damage:+20 Movement Speed"],"desc":"Tiny, the Stone Giant, is a melee strength hero with powerful ganking and killing potential. Although he starts off vulnerable in lane with his pitiful mana pool and non-existent armor, with a few levels, he gets considerably stronger. His killing power in the early and midgame comes from combo-ing his two active abilities. Avalanche engulfs an area in a wave of stones, dealing respectable damage and stunning enemies, while Toss allows Tiny to pick up the closest unit near himself and launch it at the designated location, dealing damage to all enemies at the location as well as additional damage to the thrown unit if an enemy. It can be used to displace an ally within the enemy team, but is mostly used on enemies themselves to deliver massive damage. If chained immediately with Avalanche, it also triples the damage the target takes from Avalanche, allowing Tiny to easily dispatch fragile enemy heroes in a matter of seconds. Although his nuking potential with his active abilities is already considerable, his passive Grow turns Tiny into a formidable physical combatant as well. Grow increases Tiny's size and provides him with a massive boost to his attack damage and armor at the cost of some attack speed. Although Tiny initially lives up to his name by starting off small and weak, much like an avalanche, he quickly grows in size and strength until he becomes a hulking behemoth with enormous health and damage output. This gives Tiny the potential to become one of the strongest carries in late game situations."}