{"abilities":[{"spell":"Заваливает указанную область камнями, с небольшим интервалом оглушая противников и нанося урон, который увеличивается в раза для жертв способности Toss.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Наносит 36\/54\/72\/90 ( 66\/84\/102\/120) урона с интервалом в 0.3 секунды спустя 0,5 секунды после применения, срабатывая 6 раза.","Если юнит находится под действием Toss, он получает усиленный в раза урон от Avalanche, равный ( ) единицам урона за срабатывание.","Расстояние до цели не важно, выбранная область всегда поражается спустя 0,5 секунды после применения.","С каждым срабатыванием Avalanche сначала наносит урон, затем применяет дебафф."],"mana":"120","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"26\/22\/18\/14 ( 17\/13\/9\/5)","name":"Avalanche","description":["Анимация применения: 0+0,53","Дальность применения: 600","Радиус урона: 325\/350\/375\/400","Интервал: 0.3","Общий урон: 120\/180\/240\/300 ( 220\/280\/340\/400)","Длительность оглушения: 0.2","Длительность Avalanche: 1.8"],"hot_key":"Q","legacy_key":"V"},{"spell":"Герой хватает ближайшее существо в радиусе 275, а затем бросает его в указанную цель или руну. В месте приземления наносится урон. Если брошен враг, он получит на 30% больше урона.","effects":["Способность Направленная на юнита ( Направленная на точку)","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Брошенный юнит летит со скоростью, зависящей от расстояния между ним и целью, которая может достигать до 2308. Если расстояние меняется, то скорость адаптируется не мгновенно, а постепенно - ускоряясь или замедляясь соответственно.","Можно увернуться от брошенного юнита с помощью блинка или мгновенно передвижения, но технически его избежать нельзя. То есть брошенный юнит может пролететь до 3000 единиц, если цель телепортировалась достаточно далеко.","Если юнит умрет в воздухе, то при его приземлении урон по области все равно нанесётся.","Принудительно передвигает юнита, обезвреживая его, и отменяет произносимые заклинания и эффекты, меняющие расположение.","Строения не могут быть целью заклинания, но они получают 33.33%% урона (30\/53\/77\/100) от приземления юнита рядом.","Дополнительные 30% урона наносятся только брошенному вражескому юниту, увеличивая урон до 117\/208\/299\/390. Другие вражеские юниты (включая строения) в пределах радиуса получат только базовый урон.","Может бросить любого юнита за исключением древних крипов и вардов.","Невидимые враги не могут быть подкинуты, но получают урон от приземления рядом с ними подкинутого юнита.","Врага, находящегося в тумане войны, может подкинуть, если он находится в радиусе 275 единиц от Tiny, но сам враг целью быть не может.","Пока юнит находится в воздухе, остальные юниты могут проходить под ним.","Бафф и дебафф Toss - скрытые, поэтому не отображаются в интерфейсе.","При выборе таланта целью Toss может быть точка на земле. Руны больше нельзя выбрать напрямую с изученным талантом, но других юнитов все еще можно выбирать."],"mana":"90\/100\/110\/120","elements":["Нельзя избежать.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"11 ( 0)","name":"Toss","description":["Анимация применения: 0+0,53","Дальность применения: 1300","Радиус захвата: 275","Радиус урона: 275","Урон: 90\/160\/230\/300","Доп. урон для брошенного юнита: 30%","Урон по строениям: 33.33%","Множитель урона Avalanche: 3","Длительность броска: 1.3","Число зарядов: 0 ( 3)","Время восстановления заряда: 0 ( 11)"],"hot_key":"W","legacy_key":"T"},{"spell":"Герой вырывает из земли выбранное дерево, чтобы отметелить им врагов. Дерево ломается после определённого числа ударов, но увеличивает их дальность и урон (который ещё выше по постройкам). Удары также наносятся по существам рядом с основной целью. Дерево можно швырнуть во врага, чтобы нанести ему урон от атаки на расстоянии, но само дерево будет потеряно.","effects":["Способность Направленная на юнита","Действует на Деревья \/ Врагов","Урон Физический"],"notes":["У способности нет установленной длительности. Бафф действует, пока не используются все заряды, до использования Tree Throw или до смерти Tiny.","Перезарядка Tree Grab начинается только при потере дерева. Не уходит на перезарядку при применении. Мана тратится при применении.","Устанавливает дальность атаки заклинателя равной 350, поэтому при использовании способности другими героями их дальность атаки может быть уменьшена.","Увеличивает только базовый урон и даваемый основным атрибутом Tiny. Дополнительный урон не увеличивается.","Периодически проверяет основной урон Tiny и мгновенно адаптирует дополнительный.","Прорубающий урон не может быть увеличен с помощью усиления урона заклинаний и от него не идет лечение от вампиризма заклинаний.","Прорубающий урон снижается блокировкой урона.","Область выглядит как прямоугольник, заканчивающийся полукругом и исходящий от Tiny. Как и при прорубающем ударе область всегда начинается перед атакующим юнитом. Прямоугольник имеет длину в 400 единиц, а ширину - в 400. Радиус полукруга равен 200 единицам. То есть область поражения может достигать до 600 единиц от Tiny.","Сочетается с другими источниками прорубающего удара. Каждый источник действует независимо от другого.","Наносит урон по области при атаке вардов или строений, но не союзных юнитов. На варды и строения не действует урон по области.","Удар по предметам не активирует урон по области и не тратит заряды.","Вопреки визуальному эффекту, урон прорубания наносится мгновенно по всей области."],"mana":"20\/30\/40\/50","elements":["Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"27\/22\/17\/12 ( 20\/15\/10\/5)","name":"Tree Grab","description":["Анимация применения: 0,2+1,24","Дальность применения: 165","Длина области поражения: 400","Радиус области поражения: 200","Количество атак: 5","Дальность атаки: 350","Дополнительный урон: 10%\/20%\/30%\/40%","Дополнительный урон по строениям: 80%\/120%\/160%\/200%","Урон соседним целям: 30%\/40%\/50%\/60%"],"hot_key":"E","legacy_key":"C"},{"spell":"Швыряет дерево в указанную цель, нанося ей и всем врагам вокруг неё урон от атаки, но при этом полностью теряет дерево.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Физический"],"notes":["Заменяет Tree Grab до использования Tiny всех зарядов.","Дерево летит со скоростью в 900 единиц.","При выборе целью юнита снаряд летит напрямую к нему. Таким образом дерево наносит урон юниту при попадании.","При выборе целью землю дерево пролетит по прямой 1300 единиц до исчезновения. Также дерево использует радиус столкновения в 300 единиц. Поэтому оно может достигнуть выбранной точки раньше. Может поражать юнитов на расстоянии до 1600 единиц (складывается из дальности применения и радиуса столкновения). Урон по области наносится в радиусе вокруг первого пораженного юнита, а не вокруг дерева.","Применяет мгновенную атаку к выбранному юниту или первому врагу на пути. Эта атака дополнительно наносит 10%\/20%\/30%\/40% урона - как и атака с Tree Grab. Также она применяет урон соседним целям вокруг цели. На мгновенную атаку может сработать любой модификатор атаки и эффекты, срабатывающие при ударе. Поскольку область поражения представлена уроном соседним целям, то модификаторы не применяются. Эффекты прорубания основаны на расположении цели, нанося урон в области трапеции, направленной в противоположную сторону от запущенного дерева. Хоть дерево выглядит как дальняя атака, атака им считается за ближнюю. Поэтому все способности, учитывающие разницу между ближним и дальним боем, используют для дерева значения и эффекты для ближнего боя. У совершенной мгновенной атаки эффект True Strike, поэтому она не может промахнутся. Но атака не произойдет, если от дерева увернулись.","При выборе точки на земле дерево дает вокруг себя летающий обзор в радиусе 200, пока летит. Не дает обзор, если целью был выбран юнит. Если дерево поразило юнита, то оно также дает летающий обзор в месте поражения на 2 секунды."],"mana":"0","elements":["Можно избежать.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Tree Throw","description":["Анимация применения: 0,2+1,13","Дальность применения: 1300","Радиус столкновения: 300","Радиус урона по области: 275","Урон по области: 150%"],"hot_key":"E","legacy_key":"C"},{"spell":"Герой обрастает камнями, увеличивая свою мощь и защищаясь от отрицательных эффектов.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Каждый уровень меняет облик Tiny, увеличивая его и делая его голос ниже.","Дополнительный урон от способности добавляется к значению основного и не складывается с дополнительным. То есть этот урон также увеличивается от бонусов, дающих процентное увеличение урона от атаки. Также иллюзии Tiny используют этот урон."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением."],"cooldown":"0","name":"Grow","description":["Дополнительный урон: 30\/45\/60","Уменьшение скорости атаки: 20\/35\/50","Дополнительная броня: 7\/16\/25"],"hot_key":"R","legacy_key":"W"}],"bio":"Он явился на свет куском камня. Происхождение его — загадка, ответ на которую он непрестанно пытается найти. Теперь он — каменный гигант, но кем же он был раньше? Обломком пятки голема? Осколком, сбитым с гаргульи в мастерской скульптора? Частью Пророческого лика Гартоса? Им движет глубокое любопытство, и он без устали путешествует по миру, пытаясь найти свои истоки, свою родословную, свой народ. В скитаниях он прибавляет в массе и размере; силы, что дробят маленькие камни, его делают лишь мощнее и мощнее.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Фраза \"Играть Tiny Smash!\" является отсылкой к Халку супергерою комиксов Marvel и его реплике Халк ломать!.","Фраза \"Играть A rolling stone\" возможно является отсылкой к популярному журнале о музыке Rolling Stone или популярной группе Rolling Stones."],"talents":["3 заряда Toss:-9 сек. перезарядки Avalanche","Для Toss не нужна цель:-7 сек. перезарядки Tree Grab","+100 к урону от Avalanche:+400 к здоровью","+30 к урону:+20 к скорости передвижения"],"tips":["В начале качайтесь через Avalanche и Toss. С 5 уровня старайтесь убить оппонента через комбинацию Avalanche + Toss, подбрасывая таким образом, чтобы враг получал урон от Avalanche дважды.","Постарайтесь пораньше купить Arcane Boots, чтобы всегда была мана на Avalanche и Toss.","Avalanche и Toss наносят весьма серьезный урон. С этим комбо можно убивать практически всех героев в середине игры. Но стоит помнить что у этих навыков долгая перезарядка и без них вы почти бесполезны.","Получив 8 уровень нужно стараться гангать по лайнам и убивать вражеских героев как только пройдет перезарядка Avalanche и Toss. Делать это нужно до тех пор, пока урон от этой комбы перестанет быть значительным для врагов. К тому времени нужно собрать побольше денег."],"desc":"Tiny — это герой с ближним типом атаки, основной характеристикой которого является Сила. Его первая способность, Avalanche, заваливает зону камнями, нанося урон наземным вражеским юнитам и оглушая их. Второй способностью, Toss, Tiny хватает ближайшего юнита, а затем бросает его в указанную цель или руну. В месте приземления наносится урон. Если враг под действием Avalanche был подброшен этой способностью и приземлился на то же место, он получит 200% урона от Avalanche. Третья способность, Tree Grab, позволяет Tiny взять дерево, дающее ему дополнительные урон и дальность атаки. При этом он может кинуть его с помощью способности Tree Throw, нанося урон юнитам в области. Ультимативная пассивная способность, Grow, увеличивает урон и размер Tiny ценой скорости атаки. Увеличивает скорость передвижения и сопротивление эффектам."}