{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Trusty_Shovel_Dig.mp3\/revision\/latest?cb=20191227195721",
      "effects": [
        "Анимация применения: 0,1+0",
        "Время произнесения: 1",
        "Шанс выпадения руны богатства: 16%",
        "Шанс выпадения Healing Salve: 28%",
        "Шанс выпадения Enchanted Mango: 28%",
        "Шанс выпадения кобольда: 28%"
      ],
      "notes": [
        "Для получения награды нужно завершить произнесение.",
        "Может выкопать руну богатства, Healing Salve (100 ), Enchanted Mango (65 ) или нейтрального кобольда.",
        "Поскольку выкопанный кобольд — нейтральное существо, то он атакует обе силы, с него могут выпасть нейтральные предметы, и он улучшается так же как и нейтральные крипы. За кобольда в среднем даётся 6 золота.",
        "За кобольда в среднем даётся 6 золота.",
        "Выкопанные предметы не продаются, но их можно передать. Если выкопанный предмет собирается в стак из таких же предметов, то целый стак становится не продаваемым.",
        "Если выкопанный предмет собирается в стак из таких же предметов, то целый стак становится не продаваемым.",
        "Один и тот же Trusty Shovel не может создать одну и ту же награду дважды в ряд."
      ],
      "mana": "0",
      "abilityName": "Dig",
      "cooldown": "50",
      "description": "Применяется 1 сек. Может выкопать руну богатства, Healing Salve, Enchanted Mango или враждебного кобольда.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Items_rune_bounty.mp3\/revision\/latest?cb=20201219110206",
      "effects": [
        "Золота команде при первом появлении: 40",
        "Базового золота команде при последующих появлениях: 36",
        "Дополнительного золота команде при последующих появлениях за интервал: 9",
        "Интервал дополнительного золота команде: 300"
      ],
      "notes": [
        "Так как Trusty Shovel можно получить только после отметки времени в 7:30 минуты, то руны богатства будут стоить примерно 45 за героя. При помещении в бутыль руны богатства, она даёт золото основываясь на времени активации, а не помещения в бутыль.",
        "При помещении в бутыль руны богатства, она даёт золото основываясь на времени активации, а не помещения в бутыль.",
        "Использование руны богатства, помещённой в бутыль, даёт только 2 заряда для Bottle.",
        "Даёт надёжное золото каждому игроку команды, которая взяла руну.",
        "Текст над головой отображает сколько золота конкретно было дано. Это число не видно врагам.",
        "При получении золота из руны богатства, от игрока отлетает эффект небольшой золотой частицы, который виден всем.",
        "В Turbo Mode, даваемое руной богатства золото удваивается, не смотря на значения, которые показывает сообщение уведомления."
      ],
      "mana": null,
      "abilityName": "Богатство",
      "cooldown": null,
      "description": "Дает дополнительные золото.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Trusty Shovel",
  "description": "Старая игрушка юного божества, полученная в подарок от дяди.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}