{"abilities":[{"spell":"Blasts an enemy unit with a wave of fire, dealing damage and stunning the target.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["When multicast, Fireblast hits the same target several times in 0.5 second intervals.","This is how much damage a multicast Fireblast deals (before reductions) and how long it stuns on each level: 2x Multicast: 120\/240\/360\/480 ( 670\/790\/910\/1030) damage, 2 seconds stun. 3x Multicast: 180\/360\/540\/720 ( 1005\/1185\/1365\/1545) damage, 2.5 seconds stun. 4x Multicast: 240\/480\/720\/960 ( 1340\/1580\/1820\/2060) damage, 3 seconds stun.","Each blast first applies the damage, then the debuff."],"mana":"75\/85\/95\/105","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"12\/11\/10\/9","name":"Fireblast","description":["Cast Animation: 0.45+0.53","Cast Range: 475 ( 575)","Multicast Interval: 0.5","Damage: 60\/120\/180\/240 ( 335\/395\/455\/515)","Stun Duration: 1.5"],"hot_key":"Q","legacy_key":"F"},{"spell":"Drenches the target and another random unit in volatile chemicals, causing it to burst into flames. The target is in immense pain, taking damage and moving more slowly.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Ignite travels at a speed of 1000.","The second projectile only targets enemies which do not have the Ignite debuff yet.","If multiple enemies which are not ignited yet are within range, chooses the closer target for the second projectile. Cannot target invisible, invulnerable, or hidden units, or units inside the fog of war.","When multicast, launches Ignite projectiles in 0.5 second intervals at random enemy or neutral units within 1400 range of Ogre Magi. The multicasts launch 2 projectiles per cast as well, juts like a regular cast. Cannot target invisible, invulnerable, or hidden units, or units inside the fog of war. Prioritizes units which do not have the Ignite debuff already. Can hit the same unit multiple times.","The debuff from Ignite does not stack with itself. Successive casts on the same units refresh the debuff.","Deals damage in 1 second intervals, starting 1 second after the debuff is placed, resulting in 5\/6\/7\/8 damage instances.","Can deal up to 130\/204\/294\/400 damage to a single unit (before reductions)."],"mana":"90","elements":["Can be disjointed.","Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"15","name":"Ignite","description":["Cast Animation: 0.45+0.43","Cast Range: 700\/800\/900\/1000 ( 800\/900\/1000\/1100)","Secondary Target Search Radius: 900\/1000\/1100\/1200","Multicast Radius: 1400","Multicast Interval: 0.5","Number of Targets: 2","Damage per Second: 26\/34\/42\/50","Move Speed Slow: 20%\/22%\/24%\/26%","Duration: 5\/6\/7\/8"],"hot_key":"W","legacy_key":"G"},{"spell":"Incites a frenzy in a friendly unit, increasing its movement speed and attack speed. Can be cast on towers.","effects":["Ability Target Unit \/ Autocast","Affects Allies"],"notes":["Despite the visual effect, the buff is applied instantly on the target upon cast. The projectile has only a visual purpose.","When multicast, instantly applies the Bloodlust buff on random allies within the radius.","Causes the target's model size to increase by 25% for its duration. This has no impact on its collision size.","Can be cast on any allied unit which is not a ward. This includes buildings and invulnerable allies.","Can be set to autocast. When on autocast, Ogre Magi automatically casts this spell on the closest allied hero that does not have the Bloodlust buff on. This includes hero clones, creep-heroes, but not illusions. Does not automatically target lane creeps, spell immune creep-heroes and other allied or own summons. Interrupts Ogre Magi's current order and makes him forget queued commands. This cannot occur while channeling a spell, though."],"mana":"65","elements":["Can be used by illusions.","Pierces spell immunity."],"cooldown":"20\/18\/16\/14","name":"Bloodlust","description":["Cast Animation: 0.45+0.67","Cast Range: 600 ( 700)","Multicast Radius: 575","Move Speed Bonus: 8%\/10%\/12%\/14%","Allies Attack Speed Bonus: 30\/40\/50\/60 ( 70\/80\/90\/100)","Self Attack Speed Bonus: 30\/50\/70\/90 ( 70\/90\/110\/130)","Duration: 30"],"hot_key":"E","legacy_key":"B"},{"spell":"Enables Ogre Magi to cast his abilities and items multiple times with each use.","effects":["Ability Passive","Affects Self"],"notes":["Besides his own spells, Multicast may only proc on single-target items when targeting enemies. The following items can be Multicast: Force Staff, Heaven's Halberd, Abyssal Blade, Diffusal Blade, Bloodthorn, Hurricane Pike, Ethereal Blade, Eul's Scepter of Divinity, Medallion of Courage, Dagon, Hand of Midas, Rod of Atos, Solar Crest, Nullifier, Orchid Malevolence, Scythe of Vyse The following items trigger Multicast, but are not multiplied: Quelling Blade, Tango, Tango (Shared), Spirit Vessel, Battle Fury, Urn of Shadows The following items cannot be Multicast: Helm of the Dominator","Multicast items only target enemies, even when the item itself can target allies by default. If no other enemies are nearby, Multicast does nothing. It cannot target the same units multiple times. The items are still restricted to their own targeting rules. For example, an item that only targets creeps cannot multicast onto enemy heroes.","The range of multicast items is based on the item's cast range + cast range bonuses + the 300 buffer range.","When multiple multicasts proc on the same cast, the higher value takes priority. This means their proc chances work completely independently from each other, but their effects do not stack, resulting in the following possibilities on each level: No Multicast: 40% \/ 28% \/ 23.8% 2x Multicast: 60% \/ 42% \/ 35.7% 3x Multicast: 0% \/ 30% \/ 25.5% 4x Multicast: 0%\/0%\/15%"],"mana":"0","elements":["Disabled by Break."],"cooldown":"0","name":"Multicast","description":["Ignite Multicast Range: 1600","Bloodlust Multicast Radius: 575","Item Multicast Buffer Range: 300","2x Multicast Chance: 60%\/60%\/60%","3x Multicast Chance: 0%\/30%\/30%","4x Multicast Chance: 0%\/0%\/15%"],"hot_key":"R","legacy_key":"C"},{"spell":"Blasts an enemy unit with a wave of fire, dealing damage and stunning the target. Its mana cost is 60% of the hero's current mana.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Requires Aghanim's Scepter to be unlocked.","Does not require Multicast to be leveled to be unlocked, once Aghanim's Scepter is acquired.","Ogre Magi can never be out of mana to cast this spell, since it always costs 60% of his current mana pool (rounded down).","The tooltip shows the momentary mana cost and updates whenever the mouse cursor is moved over the ability icon.","When multicast, Unrefined Fireblast hits the same target several times in 0.5 second intervals.","This is how much damage a multicast Unrefined Fireblast deals (before reductions) and how long it stuns on each level: 2x Multicast: 550 damage, 2 seconds stun. 3x Multicast: 825 damage, 2.5 seconds stun. 4x Multicast: 1100 damage, 3 seconds stun.","Each blast first applies the damage, then the debuff."],"mana":"60% of current mana","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"6","name":"Unrefined Fireblast","description":["Cast Animation: 0.45+0.53","Cast Range: 475 ( 575)","Multicast Interval: 0.5","Damage: 275","Stun Duration: 1.5"],"hot_key":"D","legacy_key":"D"}],"bio":"The ordinary ogre is the creature for whom the phrase 'As dumb as a bag of rock hammers' was coined. In his natural state, an ogre is supremely incapable of doing or deciding anything. Clothed in dirt, he sometimes finds himself accidentally draped in animal skins after eating lanekill. Not an especially social creature, he is most often found affectionately consorting with the boulders or tree-stumps he has mistaken for kin (a factor that may explain the ogre's low rate of reproduction). However, once every generation or so, the ogre race is blessed with the birth of a two-headed Ogre Magi, who is immediately given the traditional name of Aggron Stonebreak, the name of the first and perhaps only wise ogre in their line's history. With two heads, Ogre Magi finds it possible to function at a level most other creatures manage with one. And while the Ogre Magi will win no debates (even with itself), it is graced with a divine quality known as Dumb Luck--a propensity for serendipitous strokes of fortune which have allowed the ogre race to flourish in spite of enemies, harsh weather, and an inability to feed itself. It's as if the Goddess of Luck, filled with pity for the sadly inept species, has taken Ogre Magi under her wing. And who could blame her? Poor things.","talentsTips":["Gold granted from the talent is unreliable gold.","The health talent increases maximum health capacity, and keeps the current health percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The strength talent effectively grants Ogre Magi 720 health, 4 health regen and 3.2% magic resistance."],"talents":["+275 Fireblast Damage:+75 Movement Speed","+40 Bloodlust AS:+40 Strength","+300 Health:+90 Damage","+100 Cast Range:+90 Gold\/Min"],"desc":""}