{"abilities":[{"spell":"Поражает врага огненной волной, нанося урон и оглушая цель.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["При сработавшем Multicast, Fireblast поражает одну и ту же цель несколько раз с интервалом в 0.6 секунд.","Здесь указано, сколько урона может нанести Fireblast, сработавший несколько раз (до учета сопротивления) и сколько будет длится оглушение на каждом уровне: 2x Multicast: 120\/240\/360\/480 ( 720\/840\/960\/1080) единиц урона, 2.1 секунды оглушения. 3x Multicast: 180\/360\/540\/720 ( 1080\/1260\/1440\/1620) единиц урона, 2.7 секунды оглушения. 4x Multicast: 240\/480\/720\/960 ( 1440\/1680\/1920\/2160) единиц урона, 3.3 секунды оглушения."],"mana":"75\/85\/95\/105","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"11\/10\/9\/8","name":"Fireblast","description":["Анимация применения: 0,45+0,53","Дальность применения: 475 ( 575)","Интервал Multicast: 0.6","Урон: 60\/120\/180\/240 ( 360\/420\/480\/540)","Длительность оглушения: 1.5"],"hot_key":"Q","legacy_key":"F"},{"spell":"Обливает цель и ещё одно случайное существо летучими химикатами, поджигая их. Жертвы испытывают невероятную боль, получают урон и передвигаются медленнее.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Ignite летит со скоростью 1000 единиц.","Дополнительный снаряд выбирает только тех врагов, на которых еще не действует дебафф Ignite.","Если в радиусе действия несколько врагов без дебаффа, то для второго снаряда выбирается ближайшая цель. Не может выбрать невидимых, неуязвимых, спрятанных юнитов или юнитов в тумане войны.","При сработавшем Multicast, запускает снаряды Ignite с интервалом в 0.6 секунды в случайных врагов или нейтральных крипов в радиусе 1400 единиц от Ogre Magi. Multicast так же выпускает 2 снаряда за применение. Не может выбрать целью невидимых, неуязвимых, спрятанных юнитов или юнитов в тумане войны. Приоритетом считает юнитов, у которых еще нет дебаффа от Ignite. Может поражать одного и того же юнита несколько раз.","Дебаффы от Ignite не складываются между собой. Несколько применений на цель обновят время действия дебаффа.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 5\/6\/7\/8 раз.","Может нанести до 130\/204\/294\/400 единиц урона одному юниту (до учета сопротивления)."],"mana":"90","elements":["Можно избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"15","name":"Ignite","description":["Анимация применения: 0,45+0,43","Дальность применения: 700\/800\/900\/1000 ( 800\/900\/1000\/1100)","Радиус поиска доп. цели: 900\/1000\/1100\/1200","Радиус Multicast: 1400","Интервал Multicast: 0.6","Число целей: 2","Урон в секунду: 26\/34\/42\/50","Замедление скорости передвижения: 20%\/22%\/24%\/26%","Длительность: 5\/6\/7\/8"],"hot_key":"W","legacy_key":"G"},{"spell":"Заставляет союзника впасть в бешенство, повышая скорость его атаки и передвижения.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Союзников"],"notes":["Вопреки визуальному эффекту, при использовании бафф сразу применяется к цели. Сняряд имеет только визуальное значение.","При сработавшем Multicast, мгновенно применяет бафф от Bloodlust на случайных союзников в радиусе действия.","Также увеличивает размер модели целей на 25% на всю длительность. Способность не влияет на размер столкновения.","Может применяться на любого союзного юнита, не являющегося вардом. В этот список также включены строения и неуязвимые союзники.","Можно установить автоприменение способности. При включенном автоприменении, Ogre Magi автоматически применяет способность на ближайшего союзного героя, еще не находящегося под действием баффа от Bloodlust. Действие также распространяется на клонов героев, крипов-героев, но не на иллюзии. Не выбирает автоматически крипов на линии, крипов-героев с иммунитетом к заклинаниям и других союзных или находящихся в подчинении героя призываемых существ. Может прервать текущую задачу Ogre Magi и заставить его забыть следующую команду в очереди. При этом не применяется при произнесении способностей."],"mana":"65","elements":["Может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Bloodlust","description":["Анимация применения: 0,45+0,67","Дальность применения: 600 ( 700)","Радиус Multicast: 700","Доп. скорость передвижения: 8%\/10%\/12%\/14%","Доп. скорость атаки: 30\/40\/50\/60 ( 70\/80\/90\/100)","Доп. скорость атаки для владельца: 30\/50\/70\/90 ( 70\/90\/110\/130)","Длительность: 30"],"hot_key":"E","legacy_key":"B"},{"spell":"Позволяет способностям и предметам героя срабатывать по нескольку раз за одно применение.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Помимо срабатывания собственных способностей Multicast может активировать направленные на цель предметы при выборе врагов. Следующие предметы активируют Multicast: Force Staff, Heaven's Halberd, Abyssal Blade, Diffusal Blade, Bloodthorn, Hurricane Pike, Ethereal Blade, Eul's Scepter of Divinity, Medallion of Courage, Dagon, Hand of Midas, Rod of Atos, Solar Crest, Nullifier, Orchid Malevolence, Scythe of Vyse. Следующие предметы активируют Multicast, но не срабатывают: Quelling Blade, Tango, Tango (не свой), Spirit Vessel, Battle Fury, Urn of Shadows. Следующие предметы не активируются Multicast: Helm of the Dominator.","Активирует предметы только при выборе врагов, даже если сам предмет по умолчанию может выбрать целью союзника. Если поблизости нет врагов, то Multicast не даст эффекта. Он не может выбрать целью одного и того же юнита несколько раз. Предметы продолжают действовать по своим правилам выбора цели. Например, предмет, выбирающий только крипов, не может умножить своё действие на вражеских героев.","Радиус множественного срабатывания основан на дальности применения предмета, дополнительной дальности применения и дальности в 600 от способности.","При срабатывании нескольких множителей выбирается наивысшее значение. То есть шансы срабатывания не связаны друг с другом, но их эффекты не складываются, что дает следующие возможные значения на каждом уровне способности: Без срабатывания: 25% \/ 17.5% \/ 14.875%. 2x Multicast: 75% \/ 52.5% \/ 44.625%. 3x Multicast: 0% \/ 30% \/ 25.5%. 4x Multicast: 0%\/0%\/15%."],"mana":"0","elements":["Отключается истощением."],"cooldown":"0","name":"Multicast","description":["Радиус действия Ignite: 1600","Радиус срабатывания Bloodlust: 700","Радиус срабатывания предметов: 600","Шанс 2x Multicast: 75%\/75%\/75%","Шанс 3x Multicast: 0%\/30%\/30%","Шанс 4x Multicast: 0%\/0%\/15%"],"hot_key":"R","legacy_key":"C"},{"spell":"Поражает врага огненной волной, нанося цели урон и оглушая её. На применение этой способности уходит 60% текущего запаса маны.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Требует Aghanim's Scepter для разблокировки.","Не требует изученного Multicast, способность будет разблокирована при получении Aghanim's Scepter.","Ogre Magi всегда будет хватать маны для использования данной способности, поскольку она всегда стоит 60% от его текущего запаса маны (округленный показатель).","Описание показывает текущий расход маны и обновляется всякий раз, когда курсор мыши наводится на иконку способности.","При сработавшем Multicast, Unrefined Fireblast поражает одну и ту же цель несколько раз с интервалом в 0.6 секунды.","Здесь указано, сколько урона нанесет Unrefined Fireblast, сработавший несколько раз (до учета сопротивления) и сколько будет длится оглушение на каждом уровне: 2x Multicast: 550 единиц урона, 2.1 секунды оглушения. 3x Multicast: 825 единиц урона, 2.7 секунды оглушения. 4x Multicast: 1100 единиц урона, 3.3 секунды оглушения."],"mana":"60% от текущей маны","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"6","name":"Unrefined Fireblast","description":["Анимация применения: 0,45+0,53","Дальность применения: 475 ( 575)","Интервал Multicast: 0.6","Урон: 275","Длительность оглушения: 1.5"],"hot_key":"D","legacy_key":"D"}],"bio":"Огр обыкновенный — создание, для которого словно придумали выражение «туп как пень». В обычной своей форме огр решительно неспособен на осмысленный поступок или обоснованное действие. Обычно покрытый грязью, он может вдруг обнаружить, что завернулся в шкуру падали, только что ей пообедав. Не намного лучше и его социальные способности — огр частенько нежно заигрывает с камнем или пнём, которые случайно принял за кого-то из своих (этим зачастую и объясняют маленький уровень рождаемости у огров). Однако примерно раз в поколение на расу огров снисходит благословение — рождение двухголового чудотворца, которому сразу же дается традиционное имя Аггрон Стонбрейк — так звали первого и, возможно, единственного мудрого огра за всю историю их расы. С двумя головами огр уже способен жить и мыслить на уровне, для которого многим другим существам хватило бы и одной. Пусть такой огр и не выйдет победителем из философского спора (даже с самим собой), ему дана посланная с небес «удача дурака» — склонность к необъяснимым, случайным чередам невероятной удачи, которые позволяют расе огров блистать, несмотря на врагов, жестокие погодные условия и неспособность прокормить себя. Будто бы сама богиня удачи, переполненная жалостью к печально недалёким существам, берёт одарённого огра к себе под крыло. И кому же её винить? Бедняжки.","talentsTips":["Золото с таланта является ненадёжным.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на силу в общем даёт Ogre Magi: 800 здоровья, 4 регенерации здоровья и 3.2% сопротивления магии."],"talents":["+300 к урону от Fireblast:+75 к скорости передвижения","+40 к скорости атаки от Bloodlust:+40 к силе","+350 к здоровью:+100 к урону","+100 к дальности способностей:+90 золота в минуту"],"desc":"Ogre Magi — это герой с ближним типом атаки, основной характеристикой которого является интеллект, однако сила героя значительно больше. Силой своей воли он способен порождать природное пламя и взрывы, уничтожающие врагов. Знаменит огромным случайным уроном, сочетающимся с экстремально большим для мага здоровьем. Способность Fireblast позволяет поразить врага огненной волной, которая оглушит его и нанесет урон. Способностью Ignite герой кидает в противников горючие смеси, которые замедляют их и наносят периодический урон. Третья способность Bloodlust дает возможность герою наделить союзника жаждой крови, под котором союзник получает бонусы к скорости атаки и передвижения. Главная и пассивная способность - Multicast улучшает способности героя. Например, первая способность может поразить цель несколько раз подряд, выдав некоторый Multicast, а вторая способность увеличивает радиус действия и так далее."}