{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e9\/Diffusal_Blade_Inhibit.mp3\/revision\/latest?cb=20191227195409",
      "effects": [
        "Дальность применения: 600",
        "Замедление скорости передвижения: 100%",
        "Длительность оцепенения на не-героях: 3",
        "Длительность замедления: 4"
      ],
      "notes": [
        "Замедление уменьшается с интервалом в 0,8 сек., замедляя на 100%\/80%\/60%\/40%\/20% и меняясь каждые 0,8 сек.",
        "При использовании на существ не-героев применяет к ним оцепенение и одновременно замедляет их, в итоге замедление длится 1 секунды, предотвращая их передвижение и использование способностей для перемещения. Не раскрывает невидимость цели.",
        "Не раскрывает невидимость цели.",
        "Считает древних крипов и крипов-героев за героев."
      ],
      "mana": "0",
      "abilityName": "Inhibit",
      "cooldown": "15",
      "description": "Замедляет противника на 4 секунды.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Маны выжигается за удар (TagAghanimгероем): 40",
        "Маны выжигается за удар (TagAghanimиллюзией): 8",
        "Выжженой маны в урон: 100%"
      ],
      "notes": [
        "Сочетается аддитивно с другими источниками выжигания маны.",
        "Урон напрямую добавляется к урону от атак по цели.",
        "Владелец предмета может получать лечение от вампиризма, получаемого от урона, наносимого Manabreak, но на него не действует критический или прорубающий удар.",
        "Урон может быть снижен с помощью Enfeeble или Static Link. При этом его нельзя увеличить с помощью Empower или руной двойного урона.",
        "При этом его нельзя увеличить с помощью Empower или руной двойного урона.",
        "В среднем усиливает атаки владельца предмета на 40 единиц, если у существ достаточно маны для сжигания. В среднем усиливает атаки иллюзий на 8, если у существ достаточно маны для сжигания.",
        "В среднем усиливает атаки иллюзий на 8, если у существ достаточно маны для сжигания.",
        "Сначала выжигает ману, затем наносит урон.",
        "Не работает при атаке союзных существ.",
        "Выжигание маны от нескольких Diffusal Blade не складывается. Полностью сочетается с другими источниками выжигания маны.",
        "Полностью сочетается с другими источниками выжигания маны."
      ],
      "mana": null,
      "abilityName": "Manabreak",
      "cooldown": null,
      "description": "Каждая атака сжигает 40 маны врага и наносит ему 1 физического урона за единицу сожжённой маны. Иллюзии героев сжигают по 8 маны за атаку.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2500",
  "lore": null,
  "consistFrom": [
    "Blade of Alacrity",
    "Robe of the Magi",
    "Recipe"
  ],
  "name": "Diffusal Blade",
  "description": "Зачарованный меч, позволяющий прорубиться до вражеской души.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}