{
  "abilities": [
    {
      "effects": [
        "Cooldown Reduction: 25%"
      ],
      "notes": [
        "Cooldown Reduction of multiple Octarine Cores does not stack.",
        "Stacks multiplicatively with other sources cooldown reduction."
      ],
      "elements": [
        "Ability Passive",
        "Affects Self"
      ],
      "name": "Cooldown Reduction",
      "description": "Reduces the cooldown time of all spells and items by 25%."
    },
    {
      "effects": [
        "Hero Spell Lifesteal: 25%",
        "Creep Spell Lifesteal: 5%"
      ],
      "notes": [
        "Spell Lifesteal of multiple Octarine Cores does not stack.",
        "Heals from any spell damage the owner deals (with a few exceptions) against enemy or allied units.",
        "Does not heal from damage done against buildings, wards or self.",
        "Heals from all three damage types and from many instantly killing effects.",
        "Heals from damage dealt after all reductions.",
        "In order for it to heal, the damage source must be the owner. Damage done by its summons (including wards) does not heal."
      ],
      "elements": [
        "Ability Passive",
        "Affects Self"
      ],
      "name": "Spell Lifesteal",
      "description": "25% of spell damage dealt to enemy heroes is returned to the caster as health, regardless of spell damage type. Lifesteal reduced to 5% against creeps."
    }
  ],
  "cost": "5900",
  "description": "At the core of spellcraft are spectrums only the very gifted can sense.",
  "trivia": [
    "Octarine is a fictional color in the comic fantasy book series Discworld, written by the late Terry Pratchett, who died just before Octarine Core was released. The color is described as \"resembling a flourescent greenish-yellow purple\" and can only be seen by wizards and cats.",
    "The components of Octarine Core are the same as the components of the pre-6.60 Aghanim's Scepter."
  ],
  "further": [
    "Mystic_Staff",
    "Soul_Booster"
  ],
  "tips": [
    "If you ever find yourself with a tanky hero with Radiance and don't know what else to build, don't hesitate to get Octarine Core, since it greatly boosts your health."
  ],
  "attrs": [
    "Passive Cooldown Reduction, Spell Lifesteal",
    "Bonus +25 Intelligence +425 Health +425 Mana",
    "Disassemble? Yes",
    "Alert allies? No"
  ],
  "info": [
    "For strength heroes, it grants 425 health, 725 mana, 1.25 mana regen and 1.75% spell damage.",
    "For agility heroes, it grants 425 health, 725 mana, 1.25 mana regen and 1.75% spell damage.",
    "For intelligence heroes, it grants 425 health, 800 mana, 1.56 mana regen, 2.19% spell damage and 25 attack damage."
  ]
}