{"abilities":[{"effects":["Уменьшение времени перезарядки способностей: 25%"],"notes":["Покупка нескольких Octarine Core не уменьшит перезарядку способностей больше чем на 25%.","Уменьшает перезарядку активных и пассивных способностей героев и предметов, а также способностей, использующих заряды.","Уменьшение перезарядки не обновляется динамически. Уменьшение влияет только на те способности, которые были использованы при наличии Octarine Core.","Визуально уменьшает перезарядку Tranquil Boots, но фактически на неё не влияет.","Не влияет на таймер ухода в невидимость Cloak and Dagger и Nature's Guise и таймеры крита\/уклонения Drunken Brawler.","При использовании Mend Guardian Greaves с Octarine Core таймер ограничения лечения также уменьшается на 10 секунд.","Сочетается по закону убывающей полезности с другими источниками уменьшения перезарядки от Руна волшебства и талантов."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Cooldown Reduction","description":"Уменьшает время перезарядки всех способностей и предметов на 25%."},{"effects":["Вампиризм от героев: 25%","Вампиризм от крипов: 5%"],"notes":["Магический вампиризм от нескольких Octarine Core не складывается.","Лечение идет от любого урона заклинаний, наносимого владельцем (с некоторыми исключениями) врагам или союзным юнитам.","Лечение не идет от урона, нанесённого строениям, вардам или самому себе.","Лечение от всех трёх типов урона и от большинства мгновенно убивающих эффектов.","Лечение от урона применяется после всех уменьшений.","Для лечения, источником урона должен быть владелец. Урон, нанесенный призываемыми существами (включая варды), не лечит."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Spell Lifesteal","description":"Даёт магический вампиризм, который восстанавливает здоровье за наносимый способностями урон. Восстанавливает здоровье в размере 25% от урона по героям и 5% от урона по крипам."}],"cost":"5900","description":"Само сердце колдовства раскрашено цветами, узреть которые способны лишь самые одаренные.","further":["Mystic_Staff","Soul_Booster"],"attrs":["Пассивная Cooldown Reduction, Spell Lifesteal","Бонус +25 к интеллекту +425 к здоровью +425 к мане","Можно разобрать? Да","Можно сообщать? Нет"],"info":["Для героев силы, даёт 425 здоровья, 725 маны, 1,25 регенерации маны и 1,75% урона от способностей.","Для героев ловкости, даёт 425 здоровья, 725 маны, 1,25 регенерации маны и 1,75% урона от способностей.","Для героев интеллекта, даёт 425 здоровья, 800 маны, 1,56 регенерации маны, 2,19% урона от способностей и 25 урона от атаки."]}