{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/90\/Force_Staff.mp3\/revision\/latest?cb=20141214200041",
      "effects": [
        "Дальность применения (TagAghanimсоюзник): 550",
        "Дальность применения (TagAghanimвраг): 850",
        "Расстояние толчка: 600",
        "Длительность толчка: 0,5"
      ],
      "notes": [
        "Двойной щелчок по предмету использует его на владельца.",
        "Толкает цель со скорость в 1200 единиц.",
        "Цель не обезвреживается во время толчка, поэтому она может использовать заклинания или предметы, атаковать и разворачиваться. То есть толчок не отменяет произносимые целью заклинания. При этом способность прерывает произносимые заклинания владельца, поскольку является направленным на цель заклинанием.",
        "То есть толчок не отменяет произносимые целью заклинания.",
        "При этом способность прерывает произносимые заклинания владельца, поскольку является направленным на цель заклинанием.",
        "Не перемещает существ под действием Black Hole, Chronosphere, Duel или Flaming Lasso.",
        "Не может вытолкнуть существ сквозь Kinetic Field или Arena Of Blood.",
        "Если на цель действует Soulbind, то ее нельзя толкнуть дальше, чем позволяет максимальное расстояние связи.",
        "Если цель привязана Pounce, то при применении привязка мгновенно разрывается. Но если цель получила привязку после применения, то способность не сможет толкнуть существо дальше, чем позволяет максимальное расстояние Pounce.",
        "Но если цель получила привязку после применения, то способность не сможет толкнуть существо дальше, чем позволяет максимальное расстояние Pounce.",
        "Не применяется к вардам или строениям. Можно применить к Homing Missile.",
        "Может затолкать существ на непроходимую территорию. Во время толчка деревья в радиусе 100 единиц вокруг цели разрушаются.",
        "Можно использовать на Рошана, но без какого-либо эффекта, поскольку у него иммунитет к принудительному движению.",
        "Делит перезарядку с Hurricane Pike. Не делит перезарядку с Force Boots."
      ],
      "mana": "100",
      "abilityName": "Force",
      "cooldown": "19",
      "description": "Толкает выбранное существо в направлении его взгляда на расстояние в 600.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2200",
  "lore": null,
  "consistFrom": [
    "Staff of Wizardry",
    "Fluffy Hat",
    "Recipe"
  ],
  "name": "Force Staff",
  "description": "Позволяет вам манипулировать другими ради добра или зла.",
  "trivia": null,
  "upgradeIn": [
    "Hurricane Pike"
  ],
  "tips": null
}