{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7a\/Force_Boots_Force.mp3\/revision\/latest?cb=20191227195705",
      "effects": [
        "Дальность применения: 750",
        "Дистанция толчка: 750",
        "Длительность толчка: 0,5"
      ],
      "notes": [
        "Применяет базовое развеивание при использовании на себя или союзников. Не применяет развеивание на противников. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Толкает цель со скоростью в 1 единиц.",
        "Цель не обезврежена во время толчка, и поэтому может использовать способности или предметы, атаковать или поворачиваться во время толчка. Это значит, что она не отменит произносимые способности цели. Однако, она прерывает произносимые заклинателем способности при применении, так как это направленная на существо способность.",
        "Это значит, что она не отменит произносимые способности цели.",
        "Однако, она прерывает произносимые заклинателем способности при применении, так как это направленная на существо способность.",
        "Не толкает цель, если она находится под действием Black Hole, Chronosphere, Duel или Flaming Lasso.",
        "Не может протолкнуть цель через Kinetic Field и Arena Of Blood.",
        "Если цель связана с Soulbind, то она не сможет протолкнуться дальше, чем максимальное расстояние связки.",
        "Если цель привязана с помощью Pounce, то привязка будет моментально уничтожена во время использования предмета. Однако, если цель будет привязана после использования предмета, то она не сможет протолкнуться дальше, чем максимальное расстояние привязки.",
        "Однако, если цель будет привязана после использования предмета, то она не сможет протолкнуться дальше, чем максимальное расстояние привязки.",
        "Нельзя применить на варды или постройки. Можно применить на Homing Missile.",
        "Может протолкнуть цель через непроходимый ландшафт. Деревья в радиусе 100 вокруг цели будут разрушены.",
        "Можно применить на Рошана, но без какого-либо эффекта, так как Рошан невосприимчив к принудительному движению.",
        "Не делит перезарядку с Force Staff или Hurricane Pike."
      ],
      "mana": "75",
      "abilityName": "Force",
      "cooldown": "8",
      "description": "Развеивает с владельца отрицательные эффекты и толкает его в направлении взгляда на расстоянии 750.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [],
      "notes": [
        "Разблокирует максимальную скорость передвижения для носителя, убирая ограничение в 550 скорости передвижения."
      ],
      "mana": null,
      "abilityName": "Speed Unlock",
      "cooldown": null,
      "description": "Снимает с владельца ограничение на скорость передвижения.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Бонусы к скорости передвижения от нескольких пар ботинок не складываются.",
    "Складывается с другими бонусами скорости передвижения."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Force Boots",
  "description": "Неуловимые диковинки, которые никому не удалось исследовать, описать и классифицировать.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}