{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+0.2s Eclipse Lucent Ministun",
          "talentRight": "+35 Lunar Blessing Damage"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 Lucent Beam Damage",
          "talentRight": "Global Lunar Blessing"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-20s Eclipse Cooldown",
          "talentRight": "-3.5s Lucent Beam Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0.4s Lucent Beam Ministun",
          "talentRight": "-8% Moon Glaives Damage Reduction"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Luna_Lucent_Beam_1.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Ability Target Unit (TagAghanim Target Point)",
        "Affects Enemies",
        "Damage Magical (TagAghanim Instant Attack)"
      ],
      "notes": [
        "Lucent Beam first applies the damage, then the debuff.",
        "Luna's glaive emits particles during the cast time, visible to everyone.",
        "With Aghanim's Shard, Lucent Beam additionally gains ground-targeting functionality. When ground-targeted, Lucent Beam does not require any vision or True Sight. It can hit invisible and enemies inside the Fog of War. Only searches for heroes (including illusions, clones and creep-heroes) within the search area. Other units are ignored. This means if there are no heroes within the search area, Lucent Beam does no damage. Provides 300 radius ground vision at the targeted point for 3 seconds when ground-targeted.",
        "When ground-targeted, Lucent Beam does not require any vision or True Sight. It can hit invisible and enemies inside the Fog of War.",
        "Only searches for heroes (including illusions, clones and creep-heroes) within the search area. Other units are ignored.",
        "This means if there are no heroes within the search area, Lucent Beam does no damage.",
        "Provides 300 radius ground vision at the targeted point for 3 seconds when ground-targeted.",
        "With Aghanim's Shard, Lucent Beam causes Luna to perform instant attacks on 1 random enemy within 500 radius of the targeted point. These instant attacks can proc any attack modifiers and on-hit effects normally (including Moon Glaives). They do not have True Strike, but ignore disarms. The targets are chosen completely randomly, there are no priorities. The attacks do not target invisible units, but can target units in Fog of War. The instant attacks originate from the targeted point or unit. When ground-targeted, the attacks originate from the targeted point even if the beam found and hit a nearby enemy hero.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally (including Moon Glaives). They do not have True Strike, but ignore disarms.",
        "The targets are chosen completely randomly, there are no priorities.",
        "The attacks do not target invisible units, but can target units in Fog of War.",
        "The instant attacks originate from the targeted point or unit.",
        "When ground-targeted, the attacks originate from the targeted point even if the beam found and hit a nearby enemy hero."
      ],
      "mana": "90\/100\/110\/120 (TagTalent 40\/50\/60\/70)",
      "item_behaviour": [],
      "name": "Lucent Beam",
      "cooldown": "9\/8\/7\/6 (TagTalent 5.5\/4.5\/3.5\/2.5)",
      "description": "Calls a beam of lunar energy down upon an enemy, damaging and briefly stunning them.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.4+0.47",
        "Cast Range: 800",
        "Damage: 75\/150\/225\/300 (TagTalent 175\/250\/325\/400)",
        "Stun Duration: 0.8 (TagTalent 1.2)",
        "Hero Search Radius: 325",
        "Instant Attack Search Radius: 500",
        "Number of Instant Attacks: 1",
        "Allows Lucent beam to be ground targeted with a 325 target search radius. Also releases an attack on a random target within 500 range of the Lucent Beam and reduces mana cost by 50.",
        "Blocked even when ground-targeted."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3c\/Luna_Moon_Glaives.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "The bouncing glaives travel at the same speed as the leading attack's projectile. This means their speed can be further increased by other attack projectile speed bonuses.",
        "This means their speed can be further increased by other attack projectile speed bonuses.",
        "Does not perform instant attacks. The projectiles deal regular spell damage. This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them. Although being spell damage, they ignore outgoing spell damage amplification and cannot spell lifesteal.",
        "This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them.",
        "Although being spell damage, they ignore outgoing spell damage amplification and cannot spell lifesteal.",
        "The glaives deal damage based on the damage amount calculated for the leading attack. Attack damage amount is calculated upon attack begin. This means it works with critical strike and quell, since these are included in the initial damage calculations. This also means that it does not matter how much damage the attack actually did to the target, since that part is being calculated on projectile hit. It also means that other conditional attack damage bonuses (i.e. Javelin damage proc) are not included, since these happen later in the calculations as well.",
        "This means it works with critical strike and quell, since these are included in the initial damage calculations.",
        "This also means that it does not matter how much damage the attack actually did to the target, since that part is being calculated on projectile hit.",
        "It also means that other conditional attack damage bonuses (i.e. Javelin damage proc) are not included, since these happen later in the calculations as well.",
        "Effectively increases Luna's attack damage by 71.88%\/93.75%\/120.26%\/153.89% (TagTalent 93.1%\/122.47%\/158.69%\/205.88%) if all bounces hit.",
        "Can bounce back to the same units if it already hit all other nearby units. Cannot bounce on enemies in the Fog of War. Does bounce to, but does not damage ethereal units. Does not bounce to invisible units.",
        "Does bounce to, but does not damage ethereal units. Does not bounce to invisible units.",
        "Does not bounce towards wards and allies, but it does bounce off of them when attacking them. Fully works against buildings.",
        "Upon learning, Luna's glaive permanently emits blue particles, visible to everyone."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Moon Glaives",
      "cooldown": null,
      "description": "Empowers Luna's glaives, causing her attacks to bounce between enemy units. Deals less damage with each bounce.",
      "hot_key": "W",
      "params": [
        "Search Radius: 500",
        "Number of Bounces: 3\/4\/5\/6",
        "Damage Reduction per Bounce: 56%\/50%\/44%\/38% (TagTalent 48%\/42%\/36%\/30%)",
        "When disjointed by the primary attack target, it does not bounce. When disjointed by a secondary target, the disjointing unit is not registered as hit, meaning the attack can immediately bounce on it again if within range. A disjointed bounce still counts towards the max bounces."
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies"
      ],
      "notes": [
        "Increases Luna's night vision to a total of 1050\/1300\/1550\/1800.",
        "The aura's buff lingers for 0.5 seconds.",
        "Affects invulnerable, but not hidden units.",
        "Upon learning, Luna emits very faint pulsing particles around her.",
        "Despite the tooltip, the aura affects non-hero units as well."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Lunar Blessing",
      "cooldown": null,
      "description": "Increases the attack damage for Luna and nearby allied heroes. Luna is also blessed with increased vision range at night.",
      "hot_key": "E",
      "params": [
        "Radius: 1200 (TagTalent Global)",
        "Self Night Vision Bonus: 250\/500\/750\/1000",
        "Attack Damage Bonus: 5\/15\/25\/35 (TagTalent 40\/50\/60\/70)",
        "Aura Linger Duration: 0.5"
      ],
      "legacy_key": "L",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5d\/Luna_Eclipse_1.mp3\/revision\/latest?cb=20191216015818",
      "effects": [
        "Ability No Target (TagAghanim Target Unit \/ Target Area)",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Eclipse's beams deal damage based on the current level of Lucent Beam. If it is not leveled, Eclipse deals no damage.",
        "Eclipse turns the time of day into nighttime for 10 seconds. This is independent from Eclipse's duration. Does not interfere with the nighttime caused by Dark Ascension in any way, meaning Night Stalker's night is not paused. Has a lower priority than the daytime caused by Supernova.",
        "Does not interfere with the nighttime caused by Dark Ascension in any way, meaning Night Stalker's night is not paused.",
        "Has a lower priority than the daytime caused by Supernova.",
        "Does not hit invisible units and units in the Fog of War.",
        "Luna's glaive emits particles during the cast time, visible to everyone.",
        "Multiple casts of Eclipse work fully independently from each other.",
        "When Luna dies, Eclipse ends prematurely. However, the nighttime it created persists.",
        "Maximum possible damage to a single target (before reductions) on each level of Lucent Beam: Level 1: 375 (TagTalent 875) (TagTalent 450\/900\/1350, 1050\/2100\/3150) Level 2: 750 (TagTalent 1250) (TagTalent 900\/1800\/2700, 1500\/3000\/4500) Level 3: 1125 (TagTalent 1625) (TagTalent 1350\/2700\/4050, 1950\/3900\/5850) Level 4: 1500 (TagTalent 2000) (TagTalent 1800\/3600\/5400, 2400\/4800\/7200)",
        "Level 1: 375 (TagTalent 875) (TagTalent 450\/900\/1350, 1050\/2100\/3150)",
        "Level 2: 750 (TagTalent 1250) (TagTalent 900\/1800\/2700, 1500\/3000\/4500)",
        "Level 3: 1125 (TagTalent 1625) (TagTalent 1350\/2700\/4050, 1950\/3900\/5850)",
        "Level 4: 1500 (TagTalent 2000) (TagTalent 1800\/3600\/5400, 2400\/4800\/7200)",
        "With the level 25 talent, the beams also stun hit enemies for 0.2 seconds. Since the stun is not based on Lucent Beam's stun, it is applied regardless of the ability's level. The talent immediately takes effect, causing the already active casts to stun as well. The beams first apply their damage, then the debuff.",
        "Since the stun is not based on Lucent Beam's stun, it is applied regardless of the ability's level.",
        "The talent immediately takes effect, causing the already active casts to stun as well.",
        "The beams first apply their damage, then the debuff.",
        "With Aghanim's Scepter, Eclipse turns into an area-targeted ability. It may be cast on an ally or ground-targeted. ↓↓ Double-tapping automatically targets self. When targeting an ally, it follows that ally like how a regular cast follows Luna. Can target any allied units, except for wards and buildings. Eclipse ends when the targeted ally dies, instead of Luna. When ground-targeted, it stays stationary at the targeted point. Provides 675 radius ground vision for its duration. Eclipse still ends prematurely when Luna dies.",
        "↓↓ Double-tapping automatically targets self.",
        "When targeting an ally, it follows that ally like how a regular cast follows Luna. Can target any allied units, except for wards and buildings. Eclipse ends when the targeted ally dies, instead of Luna.",
        "Can target any allied units, except for wards and buildings.",
        "Eclipse ends when the targeted ally dies, instead of Luna.",
        "When ground-targeted, it stays stationary at the targeted point. Provides 675 radius ground vision for its duration. Eclipse still ends prematurely when Luna dies.",
        "Provides 675 radius ground vision for its duration.",
        "Eclipse still ends prematurely when Luna dies."
      ],
      "mana": "150\/200\/250",
      "item_behaviour": [],
      "name": "Eclipse",
      "cooldown": "140\/130\/120 (TagTalent 120\/110\/100)",
      "description": "Showers random nearby enemies with strikes from Luna's current level of Lucent Beam. These beams do not stun their targets, and there is a maximum number of times that a single target can be struck. Also turns day into night for 10 seconds.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.5+0.37",
        "Search Radius: 675",
        "Number of Beams: 6\/9\/12 (TagAghanim 6\/12\/18)",
        "Max Beams per Unit: 5 (TagAghanim 6\/12\/18)",
        "Beam Interval: 0.6 (TagAghanim 0.3)",
        "Eclipse Duration: 2.4\/4.2\/6 (TagAghanim 1.5\/3.3\/5.1)",
        "Stun Duration per Beam: 0.2",
        "Cast Range: 2500",
        "Allows Luna to cast Eclipse on an allied unit or herself and have its effects follow them, or cast it on an area. Also increases total beams and duration, removes the limit on beams per unit, and makes the beams appear twice as fast."
      ],
      "legacy_key": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 3.4,
    "attrAgility": 24.0
  },
  "description": "Luna, the Moon Rider, is a ranged agility carry hero. Even though she can be seen as a tempting target for enemy heroes, Luna possesses solid early game laning presence due to her Lucent Beams, a cheap, low-cooldown nuke, and her Lunar Blessing aura, which grants all nearby allied heroes an increase in their attack damage. Mid-game, she becomes far more formidable with Moon Glaives, allowing her to kill entire creep waves with two to three attacks, and Eclipse, which can very quickly kill a hero if that hero is unfortunate enough to catch its full blast. Her Achilles' Heel is her fragility; she has no escape abilities and cannot handle a lot of punishment, relying on her movement speed to keep her out of harm's way. Luna begins and ends a match dangerously, and if played carefully and skillfully, she will destroy anybody who stands against her.",
  "history": "How had she been reduced to this? She was once the Scourge of the Plains, a merciless leader of men and beasts, and able to sow terror wherever she dared. Now she was far from her homeland, driven half mad from starvation and months of wandering, her army long dead or worse. As she stood at the edge of an ancient forest, a pair of glowing eyes spied on from an elder branch. Something beautiful and deadly sought a meal in the wilting dusk. Without a sound, it turned and left. Fury overtook her. Clutching a rust-eaten dagger, she charged after the beast determined to reclaim even a shred of her past glory, but her quarry would not be caught. Three times she cornered the creature among the rocks and trees, and three times she pounced only to witness its fading shadow darting further into the woods. Yet the full moon shone brightly, and the creature's trail was easy to follow. Arriving in a clearing atop a high hill, the beast's massive feline form sat in the open, attentive and waiting. When the woman brandished her dagger, the creature reared and roared and charged. Death, it seemed, had come for her at long last in this strange place. She stood, calm and ready. A flash of movement, and the beast snatched the dagger from her hand before vanishing into the forest. Stillness. Hooded figures approached. In reverent tones they revealed that Selemene, Goddess of the Moon, had chosen her, had guided her, had tested her. Unwittingly she had endured the sacred rites of the Dark Moon, warriors of the Nightsilver Woods. She was offered a choice: join the Dark Moon and pledge herself to the service of Selemene, or leave and never return. She did not hesitate. Embracing her absolution, she renounced her bloody past, and took up a new mantle as Luna of the Dark Moon, the dreaded Moon Rider, ruthless and ever-loyal guardian of the Nightsilver Woods.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+0.2s Eclipse Lucent Ministun",
      "talentRight": "+35 Lunar Blessing Damage"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 Lucent Beam Damage",
      "talentRight": "Global Lunar Blessing"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-20s Eclipse Cooldown",
      "talentRight": "-3.5s Lucent Beam Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0.4s Lucent Beam Ministun",
      "talentRight": "-8% Moon Glaives Damage Reduction"
    }
  ]
}