{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Enchanted_Mango_Eat_Mango.mp3\/revision\/latest?cb=20191227195412",
      "effects": [
        "Способность Ненаправленная \/ Направленная на существо",
        "Действует на Себя \/ Союзных героев"
      ],
      "notes": [
        "Владелец прерывает произнесение заклинания при использовании.",
        "Без зажатия клавиши Ctrl, игрок всегда использует Enchanted Mango на себя в одно нажатие. Зажатие клавиши Ctrl позволяет использовать предмет на союзника.",
        "Если цель находится на расстоянии более 650 единиц, то заклинатель перемещается к цели до тех пор, пока он не окажется на расстоянии в 400 единиц перед использованием. Если приказ об использовании дан на цель, которая уже находится на расстоянии в 650 единиц, то заклинатель не перемещается к цели и сразу использует Enchanted Mango.",
        "Если приказ об использовании дан на цель, которая уже находится на расстоянии в 650 единиц, то заклинатель не перемещается к цели и сразу использует Enchanted Mango.",
        "Можно использовать только на героев (включая иллюзии) и крипов-героев.",
        "Владельцу не нужно поворачиваться к цели, чтобы использовать Enchanted Mango."
      ],
      "mana": null,
      "abilityName": "Eat Mango",
      "cooldown": "0",
      "description": "Мгновенно восстанавливает 100 маны.",
      "params": [
        "Стандартная дальность применения: 400",
        "Полная дальность применения: 650",
        "Восстанавливает маны: 100"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Enchanted Mango складываются в инвентаре до трёх зарядов в одной ячейке. Регенерация здоровья от нескольких Enchanted Mango полностью складывается.",
    "Регенерация здоровья от нескольких Enchanted Mango полностью складывается.",
    "Enchanted Mango нельзя передавать, однако их можно использовать на союзников.",
    "Enchanted Mango нельзя продать после стадии подготовки или после 10 секунд покупки.",
    "Enchanted Mango, которое упало на землю, имеет увеличенную дальность подбора в 300 единиц по сравнению с дальностью подбора в 150 единиц у остальных предметов."
  ],
  "cost": "70",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Enchanted Mango",
  "description": "Любимый амфибиями горько-сладкий плод с острова Джиди.",
  "trivia": [
    "Описание к Enchanted Mango — это отсылка к старому сообщению от Icefrog, в котором он упомянул, что любит манго.",
    "Скорее всего, идея предмета пришла из Reddit, где кто-то из пользователей предложил предмет Tango, которое будет восстанавливать ману, в шутку назвать Mango.",
    "До обновления от 14 июля 2017 года активная способность Eat Mango у Enchanted Mango не имела официального названия. Название было взято из Dota 2 Wiki и официально выпущено в Dota 2."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+0,6 к регенерации здоровья"
  ],
  "tips": [
    "Enchanted Mango — хороший ресурс для быстрого пополнения маны. Одно Enchanted Mango восстанавливает достаточно маны для большинства заклинаний на начальной стадии игры, позволяя некоторым героям мгновенно использовать заклинание.",
    "Золото не будет потрачено на Enchanted Mango впустую, если у вас нет возможности использовать их в настоящий момент, так как они повышают регенерацию здоровья, находясь в инвентаре (но не в ранце).",
    "Несмотря на то что Clarity восстанавливает больше маны за меньшее количество золота, стоит учитывать, что Enchanted Mango мгновенно восстанавливает ману, поэтому он более ценный в бою, чем Clarity. Enchanted Mango — лучший вариант для агрессивных героев, которые любят продолжительные сражения."
  ]
}