{"abilities":[{"spell":"Allows manipulation of ice elements. Each Quas instance provides increased health regeneration.","effects":["Ability No Target","Affects Self"],"notes":["Quas interrupts Invoker's channeling spells upon cast.","Quas can be leveled 7 times.","Invoker can only have up to 3 instances up at any time. The orbs floating above Invoker are visible to everyone.","If he already has 3 instances, the oldest instance is replaced. The order of instances can be seen in the HUD as status buff icons, the oldest one being on the left.","Can regenerate up to 60\/180\/300\/420\/540\/660\/780 health per Quas instance in one minute.","This is how much health regeneration Invoker gains from 1, 2 and 3 Quas instances: 1 Quas Instance: 1\/3\/5\/7\/9\/11\/13 health regeneration 2 Quas Instances: 2\/6\/10\/14\/18\/22\/26 health regeneration 3 Quas Instances: 3\/9\/15\/21\/27\/33\/39 health regeneration"],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Can be used by illusions."],"cooldown":"0","name":"Quas","description":["Cast Animation: 0+0","Instances of Quas per Cast: 1","Health Regen Bonus per Quas Instance: 1\/3\/5\/7\/9\/11\/13"],"hot_key":"Q","legacy_key":"Q"},{"spell":"Allows manipulation of storm elements. Each Wex instance provides increased attack speed and movement speed.","effects":["Ability No Target","Affects Self"],"notes":["Wex interrupts Invoker's channeling spells upon cast.","Wex can be leveled 7 times.","Invoker can only have up to 3 instances up at any time. The orbs floating above Invoker are visible to everyone.","If he already has 3 instances, the oldest instance is replaced. The order of instances can be seen in the HUD as status buff icons, the oldest one being on the left.","This is how much attack speed and movement speed Invoker gains from 1, 2 and 3 Wex instances: 1 Wex Instance: 2\/4\/6\/8\/10\/12\/14 attack speed and 1%\/2%\/3%\/4%\/5%\/6%\/7% movement speed 2 Wex Instances: 4\/8\/12\/16\/20\/24\/28 attack speed and 2%\/4%\/6%\/8%\/10%\/12%\/14% movement speed 3 Wex Instances: 6\/12\/18\/24\/30\/36\/42 attack speed and 3%\/6%\/9%\/12%\/15%\/18%\/21% movement speed"],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Can be used by illusions."],"cooldown":"0","name":"Wex","description":["Cast Animation: 0+0","Instances of Wex per Cast: 1","Attack Speed Bonus per Wex Instance: 2\/4\/6\/8\/10\/12\/14","Move Speed Bonus per Wex Instance: 1%\/2%\/3%\/4%\/5%\/6%\/7%"],"hot_key":"W","legacy_key":"W"},{"spell":"Allows manipulation of fire elements. Each Exort instance provides increased attack damage.","effects":["Ability No Target","Affects Self"],"notes":["Exort interrupts Invoker's channeling spells upon cast.","Exort can be leveled 7 times.","Invoker can only have up to 3 instances up at any time. The orbs floating above Invoker are visible to everyone.","If he already has 3 instances, the oldest instance is replaced. The order of instances can be seen in the HUD as status buff icons, the oldest one being on the left.","This is how much attack damage Invoker gains from 1, 2 and 3 Exort instances: 1 Exort Instance: 2\/6\/10\/14\/18\/22\/26 attack damage 2 Exort Instances: 4\/12\/20\/28\/36\/44\/52 attack damage 3 Exort Instances: 6\/18\/30\/42\/54\/66\/78 attack damage"],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Can be used by illusions."],"cooldown":"0","name":"Exort","description":["Cast Animation: 0+0","Instances of Exort per Cast: 1","Attack Damage Bonus per Exort Instance: 2\/6\/10\/14\/18\/22\/26"],"hot_key":"E","legacy_key":"E"},{"spell":"Combines the properties of the elements currently being manipulated to create a new spell for Invoker to use. Invoke cooldown is reduced by 0.3 seconds for each orb level. Click the help button to see the list of possible spells.","effects":["Ability No Target","Affects Self"],"notes":["This is an innate ability and does not need to be learned.","A button is located right above the ability icon. It opens a list which shows the required combination for every invoked ability.","Invoke interrupts Invoker's channeling spells upon cast.","The arrangement of element instances does not matter.","When already having two spells invoked, invoking a new spell replaces the older spell.","New invoked spells are always placed in the 4th ability slot. The previously invoked spell is moved to the 5th slot in the process, while the previous spell in the 5th slot is lost.","When invoking a spell which is already invoked, Invoke does not go on cooldown. If the re-invoked ability was in the 5th ability slot, it moves into the 4th, swapping position with the other invoked ability.","When not using legacy or custom hotkeys, the hotkey for the spell in the 4th slot is always D and the spell in the 5th slot is always F.","Each level of Quas, Wex, and Exort reduces the cooldown for Invoke by 0.3 seconds. Cooldown of Invoke with each level of orbs: 6.7 \/ 6.4 \/ 6.1 \/ 5.8 \/ 5.5 \/ 5.2 \/ 4.9 \/ 4.6 \/ 4.3 \/ 4 \/ 3.7 \/ 3.4 \/ 3.1 \/ 2.8 \/ 2.5 \/ 2.2 \/ 1.9 \/ 1.6 \/ 1.3 \/ 1 \/ 0.7 The Aghanim's Scepter upgrade does not improve the passive bonuses granted by Quas, Wex and Exort. It makes invoked spells consider them one level higher than what they are."],"mana":"0","elements":[],"cooldown":"7","name":"Invoke","description":["Cast Animation: 0+0","Max Spells: 2","Cooldown Reduction per Orb Level: 0.3"],"hot_key":"R","legacy_key":"R"},{"spell":"Invoker draws the heat from an enemy, chilling them to their very core for a duration based on the level of Quas. The enemy will take damage and be briefly frozen. Further damage taken in this state will freeze the enemy again, dealing bonus damage. The enemy can only be frozen so often, but the freeze cooldown decreases based on the level of Quas.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Ability invokes when Invoker has 3 Quas instances.","Cold Snap immediately triggers on the target upon cast, so the next proc can only happen after the trigger cooldown.","Every time the effect triggers, the target is stunned and damaged.","On each trigger, Cold Snap first applies the damage, then the stun debuff.","Only triggers on damage equal to or greater than 10 (after reductions).","Cold Snap does not trigger on self-inflicted damage, and on damage flagged as HP Removal.","With its current trigger cooldown and debuff duration, it can trigger up to 4\/5\/6\/7\/8\/9\/10 ( \/12) times (including the initial trigger upon cast).","Can deal up to 32\/80\/144\/224\/320\/432\/560 ( \/768) damage (before reductions) when triggering as often as possible.","Ability formulas: Damage per proc: 0 + (8 * Quas) Trigger cooldown: 0.8 - (0.03 * Quas) Debuff duration: 2.5 + (0.5 * Quas)"],"mana":"100","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"20 ( 10)","name":"Cold Snap","description":["Cast Animation: 0.05+0","Cast Range: 1000","Damage per Proc (Quas): 8\/16\/24\/32\/40\/48\/56 ( \/64)","Stun Duration per Proc: 0.4","Trigger Cooldown (Quas): 0.77\/0.74\/0.71\/0.69\/0.66\/0.63\/0.60 ( \/0.57)","Debuff Duration (Quas): 3\/3.5\/4\/4.5\/5\/5.5\/6 ( \/6.5)"],"hot_key":"D\/F","legacy_key":"Y"},{"spell":"Invoker manipulates the ice and electrical energies around him, rendering his body invisible. The elemental imbalance created as a consequence slows nearby enemies based on the level of Quas, and slows Invoker as well based on the level of Wex.","effects":["Ability No Target","Affects Self \/ Enemies"],"notes":["Ability invokes when Invoker has 2 Quas and 1 Wex instances.","Ghost Walk does not interrupt Invoker's channeling spells upon cast.","The movement speed slow on the enemies is provided by an aura. Its debuff lingers for 2 seconds.","The slow debuff places some particles on the affected units, allowing them to know that Invoker is nearby.","Invisibility is lost upon reaching the cast point of spells or items, or upon launching an attack.","Ghost Walk allows Invoker to pass through other units, including wards but not buildings.","Invoker can pick up or drop items without breaking the invisibility.","Ability formulas: Enemy movement speed slow: 15 + (5 * Quas) Self movement speed change: -40 + (10 * Wex)"],"mana":"200","elements":["Does not pierce spell immunity."],"cooldown":"45 ( 15)","name":"Ghost Walk","description":["Cast Animation: 0+0","Fade Time: 0","Slow Radius: 400","Enemy Move Speed Slow (Quas): 20%\/25%\/30%\/35%\/40%\/45%\/50% ( \/55%)","Self Move Speed Change (Wex): -30%\/-20%\/-10%\/0%\/+10%\/+20%\/+30% ( \/+40%)","Aura Linger Duration: 2","Duration: 100"],"hot_key":"D\/F","legacy_key":"V"},{"spell":"Generates a wall of solid ice directly in front of Invoker for a duration based on the level of Quas. The bitter cold emanating from it greatly slows nearby enemies based on the level of Quas and deals damage each second based on the level of Exort.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Ability invokes when Invoker has 2 Quas and 1 Exort instances.","The Ice Wall is always created in front of Invoker, perpendicular to the line between Invoker and a point 200 range right in front of him.","Creates 15 wall segments, with a spacing of 80 between each, resulting in a total length of 1120. Each segment affects a 105 radius around itself.","The wall's effective length is 1330 (wall length + radius from both sides).","Each segment possesses a movement speed slowing aura. Its debuff lingers for 2 seconds.","The damage is independent from the slow, so getting further than 105 radius away from a segment immediately stops the damage, while the slow still lingers.","Deals damage in 1 second intervals, starting 1 second after cast, resulting in up to 3\/4\/6\/7\/9\/10\/12 ( \/13) possible instances.","Can deal up to 18\/48\/108\/168\/270\/360\/504 ( \/624) damage to a single unit (before reductions), when it stays in range for its full duration.","Ice Wall is not a pathing blocker. Any unit can pass through it.","Ability formulas: Damage per second: 0 + (6 * Exort) Movement speed slow: 0 + (20 * Quas) Wall duration: 1.5 + (1.5 * Quas)"],"mana":"175","elements":["Does not pierce spell immunity."],"cooldown":"25","name":"Ice Wall","description":["Cast Animation: 0.05+0","Wall Spawn Distance: 200","Wall Length: 1120","Wall Width: 105","Damage per Second (Exort): 6\/12\/18\/24\/30\/36\/42 ( \/48)","Move Speed Slow (Quas): 20%\/40%\/60%\/80%\/100%\/120%\/140% ( \/160%)","Aura Linger Duration: 2","Wall Duration (Quas): 3\/4.5\/6\/7.5\/9\/10.5\/12 ( \/13.5)"],"hot_key":"D\/F","legacy_key":"G"},{"spell":"Invoker builds up a charge of electromagnetic energy at a targeted location which automatically detonates after 2.9 seconds. The detonation covers an area, draining mana based on the level of Wex. Deals damage for each point of mana drained. If EMP drains mana from an enemy hero, Invoker gains 50% of the mana drained.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Ability invokes when Invoker has 3 Wex instances.","Applies the mana loss first, and then the damage.","Invoker only gains the mana when it burns mana from heroes. Mana burned on illusions and other units does not restore mana.","The damage and the restored mana are dependent on the amount of mana burned on the enemies. This means if the enemy had no mana left to burn, it deals no damage to it and does not restore Invoker's mana.","Fully affects invisible units, but not invulnerable or hidden units.","Can deal up to 60\/105\/150\/195\/240\/285\/330 ( \/375) damage to each affected unit (before reductions).","Can restore up to 50\/87.5\/125\/162.5\/200\/237.5\/275 ( \/312.5) mana for Invoker from each affected hero.","The visual effects and the sound during the 2.9 seconds effect delay are visible and audible to everyone.","Ability formulas: Mana burned: 25 + (75 * Wex)"],"mana":"125","elements":["Does not pierce spell immunity."],"cooldown":"30","name":"EMP","description":["Cast Animation: 0.05+0","Cast Range: 950","Effect Radius: 675","Effect Delay: 2.9","Mana Burned (Wex): 100\/175\/250\/325\/400\/475\/550 ( \/625)","Damage per Burned Mana: 60%","Self Mana Gain per Burned Mana: 50%"],"hot_key":"D\/F","legacy_key":"C"},{"spell":"Unleashes a fast moving tornado that picks up enemy units in its path, suspending them helplessly in the air shortly before allowing them to plummet to their doom. Travels further based on the level of Wex. Holds enemies in the air for a duration based on the level of Quas. Deals base damage plus added damage based on levels in Wex.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Ability invokes when Invoker has 2 Wex and 1 Quas instances.","The Tornado travels at a speed of 1000 and always travels the full distance, so it takes 0.8\/1.2\/1.6\/2\/2.4\/2.8\/3.2 ( \/3.6) seconds to reach the max distance.","The Tornado can hit units up to 1000\/1400\/1800\/2200\/2600\/3000\/3400 ( \/3800) range away (travel distance + effect radius).","Applies a Cyclone effect on the affected units, so it applies a basic dispel on them, turns them invulnerable and fully disables them for its duration.","Tornado first applies the dispel, then the cyclone.","The damage is applied upon losing the Tornado debuff. Can deal up to 115\/160\/205\/250\/295\/340\/385 ( \/430) damage to each affected unit (before reductions).","While in the air, other units may pass below the cycloned units.","The Tornado provides 200 radius flying vision as it travels. This vision does not last.","Also provides the same vision for 1.75 seconds after reaching its final destination.","Does not lift Roshan, but damages and interrupts him for a split second.","Ability formulas: Travel distance: 400 + (400 * Wex) Bonus damage: 0 + (45 * Wex) Cyclone duration: 0.5 + (0.3 * Quas)"],"mana":"150","elements":["Does not pierce spell immunity."],"cooldown":"30 ( 20)","name":"Tornado","description":["Cast Animation: 0.05+0","Cast Range: 2000","Effect Radius: 200","Travel Distance (Wex): 800\/1200\/1600\/2000\/2400\/2800\/3200 ( \/3600)","Base Damage: 70","Bonus Damage (Wex): 45\/90\/135\/180\/225\/270\/315 ( \/360)","Cyclone Duration (Quas): 0.8\/1.1\/1.4\/1.7\/2\/2.3\/2.6 ( \/2.9)"],"hot_key":"D\/F","legacy_key":"X"},{"spell":"Invoker infuses an ally with an immense surge of energy, increasing their attack speed based on the level of Wex and their damage based on the level of Exort.","effects":["Ability Target Unit","Affects Allies"],"notes":["Ability invokes when Invoker has 2 Wex and 1 Exort instances.","Ability formulas: Attack speed bonus: -5 + (15 * Wex) ( -5 + 50 + (15 * Wex)) Attack damage bonus: -5 + (15 * Exort) ( -5 + 50 + (15 * Exort))"],"mana":"60","elements":["Pierces spell immunity."],"cooldown":"17","name":"Alacrity","description":["Cast Animation: 0.05+0","Cast Range: 650","Attack Speed Bonus (Wex): 10\/25\/40\/55\/70\/85\/100 ( \/115) ( 60\/75\/90\/105\/120\/135\/150 \/165)","Attack Damage Bonus (Exort): 10\/25\/40\/55\/70\/85\/100 ( \/115) ( 60\/75\/90\/105\/120\/135\/150 \/165)","Duration: 9"],"hot_key":"D\/F","legacy_key":"Z"},{"spell":"Sends a catastrophic ray of fierce energy from the sun at any targeted location, incinerating all enemies standing beneath it once it reaches the earth. Deals damage based on the level of Exort, however this damage is spread evenly over all enemies hit.","effects":["Ability Target Area","Affects Enemies","Damage Pure"],"notes":["Ability invokes when Invoker has 3 Exort instances.","The damage is spread evenly among all affected units within the targeted area, including creeps.","This is how much damage Sun Strike deals when hitting a certain amount of units (before reductions). 2 Units: 50\/81.25\/112.5\/143.75\/175\/206.25\/237.5 ( \/268.75) damage 3 Units: 33.33\/54.17\/75\/95.83\/116.67\/137.5\/158.33 ( \/179.17) damage 4 Units: 25\/40.625\/56.25\/71.875\/87.5\/103.125\/118.75 ( \/134.375) damage 5 Units: 20\/32.5\/45\/57.5\/70\/82.5\/95 ( \/107.5) damage","Damage is only spread among units which are damaged by Sun Strike. All unaffected units do not soak up any damage.","Does not affect wards, buildings, invulnerable or hidden units.","Provides 300 radius flying vision at the targeted point for 5.5 seconds upon cast.","The visual effects and the sound during the 1.7 seconds effect delay are visible and audible to allies only.","When upgraded, self-casting Sun Strike causes it to send two strikes to every hero (including Tempest Doubles, excluding other clones and illusions) on the map. These Sun Strikes are fully visible and audible to the enemy during their delays. The strikes are placed randomly around the target, using the given minimum and maximum distances.","Ability formulas: Damage: 37.5 + (62.5 * Exort)"],"mana":"175","elements":["Pierces spell immunity."],"cooldown":"25 ( 90)","name":"Sun Strike","description":["Cast Animation: 0.05+0","Cast Range: Global","Effect Radius: 175","Cataclysm Minimum Distance: 0 ( 160)","Cataclysm Maximum Distance: 0 ( 200)","Effect Delay: 1.7","Damage (Exort): 100\/162.5\/225\/287.5\/350\/412.5\/475 ( \/537.5)"],"hot_key":"D\/F","legacy_key":"T"},{"spell":"Invoker forges a spirit embodying the strength of fire and fortitude of ice. Damage, mana, and armor are based on the level of Exort while attack range, health, and duration are based on the level of Quas. The elemental's scorching attack is capable of melting the armor of enemy heroes.","effects":["Ability No Target"],"notes":["Ability invokes when Invoker has 2 Exort and 1 Quas instances.","Casting Forge Spirit replaces the spirits from the previous cast, no matter who they are owned by.","The spirits are always summoned next to Invoker at a random position around him, but always facing east upon spawn.","Forged Spirits possess the Melting Strike ability.","Already summoned spirits do not have their stats upgraded when Quas or Exort is leveled. Their stats are set upon spawn.","Ability formulas: Spirits attack damage: 12 + (10 * Exort) Spirits attack range: 235 + (65 * Quas) Spirits max health: 200 + (100 * Quas) Spirits max mana: 50 + (50 * Exort) Spirits armor: -1 + (1 * Exort) Spirits duration: 10 + (10 * Quas)"],"mana":"75","elements":[],"cooldown":"30","name":"Forge Spirit","description":["Cast Animation: 0.05+0","Number of Forged Spirits: 1 ( 2)","Spirit Attack Damage (Exort): 22\/32\/42\/52\/62\/72\/82 ( \/92)","Spirit Attack Range (Quas): 300\/365\/430\/495\/560\/625\/690 ( \/755)","Spirit Max Health (Quas): 300\/400\/500\/600\/700\/800\/900 ( \/1000)","Spirit Max Mana (Exort): 100\/150\/200\/250\/300\/350\/400 ( \/450)","Spirit Armor (Exort): 0\/1\/2\/3\/4\/5\/6 ( \/7)","Spirit Duration (Quas): 20\/30\/40\/50\/60\/70\/80 ( \/90)"],"hot_key":"D\/F","legacy_key":"F"},{"spell":"Invoker pulls a flaming meteor from space onto the targeted location. Upon landing, the meteor rolls forward, constantly dealing damage based on the level of Exort, and rolling further based on the level of Wex. Units hit by the meteor will also be set on fire for a short time, receiving additional damage based on the level of Exort.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Ability invokes when Invoker has 2 Exort and 1 Wex instances.","The Chaos Meteor needs 1.3 seconds to land. It lands at the targeted point, not at Invoker's position.","Can hit units up to 1440\/1590\/1745\/1895\/2045\/2195\/2345 ( \/2495) range away (cast range + travel distance + effect radius). The area between Invoker and the targeted point is unaffected.","The visual effects and the sound during the 1.3 seconds effect delay (the meteor falling from the sky) are visible and audible to everyone.","The Chaos Meteor rolls at a speed of 300 and always rolls the full distance, so it takes 1.55\/2.05\/2.57\/3.07\/3.57\/4.07\/4.57 ( \/5.07) seconds to reach the max distance.","After landing, the meteor deals its main damage and places the burn debuff to units within its effect radius in 0.5 second intervals, starting immediately upon landing.","On each interval, the meteor first applies the damage, then the debuff.","The main damage can hit a unit up to 4\/5\/6\/7\/8\/9\/10 ( \/11) times and thus can deal up to 230\/375\/555\/770\/1020\/1305\/1625 ( \/1980) ( 390\/575\/795\/1050\/1340\/1665\/2025 ( \/2420)) damage (before reductions).","The burn debuff deals damage in 1 second intervals, starting 1 seconds after the debuff is placed, resulting in 3 instances for each debuff.","The debuffs from each interval fully stack and do not refresh each other. So a unit can be affected by 4\/5\/6\/7\/8\/9\/10 ( \/11) instances of the burn debuff per cast.","One instance of the burn debuff can deal up to 34.5\/45\/55.5\/66\/76.5\/87\/97.5 ( \/108) damage (before reductions).","All possible instances of burn damage per unit together can deal up to 138\/225\/333\/462\/612\/783\/975 ( \/1188) damage (before reductions).","The whole Chaos Meteor, main and burn damage, can deal up to 368\/600\/888\/1232\/1632\/2088\/2600 ( \/3168) ( 528\/800\/1128\/1512\/1952\/2448\/3000 ( \/3608)) damage (before reductions) when a unit is hit by all possible instances.","The Meteor provides 400 radius flying vision while it is rolling. This vision does not last.","Also provides the same vision for 3 seconds after reaching its final destination.","Ability formulas: Travel distance: 315 + (150 * Wex) Main damage per interval: 40 + (17.5 * Exort) ( 40 + 30 + (17.5 * Exort)) Burn damage per second: 8 + (3.5 * Exort)"],"mana":"200","elements":["Does not pierce spell immunity."],"cooldown":"55","name":"Chaos Meteor","description":["Cast Animation: 0.05+0","Cast Range: 700","Effect Radius: 275","Travel Distance (Wex): 465\/615\/770\/920\/1070\/1220\/1370 ( \/1520)","Effect Delay: 1.3","Effect Interval: 0.5","Main Damage per Interval (Exort): 57.5\/75\/92.5\/110\/127.5\/145\/162.5 ( \/180) ( 97.5\/115\/132.5\/150\/167.5\/185\/202.5 \/220)","Burn Damage per Second (Exort): 11.5\/15\/18.5\/22\/25.5\/29\/32.5 ( \/36)","Burn Duration: 3"],"hot_key":"D\/F","legacy_key":"D"},{"spell":"Invoker unleashes a mighty sonic wave in front of him, dealing damage to any enemy unit it collides with based on the level of Exort. The sheer impact from the blast is enough to knock those enemy units back for a duration based on the level of Quas, then disarm their attacks for a duration based on the level of Wex.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Ability invokes when Invoker has 1 Quas, 1 Wex and 1 Exort instances.","Deafening Blast travels at a speed of 1100 and always travels the full distance, which takes 0.91 seconds.","The blast can hit units up to 1225 range away (travel distance + end radius).","The complete area is shaped like a cone.","Applies a non-disabling Forced Movement, so affected enemies can still use spells and items during it and their channeling spells are not interrupted.","The knockback and disarm are applied at the same time.","This is how the knockback works: Affected units are moved in 0.03 second intervals. They are moved 8\/16\/25\/33\/41\/50\/58 ( \/66) times (Quas * 25 \/ 3). The first 1\/3 times, units are moved linearly, by a distance of 6 per interval. 1\/3 of the intervals is 2\/5\/8\/11\/13\/16\/19 ( \/22) times, which results in a distance of 12\/30\/48\/66\/78\/96\/114 ( \/132). For the remaining 6\/11\/17\/22\/28\/34\/39 ( \/44) intervals, the units are moved exponentially with 0.98 times the speed of the previous interval. So the remaining intervals together (on each level) move the units by a distance of (6 * ∑n=1→i(n=1→i)(0.98n) =) 33.56\/58.58\/85.46\/105.5\/127.02\/146.08\/160.29 ( \/173.14). Summed up, the total distance on each level is 45.56\/88.58\/133.46\/171.5\/205.02\/242.08\/274.29 ( \/305.14). As conclusion, the knockback starts at a speed of 200 and decreases exponentially.","When the talent for it is chosen, the blasts are released towards every direction around Invoker, no matter where it is targeted. A total of 12 blasts are released. One blast is released towards the targeted point, while the other eleven are adapted to it, with 30 degree angles between them. A unit can only be hit by one blast per cast. If an enemy unit stands within the areas of multiple blasts, it is only affected by one.","Can knock units over impassable terrain. During the knockback, all trees the units collide with get destroyed.","Does not knock back Roshan, but damages and disarms him.","Ability formulas: Damage: 0 + (40 * Exort) Knockback distance: See knockback notes above Knockback duration: 0 + (0.25 * Quas) Disarm duration: 0.5 + (0.75 * Wex)"],"mana":"300","elements":["Does not pierce spell immunity."],"cooldown":"40","name":"Deafening Blast","description":["Cast Animation: 0.05+0","Cast Range: 1000","Starting Radius: 175","Travel Distance: 1000","End Radius: 225","Damage (Exort): 40\/80\/120\/160\/200\/240\/280 ( \/320)","Knockback Distance (Quas): 45.6\/88.6\/133.5\/171.5\/205\/242.1\/274.3 ( \/305.14)","Knockback Duration (Quas): 0.25\/0.5\/0.75\/1\/1.25\/1.5\/1.75 ( \/2)","Disarm Duration (Wex): 1.25\/2\/2.75\/3.5\/4.25\/5\/5.75 ( \/6.5)"],"hot_key":"D\/F","legacy_key":"B"},{"spell":"Melts away the armor of heroes hit by the spirit's attack if the spirit has enough mana. Each successive hit increases the amount of armor melted.","effects":["Ability Passive","Affects Enemy Heroes"],"notes":["Successive attacks fully refresh the whole stack's duration.","The armor reduction is applied or increased after the attack damage is applied.","Only affects heroes and illusion, and nothing else.","The mana is used when the attack successfully hits the target, not upon projectile launch.","This means that missed or disjointed attacks do not cost any mana."],"mana":"40","elements":["Not disabled by Break.","Does not pierce spell immunity."],"cooldown":"","name":"Melting Strike","description":["Armor Reduction per Attack: 1 ( 3)","Armor Reduction Cap: 10 ( 30)","Duration: 5"]}],"bio":"In its earliest, and some would say most potent form, magic was primarily the art of memory. It required no technology, no wands or appurtenances other than the mind of the magician. All the trappings of ritual were merely mnemonic devices, meant to allow the practitioner to recall in rich detail the specific mental formulae that unlocked a spell's power. The greatest mages in those days were the ones blessed with the greatest memories, and yet so complex were the invocations that all wizards were forced to specialize. The most devoted might hope in a lifetime to have adequate recollection of three spells—four at most. Ordinary wizards were content to know two, and it was not uncommon for a village mage to know only one—with even that requiring him to consult grimoires as an aid against forgetfulness on the rare occasions when he might be called to use it. But among these early practitioners there was one exception, a genius of vast intellect and prodigious memory who came to be known as the Invoker. In his youth, the precocious wizard mastered not four, not five, not even seven incantations: He could command no fewer than ten spells, and cast them instantly. Many more he learned but found useless, and would practice once then purge from his mind forever, to make room for more practical invocations. One such spell was the Sempiternal Cantrap—a longevity spell of such power that those who cast it in the world's first days are among us still (unless they have been crushed to atoms). Most of these quasi-immortals live quietly, afraid to admit their secret: But Invoker is not one to keep his gifts hidden. He is ancient, learned beyond all others, and his mind somehow still has space to contain an immense sense of his own worth...as well as the Invocations with which he amuses himself through the long slow twilight of the world's dying days.","trivia":["In the earliest version of Invoker, the order of instances mattered when Invoke was cast. Invoker, therefore, had access to 27 spells, including most of the 10 still in the game (though with some differences). For more information, see here.","Invoker is (or used to be) a Magus like Rubick, who calls him the Arsenal Magus.","Invoker's Deafening Blast cast response \"Sonic boom!\" is a reference to the signature move of Guile from the Street Fighter fighting game series.","Invoker (Along with some players and casters) sometimes jokingly refers to his Chaos Meteor as a meatball ( \"Behold the meatball!\"), due to their highly similar appearance.","One of Invoker's lines when he casts Chaos Meteor is \"Gallaron's Abyssal Carnesphere!\" Carne is Portuguese, Spanish, Romanian, and Italian for meat, and a sphere is the geometric shape of a ball. So, \"carnesphere\" is another way of saying \"meatball\".","Invoker's preferred style of spellcasting, involving the invocation of mnemonics, is inspired by the magic in Jack Vance's Dying Earth series. Further references to Vancian magic are in the alternate names for his spells, which involve verbose invocations such as \"Sadron's Protracted Frisson\" and \"Killing Wall of Koryx.\".","Invoker's line for purchasing a Blink Dagger \"Dagger of the mind.\" references the \"Dagger\" monologue from Shakespeare's play, Macbeth.","Invoker's respawn line \"Knowing me... knowing you.\" references the song by the band Abba, of the same name.","Invoker's voice actor, Dennis Bateman, also voices the Spy from Team Fortress 2. Invoker's killing response \"You die as you lived: insipid and ignorant.\" is a reference to this, as the Spy also has 2 similar killing responses: \"You died as you lived: running away!\" and \"You died as you lived: morbidly obese!\".","As referenced in the details of his name, Invoker was known as Kael, or Kael'thas Sunstrider, in DotA. Kael'thas is best known as the Lord of the Blood Elves in the Warcraft universe. The Invoker of DotA also makes use of his Warcraft 3 model and voice. Skywrath Mage's responses when meeting Invoker may also be related to this, as Dragonus was also a blood elf in DotA.","The first letter of Quas, Wex and Exort refers to the key of a QWERTY keyboard they are by default bound to (Q, W, and E). In lore, they are most likely mnemonics used to invoke spells."],"talents":["+2 Forged Spirit Armor Reduction:Radial Deafening Blast","+50 Alacrity Damage\/Speed:-10s Tornado Cooldown","-10s Cold Snap Cooldown:+1 Forged Spirit Summoned","+40 Chaos Meteor Contact Damage:-30s Ghost Walk Cooldown"],"desc":"Carl, the Invoker, is a ranged intelligence hero who is very difficult to master. He is unique in that he possesses a total of 14 abilities in his arsenal; three of them - Quas, Wex, and Exort - are reagents and one is his special ultimate Invoke. The three abilities he learns throughout leveling up can have three instances, which serve as the basic ingredients or components for him to create a new ability using his ultimate. Once the reagents or elements are combined, he can invoke one out of ten different abilities. All of his invoked abilities are capable of a multitude of actions, from damaging enemies to aiding his allies, and even saving himself from danger. His three reagents can be upgraded up to level 7 which determines the power and potency of his invoked abilities, making it more powerful than an ordinary spell. Because of this, he can be played in almost any role possible. Invoker can be a carry, semi-carry, ganker, pusher, initiator or even support. His three reagents provide a passive bonus per instance, allowing for specialization at early levels and situational boosts at later levels. His extremely flexible nature allows him to use many different combinations of items effectively but also make him dependent on solid builds and a good gold advantage."}