{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/97\/Sentry_Ward_Plant.mp3\/revision\/latest?cb=20191227195528",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "Provides 150 radius ground vision at its location for 12 seconds.",
        "Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit.",
        "It is not possible to give couriers or Spirit Bear a Sentry Ward by holding Control.",
        "Creep spawn ranges are shown before placing a ward, allowing camps to be blocked.",
        "The radiuses of already placed Sentry Wards is shown as well, allowing to see how they overlap.",
        "Illusions and creep-heroes are treated as creeps when attacking the ward, so they take 8 attacks to destroy it, instead of 2 like heroes."
      ],
      "mana": "0",
      "abilityName": "Plant",
      "cooldown": "1",
      "description": "Plants a Sentry Ward, an invisible watcher that grants True Sight, the ability to see invisible enemy units and wards, to any existing allied vision within a radius. Lasts 8 minutes. Does not grant ground vision. Hold Control to give one Sentry Ward to an allied hero.",
      "params": [
        "Cast Range: 500",
        "Hero Attacks to Destroy: 2",
        "Non-Hero Attacks to Destroy: 8",
        "Duration: 480"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Enemies"
      ],
      "notes": [
        "The True Sight is provided in its whole area, it is not obstructed by anything.",
        "The True Sight is provided by an aura which affects enemies. Its debuff lingers for 0.5 seconds.",
        "Cannot detect units under the effect of Shadow Dance, Smoke of Deceit and Techies' mines under the effect of an Aghanim's Scepter upgraded Minefield Sign.",
        "Holding ALT shows all allied sentries' True Sight radius with a green ring."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Adds the ability to see invisible units and wards to any allied vision within the Sentry Ward's range.",
      "params": [
        "Radius: 1000",
        "Aura Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "The ability and modifier are not displayed in-game."
      ],
      "mana": null,
      "abilityName": "Invisibility",
      "cooldown": null,
      "description": "This unit is permanently invisible.",
      "params": [
        "Fade Time: 0"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks with itself and with Observer Wards in the inventory, there is no stack limit. The sell value adapts based on the number of instances in a stack. Wards from multiple players are combined when given by allies.",
    "Wards from multiple players are combined when given by allies.",
    "Sentry Wards are completely shareable.",
    "Killing a Sentry Ward prints out a chat notification to allies.",
    "Melee units have an extra 150 attack range when attacking Sentry Wards.",
    "Sentry Wards can be attacked by the player who bought them at any time, regardless of deny range. Sentry Wards receive 10 damage when it has over 50 health.",
    "Sentry Wards receive 10 damage when it has over 50 health."
  ],
  "cost": "75",
  "lore": [
    "Knowing how to craft a ward is an important skill for artificers of magical goods. Rylai showed great talent at crafting wards, and once considered becoming an artificer.",
    "Despite this, the flavor text for this item refers to Sentry Wards as plants and states that they were \"originally grown in  garden.\" This implies that they are grown as opposed to crafted, directly contradicting the White Sentry's description."
  ],
  "consistFrom": null,
  "boughtFrom": "Consumables",
  "name": "Sentry Ward",
  "description": "A form of plant originally grown in the garden of a fearful king.",
  "trivia": null,
  "upgradeIn": [
    "Observer and Sentry Wards"
  ],
  "bonuses": null,
  "tips": [
    "The Sentry Ward is recommended when facing heroes who mostly relies on invisibility (Or using invisibility as an escape mechanism), especially Riki, Bounty Hunter and Weaver. It is great to be placed near towers or shrines, so it can help heroes gank over them.",
    "It is great to be placed near towers or shrines, so it can help heroes gank over them.",
    "Sentry Wards' detection radius is quite large, making them useful for keeping an eye out on invisible heroes in key areas, given one has vision over that area.",
    "Sentry Wards are commonly used to de-ward enemy wards, as they are able to detect their wards. When dewarding, the ward is best placed so that its true sight reaches multiple common ward spots, so that it is more likely to spot enemy wards. If an enemy ward location is known, the sentry ward is best placed so that the enemy won't find it when they try to de-ward the sentry wards, like between some trees, but still so that their ward is within true sight range.",
    "When dewarding, the ward is best placed so that its true sight reaches multiple common ward spots, so that it is more likely to spot enemy wards.",
    "If an enemy ward location is known, the sentry ward is best placed so that the enemy won't find it when they try to de-ward the sentry wards, like between some trees, but still so that their ward is within true sight range.",
    "Similar to Observer Wards, Sentry Wards can also be used to block neutral creep camps."
  ]
}