{"abilities":[{"spell":"Throws a dagger slowing the enemy unit's movement speed, dealing 65+25%\/40%\/55%\/70% of Phantom Assassin's attack damage as physical damage and applying attack effects from items and abilities.","effects":["Ability Target Unit","Affects Enemies","Damage Physical"],"notes":["The Stifling Dagger travels at a speed of 1200.","Upon hitting the target, the dagger causes Phantom Assassin to perform an instant attack on the target. Since it is a regular attack, it can proc any attack modifier and on-hit effect normally, except for the following modifiers: Jinada, and Tidebringer. The damage of Tidebringer is applied, but its cleave is not. However, the attack uses no attack animation, so abilities which proc on attack begin (e.g. Untouchable) cannot be procced. Cleave effects are based on the target's position, damaging a trapezoid area the opposite direction where the dagger came from. Although the dagger may make it look like a ranged attack, the attack still counts as melee when coming from Phantom Assassin. This means all abilities which differentiate between ranged and melee, use their melee effects\/values, not ranged. The performed instant-attack has True Strike, so it cannot miss. However, when the dagger is avoided, no attack is performed. The instant attacks completely ignore disarms.","The dagger first reduces Phantom Assassin's total attack damage by the percentage, and then adds its own 65 extra damage on top of that. This results in the following formula: 65 + 25%\/40%\/55%\/70% * (main attack damage + attack damage bonuses\/reductions) \"Attack damage bonuses\/reductions\" includes all already existing attack damage changes, including temporary ones (Bash) and conditional ones (Quell). The 65 damage is also an attack damage bonus, but is added after the main damage is calculated. Attack modifiers which are based on attack damage (critical strike, lifesteal, cleave) include the 65 extra damage as well. The damage is added to Phantom Assassin's attack damage through a status buff which lasts for 0.03 seconds. Since the damage comes from a regular attack, it does not count as spell damage, but counts as attack damage. This means it is affected by damage block, unaffected by spell damage amplification and cannot spell lifesteal.","The dagger first applies the attack, then its own debuff.","The projectile has 450 range flying vision. This vision lingers for 3.34 seconds at the target's location upon successfully hitting it.","Cannot be cast on couriers.","When choosing the level 25 talent, the spell launches two additional projectiles towards random visible valid targets within range. The search range is based on the cast range, plus the buffer, resulting in a search range of 825\/1050\/1275\/1500. Cannot target the primary target with the additional projectiles, so when no other targets are nearby, nothing happens. The secondary targets are chosen randomly within the area. There are no priorities. The projectiles cannot choose both the same target. Since the additional projectiles use the spell's cast range, cast range increasing effects increase their range as well."],"mana":"30","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"6","name":"Stifling Dagger","description":["Cast Animation: 0.3+0.47","Cast Range: 525\/750\/975\/1200","Secondary Target Range Buffer: 300","Number of Targets: 1 ( 3)","Base Damage: 65","Attack Damage: 25%\/40%\/55%\/70%","Move Speed Slow: 50%","Slow Duration: 1.75\/2.5\/3.25\/4"],"hot_key":"Q","legacy_key":"D"},{"spell":"Teleports to a unit, friendly or enemy, and grants bonus attack speed while attacking if it's an enemy unit.","effects":["Ability Target Unit","Affects Self"],"notes":["Phantom Strike can be cast on allied units, without gaining the attack speed bonus.","Moves Phantom Assassin next to the target, towards the position she was upon spell cast.","Does not disjoint projectiles upon teleporting.","Phantom Assassin is ordered to attack the target if it is an enemy, automatically canceling the cast backswing.","Cannot be cast on couriers."],"mana":"35\/40\/45\/50","elements":["Cannot be cast while rooted or leashed.","Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"11\/9\/7\/5","name":"Phantom Strike","description":["Cast Animation: 0.25+0.8","Cast Range: 1000","Attack Speed Bonus: 100\/125\/150\/175","Duration: 2"],"hot_key":"W","legacy_key":"B"},{"spell":"Phantom Assassin focuses inward, increasing her ability to evade enemy attacks. Can be activated to blur her body, causing her to be impossible to see until near enemy heroes.","effects":["Ability No Target \/ Passive","Affects Self"],"notes":["Turns Phantom Assassin invisible, with True Sight immunity. Only Chronosphere can reveal her.","Attacking or casting spells does not break the invisibility.","The effect is dispelled when getting within 600 range of an enemy hero (including clones, excluding illusions) or an enemy building (except for shrines). The effect is not dispelled instantly, but 0.75 seconds after getting within range. Getting out of range during that delay does not prevent it from dispelling. The delay does not serve as a grace period.","The effect is also dispelled when attacking Roshan, again, not instantly, but after the dispel delay.","The evasion and the active part are independent from each other. The evasion is always present.","On average, Blur increases Phantom Assassin's survivability against physical attacks by 25%\/43%\/67%\/100% ( 67%\/100%\/150%\/233%).","Blur uses pseudo-random distribution, and thus, the actual miss chance on every level is 20%\/29.9%\/37.7%\/45.7% ( 41.8%\/49.3%\/56.6%\/63.2%)."],"mana":"50","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"60\/55\/50\/45 ( 12)","name":"Blur","description":["Cast Animation: 0.4+0.57","Evasion: 20%\/30%\/40%\/50% ( 40%\/50%\/60%\/70%)","Vanish Dispel Radius: 600","Vanish Fade Time: 0","Vanish Dispel Delay: 0.75","Vanish Duration: 25"],"hot_key":"E","legacy_key":"R"},{"spell":"Phantom Assassin refines her combat abilities, gaining a chance of delivering a devastating critical strike to enemy units. Stifling Dagger shares the same critical strike chance.","effects":["Ability Passive","Affects Enemies"],"notes":["Increases attack damage by an average of 15%\/33.75%\/52.5% ( 20%\/45%\/70%).","The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority.","Coup de Grace uses pseudo-random distribution.","A part of the visual effects (a white glow on her weapon) plays during the start of an attack, revealing that the attack is going to crit."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Coup de Grace","description":["Proc Chance: 15% ( 20%)","Critical Damage: 200%\/325%\/450%"],"hot_key":"R","legacy_key":"C"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","The complete area is shaped like an isosceles trapezoid in front of Phantom Assassin.","Fully stacks with other sources of cleaves. Each source of cleave works completely independent.","Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.","Despite the visual effect, cleave damage is applied instantly in the whole area."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Cleave","description":["Starting Radius: 150","Distance: 650","End Radius: 360","Cleave Damage: 25%"]},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies"],"notes":["Successive attacks with Armor Corruption do not stack the debuff, but refresh the duration instead.","The attacks first apply the debuff, then their own damage.","Works against every enemy unit, including wards and buildings. Does not work against allies.","Fully stacks with Blight Stone and Desolator."],"mana":"0","elements":["Can be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Armor Corruption","description":["Armor Reduction: 4","Duration: 10"]}],"bio":"Through a process of divination, children are selected for upbringing by the Sisters of the Veil, an order that considers assassination a sacred part of the natural order. The Veiled Sisters identify targets through meditation and oracular utterances. They accept no contracts, and never seem to pursue targets for political or mercenary reasons. Their killings bear no relation to any recognizable agenda, and can seem to be completely random: A figure of great power is no more likely to be eliminated than a peasant or a well digger. Whatever pattern the killings may contain, it is known only to them. They treat their victims as sacrifices, and death at their hand is considered an honor. Raised with no identity except that of their order, any Phantom Assassin can take the place of any other; their number is not known. Perhaps there are many, perhaps there are few. Nothing is known of what lies under the Phantom Veil. Except that this one, from time to time, when none are near enough to hear, is known to stir her veils with the forbidden whisper of her own name: Mortred.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The health talent increases maximum health capacity, and keeps the current health percentage.","The lifesteal talent stacks additively with other sources of lifesteal."],"trivia":["Mortred's name is derived from Mordred, a character in the Arthurian legend who betrayed and fought King Arthur at the Battle of Camalann.","\"Coup de grâce\" is a French term (pronounced \"koo duh gras\" [the duh is short and should not be emphasised]) which literally means \"blow of mercy\", and refers to the killing blow of a wounded person or animal, friendly or not, to end their suffering. The phrase originates from medieval times, specifically Knights (see above - Knights of the Round Table). When a combatant was gravely injured (in battle, duels, jousting, etc...) but not killed; a coup de grâce was often, although not always, performed. Traditionally a rondel dagger was used as this could make a small puncture in breastplate and was long enough to reach the heart.","Mortred's level-up line \"I'm an immaterial girl!\" is probably a reference to the song Material Girl performed by Madonna.","In DotA: Allstars, Blur caused Mortred to become transparent to the enemy, scaling with levels and making her nearly invisible and untargetable to inexperienced players, thus her title \"Phantom Assassin\". This aspect of the ability is replicated to a limited degree with Blur's active component in Dota 2.","Mortred's idle animation is a typical fencing stance, with perpendicular feet, one arm extended forth and the other one folded and up in the air. However, her weapon is wielded not with the extended arm, but with the arm at rest. There are treatises, at least for the Italian school of fencing, which do show an extended arm but this is exclusively used when wielding a rapier or other single-handed thrusting swords.","Mortred is featured in the Dota 2 comic, The Contract."],"talents":["Triple Strike Stifling Dagger:+5% Coup de Grace","+20% Blur Evasion:-4 Armor Corruption","+25% Cleave:15% Lifesteal","+15 Damage:+150 Health"],"desc":"Mortred, the Phantom Assassin, is a melee agility hero fitting the role of hard carry. Mortred is best-known, and infamous for, her ability to inflict staggering damage with single strikes. Her abilities synergize supremely well with each other, rendering her an extremely formidable foe once she has acquired the items she requires. She is a very farm-dependent melee Hero, but she farms creeps with much more ease than many of her fellow carries, using her Stifling Dagger for last hitting. Besides eliminating the weakness most melee Heroes have in their farming, her second ability, Phantom Strike, acts as both her escape and initiate, while Blur gives her an edge against other Heroes that depend on their physical attacks by evading them; giving her partial damage immunity to many carries. Her ultimate, the strongest critical strike in the game, is what connects Mortred with four-digit damage and what gives her a place amongst the very best support killers in the late game, since they usually fall instantly from the divine strike her ultimate provides. Mobile and able to fight back nearly every enemy that dares to face her, Mortred is a formidable foe that should never be underestimated, and with appropriate item choices and a few kills, she can snowball out of control and become next to impossible to stop."}