{"abilities":[{"spell":"Бросает кинжал, который замедляет скорость передвижения цели, нанося при этом 1 + 65 урона от атак героя в качестве физического урона и применяя эффекты атаки от предметов и способностей.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Физический"],"notes":["Скорость полета кинжала равна 1200.","При попадании по цели кинжал заставляет Phantom Assassin нанести мгновенную атаку по ней. Помимо обычной атаки, на кинжал может сработать любой модификатор атаки и эффекты, срабатывающие при ударе, включая такие модификаторы, как Jinada и Tidebringer. Урон от Tidebringer будет учтен, но рассекающий удар от него не сработает. При этом у атаки от способности нет анимации атаки, поэтому способности, которые срабатывают от начала нанесения атаки (к примеру, Untouchable), не срабатывают. Эффект рассекающего удара считается от позиции цели, нанося урон по трапецевидной области в противополжном направлении от места, откуда был отправлен кинжал. Может показаться, что кинжал считается за дальнюю атаку, но она продолжает считаться ближней атакой, если исходит от Phantom Assassin. То есть, все способности, которые имеют разницу между дальним и ближним типом атаки, использую эффекты или значения для ближней атаки. Примененная мгновенная атака имеет эффект точности, поэтому она не может промахнутся. При избежании кинжала эффект от атаки не применяется. Мгновенная атака полностью игнорирует эффект обезоруживания на владельце.","Первым кинжал наносит общий урон Phantom Assassin с учетом процентов, затем добавляет сверху 1 единиц дополнительного урона. Урон можно выразить в формуле: 65 + 25%\/40%\/55%\/70% * (базовый урон от атаки + бонусы\/уменьшения урона от атаки) \"Бонусы\/уменьшения урона от атаки\" включают в себя все возможные шансы нанести дополнительный урон, включая временные (оглушающий удар) и постоянные (рассекающий удар). Урон в 1 единиц также считается бонусным уроном, но он добавляется уже после расчета основного урона от способности. Модификаторы атаки, которые основаны на уроне от атаки (критический удар, вампиризм, рассекающий удар) также учитывают 1 единиц бонусного урона. Урон, наносимый с учетом урона от атаки Phantom Assassin, добавляется в качестве баффа, который длится 0.03 секунды Поскольку урон от способности наносится как обычная атака, она не относится к урону от заклинаний, но относится к урону от атаки. То есть, на способность работает блокировка урона, но не работает усиление урона от способности и вампиризм заклинаний.","Снаряд имеет летающий обзор в радиусе 450 единиц. Обзор задерживается на 3.34 секунды в месте пребывания цели, если атака прошла успешно.","При выборе таланта на три цели для Stifling Dagger способность запускает снаряды в случайные видимые подходящие цели в радиусе применения. Радиус поиска основывается на дальности применения плюс доп. дальность, в итоге выбирая цели на расстоянии до 825\/1050\/1275\/1500 единиц. Не может отметить основную цель дополнительными кинжалами, поэтому, если поблизости нет других целей, ничего не произойдет. Вторичные цели выбираются случайно в области, для них нет приоритетов. Эффекты увеличения дальности действия не увеличивает дальность дополнительных кинжалов."],"mana":"30","elements":["Можно избежать.","Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"6","name":"Stifling Dagger","description":["Анимация применения: 0,3+0,47","Дальность применения: 525\/750\/975\/1200","Доп. расстояние для поиска вторичной цели: 300","Число целей: 1 ( 3)","Базовый урон: 65","Бонусный урон от атаки героя: 25%\/40%\/55%\/70%","Замедление передвижения: 50%","Длительность замедления: 1.75\/2.5\/3.25\/4"],"hot_key":"Q","legacy_key":"D"},{"spell":"Герой телепортируется к выбранному существу и получает дополнительную скорость атаки по нему, если это противник.","effects":["Способность Направленная на юнита","Действует на Себя"],"notes":["Phantom Strike можно применить на союзных юнитов, при этом не получая бонус к скорости атаки.","Перемещает Phantom Assassin рядом с целью, в направлении положения, в котором она была при использовании способности.","Phantom Assassin получает приказ атаковать цель, автоматически отменяя время применения.","Нельзя использовать на курьеров."],"mana":"35\/40\/45\/50","elements":["Нельзя применять в оцепенении.","Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"11\/9\/7\/5","name":"Phantom Strike","description":["Анимация применения: 0,25+0,8","Дальность применения: 1000","Доп. скорость атаки: 100\/125\/150\/175","Длительность: 2"],"hot_key":"W","legacy_key":"B"},{"spell":"Герой сосредотачивается на себе, что позволяет ему уклоняться от атак. Применение способности размоет очертания владельца, делая его невидимым, если рядом нет вражеских героев.","effects":["Способность Ненаправленная \/ Пассивная","Действует на Себя"],"notes":["Применяет к Phantom Assassin невидимость с иммунитетом к эффекту True Sight. Только Chronosphere может выявить героя.","Атаки или применение заклинаний не выводят из невидимости.","Эффект развеивается, если Phantom Assassin оказалась на расстоянии 600 от вражеского героя (включая клонов, но исключая иллюзии) или строения (за исключением святынь). Он не развеивается мгновенно, а спадает спустя 0.75 после обнаружения. Покидание области во время задержки не отменит развеивание эффекта.","Эффект также развеивается при атаке Рошана, но не мгновеннно, а после задержки.","Уклонение и активная часть способности не связаны друг с другом. Уклонение всегда будет активно.","В среднем, Blur увеличивает выживаемость против физических атак на 25%\/43%\/67%\/100% ( 82%\/122%\/186%\/300%).","Blur использует псевдослучайное распределение и, следовательно, фактический шанс уклонится от атаки на каждом уровне составляет 20%\/29.9%\/37.7%\/45.7% ( 41.8%\/49.3%\/56.6%\/63.2%)."],"mana":"50","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60\/55\/50\/45","name":"Blur","description":["Анимация применения: 0,4+0,57","Уклонение: 20%\/30%\/40%\/50% ( 45%\/55%\/65%\/75%)","Радиус невидимости: 600","Задержка перед появлением: 0.75","Длительность: 25"],"hot_key":"E","legacy_key":"R"},{"spell":"Герой оттачивает свои боевые способности, получая шанс нанести сокрушительный критический удар по врагу. Способность Stifling Dagger получает такой же шанс крита.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Увеличивает урон от атак в среднем на 15%\/33.75%\/52.5% ( 20%\/45%\/70%).","Шанс срабатывания сочетается с другими источниками критического урона. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","Coup de Grace использует псевдослучайное распределение.","Часть визуальных эффектов (белое свечение на её оружии) воспроизводится во время начала атаки, показывая, что она будет критической."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Coup de Grace","description":["Шанс срабатывания: 15% ( 20%)","Критический урон: 200%\/325%\/450%"],"hot_key":"R","legacy_key":"C"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Прорубающий урон нельзя увеличить усилением урона заклинаний и и на него не работает вампиризм заклинаний.","Прорубающий урон снижается блокировкой урона.","Полная площадь по форме напоминает равнобедренную трапецию, исходящую перед Phantom Assassin.","Полностью сочитается с другими источниками прорубающего урона. Каждый источник работает независимо от других.","Прорубающий удар не работает при атаке вардов, строений или союзных юнитов. На варды и строения прорубающий удар не работает.","Несмотря на визуальный эффект, прорубающий удар наносится сразу по всей площади."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Прорубающий удар","description":["Начальный радиус: 150","Расстояние: 650","Конечный радиус: 360","Прорубающий урон: 30%"]},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Несколько успешных атак с снижением брони не сочитаются, но обновляют время действия.","Броня цели снижается до того, как нанесется урон от атаки, но срабатывание снижения продолжает зависить от того, не промахнется ли атака.","Работает на каждого вражеского юнита, включая варды и строения. Не работает на союзников.","Полностью сочитается с Blight Stone и Desolator."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Снижение брони","description":["Снижение брони: 3","Длительность: 10"]}],"bio":"Предсказательными ритуалами избираются дети, которым предстоит быть принятыми в орден Сестер Вуали - скрытое сообщество, которое выделяет убийство как священную часть естественного цикла жизни. Сестры Вуали выделяют цели путем медитации, пророчески изрекая имена. Они не принимают контрактов, и, похоже, никогда не преследуют каких-либо политических или наемнических интересов. Их убийства не выделяют никакой видимой принадлежности к сообществу, и могут показаться не связанными между собой: человек с великой властью имеет такие же шансы на смерть, как и крестьянин или копатель колодцев. Какой бы последовательности не прослеживалось в убийствах, ее знают лишь они сами. Жертвы почитаются ими скорее как жертвоприношения, а смерть от их рук считается честью. Взращенная без личности, с моралью ордена на ее месте, любая фантомная убийца способна заменить другую, их число не ведано. Возможно, их много; возможно, их единицы. Ничто не известно о том, что лежит под Вуалью Фантома. Лишь эта, иногда, когда вокруг больше никого нет, поднимает свою вуаль, чтобы изречь запретный шепот своего имени: Мортред.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"trivia":["Имя Мортред является отсылкой к легендам и мифам о короле Артуре. Мордред был известен как подлый предатель Артура, который дрался с ним насмерть на поле Камланна, где был им в последствии убит. Сам Артур, к слову, был смертельно ранен.","Название способности \"Coup de grâce\" является французским термином, который буквально означает \"Удар милосердия\" и относится к смертельному удару по раненому человеку или животному, дружественному или нет, чтобы положить конец их страданиям.","При повышении уровня, Мортред произносит фразу Играть \"I'm an immaterial girl!\" которая, возможно, является отсылкой к песни Мадонны Material Girl.","В DotA, способность Blur делала Мортред прозрачной, что, с повышением уровня этой способности, делало её практически невидимой, отсюда и прозвище \"Phantom Assassin\".","У Мортред типичная анимация бездействия fencing- стойка с перпендикулярными ногами, одна рука вытянута вперёд,а другая согнута и приподнята вверх. Однако оружие она держит не в протянутой, а в согнутой руке.","Мортред была показана в комиксе The Contract."],"talents":["+25% к уклонению Blur:+5% к шансу крита у Coup de Grace","Stifling Dagger по трем целям:20% вампиризма","+30% к прорубанию:-3 к броне цели атак","+15 к урону:+150 к здоровью"],"tips":["Stifling Dagger имеет множество применений. В начале игры это умение позволяет добивать крипов, находящихся на большом расстоянии от героя, а позже позволяет замедлять противников с больших расстояний. Избегая нападений противника, держась от него на расстоянии, вы сохраните возможность добивать крипов и напрягать вражеских героев. Это заклинание тратит мало маны, поэтому его можно использовать достаточно часто. Также вам следует использовать это заклинание, чтобы сбивать эффекты восстановления Clarity и Healing Salve.","В зависимости от стратегии вашей команды, Phantom Strike может улучшаться на первом уровне, так как увеличенный урон в купе с оглушениями от союзников позволят вам пролить первую кровь врага.","Phantom Strike может быть направлен как на врагов, так и на союзников. Прыгнув на дружественного юнита, Phantom Assassin зачастую может избежать смерти."],"desc":"Phantom Assassin — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Первая способность, Stifling Dagger, бросает кинжал, наносит зависящий от урона героя физический урон и замедляет врага. Вторая способность, Phantom Strike, телепортирует к вражескому или союзному юниту и дает бонус к скорости атаки, если это противник. Третья способность, Blur, даёт Мортред возможность войти в состояние невидимости, из которого её может вывести только близкое нахождение вражеского героя или строения, а также даёт постоянный шанс уклонения от физической атаки. Пассивная ультимативная способность, Coup de Grace, дает шанс нанести критический удар по врагу. Способность Stifling Dagger получает такой же шанс крита."}