{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Echo_Sabre.mp3\/revision\/latest?cb=20161211134518",
      "effects": [
        "Доп. скорость атаки: 490",
        "Число атак: 1",
        "Замедление скорости передвижения: 100%",
        "Длительность замедления: 0,8"
      ],
      "notes": [
        "Данная способность работает только у героев ближнего боя.",
        "При срабатывании повышает скорость атаки на 490 до следующей атаки. То есть срабатывание не дает гарантированную скорость атаки, поэтому её можно уменьшить с помощью сильного замедления атаки. У полученной скорости атаки нет установленной длительности. Она действует до совершения второй атаки.",
        "То есть срабатывание не дает гарантированную скорость атаки, поэтому её можно уменьшить с помощью сильного замедления атаки.",
        "У полученной скорости атаки нет установленной длительности. Она действует до совершения второй атаки.",
        "Так как это просто увеличение скорости атаки, вторую атаку можно отменить, тем самым \"сохранив\" скорость атаки для следующего удара.",
        "Вторая атака не мгновенна. Она использует стандартную анимацию и перезарядку удара.",
        "Замедление скорости атаки и передвижения срабатывает во время обоих атак. То есть возможно замедлить сразу двух противников, просто переключившись с одной цели на другую после сработавшей атаки.",
        "То есть возможно замедлить сразу двух противников, просто переключившись с одной цели на другую после сработавшей атаки.",
        "Атаки сначала применяют дебафф, затем наносят урон.",
        "Echo Strike также срабатывает при мгновенных атаках, применяя замедление. При этом дополнительная скорость атаки будет потрачена.",
        "Дополнительная скорость атаки распространяется на клонов героев, но их атаки не применяют замедление.",
        "Замедление от нескольких источников не складывается, но длительность обновляется.",
        "Срабатывает при атаке чего угодно, включая постройки, варды и союзников, но замедление действует только на союзников."
      ],
      "mana": null,
      "abilityName": "Echo Strike",
      "cooldown": null,
      "description": "Позволяет героям ближнего боя совершить двойную атаку, которая на 0,8 сек. уменьшает скорость передвижения жертвы на 100%.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "260 здоровья и 1,3 восстановления здоровья.",
    "120 маны и 0,5 восстановления маны.",
    "13 \/ 10 основного урона от атаки \/ героям соответственно."
  ],
  "cost": "2500",
  "lore": null,
  "consistFrom": [
    "Ogre Axe",
    "Oblivion Staff"
  ],
  "name": "Echo Sabre",
  "description": "Обманчиво быстрый клинок, полный магии звука.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}