{"abilities":[{"spell":"Creates a damaging void that slows an enemy unit and deals damage. Void also mini-stuns, interrupting channeling abilities. The slowing effect lasts longer at night. Deals half damage during day.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Deals 45\/80\/127.5\/167.5 damage during the day.","The mini-stun is only applied during the night.","Also uses the night values during the night from Eclipse.","Void first applies the slow debuff, then the damage, then the stun debuff.","Has a cast backswing of 0.57 during Hunter in the Night."],"mana":"80\/90\/100\/110","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"11\/10\/9\/8","name":"Void","description":["Cast Animation: 0.3+0.33","Cast Range: 525 ( 675)","Damage: 90\/160\/255\/335","Move Speed Slow: 50%","Attack Speed Slow: 50","Day Slow Duration: 1.25","Night Slow Duration: 2.5\/3\/3.5\/4","Night Stun Duration: 0.1"],"hot_key":"Q","legacy_key":"V"},{"spell":"Night Stalker horrifies all nearby enemies, causing them to become silenced while near him. The effect lasts longer at night.","effects":["Ability No Target","Affects Enemies"],"notes":["The silence is provided by an aura, its debuff lingers for 0.5 seconds.","The aura's duration does not update when it turns day or night while the buff is on.","Also uses the night values during the night from Eclipse.","Has a cast backswing of 0.67 during Hunter in the Night."],"mana":"50","elements":["Does not pierce spell immunity."],"cooldown":"30\/25\/20\/15","name":"Crippling Fear","description":["Cast Animation: 0.2+0.43","Radius: 375","Day Duration: 3","Night Duration: 5\/6\/7\/8","Aura Linger Duration: 0.5"],"hot_key":"W","legacy_key":"F"},{"spell":"Night Stalker is in his element at night, attacking and moving with great swiftness.","effects":["Ability Passive","Affects Self"],"notes":["Also works during the night from Eclipse."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Hunter in the Night","description":["Move Speed Bonus: 20%\/25%\/30%\/35%","Attack Speed Bonus: 30\/50\/70\/90 ( 170\/190\/210\/230)"],"hot_key":"E","legacy_key":"G"},{"spell":"Night Stalker smothers the sun and summons instant darkness, so that he might use his powers at their fullest. Nightstalker gains flight and bonus damage during this time. Has 900 unobstructed vision.","effects":["Ability No Target","Affects Self"],"notes":["Dark Ascension has a lower priority than the daytime caused by Supernova. During it, Night Stalker still flies, has the damage bonus and unobstructed vision, but the vision is limited to his default daytime vision.","Has a cast backswing of 0.5 seconds when cast during the night.","The unobstructed vision from the Aghanim's Scepter upgrade is not bound to any of Night Stalker's spells. It is also not bound to Dark Ascension nights, and is active during any night. Grants Night Stalker unobstructed vision based on his default night vision, overriding the 900 from Dark Ascension."],"mana":"125\/175\/225","elements":["Cannot be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"140\/130\/120 ( 100\/90\/80)","name":"Dark Ascension","description":["Cast Animation: 0.3+0","Unobstructed Vision Radius: 900","Attack Damage Bonus: 50\/100\/150","Duration: 30"],"hot_key":"R","legacy_key":"R"}],"bio":"Of the Night Stalker, there is no history, only stories. There are ancient tales woven into the lore of every race and every culture, of an impossible time before sunlight and daytime, when night reigned alone and the world was covered with the creatures of darkness--creatures like Balanar the Night Stalker. It is said that on the dawn of the First Day, all the night creatures perished. All, that is, save one. Evil's embodiment, Night Stalker delights in his malevolence. He created the primal role of the Night Terror, the Boogeyman, and as long as there have been younglings, his is the specter summoned to terrify them. This is a role he relishes; nor are these empty theatrics. He does indeed stalk the unwary, the defenseless, those who have strayed beyond the lighted paths or denied the warnings of their communities. Night Stalker serves as living proof that every child's worst nightmare....is true.","talentsTips":["The mana talent increases maximum mana capacity, and keeps the current mana percentage.","The health talent increases maximum health capacity, and keeps the current health percentage.","The strength talent effectively grants Night Stalker 337.5 health, 1.88 health regen, 1.5% magic resistance and 15 attack damage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Many of Night Stalker's responses that refer to his vampiric qualities make reference to Bram Stoker's Dracula, a film adaptation of the classic novel starring Gary Oldman.","Night stalker's line \"If I ever get my claws on that bird.\" is likely a reference to the rooster that crows when the game transitions from nighttime to daytime. Additionally it is a reference to a line used by \"Looney Tunes\" character Sylvester the cat when describing \"Tweety Bird.\"","Night Stalker's deep and raspy voice is a possible reference to Batman.","In an earlier version DotA, there existed a hero similar to Night Stalker called Void Demon. His first ability \"Time Void\" had similar effects to the present Void ability, except it also stunned the target for 5 seconds. Void Demon also had an ability similar to Omniknight's Degen Aura, though it had a larger radius of 600 units. His third ability was a pushing spell called \"Quake\" which was useful for destroying towers. Finally, his ultimate was called \"Mass Haste\". This aura gave Void Demon and nearby allies benefits similar to Night Stalker's Hunter in the Night, except that it had no conditions and enabled Void Demon and his team to hunt Heroes relentlessly both day and night. Ultimately, Void Demon was replaced with Night Stalker as his skill set was deemed too powerful.","Night Stalker's response \"In the forest of the night\" is a reference to the poem The Tyger by William Blake.","You can hear the line \"Sinless Demon\" when you activate Night Stalker's Lua error in Module:Ability_ID at line 44: Could not find Cargo data for \"Darkness\".."],"talents":["-40s Dark Ascension Cooldown:+140 Hunter in the Night Attack Speed","+50 Damage:+40 Movement Speed","+150 Cast Range:+15 Strength","+200 Mana:+200 Health"],"desc":"Balanar, the Night Stalker, is a melee strength hero, renowned for being a very potent ganker once night falls."}