{"abilities":[{"spell":"Окружает врага губительной пустотой, которая замедляет цель и наносит ей урон. Ночью замедление длится дольше. Также ненадолго оглушает жертву, останавливая прерываемые способности. Днем наносит половину от урона.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Днем наносит 45\/80\/127.5\/167.5 единиц урона.","Мини-оглушение применяется только ночью.","Также использует увеличенные значения во время ночи от Eclipse.","Void сначала применяет замедление, затем наносит урон, потом - оглушает.","Во время действия Hunter in the Night время после применения равно 0,57."],"mana":"80\/90\/100\/110","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"11\/10\/9\/8","name":"Void","description":["Анимация применения: 0,3+0,33","Дальность применения: 525","Урон: 90\/160\/255\/335","Замедление передвижения: 50%","Замедление скорости атаки: 50","Продолжительность замедления днём: 1.25","Продолжительность замедления ночью: 2.5\/3\/3.5\/4","Длительность оглушения ночью: 0.1"],"hot_key":"Q","legacy_key":"V"},{"spell":"Герой вселяет ужас во врагов рядом с собой, отчего на них действует безмолвие. Ночью эффект длится дольше.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Безмолвие предоставлено аурой, чей дебафф задерживается на 0.5 секунды.","Длительность активированной ауры не обновляется при смене времени суток.","Также использует увеличенное значение во время ночи от Eclipse.","Во время действия Hunter in the Night время после применения равно 0,67."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"30\/25\/20\/15","name":"Crippling Fear","description":["Анимация применения: 0,2+0,43","Радиус: 375","Продолжительность днем: 3","Продолжительность ночью: 5\/6\/7\/8","Длительность задержки ауры: 0.5"],"hot_key":"W","legacy_key":"F"},{"spell":"Ночью герой оказывается в своей стихии: он атакует и передвигается увеличенной скоростью.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Также действует во время ночи от Eclipse."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Hunter in the Night","description":["Доп. скорость передвижения: 22%\/28%\/34%\/40%","Доп. скорость атаки: 30\/50\/70\/90 ( 170\/190\/210\/230)"],"hot_key":"E","legacy_key":"G"},{"spell":"Подавляет солнечный свет, создавая непроглядную тьму и раскрывая силы героя в полной мере. Он получает беспрепятственный обзор, свободное передвижение и дополнительный урон.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["У ночи от Dark Ascension ниже приоритет, чем у дня, вызванного Supernova. Во время действия способности Night Stalker всё также летает, обладает дополнительным уроном и беспрепятственным обзором, но обзор ограничивается его базовым дневным значением. При использовании ночью время после применения равно 0,5."],"mana":"125\/175\/225","elements":["Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"140\/130\/120 ( 100\/90\/80)","name":"Dark Ascension","description":["Анимация применения: 0,3+0","Доп. урон: 50\/100\/150","Длительность: 30"],"hot_key":"R","legacy_key":"R"}],"bio":"О том, откуда появился Баланар, никто не знает доподлинно; ходят лишь слухи. Древние сказания каждой расы и культуры повествуют о невообразимом времени, когда не было ещё дня и солнца, когда миром правила одна только ночь — и населяли её создания тьмы, подобные Баланару. Говорят, что на рассвете Первого дня все ночные твари сгинули. Все, кроме одной. Баланар — воплощение зла, и он упивается своей жестокостью. Именно он стал прообразом разнообразных бабаек и кощеев, и с незапамятных времён именно его тенью пугали непослушных детей. Баланар наслаждается такой ролью и играет её в самой полной мере. Под покровом ночи он ищет опрометчивых и беспомощных — тех, кто отбился от света и позабыл древние истории. Баланар — живое доказательство того, что самый кошмарный сон ребёнка... это совсем не сон.","talentsTips":["Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма.","Талант на силу в общем даёт Night Stalker: 300","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Many of Night Stalker's responses that refer to his vampiric qualities make reference to Bram Stoker's Dracula, a film adaptation of the classic novel starring Gary Oldman.","Night stalker's line \"If I ever get my claws on that bird,\" is likely a reference to the rooster, a bird which heralded the coming of dawn with its cry. The rooster was sacred to the sun-god Helios.","In an earlier version DotA, there existed a hero similar to Night Stalker called Void Demon. His first ability \"Time Void\" had similar effects to the present Void ability, except it also stunned the target for 5 seconds. Void Demon also had a ability similar to Omniknight's Degen Aura, though it had a larger radius of 600 units. His third ability was a pushing spell called \"Quake\" which was useful for destroying towers. Finally, his ultimate was called \"Mass Haste\". This aura gave Void Demon and nearby allies benefits similar to Night Stalker's Hunter in the Night, except that it had no conditions and enabled Void Demon and his team to hunt Heroes relentlessly both day and night. Ultimately, Void Demon was replaced with Night Stalker as his skill set was deemed too powerful."],"talents":["-40 сек. перезарядки Dark Ascension:+140 к скорости атаки от Hunter in the Night","+50 к урону:+40 к скорости передвижения","15% вампиризма:+15 к силе","+200 к мане:+200 к здоровью"],"desc":"%"}