{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Arc_Warden_Flux.mp3\/revision\/latest?cb=20191216010757",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "If the target has allies or neutral creeps within the 225 search radius, the ability temporarily stops damaging the target, until it is alone again.",
        "Checks for enemies and neutrals in 0.5-second intervals, beginning instantly upon cast. The damage updates based on the result of the checks.",
        "Also deals damage in the same intervals, based on the checks, dealing 7.5\/15\/22.5\/30 (TagTalent 27.5\/35\/42.5\/50) damage, resulting in 13 (TagTalent 17) possible instances.",
        "While Flux' damage component is disabled, the particle effects on the target vanish, with only a red glow remaining on the unit, indicating the debuff is still there.",
        "Nearby buildings, wards and hidden units are ignored and do not mute the effects. However, invulnerable units are not ignored.",
        "Multiple casts on the same target fully stack, with all instances working independently from each other.",
        "Can deal up to 97.5\/195\/292.5\/390 damage to the target if all instances are applied (before reductions). TALENT NOTES The damage per second increasing talent does not upgrade already existing instances of Flux. With the damage per second increasing talent, it can deal up to 357.5\/455\/552.5\/650 damage if all instances are applied. With the duration increasing talent, it can deal up to 127.5\/255\/382.5\/510 damage if all instances are applied. With both talents, it can deal up to 467.5\/595\/722.5\/850 damage if all instances are applied.",
        "TALENT NOTES The damage per second increasing talent does not upgrade already existing instances of Flux.",
        "With the damage per second increasing talent, it can deal up to 357.5\/455\/552.5\/650 damage if all instances are applied.",
        "With the duration increasing talent, it can deal up to 127.5\/255\/382.5\/510 damage if all instances are applied.",
        "With both talents, it can deal up to 467.5\/595\/722.5\/850 damage if all instances are applied."
      ],
      "mana": "16",
      "item_behaviour": [],
      "name": "Flux",
      "cooldown": "75",
      "description": "Infuses a lone enemy unit with swirling, volatile energy, slowing its movement speed and dealing damage over time. The damage is not applied if another enemy unit is near the target.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.77",
        "Cast Range:  500\/600\/700\/800 ( 675\/775\/875\/975)",
        "Search Radius: 225",
        "Damage per Second: 15\/30\/45\/60 ( 55\/70\/85\/100)",
        "Move Speed Slow: 14%\/21%\/28%\/35%",
        "Duration: 6 ( 8)"
      ],
      "legacy_key": "C",
      "story": "An infinitesimal fraction of the power which imprisoned the Ancients."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2c\/Arc_Warden_Magnetic_Field.mp3\/revision\/latest?cb=20191216010749",
      "effects": [
        "Ability: Target Area",
        "Affects: Allies "
      ],
      "notes": [
        "Applies an attack speed bonus and evasion to allies within the radius.",
        "All effects, except the knockback, are provided by an aura. Its buff lingers for 0.1 seconds.",
        "Does not evade attacks landing on allies when the source of the attack is within the field.",
        "The evasion effect of fields from Arc Warden and its Tempest Double works independently. This means when an ally is within the intersection of two fields, attacks are evaded unless their source is also within the intersection.",
        "This means when an ally is within the intersection of two fields, attacks are evaded unless their source is also within the intersection.",
        "Affects heroes, illusions, clones, creep-heroes and buildings. All other units are completely unaffected.",
        "Does not affect invulnerable units, so buildings are only affected when attackable.",
        "The attack speed bonus of multiple Magnetic Fields does not stack.",
        "Despite its visual effects, the effective area is a cylinder, not a sphere.",
        "SHARD NOTES Magnetic Field pushes every enemy within its 300 radius out of it upon cast. The knockback is not a set distance. It pushes every enemy so that they are 350 range away from the center of the targeted area. So the minimum and maximum knockback distance are 50 — 350 respectively. The knockback duration is always 0.3, so the speed varies between 1166.67 — 166.67, depending on the knockback distance. Enemies are not disabled during the knockback, and are able to act freely, except moving during it. Can push units over impassable terrain. Any trees the knocked back unit collides with gets destroyed.",
        "The knockback is not a set distance. It pushes every enemy so that they are 350 range away from the center of the targeted area. So the minimum and maximum knockback distance are 50 — 350 respectively.",
        "The knockback duration is always 0.3, so the speed varies between 1166.67 — 166.67, depending on the knockback distance.",
        "Enemies are not disabled during the knockback, and are able to act freely, except moving during it.",
        "Can push units over impassable terrain. Any trees the knocked back unit collides with gets destroyed.",
        "SHARD NOTES All already placed Magnetic Fields now immediately apply 40% magic resistance and 30% movement speed slow. Increases both heroes' and buildings' magic resistance within its 300 effect radius. The movement speed slow of multiple fields stack additively with each and with other sources of movement speed slow. Can reduce affected enemies' movement speed by 60% by stacking two instances. Stack multiplicatively with other sources of magic resistance. Increases heroes' total magic resistance to 55% (or 73% by stacking two instances). Increases buildings' total magic resistance to 40% (or 64% by stacking two instances).",
        "Increases both heroes' and buildings' magic resistance within its 300 effect radius.",
        "The movement speed slow of multiple fields stack additively with each and with other sources of movement speed slow.",
        "Can reduce affected enemies' movement speed by 60% by stacking two instances.",
        "Stack multiplicatively with other sources of magic resistance. Increases heroes' total magic resistance to 55% (or 73% by stacking two instances). Increases buildings' total magic resistance to 40% (or 64% by stacking two instances).",
        "Increases heroes' total magic resistance to 55% (or 73% by stacking two instances).",
        "Increases buildings' total magic resistance to 40% (or 64% by stacking two instances).",
        "TALENT NOTES The attack speed increasing talent immediately upgrades all currently active Magnetic Fields, but not already placed buffs."
      ],
      "mana": "20",
      "item_behaviour": [],
      "name": "Magnetic Field",
      "cooldown": "50\/70\/90\/110",
      "description": "Generates a circular distortion field of magnetic energy that protects allied heroes and buildings within it by evading attacks coming from outside the field.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  900",
        "Effect Radius: 300",
        "Evasion: 100%",
        "Attack Speed Bonus: 50\/60\/70\/80 ( 90\/100\/110\/120)",
        "Aura Linger Duration: 0.1",
        "Duration: 3.5\/4.5\/5.5\/6.5",
        "Magic Resistance Bonus: 40%",
        "Enemy Move Speed Slow: 30%",
        "Enemy Max Knockback Distance: 350",
        "Enemy Knockback Duration: 0.3"
      ],
      "legacy_key": "F",
      "story": "Time and space are of little consequence to one as old as Zet."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/96\/Arc_Warden_Spark_Wraith_1.mp3\/revision\/latest?cb=20191216010752",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The Spark Wraith travels at a speed of 400.",
        "Once the activation delay is over, it checks for enemies, including neutral creeps, in 0.2-second intervals and launches towards the first registered enemy.",
        "If multiple enemies are within range after the delay, the closest enemy is targeted.",
        "Deals damage based on the level upon cast of the ability. Leveling up Spark Wraith does not update the damage of already placed or launched Spark Wraiths.",
        "The wraith first applies the damage, then the debuff.",
        "The Spark Wraith is fully visible to the enemy.",
        "Fully affects invisible units. Can target units inside the Fog of War, but not invulnerable or hidden units.",
        "The activation delay is not included in the wraith's duration.",
        "Provides 300 radius ground vision for its full duration. The vision does not linger.",
        "The launched projectile also provides the same vision values, which lingers for 3.34 seconds after reaching the target.",
        "SCEPTER NOTES Spark Wraiths create a secondary wraith immediately upon hitting the enemy. These secondary wraiths have to go through a 2-second activation delay. This effect only occurs once per Spark Wraith. Secondary Spark Wraiths cannot spawn new wraiths.",
        "These secondary wraiths have to go through a 2-second activation delay.",
        "This effect only occurs once per Spark Wraith. Secondary Spark Wraiths cannot spawn new wraiths.",
        "TALENT NOTES The damage increasing talent immediately upgrades all placed and launched Spark Wraiths."
      ],
      "mana": "4",
      "item_behaviour": [],
      "name": "Spark Wraith",
      "cooldown": "80",
      "description": "Summons a Spark Wraith that slowly materializes and patrols a targeted area until an enemy comes within its range. Once a target has been found the wraith fuses with them, dealing magical damage and slowing the unit.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0.77",
        "Cast Range:  2000",
        "Search Radius: 375",
        "Activation Delay: 2",
        "Move Speed Slow: 100%",
        "Damage: 100\/180\/260\/340 ( 225\/305\/385\/465)",
        "Slow Duration: 0.4\/0.5\/0.6\/0.7",
        "Wraith Duration: 45",
        "Second Activation Delay: 2",
        "Secondary Wraith Duration: 15"
      ],
      "legacy_key": "R",
      "story": "Lesser fragments of Zet's original self."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2b\/Arc_Warden_Tempest_Double.mp3\/revision\/latest?cb=20191216010755",
      "effects": [
        "Ability: No Target",
        "Affects: The Self"
      ],
      "notes": [
        "The Tempest Double is a clone that always spawns with Arc Warden's current mana and health.",
        "On the first cast of Tempest Double, the double is actually summoned. On every following cast, it is just healed or revived. The double gets dispeled as if it died, removing all modifiers which are removed by death. This means most modifiers that persist through death are not removed. Its cooldowns are not refreshed upon getting re-summoned, so all cooldowns from the previous cast carry over. Resummoning the Tempest Double does not disjoint projectiles.",
        "The double gets dispeled as if it died, removing all modifiers which are removed by death. This means most modifiers that persist through death are not removed.",
        "Its cooldowns are not refreshed upon getting re-summoned, so all cooldowns from the previous cast carry over.",
        "Resummoning the Tempest Double does not disjoint projectiles.",
        "If the distance between Arc Warden and the Tempest Double gets greater than 2000, its total attack damage gets reduced by 50%. The penalty is also applied when Arc Warden is dead unless it has Reincarnation sources. Does not reduce conditional attack damage bonuses (e.g. Monkey King Bar or Silver Edge). A debuff appears on the Tempest Double whenever this penalty is active. The debuff is visible to allies only.",
        "The penalty is also applied when Arc Warden is dead unless it has Reincarnation sources.",
        "Does not reduce conditional attack damage bonuses (e.g. Monkey King Bar or Silver Edge).",
        "A debuff appears on the Tempest Double whenever this penalty is active. The debuff is visible to allies only.",
        "Arc Warden and the Tempest Double are represented by an icon with health and mana bars for each on the top left corner of the screen. When a Zet is selected, its icon becomes brighter. When a Zet takes damage, its icon blinks red.",
        "When a Zet is selected, its icon becomes brighter. When a Zet takes damage, its icon blinks red.",
        "The Tempest Double is visually distinguishable from the original Zet for everyone. On the minimap, allies see the unique minimap icon, while enemies see Arc Warden's default icon.",
        "On the minimap, allies see the unique minimap icon, while enemies see Arc Warden's default icon.",
        "The buffs of a consumed Moon Shard, Aghanim's Blessing and Aghanim's Shard are copied as well. However, other permanent modifiers (e.g. Duel, Intelligence Steal) are not. Any permanent modifiers gained by the Tempest Double while alive are lost once it gets resummoned. Abilities that grant effects for killing heroes (e.g. Flesh Heap, Track, etc.) do not do so when the Tempest Double is killed.",
        "However, other permanent modifiers (e.g. Duel, Intelligence Steal) are not.",
        "Any permanent modifiers gained by the Tempest Double while alive are lost once it gets resummoned.",
        "Abilities that grant effects for killing heroes (e.g. Flesh Heap, Track, etc.) do not do so when the Tempest Double is killed.",
        "The double is a clone and therefore treated exactly like a hero by all abilities since it is not an illusion.",
        "The double has a 180\/240\/300 and a 180\/240\/300XP bounty. The gold is granted to the killing player, and the experience is distributed like any other experience. However, if the double is killed by creeps or buildings, the gold gets distributed as well, just like hero kills do when not killed by players.",
        "However, if the double is killed by creeps or buildings, the gold gets distributed as well, just like hero kills do when not killed by players.",
        "The Tempest Double does not passively gain any experience like heroes usually do, so it does not leech experience from its allies. Any experience the Double would have gained (e.g. via Transmute) is transferred to Arc Warden, even if the Tempest Double was dead at the time.",
        "Any experience the Double would have gained (e.g. via Transmute) is transferred to Arc Warden, even if the Tempest Double was dead at the time.",
        "TALENT NOTES The cooldown reduction talent grants the Tempest Double cooldown reduction on its abilities and items. Stacks multiplicatively with other sources of percentage-based cooldown reductions.",
        "Stacks multiplicatively with other sources of percentage-based cooldown reductions.",
        "SPELL STEAL Creates a Double based on Rubick's model, that has all Rubick's basic abilities, with Spell Steal inactive, and without the other acquired abilities. Losing Tempest Double and reacquiring the ability allows Rubick to summon another Double from the previous steal."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Tempest Double",
      "cooldown": null,
      "description": "Briefly refocusing its fractured elements into a single form, the Arc Warden is able to create a perfect electrical duplication of itself. The duplicate can use all of Arc Warden's current items and spells, except most consumables and items that drop on death. The duplicate has separate item and ability cooldowns. The Tempest Double gives bounty gold to enemies when killed. The Tempest Double loses its sense of self if he is too far away from Arc Warden and deals less attack damage.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.15+0.5",
        "Number of Doubles: 1",
        "Duration: 18\/22\/26 ( 30\/34\/38)",
        "Bounty: 180\/240\/300",
        "Penalty Distance: 2000",
        "Attack Damage Penalty: 50%",
        "<span image=\"images\\Talent\"><\/span> Cooldown Reduction: 40%"
      ],
      "legacy_key": "D",
      "story": "Warped by the power of its peers, Arc Warden becomes what it despises most: disharmony."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 2.6,
    "attrAgilityInc": 3.0,
    "attrAgility": 20.0
  },
  "description": "Creates a copy of himself to split push. A splintered fragment of the same primordial power as the Ancients themselves, Zet endeavors to end the disharmony among the warring factions through whatever means necessary. Solitary foes are thrown into a volatile state of Flux, ripping away their health over time. Distorting space to generate a Protective Field sheltering around allies, evading and attacking with greater efficiency. Zet summons Spark Fragments of its former self that circles in place, and seek out nearby foes. Is there one Arc Warden, or two? Armed with the original's items and abilities, the Self's Tempest Double duplicates each spell and every attack, bringing twice the chaos to any fight.  Carry Escape Nuker ★★★",
  "trivia": [
    "The line Link▶️ \"You will just have to accept this, and move on.\" is a reference to a Dota 2 based web cartoon The Dota 2 Reporter, where it is a recurring gag for the characters to question the game's logic, only to be answered by this line.",
    "The lines Link▶️ \"Doggedly.\" and Link▶️ \"Hounding.\" are references to Arc Warden's former appearance in DotA, where its model was that of a Gnoll, a canine-like creature from Warcraft. Its rivalry lines towards Lycan, Link▶️ \"Inferior form.\" and Link▶️ \"Apex predator, you are not. \", are also a nudge to this.",
    "A lot of Arc Warden's lore and responses reference the work of the psychiatrist Carl Gustav Jung. Arc Warden's focal point of unification is based on the psychological concept of individuation. Put in simple terms, in Jungian Psychology, the concept of individuation is when the conscious ego combines with the unconscious shadow, creating \"the Self\". Arc Warden exclusively refers to itself as \"The Self\". Tempest Double's concept also references this, with Arc Warden representing the conscious ego, and the Tempest Double representing the unconscious shadow. As stated in the ability's lore, Arc Warden despises this ability, since it brings disharmony; Arc Warden can only be The Self if not split apart. Some of Jung's work is also reflected in Arc Warden's abilities, like how Flux is only harmful when the target is alone, i.e. not united with their allies, or how Magnetic Field only works against enemies outside its area of effect. Spark Wraith's ability description also states that it affects its target by \"fusing\" with them. The line Link▶️ \"From the Primordial Consciousness all came. Return to it, all must.\" refers to the pyschological concept of the Collective Unconscious, which refers to the unconscious mind and shared mental concepts. This term was also coined by Carl Gustav Jung.",
    "Arc Warden's focal point of unification is based on the psychological concept of individuation. Put in simple terms, in Jungian Psychology, the concept of individuation is when the conscious ego combines with the unconscious shadow, creating \"the Self\". Arc Warden exclusively refers to itself as \"The Self\". Tempest Double's concept also references this, with Arc Warden representing the conscious ego, and the Tempest Double representing the unconscious shadow. As stated in the ability's lore, Arc Warden despises this ability, since it brings disharmony; Arc Warden can only be The Self if not split apart.",
    "Some of Jung's work is also reflected in Arc Warden's abilities, like how Flux is only harmful when the target is alone, i.e. not united with their allies, or how Magnetic Field only works against enemies outside its area of effect. Spark Wraith's ability description also states that it affects its target by \"fusing\" with them.",
    "The line Link▶️ \"From the Primordial Consciousness all came. Return to it, all must.\" refers to the pyschological concept of the Collective Unconscious, which refers to the unconscious mind and shared mental concepts. This term was also coined by Carl Gustav Jung."
  ],
  "history": "Before the beginning of all, there existed a presence: a primordial mind, infinite, awesome, and set to inscrutable purpose. As the universe thundered into being, this mind was fragmented and scattered. Two among its greater fragments—who would come to be named Radiant and Dire--found themselves locked in vicious opposition, and began twisting all of creation to serve their conflict. As war and cataclysm threatened the nascent cosmos, the will of a third fragment made itself known. Naming itself Zet, this intellect sought to resolve the disharmony and return all to perfect unity. Appalled by its kin's conflicting nature, Zet gathered the sum of its power. In a sudden flash, it overwhelmed its siblings, and fused the warring aspects into a stellar sphere before hurling them into the darkness to orbit a nondescript world. Harmony was restored, though only the barest fraction of Zet's strength remained. Setting its gaze on the prison, Zet chose to use its weakened power to serve as watchful warden until time's end. For uncounted aeons, this vigil stood. Life flourished upon the world below, oblivious to the dangers imprisoned within the softly glowing moon, or of Zet's struggles to contain them. As the captives' eternal clash reverberated within, the surface of the prison shuddered, over time beginning to crack. Ultimately, Zet's depleted power proved insufficient to contain the breach, and at last the moon was shattered. The prison's ancient inhabitants had escaped to sow their conflict anew. Flung to the farthest reaches by the prison's explosion, Zet was transformed by the dissonant energies of its former captives. No longer of single form and thought, its presence had become split among many—some lesser, some greater—each connected by a fleeting arc of consciousness. Struggling to suppress its own disunity, Zet sped toward the burgeoning conflict of its siblings, bending its fractured wills toward a singular conclusion: the aspects of the primordial mind must be made to reunite, or all must be destroyed lest the conflict spread further…",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+40% Tempest Double Cooldown Reduction",
        "talent_left": "+12s Tempest Double Duration"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+125 Spark Wraith Damage",
        "talent_left": "+40 Flux Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+2s Flux Duration",
        "talent_left": "+40 Magnetic Field Attack Speed"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+175 Flux Cast Range",
        "talent_left": "+200 Health"
      }
    ],
    "notes": [
      "Talents are fully copied by the Tempest Double.",
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}