{
  "abilities": [
    {
      "effects": [
        "Макс. дистанция срабатывания: 900",
        "Доп. скорость передвижения (ближний бой): 20%",
        "Доп. скорость передвижения (дальний бой): 10%",
        "Скорость поворота: 1",
        "Длительность задержки: 0,5"
      ],
      "notes": [
        "Активируется каждый раз, как владелец отдает приказ на атаку вражеского юнита в пределах дистации срабатывания. Герою не нужно быть в пределах дистации в момент получения приказа. Вхождение в область после отданного приказа также активирует предмет. Не срабатывает, если герой атакует цель через автоатаку или выбор точки на земле. После срабатывания бафф активен до получения нового приказа вне зависимости от расстояния до цели.",
        "При отмене бафф задерживается на секунды.",
        "Также бафф активируется с каждым началом атаки независимо от цели. То есть он ненедолго активируется с каждой атакой при добивании союзников.",
        "Не активируется при выборе врага целью заклинания.",
        "Позволяет владельцу проходить сквозь других юнитов, включая варды, но не сквозь строения.",
        "Периодически проверяет тип дальности атаки владельца и мгновенно обновляет значение скорости атаки, если он изменился."
      ],
      "elements": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "name": "Phase",
      "description": "When targeting an enemy unit up to 900 range away, you gain 20% increased movement speed on melee heroes, and 10% on ranged heroes, and lets you move through units and turn more quickly."
    }
  ],
  "cost": "1550",
  "description": "Ботинки, которые позволяют владельцу путешествовать между мирами.",
  "further": [
    "Boots_of_Speed",
    "Chainmail",
    "Gloves_of_Haste"
  ],
  "attrs": [
    "Активируемая Phase",
    "Бонус +5 к броне +25 к скорости атаки +15% к скорости передвижения",
    "Можно разобрать? Нет",
    "Можно сообщать? Нет"
  ],
  "info": [
    "Бонус к скорости передвижения от нескольких пар ботинок не суммируется.",
    "Складывается с другими бонусами скорости передвижения."
  ]
}