{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/da\/Spirit_Vessel_ally.mp3\/revision\/latest?cb=20171111025644",
      "effects": [
        "Дальность применения: 950",
        "Радиус получения заряда: 1400",
        "Лечение союзника в секунду: 40",
        "Урон противнику в секунду: 35",
        "Снижение здоровья противника в секунду: 4%",
        "Уменьшение восстановления здоровья противника: 45%",
        "Длительность: 8"
      ],
      "notes": [
        "Двойное нажатие на предмет использует его на себя.",
        "Успешное использование на ту же цель не складывается, но обновляет длительность. Бафф и дебафф не зависят друг от друга и сочетаются между собой, хоть лечение и отменяется первым тиком урона. Лечение от Spirit Vessel не складывается с лечением от Urn of Shadows. Spirit Vessel накладывается вместо баффа\/дебаффа от Urn of Shadows, но Urn of Shadows не может перекрыть модификаторы Spirit Vessel. При попытке применения Urn of Shadows уйдет на перезарядку, но не потратит заряды.",
        "Бафф и дебафф не зависят друг от друга и сочетаются между собой, хоть лечение и отменяется первым тиком урона.",
        "Лечение от Spirit Vessel не складывается с лечением от Urn of Shadows.",
        "Spirit Vessel накладывается вместо баффа\/дебаффа от Urn of Shadows, но Urn of Shadows не может перекрыть модификаторы Spirit Vessel.",
        "При попытке применения Urn of Shadows уйдет на перезарядку, но не потратит заряды.",
        "Восстанавливает здоровье в виде регенерации, излечивая 4 здоровья с интервалом в 0,1 секунды или 40 здоровья в секунду. Прирост текущего здоровья происходит с интервалом в 1 секунду. Он не считается за лечение и игнорируется всем, кроме Ice Blast. Может вылечить до 320 от текущего здоровья союзной цели (не принимая во внимание усиления или уменьшения).",
        "Прирост текущего здоровья происходит с интервалом в 1 секунду. Он не считается за лечение и игнорируется всем, кроме Ice Blast.",
        "Может вылечить до 320 от текущего здоровья союзной цели (не принимая во внимание усиления или уменьшения).",
        "Наносит 45% + 8 от текущего здоровья в виде урона с интервалом в 1 секунду спустя 1 секунду после применениия, срабатывая раз. Сначала расчитывается фиксированный урон (после всех сопротивлений), затем урон, основанный на текущем здоровье. Может нанести до 280 + 27.86% от текущего здоровья вражеской цели (до учета сопротивления).",
        "Сначала расчитывается фиксированный урон (после всех сопротивлений), затем урон, основанный на текущем здоровье.",
        "Может нанести до 280 + 27.86% от текущего здоровья вражеской цели (до учета сопротивления).",
        "Усиление и уменьшение лечения также применяются к регенерации здоровья.",
        "Урон, превышающий 0 от любого игрока (включая союзников и себя) или Рошана, развеивает лечащий эффект. Не развеивается от урона, отмеченный как отнимающий здоровье.",
        "Не развеивается от урона, отмеченный как отнимающий здоровье.",
        "Можно использовать только на героев (включая иллюзии и клонов) и крипов-героев.",
        "Делит время перезарядки с Urn of Shadows.",
        "С несколькими Spirit Vessel в инвентаре, заряд получит наивысший по приоритету ячеек предмет. Приоритет ячеек: верхняя левая, верхняя средняя, верхняя правая, нижняя левая, нижняя средняя, нижняя правая. То же правило действует на наличие Spirit Vessel и Urn of Shadows в одном инвентаре - заряды получает предмет, занимающий наивысший приоритет ячеек. Предмет не может получать заряды в ранце. Предмет должен находится в одной из шести ячеек инвентаря. Если у предмета нет зарядов, то от следующей смерти вражеского героя он наполнится 2 зарядами вместо 1. Если в команде несколько Spirit Vessel, то заряд получит предмет того героя, кто был ближе всего к умершему врагу.",
        "Приоритет ячеек: верхняя левая, верхняя средняя, верхняя правая, нижняя левая, нижняя средняя, нижняя правая.",
        "То же правило действует на наличие Spirit Vessel и Urn of Shadows в одном инвентаре - заряды получает предмет, занимающий наивысший приоритет ячеек.",
        "Предмет не может получать заряды в ранце. Предмет должен находится в одной из шести ячеек инвентаря.",
        "Если у предмета нет зарядов, то от следующей смерти вражеского героя он наполнится 2 зарядами вместо 1.",
        "Если в команде несколько Spirit Vessel, то заряд получит предмет того героя, кто был ближе всего к умершему врагу.",
        "При улучшении Urn of Shadows в Spirit Vessel все заряды сохраняются."
      ],
      "mana": null,
      "abilityName": "Soul Release",
      "cooldown": null,
      "description": "Эффект зависит от выбранной цели. Если применить на противника, то он будет терять 4% от своего текущего запаса здоровья, а также получать на 45% меньше здоровья от любого лечения, восстановления и вампиризма. Помимо этого, способность наносит 35 урона в секунду. Если применить на союзника, увеличивает его восстановление здоровья на 40 в секунду. Действует 8 сек. Получает заряды каждый раз, когда в радиусе 1400 умирает вражеский герой. Заряд получит только один, ближайший к умершему герою предмет.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2980",
  "lore": null,
  "consistFrom": [
    "Urn of Shadows",
    "Vitality Booster",
    "Recipe"
  ],
  "name": "Spirit Vessel",
  "description": "Сотворена богом, желавшим изловить души остальных.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}