{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1.5% Max Health Sun Ray Damage",
          "talentRight": "+3 Supernova Hit Count"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0.5s Supernova Stun Duration",
          "talentRight": "+1000 Icarus Dive Cast Range"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+500 Health",
          "talentRight": "+25 Fire Spirits DPS"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+6% Spell Amplification",
          "talentRight": "+24% Icarus Dive Slow"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Phoenix_Icarus_Dive.mp3\/revision\/latest?cb=20191216021826",
      "effects": [
        "Ability Target Point",
        "Affects Enemies \/ Self",
        "Damage Magical"
      ],
      "notes": [
        "Icarus Dive cannot be cast during Supernova. Casting Supernova during Icarus Dive immediately ends the dive.",
        "Casting Supernova during Icarus Dive immediately ends the dive.",
        "Phoenix can attack, cast and channel abilities while diving. However, Sun Ray is inactive during the dive, and cannot be cast. During Icarus Dive, Phoenix does not need to turn to cast targeted abilities or items.",
        "However, Sun Ray is inactive during the dive, and cannot be cast.",
        "During Icarus Dive, Phoenix does not need to turn to cast targeted abilities or items.",
        "The 15% current health as cost is direct HP Removal.",
        "Phoenix dives in an ellipse with a major axis length of 1100\/1200\/1300\/1400 (TagTalent 2100\/2200\/2300\/2400) and a minor axis length of 500. This results in a total path of 2602.44\/2784.8\/2968.87\/3154.41 (TagTalent 4480.83\/4673.03\/4865.71\/5058.83), which Phoenix covers in 2 (TagTalent 3) seconds. This means Phoenix dives at an average speed of 1301.22\/1392.4\/1484.44\/1577.21 (TagTalent 2240.41\/2336.52\/2432.86\/2529.41). The dive speed is not constant. Phoenix starts at 0, accelerates until halfway through max distance, then slows down towards max distance, then repeats the process on the way back.",
        "This results in a total path of 2602.44\/2784.8\/2968.87\/3154.41 (TagTalent 4480.83\/4673.03\/4865.71\/5058.83), which Phoenix covers in 2 (TagTalent 3) seconds.",
        "This means Phoenix dives at an average speed of 1301.22\/1392.4\/1484.44\/1577.21 (TagTalent 2240.41\/2336.52\/2432.86\/2529.41).",
        "The dive speed is not constant. Phoenix starts at 0, accelerates until halfway through max distance, then slows down towards max distance, then repeats the process on the way back.",
        "Destroys trees within a 150 radius around Phoenix during the dive.",
        "Phoenix always dives clockwise, hitting units on the left side of the dive first. Units right in the middle of the arc might not be hit.",
        "The dive is canceled when Phoenix is stunned, cycloned, hexed, slept or affected by other sources of forced movement. Roots and taunts do not cancel it.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 4 instances. Can deal up to 40\/120\/200\/280 damage to a single unit (before reductions).",
        "Can deal up to 40\/120\/200\/280 damage to a single unit (before reductions)."
      ],
      "mana": "0",
      "hotKey": "Q",
      "cooldown": "36\/34\/32\/30",
      "description": "Phoenix dives forward in an arc with a fixed distance in the targeted direction, dealing damage over time and slowing the movement speed of any units it comes into contact with, and then orbiting back to its original position. If Phoenix casts Supernova, the dive ends.",
      "spellName": "Icarus Dive",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: Global",
        "Current Health as Cost: 15%",
        "Effect Radius: 200",
        "Dive Distance: 1100\/1200\/1300\/1400 (TagTalent 2100\/2200\/2300\/2400)",
        "Dive Width: 500",
        "Dive Duration: 2 (TagTalent 3)",
        "Damage per Second: 10\/30\/50\/70",
        "Move Speed Slow: 19%\/22%\/25%\/28% (TagTalent 43%\/46%\/49%\/52%)",
        "Slow\/Damage Duration: 4",
        "Slow persists, and attempts to damage if debuff was placed before spell immunity and when not dispelled.",
        "Getting rooted during the dive does not cancel the dive."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Icarus Dive until the sub-ability is used or until the dive stops.",
        "Interrupts Phoenix's channeling abilities upon cast."
      ],
      "mana": "0",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "Immediately cancels the dive.",
      "spellName": "Stop Icarus Dive",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/29\/Phoenix_Fire_Spirits.mp3\/revision\/latest?cb=20191216021825",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Fire Spirits cannot be cast during Supernova. Casting Supernova while Fire Spirits is active immediately removes the Fire Spirit buff.",
        "Casting Supernova while Fire Spirits is active immediately removes the Fire Spirit buff.",
        "The 20% current health as cost is direct HP Removal.",
        "Interrupts Phoenix's channeling abilities upon cast.",
        "Grants Launch Fire Spirit 4 charges upon cast. The number of instances is visible on the status buff.",
        "The burn damage debuff does not stack. Hitting the same units multiple times just refreshes the debuff duration.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 4 instances.",
        "Each spirit can deal up to 60\/140\/220\/300 (TagTalent 160\/240\/320\/400) damage to a single unit. Can in total deal up to 240\/560\/880\/1200 (TagTalent 640\/960\/1280\/1600) damage to a single unit (before reductions).",
        "Can in total deal up to 240\/560\/880\/1200 (TagTalent 640\/960\/1280\/1600) damage to a single unit (before reductions)."
      ],
      "mana": "120",
      "hotKey": "W",
      "cooldown": "51\/44\/37\/30",
      "description": "Summons 4 Fire Spirits that circle around Phoenix. Each spirit can be launched independently at a targeted area of effect. Affected enemy units take damage over time and have their attack speed greatly reduced.",
      "spellName": "Fire Spirits",
      "params": [
        "Cast Animation: 0+0",
        "Current Health as Cost: 20%",
        "Effect Radius: 200",
        "Number of Spirits: 4",
        "Damage per Second: 15\/35\/55\/75 (TagTalent 40\/60\/80\/100)",
        "Attack Speed Slow: 80\/100\/120\/140",
        "Slow\/Damage Duration: 4",
        "Spirits Duration: 20",
        "Slow persists, and attempts to damage if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Phoenix_Launch_Fire_Spirit_1.mp3\/revision\/latest?cb=20191216021830",
      "effects": [
        "Ability Target Area"
      ],
      "notes": [
        "Replaces Fire Spirits until all spirits are launched.",
        "The max amount of charges for Launch Fire Spirit always equals the value given on the status buff.",
        "The launched spirits travel at a speed of 900.",
        "During Icarus Dive and Sun Ray, the spirits can be fired in any direction without requiring Phoenix to face that direction.",
        "Fire Spirits provide 200 radius ground vision for 1 second at the targeted area upon impact."
      ],
      "mana": "0",
      "hotKey": "W",
      "cooldown": "0",
      "description": "Each fire spirit can be launched independently at a targeted area of effect. Affected enemy units take damage over time and have their attack speed greatly reduced.",
      "spellName": "Launch Fire Spirit",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 1400",
        "Max Charges: 4"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Phoenix_Sun_Ray.mp3\/revision\/latest?cb=20191216021815",
      "effects": [
        "Ability Target Point",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "Sun Ray cannot be cast during Icarus Dive and Supernova. Casting Supernova during Sun Ray immediately ends it. Casting Icarus Dive during it does not end it.",
        "Casting Supernova during Sun Ray immediately ends it. Casting Icarus Dive during it does not end it.",
        "The 6% current health as cost per second is direct HP Removal. Drains 1.2% of current health in 0.2-second intervals, starting 0.2 seconds after cast, resulting in 30 drain instances in 6 seconds. This results in a total health cost of 30.38% of Phoenix's initial current health on cast to sustain the full 6 seconds.",
        "Drains 1.2% of current health in 0.2-second intervals, starting 0.2 seconds after cast, resulting in 30 drain instances in 6 seconds.",
        "This results in a total health cost of 30.38% of Phoenix's initial current health on cast to sustain the full 6 seconds.",
        "For better readability, the turn rate during Sun Ray is given as degrees per second, instead of radians per 0.03 seconds. 25° per second equal a turn rate of 0.013.",
        "25° per second equal a turn rate of 0.013.",
        "Has 175 non-lingering ground vision around the ray for the duration.",
        "Sun Ray is canceled if Phoenix gets stunned, silenced, cycloned, feared, hexed or slept. Roots, taunts and forced movement do not cancel it. Duel cancels Sun Ray because it applies silence effect to duelists. While affected by the taunts, Phoenix can neither change directions, nor use Toggle Movement and Stop Sun Ray.",
        "Duel cancels Sun Ray because it applies silence effect to duelists.",
        "While affected by the taunts, Phoenix can neither change directions, nor use Toggle Movement and Stop Sun Ray.",
        "Sun Ray sets Phoenix's movement speed to 0 (has priority over hastes) and disarms Phoenix for its duration, so it cannot move or attack.",
        "Phoenix can cast and channel abilities during Sun Ray. During Sun Ray, Phoenix does not need to turn to cast targeted abilities or items.",
        "During Sun Ray, Phoenix does not need to turn to cast targeted abilities or items.",
        "Deals damage and heals affected targets in 0.2-second intervals, starting 0.2 seconds after cast, resulting in up to 30 heal or damage instances per unit.",
        "Initially, the beam deals 14\/20\/26\/32 + 1%\/2.75%\/4.5%\/6.25% (TagTalent 2.5%\/4.25%\/6%\/7.75%) of the affected units' max health as damage per second. For each passing 0.2 seconds, the damage increases by 0.467\/0.667\/0.867\/1.067 + 0%\/0.1%\/0.2%\/0.2% (TagTalent 0.1%\/0.1%\/0.2%\/0.3%) of their max health. In 6 seconds, the damage reaches 28\/40\/52\/64 + 2%\/5.5%\/9%\/12.5% (TagTalent 5%\/8.5%\/12%\/15.5%) of their max health per second. At this point, the ray stops. Can deal up to 126\/180\/234\/288 + 9%\/24.75%\/40.5%\/56.25% (TagTalent 22.5%\/38.25%\/54%\/69.75%) of max health as damage (before reductions) when an enemy is hit for its full duration.",
        "For each passing 0.2 seconds, the damage increases by 0.467\/0.667\/0.867\/1.067 + 0%\/0.1%\/0.2%\/0.2% (TagTalent 0.1%\/0.1%\/0.2%\/0.3%) of their max health.",
        "In 6 seconds, the damage reaches 28\/40\/52\/64 + 2%\/5.5%\/9%\/12.5% (TagTalent 5%\/8.5%\/12%\/15.5%) of their max health per second. At this point, the ray stops.",
        "Can deal up to 126\/180\/234\/288 + 9%\/24.75%\/40.5%\/56.25% (TagTalent 22.5%\/38.25%\/54%\/69.75%) of max health as damage (before reductions) when an enemy is hit for its full duration.",
        "Initially, the beam heals for 7\/10\/13\/16 + 0.5%\/1%\/1.5%\/2% of the affected units' max health per second. For each passing 0.2 seconds, the heal increases by 0.233\/0.333\/0.433\/0.533 + 0%\/0%\/0.1%\/0.1% of their max health. In 6 seconds, the heal reaches 14\/20\/26\/32 + 1%\/2%\/3%\/4% of their max health per second. At this point, the ray stops. Can heal up to 63\/90\/117\/144 + 4.5%\/9%\/13.5%\/18% of max health when an ally is hit by the beam for the full duration.",
        "For each passing 0.2 seconds, the heal increases by 0.233\/0.333\/0.433\/0.533 + 0%\/0%\/0.1%\/0.1% of their max health.",
        "In 6 seconds, the heal reaches 14\/20\/26\/32 + 1%\/2%\/3%\/4% of their max health per second. At this point, the ray stops.",
        "Can heal up to 63\/90\/117\/144 + 4.5%\/9%\/13.5%\/18% of max health when an ally is hit by the beam for the full duration.",
        "Does not affect Couriers or Roshan.",
        "With Aghanim's Shard, Sun Ray becomes castable during Supernova, and casting Supernova during Sun Ray no longer ends it. On the same intervals, Sun Ray first applies the damage, then the debuff.",
        "On the same intervals, Sun Ray first applies the damage, then the debuff."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "E",
      "cooldown": "30",
      "description": "Phoenix expels a beam of light at the cost of its own health. The beam damages enemies and heals allies for a base amount plus a percentage of their health. The percentage increases as the beam continues to fire.",
      "spellName": "Sun Ray",
      "params": [
        "Cast Animation: 0.01+0.5",
        "Cast Range: 1200",
        "Current Health as Cost per Second: 6%",
        "Ray Distance: 1150",
        "Ray Radius: 130",
        "Base Damage per Second: 14\/20\/26\/32",
        "Max Health as Damage per Second: 1%\/2.75%\/4.5%\/6.25% (TagTalent 2.5%\/4.25%\/6%\/7.75%)",
        "Base Heal per Second: 7\/10\/13\/16",
        "Max Health as Heal per Second: 0.5%\/1%\/1.5%\/2%",
        "Turn Rate in Degrees per Second: 25°",
        "Ray Duration: 6",
        "Move Speed Slow: 12%",
        "Slow Duration: 0.67",
        "Allows Sun Ray to be cast during Supernova. Slows enemies by 12%.",
        "Heals spell immune allies. Does not damage spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Sun Ray until the sub-ability is used or the duration ends.",
        "Interrupts Phoenix's channeling abilities upon cast."
      ],
      "mana": "0",
      "hotKey": "E",
      "cooldown": "0",
      "description": "Immediately stops the Sun Ray.",
      "spellName": "Stop Sun Ray",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Toggle",
        "Affects Self"
      ],
      "notes": [
        "This ability is only active while having Sun Ray buff.",
        "Interrupts Phoenix's channeling abilities upon cast.",
        "Moves Phoenix towards the direction of the ray with a fixed 250 speed. Is not based on Phoenix's movement speed, so movement speed slows and bonuses do not affect it. Can move Phoenix through cliffs, and destroys trees in its path.",
        "Is not based on Phoenix's movement speed, so movement speed slows and bonuses do not affect it.",
        "Can move Phoenix through cliffs, and destroys trees in its path."
      ],
      "mana": "0",
      "hotKey": "D",
      "cooldown": "0",
      "description": "Toggles slow forward movement during Sun Ray firing.",
      "spellName": "Toggle Movement",
      "params": [
        "Cast Animation: 0+0",
        "Set Move Speed: 250",
        "Getting rooted while already moving stops the movement. The movement continues as soon as the root expires."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Phoenix_Supernova_1.mp3\/revision\/latest?cb=20191216021816",
      "effects": [
        "Ability No Target (TagAghanim Target Unit)",
        "Affects Enemies (TagAghanim Allied Heroes)",
        "Damage Magical \/ Instant Kill"
      ],
      "notes": [
        "Supernova turns nighttime into daytime for its duration. This has a higher priority than the artificial nights of Dark Ascension and Eclipse.",
        "This has a higher priority than the artificial nights of Dark Ascension and Eclipse.",
        "Disjoints projectiles and applies a strong dispel on Phoenix upon cast. Also dispels Fire Spirits.",
        "Resets Phoenix' basic abilities, and replenishes its mana upon cast. Does not resets the cooldowns of items and ultimates. If the sun survives, Phoenix's health and mana gets replenished at the end of the duration.",
        "If the sun survives, Phoenix's health and mana gets replenished at the end of the duration.",
        "During Supernova, Phoenix is hidden, invulnerable, rooted, muted, and disarmed. All of Phoenix' abilities are also turned inactive for during Supernova, so that they cannot be cast either.",
        "All of Phoenix' abilities are also turned inactive for during Supernova, so that they cannot be cast either.",
        "Only attacks from heroes (including clones, excluding illusions) can damage the Phoenix Sun.",
        "The area damage is provided by an aura. Its debuff lingers for 0.5 seconds. Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in up to 6 possible instances. Can deal up to 360\/540\/720 damage to a single unit (before reductions) when it stays in range for the full duration. The source of the damage is the caster, not the sun itself, so it fully benefits from spell amplification.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in up to 6 possible instances.",
        "Can deal up to 360\/540\/720 damage to a single unit (before reductions) when it stays in range for the full duration.",
        "The source of the damage is the caster, not the sun itself, so it fully benefits from spell amplification.",
        "The sun can be denied once it drops below 50% health. Doing so also denies Phoenix.",
        "Destroys trees within a 500 side length rectangular around Phoenix upon cast.",
        "With Aghanim's Scepter, Supernova turns into a single target ability with 500 cast range. The cast range is only for selecting an allied hero within the range. The sun still appears on Phoenix's current location. Can only target allied heroes, including illusions, clones and self, excluding creep-heroes. ↓↓ Double-tapping automatically targets self. The targeted ally cannot act during Supernova at all, on top of the same effects that are applied to Phoenix during it. If the sun survives, the ally's health and mana get replenished, and their basic ability cooldowns get reset. Destroying the Phoenix Sun credits both of the heroes' deaths to its destroyer. Same goes for denying. If the sun gets destroyed and Phoenix has Reincarnation, the ally is released with its health, mana and cooldowns unaffected. If the sun gets destroyed and the ally inside has Reincarnation, it reincarnates while Phoenix dies.",
        "The cast range is only for selecting an allied hero within the range. The sun still appears on Phoenix's current location.",
        "Can only target allied heroes, including illusions, clones and self, excluding creep-heroes. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "The targeted ally cannot act during Supernova at all, on top of the same effects that are applied to Phoenix during it.",
        "If the sun survives, the ally's health and mana get replenished, and their basic ability cooldowns get reset.",
        "Destroying the Phoenix Sun credits both of the heroes' deaths to its destroyer. Same goes for denying.",
        "If the sun gets destroyed and Phoenix has Reincarnation, the ally is released with its health, mana and cooldowns unaffected.",
        "If the sun gets destroyed and the ally inside has Reincarnation, it reincarnates while Phoenix dies.",
        "With Aghanim's Shard, Sun Ray becomes castable during Supernova, and casting Supernova during Sun Ray no longer ends it. However, since Phoenix is also rooted, it can neither move nor use the Toggle Movement sub-ability during it. Phoenix can still turn in place and change the Sun Ray's direction, but the Stop Sun Ray sub-ability cannot be used. If Supernova is cast during Sun Ray, it can immediately be cast again once it ends, due to Supernova refreshing its cooldown on cast. If Supernova ends during Sun Ray, the ability continues normally, and its sub-abilities become usable again.",
        "However, since Phoenix is also rooted, it can neither move nor use the Toggle Movement sub-ability during it.",
        "Phoenix can still turn in place and change the Sun Ray's direction, but the Stop Sun Ray sub-ability cannot be used.",
        "If Supernova is cast during Sun Ray, it can immediately be cast again once it ends, due to Supernova refreshing its cooldown on cast.",
        "If Supernova ends during Sun Ray, the ability continues normally, and its sub-abilities become usable again."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "120",
      "description": "The Phoenix willingly ends its current life for the chance to be reborn. Transforms into a burning sun that scorches enemies in a huge area. The sun can be destroyed by attacks from enemy Heroes. After seconds the sun explodes, stunning all nearby enemies while restoring Phoenix to full health and mana with refreshed abilities.",
      "spellName": "Supernova",
      "params": [
        "Cast Animation: 0.01+0.5",
        "Radius: 1200",
        "Hero Attacks to Destroy: 6\/8\/10 (TagTalent 9\/11\/13) (TagTalent 7\/10\/13, 10\/13\/16)",
        "Damage per Second: 60\/90\/120",
        "Stun Duration: 2\/2.5\/3 (TagTalent 2.5\/3\/3.5)",
        "Aura Linger Duration: 0.5",
        "Nova Duration: 6",
        "Cast Range: 500",
        "Increases number of attacks to destroy Supernova and allows Phoenix to cast Supernova on an allied hero, bringing both into the sun to be reborn together."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Phoenix is a flexible and unique ranged strength hero with a plethora of powerful abilities that inflict heavy damage over time on its opponents at the cost of its own health. It can be played as either a support, initiator, or semi-carry. Icarus Dive can serve as either a harassment tool, an initiating maneuver, or an escape mechanism, all the while slowing and damaging opponents in its path, while its Fire Spirits burn and cripple the opponent's attack speed, making it a potent anti-carry. Sun Ray projects a powerful beam in front of Phoenix that burns enemies for a percentage of their maximum health while sacrificing some of its own health; and, if it ever sees fit, it can end its current life to turn into a searing Supernova. Surviving this stage of its life cycle allows Phoenix to reemerge in full strength, stunning all nearby opponents and with all non-ultimate and non-item cooldowns refreshed, ready to inflict havoc on its foes once again.",
  "history": "Alone across an untouched darkness gleamed the Keeper's first sun, a singular point of conscious light fated to spread warmth into the empty void. Through aeons beyond count, this blinding beacon set to coalescing its incalculable energy before bursting forth the cataclysmic flare of supernova. From this inferno raced new beacons, star progeny identical to its parent, who journeyed an unlit ocean and settled in constellatory array. In time, they too would be made to propagate through supernova flame. So would this dazzling cycle of birth and rebirth repeat until all skies hewn of Titan toil deigned to twinkle and shine. By this ageless crucible the star that mortals would come to call Phoenix collapsed into being, and like its ancestors was thrust into an endless cosmos to find a place among its stellar brethren. Yet curiosity toward that which the dimming elders comfort in the darkness consumed the fledgling, and so over long cycles it inquired and studied. It learned that among worlds both whole and broken would soon stir a nexus of remarkable variety locked in an enduring conflict of cosmic consequence, a plane which would find itself in need of more influence than a dying sun's distant rays could provide. Thus this infant son of suns took terrestrial form, eagerly travelling to shine its warmth upon those who may need it most, and perhaps seize upon its solar destiny.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1.5% Max Health Sun Ray Damage",
      "talentRight": "+3 Supernova Hit Count"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0.5s Supernova Stun Duration",
      "talentRight": "+1000 Icarus Dive Cast Range"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+500 Health",
      "talentRight": "+25 Fire Spirits DPS"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+6% Spell Amplification",
      "talentRight": "+24% Icarus Dive Slow"
    }
  ]
}