{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5d\/Dominate.mp3\/revision\/latest?cb=20141119014329",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских существ",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Применяет к цели базовое развеивание, которое убирает баффы и дебаффы.",
        "Приручение нового крипа убьет уже прирученного.",
        "Число максимально доступных существ для приручения связано с игроком. Покупка нового Helm of the Dominator не позволит приручить дополнительное существо. Также распространяется на Helm of the Dominator клона, созданного Tempest Double. Если противник переманивает прирученного крипа (например, с помощью Enchant), то приручение нового не убьет переманенного. При продаже или разбитии предмета прирученный крип умирает. Эта смерть никому не засчитывается, поэтому она никому не даст опыта.",
        "Также распространяется на Helm of the Dominator клона, созданного Tempest Double.",
        "Если противник переманивает прирученного крипа (например, с помощью Enchant), то приручение нового не убьет переманенного.",
        "При продаже или разбитии предмета прирученный крип умирает.",
        "Эта смерть никому не засчитывается, поэтому она никому не даст опыта.",
        "Приравнивает скорость передвижения цели к 425.",
        "Устанавливает награду за цель в 200 золота. Базовая награда не дается за убийство цели, только установленная. Получаемый за убийство опыт не меняется.",
        "Базовая награда не дается за убийство цели, только установленная. Получаемый за убийство опыт не меняется.",
        "Если максимальное здоровье существа ниже порога минимального здоровья, то его максимальное и текущее здоровье увеличивается на эту разницу. Это увеличение не считается за лечение. Здоровье существа приравнивается к значению, устанавливаемому способностью.",
        "Это увеличение не считается за лечение. Здоровье существа приравнивается к значению, устанавливаемому способностью.",
        "Добавляет урон от атаки в качестве базового урона, то есть он также попадает под действие всех эффектов, увеличивающих или уменьшающих урон на процентное значение.",
        "Не восстанавливает ману крипа.",
        "Нельзя приручить призываемых существ Necronomicon, крипов-героев и катапульты. Нельзя приручить древних крипов на 1 уровне, можно на 2 уровне."
      ],
      "mana": null,
      "abilityName": "Dominate",
      "cooldown": "45",
      "description": "Даёт контроль над нейтральным крипом, не являющимся древним, и увеличивает его скорость передвижения до 425, а запас здоровья — до 1000\/1800. Также даёт крипу +25 к базовому урону, +4 к броне, +12 к восстановлению здоровья и +4 к восстановлению маны. Если максимальное здоровье существа больше 1000\/1800, оно не изменится. За убийство существа даётся 200 золота.",
      "params": [
        "Дальность применения: 700",
        "Максимальное число приручаемых существ: 1",
        "Минимальный порог здоровья: 1000\/1800",
        "Скорость передвижения: 425",
        "Доп. базовый урон: 25",
        "Доп. броня: 4",
        "Доп. регенерация здоровья: 12",
        "Доп. регенерация маны: 4",
        "Награда за убийство: 200",
        "Может брать контроль над крипом, невосприимчивом к магии."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 120\/400 здоровья, 6,6\/10 регенерации здоровья, 7\/11,33 брони, 6\/20 скорости атаки, 72\/240 маны, 0,3\/1 регенерации маны и 6\/20 урона от атаки.",
    "Для героев ловкости, даёт 120\/400 здоровья, 6,6\/10 регенерации здоровья, 7\/11,33 брони, 6\/20 скорости атаки, 72\/240 маны, 0,3\/1 регенерации маны и 6\/20 урона от атаки.",
    "Для героев интеллекта, даёт 120\/400 здоровья, 6,6\/10 регенерации здоровья, 7\/11,33 брони, 6\/20 скорости атаки, 72\/240 маны, 0,3\/1 регенерации маны и 6\/20 урона от атаки."
  ],
  "cost": "2350",
  "lore": null,
  "consistFrom": [
    "Helm of Iron Will",
    "Crown",
    "Recipe"
  ],
  "boughtFrom": "Аксессуары",
  "name": "Helm of the Dominator",
  "description": "Могущественный шлем мертвого некроманта.",
  "trivia": null,
  "upgradeIn": [
    "Helm of the Dominator 2"
  ],
  "bonuses": [
    "+6\/20 к силе",
    "+6\/20 к ловкости",
    "+6\/20 к интеллекту",
    "+6\/8 к регенерации здоровья",
    "+6\/8 к броне"
  ],
  "tips": [
    "Прирученных крипов можно использовать для удаленного стака древних крипов. У некоторых есть очень полезные способности как, например, у Тролля-призывателя и Огра-чародея.",
    "Можно приручить Вожака волков для полезной ауры усиления урона и отправить его следовать за керри.",
    "Прирученного крипа можно отправить на разведку в логово Рошана. Просто убедитесь, что он стоит не слишком близко к Рошану, чтобы крип не получил урона.",
    "Dominate всегда устанавливает базовую скорость передвижения крипов равной 425. Только у одного юнита скорость передвижения выше 425 - у Lycan Wolf, начиная с 3-го уровня. То есть его приручение уменьшит скорость передвижения до 425. У всех остальных крипов скорость передвижения меньше 425."
  ]
}