{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6a\/Maelstrom_Chain_Lightning_1.mp3\/revision\/latest?cb=20191227195450",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not stack with the Chain Lightning of Mjollnir, Gleipnir or other Maelstroms.",
        "When obtaining multiple items with the Chain Lightning ability, only the one that has been continuously the longest in the inventory works.",
        "The lightning bounces in 0.25 second intervals, so hitting max targets takes 0.75 seconds.",
        "Can proc on fogged or invisible units, but will not bounce toward fogged or invisible units.",
        "Can never hit the same unit more than once per proc.",
        "All bounces together can deal up to 560 damage (before reductions).",
        "Chain Lightning can proc while a previous chain lightning is still bouncing.",
        "Chain Lightning will not proc if the attacker is dead. However, it can proc if the target is dead.",
        "However, it can proc if the target is dead.",
        "Chain Lightning uses pseudo-random distribution.",
        "Attacks which proc Chain Lightning cannot miss.",
        "The Maelstrom Chain buff is a hidden buff required for the lightning to jump.",
        "Chain Lightning does not use a regular cooldown. It is neither displayed on the item icon when proccing, nor is it affected by cooldown manipulating effects."
      ],
      "mana": null,
      "abilityName": "Chain Lightning",
      "cooldown": "0.2",
      "description": "Grants a 30% chance on attack to release a bolt of electricity that leaps between 4 targets within a 650 radius, dealing 140 magical damage to each. Lightning proc pierces evasion.",
      "params": [
        "Proc Chance: 30%",
        "Bounce Distance: 650",
        "Number of Bounces: 4",
        "Bounce Interval: 0.25",
        "Damage: 140"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2700",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Javelin"
  ],
  "boughtFrom": "Artifacts",
  "name": "Maelstrom",
  "description": "A hammer forged for the gods themselves, Maelstrom allows its user to harness the power of lightning.",
  "trivia": null,
  "upgradeIn": [
    "Gleipnir",
    "Mjollnir"
  ],
  "bonuses": [
    "+24 Attack damage"
  ],
  "tips": [
    "Maelstrom is a very good item for speeding up farming. If the extra experience is not needed, it is a good alternative to Hand of Midas.",
    "It is also great to deal with illusions or mass-summons like Broodmother's spiders, Nature's Prophet's treants, etc. Especially useful for ranged heroes that lack area damage, since they cannot make use of cleave.",
    "The Chain Lightning deals magical damage which ignores armor and Damage Block, making it good against heroes that get a Vanguard, or Tidehunter with his Kraken Shell, and against heroes with high armor like Dragon Knight or Terrorblade.",
    "Maelstrom is a useful pickup against mega creeps in order to help clear waves."
  ]
}