{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Meteor_Hammer_Meteor_Hammer_1.mp3\/revision\/latest?cb=20191227195458",
      "effects": [
        "Дальность применения: 600",
        "Время произнесения: 2,5",
        "Радиус эффекта: 400",
        "Задержка эффекта: 0,5",
        "Урон от удара (TagAghanimсущества): 150",
        "Урон от удара (TagAghanimпостройки): 75",
        "Урон в секунду: 60",
        "Длительность горения: 6",
        "Длительность оглушения: 1,25"
      ],
      "notes": [
        "Если был прерван во время произнесения, то Meteor Hammer ничего не сделает, расходует ману и уйдёт на перезарядку.",
        "Визуальный эффект на указанной области во время произнесения виден только союзникам.",
        "Визуальный эффект вокруг заклинателя виден всем, кто имеет обзор на заклинателя.",
        "Звуковой эффект применения слышен всем, кто имеет обзор на заклинателя.",
        "Для приземлению метеору нужно секунды. Во время задержки заклинатель неуязвим и спрятан.",
        "При приземлении все враги в области, включая постройки, но исключая варды, получают урон, оглушаются и получают дебафф горения.",
        "Метеор сначала применяет дебаффы, а затем наносит урон от удара.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 7 раз, включая урон от удара. Может нанести до 510 (TagTalent 435) урона (до уменьшений).",
        "Может нанести до 510 (TagTalent 435) урона (до уменьшений).",
        "Повторное применение не складывается, но обновляет длительность. Складывается с дебаффом от Fallen Sky.",
        "Складывается с дебаффом от Fallen Sky.",
        "Даёт летающий обзор на указанную область на 3,8 секунды, начиная с произнесения. Этот обзор остаётся даже если произнесение было отменено.",
        "Этот обзор остаётся даже если произнесение было отменено.",
        "Не делит перезарядку с Fallen Sky."
      ],
      "mana": "100",
      "abilityName": "Meteor Hammer",
      "cooldown": "24",
      "description": "При успешном окончании прочтения вызывает метеор, поражающий врагов в радиусе 400 и оглушающий их на 1,25 секунд. Наносит периодический урон существам и строениям в течение 6 секунд.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2350",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Crown",
    "Recipe"
  ],
  "name": "Meteor Hammer",
  "description": "Этот зачарованный молот сковали из металла, который обнаружили в руинах деревни, уничтоженной великим звездопадом.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}