{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/72\/Town_Portal_Scroll_Teleport_1.mp3\/revision\/latest?cb=20191227195542",
      "effects": [
        "Cast Range: Global",
        "Min Targeting Distance to Building: 70",
        "Max Targeting Distance to Building: 800",
        "Max Targeting Distance to Outposts: 250",
        "First Channel Time: 3",
        "First Channel Time to Outposts: 6",
        "Second Channel Time Increase: 2",
        "Following Channel Time Increase: 0.5",
        "Recent Teleport Check Radius: 1150",
        "Recent Teleport Check Duration: 25",
        "Boots of Travel 2 Channel Time Reduction: 1"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets the fountain when being at least 1500 range away.",
        "When ground-targeted, it automatically searches for the closest valid target to teleport to. Only targets buildings by default. With Boots of Travel, it targets non-hero units as well, and with Boots of Travel 2, it targets allied heroes as well. Cannot directly target buildings. Instead, it uses the minimum teleport distance.",
        "Only targets buildings by default. With Boots of Travel, it targets non-hero units as well, and with Boots of Travel 2, it targets allied heroes as well.",
        "Cannot directly target buildings. Instead, it uses the minimum teleport distance.",
        "If multiple heroes teleport to the same location within the recent teleport check duration, the channeling time increases for each successive hero. The first channel takes 3 seconds, the second 5 seconds, and all following channels take 0.5 seconds longer than the previous one. Teleporting to captured Outposts takes 3 seconds longer than to other buildings, so the first teleport takes 6 seconds. Teleporting towards the fountain always takes 3 seconds, no matter how many targeted that area. The check radius is based on the targeted building's location. Each building has its own independent check radius. The teleports do not have to succeed. A canceled teleport still counts and increases following teleport's channeling time.",
        "The first channel takes 3 seconds, the second 5 seconds, and all following channels take 0.5 seconds longer than the previous one.",
        "Teleporting to captured Outposts takes 3 seconds longer than to other buildings, so the first teleport takes 6 seconds.",
        "Teleporting towards the fountain always takes 3 seconds, no matter how many targeted that area.",
        "The check radius is based on the targeted building's location. Each building has its own independent check radius.",
        "The teleports do not have to succeed. A canceled teleport still counts and increases following teleport's channeling time.",
        "Teleports upgraded by Boots of Travel are not restricted by the aforementioned conditions. When upgraded, it always takes 3 seconds to teleport (6 seconds to Outposts), regardless of recent teleports.",
        "When upgraded, it always takes 3 seconds to teleport (6 seconds to Outposts), regardless of recent teleports.",
        "Disjoints projectiles upon teleporting.",
        "During the channeling, the teleport destination is marked with a visual effect in the same color as the player and a sound is played.",
        "Both are visible and audible to everyone. The visual effect is also visible on teleporting invisible enemies.",
        "Also marks the point on the minimap for allies. The mark is in the player's color and lasts as long as the channeling does.",
        "Provides 200 range flying vision at the destination point for the whole channel duration, even if cancelled. The vision lingers for 1 second.",
        "The targeted unit's priority is lowered, meaning it is attacked as the last auto attack target by other units.",
        "When the target unit dies or changes ownership during the channeling, the teleport gets canceled, wasting the cooldown and mana cost. Since buildings are not directly targeted, the destruction of the building, or loss of the Outpost does not cancel the teleport.",
        "Since buildings are not directly targeted, the destruction of the building, or loss of the Outpost does not cancel the teleport.",
        "With Boots of Travel, Town Portal Scrolls do not lose charges upon teleporting, and have their cooldown reduced to 40\/30 seconds.",
        "With Boots of Travel 2, all channeling time is reduced by 1."
      ],
      "mana": "75",
      "abilityName": "Teleport",
      "cooldown": "80",
      "description": "After channeling for 3 seconds, teleports you to a target friendly building. Double-click to teleport to your team's base fountain.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [],
  "cost": "100",
  "lore": null,
  "consistFrom": null,
  "name": "Town Portal Scroll",
  "description": "What a hero truly needs.",
  "trivia": [
    "In the original DotA, this item was called \"Scroll of Town Portal\".",
    "On the August 13, 2018 Patch, a new Town Portal Scroll with a green icon made its way into the main game. The item's active worked like the teleport of Boots of Travel 2, and costed only 50 . The item was available in every game mode until it was fixed\/removed one hour later in a hotfix patch. The item's purpose is unknown, but it was most likely intended to be part of Mutation Mode, due to being added in the same patch that added the Pocket Roshan item.",
    "The description of the item is a reference to the very first Dota 2 Gamescom trailer.",
    "Activating a Town Portal Scroll appears to require the casting hero's blood. This can be seen in the trailer, and in a scene the first episode Dota: Dragon's Blood, where Bram draws blood from his hand. Dragon Knight's as Davion of Dragon Hold also draws blood from his hand during the custom teleport animation.",
    "Dragon Knight's as Davion of Dragon Hold also draws blood from his hand during the custom teleport animation."
  ],
  "upgradeIn": null,
  "tips": [
    "Town Portal Scrolls are arguably the most important mobility items in the game and should be carried by every hero. They can easily prevent deaths or make kills possible when used correctly. When getting ganked, the teleport can be used to escape. However, one has to make sure first that the enemy cannot interrupt the teleport, by either waiting until they use their disables first, or by hiding\/obstructing vision in case of single-target disables and teleport while they have no vision. Inversely, they can also be used to teleport to help an ally who is getting ganked. The incoming teleport may cause enemies to retreat and give up chasing the ally and thus not get a kill, or they still go for it and risk losing some of their heroes in return. It is well worth to cancel the teleport if the enemy decides to give up chasing, costing the player 100 , but preventing the enemy from gaining gold and the ally from losing gold and time.",
    "When getting ganked, the teleport can be used to escape. However, one has to make sure first that the enemy cannot interrupt the teleport, by either waiting until they use their disables first, or by hiding\/obstructing vision in case of single-target disables and teleport while they have no vision.",
    "Inversely, they can also be used to teleport to help an ally who is getting ganked. The incoming teleport may cause enemies to retreat and give up chasing the ally and thus not get a kill, or they still go for it and risk losing some of their heroes in return. It is well worth to cancel the teleport if the enemy decides to give up chasing, costing the player 100 , but preventing the enemy from gaining gold and the ally from losing gold and time.",
    "Their cheap cost makes it very easy to buy them frequently, which is fully worth it, even in the very late game.",
    "As a carry, Town Portal Scrolls can be used to speed up farming, by teleporting from lane to lane after clearing the waves through to the enemy's next tower. Instead of having to walk to another place to farm, the teleport can be used to instantly get to the next farm location and keep on farming.",
    "In the lategame, teleport scrolls are crucial to fight against split-pushing enemies. When being far away from a tower which is getting pushed, a teleport is the only way to get there fast and defend the tower. This also goes for base-racing. When the enemy team is faster, teleporting back to base to defend can be the game-winning move."
  ]
}