{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Lotus_Orb.mp3\/revision\/latest?cb=20150428165330",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Двойное нажатие на предмет мгновенно использует его на себя. Несколько использований не складываются, но обновляют длительность.",
        "Можно использовать на крипов-героев, но от них заклинания не отражаются.",
        "Применяет базовое развеивание на цель при использовании.",
        "Когда заклинание блокируется с помощью Linken's Sphere, оно все равно отражается.",
        "Не отражает заклинания, использованные союзниками.",
        "Не отражает Ion Shell, Morph, Spell Steal, Soulbind, Urn of Shadows, Spirit Vessel, Medallion of Courage и Solar Crest.",
        "Не отражает способности, отраженные Counterspell Anti-Mage или другим Echo Shell.",
        "Список отражаемых заклинаний перечислен в статье Отражение заклинаний."
      ],
      "mana": "175",
      "abilityName": "Echo Shell",
      "cooldown": null,
      "description": "Создаёт вокруг цели щит, отражающий большинство направленных заклинаний обратно во врага. Действует 6 сек. Не блокирует эффекты вражеских заклинаний.",
      "params": [
        "Дальность применения: 900",
        "Длительность: 6"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3950",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Platemail",
    "Energy Booster"
  ],
  "boughtFrom": "Броня",
  "name": "Lotus Orb",
  "description": "Бриллиант в центре всё еще несет блеклое отражение своего создателя.",
  "trivia": [
    "Способность отражать направленные заклинания в заклинателя — старая концепция в Dota. Впервые она появилась в версии 6.00 как пассивная способность с шансом срабатывания, принадлежавшая Linken's Mirror — изначальная версия Linken's Sphere. Способность была убрана в версии 6.09 и заменена на Spell Block после переработки Linken's Sphere."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+6,5 к регенерации здоровья",
    "+250 к мане",
    "+4 к регенерации маны",
    "+10 к броне"
  ],
  "tips": null
}