{"abilities":[{"effects":["Cast Range (Tree): 350","Cast Range (Ward): 450"],"notes":["Can only target trees (including Sprout trees) and enemy Observer Wards and Sentry Wards.","Can also target an enemy Techies' Stasis Traps and Remote Mines, using the same cast range as for wards.","Does not share cooldown with Quelling Blade."],"elements":["Ability Target Unit","Affects Trees \/ Enemy Units"],"name":"Chop Tree or Ward","description":"Destroy a target tree or ward."},{"effects":["Attack Damage Bonus (Melee): 24","Attack Damage Bonus (Ranged): 7"],"notes":["Stacks with the Quell of Quelling Blade, but not with additional Battle Furies.","The bonus damage does not apply when attacking wards, buildings, Roshan, Spirit Bear and allied units.","When the owner's attack type changes to ranged or melee, the attack damage bonus adapts immediately.","Quell fully works with crits, cleaves and lifesteal. When having cleave, attacking a creep cleaves the increased damage in the area.","Elder Dragon Form's splash also splashes the increased damage when attacking a creep.","The damage Moon Glaives bounces are not increased, since they are based on the attacker's attack damage value.","Psi Blades will spread the increased damage when attacking a creep."],"elements":["Ability Passive","Affects Enemy Units"],"name":"Quell","description":"Increases attack damage against non-hero units by 24 for melee heroes, and 7 for ranged."},{"effects":["Starting Radius: 150","Distance: 650","End Radius: 360","Cleave Damage: 60%"],"notes":["Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","The complete area is shaped like an isosceles trapezoid in front of the attacking hero.","Fully stacks with other sources of cleaves. Each source of cleave is completely independent.","Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.","Despite the visual effect, cleave damage is applied instantly in the whole area.","Ranged units cannot cleave."],"elements":["Ability Passive","Affects Enemies","Damage Physical"],"name":"Cleave","description":"Deals 60% of attack damage as physical damage in a cone up to 650 around the target. (Melee Only)"}],"cost":"4400","description":"The bearer of this mighty axe gains the ability to cut down swaths of enemies at once.","trivia":["Faceless Void's cosmetic item, Battlefury, is based on Battle Fury."],"further":["Demon_Edge","Perseverance","Quelling_Blade","Recipe"],"tips":["The Battle Fury is great tool for farming but a poor choice for mid game skirmishes owing to its lack of primary attributes. Avoid it if the enemy team plays aggressively and your presence is required in team fights early.","Effective against illusions, summoned units, jungle stacks, ancient stacks and mega creeps. A Battle Fury allow to farm faster than a Midas for a melee hero. You can get this item after boots start with a ring of regen if you are laning or get damage if you are jungling, then get a mobility item like Blink Dagger to reach camps faster.","The cleave benefits from critical hits, including those from items and ignores evasion.","Having Battle Fury can help greatly against an enemy Nature's Prophet, since some carries have little means to escape his Sprout without it (the most obvious being Juggernaut and Sven)","Melee heroes with high attack speed can push far more effectively with Battle Fury, even in late game. Critical hits help too."],"attrs":["Active Chop Tree or Ward","Passive Quell, Cleave","Bonus +7.5 Health regeneration +3.75 Mana regeneration +45 Attack damage","Disassemble? No","Alert allies? No"]}