{"abilities":[{"effects":["Дальность применения (дерево): 350","Дальность применения (вард): 450"],"notes":["Можно выбирать только деревья (включая деревья Sprout) и вражеские Observer Ward и Sentry Ward.","Можно выбрать также Stasis Trap и Remote Mines вражеского Techies, используя ту же дальность применения, что и для вардов.","Не имеет общую перезарядку с Quelling Blade"],"elements":["Способность Направленная на юнита","Действует на Деревья \/ Вражеских существ"],"description":"Уничтожает выбранное дерево или вард."},{"effects":["Дополнительный урон крипам (ближний бой): 24","Дополнительный урон крипам (дальний бой): 7"],"notes":["Сочетается с источниками Quell от Quelling Blade.","Увеличивает только базовый и увеличенный характеристиками урон. Дополнительный урон от атаки не увеличивается.","Дополнительный урон не применяется при атаке дружественных юнитов (например, при добивании своих крипов).","При изменении типа атаки владельца на дальний или ближний бой бонус изменяется незамедлительно.","Kunkka не получает бонусов quell, пока не изучит Tidebringer.","Quell полностью работает с критическими, прорубающими ударами и вампиризмом. При прорубающем ударе увеличенный урон наносится всем юнитам в области. Однако, при наличии у юнита Tidebringer, урон от атаки не увеличивается Quell. Когда Tidebringer перезаряжается, урон от атаки увеличивается Quell.","Атака при активной Elder Dragon Form также наносит увеличенный урон в области при атаке крипа.","Урон при отскоке Moon Glaives не увеличивается, так как он основан на уроне от атаки владельца.","Psi Blades наносит увеличенный урон при атаке крипа.","Не работает против вардов, строений, Рошана, Spirit Bear Lone Druid'а и союзных юнитов."],"elements":["Способность Пассивная","Действует на Вражеских существ"],"description":"Увеличивает урон от атак по существам, не являющимися героями, на 24 для героев ближнего боя или на 7 — для дальнего."},{"effects":["Начальный радиус: 150","Дальность: 625","Конечный радиус: 330","Урон прорубания: 40%"],"notes":["Урон Cleave уменьшается типом брони, но не значением брони.","Прорубающий урон не может быть усилен с усилением урона заклинаний и не может дать вампиризм заклинаний.","Прорубающий урон уменьшается блокировкой урона.","Вся область выглядит в форме равнобедренной трапеции перед атакующим герем.","Полностью сочетается с другими источниками прорубания. Каждый источник прорубания работает абсолютно независимо.","Не дает прорубания при атаке вардов, строений или союзных юнитов. Варды и строения не попадают под влияние прорубания.","Несмотря на визуальные эффекты, прорубающий урон применяется мгновенно по всей области.","Юниты дальнего типа атаки не могут пользоваться прорубающим ударом."],"elements":["Способность Пассивная","Действует на Врагов","Урон Физический"],"description":"Наносит физический урон, равный 40% урона от атак, всем врагам вокруг основной цели в конусе радиусом 625 (только в ближнем бою)."}],"cost":"4400","description":"Владелец этого могучего топора может сокрушать ряды врагов в один миг.","further":["Demon_Edge","Perseverance","Quelling_Blade","Рецепт"],"attrs":["Активируемая Chop Tree or Ward","Пассивная Quell, Cleave","Бонус +6 к регенерации здоровья +2,25 к регенерации маны +45 к урону","Можно разобрать? Нет","Можно сообщать? Нет"]}