{"abilities":[{"spell":"Adds a freezing effect to Drow's attacks, slowing enemy movement. Lasts 1.5 seconds on Heroes, and 7 seconds on creeps.","effects":["Ability Target Unit \/ Autocast","Affects Enemies"],"notes":["The slow from successive casts does not stack, only the duration gets refreshed.","The attacks first apply the debuff, then their own damage.","Treats creep-heroes as creeps."],"mana":"12","elements":["Can be disjointed.","Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"0","name":"Frost Arrows","description":["Cast Range: 625","Move Speed Slow: 16%\/32%\/48%\/64%","Hero Slow Duration: 1.5","Non-Hero Slow Duration: 7"],"hot_key":"Q","legacy_key":"R"},{"spell":"Releases a wave that silences and knocks back enemy units. Knockback distance is relative to how close they are to you.","effects":["Ability Target Point","Affects Enemies"],"notes":["The wave travels at a speed of 2000, reaching max distance in 0.45 seconds.","Reaches up to 1150 range away (travel distance + effect radius).","The knockback distance is based on the distance between Drow Ranger and the hit enemy. The closer they are, the further they get knocked back. The knockback is strongest when the distance between Drow Ranger and the enemy is 1 range, pushing the enemy 350 range away. Each additional range of distance between them affects the knockback's distance, reducing it by 0.39. However, the knockback values are truncated, so that the knockback distance decreases by 1 for every 2–3 range between Drow and the enemy. Due to this, the minimum knockback distance is 1 range. When standing at the exact same location as Drow Ranger, no knockback occurs, since the formula then multiplies by 0, which results in 0 knockback.","Since the knockback distances are the same on each level, and the knockback duration increases per level, the knockback speed gets lower on each level. Therefore, the maximum knockback speed is 583.33\/500\/437.5\/388.89, while the minimum speed is 1.67\/1.43\/1.25\/1.11.","Can push units over impassable terrain. Any tree a knocked back unit collides with gets destroyed.","Units are not disabled during the knockback. They can still turn, attack and use items. Channeling items are not interrupted.","Does not affect Roshan.","Gust's blind added by the talent uses pseudo-random distribution."],"mana":"90","elements":["Does not pierce spell immunity."],"cooldown":"16\/15\/14\/13 ( 8\/7.5\/7\/6.5)","name":"Gust","description":["Cast Animation: 0.25+0.6","Cast Range: 900","Travel Distance: 900","Effect Radius: 250","Max Knockback Distance: 350","Miss Chance: 0% ( 50%)","Knockback Duration: 0.6\/0.7\/0.8\/0.9","Debuff Duration: 3\/4\/5\/6 ( 6\/7\/8\/9)"],"hot_key":"W","legacy_key":"E"},{"spell":"Adds bonus attack speed to allied, ranged Hero units based on a percentage of Drow's agility. Affects ranged creeps for 30 seconds when cast.","effects":["Ability No Target \/ Aura","Affects Allies"],"notes":["Interrupts Drow Ranger's channeling spells upon cast.","Only affects ranged units and illusions of ranged units. Does not affect wards or buildings.","Checks Drow Ranger's agility periodically and adapts the bonus attack speed instantly.","Activating Precision Aura simply makes the aura affect lane creeps and summons as well, instead of directly placing a new buff on them. This means that creeps summoned or spawned after the activation still get the bonus for the remaining duration.","The active aura persists through Drow Ranger's death; however, it does not provide the bonus while she is dead. This means that when reincarnating with Aegis of the Immortal, buying back, or respawning, the aura is bestowed for its remaining duration.","The buff lingers for 0.5 seconds. This goes for both the passive aura for heroes and the active aura for creeps.","Treats creep-heroes as creeps, so they are only affected when activating the aura."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"100 ( 50)","name":"Precision Aura","description":["Cast Animation: 0+0","Radius: Global","Agility as Ranged Attack Speed Bonus: 22%\/44%\/66%\/88% ( 47%\/69%\/91%\/113%)","Aura Linger Duration: 0.5","Active Duration: 30"],"hot_key":"E","legacy_key":"T"},{"spell":"Drow's experiences in battle grant her a chance to launch arrows with incredible accuracy and effectiveness. Pierces through the enemy's defenses, ignoring their base armor. Instantly kills creeps and deals bonus proc physical damage to heroes. This ability is disabled if there is an enemy hero within 400 range.","effects":["Ability Passive","Affects Self \/ Enemies","Damage Instant Kill ( Instant Attack)"],"notes":["An icy particle effect is visible on Drow Ranger while Marksmanship is active.","Checks for nearby enemy heroes (including invulnerable or hidden ones) in 0.1 second intervals and adapts the bonus accordingly.","Does not react on the presence of illusions or creep-heroes.","When proccing on heroes (including illusions and clones), creep-heroes, ancient creeps, or Roshan, the attack deals damage ignoring their main armor.","The attack also deals extra physical damage. The damage is dealt in one instance together with the attack damage, and counts as attack damage as well.","When proccing against other units, they get instantly killed instead. Cannot proc against wards or buildings.","Visually alters Drow Ranger's attack projectile when proccing. Does not have priority over Desolator's or Eye of Skadi's effects.","Proccing attacks have True Strike.","The Aghanim's Scepter upgrade requires Marksmanship to be learned and causes Drow Ranger to perform instant attacks on 2 random enemies around the primary target. This means the splinters are regular attacks, using Drow Ranger's 1250 projectile speed and being disjointable. It also means that they can proc any attack modifier or any on-hit effect like a regular attack. The splinters are only released if the primary attack successfully hits a target. This means missed or disjointed attacks do not release any splinters. If Drow Ranger is blinded, the splinters can miss, unless she has True Strike. They can also miss to evasion. The splinters originate from the primary target's location, not Drow Ranger's location. Since the splinters are independent attacks, their damage does not depend on how much damage the primary target took. The damage penalty only applies to the attack damage and any bonuses. Damage dealt in separate instances is unaffected (e.g. Maelstrom and Mjollnir). Attacks do not splinter to or from invisible, invulnerable, or hidden units. Attacks do not splinter to couriers, buildings, wards, or units in the Fog of War, but can splinter off of them to nearby valid targets. Splinter attacks are not disabled by being within 400 range of an enemy hero. Splinter attacks fully benefit from Marksmanship (when it procs), but splinter attacks never use the Marksmanship attack projectile visual.","While Frost Arrows are set to auto-cast, splintered attacks will attempt to activate Frost Arrows on successful splinter hits. The auto-cast check is performed when the splintered arrows successfully hit their targets. The splintered Frost Arrows still require mana to cast, and will not be applied if Drow does not have sufficient mana. Missed or disjointed splintered attacks will not attempt to apply Frost Arrows, thus spending no mana, and applying no slow. Splintered attacks will still try to apply Frost Arrows to Spell Immune units despite it not affecting them, effectively wasting mana."],"mana":"0","elements":["Partially usable by illusions.","Can be disjointed.","Partially disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Marksmanship","description":["Enemy Hero Search Radius: 400","Proc Chance: 20%\/30%\/40%","Proc Damage: 120\/130\/140","Splinter Search Radius: 0 ( 375)","Max Splinter Targets: 0 ( 2)","Splinter Damage Reduction: 0 ( 50%)"],"hot_key":"R","legacy_key":"P"}],"bio":"Drow Ranger's given name is Traxex--a name well suited to the short, trollish, rather repulsive Drow people. But Traxex herself is not a Drow. Her parents were travelers in a caravan set upon by bandits, whose noisy slaughter of innocents roused the ire of the quiet Drow people. After the battle settled, the Drow discovered a small girl-child hiding in the ruined wagons, and agreed she could not be abandoned. Even as child, Traxex showed herself naturally adept at the arts they prized: Stealth, silence, subtlety. In spirit, if not in physique, she might have been a Drow changeling, returned to her proper home. But as she grew, she towered above her family and came to think of herself as ugly. After all, her features were smooth and symmetrical, entirely devoid of warts and coarse whiskers. Estranged from her adopted tribe, she withdrew to live alone in the woods. Lost travelers who find their way from the forest sometimes speak of an impossibly beautiful Ranger who peered at them from deep among the trees, then vanished like a dream before they could approach. Lithe and stealthy, icy hot, she moves like mist in silence. That whispering you hear is her frozen arrows finding an enemy's heart.","talentsTips":["The all stats talent effectively grants Drow Ranger 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","The agility talent effectively grants Drow Ranger 2.24 armor, 14 attack speed, 0.7% movement speed and 14 attack damage.","The evasion talent stacks multiplicatively with other sources of evasion.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."],"trivia":["Traxex's original design was slightly different from the one now; aside from the same hood, her white hair was not present, and her eyes were completely white. Her outfit was also slightly more revealing.","From her transition to Dota 2, the name of her aura changed from \"Trueshot Aura\" to \"Precision Aura\".","Drow Ranger's response \"I quiver with anticipation.\" references a line in The Rocky Horror Picture Show \"I see you shiver with anticipation.\""],"talents":["50% Cooldown Reduction:+25% Precision Aura Attack Speed","+3s Gust Silence Duration:25% Evasion","+50% Gust Blind:+14 Agility","+5 All Stats:+20 Movement Speed"],"desc":"Drow Ranger 18 + 1.9 30 + 2.8 15 + 1.4 Level Base 1 15 25 Health 200 560 1080 1460 Health regen 0.25 2.05 4.71 6.61 Magic res. 25% 26.08% 27.68% 28.82% Mana 75 255 483 651 Mana regen 0 0.75 1.73 2.43 Spell dmg 0% 1.05% 2.42% 3.4% Armor -3 1.8 8.07 12.55 Att\/sec 0.59 0.76 1 1.16 Move sp amp. 0% 1.5% 3.46% 4.86% Damage 19‒30 49‒60 88‒99 116‒127 Movement speed 285 Attack speed 100 Turn rate 0.7 Vision range 1800\/800 Attack range 625 Projectile speed 1250 Attack animation 0.65+0.3 Base attack time 1.7 Collision size 24 Legs 2  Gib type Default"}