{"abilities":[{"spell":"Добавляет к атакам героя замораживающий эффект, замедляющий передвижение врага. Длится 1.5 секунды на героях и 7 секунд на крипах.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов"],"notes":["Замедление от нескольких попаданий не складывается, но с каждым попаданием отсчет до его окончания обновляется.","Считает крипов-героев за героев."],"mana":"12","elements":["Можно избежать.","Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Frost Arrows","description":["Дальность применения: 625","Замедление скорости передвижения: 16%\/32%\/48%\/64%","Длительность на героях: 1.5","Длительность на не-героях: 7"],"hot_key":"Q","legacy_key":"R"},{"spell":"Выпускает волну, которая отбрасывает вражеских существ и запрещает им колдовать. Чем ближе враг к вам, тем дальше его отбросит.","effects":["Способность Направленная на точку","Действует на Врагов"],"notes":["Волна распространяется со скоростью 2000, достигая максимальной дистанции за 0.45 ( 0.725) секунды.","Полное расстояние волны достигает до 1150 ( 1700) единиц (складывается из дистанции прохождения и радиуса).","Расстояние отбрасывания основывается на расстоянии между Drow Ranger и поражаемого врага. Чем ближе они к друг другу, тем дальше они отбросятся. Сильнее всего отбрасывание сработает, если расстояние между Drow Ranger и врагом будет в 1 единицу, тогда врага отбросит на 350 ( 900) единиц. Увеличение расстояния между Drow Ranger и врагом влияет на расстояние отбрасывания, уменьшаясь на 0.39 ( 0.62) единиц. Впрочем, значение отбрасывания сокращается, поэтому расстояние уменьшается на 1 за каждые 2–3 ( 1–2) единицы расстояния между Drow Ranger и врагом. Исходя из этого, минимальное расстояние отбрасывания равно 1 единице. При нахождении в той же самой точке, где находится Drow Ranger, никакого отбрасывания не будет, так как формула умножает на 0, поэтому дальность отбрасывания будет тоже равна 0.","Поскольку дистанция отбрасывания остается одной и той же с каждым уровнем, а длительность отбрасывания увеличивается, то скорость отбрасывания уменьшается с каждым уровнем. Следовательно, максимальная скорость отбрасывания равна 583.33\/500\/437.5\/388.89 ( 1500\/1285.71\/1125\/1000), а минимальная скорость - 1.67\/1.43\/1.25\/1.11.","Может толкать юнитов на непроходимую территорию. Любые деревья, стоящие на пути отброшенного юнита, разрушаются.","Юниты не обезвреживаются во время действия отбрасывания. Они могут использовать предметы, атаковать и поворачиваться. Применяемые предметы не прерываются.","Не работает на Рошана"],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/15\/14\/13 ( 8\/7.5\/7\/6.5)","name":"Gust","description":["Анимация применения: 0,25+0,6","Дальность применения: 900 ( 1450)","Дистанция прохождения: 900 ( 1450)","Радиус: 250","Дальность отбрасывания: 350 ( 900)","Длительность отбрасывания: 0.6\/0.7\/0.8\/0.9","Длительность безмолвия: 3\/4\/5\/6 ( 6\/7\/8\/9)"],"hot_key":"W","legacy_key":"E"},{"spell":"Увеличивает скорость атаки всех союзных героев дальнего боя, основываясь на ловкости владельца способности. Применение способности дарует этот бонус крипам дальнего боя на 30 секунд.","effects":["Способность Ненаправленная \/ Аура","Действует на Союзников"],"notes":["Использование прерывает произносимые способности Drow Ranger.","Дает эффект только юнитам дальнего боя. Не работает на варды и строения.","Периодически проверяет значения ловкости Drow Ranger и мгновенно адаптирует показатель дополнительной скорости атаки.","Активация Precision Aura не размещает баф на крипов на линии и призываемых существ, а сразу же на них воздействует.","То есть на крипов, призванных или появившихся после активации способности, аура продолжает действовать всю оставшееся время длительности.","Активированная аура остается после смерти Drow Ranger, но не дает бонус пока она мертва. Это значит, что при возрождении с помощью Aegis of the Immortal или при выкупе аура восстанавливает действие бонусного урона на оставшуюся длительность.","Баф задерживается на 0,5 секунды. Это распространяется как на пассивную ауру для героев, так и на активируемую ауру для крипов.","Считает крипов-героев за крипов, поэтому работает на них только в случае активации ауры."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"100 ( 50)","name":"Precision Aura","description":["Анимация применения: 0+0","Дальность: Глобальная","Доп. скорость атаки в дальнем бою от собств. ловкости: 20%\/40%\/60%\/80% ( 45%\/65%\/85%\/105%)","Длительность задержки ауры: 0,5","Длительность при активации: 30"],"hot_key":"E","legacy_key":"T"},{"spell":"Боевой опыт позволяет герою выпускать стрелы метче и эффективнее. С каждой атакой есть шанс выпустить стрелу, игнорирующую броню вражеских героев и мгновенно убивающую крипов. Бонус пропадает, если в радиусе 400 единиц есть вражеские герои.","effects":["Способность Пассивная","Действует на Себя \/ Врагов","Урон Физический"],"notes":["Ледяной эффект частиц виден вокруг Drow Ranger при активной Marksmanship.","Проверяет наличие поблизости вражеских героев (включая также неуязвимых или спрятанных) с интервалом в 0,1 секунду и мгновенно адаптирует соответствующий показатель.","Не реагирует на присутствие иллюзий и крипов-героев.","При срабатывании на героев (включая иллюзии и клонов), крипов-героев или Рошане атака игнорирует броню и наносит свой урон полностью. То есть, если значение брони цели отрицательное, то способность её игнорирует и атака наносит меньше урона, чем могла бы нанести. Атака также наносит дополнительный физический урон. Он наносится отдельным источником и считается за урон заклинания.","При срабатывании на остальных юнитов (включая древних крипов), способность мгновенно убивает цель. Не может сработать при атаке вардов или строений.","Сработавшая атака визуально отличается от обычной атаки Drow Ranger. У визуального эффекта атаки нет приоритета над эффектами Desolator или Eye of Skadi.","Сработавшая атака имеет эффект True Strike.","Улучшение от Aghanim's Scepter требует изученного Marksmanship и позволяет мгновенно атаковать 2 случайных врагов от основной цели. То есть, разделенные стрелы являются обычными атаками, использующие скорости полета снаряда Drow Ranger в 1250 единиц, которые можно избежать. На стрелы также может сработать (как и при обычной атаке) любой модификатор атаки или любой эффект, срабатывающий при атаке. Стрелы будут выпущены только в случае успешного попадания по цели первоначальной атаки; то есть атаки, которые промахнулись или их избежали, никаких стрел не выпустят. Если Drow Ranger ослеплена, стрелы могут промахнутся, за исключением наличия у героя точности. Они также могут промахнутся из-за уклонения. Стрелы исходят от расположения первичной цели, а не от Drow Ranger. Поскольку стрелы являются атаками, не зависящими от первичной атаки, их урон не зависит от того, сколько урона получила первичная цель. Снижение урона применяется только к урону от атаки и к любым бонуса. На урон, наносимый отдельными источниками, это не влияет (к примеру, срабатывание Maelstrom).","При использовании Frost Arrows вручную, она применяет замедление на разделенные стрелы. При этом, используя автоприменение, на стрелы замедление применяется только в случае включенного автоприменения на момент попадания стрел в цели. В любом случае (будь это ручное использование или автоприменение) Frost Arrows будет тратить ману при ударе по цели, а не при разделении стрел. При этом, мана будет тратиться только в случае успешного попадания разделенных стрел по целям. Промахнувшиеся атаки не будут тратить ману.","Разделенные стрелы не считают вторичными целями курьеров, строения и варды, но могут разделяться от них до ближайших подходящих целей.","Также полностью игнорируют невидимых, неуязвимых и спрятанных юнитов, как и юнитов в тумане войны."],"mana":"0","elements":["Может использоваться иллюзиями.","Частично отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Marksmanship","description":["Радиус отключения бонуса: 400","Шанс: 20%\/30%\/40%","Урон при срабатывании по герою: 120","Область действия: 0 ( 375)","Максимум доп. целей: 0 ( 2)","Уменьшение урона по дополнительным целям: 0 ( 50%)"],"hot_key":"R","legacy_key":"P"}],"bio":"Её назвали Траксекс — и такое имя отлично подходит представителю низкорослой, троллеподобной, не располагающей к себе расы дроу. Но Траксекс не из них. На караван её родителей-путешественников устроили засаду разбойники, и шумное убийство невинных навлекло гнев тихого народа дроу. Сразив головорезов, заступники заметили маленькую девочку, прячущуюся за обломками телег, и решили не бросать её на произвол судьбы. Уже ребёнком Траксекс показывала черты, что ценились у дроу: скрытность, безмолвность, ловкость. Душой, если не телом, она будто была подкидышем дроу, вернувшимся в отеческий дом. Но время шло, девочка росла, всё больше возвышаясь над остальными, и чувствовала себя уродиной. Неудивительно: черты её лица были гладкими и симметричными, лишёнными бородавок и жестких усов. Покинув приютившее её племя, она ушла в лес одиночкой. Заплутавшие странники, нашедшие выход из чащобы, иногда рассказывают о невероятно красивой девушке, наблюдавшей за ними из гущи леса и исчезнувшей как наваждение прежде, чем они могли приблизиться. Ловкая и скрытная, обжигающая как лёд, она двигается, словно туман в тишине. Ты услышишь лишь шёпот её стрел, находящих вражеские сердца.","talentsTips":[],"trivia":["Первоначальный внешний вид Drow Ranger немного отличался от существующего; вместе с таким же капюшоном, у нее не было белых волос, в то время как глаза были полностью белыми. Кроме того, её одежда была более откровенной.","При переносе в Dota 2, название ауры было изменено с \"Trueshot Aura\" на \"Precision Aura\"."],"talents":["-50% перезарядки способностей:+25% к скорости атаки от Precision Aura","+3 сек. действия Gust:+25% к уклонению","+550 к дальности действия\/отбрасывания Gust:+10 к ловкости","+5 ко всем атрибутам:+20 к скорости передвижения"],"tips":["Drow Ranger несмотря на мощные способности, слаба в защите.","Frost Arrows замедляет на достаточное время, чтобы Drow Ranger успела подбежать и выпустить вторую стрелу. В начале игры, этой способностью можно атаковать врага, не привлекая внимания крипов. Данный эффект сработает, если приказ атаковать стрелой был отдан вручную (нажав Q(по умолчанию) и указав на врага) — обязательно с выключенной авто-атакой."],"desc":"%"}