{"abilities":[{"spell":"Добавляет к атакам героя замораживающий эффект, замедляющий передвижение цели на 1,5 сек. и наносящий дополнительный урон.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Физический"],"notes":["Бонусный урон наносится вместе с уроном от атаки, и также считается уроном атаки.","Атаки сперва применяют дебафф, потом свой урон.","Замедление от нескольких попаданий не складывается, но с каждым попаданием отсчет до его окончания обновляется."],"mana":"12","elements":["Можно избежать.","Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Frost Arrows","description":["Дальность применения: 625","Урон: 5\/10\/15\/20","Замедление скорости передвижения: 16%\/32%\/48%\/64%","Длительность замедления: 1,5"],"hot_key":"Q","legacy_key":"R"},{"spell":"Выпускает волну, которая отбрасывает вражеских существ и запрещает им колдовать. Чем ближе враг к вам, тем дальше его отбросит.","effects":["Способность Направленная на точку","Действует на Врагов"],"notes":["Волна распространяется со скоростью 2000, достигая максимальной дистанции за 0.45 секунды.","Полное расстояние волны достигает до 1150 единиц (складывается из дистанции прохождения и радиуса).","Расстояние отбрасывания основывается на расстоянии между Drow Ranger и поражаемого врага. Чем ближе они к друг другу, тем дальше они отбросятся. Сильнее всего отбрасывание сработает, если расстояние между Drow Ranger и врагом будет в 1 единицу, тогда врага отбросит на 450 единиц. Увеличение расстояния между Drow Ranger и врагом влияет на расстояние отбрасывания, уменьшаясь на 0,5. Впрочем, значение отбрасывания сокращается, поэтому расстояние уменьшается на 1 за каждые 2–2 единицы расстояния между Drow Ranger и врагом. Исходя из этого, минимальное расстояние отбрасывания равно 1 единице. При нахождении в той же самой точке, где находится Drow Ranger, никакого отбрасывания не будет, так как формула умножает на 0, поэтому дальность отбрасывания будет тоже равна 0.","Поскольку дистанция отбрасывания остается одной и той же с каждым уровнем, а длительность отбрасывания увеличивается, то скорость отбрасывания уменьшается с каждым уровнем. Следовательно, максимальная скорость отбрасывания равна 750\/642,86\/562,5\/500, минимальная — 1,67\/1,43\/1,25\/1,11.","Может толкать существ на непроходимую территорию. Любые деревья, стоящие на пути отброшенного существа, разрушаются.","Существа не обезвреживаются во время действия отбрасывания. Они могут использовать предметы, атаковать и поворачиваться. Применяемые предметы не прерываются.","Не действует на Рошана.","Ослепление добавляемое к Gust талантом использует псевдослучайное распределение."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/15\/14\/13 ( 9,6\/9\/8,4\/7,8)","name":"Gust","description":["Анимация применения: 0,25+0,6","Дальность применения: 900","Дистанция прохождения: 900","Радиус эффекта: 250","Макс. дальность отбрасывания: 450","Шанс промаха: 0% ( 50%)","Длительность отбрасывания: 0.6\/0.7\/0.8\/0.9","Длительность дебаффа: 3\/4\/5\/6 ( 6\/7\/8\/9)"],"hot_key":"W","legacy_key":"E"},{"spell":"Герой выпускает один залп стрел за другим, нанося врагам больше урона и применяя на них усиленную способность Frost Arrows. Действует до 1.75 сек.","effects":["Способность Направленная на точку \/ Произносимая","Действует на Врагов","Урон Физический"],"notes":["Стрелы летят со скоростью в 1200, и пролетают всю дистанцию, или пока не попадут во врага.","Выпускает волны в интервале 0,55 секунды. Первая волна начинается через 0,1 секунды после начала произнесения. В волнах выпускаются стрелы с 0,033-секундной задержкой между ними (1 стрела за тик сервера), таки образом необходимо 0,1 секунд для выпуска всех стрел волны. Итоговая длительность выпуска всех стрел 1,3 секунд, что позволяет без потерь стрел отменять произнесение на последних 0,45 секундах.","Стрелы выпускаются конусом с центром перед Drow Ranger. Первая стрела в каждой волне всегда начинает с правой стороны от Drow Ranger. Угол конуса расчитывается для 6 стрел за волну. Если будет выпущено 6 стрел, угол конуса составит 50°. Однако, поскольку выпускается 4 стрел, угол конуса 33,33°, с углом в 8,33° между каждой стрелой. Учитывая стандартную дальность атаки Drow Ranger в 625, радиус конца конуса 358,5.","Враг может быть поражен лишь одной стрелой за волну, то есть врага может поразить 3 стрел за применение.","Не смотря на отображение, Multishot не использует мгновенные атаки. Стрелы наносят физический урон заклинаний, основанный на среднем основном уроне от атаки Drow Ranger (игнорируя бонусный урон). Это значит что стрелы не могут спровоцировать никакие модификаторы атаки или эффекты от атаки, но затрагиваются усилением урона от способностей и вампиризмом заклинаний.","Стрелы сперва применяют модификтор Frost Arrows, а потом урон.","Значения замедления основываются на уровне Frost Arrows, так что если она не изучена, дебафф не применяется. Применяется только дебафф. Бонусный урон от Frost Arrows не применяется.","Стрелы во время полёта дают летающий обзор в радиусе 100 вокруг них."],"mana":"50\/60\/70\/80","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"26\/24\/22\/20 ( 15,6\/14,4\/13,2\/12)","name":"Multishot","description":["Анимация применения: 0+0","Дальность применения: Глобальная","Множитель дальности атаки: 2","Угол конусности стрел: 50","Радиус столкновения стрел: 90","Макс. время произнесения: 1.75","Количество волн: 3","Стрел за волну: 4","Основного урона от атаки в урон: 90%\/115%\/140%\/165% ( 125%\/150%\/175%\/200%)","Длительность замедления от стрел: 1\/2\/3\/4"],"hot_key":"E","legacy_key":"T"},{"spell":"Опыт в бою позволяет герою стрелять метче и эффективнее. С каждой атакой есть вероятность выпустить стрелу, игнорирующую базовую броню врага. Также даёт герою и союзникам дальнего боя неподалёку дополнительную ловкость, зависящую от ловкости владельца. Способность не действует, если в радиусе 400 от её владельца есть вражеские герои.","effects":["Способность Пассивная","Действует на Себя \/ Врагов","Урон Физический ( Мгновенная атака)"],"notes":["Ледяной эффект частиц виден вокруг Drow Ranger при активной Marksmanship.","Проверяет наличие поблизости вражеских героев (включая также неуязвимых или спрятанных) с интервалом в 0,1 секунду и мгновенно адаптирует соответствующий показатель.","Не реагирует на присутствие иллюзий и крипов-героев.","Аура периодически проверяет ловкость Drow Ranger и мгновенно подстраивает бонус к ловкости.","Аура действует на неуязвимых, но не спрятанных союзников.","Эффект ауры задерживается на 0,5 секунды.","Атака также наносит дополнительный физический урон. Урон наносится отдельным источником, но считается как урон от атаки. Урон наносится вместе с уроном атаки, и также считается уроном от атаки. Он может работать с вампиризмом, но не с критами.","Сработавшая атака визуально отличается от обычной атаки Drow Ranger. У визуального эффекта атаки нет приоритета над эффектами Desolator или Eye of Skadi.","Сработавшая атака имеет эффект True Strike.","Улучшение от Aghanim's Scepter требует изученного Marksmanship и позволяет мгновенно атаковать случайных врагов от основной цели. То есть, разделенные стрелы являются обычными атаками, использующие скорости полета снаряда Drow Ranger в 1250 единиц, которые можно избежать. На стрелы также может сработать (как и при обычной атаке) любой модификатор атаки или любой эффект, срабатывающий при атаке (включая Marksmanship). Однако, разделённые атаки всегда используют стандартный вид снаряда атаки Drow Ranger. Стрелы будут выпущены только в случае успешного попадания по цели первоначальной атаки; то есть атаки, которые промахнулись или их избежали, никаких стрел не выпустят. Если Drow Ranger ослеплена, стрелы могут промахнутся, за исключением наличия у героя точности. Они также могут промахнутся из-за уклонения. Стрелы исходят от расположения первичной цели, а не от Drow Ranger. Поскольку стрелы являются атаками, не зависящими от первичной атаки, их урон не зависит от того, сколько урона получила первичная цель. Снижение урона применяется только к урону от атаки и к любым бонуса. На урон, наносимый отдельными источниками, это не влияет (к примеру, срабатывание Maelstrom). Атаки не разделяются на или от невидимых, неуязвимых или спрятанных существ. Атаки не разделяются на курьеров, строения и варды или существ в тумане войны, но могут разделяться от них до ближайших подходящих целей. Разделённые атаки не отключаются если в радиусе 400 находится вражеский герой.","При использовании Frost Arrows вручную, она применяет замедление на разделенные стрелы. При этом, используя автоприменение, на стрелы замедление применяется только в случае включенного автоприменения на момент попадания стрел в цели. В любом случае (будь это ручное использование или автоприменение) Frost Arrows будет тратить ману при ударе по цели, а не при разделении стрел. При этом, мана будет тратиться только в случае успешного попадания разделенных стрел по целям. Промахнувшиеся атаки не будут тратить ману."],"mana":"0","elements":["Частично используется иллюзиями.","Можно избежать.","Частично отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Marksmanship","description":["Радиус поиска вражеского героя: 400","Радиус ауры: 1200","Ловкости в бонус: 28%\/36%\/44%","Шанс срабатывания: 20%\/30%\/40% ( 35%\/45%\/55%)","Урон срабатывания: 70\/80\/90","Радиус поиска для разделённых стрел: 0 ( 375)","Максимум целей для разделённых стрел: 0 ( 2)","Уменьшение урона от разделённых стрел: 0 ( 50%)","Длительность задержки ауры: 0,5"],"hot_key":"R","legacy_key":"P"}],"bio":"Её назвали Траксекс — и такое имя отлично подходит представителю низкорослой, троллеподобной, не располагающей к себе расы дроу. Но Траксекс не из них. На караван её родителей-путешественников устроили засаду разбойники, и шумное убийство невинных навлекло гнев тихого народа дроу. Сразив головорезов, заступники заметили маленькую девочку, прячущуюся за обломками телег, и решили не бросать её на произвол судьбы. Уже ребёнком Траксекс показывала черты, что ценились у дроу: скрытность, безмолвность, ловкость. Душой, если не телом, она будто была подкидышем дроу, вернувшимся в отеческий дом. Но время шло, девочка росла, всё больше возвышаясь над остальными, и чувствовала себя уродиной. Неудивительно: черты её лица были гладкими и симметричными, лишёнными бородавок и жестких усов. Покинув приютившее её племя, она ушла в лес одиночкой. Заплутавшие странники, нашедшие выход из чащобы, иногда рассказывают о невероятно красивой девушке, наблюдавшей за ними из гущи леса и исчезнувшей как наваждение прежде, чем они могли приблизиться. Ловкая и скрытная, обжигающая как лёд, она двигается, словно туман в тишине. Ты услышишь лишь шёпот её стрел, находящих вражеские сердца.","talentsTips":["Талант на все атрибуты в общем даёт Drow Ranger: 100 здоровья, 0,5 усиления регенерации здоровья, 0,4% сопротивления магии, 0,8 брони, 5 скорости атаки, 0,25% скорости передвижения, 60 маны, 0,25 регенерации маны, 0,35% урона заклинаний и 5 урона от атаки.","Талант на ловкость в общем даёт Drow Ranger: 1,92 брони, 12 скорости атаки, 0,6% скорости передвижения и 12 урона от атаки."],"trivia":["Первоначальный внешний вид Drow Ranger немного отличался от существующего; вместе с таким же капюшоном, у нее не было белых волос, в то время как глаза были полностью белыми. Кроме того, её одежда была более откровенной.","При переносе в Dota 2, название ауры было изменено с \"Trueshot Aura\" на \"Precision Aura\"."],"talents":["-40% перезарядки способностей:+15% к шансу срабатывания Marksmanship","+3 сек. безмолвия от Gust:+35% к урону от Multishot","+50% к ослеплению от Gust:+12 к ловкости","+5 ко всем атрибутам:+20 к скорости передвижения"],"desc":"Траксекс, Drow Ranger — это герой дальнего боя с основной характеристикой ловкость. У Траксекс очень мощный фарм-потенциал. Уже в середине игры, получив необходимые предметы, Drow Ranger сможет наносить ощутимое количество урона, а к поздней игре от её рук будет умирать каждый. Благодаря пассивному ультимейту Marksmanship лучница получает шанс на атаку, которая не может промахнуться, игнорирует броню противника и даёт ловкость ближайшим союзникам. Не смотря на недостаток в заклинаниях для побега, Drow Ranger может держаться на безопасном расстоянии от вражеских заклинателей и героев ближнего боя используя Gust, Multishot, и её Frost Arrows. Frost Arrows зачаровывает её атаки льдом, сильно замедляя её врагов. Gust является замечательной контр-мерой против вражеских заклинателей как и героев ближнего боя, так как она отталкивает и запрещает произносить заклинания, которые могли бы навредить ей в драках. Multishot является отличной способностью для быстрого истребления нескольких врагов с большого расстояния (также применяя Frost Arrows). Позиционирование является первостепенно важным для Траксекс, которая очень уязвима и бонусы от её ультимейта исчезают в ближнем бою с врагом."}