{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1000 True Form and Spirit Bear Health",
          "talentRight": "-0.1 Spirit Bear Attack Time"
        },
        {
          "talentLvl": "20",
          "talentLeft": "0 Entangle Cooldown",
          "talentRight": "-50s True Form Cooldown"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+8 Spirit Bear Armor",
          "talentRight": "-10s Savage Roar Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+25 Spirit Bear Movement Speed",
          "talentRight": "+200 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/14\/Lone_Druid_Summon_Spirit_Bear.mp3\/revision\/latest?cb=20191216015759",
      "effects": [
        "Ability No Target",
        "Affects Self",
        "Damage Pure \/ Instant Kill"
      ],
      "notes": [
        "For all of the Spirit Bear's stats, see here.",
        "Spirit Bear is a creep-hero, making it interact differently with several spells. Click here for a detailed ability interactions.",
        "Click here for a detailed ability interactions.",
        "Leveling this ability automatically levels Spirit Bear's Demolish and Entangling Claws.",
        "The Spirit Bear levels up together with Lone Druid, gaining 5 attack damage and 90 health with each level. The bonuses are applied immediately, and do not require the Spirit Bear to be re-summoned. The attack damage bonus is added to the base attack damage, not as attack bonus damage.",
        "The bonuses are applied immediately, and do not require the Spirit Bear to be re-summoned.",
        "The attack damage bonus is added to the base attack damage, not as attack bonus damage.",
        "On the first cast of Summon Spirit Bear, the bear is actually summoned. On every following cast, it is just healed or revived. This means buffs and debuffs are not dispelled upon re-summoning it. Projectiles are not disjointed either.",
        "This means buffs and debuffs are not dispelled upon re-summoning it. Projectiles are not disjointed either.",
        "The backlash damage is dealt as pure damage from the unit that killed the Spirit Bear. Denying the Spirit Bear causes no damage, unless it is killed by neutral creeps.",
        "Denying the Spirit Bear causes no damage, unless it is killed by neutral creeps.",
        "The Spirit Bear cannot be re-summoned if it has taken damage from a player in the last 3 seconds. Has no minimum damage threshold. Damage is checked before any sort of reduction, so fully blocked damage also prevents re-summoning it. If the Spirit Bear dies, it can be re-summoned immediately.",
        "Damage is checked before any sort of reduction, so fully blocked damage also prevents re-summoning it.",
        "If the Spirit Bear dies, it can be re-summoned immediately.",
        "The Spirit Bear can use every item, except for placing Observer and Sentry Wards. It can also use runes, except for Illusion Rune. The Spirit Bear cannot have illusions of itself, therefore Manta Style do not spawn illusions of the bear. Hand of Midas grants Lone Druid the gold and experience when the Spirit Bear uses it.",
        "It can also use runes, except for Illusion Rune.",
        "The Spirit Bear cannot have illusions of itself, therefore Manta Style do not spawn illusions of the bear.",
        "Hand of Midas grants Lone Druid the gold and experience when the Spirit Bear uses it.",
        "When the Spirit Bear is 1100 range away from Lone Druid, it gets disarmed, turns slightly grey and uses different animations. The grey hue and disarm symbol are visible to allies only. The animations are visible to everyone. With Aghanim's Scepter, this restriction is removed, and allows Spirit Bear to attack at any range from Lone Druid, and to survive if Lone Druid dies.",
        "The grey hue and disarm symbol are visible to allies only. The animations are visible to everyone.",
        "With Aghanim's Scepter, this restriction is removed, and allows Spirit Bear to attack at any range from Lone Druid, and to survive if Lone Druid dies.",
        "Has a cast backswing of 0.57 while in True Form."
      ],
      "mana": "75",
      "hotKey": "Q",
      "cooldown": "120",
      "description": "Summons a powerful Spirit Bear companion that can equip items. If the bear moves 1100 distance away from the Lone Druid, it cannot attack. Lone Druid suffers 20% of his max health as backlash damage if the Spirit Bear dies. Spirit Bear does not benefit from attributes. Spirit Bear has the Return, Demolish, and Entangling Roots abilities.",
      "spellName": "Summon Spirit Bear",
      "params": [
        "Cast Animation: 0.5+0.63",
        "Max Health as Backlash Damage: 20%",
        "Attack Proximity Range: 1100 (TagTalent Global)",
        "Health Bonus per Level: 90",
        "Attack Damage Bonus per Level: 5",
        "Duration: Permanent",
        "Allows Spirit Bear to attack at any range from Lone Druid, and to survive if Lone Druid dies.",
        "Spell immunity does not block the pure backlash damage.",
        "Sylla's lifelong companion is symbiotic with his spirit and heart, coming to aid him in any time of need."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Sylla's lifelong companion is symbiotic with his spirit and heart, coming to aid him in any time of need."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Lone_Druid_Spirit_Link.mp3\/revision\/latest?cb=20191216015758",
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Uses lifesteal, but instead of healing the attacking Spirit Bear, it heals its owner instead. The lifesteal is affected by lifesteal amplification, but only if the amplification source is on Lone Druid.",
        "The lifesteal is affected by lifesteal amplification, but only if the amplification source is on Lone Druid.",
        "The visual effect upon leveling up only appears when the Spirit Bear is within 1500 range of Lone Druid.",
        "Spirit Link only affects the hero who has the ability, and Spirit Bear's owner. Other controlled units are not affected. This applies to Ability Draft as well."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Links Lone Druid and the Spirit Bear, increasing the attack speed of both and causing damage dealt by the Spirit Bear to heal Lone Druid.",
      "spellName": "Spirit Link",
      "params": [
        "Attack Speed Bonus: 15\/30\/45\/60",
        "Shared Lifesteal: 20%\/35%\/50%\/65%",
        "Lifesteal is disabled if Lone Druid is affected by Break. Attack speed is not disabled.",
        "Sylla is emboldened by the presence of his companion, his vitality replenished with each swipe of the Spirit Bear's claws."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Sylla is emboldened by the presence of his companion, his vitality replenished with each swipe of the Spirit Bear's claws."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Lone_Druid_Savage_Roar.mp3\/revision\/latest?cb=20191216015752",
      "effects": [
        "Ability No Target",
        "Affects Enemies (TagAghanim Allies)"
      ],
      "notes": [
        "Savage Roar is always cast by Lone Druid and the Spirit Bear simultaneously, no matter who was given the order. However, if the other would normally not be able to cast it (e.g. stunned or silenced), the effect does not occur. The current cooldown status is ignored and does not prevent the roar from triggering if still on cooldown. The cooldown always triggers, regardless of any status. With Aghanim's Shard, Savage Roar is always cast simultaneously regardless of current status effects on Lone Druid or Spirit Bear.",
        "However, if the other would normally not be able to cast it (e.g. stunned or silenced), the effect does not occur.",
        "The current cooldown status is ignored and does not prevent the roar from triggering if still on cooldown.",
        "The cooldown always triggers, regardless of any status.",
        "With Aghanim's Shard, Savage Roar is always cast simultaneously regardless of current status effects on Lone Druid or Spirit Bear.",
        "Applies fear on all hit enemies within the radius, forcing them to run towards their team's fountain, while preventing them from acting.",
        "Only affects enemy units controlled by a player. lane and neutral creeps are unaffected.",
        "The bonus attack speed and movement speed granted also affects the caster of Savage Roar.",
        "Shares cooldown with the Spirit Bear's Savage Roar.",
        "In Ability Draft, Savage Roar must be drafted as well for the Spirit Bear to gain it."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "38\/32\/26\/20 (TagTalent 28\/22\/16\/10)",
      "description": "Lone Druid and the Spirit Bear roar fiercely causing nearby enemies to flee towards their base in terror. Their movement speed is increased by 1.4\/1.8\/2.2\/2.6.",
      "spellName": "Savage Roar",
      "params": [
        "Cast Animation: 0.1+0.57",
        "Enemy Radius: 375",
        "Enemy Move Speed Bonus: 20%",
        "Enemy Duration: 1.4\/1.8\/2.2\/2.6",
        "Ally Radius: 700",
        "Ally Move Speed Bonus: 20%",
        "Ally Attack Speed Bonus: 60",
        "Ally Duration: 5",
        "Savage Roar now empowers allies in 700 AoE with +20% Movement Speed and +60 Attack Speed for 5 seconds. Also applies a basic dispel on Lone Druid and the Spirit Bear on cast, and causes the roar to happen on both locations regardless of the casting state on the other side.",
        "Does not affect spell immune enemies. Debuff persists if debuff was placed before spell immunity and when not dispelled. Fully affects spell immune allies.",
        "Sylla studies and masters the arts of the lost Bear Clan, enhancing his attunement with the wild."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Sylla studies and masters the arts of the lost Bear Clan, enhancing his attunement with the wild."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/28\/Lone_Druid_True_Form.mp3\/revision\/latest?cb=20191216015802",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "During the transformation, Lone Druid cannot do anything. Cannot be interrupted.",
        "Reduces Lone Druid's attack range to 225 while giving him melee attack properties. This means items treat him as a melee hero (e.g. Manta Style, Skull Basher, etc).",
        "This means items treat him as a melee hero (e.g. Manta Style, Skull Basher, etc).",
        "Lone Druid gets his maximum and current health increased by the given value. This does not count as a heal. Upon losing the buff, his current health stays the same and only the maximum health bonus gets reverted. The maximum health increasing talent does not upgrade the current active True Form instance, but it instantly upgrades Spirit Bear's health.",
        "Upon losing the buff, his current health stays the same and only the maximum health bonus gets reverted.",
        "The maximum health increasing talent does not upgrade the current active True Form instance, but it instantly upgrades Spirit Bear's health.",
        "While active, Lone Druid gains Demolish and Entangling Claws, based on the same level as the Spirit Bear's abilities.",
        "True Form persists through Lone Druid's death. If he dies during it, he respawns in True Form.",
        "Changes Lone Druid's model and alters his voice."
      ],
      "mana": "200",
      "hotKey": "R",
      "cooldown": "100 (TagTalent 50)",
      "description": "Lone Druid learns to morph himself into a raging bear, losing his ranged advantage, but gaining increased resistance, Entangling Roots and Demolish.",
      "spellName": "True Form",
      "params": [
        "Cast Animation: 0+0",
        "Transformation Time: 1.933",
        "Armor Bonus: 8\/10\/12",
        "Health Bonus: 500\/1000\/1500 (TagTalent 1500\/2000\/2500)",
        "Attack Range Loss: 325",
        "Duration: 40",
        "Illusions get their own True Form buff lasting its regular duration.",
        "The mighty bear is the king of the forest, possessing the throne through raw power."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "The mighty bear is the king of the forest, possessing the throne through raw power."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3a\/Spirit_Bear_Return.mp3\/revision\/latest?cb=20191216015757",
      "effects": [
        "Ability No Target \/ Channeled",
        "Affects Self"
      ],
      "notes": [
        "Disjoints projectiles upon teleporting.",
        "Can be cast from anywhere on the map.",
        "Issues a stop order to the Spirit Bear after teleporting.",
        "If Lone Druid dies and Return is cast, the Spirit Bear teleports back to Lone Druid's death location."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Channels for 3 seconds and then teleports the Spirit Bear back to the Lone Druid.",
      "spellName": "Return",
      "params": [
        "Cast Animation: 0+0",
        "Channel Time: 3",
        "Prevents casting Return. If already channeling, root does not interrupt it."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "This ability automatically levels up together with Summon Spirit Bear.",
        "The magic resistance stacks multiplicatively with other sources of magic resistance. Increases the Spirit Bear's total magic resistance to 33%.",
        "Increases the Spirit Bear's total magic resistance to 33%.",
        "Increases the Spirit Bear's total attack damage against buildings, including raw damage bonuses.",
        "While True Form is active, Lone Druid gains the current level of Demolish."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Increases the power of the Spirit Bear, causing it to deal more damage to buildings and have additional spell resistance.",
      "spellName": "Demolish",
      "params": [
        "Magic Resistance Bonus: 33%",
        "Building Attack Damage Bonus: 10%\/20%\/30%\/40%"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Lone_Druid_Savage_Roar.mp3\/revision\/latest?cb=20191216015752",
      "effects": [
        "Ability No Target",
        "Affects Enemies (TagAghanim Allies)"
      ],
      "notes": [
        "Same notes as for Lone Druid's Savage Roar apply.",
        "Spirit Bear acquires this ability as soon as Lone Druid learns it.",
        "Causes both Lone Druid and the Spirit Bear to cast Savage Roar at the same time and puts both Savage Roars on cooldown, regardless of who cast the ability."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "38\/32\/26\/20 (TagTalent 28\/22\/16\/10)",
      "description": "Lone Druid and the Spirit Bear roar fiercely causing nearby enemies to flee towards their base in terror. Their movement speed is increased by 1.4\/1.8\/2.2\/2.6.",
      "spellName": "Savage Roar",
      "params": [
        "Cast Animation: 0.1+0.64",
        "Enemy Radius: 375",
        "Enemy Move Speed Bonus: 20%",
        "Enemy Duration: 1.4\/1.8\/2.2\/2.6",
        "Ally Radius: 700",
        "Ally Move Speed Bonus: 20%",
        "Ally Attack Speed Bonus: 60",
        "Ally Duration: 5",
        "Does not affect spell immune enemies. Debuff persists if debuff was placed before spell immunity and when not dispelled. Fully affects spell immune allies."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f4\/Spirit_Bear_Entangling_Claws.mp3\/revision\/latest?cb=20191216015754",
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "This ability automatically levels up together with Summon Spirit Bear.",
        "Roots the target, preventing it from moving and casting certain mobility spells. Provides True Sight over the target.",
        "Provides True Sight over the target.",
        "The proccing attack first applies the debuff, then its own damage.",
        "Deals 15 damage in 0.25 second intervals, starting 0.25 seconds after the debuff is placed, resulting in 3\/6\/9\/12 instances.",
        "Deals a total of 45\/90\/135\/180 damage (before reductions).",
        "Does not affect ancient creeps.",
        "Entangling Claws uses pseudo-random distribution.",
        "While True Form is active, Lone Druid gains the current level of Entangling Claws."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Attacks have a chance to cause roots to burst from the ground, immobilizing the attacked enemy unit, and dealing damage per second.",
      "spellName": "Entangling Claws",
      "params": [
        "Proc Chance: 20%",
        "Damage per Second: 60",
        "Hero Duration: 0.75\/1.5\/2.25\/3"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 18.0,
    "attrIntelligence": 13.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.8,
    "attrAgility": 20.0
  },
  "description": "Sylla, the Lone Druid, is an adaptable and versatile ranged or melee agility hero, who summons a Spirit Bear, which has its own set of abilities and can equip items, as his ally. With the help of his Spirit Bear, he can carry, jungle, and push lanes effectively. Because of this, technically speaking, the Spirit Bear and Lone Druid himself are two available heroes at once. The Lone Druid himself is mostly played as the aura giver, while the Spirit Bear is played as the main damage dealer and tank. When he activates his abilities, it will not only buff him but the Spirit Bear as well. Lone Druid is versatile as he can change from a fast ranged warrior to a tough and mighty melee bear himself. Together, they can push lanes and towers quickly, farm neutrals in a cinch, and even take down Roshan by themselves if equipped with the right items. Due to the Spirit Bear not benefiting from attributes, it scales weakly into the later portions of the game, encouraging a midgame-oriented playstyle. However, should the need arise, its six extra usable item slots make Lone Druid a force to be reckoned with far into the lategame.",
  "history": "Long before the first words of the first histories there rose the druidic Bear Clan. Wise and just they were, and focused in their ways to seek an understanding of the natural order. The arch forces of nature saw this, and so sought the most learned among them. Wise old Sylla, clan justiciar and seer, stepped forward for his kin, and to him was given the Seed with these words: 'When all of the world has dimmed, when civilization has left these lands, when the world is slain and wracked by the endless deserts at the end of ages, plant the Seed.' As he grasped his trust, Sylla felt his years recede and his vitality returned. Vast knowledge burst into his mind. He found himself able to project his very will into reality and, with some concentration, alter his own physical form as well. Yet subtle whispers and cruel ears brought word of the Seed and its power to other peoples, and a terrible war crashed upon the Bear Clan. As his ancestral home burned, Sylla took his burden and fled to the wild places. Ages passed, and time and myth forgot the Bear Clan, forgot Sylla and the Seed, forgot wondrous civilizations that rose and fell in Bear Clan's wake. For millenia Sylla has waited, waited for word from his deities, waited for peace to come to the ever warring realms, waited in exile and in secret for the end of all things and for the conclusion of his sacred commitment, preparing himself always to face and destroy whatever would dare threaten his purpose.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1000 True Form and Spirit Bear Health",
      "talentRight": "-0.1 Spirit Bear Attack Time"
    },
    {
      "talentLvl": "20",
      "talentLeft": "0 Entangle Cooldown",
      "talentRight": "-50s True Form Cooldown"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+8 Spirit Bear Armor",
      "talentRight": "-10s Savage Roar Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+25 Spirit Bear Movement Speed",
      "talentRight": "+200 Health"
    }
  ]
}