{"abilities":[{"spell":"Puts the target enemy or friendly Hero to sleep. Sleeping units are awakened when damaged. If the target was directly attacked, the Nightmare passes to the attacking unit. Bane can attack nightmared targets freely.","effects":["Ability Target Unit","Affects Enemies \/ Allies"],"notes":["Applies a sleep on affected units, preventing them from acting.","Nightmare turns affected targets invulnerable for 1 second, preventing affected units from waking up.","Nightmare reduces affected enemy unit's vision to 200.","The target wakes up when a unit starts attacking it (including manual casting of active attack modifiers), or when the target takes damage.","The target does not wake up when taking damage from certain sources and under a few rare conditions: Damage dealt by Sleight of Fist, Side Gunner, or Stifling Dagger. Any damage from active attack modifiers, be it a debuff (e.g. Burning Spear), or direct damage (e.g. Tidebringer). Any damage from already launched ranged attacks if the projectiles hit after the invulnerability period.","When waking up with an attack, the Nightmare is transferred to the attacking unit at the start of an attack, not when the attack hits.","When Nightmare is transferred, its duration is refreshed, including the 1 second invulnerability.","The Nightmare cannot be transferred to spell immune units, or to wards and buildings. So their attacks only wake up nightmared units.","Bane and all illusions of Bane can attack nightmared units without waking the target up, and without the Nightmare transfering to them.","Nightmared units are never automatically attacked, regardless of settings. A forced attack order is required to attack them. This prevents enemies from accidentally afflicting themselves with Nightmare by auto-attacking a nightmared unit. This also means that nightmared units are never attacked by lane creeps, neutral creeps, towers and fountains. Units can force an attack on an allied nightmared unit to transfer the Nightmare to themselves.","As long as a unit is affected by Nightmare from Bane, Nightmare is replaced by a sub-ability which allows Bane to wake the unit up.","Nightmare's invulnerability status effect uses the default invulnerability icon, instead of its own ability icon."],"mana":"165","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"22\/19\/16\/13","name":"Nightmare","description":["Cast Animation: 0.4+0.57","Cast Range: 425\/500\/575\/650 ( 525\/600\/675\/750)","Sleep Duration: 4\/5\/6\/7","Invulnerability Duration: 1"],"hot_key":"Q","legacy_key":"T"},{"spell":"Ends all ongoing Nightmares.","effects":["Ability Toggle"],"notes":["Replaces Nightmare until there is no Nightmare debuff from Bane active.","Can wake a unit up at any time during a Nightmare, even during the 1 second invulnerability.","Wakes up all units which were put asleep by Nightmare, no matter who put them asleep.","Can be used while stunned, cycloned, slept, taunted, hidden, or during Forced Movement.","Cannot be used while silenced, hexed or prevented from acting. Cannot be shift-queued."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Nightmare End","description":["Cast Animation: 0+0"],"hot_key":"Q","legacy_key":"T"},{"spell":"Feasts on the vital energies of an enemy unit, healing Bane and dealing damage.","effects":["Ability Target Unit","Affects Enemies \/ Self","Damage Magical"],"notes":["Deals damage before it heals.","Heals for the same the amount of damage dealt. This means it heals less if damage is reduced.","Despite the visual effects, the heal and damage happen simultaneously."],"mana":"90\/115\/140\/165","elements":["Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"14\/13\/12\/11 ( 1.5)","name":"Brain Sap","description":["Cast Animation: 0.4+0.57 ( 0.2+0.77)","Cast Range: 600 ( 700)","Damage: 100\/200\/300\/400 ( 350\/450\/550\/650)","Heal: 100\/200\/300\/400 ( 350\/450\/550\/650)"],"hot_key":"W","legacy_key":"B"},{"spell":"Applies Enfeeble targets that you cast an ability on, lowering the unit's magic and status resistances.","effects":["Ability Passive","Affects Enemies"],"notes":["Successive applications of Enfeeble on the same target do not stack, only the debuff gets refreshed and updated to the current level. Due to the status resistance reduction effect, refreshing the debuff will result in a longer duration of the debuff than usual.","Enfeeble debuff is placed on the enemy before the effect of the spell that placed it. Treats creep-heroes as heroes."],"mana":"0","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"0","name":"Enfeeble","description":["Status Resistance Reduction: 15%\/20%\/25%\/30%","Magic Resistance Reduction: 4%\/8%\/12%\/16%","Duration: 8"],"hot_key":"E","legacy_key":"E"},{"spell":"Grips an enemy unit, disabling it and causing heavy damage over time, while stealing mana every 0.5 second based on the unit's maximum mana.","effects":["Ability Target Unit \/ Channeled","Affects Enemies \/ Self","Damage Magical"],"notes":["Fiend's Grip fully disables the target as long as it is channeled.","Provides True Sight over the target until the channeling ends.","If the target turns invulnerable or hidden, the channeling stops instantly.","Deals 50\/77.5\/107.5 damage and drains 2.5% mana in 0.5 second intervals, starting immediately as the channeling begins, resulting in up to 12 ( 26) instances.","Can deal up to 600\/930\/1290 ( 1300\/2015\/2795) damage (before reductions).","Can drain up to 30% ( 65%) of the target's maximum mana.","Applies the damage first on each tick, and then the mana loss.","Choosing the duration increasing talent does not affect Bane's currently active Fiend's Grip instance.","Unlike other targeted spells, the caster vision of Fiend's Grip lasts for the entire channel duration (even if it gets canceled), instead of just 2 seconds."],"mana":"200\/300\/400","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"120\/110\/100","name":"Fiend's Grip","description":["Cast Animation: 0.4+0","Cast Range: 625 ( 725)","Max Channel Time: 6 ( 13)","Damage per Second: 100\/155\/215","Max Mana Drain per Second: 5%"],"hot_key":"R","legacy_key":"F"}],"bio":"When the gods have nightmares, it is Bane Elemental who brings them. Also known as Atropos, Bane was born from the midnight terrors of the goddess Nyctasha. A force of terror too powerful to be contained by sleep, he surfaced from her slumbers, fed upon her immortality, and stole his vaporous form from her inky blood. He is the essence of fear. Mortals who hear his voice hear their darkest secrets whispered in their ear. He calls to the hidden fear in every Hero's heart. Wakefulness is no protection, for Bane's black blood, continuously dripping, is a tar that traps his enemies in nightmare. In the presence of Bane, every Hero remembers to fear the dark.","talentsTips":["The armor talent does not benefit illusions.","The spell lifesteal talent stacks additively with other sources of spell lifesteal.","The spell lifesteal talent heals for 4% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions."],"trivia":["The origin of the name \"Atropos\" comes from Greek mythology. One of the Moirai Sisters (commonly referred to as the Sisters of Fate), Atropos was the sister in charge of cutting the \"Life Thread\" of those who were going to die. Her name literally means 'the no-Turning One' (> α 'no, without' + τρέπειν 'to turn'), referring to the irreversible and inevitable destiny of death.","Bane's rival line towards Tinker \"Do Tinkers dream of electric sheepsticks?\" is a reference to the book Do Androids Dream of Electric Sheep?. \"Sheepstick\" is also a commonly used name for the Scythe of Vyse.","The theme and abilities of Bane are based on the game Tactics Ogre: The Knight of Lodis. In this game, there is a Bane \"element\" which provides spells that are named Enfeeble, Brain Sap, Nightmare and Fiend's Grip, with a similar theme of Bane in Dota 2.","Bane's move line \"Sleep no more!\" is a reference to Shakespeare's play Hamlet, in particular, his famous \"To be or not to be\" soliloquy. Hamlet reasons over whether to take his own life or carry on: \"To die, to sleep-. No more-and by a sleep we say to end...\"","Fiend's Grip sound effect makes use of one of Bane's lines (\" The bane of your existence\").","Bane's Last hit Response \" The wages of fear\" is a reference to the film of the same name.","Bane is the only hero in Dota that has equally both base and growth value on all 3 attributes, even some general attributes value adjustments have been made on other heros through different versions, only Bane still keeps this peculiarity in every version, intentionally."],"talents":["+7s Fiend's Grip Duration:+250 Brain Sap Damage\/Heal","+50 Movement Speed:20% Spell Lifesteal","+40% XP Gain:+8% Spell Amplification","+100 Cast Range:+7 Armor"],"desc":"Bane 23 + 2.6 23 + 2.6 23 + 2.6 Level Base 1 15 25 Health 200 660 1380 1900 Health regen 0 2.3 5.94 8.54 Magic res. 25% 26.38% 28.56% 30.12% Mana 75 351 783 1095 Mana regen 0 1.15 2.97 4.27 Spell dmg 0% 1.61% 4.16% 5.98% Armor 1 4.68 10.5 14.66 Att\/sec 0.59 0.72 0.94 1.09 Move sp amp. 0% 1.15% 2.97% 4.27% Damage 35‒41 58‒64 94‒100 120‒126 Movement speed 305 Attack speed 100 Turn rate 0.6 Vision range 1800\/800 Attack range 400 Projectile speed 900 Attack animation 0.3+0.7 Base attack time 1.7 Damage block 0 Collision size 24 Legs 4  Gib type Ethereal"}