{
  "abilities": [
    {
      "spell": "Снижает скорость атаки врага и его сопротивление эффектам.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Несколько применений Enfeeble на одну и ту же цель не складываются, но обновляют длительность дебаффа и улучшают его до текущего уровня способности.",
        "Считает крипов-героев за героев, поэтому также можно на них применить.",
        "Выбор таланта на кражу скорости атаки с помощью Enfeeble не увеличивает скорость атаки Bane от целей, на которых уже действует Enfeeble. Талант дает новый бафф на врагов, находящихся под действием Enfeeble. То есть, Bane может быть под действием сразу нескольких эффектов за каждого врага, на которого действует Enfeeble. При повторном использовании на врага Bane не получает новый бафф, но обновляет время его действия на врага. Действие баффа не зависит от цели дебаффа. Поэтому при смерти цели у Bane сохраняется действие дополнительного урона от баффа.",
        "Выбор таланта на увеличение снижения скорости атаки не обновляет уже действующие дебаффы от Enfeeble."
      ],
      "mana": "70\/90\/110\/130",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "12\/10\/8\/6",
      "name": "Enfeeble",
      "description": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 1000 ( 1100)",
        "Уменьшение сопротивления эффектам: 36%\/44%\/52%\/60%",
        "Замедление атаки: 40\/60\/80\/100 ( 140\/160\/180\/200)",
        "Длительность: 8"
      ],
      "hot_key": "Q",
      "legacy_key": "E"
    },
    {
      "spell": "Высасывает жизненную энергию врага, нанося ему урон и восстанавливая здоровье героя.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов \/ Себя",
        "Урон Чистый"
      ],
      "notes": [
        "Наносит урон до лечения.",
        "Bane всегда получает максимально возможное количество здоровья вне зависимости от нанесенного урона.",
        "Несмотря на визуальный эффект, лечение и урон проходят одновременно."
      ],
      "mana": "90\/115\/140\/165",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "14\/13\/12\/11 ( 1,5)",
      "name": "Brain Sap",
      "description": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: 600 ( 700)",
        "Урон: 75\/150\/225\/300 ( 325\/400\/475\/550)",
        "Лечение: 90\/160\/230\/300 ( 340\/410\/480\/550)"
      ],
      "hot_key": "W",
      "legacy_key": "B"
    },
    {
      "spell": "Погружает вражеского или союзного героя в сон. Атака пробуждает спящее существо, но эффект передаётся атакующему. Владелец способности может беспрепятственно атаковать спящие цели.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Применяет сон на затронутых юнитов, не давая им действовать.",
        "Nightmare дает цели эффект неуязвимости на одну секунду, предотвращая пробуждение затронутого юнита.",
        "Nightmare снижает обзор вражеских юнитов до нуля, им остается видна лишь их модель.",
        "Цель пробудится при атаке юнитов по ней (включая ручное использование активных модификаторов атаки) или при получении урона.",
        "Цель не проснется при получении урона от определенных источников и в нескольких редких состояниях: Урон получен от Sleight of Fist, Boundless Strike, улучшенный Assassinate, Автоматическая турель, Stifling Dagger или Swashbuckle. Любая атака от активного модификатора атаки, который действует как дебафф (например, Burning Spear) или атака по области (например, Tidebringer). Любой урон, полученный от уже запущенной дальней атаки, если снаряд ударил после момента неуязвимости.",
        "При пробуждении от атаки Nightmare переходит на атакующего юнита при начале атаки, а не при попадании атаки.",
        "Переход Nightmare на новую цель обновляет длительность способности, включая секундную неуязвимость.",
        "Nightmare не может перейти на неуязвимого к магии юнита, варды и строения; их атаки только пробудят цель.",
        "Bane может атаковать юнитов под действием Nightmare как обычно, без перехода Nightmare на себя или пробуждения цели.",
        "Юниты под Nightmare никогда не считаются целью авто-атаки, независимо от настроек. Для атаки по ним требуется дать команду на принудительную атаку. Это предотвращает случайный переход Nightmare на себя же при авто-атаке вражеского юнита под действием Nightmare. Также юниты под действием Nightmare не считаются целью для крипов на линии, нейтральных крипов, башен и фонтана. Юниты могут применить атаку на союзного юнита под Nightmare, чтобы перенести способность на себя.",
        "При каждом действии Nightmare на юнитов у Bane появляется дополнительная способность, которая может разбудить юнитов.",
        "Статус неуязвимость от Nightmare отображается стандартной иконкой неуязвимости, а не иконкой способности."
      ],
      "mana": "165",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "22\/19\/16\/13",
      "name": "Nightmare",
      "description": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: 425\/500\/575\/650 ( 525\/600\/675\/750)",
        "Длительность сна: 4\/5\/6\/7",
        "Длительность неуязвимости: 1"
      ],
      "hot_key": "E",
      "legacy_key": "T"
    },
    {
      "spell": "Заканчивает действие всех Nightmare.",
      "effects": [
        "Способность Переключаемая"
      ],
      "notes": [
        "Заменяет Nightmare, пока не закончится дебафф от способности Bane.",
        "Может пробудить в любой момент действия Nightmare, даже в секунду неуязвимости.",
        "Пробуждает всех юнитов, которые были усыплены Bane.",
        "Можно использовать при оглушении, урагане, провокации, исчезновении или при принудительном движении.",
        "Нельзя использовать при безмолвии, проклятии или в обезвреженном состоянии . Нельзя поставить в очередь действий."
      ],
      "mana": "0",
      "elements": [
        "Не провоцирует эффекты своим применением."
      ],
      "cooldown": "0",
      "name": "Nightmare End",
      "description": [
        "Анимация применения: 0+0"
      ],
      "hot_key": "E",
      "legacy_key": "T"
    },
    {
      "spell": "захватывает врага, оглушая его и нанося большой периодический урон. Также жертва каждые 0,5 сек. теряет долю от максимального запаса маны, передавая её владельцу способности.",
      "effects": [
        "Способность Направленная на юнита \/ Произносимая",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Fiend's Grip полностью обезвреживает цель на все время чтения способности.",
        "Дает эффект True Sight на цель, пока применяется способность.",
        "Наносит 50\/77.5\/107.5 единиц урона и вытягивает 2.5% маны с интервалом в 0,5 секунды, начиная с начала применения способности, срабатывая 10 ( 24) раза.",
        "Может нанести до 500\/775\/1075 ( 1200\/1860\/2580) единиц урона (до учета сопротивления).",
        "Может вытянуть до 25% ( 60%) максимального запаса маны.",
        "С каждым тиком наносит сначала урон, а затем вытягивает ману.",
        "Выбор таланта на длительность Fiend's Grip не увеличивает длительность уже применяемой способности."
      ],
      "mana": "200\/300\/400",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "120\/110\/100",
      "name": "Fiend's Grip",
      "description": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 625 ( 725)",
        "Макс. длительность: 5 ( 12)",
        "Урон в секунду: 100\/155\/215",
        "Маны в секунду: 5%"
      ],
      "hot_key": "R",
      "legacy_key": "F"
    }
  ],
  "bio": "Когда самим богам снятся кошмарные сны, их приносит сам неудержимый элементаль кошмаров Bane. Иное имя ему — Атропос, и родом он из ночных кошмаров богини Никташи. Сила ее невыразимых страхов была столь велика, что из нее родился Bane — вырвавшись из снов богини, он поглотил ее бессмертие и сотворил себе форму из ее маслянистой крови. Он — сосредоточение страха. Смертным, что слышат его голос, он шепчет их самые сокровенные мрачные тайны. Атропос взывает к глубочайшим фобиям, засевшим в сердцах других героев. И даже бодрствование не спасет жертву, ибо вечно капающая с призрачной формы элементаля черная кровь заставляет врагов увязнуть в кошмарной дреме, будто в смоле. Когда Bane парит над полем боя, любой герой начинает бояться темноты.",
  "talentsTips": [
    "Талант на броню не дается иллюзиям."
  ],
  "trivia": [
    "Истоки имени \"Atropos\" происходят из греческой мифологии. Одна из сестер Мойр (их часто называют богинями судеб), Атропа была сестрой, отвечающей за перерезание \"нити жизни\", тех кто умирал. Её имя буквально обозначает \"неотвратимая\", ссылаясь на неотвратимость и неумолимость смерти.",
    "Реплика при убийстве Tinker Играть \"Do Tinkers dream of electric sheepsticks?\" является отсылкой к книге Филиппа Киндред Дика: \"Снятся ли андроидам электроовцы?\".",
    "Тематика и способности Bane основаны на игре Tactics Ogre: The Knight of Lodis. В этой игре, существует \"элемент\" Bane, который имеет заклинания под названиями: Enfeeble, Brain Sap, Nightmare и Fiend's Grip, с похожей на Bane тематикой из Dota 2.",
    "Реплика при перемещении Играть \"Sleep no more!\"(с англ. Не спите больше!) - это отсылка к пьесе Шекспира \"Макбет\". Призрак Банко преследует Макбета и постоянно произносит \"Не спите больше!\".",
    "Звук Fiend's Grip - это одна из фраз Bane (Играть \"The bane of your existence\").",
    "Реплика при добивании Играть \"The wages of fear\" - это отсылка к фильму с таким же названием.",
    "Bane - единственный герой, у которого все характеристики имеют одинаковый прирост и начальное значение. В обновлении 7.06 всем героям подняли прирост силы на 0.3, Bane же получил в дополнение +0.3 ловкости и интеллекта."
  ],
  "talents": [
    "+7 сек. к длительности Fiend's Grip:+250 к урону\/лечению от Brain Sap",
    "+50 к скорости передвижения:+100 к замедлению атаки от Enfeeble",
    "+40% к получаемому опыту:Enfeeble крадет крадёт скорость атаки",
    "+100 к дальности способностей:+6 к броне"
  ],
  "tips": [
    "В массовых боях, применяйте Nightmare на того противника, который сможет сбивать применяемые заклинания (например тех, кто способен оглушать), а Fiend's Grip - на того, кого в первую очередь необходимо убить.",
    "Enfeeble очень сильно снижает урон вражеского героя. В теории она может понизить урон до нуля. Не забывайте применять эту способность.",
    "Имея низкое количество здоровья, вы можете мгновенно восстановить применив Brain Sap. Используя весь потенциал способностей, герой способен разобраться практически с любым противником на ранней и средней стадиях игры."
  ],
  "desc": "Bane — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Enfeeble, ослабляет врага, снижая его скорость атаки и сопротивление эффектам. Вторая способность, Brain Sap, высасывает жизненную энергию врага, нанося ему урон и восстанавливая здоровье Bane. Третья способность, Nightmare, погружает вражеского или дружественного героя в кошмарный сон, в котором тот получает урон каждую секунду. Если уснувший герой подвергнется атаке, он проснется, а атаковавший его юнит погрузится в сон вместо него. Спящая цель мгновенно просыпается при получении урона. Сон можно снять подспособностью Nightmare End. Ультимативная способность, Fiend's Grip, захватывает врага, в результате чего он застывает на месте и получает большой урон. Также из жертвы высасывается мана (количество зависит от ее максимального числа)."
}