{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+3 сек. к продолжительности Kinetic Field",
          "talentRight": "-8 сек. перезарядки Glimpse"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+3 удара у Thunder Strike",
          "talentRight": "Kinetic Field раскрывает невидимость"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1,5 к длительности Static Storm",
          "talentRight": "+125 к дальности заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+30 к урону от Thunder Strike",
          "talentRight": "-3 сек. перезарядки Kinetic Field"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Thunder_Strike.mp3\/revision\/latest?cb=20141208162304",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов (TagAghanim Союзников)",
        "Урон Магический"
      ],
      "notes": [
        "Когда цель избегает урона, становясь неуязвимой или прячась, урон продолжает наносится вокруг неё.",
        "Дает общий обзор на цель.",
        "Бьет по цели с интервалом в 0 секунды сразу после размещения дебаффа, срабатывая 4 (TagTalent 7) раз.",
        "Может нанести до 180\/280\/380\/480 единиц урона в одиночную цель (до уменьшения). Может нанести до 300\/400\/500\/600 единиц урона при выборе таланта на увеличение продолжительности действия. Может нанести до 315\/490\/665\/840 единиц урона при выборе таланта на дополнительное количество ударов. Может нанести до 525\/700\/875\/1050 единиц урона при выборе двух талантов.",
        "Может нанести до 300\/400\/500\/600 единиц урона при выборе таланта на увеличение продолжительности действия.",
        "Может нанести до 315\/490\/665\/840 единиц урона при выборе таланта на дополнительное количество ударов.",
        "Может нанести до 525\/700\/875\/1050 единиц урона при выборе двух талантов.",
        "Дебафф остается после смерти. Если цель умерла, способность продолжает наносить урон в месте её смерти.",
        "Удары сначала применяют дебафф, затем наносят урон.",
        "Дает летающий обзор в радиусе 450 единиц на 3,34 секунды на последнем месте, где была цель, если дебафф закончился или его убрали.",
        "Несколько применений способности на одно существо не складываются, но обновляют время действия.",
        "Выбора таланта на дополнительный урон мгновенно улучшит все активные Thunder Strike Disruptor.",
        "Выбор таланта на дополнительную длительность\/число ударов не улучшает активные Thunder Strike."
      ],
      "mana": "130",
      "hotKey": "Q",
      "cooldown": "18\/15\/12\/9",
      "description": "Несколько раз бьёт молнией указанное существо. Каждый удар наносит урон жертве и врагам рядом с ней, а также на 0.1 сек. замедляет их атаку и передвижение на 100%. Даёт обзор по цели.",
      "spellName": "Thunder Strike",
      "params": [
        "Анимация применения: 0,05+0",
        "Дальность применения: 800 (TagTalent 925)",
        "Радиус урона: 240 (TagTalent 500)",
        "Число ударов: 4 (TagTalent 7)",
        "Урон за удар: 45\/70\/95\/120 (TagTalent 75\/100\/125\/150)",
        "Замедление скорости передвижения противника: 100%",
        "Замедление скорости атаки противника: 100",
        "Бонус к скорости передвижения союзника: 0% (TagTalent 50%)",
        "Бонус к скорости атаки союзника: 0 (TagTalent 75)",
        "Длительность замедлений на враге: 0.1",
        "Длительность ускорений на союзнике: 0 (TagTalent 1)",
        "Длительность ударов: 6 (TagTalent 12)",
        "Позволяет применить Thunder Strike на союзника, чтобы молния наносила урон вокруг него. При каждом её ударе (TagTalentраз в 2 секунды) союзник на 1 секунду получает эффект, который даёт +50% к скорости передвижения и +75 к скорости атаки. При применении на союзника радиус увеличен на 260.",
        "Продолжает действовать по области, если дебафф был применен до иммунитета к заклинаниям и не был ранее развеян. Не пытается наносить урон врагам с иммунитетом. Может быть применена на невосприимчивого к магии союзника.",
        "Блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Заряженные катушки грозодела время от времени перегружаются, и на месте противника остаётся лишь пластина брони или клочок шерсти."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/91\/Glimpse.mp3\/revision\/latest?cb=20141208162204",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Glimpse не сразу возвращает цель обратно. Снаряд появляется от цели и движется в направлении отметки. Снаряд движется со скоростью 600 или достигает отметки за 1,8 секунды в зависимости от того, что произойдет раньше.",
        "Снаряд движется со скоростью 600 или достигает отметки за 1,8 секунды в зависимости от того, что произойдет раньше.",
        "Место, куда цель вернется после применения Glimpse, отмечается голубым визуальным эффектом, видимым для всех.",
        "Снаряд при полете дает летающий обзор в 300 единиц, который сохраняется на 3,34 секунды в месте отметки.",
        "Не может возвращать существ с иммунитетом к заклинаниям, но может это делать с неуязвимыми и спрятанными существами. Следуя основным правилам эффектов, меняющих позицию, способность может отменить Time Walk или Ball Lightning. Пока Doppelganger, Sleight of Fist и Activate Fire Remnant меняют позицию применившего, способности нельзя прервать, поэтому с их помощью можно избегать Glimpse. Не перемещает спрятанных существ.",
        "Следуя основным правилам эффектов, меняющих позицию, способность может отменить Time Walk или Ball Lightning.",
        "Пока Doppelganger, Sleight of Fist и Activate Fire Remnant меняют позицию применившего, способности нельзя прервать, поэтому с их помощью можно избегать Glimpse.",
        "Не перемещает спрятанных существ.",
        "Цель получает команду «стоп» как только возвращается обратно, таким образом можно отменять произносимые способности. Но очередь команд не отменяется.",
        "Но очередь команд не отменяется.",
        "Не может выбрать целью крипов-героев."
      ],
      "mana": "100",
      "hotKey": "W",
      "cooldown": "60\/46\/32\/18 (TagTalent 52\/38\/24\/10)",
      "description": "Возвращает выбранного героя туда, где он был 4 секунды назад. Мгновенно убивает иллюзии.",
      "spellName": "Glimpse",
      "params": [
        "Анимация применения: 0,05+0,83",
        "Дальность применения: 600\/1000\/1400\/1800 (TagTalent 725\/1125\/1525\/1925)",
        "Время возврата: 4",
        "Не возвращает врагов с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Игры с электричеством иногда приносят неожиданные результаты."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Kinetic_Field.mp3\/revision\/latest?cb=20141208162220",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Задержка создания не включена в длительность барьера. Сама длительность начинается сразу после задержки.",
        "Визуальные и звуковые эффекты во время задержки создания барьера видны и слышны всем.",
        "Останавливает врагов замедлением при помощи ауры замедления. Аура работает в радиусе 408 единиц, исходящим из центра поля. Замедление усиливается в геометрической прогрессии до видимого барьера, который имеет радиус 340 единиц. Эта возможность означает то, что вражеские существа, прикоснувшись к барьеру, остановятся. Замедление работает только в случае столкновения с барьером. Существа внутри барьера, отвернувшись от него, замедление не получают. Эффект от ауры задерживается на 0,5 секунды, действуя 3,1\/3,7\/4,3\/4,9 (TagTalent 6,1\/6,7\/7,3\/7,9) секунд. Поскольку замедление быстро меняет свое значение, оно не отображается в интерфейсе статуса.",
        "Замедление усиливается в геометрической прогрессии до видимого барьера, который имеет радиус 340 единиц.",
        "Эта возможность означает то, что вражеские существа, прикоснувшись к барьеру, остановятся.",
        "Замедление работает только в случае столкновения с барьером. Существа внутри барьера, отвернувшись от него, замедление не получают.",
        "Эффект от ауры задерживается на 0,5 секунды, действуя 3,1\/3,7\/4,3\/4,9 (TagTalent 6,1\/6,7\/7,3\/7,9) секунд.",
        "Поскольку замедление быстро меняет свое значение, оно не отображается в интерфейсе статуса.",
        "Способность предотвращает только покидание или вхождение в область действия. На принудительное движение нет ограничения, так что существ можно с его помощью перемещать в или из области.",
        "Помимо запрета на вхождение или покидание области, следующие перемещающие способности так же не могут преодолеть барьер: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Sun Ray, God's Rebuke, Force Staff и Hurricane Pike.",
        "Skewer, Leap, Pounce, Tree Dance, Primal Spring, Sun Ray, God's Rebuke, Force Staff и Hurricane Pike.",
        "Дает наземный обзор в 340 единиц в центре области на время задержки и на всю длительность поля."
      ],
      "mana": "70",
      "hotKey": "E",
      "cooldown": "19\/16\/13\/10 (TagTalent 16\/13\/10\/7)",
      "description": "С небольшой задержкой создаёт круговой барьер из кинетической энергии, через который не могут проходить противники.",
      "spellName": "Kinetic Field",
      "params": [
        "Анимация применения: 0,05+0",
        "Дальность применения: 900 (TagTalent 1025)",
        "Радиус: 340",
        "Задержка создания: 1,2",
        "Длительность задержки ауры: 0,5",
        "Длительность: 2,6\/3,2\/3,8\/4,4 (TagTalent 5,6\/6,2\/6,8\/7,4)",
        "Модификатор от барьера остается, если был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Страйдеру не страшны ураганы, поглощающие его врагов."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/04\/Static_Storm.mp3\/revision\/latest?cb=20141208163631",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Безмолвие действует как аура, действующая до конца шторма.",
        "Обезмолвливает (TagTalent и заглушает) неуязвимых существ, но не действует на спрятанных.",
        "Всего наносит урон 20 (TagTalent ) раз за 5 (TagTalent ) секунд, срабатывая через каждые 0,25 сек.",
        "Урон от каждого срабатывания определяется заданным максимальным уроном в секунду, разделенным на максимальное число срабатываний и умноженным на текущее число срабатываний.",
        "Здесь показано, сколько урона можно нанести с каждым интервалом (до уменьшения) на каждом уровне способности: Уровень 1: 2,5\/5\/7,5\/10\/12,5\/15\/17,5\/20\/22,5\/25\/27,5\/30\/32,5\/35\/37,5\/40\/42,5\/45\/47,5\/50 (TagTalent \/52,5\/55\/57,5\/60\/62,5\/65) единиц урона Уровень 2: 3,4\/6,9\/10,3\/13,8\/17,2\/20,6\/24,1\/27,5\/30,9\/34,4\/37,8\/41,3\/44,7\/48,1\/51,6\/55\/58,4\/61,9\/65,3\/68,8 (TagTalent \/72,2\/75,6\/79,1\/82,5\/85,9\/89,4) единиц урона Уровень 3: 4,4\/8,8\/13,1\/17,5\/21,9\/26,3\/30,6\/35\/39,4\/43,8\/48,1\/52,5\/56,9\/61,3\/65,6\/70\/74,4\/78,8\/83,1\/87,5 (TagTalent \/91,9\/96,3\/100,6\/105\/109,4\/113,8) единиц урона",
        "Уровень 1: 2,5\/5\/7,5\/10\/12,5\/15\/17,5\/20\/22,5\/25\/27,5\/30\/32,5\/35\/37,5\/40\/42,5\/45\/47,5\/50 (TagTalent \/52,5\/55\/57,5\/60\/62,5\/65) единиц урона",
        "Уровень 2: 3,4\/6,9\/10,3\/13,8\/17,2\/20,6\/24,1\/27,5\/30,9\/34,4\/37,8\/41,3\/44,7\/48,1\/51,6\/55\/58,4\/61,9\/65,3\/68,8 (TagTalent \/72,2\/75,6\/79,1\/82,5\/85,9\/89,4) единиц урона",
        "Уровень 3: 4,4\/8,8\/13,1\/17,5\/21,9\/26,3\/30,6\/35\/39,4\/43,8\/48,1\/52,5\/56,9\/61,3\/65,6\/70\/74,4\/78,8\/83,1\/87,5 (TagTalent \/91,9\/96,3\/100,6\/105\/109,4\/113,8) единиц урона",
        "Может нанести до 525\/721,875\/918,75 (TagTalent 877,5\/1206,5625\/1535,625) единиц урона одному существу (до уменьшений).",
        "Даёт летающий обзор в радиусе 450 единиц в месте его применения на 5 (TagTalent ) секунд."
      ],
      "mana": "125\/175\/225",
      "hotKey": "R",
      "cooldown": "90\/80\/70",
      "description": "Создаёт статический шторм, наносящий урон и запрещающий применять способности всем вражеским существам в указанной области. Урон увеличивается со временем действия способности.",
      "spellName": "Static Storm",
      "params": [
        "Анимация применения: 0,05+0",
        "Дальность применения: 800 (TagTalent 925)",
        "Радиус шторма: 500",
        "Количество пульсаций: 20 (TagTalent 26)",
        "Максимально урона в секунду: 200\/275\/350",
        "Длительность задержки ауры: 0",
        "Длительность: 5 (TagTalent 6,5)",
        "Запрещает использовать предметы.",
        "Безмолвие (TagTalentи заглушение) остается, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Летний друудский шквал может пережить только уроженец народа Оглоди."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 21.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 1.4,
    "attrAgility": 15.0
  },
  "description": "Disruptor — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Герой обладает обездвиживающими способностями, действующими по области. Способность Thunder Strike позволяет герою ударить противника молнией несколько раз. Glimpse — возвращает героя на место, где он был 4 секунды назад, вернув его, если тот убегает. С помощью способности Kinetic Field герой создает кольцевой барьер, который не позволяет противникам уйти из него. Главной способностью Static Storm, герой вызывает статический шторм. Враги, попавшие в него, не смогут использовать свои способности и будут получать урон.",
  "history": "Высоко в нагорьях обветренных степей Друуда один юный одарённый грозодел первым раскрыл секреты летних дождей. Постоянно страдая от сезонных бурь и от набегов цивилизованных королевств с юга, горный народ Оглоди веками выживал на бесконечных плато. Они — слабый отголосок некогда великой цивилизации, падшее племя; их искусство управления погодой сакрально и непостижимо, собрано из крупиц потерянного знания, и даже сами Оглоди не до конца понимают его природу. Для них, жителей высотных степей, погода подобна религии, которая как давала жизнь, так и могла забрать её в любой момент. Грозовые бури приносили животворящий дождь, но забирали жизни, оставляя за собой обугленные дымящиеся трупы. Хоть и невысокий для своего народа, наш герой был бесстрашен и одержим жаждой знаний. Ещё не пролившим своей первой крови и не имеющим собственного скакуна юнцом он изучал руины древних городов, исследовал разрушенные замшелые библиотеки и заржавевшие мастерские. Там он нашел то, что искал, и возвратился к племени. Разобравшись в устройстве древней катушки, он обрёл власть над разностью потенциалов и теперь способен создавать бури по собственному желанию. Отчасти магические, отчасти механические, его катушки содержат в своих пластинах силу жизни и смерти — силу, способную дать отпор низкогорным южным кастам и любому, кто осмелится нарушить границы древних земель Оглоди.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+3 сек. к продолжительности Kinetic Field",
      "talentRight": "-8 сек. перезарядки Glimpse"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+3 удара у Thunder Strike",
      "talentRight": "Kinetic Field раскрывает невидимость"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1,5 к длительности Static Storm",
      "talentRight": "+125 к дальности заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+30 к урону от Thunder Strike",
      "talentRight": "-3 сек. перезарядки Kinetic Field"
    }
  ]
}