{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/be\/Arcanist%27s_Armor_Mega_Shield_1.mp3\/revision\/latest?cb=20210829215121",
      "effects": [
        "Возвращение урона: 40%",
        "Длительность: 5"
      ],
      "notes": [
        "При применении прерывает произносимые способности.",
        "Добавляет вторую временную ауру, которая действует на союзников в том же радиусе, что и основная аура, и задерживается на ту же длительность. Эта аура действует только на героев, включая иллюзии, клонов и крипов-героев. Не действует на неуязвимых существ. Не возвращает урон от иллюзий, не смотря на то, что устанавливается бафф и появляется визуальный эффект.",
        "Эта аура действует только на героев, включая иллюзии, клонов и крипов-героев. Не действует на неуязвимых существ.",
        "Не возвращает урон от иллюзий, не смотря на то, что устанавливается бафф и появляется визуальный эффект.",
        "Не смотря на описание предмета, урон только возвращается, не отражается. Не уменьшает входящий урон по затронутым союзникам.",
        "Возвращает 3 типа урона, но не эффекты с меткой «отнимающий здоровье» (например, Sunder, Soul Ring и т.п.). Урон возвращается такого же типа, что и был получен. Возвращает входящий урон до всех манипуляций. Однако, манипуляция уроном на враге всё ещё действует на урон как обычно. Возвращаемый урон всегда наносится сразу после входящего урона.",
        "Урон возвращается такого же типа, что и был получен.",
        "Возвращает входящий урон до всех манипуляций. Однако, манипуляция уроном на враге всё ещё действует на урон как обычно.",
        "Возвращаемый урон всегда наносится сразу после входящего урона.",
        "Возвращённый физический урон подвержен блокировке урона.",
        "Урон от Mega Shield отмечен как «отнимающий здоровье», так что он не провоцирует никакие эффекты от урона.",
        "Возвращённый урон имеет пометку «не отражаемый», что не даёт ему взаимодействовать с другими источниками урона с такой же меткой.",
        "Возвращённый урон имеет пометку «без вампиризма заклинаниями», что не позволяет лечиться от него с помощью вампиризма заклинаниями.",
        "Возвращённый урон имеет пометку «не усиливающееся заклинание», что не позволяет его увеличить усилением урона от заклинаний.",
        "Возвращает урон обратно к источнику. Это значит, что урон, нанесённый призываемыми существами возвращается обратно к ним, а не к их владельцу.",
        "Возвращение урона от Mega Shield имеет глобальную дальность и действует на существ сквозь туман войны или невидимость.",
        "Не работает против вардов, построек и союзных существ."
      ],
      "mana": "0",
      "abilityName": "Mega Shield",
      "cooldown": "20",
      "description": "Аура этого предмета даёт 40% к возвращению урона на 5 секунд.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 900",
        "Доп. броня: 5",
        "Доп. сопротивление магии: 20%",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Сочетается с другими источниками сопротивления магии по закону убывающей полезности. Увеличивает общее сопротивление магии большинства героев до 40%.",
        "Увеличивает общее сопротивление магии большинства героев до 40%.",
        "Не действует на варды, постройки и неуязвимых существ.",
        "Бафф ауры задерживается на 0,5 секунды."
      ],
      "mana": null,
      "abilityName": "Shield",
      "cooldown": null,
      "description": "Даёт +5 к броне и +20% к сопротивлению магии всем союзникам, кроме владельца, в радиусе 900.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Собственные бонусы предмета принадлежат ауре, а не самому предмету. Это значит, что пассивная броня и сопротивление магии работают для носителя только когда он находится под действием ауры. Это приводит к тому, что бонус себе аддитивно сочетается с бонусом от ауры, вместо того, чтобы сочетаться по закону убывающей полезности.",
    "Это приводит к тому, что бонус себе аддитивно сочетается с бонусом от ауры, вместо того, чтобы сочетаться по закону убывающей полезности.",
    "Сочетается с другими источниками сопротивления магии по закону убывающей полезности. Увеличивает итоговое сопротивление магии носителя до 55%.",
    "Увеличивает итоговое сопротивление магии носителя до 55%."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Arcanist's Armor",
  "description": "Изысканная вещица, сделанная по просьбе монарха-параноика, который подавился кусочком фрукта задолго до того, как сей прибор можно было применить по назначению.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}