{"abilities":[{"spell":"Выпускает конус отравляющей магии, поражающей нескольких врагов. Жертвы получают периодический урон и замедляются, но если их атаковать, время действия эффекта обновится.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Физический"],"notes":["Снаряд Poison Touch летит со скоростью 1300.","Может задеть юнитов на расстоянии до 1000 (складывается из начального радиуса, расстояния и конечного радиуса).","Конечная область по форме напоминает конус, исходящий от Dazzle.","Цели в области действия выбираются не случайно: способность выбирает ближайшие подходящие цели от первичной в области конуса.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 4\/5\/6\/7 раз.","Может нанести до 64\/140\/240\/364 ( 244\/365\/510\/679) единиц урона каждой цели, если действие способности не обновлялось (до учета сопротивления).","Длительность действия обновится, если игрок или Рошан атакует юнита под дебаффом. Это значит, что обновление длительности не происходит при атаках, которые промахнулись.","Несколько применений Poison Touch складываются.","Bad Juju снижает перезарядку до: Уровень 1: 21.6\/19.2\/16.8\/14.4 Уровень 2: 17.55\/15.6\/13.65\/11.7 Уровень 3: 13.5\/12\/10.5\/9"],"mana":"110\/120\/130\/140","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"27\/24\/21\/18","name":"Poison Touch","description":["Анимация применения: 0,3+0,57","Дальность применения: 500\/600\/700\/800 ( 625\/725\/825\/925)","Начальный радиус: 200","Максимальное расстояние: 500","Конечный радиус: 300","Количество целей: 2\/4\/6\/8","Урон в секунду: 16\/28\/40\/52 ( 61\/73\/85\/97)","Замедление скорости передвижения: 14%\/16%\/18%\/20% ( 54%\/56%\/58%\/60%)","Длительность: 4\/5\/6\/7"],"hot_key":"Q","legacy_key":"T"},{"spell":"Накладывает на союзника священную защиту, не позволяющую ему умереть.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Союзных героев"],"notes":["Уровень здоровья юнита под действием этой способности не может опуститься ниже единицы. Никакой урон не может убить цель, пока способность действует, даже наносимый себе же урон.","Цель остается живой, устанавливая уровень минимального здоровья на 1. Наносимый урон технически не уменьшается.","При этом способность не препятствует убийству цели с помощью Culling Blade, так как она игнорирует эффект Shallow Grave.","Также способность не препятствует самоубийству цели от Bloodstone.","Защищает от всех типов урона и от способностей, отнимающих здоровье. То есть можно спасти героя от смерти от отложенного урона False Promise.","Shallow Grave предотвращает смерть от Ice Blast при снижении здоровья ниже допустимого порога, спасая героя на все время действия способности.","Можно применить на иллюзии и крипов-героев.","При улучшении Aghanim's Scepter Shallow Grave превращается в способность, применяемую по площади, что означает отсутствие необходимости выбирать героя для применения. Возможно применение способности по пустой области, это потратит ману и способность уйдет на перезарядку. Работает на всех героев (включая иллюзии и клонов) и крипов-героев в области применения. Не действует на неуязвимых или спрятанных юнитов, находящихся в области действия.","Bad Juju снижает перезарядку до: Уровень 1: 48\/36.8\/25.6\/14.4 Уровень 2: 39\/29.9\/20.8\/11.7 Уровень 3: 30\/23\/16\/9"],"mana":"150","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60\/46\/32\/18","name":"Shallow Grave","description":["Анимация применения: 0,4+0","Дальность применения: 550\/700\/850\/1000 ( 675\/825\/975\/1125)","Радиус: 0 ( 450)","Длительность: 5"],"hot_key":"W","legacy_key":"G"},{"spell":"Выпускает мощный заряд, который передаётся от союзника к союзнику, излечивая их и нанося урон противникам неподалёку. Способность всегда лечит своего владельца.","effects":["Способность Направленная на юнита","Действует на Союзников \/ Врагов","Урон Физический"],"notes":["У Shadow Wave нет задержки для отскоков, поэтому все цели вылечатся одновременно.","Порядок приоритета: раненые союзные герои > раненые союзные юниты-не-герои(включая иллюзии) > союзные герои > юниты-не-герои","Независимо от цели, сам Dazzle всегда получает лечении без расчета количества целей отскока, исцеляя 4\/5\/6\/7 юнитов.","В общем может исцелить до 320\/500\/720\/980 ( 400\/600\/840\/1120) единиц здоровья в случае всех отскоков.","Радиус урона считает за центр каждого излеченного юнита. Вражеский юнит может получить урон от всех излеченных юнитов за раз.","Может нанести до 320\/500\/720\/980 ( 400\/600\/840\/1120) единиц урона в одиночную цель (до учета сопротивления).","Bad Juju снижает перезарядку до: Уровень 1: 9.6\/8\/6.4\/4.8 Уровень 2: 7.8\/6.5\/5.2\/3.9 Уровень 3: 6\/5\/4\/3"],"mana":"90\/100\/110\/120","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"12\/10\/8\/6","name":"Shadow Wave","description":["Анимация применения: 0,3+0,57","Дальность применения: 800 ( 925)","Радиус урона: 185","Радиус отскока: 475","Количество отскоков: 3\/4\/5\/6","Лечение: 80\/100\/120\/140 ( 100\/120\/140\/160)","Урон: 80\/100\/120\/140 ( 100\/120\/140\/160)"],"hot_key":"E","legacy_key":"D"},{"spell":"Уменьшает перезарядку способностей и предметов. Каждое применение заклинания уменьшает броню врагов неподалёку. При этом эффект складывается, а время действия обновляется.","effects":["Способность Пассивная","Действует на Себя \/ Врагов"],"notes":["Складывается мультипликативно с Octarine Core и аддитивно с другими источниками уменьшения перезарядки.","Снижает броню врагов до срабатывания активировавшего заклинания .","Действует на невидимых юнитов и юнитов в тумане войны. Не действует на неуязвимых или спрятанных.","Не действует на Рошана.","Не срабатывает от активных способностей предметов, заклинаний с нулевой перезарядкой или на которые не реагируют эффекты, срабатывающие от применения.","Накладывает один дебафф на врагов. Дебафф становится сильнее с каждым обновлением от успешного применения. Число в иконке отображает, сколько раз обновлялся дебафф, включая первое применение."],"mana":"0","elements":["Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Bad Juju","description":["Уменьшение перезарядки: 20%\/35%\/50%","Радиус: 1200","Снижение брони за применение: 2\/2.25\/2.5 ( 2.5\/2.75\/3)","Длительность: 8"],"hot_key":"R","legacy_key":"W"}],"bio":"Прежде чем назваться жрецом теней, каждый юный послушник ордена Дезун должен пройти несколько ритуалов. Последний из них, ритуал теней, представляет собой опасное путешествие в мир Нотл, непредсказуемую реальность, откуда возвращается далеко не каждый. Часть тех, что возвращались, теряли рассудок. У других проявлялись странные способности. Но так или иначе, всякий, кто попадал в мир Нотл, бесповоротно изменялся. Одного послушника — самого юного среди тех, кто когда-либо стремился пройти ритуал, — орден поначалу отвергал, называя слишком молодым. Но юнца было не отговорить. Всё же увидев что-то особенное в упрямом послушнике, старейшины уступили ему. Он выпил священное зелье и сел у ночного огня, пока племя исполняло ритуальный танец. В отражении мира Нотл, куда попал юнец, признаки света и тени поменялись местами. Поэтому на самом деле приятно мерцающий целительный свет — воплощение зла, и в его завораживающих отблесках происходят самые кошмарные события. Провидение старейшин оказалась пророческим: послушник вернулся жрецом теней невиданной силы, способный как исцелять, так и убивать. И теперь его дар сокрушает врагов и спасает союзников.","talentsTips":["Талант на дальность применения не влияет на дальность отскоков Shadow Wave.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"talents":["+0,5 к уменьшению брони от Bad Juju:+40% к замедлению от Poison Touch","+45 к урону в секунду от Poison Touch:+40 к скорости передвижения","+20 к лечению\/урону от Shadow Wave:+125 к дальности способностей","+200 к здоровью:+75 к урону"],"desc":"%"}