{
  "abilities": [
    {
      "notes": [
        "Uses the  nighttime values during the night from  Dark Ascension and  Eclipse",
        "Void first applies the slow debuff, then the damage, then the stun debuff",
        "SCEPTER NOTES Turns Void into a non-targetable ability affecting all enemy units within 900 radius\n Does not target invisible units or units inside the Fog of War within the radius"
      ],
      "item_behaviour": [],
      "description": "Creates a damaging void that slows an enemy unit and deals damage. At night, Void also mini-stuns, interrupting channeling abilities, and the slowing effect lasts longer.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.47",
        "Cast Range:  525 ( 0)",
        "Damage: 80\/160\/240\/320 ( 130\/210\/290\/370)",
        "Move Speed Slow: 50%",
        "Attack Speed Slow: 50",
        "Day Slow Duration: 1.25",
        "Night Slow Duration: 2.5\/3\/3.5\/4",
        "Day Stun Duration: 0",
        "Night Stun Duration: 0.1 ( 1)",
        "Radius:  900"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Night_Stalker_Void.mp3\/revision\/latest?cb=20191216021028",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "11\/10\/9\/8",
      "aghanim": null,
      "name": "Void",
      "cooldown": "90\/100\/110\/120",
      "legacy_key": "V",
      "story": "Balanar creates a vortex of infinite night, tearing opponents violently into the eternal darkness that once was."
    },
    {
      "notes": [
        "Uses the  nighttime values during the night from  Dark Ascension and  Eclipse",
        "The silence is provided by an aura, its debuff lingers for 0.5 seconds",
        "The aura's duration does not update when it turns day or night while the buff is on"
      ],
      "item_behaviour": [],
      "description": "Night Stalker horrifies all nearby enemies, causing them to become silenced while near him. The effect lasts longer at night.",
      "hot_key": "W",
      "params": [
        "Cast Animation:  0+0",
        "Radius: 375",
        "Day Duration: 3",
        "Night Duration: 4.5\/5\/5.5\/6",
        "Aura Linger Duration: 0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ee\/Night_Stalker_Crippling_Fear_1.mp3\/revision\/latest?cb=20191216021032",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies"
      ],
      "mana": "30\/25\/20\/15 (TagTalent 25\/20\/15\/10)",
      "aghanim": null,
      "name": "Crippling Fear",
      "cooldown": "50",
      "legacy_key": "F",
      "story": "A vision of the twisted maw of Balanar etches itself into the minds of the poor souls unlucky enough to cross his path."
    },
    {
      "notes": [
        "Grants passive bonuses only during  nighttime, also works during the nighttime of  Dark Ascension and  Eclipse\n TALENT NOTES Stacks multiplicatively with other sources of status resistance",
        "SHARD NOTES Adds an active component to Hunter in the Night, with the passive effects still present\n Can be cast on any unit except for heroes, illusions, clones, creep-heroes, wards, buildings and  Roshan\n Cannot be cast on ancient creeps during  daytime, but can during  nighttime\n The targeted creep is instantly killed, granting its gold and experience bounties if it was an enemy, denying it if it was an ally\n Despite the visual effect, the health and mana restored are applied instantly upon cast"
      ],
      "item_behaviour": [],
      "description": "Night Stalker is in his element at night, attacking and moving with great swiftness.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+1.07",
        "Passive Move Speed Bonus: 22%\/28%\/34%\/40%",
        "Passive Attack Speed Bonus: 20\/40\/60\/80 ( 120\/140\/160\/180)",
        "Cast Range:  150",
        "Active Max Health as Heal:  35%",
        "Active Max Mana as Mana Restore:  25%",
        "Status Resistance Bonus:  15%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Night_Stalker_Hunter_in_the_Night_move.mp3\/revision\/latest?cb=20191216021026",
      "effects": [
        "Ability: Passive",
        "Affects: Self ",
        "Damage: "
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Hunter in the Night",
      "cooldown": "0",
      "legacy_key": "G",
      "story": "The hunting prowess of Balanar improves as the night beckons."
    },
    {
      "notes": [
        "Time of Day modifying abilities has the following priorities:  Supernova ➤  Eclipse ➤ Dark Ascension\n Dark Ascension's bonuses are not disabled during Supernova's  daytime\n However, the vision is limited to Night Stalker's default daytime vision\n Eclipse does not interfere with the  nighttime caused by Dark Ascension in any way — they do not cancel or pause each other's nighttime",
        "Upon cast, Night Stalker ascends 150 units above the z-axis",
        "Grants regular flat bonus attack damage\n TALENT NOTES The damage increasing  talent immediately updates the currently active instance",
        "Destroys trees within a 150 radius at the end of the duration\n SPELL STEAL  Rubick neither ascends above the z-axis nor turns into a flying unit"
      ],
      "item_behaviour": [],
      "description": "Night Stalker smothers the sun and summons instant darkness, so that he might use his powers at their fullest. Night Stalker gains flight and bonus damage during this time. Has unobstructed vision.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0",
        "Attack Damage Bonus: 50\/100\/150 ( 85\/135\/185)",
        "Duration: 30 ( 38)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Night_Stalker_Dark_Ascension.mp3\/revision\/latest?cb=20191216021025",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "140\/135\/130 (TagTalent 90\/85\/80)",
      "aghanim": null,
      "name": "Dark Ascension",
      "cooldown": "125\/175\/225",
      "legacy_key": "R",
      "story": "It is a humbling sight to see when the mightiest of warriors become afraid of the dark."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.2,
    "attrAgility": 18.0
  },
  "description": "Empowered by the shadows of nightfall. The beast of bedtime tales, Balanar is the primal terror that every child knows to fear. Once the sun goes down, Night Stalker's hunt begins. Charging through the shadowy forests, he snares prey in a debilitating Void, slowing and forcing his quarry to flee, arms withering and spells fizzling as their hearts are stricken with Crippling Fear. Should sunrise threaten to end his terror, the Hunter in the Night transforms through a Dark Ascension, spreading his wings under the blackened veil of night, and goes on the prowl for ever more victims.  Carry Initiator Durable Disabler Nuker ★☆☆",
  "trivia": [
    "Many of Night Stalker's responses that refer to his vampiric qualities make reference to Bram Stoker's Dracula, a film adaptation of the classic novel starring Oldman.",
    "Night stalker's line Link▶️ \"If I ever get my claws on that bird.\" is likely a reference to the rooster that crows when the game transitions from nighttime to daytime. Additionally it is a reference to a line used by \"Looney Tunes\" character Sylvester the cat when describing \"Tweety Bird.\"",
    "Additionally it is a reference to a line used by \"Looney Tunes\" character Sylvester the cat when describing \"Tweety Bird.\"",
    "Night Stalker's deep and raspy voice is a possible reference to Batman.",
    "In an earlier version DotA, there existed a hero similar to Night Stalker called Void Demon. His first ability \"Time Void\" had similar effects to the present Void ability, except it also stunned the target for 5 seconds. Void Demon also had an ability similar to Omniknight's Degen Aura, though it had a larger radius of 600 units. His third ability was a pushing spell called \"Quake\" which was useful for destroying towers. Finally, his ultimate was called \"Mass Haste\". This aura gave Void Demon and nearby allies benefits similar to Night Stalker's Hunter in the Night, except that it had no conditions and enabled Void Demon and his team to hunt Heroes relentlessly both day and night. Ultimately, Void Demon was replaced with Night Stalker as his skill set was deemed too powerful.",
    "Night Stalker's response \"In the forest of the night\" is a reference to the poem The Tyger by William Blake."
  ],
  "history": "Of the Night Stalker, there is no history, only stories. There are ancient tales woven into the lore of every race and every culture, of an impossible time before sunlight and daytime, when night reigned alone and the world was covered with the creatures of darkness--creatures like Balanar the Night Stalker. It is said that on the dawn of the First Day, all the night creatures perished. All, that is, save one. Evil's embodiment, Night Stalker delights in his malevolence. He created the primal role of the Night Terror, the Boogeyman, and as long as there have been younglings, his is the specter summoned to terrify them. This is a role he relishes; nor are these empty theatrics. He does indeed stalk the unwary, the defenseless, those who have strayed beyond the lighted paths or denied the warnings of their communities. Night Stalker serves as living proof that every child's worst nightmare....is true.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+100 Hunter In The Night Attack Speed",
        "talent_left": "-50s Dark Ascension Cooldown"
      },
      {
        "talent_lvl": "20",
        "talent_right": "-5s Crippling Fear Cooldown",
        "talent_left": "+20 Strength"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+35 Dark Ascension Damage",
        "talent_left": "+15% Hunter In The Night Status Resistance bonus"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+50 Void Damage",
        "talent_left": "+8s Dark Ascension Duration"
      }
    ],
    "notes": [
      "The strength talent effectively grants Night Stalker 400 health, 2 health regeneration, and 20 main attack damage bonus."
    ]
  }
}