{"abilities":[{"spell":"Instantly heals a friendly unit and damages all nearby enemy units.","effects":["Ability Target Unit","Affects Allies \/ Enemies","Damage Pure"],"notes":["The targeting reticule must be centered over an allied unit.","Despite the visual effects, the damage is applied instantly to all enemy units within range of the target."],"mana":"85\/100\/115\/130","elements":["Partially pierces spell immunity."],"cooldown":"14\/13\/12\/11","name":"Purification","description":["Cast Animation: 0.2+1.4","Cast Range: 400","Damage Radius: 260 ( 335)","Damage: 90\/160\/230\/300 ( 290\/360\/430\/500)","Heal: 90\/160\/230\/300 ( 290\/360\/430\/500)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Creates a divine barrier around an ally which grants them increased Status Resistance and Health Regeneration.","effects":["Ability Target Unit","Affects Allies"],"notes":["Applies a strong dispel on the target upon cast.","Heavenly Grace first applies the buff, then the dispel.","Can regenerate up to 64\/96\/128\/160 health over its full duration."],"mana":"75","elements":["Pierces spell immunity."],"cooldown":"17\/16\/15\/14 ( 9\/8\/7\/6)","name":"Heavenly Grace","description":["Cast Animation: 0.25+1.27","Cast Range: 500","Status Resistance Bonus: 50%\/60%\/70%\/80%","Health Regeneration Bonus: 8\/12\/16\/20","Duration: 8"],"hot_key":"W","legacy_key":"E"},{"spell":"Greatly degenerates the movement and attack capabilities of enemy units that stray too near.","effects":["Ability Aura","Affects Enemies"],"notes":["The aura's debuff lingers for 1 second."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Degen Aura","description":["Radius: 275","Move Speed Slow: 10%\/18%\/26%\/34% ( 22%\/30%\/38%\/46%)","Attack Speed Slow: 10\/18\/26\/34 ( 22\/30\/38\/46)","Aura Linger Duration: 1"],"hot_key":"E","legacy_key":"D"},{"spell":"Omniknight summons a Guardian Angel that grants immunity from physical damage.","effects":["Ability No Target","Affects Allies"],"notes":["Affects all allied units, except for wards, couriers, invulnerable and hidden units.","Affects buildings only when upgraded with Aghanim's Scepter."],"mana":"125\/175\/250","elements":["Pierces spell immunity."],"cooldown":"160\/150\/140","name":"Guardian Angel","description":["Cast Animation: 0.5+1.07","Radius: 1200 ( Global)","Duration: 6\/7\/8 ( 8\/9\/10)"],"hot_key":"R","legacy_key":"G"}],"bio":"Purist Thunderwrath was a hard-fighting, road-worn, deeply committed knight, sworn to the order in which he had grown up as squire to elder knights of great reputation. He had spent his entire life in the service of the Omniscience, the All Seeing One. Theirs was a holy struggle, and so embedded was he in his duty that he never questioned it so long as he had the strength to fight and the impetuous valor that comes with youth. But over the long years of the crusade, as his elders passed away and were buried in sorry graves at the side of muddy tracks, as his bond-brothers fell in battle to uncouth creatures that refused to bow to the Omniscience, as his own squires were chewed away by ambush and plague and bad water, he began to question the meaning of his vows--the meaning of the whole crusade. After deep meditation, he parted ways with his army and commenced a long trek back to the cave-riddled cliffs of Emauracus, and there he set a challenge to the priests of the Omniscience. No knight had ever questioned them before, and they tried to throw him into the pit of sacrifice, but Purist would not be moved. For as he faced them down, he began to glow with a holy light, and they saw that the Omniscience had chosen to reveal Itself to him. The Elder Hierophant led him on a journey of weeks down into the deepest chamber, the holy of holies, where waited not some abstract concept of wisdom and insight, not some carved relic requiring an injection of imagination to believe in, but the old one itself. It had not merely dwelt in those rocks for billions of aeons; no, It had created them. The Omniscience had formed the immense mineral shell of the planet around itself, as a defense against the numerous terrors of space. Thus the All Seeing One claimed to have created the world, and given the other truths revealed to Purist on that day, the knight had no reason to refute the story. Perhaps the Omniscience is a liar, deep in its prison of stone, and not the world's creator at all, but Omniknight never again questioned his faith. His campaign had meaning at last. And there can be no question that the glorious powers that imbue him, and give his companions such strength in battle, are real beyond any doubt.","talentsTips":["Gold granted from the talent is unreliable gold.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Some parts of Omniknight's bio are a reference to the bible story of Daniel in the Lion's Pit. Daniel was thrown into the lion's den for praying to God and challenging Darius' command not to do so, but God prevented the lions from harming Daniel, saving his life. Similarly, Omniknight was to be thrown to the pit of sacrifice for challenging his priests but the Omniscience revealed itself, saving Purist.","His response \"Play I have gazed into the omniscience, and it has gazed into me.\" is a reference to German philosopher Nietzsche's quote \"If you gaze long into an abyss, the abyss will gaze back into you\".","His kill response \"Play You chose poorly.\" and item purchase response \"Play I chose wisely.\" are references to Indiana Jones and the Last Crusade.","Many of Omniknight's responses refer to the Bible or Christianity in general: Ie. confessing sins, having demons as nemeses, chastising Dazzle for using dark powers to heal, disliking Necronomicon (as its powers are demonic), using \"omniscient\" and \"light\" to describe his God, his death animation (with arms forming a cross, as a reference to the Crucifixion of Christ), etc. \"Play A narrow path.\" refers to Matthew 7:14.","Omniknight's nickname is \"Chuck Norris\", due to the similarities in appearance and the power of his abilities. As well, when he was first added to Dota 2 there was a bug that caused him to always say the voice line \"Fear nothing!\"","Omniknight originally held and swung his hammer with one hand. This was changed after community feedback.","Omniknight's battle begin line \"The Omniscience may spare them, but I will not.\" is a reference to General Patton's quote \"May God have mercy upon my enemies, because I won't.\""],"talents":["-8s Heavenly Grace Cooldown:+200 Purification Damage\/Heal","+5 Mana Regen:-12% Degen Aura","+90 Damage:+35% XP Gain","+75 Purification AoE:+90 Gold\/Min"],"desc":"Purist Thunderwrath, the Omniknight, is a melee strength hero who is renowned for his ability to protect his allies, preventing the enemy from easily killing them. A holy and courageous hero, Purist Thunderwrath is an adept support whose powerful spells give his team strong survivability. He possesses a potent healing ability in Purification, which can instantly heal the targeted ally and, if there are nearby enemy units, deal pure damage in the same amount, allowing it to be used as a nuke. He is also capable of providing status resistance to allies in the form of Heavenly Grace, a basic ability that heals an ally over time and greatly reduces the duration of enemy effects. His passive ability, Degen Aura, can greatly slow the movement and attack speed of enemies, preventing them from easily using their physical attacks to deal damage. And finally, his ultimate, Guardian Angel, can provide complete immunity against physical damage to all nearby allies, completely nullifying the damage output of most carries for a short time. Few can escape the mighty and heavenly power of the Omniknight and he is a powerful ally in team fights. He is a mighty tank, and a very difficult hero to kill."}