{
  "abilities": [
    {
      "spell": "Мгновенно исцеляет союзное существо и наносит урон врагам вокруг него.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Союзников \/ Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Перекрестие указателя должно выделять союзного юнита.",
        "Вопреки визуальному эффекту, урон наносится мгновенно всем врагам в радиусе вокруг цели."
      ],
      "mana": "85\/100\/115\/130",
      "elements": [
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "14\/13\/12\/11",
      "name": "Purification",
      "description": [
        "Анимация применения: 0,2+1,4",
        "Дальность применения: 400",
        "Радиус урона: 260 ( 335)",
        "Урон: 90\/160\/230\/300 ( 290\/360\/430\/500)",
        "Лечение: 90\/160\/230\/300 ( 290\/360\/430\/500)"
      ],
      "hot_key": "Q",
      "legacy_key": "R"
    },
    {
      "spell": "Создаёт вокруг цели божественный щит, который увеличивает её сопротивление эффектам и восстановление здоровья.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Союзников"
      ],
      "notes": [
        "При использовании применяет сильное развеивание на цель.",
        "Heavenly Grace сначала применяет бафф, затем развеивание.",
        "Восстанавливает здоровье в виде регенерации, регенерируя 0.8\/1.2\/1.6\/2 здоровья с интервалом в 0,1 секунды.",
        "Восстанавливает до 64\/96\/128\/160 здоровья."
      ],
      "mana": "75",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "17\/16\/15\/14 ( 9\/8\/7\/6)",
      "name": "Heavenly Grace",
      "description": [
        "Анимация применения: 0,25+1,27",
        "Дальность применения: 500",
        "Сопротивление эффектам: 50%\/60%\/70%\/80%",
        "Восстановление здоровья: 8\/12\/16\/20",
        "Длительность: 8"
      ],
      "hot_key": "W",
      "legacy_key": "E"
    },
    {
      "spell": "Значительно снижает скорость передвижения и атаки врагов, осмелившихся подойти слишком близко.",
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Дебафф ауры задерживается на 1 секунду."
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Degen Aura",
      "description": [
        "Радиус: 275",
        "Замедление скорости передвижения: 10%\/18%\/26%\/34% ( 22%\/30%\/38%\/46%)",
        "Замедление скорости атаки: 10\/18\/26\/34 ( 22\/30\/38\/46)",
        "Длительность задержки ауры: 1"
      ],
      "hot_key": "E",
      "legacy_key": "D"
    },
    {
      "spell": "Призывает ангела-хранителя, который полностью защищает от физического урона.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Действует на всех союзных юнитов, за исключением вардов, курьеров, неуязвимых и спрятанных юнитов.",
        "Действует на строения только после улучшения Aghanim's Scepter."
      ],
      "mana": "125\/175\/250",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "180\/170\/160",
      "name": "Guardian Angel",
      "description": [
        "Анимация применения: 0,5+1,07",
        "Радиус: 600 ( Глобальный)",
        "Длительность: 6\/7\/8 ( 8\/9\/10)"
      ],
      "hot_key": "R",
      "legacy_key": "G"
    }
  ],
  "bio": "Ревнитель Громобой с раннего детства служил ордену, посвятившему себя подвигам во имя Всезнания. Прожив так много лет, он, будучи праведно верящим в свое дело, не раз отправлявшимся в далекие края рыцарем, никогда не ставил свою веру под вопрос — их дело было правым, а кто был не с ними — тот против них. В самом начале его, и без того готового на подвиги, еподогрвали юношеский кураж и молодость. Однако шли долгие годы крестовых походов, и вот сходили в могилы на краю дорог те, на службу к которым он когда-то поступал; вот один за одним пали в бою с жуткими, злыми сущностями, не признающими Всезнание, его братья по оружию, вместе с которыми он в детстве оказался в ордене; вот погибали его же собственные оруженосцы во многочисленных засадах, под натиском ужасных погодных условий далеких стран, от всевозможных болезней... Так, шаг за шагом, Громобой потерял былую уверенность в своих клятвах — и во всем их крестовом походе. Отколовшись от военных сил ордена, он отправился обратно в Эмарак, город на утесах, знаменитый своим пещерным храмом, где и находились жрецы Всезнания. Ревнитель нашел их и бросил вызов. Никто прежде не смел высказывать подобной наглости, и Громобоя поначалу пытались сбросить с утеса для жертвоприношений, но сколько бы человек на него не набрасывались и какие бы заклинания на него не обрушали — его так и не удалось даже сдвинуть с места. И пролился на стойкую фигуру воина небесный свет — тогда служители храма поняли, что Всезнание избрало его, чтобы открыться. Отойдя прочь от избранного, они пропустили старейшину, чтобы тот открыл Ревнителю дверь в их святая святых, где хранились не свитки древней мудрости, не легендарные реликвии, в которые надо было для начала самому поверить, а туда, где находился тот, кто испокон веков жил внутри скалы — более того, тот, кто сам создал эту скалу бесчисленное множество лет назад, чтобы защититься от опасностей внешнего мира. По легенде, именно так мир был создан Всезнанием. Тогда рыцарь всё осознал. У него не было более никакой причины сомневаться в истинности веры. Быть может, Всезнание и не было никаким создателем мира, но оно было реально. Теперь поход паладина имел смысл. За его целительными способностями и воинской храбростью стоят реальные силы, а не какие-то выдумки.",
  "talentsTips": [
    "Золото с таланта является ненадёжным.",
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
  ],
  "trivia": [
    "Some parts of Omniknight's биография are a reference to the bible story of Daniel in the Lion's Pit. Daniel was thrown into the lion's den for praying to God and challenging Darius' command not to do so, but God prevented the lions from harming Daniel, saving his life. Similarly, Omniknight was to be thrown to the pit of sacrifice for challenging his priests but the Omniscience revealed itself, saving Purist.",
    "His response \"Играть I have gazed into the Omniscience, and it has gazed into me.\" is a reference to German philosopher Nietzsche's quote \"If you gaze long into an abyss, the abyss will gaze back into you\".",
    "His kill response \"Играть You chose poorly.\" and item purchase response \"Играть I chose wisely.\" are references to Indiana Jones and the Last Crusade.",
    "Many of Omniknight's responses refer to the Bible or Christianity in general: Ie. confessing sins, having demons as nemeses, chastising Dazzle for using dark powers to heal, disliking Necronomicon (as its powers are demonic), using \"omniscient\" and \"light\" to describe his God, his death animation (with arms forming a cross, as a reference to the Crucifixion of Christ), etc. \"Играть A narrow path.\" refers to Matthew 7:14.",
    "Omniknight's nickname is \"Chuck Norris\", due to the similarities in appearance and the power of his abilities.",
    "Omniknight originally held and swung his hammer with one hand. This was changed after community feedback.",
    "Omniknight's battle begin line Играть \"The Omniscience may spare them, but I will not.\" is a reference to General Patton's quote \" May God have mercy upon my enemies, because I won't.\""
  ],
  "talents": [
    "-8 сек. перезарядки Heavenly Grace:+200 к урону\/лечению от Purification",
    "+5 маны в секунду:+12% к замедлению от Degen Aura",
    "+90 к урону:+35% к получаемому опыту",
    "+75 к радиусу урона от Purification:+90 золота в минуту"
  ],
  "tips": [
    "Замедление от предметов и способностей сочетается с вашей Degen Aura, поэтому полезно покупать предметы на замедление скорости атаки и скорости движения, например Shiva's Guard поможет вам и вашим союзникам догнать убегающего врага.",
    "Союзников под действием Repel нельзя лечить способностью Purification. Она также не снимает с союзных героев прочие положительные эффекты, кроме способности Guardian Angel."
  ],
  "desc": "Omniknight – это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Purification, Мгновенно исцеляет дружеского юнита и наносит урон ближайшим вражеским юнитам. Вторая способность, Repel, создает божественный щит вокруг цели, который дает невосприимчивость к заклинаниям и 100% сопротивление магическому урону. Эффект данной способности идентичен эффекту от Black King Bar. Пассивная способность, Degen Aura, снижает скорости передвижения и атаки врагов, находящихся рядом с Omniknight. Ультимативная способность, Guardian Angel, призывает ангела-хранителя, который делает всех ближайших союзных юнитов невосприимчивыми к физическому урону. Улучшение с Aghanim's Scepter увеличивает длительность, охватывает всю карту и действует на строения."
}