{"abilities":[{"spell":"Устанавливает невидимую мину. Ее невидимость невозможно развеять, но она станет видна, если противник зайдет в радиус ее действия. Мина сдетонирует, если противник будет 1.6 сек. находиться на расстоянии в 400 от нее. Взрыв наносит полный урон по всему радиусу срабатывания. Наносит постройкам 25% урона.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Для взрыва Proximity Mine нужно 3.35 секунд при установке мины прямо перед врагом или строением.","Proximity Mines становятся видны в момент задержки активации.","Мины наносят урон только в случае срабатывания, а не разрушения от атак.","Мины взрываются только в том случае, если враг встает в радиусе срабатывания на 1.6 секунды. То есть быстрый вход и выход из области срабатывания не активирует их. При входе в радиус срабатывания мина издает звук, предупреждая врага о попадании в радиус срабатывания. Звук слышен всем даже через туман войны. Взрыв мины также слышен сквозь туман войны.","Мины срабатывают от невидимых юнитов, но не от неуязвимых и спрятанных юнитов.","Proximity Mines нельзя разместить в радиусе срабатывания остальных союзных Proximity Mines. При выборе способности все установленные Proximity Mines отображают красный круг, показывающий их радиус срабатывания. Но при выборе таланта, дающего минам скорость передвижения, несколько мин смогут двигаться рядом после размещения.","Источником урона является сама мина, поэтому определенные эффекты, реагирующие на урон, реагируют на мины, а не на Techies (к примеру, Blade Mail).","Летающие юниты не могут активировать или получить урон от мин.","Варды также не активируют и не получают урон от мин.","Proximity Mine наносят 50\/100\/150\/200 урона по строениям.","Дает летающий обзор в радиусе 300 единиц в месте установления на 1 секунду после взрыва.","Урон мин учитывает текущий уровень Proximity Mines, а не уровень способности непосредственно при установке мин.","Мины нельзя разбить с помощью Quelling Blade и его улучшений.","Мины не блокируют лагери нейтральных крипов."],"mana":"110\/130\/150\/170","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"12 ( -4)","name":"Proximity Mines","description":["Анимация применения: 0+0,47","Дальность применения: 100","Радиус срабатывания: 400","Радиус урона: 400","Задержка активации\/невидимости: 1.75","Задержка детонации: 1.6","Урон: 200\/400\/600\/800","Процент урона по строениям: 25%"],"hot_key":"Q","legacy_key":"E"},{"spell":"Устанавливает невидимую ловушку, которая при срабатывании применяет на вражеских существ оцепенение.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Применяет оцепенение к целям, препятствуя их передвижению и использованию способностей для передвижения. Дает эффект True Sight на цели.","Ловушка применяет оцепенение только тогда, когда враги активируют её, а не в случае её разрушения.","При срабатывании Stasis Trap все остальные ловушки, установленные игроком в радиусе 600 от сработавшей ловушки разрушаются. Несмотря на это, ловушки можно размещать на расстоянии 600 единиц друг от друга.","Ловушки не срабатывают от юнитов с иммунитетом к заклинаниям, невидимых юнитов, неуязвимых и спрятаных юнитов. При этом невидимые юниты оцепенеют, если находились в радиусе при срабатывании ловушки.","Дает летающий обзор в радиусе 600 единиц в месте установки на 1 секунду после срабатывания.","Длительность оцепения зависит от того, какой уровень Stasis Trap был при установке ловушки, а не от уровня на момент срабатывания.","Взрыв ловушки слышен сквозь туман войны.","Ловушки от Stasis Trap можно выбрать и уничтожить с помощью Quelling Blade и его улучшений.","Stasis Trap не блокирует лагери нейтральных крипов."],"mana":"80\/110\/140\/160","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/16\/13\/10","name":"Stasis Trap","description":["Анимация применения: 1+0","Дальность применения: 150","Радиус срабатывания: 400","Радиус оцепенения: 600","Задержка активации\/невидимости: 2","Длительность оцепенения: 2\/3\/4\/5"],"hot_key":"W","legacy_key":"T"},{"spell":"Герои бросаются в гущу врагов и при приземлении взрывают свой боезапас, нанося задетым врагам огромный урон и запрещая им применять способности. Сами подрывники получают при взрыве урон в размере 50% от максимального запаса здоровья.","effects":["Способность Направленная на область","Действует на Врагов \/ Себя","Урон Магический \/ Чистый"],"notes":["Прыжок всегда занимает 0.75 секунды, поэтому скорость полета варьируется между 0 и 1333.33.","Прыжок представляет собой арку высотой в 281.108 единиц, поэтому остальные юниты могут пройти под ним до его завершения.","Урон по себе летален, поэтому Techies может добить себя с помощью этой способности.","Урон по себе представляет собой чистый урон с пометкой способности, отнимающей здоровье, поэтому не может быть заблокирован или снижен большинством источников манипуляции урона. Borrowed Time, Ghostship и False Promise - единственные способности, которые могут взаимодействовать с уроном по себе. Shallow Grave предотвращает смерть от нанесения себе урона.","Наносит урон врагам по области до нанесения урона самому Techies, поэтому Techies получает опыт от смерти героев от этого заклинания. Это означает, что Techies может умереть от Blade Mail, Spiked Carapace, Dispersion, Last Will и способности Mjollnir Static Charge, если его здоровье было достаточно низким при применении.","При приземлении разрушает деревья в радиусе 400 единиц от Techies.","Способность можно прервать с помощью принудительного движения, пока не закончился прыжок, но её нельзя прервать любым источником обезвреживания.","Можно использовать при оцепенении; получение оцепенения в процессе прыжка не прервет его."],"mana":"100\/125\/150\/175","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"35","name":"Blast Off!","description":["Анимация применения: 1,0+0,9","Дальность применения: 1000","Радиус: 400","Урон себе: 50%","Урон по области: 300\/400\/500\/600 ( 600\/700\/800\/900)","Длительность прыжка: 0.75","Длительность безмолвия: 4\/5\/6\/7"],"hot_key":"E","legacy_key":"C"},{"spell":"На 0.5 секунд устанавливает предостерегающую табличку, советующую врагам ступать осторожно. Нельзя ставить больше одной таблички одновременно.","effects":["Способность Направленная на область ( Аура)","Действует на Союзных существ"],"notes":["Эта способность присутствует изначально, она не может быть изучена или улучшена.","Одновременно на карте может присутствовать только одна Minefild Sign. Размещение второй таблички моментально уничтожит предыдущую (хоть и с визуальной задержкой).","Табличка не имеет размера столкновения и не может заблокировать проход юнитов.","Табличка не блокирует лагери нейтральных крипов.","Aghanim's Scepter дает Minefield Sign ауру, применяющую к минам невидимость, которая защищает их от эффекта True Sight и обладает нулевым временем ухода в невидимость. Данная аура действует только на Proximity Mines, Stasis Trap и Remote Mines. На другие типы вардов способность не влияет. Аура маскирует мины всех дружественных игроков (не только Techies), но не затрагивает вражеские мины. Аура невидимости мгновенно скрывает Proximity Mines и Stasis Traps без их базовой задержки активации. Аура невидимости мгновенно скрывает Remote Mines без двухсекундной задержки до невидимости. Под эффектом ауры не дает врагам увидеть Proximity Mines, даже если враг находится в радиусе срабатывания мины, или Remote Mines при задержке взрыва. Аура задерживается на 0.5 секунды."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"360","name":"Minefield Sign","description":["Анимация применения: 0+0,53","Дальность применения: 10","Радиус эффекта: 0 ( 125)","Максимум табличек: 1","Длительность задержки ауры: 0.5","Длительность: 180"],"hot_key":"F","legacy_key":"G"},{"spell":"Устанавливает невидимую мину, которая взрывается только при активации вручную. Не наносит урон строениям.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Мины наносят урон врагам только при активации, а не при их разрушении с помощью атак или истечении времени действия.","Remote Mines можно взорвать сразу после установки, но до взрыва есть очень короткая задержка.","Источником урона является сама мина, поэтому определенные эффекты, реагирующие на урон, реагируют на мины, а не на Techies (к примеру, Blade Mail).","Можно размещать несколько мин в одной точке; мины не блокируют проход юнитам.","Можно иметь до Ошибка выражения: не ожидаемый оператор \/ таких мин, с учетом базового времени применения, перезарядкой и длительностью.","Дает летающий обзор в радиусе 500 в месте установки на 3 секунды после взрыва.","Урон учитывается от уровня Remote Mines на момент размещения мины, а не от уровня на момент взрыва.","При этом мины улучшаются\/ухудшаются при экипировке\/сбрасывании Aghanim's Scepter.","Мины 2-го уровня на 10% больше по размеру, чем мины 1-го уровня, а мины 3-го уровня - на 20%.","Remote Mines можно выбрать и уничтожить с помощью Quelling Blade и его улучшений.","Мины не блокируют лагери нейтральных крипов."],"mana":"120\/180\/240","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"8","name":"Remote Mines","description":["Анимация применения: 1,0+0,13","Дальность применения: 500 ( 700) ( 700)","Радиус взрыва: 425","Задержка активации: 0","Задержка детонации: 0.25","Урон: 300\/450\/600 ( 450\/600\/750)","Длительность: 600"],"hot_key":"R","legacy_key":"R"},{"spell":"Взорвать все мины в выбранной области.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Focused Detonate станет доступна вместе с изучением Remote Mines.","Можно использовать Focused Detonate без поворота персонажа лицом к месту использования заклинания.","Использование Focused Detonate не является произнесением заклинания, и не может спровоцировать заклинания.","Эта способность может использоваться пока герой мёртв, но нельзя использовать в обезвреженном состоянии Techies.","Если в радиусе действия способности не найдётся Remote mines, то ничего не произойдёт, но способность уйдет на перезарядку."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"1","name":"Focused Detonate","description":["Анимация применения: 0+0,53","Дальность применения: Глобальная","Радиус: 700"],"hot_key":"D","legacy_key":"F"},{"spell":"Взрывает все выбранные радиоуправляемые мины.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Это заклинание самой мины, что дает возможность Techies взорвать его мины когда он не может использовать Focused Detonate если обезврежен.","Взрывает все выбранные радиоуправляемые мины с задержкой в 0,03 секунды между каждой."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Pinpoint Detonate","description":["Анимация применения: 0+0"],"hot_key":"Q","legacy_key":"D"}],"bio":"За всю историю Устричной бухты никого не ненавидели так, как подрывников Techies. Но — вот незадача — Устричной бухты больше нет. Как и города Тотерина. И даже Охотограда. Вообще, если бы кто-нибудь следил за похождениями подрывников, он бы заметил, что там, где появляются Techies, исчезают города. Как и все остальные неизбежные бедствия, происходившие вокруг них, отправной точкой для уничтожения Устричной бухты стало изобретение. Гении пиротехники — Скви, Сплин и Спун — искали безопасный метод пробить шахты под городом взрывчаткой и создали самое диковинное свое устройство — кнопку, позволяющую зажечь фитиль издалека. Троица, решившая во что бы то ни стало испытать свое изобретение, заставила всю свою крохотную мастерскую радиоуправляемыми бочками с огненной солью. Набив тележку этими бомбами, они закопали их в пустынном поле. Спрятавшись в траншее, Сплин вдавил кнопку детонатора. Но ничего не произошло. Смутившись, он поднялся на ноги и нажимал кнопку еще и еще, пока наконец не прогремел взрыв, оставивший на поле воронку. Радостные Скви и Сплин уж было направились в сторону дома, но тут их накрыла мощная ударная волна. Сбитые с толку неожиданным взрывом, они пробрались через едкий дым и увидели, что от их мастерской остались одни руины. С неба падали куски дерева и камня, а воронка под мастерской начала углубляться. Вся Устричная бухта содрогнулась и начала оседать в шахты, а паникующие жители спасались бегством. Присев на краю своего тонущего дома, подрывники ухмылялись и хихикали, уже представляя себе, на что они способны, и совсем не думали о гневе их бывших соседей. Им было интересно только одно: а как можно сделать взрыв еще сильнее?","talentsTips":["Золото с таланта является ненадёжным.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["До релиза, Techies впервые был продемонстрирован на Матче всех звезд The International 2014, игроком Артуром \"Arteezy\" Бабаевым.","У Techies есть реплики \"Counter-Techies Win\" и \"Bomb has been planted\" что является отсылкой к другой игре Valve - Counter-Strike.","Фраза \"Who said we couldn't count to three, huh?\" является отсылкой к шуточному мнению про то, что Valve не умеет считать до трех.","Реплики \"They're going to have to glue you back together! Yeah, in Hell!\" и \"We're sorry buncha losers. You said it\" принадлежат Подрывнику из игры Team Fortress 2, также принадлежащей Valve.","Одна из реплик Techies при атаке \"See! Fore!\" является омонимом на взрывчатку C4.","Трещины бочки на иконке Remote Mines образуют лицо Trollface."],"talents":["+25 к скорости передвижения всех мин:+251 к урону","+150 золота в минуту:+50 к скорости передвижения","+6 маны в секунду:+300 к урону от Blast Off","-4 сек. к перезарядке Proximity Mines:+30% к получаемому опыту"],"desc":"Techies — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Его первая способность Proximity Mines, позволяет устанавливает невидимую мину, которая взорвется при приближении врага. Мина также наносит урон строениям. Вторая способность Stasis Trap, позволяет устанавливает невидимую ловушку, которая оглушает вражеских юнитов вокруг нее при срабатывании. Третьей способностью Blast Off! герой совершает опасный прыжок в указанную точку, наносящий огромный урон по площади. Каждый попавший в радиус взрыва противник на время лишается возможности использовать способности. Сам Techies получает урон, равный 50% от максимального. Ультимативная способность Remote Mines, также позволяет устанавливает невидимую мину, которая взрывается только при активации вручную либо способностью Focused Detonate, которая активирует все мины в радиусе. Не наносит урон строениям. Улучшается с Aghanim's Scepter. Также у героя есть способность Minefield Sign, позволяющая устанавливать предостерегающую табличку. Улучшается с Aghanim's Scepter, позволяя скрывать мины и ловушки в радиусе вокруг таблички от раскрытия невидимости."}