{
  "abilities": [
    {
      "notes": [
        "Талант на все атрибуты в общем даёт Chaos Knight: 100 здоровья, 0,5 регенерации здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 регенерации маны и 5 урона от атаки.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки.",
        "Талант на силу в общем даёт Chaos Knight: 240 здоровья, 1,2 регенерации здоровья и 12 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 сек. к мин.\/макс. длительности Chaos Bolt",
          "talentRight": "+10% к шансу срабатывания Chaos Strike"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Reality Rift проходит сквозь невоспр. к магии",
          "talentRight": "+8 сек. к длительности Phantasm"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-14% перезарядки заклинаний",
          "talentRight": "+12 к силе"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+5 ко всем атрибутам"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fe\/Chaos_Bolt.mp3\/revision\/latest?cb=20141129191856",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд летит со скоростью в 700 единиц.",
        "Длительность оглушения и количество урона отображаются над головой цели при поражении (видно как союзникам, так и противникам), при этом длительность указывается с округленным значением. При этом настоящая длительность не всегда равна целому значению, а варьируется между заданными (например, на 1 уровне способность может оглушить на 1,74 секунды).",
        "При этом настоящая длительность не всегда равна целому значению, а варьируется между заданными (например, на 1 уровне способность может оглушить на 1,74 секунды).",
        "Урон и длительность оглушения обратно связаны между собой, что означает, чем дольше длится оглушение, тем меньший урон нанесет способность, и наоборот. Это означает, что урон уменьшается на 9,47\/8,46\/7,88\/7,5 за каждые дополнительные 0,1 секунды оглушения. Уровень 1: 1,25 сек. – 180, 1,4875 сек. – 157,5, 1,725 сек. – 135, 1,9625 сек. – 112,5, 2,2 сек. – 90 (длительность оглушения – урон) Уровень 2: 1,5 сек. – 220, 1,825 сек. – 192,5, 2,15 сек. – 165, 2,475 сек. – 137,5, 2,8 сек. – 110 (длительность оглушения – урон) Уровень 3: 1,75 сек. – 260, 2,1625 сек. – 227,5, 2,575 сек. – 195, 2,9875 сек. – 162,5, 3,4 сек. – 130 (длительность оглушения – урон) Уровень 4: 2 сек. – 300, 2,5 сек. – 262,5, 3 сек. – 225, 3,5 сек. – 187,5, 4 сек. – 150 (длительность оглушения – урон)",
        "Это означает, что урон уменьшается на 9,47\/8,46\/7,88\/7,5 за каждые дополнительные 0,1 секунды оглушения.",
        "Уровень 1: 1,25 сек. – 180, 1,4875 сек. – 157,5, 1,725 сек. – 135, 1,9625 сек. – 112,5, 2,2 сек. – 90 (длительность оглушения – урон)",
        "Уровень 2: 1,5 сек. – 220, 1,825 сек. – 192,5, 2,15 сек. – 165, 2,475 сек. – 137,5, 2,8 сек. – 110 (длительность оглушения – урон)",
        "Уровень 3: 1,75 сек. – 260, 2,1625 сек. – 227,5, 2,575 сек. – 195, 2,9875 сек. – 162,5, 3,4 сек. – 130 (длительность оглушения – урон)",
        "Уровень 4: 2 сек. – 300, 2,5 сек. – 262,5, 3 сек. – 225, 3,5 сек. – 187,5, 4 сек. – 150 (длительность оглушения – урон)",
        "Способность сначала применяет дебафф, затем наносит урон.",
        "Все иллюзии в радиусе 600 от цели, принадлежащие Chaos Knight, так же выпускают фальшивые Chaos Bolt. Они используют ту же анимацию применения и выпускают свои заряды одновременно с настоящим. Когда иллюзии не имеют никаких приказов и спокойно стоят, они поворачиваются к цели и используют фальшивые заряды. Когда иллюзии двигаются или атакуют, они продолжают это делать и не поворачиваются к цели. У них проиграется анимация использования, перекрывающая их анимации движения или атаки. При отмене использования иллюзии все равно проигрывают полностью анимацию применения, но заряды не выпускают. Фальшивые заряды ни с чем не взаимодействуют: не наносят урон и не оглушают.",
        "Они используют ту же анимацию применения и выпускают свои заряды одновременно с настоящим.",
        "Когда иллюзии не имеют никаких приказов и спокойно стоят, они поворачиваются к цели и используют фальшивые заряды.",
        "Когда иллюзии двигаются или атакуют, они продолжают это делать и не поворачиваются к цели. У них проиграется анимация использования, перекрывающая их анимации движения или атаки.",
        "При отмене использования иллюзии все равно проигрывают полностью анимацию применения, но заряды не выпускают.",
        "Фальшивые заряды ни с чем не взаимодействуют: не наносят урон и не оглушают.",
        "При улучшении с помощью Aghanim's Shard создаёт контролируемую иллюзию Chaos Knight при успешномпопадании по цели. Созданная иллюзия полностью соответствует характеристикам Phantasm, использует её значения урона и является сильной иллюзией. Длительность жизни иллюзии соответствует случайному времени оглушения цели Chaos Bolt. Длительность игнорирует сопротивление эффектам и увеличение длительности отрицательных эффектов. Развеивание оглушения или смерть цели не убьют иллюзию. Если Phantasm не изучен, то иллюзия не появится. Иллюзия появляется именно на местоположении цели и автоматически начинает атаковать врага.",
        "Созданная иллюзия полностью соответствует характеристикам Phantasm, использует её значения урона и является сильной иллюзией.",
        "Длительность жизни иллюзии соответствует случайному времени оглушения цели Chaos Bolt.",
        "Длительность игнорирует сопротивление эффектам и увеличение длительности отрицательных эффектов.",
        "Развеивание оглушения или смерть цели не убьют иллюзию.",
        "Если Phantasm не изучен, то иллюзия не появится.",
        "Иллюзия появляется именно на местоположении цели и автоматически начинает атаковать врага."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "Q",
      "cooldown": "13\/12\/11\/10 (TagTalent 11,18\/10,32\/9,46\/8,6)",
      "description": "Выпускает таинственный заряд энергии в указанного врага, оглушая его на случайное время и нанося случайный урон.",
      "spellName": "Chaos Bolt",
      "params": [
        "Анимация применения: 0,4+0,73",
        "Дальность применения: 500 (TagTalent 800)",
        "Минимальный урон: 90\/110\/130\/150",
        "Максимальный урон: 180\/220\/260\/300",
        "Мин. длительность оглушения: 1,25\/1,5\/1,75\/2 (TagTalent 2,25\/2,5\/2,75\/3)",
        "Макс. длительность оглушения: 2,2\/2,8\/3,4\/4 (TagTalent 3,2\/3,8\/4,4\/5)",
        "Число создаваемых иллюзий от Phantasm: 0 (TagTalent 1)",
        "Снаряд Chaos Bolt создаёт копию от способности Phantasm, которая атакует цель во время оглушения. Увеличивает дальность применения на 300.",
        "Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Даже всадник раздора не способен предсказать поведение этого сгустка нечистой энергии."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Reality_Rift.mp3\/revision\/latest?cb=20141129192016",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "С помощью Reality Rift нельзя избегать снаряды.",
        "Телепортирует Chaos Knight в точку на линии между героем и целью на расстоянии 250\/300\/350\/400 от начальной позиции цели. Цель телепортируется в 62 единицах перед точкой, поэтому по факту она притягивается на расстояние 188\/238\/288\/338. Иллюзии развернуты под случайными углами вокруг цели на том же расстоянии, что и Chaos Knight. Позиция определяется при начале применения. Визуальные эффекты также проигрываются в начале применения, показывая точку для перемещения Chaos Knight и его цели. Иллюзии и Chaos Knight смотрят в сторону цели и получают приказ на её атаку.",
        "Цель телепортируется в 62 единицах перед точкой, поэтому по факту она притягивается на расстояние 188\/238\/288\/338.",
        "Иллюзии развернуты под случайными углами вокруг цели на том же расстоянии, что и Chaos Knight.",
        "Позиция определяется при начале применения.",
        "Визуальные эффекты также проигрываются в начале применения, показывая точку для перемещения Chaos Knight и его цели.",
        "Иллюзии и Chaos Knight смотрят в сторону цели и получают приказ на её атаку.",
        "При применении на Рошана Chaos Knight (и его иллюзии) перемещается к Рошану, но он сам позиции не меняет.",
        "Снижение брони применяется к цели при использовании способности. Chaos Knight не нужно отдавать приказ на атаку для применения дебаффа.",
        "Дебафф от нескольких применений не складывается, но обновляет длительность.",
        "Не прерывает произносимые заклинания цели."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "15\/12\/9\/6 (TagTalent 12,9\/10,32\/7,74\/5,16)",
      "description": "Переносит героя, все его иллюзии и выбранного врага в точку между владельцем способности и жертвой. Уменьшает броню цели на 6 сек.",
      "spellName": "Reality Rift",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 550\/600\/650\/750",
        "Радиус для телепортации иллюзий: 1375",
        "Дистанция притягивания цели: 250\/300\/350\/400",
        "Снижение брони: 3\/4\/5\/6",
        "Длительность: 6",
        "Невозможно применить или наложить этот дебафф на существ с иммунитетом к заклинаниям. (TagTalent Можно применить или наложить этот дебафф на существ с иммунитетом.)"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Армагеддон перемещается между мирами, доставляя своего наездника к жертве, где бы та ни была."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Chaos_Strike.mp3\/revision\/latest?cb=20150210213513",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Увеличивает урон от атаки в среднем на 6% ‒ 12%\/21%\/30%\/39% (TagTalent 8% ‒ 16%\/28%\/40%\/52%).",
        "Шанс срабатывания от нескольких источников критического удара сочетается. Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора.",
        "Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора.",
        "Вампиризм от способности сочетается с другими источниками вампиризма.",
        "Не срабатывает при атаке вардов, строений и союзников.",
        "Звук и частицы критического удара воспроизводится при замахе, а не при попадании атаки."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой имеет шанс нанести критический удар случайной силы и восстанавливает себе здоровье на часть от нанесённого урона.",
      "spellName": "Chaos Strike",
      "params": [
        "Шанс: 30% (TagTalent 40%)",
        "Мин. критический урон: 120%",
        "Макс. критический урон: 140%\/170%\/200%\/230%",
        "Вампиризм: 25%\/40%\/55%\/70%",
        "Красные цифры критического урона отображаются до учета уменьшения урона от иллюзий и брони. Вампиризм работает на иллюзиях."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Неудержимая мощь всадника сокрушает даже самые толстые доспехи тех, кто осмелился выступить против него."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Phantasm.mp3\/revision\/latest?cb=20190825175651",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя (TagAghanim Союзных героев)"
      ],
      "notes": [
        "При применении позволяет избегать снаряды.",
        "Во время разделения Chaos Knight неуязвим, спрятан и на него действует иммунитет к заклинаниям.",
        "При использовании применяет базовое развеивание к Chaos Knight.",
        "Сбрасывает текущий приоритет по выбору целью атак и заклинаний Chaos Knight.",
        "После завершения разделения Chaos Knight появляется со своими иллюзиями. Место появления зависит от позиции Chaos Knight при применении способности: одно из существ появляется на месте применения, остальные - на севере, западе, юге или востоке от этой точки. То есть при появлении 3 иллюзий расположение выглядит как буква Т. Расстояние между существами составляет 135 единиц. Поскольку порядок расположения всегда один и тот же, то Chaos Knight и иллюзии занимают случайное положение, но все существа смотрят в одну и ту же сторону.",
        "Место появления зависит от позиции Chaos Knight при применении способности: одно из существ появляется на месте применения, остальные - на севере, западе, юге или востоке от этой точки.",
        "То есть при появлении 3 иллюзий расположение выглядит как буква Т.",
        "Расстояние между существами составляет 135 единиц.",
        "Поскольку порядок расположения всегда один и тот же, то Chaos Knight и иллюзии занимают случайное положение, но все существа смотрят в одну и ту же сторону.",
        "Способность отдает команду \"стоп\" заклинателю после разделения, отменяя все приказы, отданные до или во время разделения.",
        "Повторное применение Phantasm заменяет иллюзии от предыдущего применения независимо от того, под чьим контролем они находятся.",
        "Иллюзии, созданные Phantasm — сильные, то есть они не исчезают от способностей, обычно уничтожающих иллюзии.",
        "При улучшении Phantasm создает иллюзию каждого союзного героя, подконтрольные Chaos Knight. Также применяет базовое развеивание к союзникам, но не позволяет им избежать снаряды. Союзники не становятся неуязвимыми и спрятанными, а их действия не прерываются. Союзники и иллюзии используют то же положение, что и Chaos Knight, а их позиции так же меняются местами с иллюзиями. Действует на всех союзных героев, включая клонов. Не действует на неуязвимых или спрятанных союзников.",
        "Также применяет базовое развеивание к союзникам, но не позволяет им избежать снаряды.",
        "Союзники не становятся неуязвимыми и спрятанными, а их действия не прерываются.",
        "Союзники и иллюзии используют то же положение, что и Chaos Knight, а их позиции так же меняются местами с иллюзиями.",
        "Действует на всех союзных героев, включая клонов. Не действует на неуязвимых или спрятанных союзников."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "R",
      "cooldown": "75 (TagTalent 64.5)",
      "description": "Призывает несколько копий героя из параллельных измерений. Иллюзии наносят 100% урона, а получают 325% урона.",
      "spellName": "Phantasm",
      "params": [
        "Анимация применения: 0,4+0",
        "Время разделения: 0,5",
        "Количество иллюзий: 1\/2\/3 (TagAghanim 4)",
        "Количество иллюзий союзников: 0 (TagAghanim 1)",
        "Иллюзии наносят урона: 100%",
        "Иллюзии получают урона: 325%",
        "Длительность: 30 (TagTalent 38)",
        "Помимо обычных иллюзий создаёт иллюзию каждого героя из своей команды, включая владельца."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Всадник хаоса участвовал в боях во многих мирах и в разные времена. Фантомы тех боев присоединяются к герою, чтобы повергнуть его врагов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.2,
    "attrAgilityInc": 1.4,
    "attrAgility": 18.0
  },
  "description": "Chaos Knight — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Chaos Bolt, выпускает таинственный заряд энергии в указанного врага. Заряд оглушает цель на случайное время и наносит случайный урон. Вторая способность, Reality Rift, телепортирует героя, все его иллюзии и цель в случайную точку между Chaos Knight и врагом. Снижает броню цели. Пассивная способность, Chaos Strike, Наносит критический удар и восстанавливает часть здоровья от нанесённого урона. Ультимативная способность, Phantasm, призывает несколько копий Chaos Knight из параллельных измерений. Иллюзии наносят полный урон, но получают удвоенный.",
  "history": "Сей рыцарь — ветеран бесчисленных сражений в мириадах миров, и появился он в далёком первичном измерении, где фундаментальные законы вселенной обрели разумное воплощение. Из древних Предвечных он самый старший и неутомимый, и он неизменно ищет сущность, что знает лишь под именем Свет. Давным-давно Свет нарушил первое соглашение, покинув прародительский мир. И теперь старший собрат путешествует из мира в мир в бесконечной охоте на Свет, стремясь затушить его везде, где он объявится. Тысячу раз источник сияния гас, и всякий раз рыцарь уходит в другое измерение, дабы продолжить поиски. Он скачет на Армаггедоне, яростно вступает в битвы, черпая силу из хаоса вселенной. Он — физическое воплощение самого хаоса. При нужде он призывает образы самого себя из других миров, и тогда тёмные наездники вместе мчатся в битву, непреодолимые, словно сила стихии. Поиск окончится, только когда последний Свет во вселенной погаснет. За хаосом последует смерть.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 сек. к мин.\/макс. длительности Chaos Bolt",
      "talentRight": "+10% к шансу срабатывания Chaos Strike"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Reality Rift проходит сквозь невоспр. к магии",
      "talentRight": "+8 сек. к длительности Phantasm"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-14% перезарядки заклинаний",
      "talentRight": "+12 к силе"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+5 ко всем атрибутам"
    }
  ]
}