{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на уклонение мультипликативно складывается с другими источниками уклонения."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,5 сек. действия Rage",
          "talentRight": "+1,2% к вампиризму от Feast"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-4 сек. перезарядки Open Wounds",
          "talentRight": "+16% к уклонению"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+25 к урону"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+30 к скорости атаки",
          "talentRight": "+200 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Lifestealer_Rage.mp3\/revision\/latest?cb=20191216015435",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Lifestealer.",
        "Применяет иммунитет к заклинаниям на длительность способности и базовое развеивание при использовании.",
        "Во время действия Lifestealer не получает эффекта от Ghost Scepter. Бафф мгновенно снимается."
      ],
      "mana": "75",
      "hotKey": "Q",
      "cooldown": "18",
      "description": "Погружаясь в безумную ярость, герой становится невосприимчивым к магии, получая полное сопротивление магическому урону, а его скорость передвижения увеличивается.",
      "spellName": "Rage",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость передвижения: 15%",
        "Длительность: 3\/4\/5\/6 (TagTalent 4,5\/5,5\/6,5\/7,5)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Безумие и жесткость делают Н'эйкса злобным и безжалостным противником."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Складывается с другими источниками вампиризма.",
        "Не дает лечения при атаке вардов, строений и союзных существ.",
        "На вампиризм Feast действует усиление вампиризма.",
        "Не действует на Рошана."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Каждая атака лечит героя на долю от максимального здоровья противника. Увеличивает скорость атаки.",
      "spellName": "Feast",
      "params": [
        "Вампиризм от макс. здоровья врага: 1,5%\/2%\/2,5%\/3% (TagTalent 2,7%\/3,2%\/3,7%\/4,2%)",
        "Доп. скорость атаки: 15\/30\/45\/60"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "После побега из темницы Деварка Н'эйкс начал питаться плотью и костьми тех, кому не посчастливилось с ним встретиться."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Lifestealer_Open_Wounds.mp3\/revision\/latest?cb=20191216015434",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Замедляет цель на 70%\/70%\/60%\/50%\/30%\/10%\/10%\/10%, уменьшаясь на каждую фазу раз в секунду.",
        "Применение мгновенно убивающей способности на цель Open Wounds вылечит заклинателя на значение, равное оставшемуся здоровью существа.",
        "Не лечит врагов, атакующих своего союзника, или существо, наносящее себе урон.",
        "Складывается с другими источниками вампиризма.",
        "Не лечит при нанесении урона, отмеченного как отнимающий здоровье."
      ],
      "mana": "140",
      "hotKey": "E",
      "cooldown": "24\/20\/16\/12 (TagTalent 20\/16\/12\/8)",
      "description": "Герой разрывает плоть вражеского существа, замедляя его и позволяя своим союзникам питаться его жизненной силой, получая в качестве здоровья часть нанесённого врагу урона. Вампиризм действует на любой вид урона, в том числе и от способностей. Скорость передвижения жертвы постепенно восстанавливается.",
      "spellName": "Open Wounds",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 200\/300\/400\/500",
        "Вампиризм: 35%",
        "Макс. замедление скорости передвижения: 70%",
        "Длительность замедления: 8",
        "Замедление остается и лечение действует, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Открытые раны и запах крови часто привлекают падальщиков, заканчивающих дело за хищником."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0e\/Lifestealer_Infest.mp3\/revision\/latest?cb=20191216015431",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании применяет базовое развеивание к Lifestealer и позволяет избегать снаряды.",
        "Во время действия Infest Lifestealer неуязвим и спрятан.",
        "Во время действия Infest Lifestealer продолжает получать опыт и золото.",
        "Во время действия Infest все три способности Lifestealer становятся неактивными, а Infest заменяется на Consume.",
        "Во время действия Infest Lifestealer периодически перемещается к текущему местоположению носителя. Это затрагивает несколько вариантов: При завершении Infest (использование Consume или смерть носителя) Lifestealer появляется на месте носителя. Любая аура, имеющаяся у Lifestealer (включая Gem of True Sight и Radiance), действует на существ вокруг носителя. Эффекты, реагирующие на наличие героев, как, например Smoke of Deceit, Marksmanship или Blur, срабатывают от присутствия носителя. Relocate вытаскивают Lifestealer из носителя, нанося урон по области. При использовании Lifestealer Infest Holy Persuasion развеивается.",
        "При завершении Infest (использование Consume или смерть носителя) Lifestealer появляется на месте носителя.",
        "Любая аура, имеющаяся у Lifestealer (включая Gem of True Sight и Radiance), действует на существ вокруг носителя.",
        "Эффекты, реагирующие на наличие героев, как, например Smoke of Deceit, Marksmanship или Blur, срабатывают от присутствия носителя.",
        "Relocate вытаскивают Lifestealer из носителя, нанося урон по области.",
        "При использовании Lifestealer Infest Holy Persuasion развеивается.",
        "Восстанавливает до 180%\/240%\/300% от максимального здоровья Lifestealer в минуту.",
        "Может восстановить всё здоровье Lifestealer за 33,33\/25\/20 сек.",
        "Текущее и максимальное здоровье зараженного существа увеличиваются на заданное значение. Увеличение текущего здоровья не считается лечением и ничем не учитывается.",
        "Увеличение текущего здоровья не считается лечением и ничем не учитывается.",
        "Также скорость передвижение существа увеличивается на заданное значение. Если цель не герой или крип-герой, то её базовая скорость передвижения приравнивается к текущей скорости Lifestealer.",
        "Если цель не герой или крип-герой, то её базовая скорость передвижения приравнивается к текущей скорости Lifestealer.",
        "Если цель не герой, то Lifestealer автоматически получает над ней контроль, превращая её в подконтрольное существо. Если цель — враг, то он сохраняет цвет полосы здоровья, поэтому противникам сложнее отличить его от других существ.",
        "Если цель — враг, то он сохраняет цвет полосы здоровья, поэтому противникам сложнее отличить его от других существ.",
        "Можно использовать на союзных героев и крипов-героев, но без получения над ними контроля.",
        "На 2-м уровне способность можно применять на древних крипов и брать их под контроль.",
        "Нельзя применить на Рошана, курьеров, варды, постройки, вражеских героев и крипов-героев.",
        "Носитель получает модификатор Infest Effect, создающий над ним визуальный эффект, видимый только союзникам.",
        "Перезарядка Infest начинается после покидания зараженного существа, а не при использовании заклинания.",
        "С Aghanim's Scepter к цели заклинания применяется Rage текущего уровня. Rage действует на существо всю базовую длительность или до покидания цели Lifestealer — в зависимости от того, что произойдет раньше. В режиме Ability Draft для действия улучшения должна быть выбрана Rage.",
        "Rage действует на существо всю базовую длительность или до покидания цели Lifestealer — в зависимости от того, что произойдет раньше.",
        "В режиме Ability Draft для действия улучшения должна быть выбрана Rage."
      ],
      "mana": "50",
      "hotKey": "R",
      "cooldown": "100\/75\/50 (TagTalent 25)",
      "description": "Герой забирается в тело выбранного существа, становясь незаметным для противников. После этого он может вырваться из носителя, нанеся урон окружающим врагам. Находясь внутри вражеского или нейтрального крипа, герой может полностью управлять им или сожрать крипа изнутри, излечившись на количество его текущего здоровья. Не действует на вражеских героев.",
      "spellName": "Infest",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 150 (TagAghanim 600)",
        "Доп. макс. здоровье цели: 400\/800\/1200",
        "Доп. скорость передвижения цели: 15%\/20%\/25%",
        "Доп. лечение заклинателя от макс. здоровья: 3%\/4%\/5%",
        "Уменьшает перезарядку, увеличивает дальность применения и накладывает на цель эффект способности Rage.",
        "Может управлять существами с иммунитетом к заклинаниями."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Вгрызаясь в плоть врага, Н'эйкс питается его кровью, восстанавливая свою нечистую силу."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Lifestealer_Consume.mp3\/revision\/latest?cb=20191216015429",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "Способность появляется после использования Infest и остается до покидания носителя Lifestealer. Если цель не герой или крип-герой и Lifestealer получает над неё контроль, то способность также показывает интерфейс существа и появляется в 4 слоте.",
        "Если цель не герой или крип-герой и Lifestealer получает над неё контроль, то способность также показывает интерфейс существа и появляется в 4 слоте.",
        "Если носитель умирает до поглощения, то урон по области всё равно наносится.",
        "Не убивает и не наносит вреда союзным героям или крипам-героям.",
        "Урон по области наносится мгновенно.",
        "Классическая клавиша меняется в зависимости от взятого под контроль существа."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Герой пожирает тело носителя изнутри, выбираясь наружу и нанося урон всем вокруг.",
      "spellName": "Consume",
      "params": [
        "Анимация применения: 0+0",
        "Радиус урона: 700",
        "Урон: 150\/275\/400"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 25.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.4,
    "attrAgility": 18.0
  },
  "description": "Lifestealer — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Rage, дает невосприимчивость к заклинаниям и увеличивает скорость передвижения. Вторая способность, Feast, пассивно лечит за каждую атаку на долю от максимального здоровья противника и даёт скорость атаки. Третья способность, Open Wounds, разрывает плоть вражеского юнита, замедляя его и позволяя своим союзникам питаться его жизненной силой, получая в качестве здоровья часть нанесенного врагу урона. Любой вид урона будет высасывать жизнь, включая урон от заклинаний. Скорость передвижения жертвы постепенно восстанавливается. Ультимативной способностью, Infest, Lifestealer вселяется в тело выбранного юнита, становясь незаметным для окружающих. Он получает возможность мгновенно выбраться из него подспособностью Consume, нанести урон окружающим врагам и при этом излечиться на определенное количество здоровья, а также пассивно излечивает здоровье Lifestealer в процентах. Если целью является крип, то Lifestealer получает возможность полностью управлять им подспособностью Control. Улучшение с Aghanim's Scepter улучшает способность, Infest, позволяющую Lifestealer дать союзнику, в которого вселился Lifestealer бонус от способности Rage.",
  "history": "В темнице Деварка томился закованный в кандалы мстительный маг, замышлявший побег. Он делил камеру с невнятно бормочущим существом по имени Н'эйкс — вором, которого Чёрствый совет проклял вечной жизнью, чтобы наказание за воровство и мошенничество проучило его как следует. За долгие годы цепи заключённого проржавели, как и его разум, и Н'эйкс уже не помнил, кем был раньше, и больше не мечтал сбежать. В нём волшебник увидел идеальный инструмент и, сплетя заклинание Заражения, заключил свою жизненную силу в тело вора, чтобы заставить того пожертвовать собой и пройти по подземельям ураганом разрушения, пока сам маг вернулся бы в своё тело и сбежал незамеченным. Но разум мага оказался в таком мощном водовороте безумия, что всего его планы были забыты, а воля сломлена. А вот Н'эйкс, которого внезапный прилив свежей жизни пробудил от кошмарного безумия, подчинился бесплотному голосу у себя в черепной коробке, который повторял лишь одно слово: «Сбежать». В тот момент и родилось это существо. Оно поглощало сознание стражей и солдат, заставляя тех открывать замки и убивать друг друга, и вышло на свободу, питаясь жизнью жертв. Оно до сих пор носит на себе разорванные кандалы, чтобы каждый знал: никто больше не заберёт его свободу... Но до сих пор он остаётся узником. В одном теле живут две сущности: безымянный жестокий вор и Хозяин, чьему гласу вор будто бы подчиняется.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,5 сек. действия Rage",
      "talentRight": "+1,2% к вампиризму от Feast"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-4 сек. перезарядки Open Wounds",
      "talentRight": "+16% к уклонению"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+25 к урону"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+30 к скорости атаки",
      "talentRight": "+200 к здоровью"
    }
  ]
}