{
  "abilities": [
    {
      "notes": [
        "Talents are fully copied by the Wukong's Command clones, but none of the current talents have an effect, as they cannot use active abilities and their attack speed is fixed."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 Wukong's Command Ring",
          "talentRight": "+200 Armor Wukong's Command"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+350 Primal Spring Damage",
          "talentRight": "+40% Boundless Strike Crit"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 Jingu Mastery Damage",
          "talentRight": "+475 Tree Dance Cast Range"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Attack Speed",
          "talentRight": "+400 Tree Dance Vision AoE"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Monkey_King_Boundless_Strike.mp3\/revision\/latest?cb=20191216020658",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "Boundless Strike's effects are instantly applied within its whole area. There is no travel time.",
        "The effect starts 75 range in front of Monkey King and has an actual length of 1125, adding up to 1200 effective length. It can hit units up to 1350 range away (starting distance + length + width). It can also hit units 75 range behind Monkey King, due to its radius and starting position.",
        "It can hit units up to 1350 range away (starting distance + length + width).",
        "It can also hit units 75 range behind Monkey King, due to its radius and starting position.",
        "Causes Monkey King to perform an instant attack on all hit enemies. The stun is independent from these attacks. These attacks have True Strike, and can therefore never miss. They also ignore disarms. Can proc any attack modifier on all of the hit targets normally, with cleave being the only exception. Also procs Jingu Mastery, placing the debuff on all hit enemy heroes, or adding to the counter if already debuffed. Despite the audio, Daedalus has still only a chance to proc. Boundless Strike does not guarantee chance-based effects to proc. Since Boundless Strike has an ensured critical hit, crits with a lower value have no effect if they proc (higher crit value takes priority).",
        "These attacks have True Strike, and can therefore never miss. They also ignore disarms.",
        "Can proc any attack modifier on all of the hit targets normally, with cleave being the only exception.",
        "Also procs Jingu Mastery, placing the debuff on all hit enemy heroes, or adding to the counter if already debuffed.",
        "Despite the audio, Daedalus has still only a chance to proc. Boundless Strike does not guarantee chance-based effects to proc.",
        "Since Boundless Strike has an ensured critical hit, crits with a lower value have no effect if they proc (higher crit value takes priority).",
        "Jingu Mastery loses a charge whenever Boundless Strike is cast, regardless of whether it hits a unit or not. The bonus attack damage is applied to all hit targets, and it does lifesteal for each hit target, despite using up only one charge.",
        "The bonus attack damage is applied to all hit targets, and it does lifesteal for each hit target, despite using up only one charge.",
        "The strike first applies the debuff, then the damage.",
        "The sound during the cast animation is audible to everyone."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "22",
      "description": "Monkey King enlarges his staff and slams it against the ground, stunning enemies in a line and damaging them with a critical hit based on his attack. Has True Strike.",
      "spellName": "Boundless Strike",
      "params": [
        "Cast Animation: 0.4+0.5",
        "Cast Range: 1200",
        "Effect Length: 1200",
        "Effect Width: 150",
        "Critical Damage: 150%\/175%\/200%\/225% (TagTalent 190%\/215%\/240%\/265%)",
        "Stun Duration: 0.7\/1\/1.3\/1.6"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "The legendary Jingu Bang grows to match its master's will, ensuring no enemy can escape the Monkey King's reach."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Monkey_King_Tree_Dance_1.mp3\/revision\/latest?cb=20191216020644",
      "effects": [
        "Ability Target Unit",
        "Affects Self \/ Trees"
      ],
      "notes": [
        "Leveling up Tree Dance also levels up Primal Spring.",
        "Monkey king leaps to the target tree at a speed of 700, reaching the tree within up to 1.43 (TagTalent 2.11) seconds.",
        "Leaps in an arc, with a top height of 192. During the leap, other units may pass below Monkey King.",
        "Although it visually looks like Monkey King is above the ground while perched, he still is considered to be on the ground. The height is part of the animations.",
        "Tree Dance has several different cooldowns which activate at different times. Upon cast, the leap duration is added to the cooldown, resulting in a cooldown of 1.1 (TagTalent 0.5) to up to 2.43 (TagTalent 3.11) (TagTalent 1.83, 2.51) seconds, based on the distance. Upon reaching the tree, it goes on cooldown for 1 (TagTalent 0.4) second, which matters only if the cast cooldown was skipped (with e.g. Chakra Magic). Upon unperching with a move or attack command, it goes on cooldown for 1 (TagTalent 0.4) seconds. Does not go on cooldown when unperched in other ways. Upon taking player-based or Roshan-based damage greater than 0 while on the ground (excluding damage flagged as HP Removal), it goes on a 3-second cooldown. All of these cooldowns are unaffected by percentage-based cooldown reductions. Flat reductions and cooldown resets work.",
        "Upon cast, the leap duration is added to the cooldown, resulting in a cooldown of 1.1 (TagTalent 0.5) to up to 2.43 (TagTalent 3.11) (TagTalent 1.83, 2.51) seconds, based on the distance.",
        "Upon reaching the tree, it goes on cooldown for 1 (TagTalent 0.4) second, which matters only if the cast cooldown was skipped (with e.g. Chakra Magic).",
        "Upon unperching with a move or attack command, it goes on cooldown for 1 (TagTalent 0.4) seconds. Does not go on cooldown when unperched in other ways.",
        "Upon taking player-based or Roshan-based damage greater than 0 while on the ground (excluding damage flagged as HP Removal), it goes on a 3-second cooldown.",
        "All of these cooldowns are unaffected by percentage-based cooldown reductions. Flat reductions and cooldown resets work.",
        "During the leap, Monkey King is disabled, unable to perform any actions. The last given order gets queued up and executed as soon as he lands.",
        "During the leap and while on a tree, Monkey King gains flying vision, but has his vision reduced to 800\/400 (TagTalent 1200\/800). Moon Shard's bonus night vision still works, while Nightmare and Smoke Screen do not affect Monkey King's vision while on a tree.",
        "Moon Shard's bonus night vision still works, while Nightmare and Smoke Screen do not affect Monkey King's vision while on a tree.",
        "While perched on a tree, Monkey King is hidden from sight. He can only be seen with flying vision. He can also be seen when standing 2 levels of ground higher than the tree Monkey King sits on, allowing wards to spot him when the ward is on an elevated ward spot. However, he cannot be seen when getting hurled in the air by spells (e.g. Toss). Only standing on high ground may grant vision over him.",
        "He can also be seen when standing 2 levels of ground higher than the tree Monkey King sits on, allowing wards to spot him when the ward is on an elevated ward spot.",
        "However, he cannot be seen when getting hurled in the air by spells (e.g. Toss). Only standing on high ground may grant vision over him.",
        "While on a tree, Monkey King can perform any action normally, with some of them unperching him, while others do not. Casting Boundless Strike, Mischief or any item ability does not unperch him. Casting Wukong's Command, moving or attacking does unperch him. Directional Move and Patrol have no effect when ordered while on a tree, so that Monkey King stays perched. While on cooldown on a tree, Monkey King is disarmed and he cannot move, which prevents him from getting off the tree with move and attack commands. Forced movement unperches Monkey King as well. This includes the effects of Blink Dagger, Eul's Scepter of Divinity, Force Staff and Hurricane Pike.",
        "Casting Boundless Strike, Mischief or any item ability does not unperch him.",
        "Casting Wukong's Command, moving or attacking does unperch him.",
        "Directional Move and Patrol have no effect when ordered while on a tree, so that Monkey King stays perched.",
        "While on cooldown on a tree, Monkey King is disarmed and he cannot move, which prevents him from getting off the tree with move and attack commands.",
        "Forced movement unperches Monkey King as well. This includes the effects of Blink Dagger, Eul's Scepter of Divinity, Force Staff and Hurricane Pike.",
        "While on a tree, Tree Dance can be cast again, targeting another nearby tree. All trees within cast range are highlighted with a white glow. In Ability Draft, this is not possible. While on a tree, Tree Dance gets replaced by Primal Spring.",
        "In Ability Draft, this is not possible. While on a tree, Tree Dance gets replaced by Primal Spring.",
        "Monkey King only gets stunned if the tree he leaps towards, or he sits on, gets destroyed. Getting unperched in other ways (e.g. forced movement) does not result in a stun.",
        "The Tree Dance activity modifier only appears during the leap and is responsible for the jump animation."
      ],
      "mana": "0",
      "hotKey": "W",
      "cooldown": "1 (TagTalent 0.4)",
      "description": "Monkey King jumps to a tree and perches atop it. While perched, he gains the Primal Spring ability-a channeled leap attack. If Monkey King's tree is destroyed, he falls and is stunned for 4 seconds. Taking damage from player controlled units or Roshan while on the ground puts Tree Dance on cooldown.",
      "spellName": "Tree Dance",
      "params": [
        "Cast Animation: 0.3+0 (TagTalent 0.1+0)",
        "Cast Range: 1000 (TagTalent 1475)",
        "Damage Cooldown: 3",
        "Day Tree Vision: 800 (TagTalent 1200)",
        "Night Tree Vision: 400 (TagTalent 800)",
        "Unperch Stun Duration: 4",
        "Reduces cooldown to 0.4 and cast point to 0.1.",
        "The stun upon falling off of a tree pierces spell immunity.",
        "Getting rooted while already leaping does not cancel the leap."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Sun Wukong dances nimbly along the treetop canopy, always just out of arm's reach."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Monkey_King_Primal_Spring_1.mp3\/revision\/latest?cb=20191216020640",
      "effects": [
        "Ability Target Area \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "This ability is automatically leveled whenever Tree Dance is leveled.",
        "This ability is only active during the cast time of Tree Dance, during the leap from the ground onto a tree and while on a tree. It is inactive while leaping from a tree to another tree, and while on the ground. In Ability Draft, Primal Spring takes Tree Dance's ability slot while on a tree, instead of being in a separate slot.",
        "It is inactive while leaping from a tree to another tree, and while on the ground.",
        "In Ability Draft, Primal Spring takes Tree Dance's ability slot while on a tree, instead of being in a separate slot.",
        "Since Tree Dance disables Monkey King during the leap, casting Primal Spring while leaping to a tree queues up the order, so that it is cast immediately once on the tree.",
        "Leaps towards the target area at a speed of 1300, reaching it in up to 0.77 seconds, based on distance.",
        "The damage and slow are based on the time spent channeling, meaning their potency increases per each server tick (0.03 seconds) spent channeling, up to 54 times. The damage increases by 2.642\/3.962\/5.283\/6.604 (TagTalent 9.245\/10.566\/11.887\/13.208) per server tick, starting immediately, reaching 142.6\/214\/285.3\/356.6 (TagTalent 499.2\/570.6\/641.9\/713.2) damage in 1.6 seconds. The slow increases by 0.4%\/0.8%\/1.1%\/1.5% per server tick, also starting immediately, reaching 20%\/40%\/60%\/80% slow in 1.6 seconds.",
        "The damage increases by 2.642\/3.962\/5.283\/6.604 (TagTalent 9.245\/10.566\/11.887\/13.208) per server tick, starting immediately, reaching 142.6\/214\/285.3\/356.6 (TagTalent 499.2\/570.6\/641.9\/713.2) damage in 1.6 seconds.",
        "The slow increases by 0.4%\/0.8%\/1.1%\/1.5% per server tick, also starting immediately, reaching 20%\/40%\/60%\/80% slow in 1.6 seconds.",
        "Hitting the same enemy multiple times with Primal Spring refreshes the slow duration, but does not update the slow value based on channel time.",
        "Primal Spring first applies the damage, then the debuff.",
        "During the leap, Monkey King still remember last given order and complete it once landing happens.",
        "If forced movement affect MK while jump happening, all Primal Spring's effect will be cancelled completely.",
        "The visual effects at the target area during the channeling are visible to allies only.",
        "The channeling sound is audible to enemies, even through the fog of war.",
        "The Tree Dance activity modifier only appears during the leap and is responsible for the jump animation."
      ],
      "mana": "100",
      "hotKey": "E",
      "cooldown": "19\/17\/15\/13",
      "description": "Monkey King springs out from his tree perch, damaging and slowing enemies in the area where he lands. Damage and slow amounts are in proportion to channel duration.",
      "spellName": "Primal Spring",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: Global",
        "Max Leap Distance: 1000",
        "Radius: 375",
        "Max Channel Time: 1.6",
        "Max Damage: 140\/210\/280\/350 (TagTalent 490\/560\/630\/700)",
        "Max Move Speed Slow: 20%\/40%\/60%\/80%",
        "Slow Duration: 4",
        "Getting rooted while already channeling or leaping does not cancel the spell."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Leaping from the safety of cover into the midst of his enemies, Sun Wukong attacks without mercy."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Replaces Primal Spring until the channeling ends.",
        "Immediately ends the channeling of Primal Spring, causing Monkey King to jump earlier.",
        "Cannot be shift-queued."
      ],
      "mana": "0",
      "hotKey": "E",
      "cooldown": "0",
      "description": "There is no description for this ability.",
      "spellName": "Spring Early",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Monkey_King_Jingu_Mastery.mp3\/revision\/latest?cb=20191216020638",
      "effects": [
        "Ability Passive",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Each successful attack done on an enemy hero while Monkey King does not have the damage and lifesteal buff places the debuff, or adds one to its counter if it already has the debuff.",
        "Only actual enemy heroes (including clones) can receive the debuff. Illusions and creep-heroes do not count. Allied heroes do not count either.",
        "The debuff's duration gets refreshed on each hit. The 4 hits do not all require to happen within 7\/8\/9\/10 seconds.",
        "Boundless Strike's instant-attack also counts and is able to place the debuff\/add to the debuff's counter.",
        "Upon hitting the same target 4 times, the debuff on the target disappears and Monkey King receives the attack damage and lifesteal buff.",
        "A charge gets used upon successfully attacking any unit, including buildings, wards and allied units, always applying the bonus damage.",
        "When leveling up Jingu Mastery while wielding the buff, the attack damage bonus and lifesteal updates after using one charge.",
        "The lifesteal does not work against buildings and allies, but works against any other unit, including wards.",
        "Stacks additively with other sources of lifesteal.",
        "Boundless Strike also uses Jingu Mastery's effects, hitting all enemies with the bonus damage and the lifesteal, but only using up one charge per cast. Even when not hitting any enemy, Boundless Strike still takes one charge of Jingu Mastery.",
        "Even when not hitting any enemy, Boundless Strike still takes one charge of Jingu Mastery."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Monkey King's attacks awaken the Jingu Bang's power. Upon the fourth hit on the same enemy hero, Monkey King earns four charged attacks that have bonus damage and lifesteal.",
      "spellName": "Jingu Mastery",
      "params": [
        "Required Hits: 4",
        "Charges: 4",
        "Attack Damage Bonus: 40\/70\/110\/130 (TagTalent 140\/170\/210\/230)",
        "Lifesteal: 15%\/30%\/45%\/60%",
        "Counter Duration: 7\/8\/9\/10",
        "Buff Duration: 35",
        "Disables both the adding of the counter and the buff on Monkey King."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Always sensitive to the moods of its master, the Jingu Bang radiates power when Sun Wukong's combat fervor is on full display."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c8\/Monkey_King_Mischief.mp3\/revision\/latest?cb=20200510123903",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "This is an innate ability and does not need to be learned. It is not bound to any ability, but to Monkey King himself.",
        "Interrupts Monkey King's channeling spells, move orders and attack orders upon cast.",
        "When cast, Mischief transforms Monkey King into one of the following items or units: Animal Courier (using the model of a courier on his team), Iron Branch, Clarity, Healing Salve, Town Portal Scroll, Banana (new or peeled), Tango.",
        "Animal Courier (using the model of a courier on his team), Iron Branch, Clarity, Healing Salve, Town Portal Scroll, Banana (new or peeled), Tango.",
        "When within 350 range of a courier, it transforms Monkey King into that courier.",
        "When a tree is within 350 range upon cast, it transforms Monkey King into that tree instead. If multiple trees are within range, a random one of them is chosen. This includes spawned trees from Sprout and Iron Branch.",
        "This includes spawned trees from Sprout and Iron Branch.",
        "When within 350 range of a rune spot, it transforms Monkey King into a random rune suitable for that rune spot.",
        "After Roshan's first death, Mischief transforms Monkey King into the Aegis of the Immortal when cast inside his pit. After his second death, it may also transform him into Cheese. After his third death, it may also transform him into Refresher Shard. While Roshan is dead, Mischief always transforms Monkey King into Roshan himself, when cast within his pit.",
        "After his second death, it may also transform him into Cheese. After his third death, it may also transform him into Refresher Shard.",
        "While Roshan is dead, Mischief always transforms Monkey King into Roshan himself, when cast within his pit.",
        "Monkey King's movement speed is set to 200 while transformed (380 when transformed as a courier). Besides with hastes, his movement speed cannot be altered by anything.",
        "Monkey King's selection box adapts to the disguise models. However, his collision size does not change.",
        "Monkey King's minimap icon is hidden to the enemy while disguised. In addition, his over-head health and mana bar is hidden to everyone, including the player.",
        "Auto-attack ignores the Monkey King, so that lane creeps, neutral creeps, towers and fountains do not automatically attack him. Units of players which have auto-attack enabled do not attack him automatically either, but can be forced to attack him. The ground-attack move also ignores him. Monkey King is still fully affected by every spell. He can be targeted normally. Attachable particle effects of spells still attach to him.",
        "Units of players which have auto-attack enabled do not attack him automatically either, but can be forced to attack him. The ground-attack move also ignores him.",
        "Monkey King is still fully affected by every spell. He can be targeted normally. Attachable particle effects of spells still attach to him.",
        "During the initial 0.2, Mischief fully negates damage, causing several on-damage effects to not trigger.",
        "Damage greater than 0 dispels the effect. Does not get dispelled by damage flagged as HP Removal."
      ],
      "mana": "0",
      "hotKey": "F",
      "cooldown": "15",
      "description": "Changes Monkey King's shape to deceive opponents, using the environment nearby as inspiration for the disguise. Taking damage, attacking, or using any item or ability breaks Monkey King's disguise. Grants damage immunity for 0.2 upon transforming.",
      "spellName": "Mischief",
      "params": [
        "Cast Animation: 0+0.53",
        "Set Move Speed (TagTalentDefault): 200",
        "Set Move Speed (TagTalentas Courier): 380",
        "Search Radius: 350",
        "Damage Immunity Duration: 0.2"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Watch out for that tree."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a5\/Monkey_King_Revert_Form.mp3\/revision\/latest?cb=20200510123905",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Replaces Mischief until the disguise ends.",
        "Interrupts Monkey King's channeling spells, move order and attack order upon cast."
      ],
      "mana": "0",
      "hotKey": "F",
      "cooldown": "1",
      "description": "Reverts Monkey King's shape to his original form.",
      "spellName": "Revert Form",
      "params": [
        "Cast Animation: 0+0.53"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Monkey_King_Wukong%27s_Command_1.mp3\/revision\/latest?cb=20191216020648",
      "effects": [
        "Ability Target Area",
        "Affects Enemy Heroes",
        "Damage Physical"
      ],
      "notes": [
        "Upon cast, 14 (TagTalent 21) clones of Monkey King spawn which immediately walk to their determined spot in the formation.",
        "The clones walk at a speed of 700 and have unobstructed movement, walking through cliffs and trees.",
        "The formation they take is always the same except when space is limited by the edges of the map. The first ring soldiers form a pentagon within a 300 radius circle, with the tip always facing north. The second ring soldiers form a nonagon within a 750 radius circle, with the tip always facing north as well. (TagTalent The third ring soldiers form a heptagon within a 1100 radius circle, with the tip always facing north as well.)",
        "The first ring soldiers form a pentagon within a 300 radius circle, with the tip always facing north.",
        "The second ring soldiers form a nonagon within a 750 radius circle, with the tip always facing north as well.",
        "(TagTalent The third ring soldiers form a heptagon within a 1100 radius circle, with the tip always facing north as well.)",
        "The soldiers are invulnerable and considered hidden (although visible), making them immune to almost every spell.",
        "The soldiers are hero clones of Monkey King, copying all attributes of Monkey King, with some special exceptions. They are not illusions. Their base stats adapt on every resummon (e.g. permanent stat loss due to Intelligence Steal or Essence Shift). Their attack speed is locked so that they always attack once every 1.1 seconds. Attack speed buffs and slows do not affect them. Evaded attacks do not count. They keep attacking until they successfully hit, before going back to their inactive state. Their day and night vision is reduced to 600. They provide the vision while walking to their spot and while standing there. The clones only attack enemies they see. Invisible enemies and enemies inside the Fog of War within the circles are not attacked. The clones also copy most of Monkey King's items, and are therefore able to use attack modifiers and bestow auras he had upon cast. The clones copy Echo Sabre, but the slow component does not work for them. While they receive the attack speed bonus, their fixed attack time prevents them from utilizing the increased attack speed unless the first hit is evaded. The clones copy Abyssal Blade and Skull Basher, but are unable to bash with them. The clones copy Prince's Knife, Mind Breaker and Enchanted Quiver, but are unable to utilize their passive cooldowns (they do activate Mind Breaker's magical damage procs though). The clones do not copy Aegis of the Immortal, Gem of True Sight and Animal Courier. The permanent Aghanim's Blessing buff is copied as well. However, other permanent buffs (e.g. Moon Shard, Duel) are not copied. Jingu Mastery does not work for the clones. They neither add stacks on enemies, nor gain the buff if Monkey King had it upon cast. Since the soldiers use regular attacks, their damage is reduced by damage block.",
        "Their base stats adapt on every resummon (e.g. permanent stat loss due to Intelligence Steal or Essence Shift).",
        "Their attack speed is locked so that they always attack once every 1.1 seconds. Attack speed buffs and slows do not affect them.",
        "Evaded attacks do not count. They keep attacking until they successfully hit, before going back to their inactive state.",
        "Their day and night vision is reduced to 600. They provide the vision while walking to their spot and while standing there.",
        "The clones only attack enemies they see. Invisible enemies and enemies inside the Fog of War within the circles are not attacked.",
        "The clones also copy most of Monkey King's items, and are therefore able to use attack modifiers and bestow auras he had upon cast.",
        "The clones copy Echo Sabre, but the slow component does not work for them. While they receive the attack speed bonus, their fixed attack time prevents them from utilizing the increased attack speed unless the first hit is evaded.",
        "The clones copy Abyssal Blade and Skull Basher, but are unable to bash with them.",
        "The clones copy Prince's Knife, Mind Breaker and Enchanted Quiver, but are unable to utilize their passive cooldowns (they do activate Mind Breaker's magical damage procs though).",
        "The clones do not copy Aegis of the Immortal, Gem of True Sight and Animal Courier.",
        "The permanent Aghanim's Blessing buff is copied as well.",
        "However, other permanent buffs (e.g. Moon Shard, Duel) are not copied.",
        "Jingu Mastery does not work for the clones. They neither add stacks on enemies, nor gain the buff if Monkey King had it upon cast.",
        "Since the soldiers use regular attacks, their damage is reduced by damage block.",
        "The soldiers only attack enemy heroes, clones, creep-heroes and illusions which are inside the circle. Other units and any unit outside the circle are fully ignored, even when within attack range of a soldier.",
        "Other units and any unit outside the circle are fully ignored, even when within attack range of a soldier.",
        "If Monkey King moves more than 780 (TagTalent 1130) range away from the center of the circle, or when he dies, the soldiers disappear and the spell ends.",
        "Recasting Wukong's Command while a previous cast is still active immediately ends the previous cast.",
        "The passive spawns from Aghanim's Scepter are on a recharge time, not an interval. This means when it finishes recharging, but Monkey King is in a state that doesn't allow passive spawns, it spawns the soldier as soon as circumstances allow it. Soldiers do not spawn while affected by the Tree Dance bounce leap and bounce perch modifiers, during Mischief, while fully invisible, during certain banishment spells, or while dead. Unlike soldiers from a regular cast, passively spawned soldiers can attack any unit, but require Monkey King to be within 500 range of them to attack buildings. When acquiring the item, it starts with a charge, so that a soldier spawns instantly.",
        "This means when it finishes recharging, but Monkey King is in a state that doesn't allow passive spawns, it spawns the soldier as soon as circumstances allow it.",
        "Soldiers do not spawn while affected by the Tree Dance bounce leap and bounce perch modifiers, during Mischief, while fully invisible, during certain banishment spells, or while dead.",
        "Unlike soldiers from a regular cast, passively spawned soldiers can attack any unit, but require Monkey King to be within 500 range of them to attack buildings.",
        "When acquiring the item, it starts with a charge, so that a soldier spawns instantly."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "130\/110\/90",
      "description": "Monkey King creates a circular formation of soldiers that spread out from his position. If Monkey King leaves the area his soldiers disperse. The soldiers have Monkey King's attack and only target heroes. Monkey King is granted bonus armor for the spell's duration.",
      "spellName": "Wukong's Command",
      "params": [
        "Cast Animation: 1.2+0.37",
        "Cast Range: 550",
        "First Ring Radius: 300",
        "Second Ring Radius: 750",
        "Leadership Radius: 780 (TagTalent 1130)",
        "Number of First Ring Soldiers: 5",
        "Number of Second Ring Soldiers: 9",
        "Soldiers Attack Interval: 1.1",
        "Armor Bonus: 12\/18\/24 (TagTalent 212\/218\/224)",
        "Max Duration: 13",
        "Third Ring Radius: 1100",
        "Number of Third Ring Soldiers: 7",
        "Passive Spawn Radius: 300",
        "Passive Spawn Interval: 4",
        "Spawns a monkey soldier near you at regular intervals. Soldiers do not spawn while invisible or on trees. Soldiers only attack buildings when Monkey King himself is nearby."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Monkey King rips out a tuft of fur to blow at his enemies, charging each strand to transform into a copy of himself."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 18.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 3.7,
    "attrAgility": 22.0
  },
  "description": "Sun Wukong, the Monkey King, is a melee agility hero, best known for his slippery nature and his ability to do Mischief, deceiving his enemies by turning into trees and other objects. Armed with his magic extending staff, the Monkey King slams the ground with Boundless Strikes, and leaps to the treetops to have advantage over his foes with Tree Dance. Perched on a tree, he gains a clear view of his surroundings, allowing him to jump down on unsuspecting targets, dealing heavy damage and slowing their escape with Primal Spring. As a carry, the Monkey King is granted extra damage and lifesteal from Jingu Mastery after landing consecutive attacks on his opponents. In a teamfight, at Wukong's Command an army of clones is sent out across the battlefield to fight for him, while he himself has his armor increased. Together with the help of his clones and his team, the Monkey King is a force to be reckoned with.",
  "history": "For 500 years the mountain pressed down upon him, only his head free from the crushing weight of the stonewrought prison the elder gods had summoned to halt his childish rebellion. Moss grew along the lines of his exposed face, tufts of grass sprouted from his ears; his vision was framed in wildflowers reaching from the soil around his cheeks. Most thought him long dead, tormented by the gods for waging war against the heavens until naught but his legend survived. But, as the stories go, the Monkey King cannot die. So he waited. Until the gods came to offer a chance at absolution, he endured. And when they did come to name the price, Sun Wukong accepted their charge: he would accompany a young acolyte on a secret pilgrimage, protect him from demons and dangers of the road, and guide the man home in possession of a coveted relic. Do that, and humbly obey the human's commands in service to their holy mission, and Wukong would prove himself reformed. For a change, Sun Wukong fulfilled his oath to the gods with honor, and atoned for the sins of past insurrections. The acolyte, much learned in hardships, was returned to his home temple, relic in hand; and Wukong-finding himself for the first time in proper standing with any gods of consequence-was content for a short while to give up his old thirst for adventure and glory. But the Monkey King was born for mischief...and offending the gods never gets old.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 Wukong's Command Ring",
      "talentRight": "+200 Armor Wukong's Command"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+350 Primal Spring Damage",
      "talentRight": "+40% Boundless Strike Crit"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 Jingu Mastery Damage",
      "talentRight": "+475 Tree Dance Cast Range"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Attack Speed",
      "talentRight": "+400 Tree Dance Vision AoE"
    }
  ]
}