{
  "abilities": [
    {
      "notes": [
        "Talents are fully copied by the Wukong's Command clones, but none of the current talents have an effect, as they cannot use active abilities and their attack speed is fixed."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Additional Wukong's Command Ring",
          "talentRight": "0 Cooldown Primal Spring"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-7s Boundless Strike Cooldown",
          "talentRight": "+2 Jingu Mastery Charges"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+130 Jingu Mastery Damage",
          "talentRight": "+450 Tree Dance Cast Range"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0.3s Boundless Strike Stun Duration",
          "talentRight": "+50% Tree Dance Vision AoE"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Monkey_King_Boundless_Strike.mp3\/revision\/latest?cb=20191216020658",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "Boundless Strike's effect length neither benefits from cast range bonuses, nor attack range bonuses. Cast range bonuses increase the cast range, but not the effect length.",
        "Cast range bonuses increase the cast range, but not the effect length.",
        "Boundless Strike's effects are instantly applied within its whole area. There is no travel time.",
        "The effect starts 75 range in front of Monkey King and has an actual length of 1025, adding up to 1100 effective length. With the starting distance, effect length and width, it can hit units up to 1250 range away. It can also hit units 75 range behind Monkey King, due to its radius and starting position.",
        "With the starting distance, effect length and width, it can hit units up to 1250 range away.",
        "It can also hit units 75 range behind Monkey King, due to its radius and starting position.",
        "Causes Monkey King to perform an instant attack on all hit enemies. The stun is independent from these attacks. These instant attacks can proc any attack modifiers and on-hit effects normally, except cleave. They have True Strike, but completely ignore disarms. Despite the audio effect, Daedalus has still only a chance to proc. Boundless Strike does not guarantee chance-based effects to proc. Boundless Strike has an ensured critical strike, crits with a lower value have no effect if they proc, since the higher crit value takes priority.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally, except cleave. They have True Strike, but completely ignore disarms.",
        "Despite the audio effect, Daedalus has still only a chance to proc. Boundless Strike does not guarantee chance-based effects to proc.",
        "Boundless Strike has an ensured critical strike, crits with a lower value have no effect if they proc, since the higher crit value takes priority.",
        "Boundless Strike procs Jingu Mastery, placing the debuff on all hit enemy heroes, or adding to the counter if the target is already debuffed. If Monkey King has the Jingu Mastery attack damage and lifesteal buff, the buff loses a charge whenever Boundless Strike is cast, regardless of whether it hits a unit or not. The bonus attack damage from Jingu Mastery is applied to all hit targets, and it does lifesteal off from each hit target, despite using up only one charge.",
        "If Monkey King has the Jingu Mastery attack damage and lifesteal buff, the buff loses a charge whenever Boundless Strike is cast, regardless of whether it hits a unit or not.",
        "The bonus attack damage from Jingu Mastery is applied to all hit targets, and it does lifesteal off from each hit target, despite using up only one charge.",
        "The strike first applies the debuff, then the damage.",
        "The sound during the cast animation is audible to everyone."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "28\/26\/24\/22 (TagTalent 21\/19\/17\/15)",
      "description": "Monkey King enlarges his staff and slams it against the ground, stunning enemies in a line and damaging them with a critical hit based on his attack. Has True Strike.",
      "spellName": "Boundless Strike",
      "params": [
        "Cast Animation: 0.4+0.5",
        "Cast Range: 1100",
        "Effect Length: 1100",
        "Effect Width: 150",
        "Critical Damage: 135%\/165%\/195%\/225%",
        "Stun Duration: 1\/1.2\/1.4\/1.6 (TagTalent 1.3\/1.5\/1.7\/1.9)"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Monkey_King_Tree_Dance_1.mp3\/revision\/latest?cb=20191216020644",
      "effects": [
        "Ability Target Unit",
        "Affects Self \/ Trees"
      ],
      "notes": [
        "Leveling this ability automatically levels Primal Spring as well.",
        "Monkey king leaps to the target tree at a speed of 800, reaching the tree within up to 1.13 (TagTalent 1.69) seconds.",
        "Leaps in an arc, with a top height of 192. During the leap, other units may pass below Monkey King. The activity modifier only appears during the leap and is responsible for the leaping animation.",
        "The activity modifier only appears during the leap and is responsible for the leaping animation.",
        "Although it visually looks like Monkey King is above the ground while perched, he still is considered to be on the ground. The height is part of the animations.",
        "Tree Dance has several different cooldowns which activate at different times. Upon cast, the leap duration between trees is added to the cooldown, resulting in a cooldown of 1.55\/1.4\/1.25\/1.1 ‒ 2.58\/2.43\/2.28\/2.13 (TagTalent 3.14\/2.99\/2.84\/2.69) seconds, based on the distance. Upon reaching the tree, it goes on cooldown for 1.45\/1.3\/1.15\/1 seconds, which matters only if the cast cooldown was skipped with flat cooldown reductions or cooldown resets. Upon unperching with a move (TagTalent Right Click) or attack command (A), it also goes on cooldown for 1.45\/1.3\/1.15\/1 seconds. Does not go on cooldown when unperched in other ways. Upon taking player-based or Roshan-based damage greater than 0 while on the ground (after damage reductions, excluding damage flagged as HP Removal), it goes on a 3-second cooldown. All of these cooldowns are unaffected by percentage-based cooldown reductions. Only flat cooldown reductions (e.g. Chakra Magic) and cooldown resets affects these cooldowns.",
        "Upon cast, the leap duration between trees is added to the cooldown, resulting in a cooldown of 1.55\/1.4\/1.25\/1.1 ‒ 2.58\/2.43\/2.28\/2.13 (TagTalent 3.14\/2.99\/2.84\/2.69) seconds, based on the distance.",
        "Upon reaching the tree, it goes on cooldown for 1.45\/1.3\/1.15\/1 seconds, which matters only if the cast cooldown was skipped with flat cooldown reductions or cooldown resets.",
        "Upon unperching with a move (TagTalent Right Click) or attack command (A), it also goes on cooldown for 1.45\/1.3\/1.15\/1 seconds. Does not go on cooldown when unperched in other ways.",
        "Does not go on cooldown when unperched in other ways.",
        "Upon taking player-based or Roshan-based damage greater than 0 while on the ground (after damage reductions, excluding damage flagged as HP Removal), it goes on a 3-second cooldown.",
        "All of these cooldowns are unaffected by percentage-based cooldown reductions. Only flat cooldown reductions (e.g. Chakra Magic) and cooldown resets affects these cooldowns.",
        "During the leap, Monkey King is disabled, unable to perform any actions. The last given order gets queued up and executed as soon as he lands.",
        "During the leap and while on a tree, Monkey King gains flying vision, but has his vision reduced to 800\/600 (TagTalent 1200\/900). Both Moon Shard's active and passive ability granting bonus night vision works, while Nightmare and Smoke Screen do not affect Monkey King's vision while on a tree.",
        "Both Moon Shard's active and passive ability granting bonus night vision works, while Nightmare and Smoke Screen do not affect Monkey King's vision while on a tree.",
        "While perched on a tree, Monkey King is hidden from sight. He can only be seen with flying vision. He can also be seen when standing 2 levels of ground higher than the tree Monkey King sits on, allowing wards to spot him when the ward is on an elevated ward spot. However, he cannot be seen when getting hurled in the air by abilities (e.g. Toss). Only standing on high ground grants vision over him.",
        "He can also be seen when standing 2 levels of ground higher than the tree Monkey King sits on, allowing wards to spot him when the ward is on an elevated ward spot.",
        "However, he cannot be seen when getting hurled in the air by abilities (e.g. Toss). Only standing on high ground grants vision over him.",
        "While on a tree, Monkey King can perform any action normally, with some of them unperching him, while others do not. Casting Boundless Strike, Mischief or any item abilities does not unperch him. Casting Wukong's Command, moving or attacking does unperch him. Directional Move and Patrol have no effect when ordered while on a tree. While Tree Dance is on cooldown and Monkey King is on a tree, he is disarmed and he cannot move, which prevents him from getting off the tree with move and attack commands. Forced Movement unperches Monkey King as well. This includes the effects of Blink Dagger-based items, cyclone, Force Boots, Force Staff, Hurricane Pike and Psychic Headband.",
        "Casting Boundless Strike, Mischief or any item abilities does not unperch him.",
        "Casting Wukong's Command, moving or attacking does unperch him.",
        "Directional Move and Patrol have no effect when ordered while on a tree.",
        "While Tree Dance is on cooldown and Monkey King is on a tree, he is disarmed and he cannot move, which prevents him from getting off the tree with move and attack commands.",
        "Forced Movement unperches Monkey King as well. This includes the effects of Blink Dagger-based items, cyclone, Force Boots, Force Staff, Hurricane Pike and Psychic Headband.",
        "While on a tree, Tree Dance can be cast again, targeting another nearby tree. All trees within cast range are highlighted with a white glow.",
        "Monkey King only gets stunned if the tree he leaps towards, or he perches on, gets destroyed. Getting unperched in other ways (e.g. Forced Movement) does not result in a stun."
      ],
      "mana": "0",
      "hotKey": "W",
      "cooldown": "1.45\/1.3\/1.15\/1",
      "description": "Monkey King jumps to a tree and perches atop it. While perched, he gains the Primal Spring ability-a channeled leap attack. If Monkey King's tree is destroyed, he falls and is stunned for 4 seconds. Taking damage from player controlled units or Roshan while on the ground puts Tree Dance on cooldown.",
      "spellName": "Tree Dance",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range from Ground: 900 (TagTalent 1350)",
        "Cast Range from Tree: 1000 (TagTalent 1350)",
        "Damage Cooldown: 3",
        "Day Tree Vision: 800 (TagTalent 1200)",
        "Night Tree Vision: 600 (TagTalent 900)",
        "Unperch Stun Duration: 4",
        "The stun upon falling off of a tree pierces spell immunity.",
        "Getting rooted while already leaping does not cancel the leap."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Monkey_King_Primal_Spring_1.mp3\/revision\/latest?cb=20191216020640",
      "effects": [
        "Ability Target Area \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "This ability automatically levels whenever Tree Dance is leveled as well.",
        "This ability is only active during the cast time of Tree Dance, during the leap from the ground onto a tree and while on a tree. It is inactive while leaping from a tree to another tree, and while on the ground.",
        "It is inactive while leaping from a tree to another tree, and while on the ground.",
        "Since Tree Dance disables Monkey King during the leap, casting Primal Spring while leaping to a tree queues up the order, so that it is cast immediately once on the tree. During the leap, Monkey King remembers the last given order and complete it once landing happens. The activity modifier only appears during the leap and is responsible for the leaping animation.",
        "During the leap, Monkey King remembers the last given order and complete it once landing happens.",
        "The activity modifier only appears during the leap and is responsible for the leaping animation.",
        "Leaps towards the target area at a speed of 1300, reaching it in up to 0.77 seconds, based on distance.",
        "The damage and slow are based on the time spent channeling, meaning their potency increases per each server tick spent channeling, up to 54 times. The damage increases by 2.642\/3.962\/5.283\/6.604 per server tick, starting immediately, reaching 142.6\/214\/285.3\/356.6 damage in 1.6 seconds. The slow increases by 0.4%\/0.8%\/1.1%\/1.5% per server tick, also starting immediately, reaching 20%\/40%\/60%\/80% slow in 1.6 seconds.",
        "The damage increases by 2.642\/3.962\/5.283\/6.604 per server tick, starting immediately, reaching 142.6\/214\/285.3\/356.6 damage in 1.6 seconds.",
        "The slow increases by 0.4%\/0.8%\/1.1%\/1.5% per server tick, also starting immediately, reaching 20%\/40%\/60%\/80% slow in 1.6 seconds.",
        "Hitting the same enemy multiple times with Primal Spring refreshes the slow duration, but does not update the slow value based on channel time.",
        "Primal Spring first applies the damage, then the debuff.",
        "If Monkey King is affeced by Forced Movement while leaping, all of Primal Spring's effects will be cancelled completely.",
        "The visual effects at the target area during the channeling are visible to allies only, but the channeling sound is audible to enemies, even through the Fog of War."
      ],
      "mana": "100",
      "hotKey": "E",
      "cooldown": "20\/18\/16\/14 (TagTalent 0)",
      "description": "Monkey King springs out from his tree perch, damaging and slowing enemies in the area where he lands. Damage and slow amounts are in proportion to channel duration.",
      "spellName": "Primal Spring",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: Global",
        "Max Leap Distance: 1000",
        "Radius: 375",
        "Max Channel Time: 1.6",
        "Max Damage: 140\/210\/280\/350",
        "Max Move Speed Slow: 20%\/40%\/60%\/80%",
        "Slow Duration: 4",
        "Getting rooted while already channeling or leaping does not cancel the spell."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Replaces Primal Spring until the channeling ends.",
        "Immediately ends the channeling of Primal Spring, causing Monkey King to jump earlier.",
        "Monkey King is unable to ⇧ Shift-queue this ability."
      ],
      "mana": "0",
      "hotKey": "E",
      "cooldown": "0",
      "description": "There is no description for this ability.",
      "spellName": "Spring Early",
      "params": [
        "Cast Animation: 0+0",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Monkey_King_Jingu_Mastery.mp3\/revision\/latest?cb=20191216020638",
      "effects": [
        "Ability Passive",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Each successful attack done on an enemy hero while Monkey King does not have the Jingu Mastery buff active places the debuff on the target hero, or adds one to its counter if the target already has the debuff. Only actual enemy heroes (including clones) can receive the debuff. Illusions and creep-heroes do not count. Attacking ally heroes do not count either.",
        "Only actual enemy heroes (including clones) can receive the debuff. Illusions and creep-heroes do not count. Attacking ally heroes do not count either.",
        "The debuff's duration gets refreshed on each hit. The 4 hits do not all require to happen within 7\/8\/9\/10 seconds.",
        "Upon hitting the same target 4 times, the debuff on the target disappears and Monkey King receives the bonus attack damage and lifesteal buff.",
        "A charge gets used upon successfully attacking any unit, including buildings, wards and allied units, always applying the bonus attack damage.",
        "Boundless Strike's instant attacks procs Jingu Mastery, placing the debuff on all hit enemy heroes, or adding to the counter if the target is already debuffed. If Monkey King has the Jingu Mastery bonus attack damage and lifesteal buff, the buff loses a charge whenever Boundless Strike is cast, regardless of whether it hits a unit or not. The bonus attack damage from Jingu Mastery is applied to all hit targets, and it does lifesteal off from each hit target, despite using up only one charge.",
        "If Monkey King has the Jingu Mastery bonus attack damage and lifesteal buff, the buff loses a charge whenever Boundless Strike is cast, regardless of whether it hits a unit or not.",
        "The bonus attack damage from Jingu Mastery is applied to all hit targets, and it does lifesteal off from each hit target, despite using up only one charge.",
        "When leveling up Jingu Mastery while wielding the buff, the attack damage bonus and lifesteal updates after using one charge.",
        "Stacks additively with other sources of lifesteal. Cannot lifesteal off of buildings or allied units. Can lifesteal off of wards that do not require a fixed amount of attacks to be destroyed.",
        "Cannot lifesteal off of buildings or allied units.",
        "Can lifesteal off of wards that do not require a fixed amount of attacks to be destroyed."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Monkey King's attacks awaken the Jingu Bang's power. Upon the fourth hit on the same enemy hero, Monkey King earns four charged attacks that have bonus damage and lifesteal.",
      "spellName": "Jingu Mastery",
      "params": [
        "Required Hits: 4",
        "Charges: 4 (TagTalent 6)",
        "Attack Damage Bonus: 40\/70\/100\/130 (TagTalent 170\/200\/230\/260)",
        "Lifesteal: 25%\/40%\/55%\/70%",
        "Counter Duration: 7\/8\/9\/10",
        "Buff Duration: 35",
        "Disables both the adding of the counter and the buff on Monkey King."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c8\/Monkey_King_Mischief.mp3\/revision\/latest?cb=20200510123903",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "This is an innate ability and does not need to be learned. It is bound to Monkey King himself.",
        "Interrupts Monkey King's channeling abilities, move orders and attack orders upon cast.",
        "Transforms Monkey King into a random nearby entity. For details, see Mischief Transformations.",
        "When disguising as an item, tree, or rune, sets Monkey King's movement speed to 200. When disguising any other unit, it sets Monkey King's movement speed to that unit's default movement speed. Sets Monkey King's movement speed to an absolute value. No other values can change his movement speed, with the exception of hastes.",
        "When disguising any other unit, it sets Monkey King's movement speed to that unit's default movement speed.",
        "Sets Monkey King's movement speed to an absolute value. No other values can change his movement speed, with the exception of hastes.",
        "Monkey King's selection box adapts to the disguise models. However, his collision size does not change.",
        "Monkey King's minimap icon is hidden to the enemy while disguised. If disguised as a unit, Monkey King's over-head health bar copies the look of that unit's health bar, including the team color. If disguised as an item, rune, or tree, Monkey King's health bar is fully hidden.",
        "If disguised as a unit, Monkey King's over-head health bar copies the look of that unit's health bar, including the team color.",
        "If disguised as an item, rune, or tree, Monkey King's health bar is fully hidden.",
        "All auto-attack settings ignores the Monkey King while in disguise. Lane creeps, neutral creeps, towers and fountains do not automatically attack him. Units of players which have auto attack settings of ◉ Standard or ◎ Always and the ground-attack command do not attack him automatically either, but can be forced to attack him (A). Monkey King is still fully affected by every ability. He can still be targeted normally. Attachable particle effects of abilities still attach to him.",
        "Units of players which have auto attack settings of ◉ Standard or ◎ Always and the ground-attack command do not attack him automatically either, but can be forced to attack him (A).",
        "Monkey King is still fully affected by every ability. He can still be targeted normally. Attachable particle effects of abilities still attach to him.",
        "During the initial 0.2 (TagTalent 0.5) seconds, Mischief fully negates damage, causing several on-damage effects to not trigger. Damage greater than 0 (after damage reductions) dispels the effect. Does not get dispelled by damage flagged as HP Removal.",
        "Damage greater than 0 (after damage reductions) dispels the effect. Does not get dispelled by damage flagged as HP Removal.",
        "With Aghanim's Shard, Mischief disjoints projectiles upon cast and it no longer sets his movement speed to an absolute value. Instead, it now raises his minimum movement speed based on the disguise.",
        "Instead, it now raises his minimum movement speed based on the disguise."
      ],
      "mana": "0",
      "hotKey": "F",
      "cooldown": "15 (TagTalent 8)",
      "description": "Changes Monkey King's shape to deceive opponents, using the environment nearby as inspiration for the disguise. Taking damage, attacking, or using any item or ability breaks Monkey King's disguise. Grants damage immunity for 0.2 seconds upon transforming.",
      "spellName": "Mischief",
      "params": [
        "Cast Animation: 0+0.53",
        "Set Move Speed: 200",
        "Creep Search Radius: 200",
        "Rune Search Radius: 300",
        "Tree Search Radius: 350",
        "Courier Search Radius: 400",
        "Damage Immunity Duration: 0.2 (TagTalent 0.5)",
        "Reduces cooldown to 8 seconds. Invulnerability Duration to 0.5s and disjoints projectiles. Mischief no longer slows Monkey King."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a5\/Monkey_King_Revert_Form.mp3\/revision\/latest?cb=20200510123905",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Replaces Mischief until the sub-ability is used or the disguise ends.",
        "Interrupts Monkey King's channeling abilities, move order and attack order upon cast."
      ],
      "mana": "0",
      "hotKey": "F",
      "cooldown": "1",
      "description": "Reverts Monkey King's shape to his original form.",
      "spellName": "Revert Form",
      "params": [
        "Cast Animation: 0+0.53",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Monkey_King_Wukong%27s_Command_1.mp3\/revision\/latest?cb=20191216020648",
      "effects": [
        "Ability Target Area",
        "Affects Enemy Heroes",
        "Damage Physical"
      ],
      "notes": [
        "Upon cast, 14 (TagTalent 21) clones of Monkey King spawn which immediately walk to their determined spot in the formation.",
        "The clones walk at a speed of 700 and have unobstructed movement, walking through cliffs and trees.",
        "The formation they take is always the same except when space is limited by the edges of the map. The first ring soldiers form a pentagon within a 300 radius circle, with the tip always facing north. The second ring soldiers form a nonagon within a 750 radius circle, with the tip always facing north as well. The third ring soldiers form a heptagon within a 1100 radius circle, with the tip always facing north as well.",
        "The first ring soldiers form a pentagon within a 300 radius circle, with the tip always facing north.",
        "The second ring soldiers form a nonagon within a 750 radius circle, with the tip always facing north as well.",
        "The third ring soldiers form a heptagon within a 1100 radius circle, with the tip always facing north as well.",
        "The soldiers are invulnerable and considered hidden (although visible), making them immune to almost every ability. They are unselectable (by both Monkey King and enemies), uncontrollable, and can neither pick up, nor drop any items. They copy most of Monkey King's items, and are therefore able to use attack modifiers and bestow auras he had upon cast.",
        "They are unselectable (by both Monkey King and enemies), uncontrollable, and can neither pick up, nor drop any items.",
        "They copy most of Monkey King's items, and are therefore able to use attack modifiers and bestow auras he had upon cast.",
        "The soldiers are hero clones of Monkey King, copying \/ \/ all attributes of Monkey King, with some special exceptions. They are not illusions. Their base stats adapt on every resummon (e.g. permanent stats loss from Glaives of Wisdom or Essence Shift). While the clones are affected by attack speed buffs and slow, they may only attack once every 1.2 seconds, even if their attack misses. Their day and night vision is reduced to 600. They provide the vision while walking to their spot and while standing there.",
        "Their base stats adapt on every resummon (e.g. permanent stats loss from Glaives of Wisdom or Essence Shift).",
        "While the clones are affected by attack speed buffs and slow, they may only attack once every 1.2 seconds, even if their attack misses.",
        "Their day and night vision is reduced to 600. They provide the vision while walking to their spot and while standing there.",
        "The soldiers only attack enemy heroes, clones, creep-heroes and illusions they see inside Wukong's Command. Invisible enemies and enemies inside the Fog of War within the circles are not attacked. Other units and any unit outside the circle are fully ignored, even when within attack range of a soldier. Since the soldiers use regular attacks, their damage is reduced by damage block.",
        "Invisible enemies and enemies inside the Fog of War within the circles are not attacked.",
        "Other units and any unit outside the circle are fully ignored, even when within attack range of a soldier.",
        "Since the soldiers use regular attacks, their damage is reduced by damage block.",
        "The buffs of a consumed Aghanim's Blessing and Aghanim's Shard are copied as well. However, other permanent buffs like a consumed Moon Shard and Duel's bonus damage are not copied. Jingu Mastery does not work for the clones. They neither can add stacks on enemies, nor gain the buff if Monkey King had it upon cast.",
        "However, other permanent buffs like a consumed Moon Shard and Duel's bonus damage are not copied.",
        "Jingu Mastery does not work for the clones. They neither can add stacks on enemies, nor gain the buff if Monkey King had it upon cast.",
        "If Monkey King moves more than 780 (TagTalent 1130) range away from the center of the circle, or when he dies, the soldiers disappear and the ability ends.",
        "Recasting Wukong's Command while a previous cast is still active immediately ends the previous cast.",
        "The passive spawns from Aghanim's Scepter are on a recharge time, not an interval. This means when it finishes recharging, but Monkey King is in a state that doesn't allow passive spawns, it spawns the soldier as soon as circumstances allow it. Soldiers do not spawn while Monkey King is affected by the Tree Dance bounce leap and bounce perch modifiers, during Mischief, while fully invisible, during certain abilities that cause him to be hidden, or while dead. Unlike soldiers from a regular cast, passively spawned soldiers can attack any unit except Roshan, but require Monkey King to be within 500 range of them to attack buildings. Acquiring the item instantly starts with a charge, so that a soldier spawns instantly. When Monkey King dies, the soldiers immediately disappear.",
        "This means when it finishes recharging, but Monkey King is in a state that doesn't allow passive spawns, it spawns the soldier as soon as circumstances allow it.",
        "Soldiers do not spawn while Monkey King is affected by the Tree Dance bounce leap and bounce perch modifiers, during Mischief, while fully invisible, during certain abilities that cause him to be hidden, or while dead.",
        "Unlike soldiers from a regular cast, passively spawned soldiers can attack any unit except Roshan, but require Monkey King to be within 500 range of them to attack buildings.",
        "Acquiring the item instantly starts with a charge, so that a soldier spawns instantly.",
        "When Monkey King dies, the soldiers immediately disappear."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "120\/100\/80",
      "description": "Monkey King creates a circular formation of soldiers that spread out from his position. If Monkey King leaves the area his soldiers disperse. The soldiers have Monkey King's attack and only target heroes. Monkey King is granted bonus armor for the spell's duration.",
      "spellName": "Wukong's Command",
      "params": [
        "Cast Animation: 1.2+0.37",
        "Cast Range: 550",
        "First Ring Radius: 300",
        "Second Ring Radius: 750",
        "Leadership Radius: 780 (TagTalent 1130)",
        "Number of First Ring Soldiers: 5",
        "Number of Second Ring Soldiers: 9",
        "Soldiers Attack Interval: 1.2",
        "Armor Bonus: 12\/18\/24",
        "Max Duration: 13",
        "Third Ring Radius: 1100",
        "Number of Third Ring Soldiers: 7",
        "Passive Spawn Radius: 300",
        "Passive Spawn Interval: 4",
        "Spawns a monkey soldier near you at regular intervals. Soldiers do not spawn while invisible or on trees. Soldiers only attack buildings when Monkey King himself is nearby."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 18.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 3.7,
    "attrAgility": 22.0
  },
  "description": "Sun Wukong, the Monkey King, is a melee agility hero, best known for his slippery nature and his ability to do Mischief, deceiving his enemies by turning into trees and other objects. Armed with his magic extending staff, the Monkey King slams the ground with Boundless Strikes, and leaps to the treetops to have advantage over his foes with Tree Dance. Perched on a tree, he gains a clear view of his surroundings, allowing him to jump down on unsuspecting targets, dealing heavy damage and slowing their escape with Primal Spring. As a carry, the Monkey King is granted extra damage and lifesteal from Jingu Mastery after landing consecutive attacks on his opponents. In a teamfight, at Wukong's Command an army of clones is sent out across the battlefield to fight for him, while he himself has his armor increased. Together with the help of his clones and his team, the Monkey King is a force to be reckoned with.",
  "history": "For 500 years the mountain pressed down upon him, only his head free from the crushing weight of the stonewrought prison the elder gods had summoned to halt his childish rebellion. Moss grew along the lines of his exposed face, tufts of grass sprouted from his ears; his vision was framed in wildflowers reaching from the soil around his cheeks. Most thought him long dead, tormented by the gods for waging war against the heavens until naught but his legend survived. But, as the stories go, the Monkey King cannot die. So he waited. Until the gods came to offer a chance at absolution, he endured. And when they did come to name the price, Sun Wukong accepted their charge: he would accompany a young acolyte on a secret pilgrimage, protect him from demons and dangers of the road, and guide the man home in possession of a coveted relic. Do that, and humbly obey the human's commands in service to their holy mission, and Wukong would prove himself reformed. For a change, Sun Wukong fulfilled his oath to the gods with honor, and atoned for the sins of past insurrections. The acolyte, much learned in hardships, was returned to his home temple, relic in hand; and Wukong-finding himself for the first time in proper standing with any gods of consequence-was content for a short while to give up his old thirst for adventure and glory. But the Monkey King was born for mischief...and offending the gods never gets old.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Additional Wukong's Command Ring",
      "talentRight": "0 Cooldown Primal Spring"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-7s Boundless Strike Cooldown",
      "talentRight": "+2 Jingu Mastery Charges"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+130 Jingu Mastery Damage",
      "talentRight": "+450 Tree Dance Cast Range"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0.3s Boundless Strike Stun Duration",
      "talentRight": "+50% Tree Dance Vision AoE"
    }
  ]
}