{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/32\/Bounty_Hunter_Shuriken_Toss_1.mp3\/revision\/latest?cb=20191216011325",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The shuriken travels at a speed of 1000.",
        "The shuriken first applies the damage, then the debuff, then Jinada's spell damage.",
        "The initial target does not have to be Tracked for the shuriken to bounce. Can only bounce to each Tracked unit once. Can also bounce to different Track debuff sources as long as the debuff is applied by an ally. Cannot bounce to, but can bounce off of invulnerable or hidden units.",
        "Can only bounce to each Tracked unit once.",
        "Can also bounce to different Track debuff sources as long as the debuff is applied by an ally.",
        "Cannot bounce to, but can bounce off of invulnerable or hidden units.",
        "This is how much bonus damage Shuriken Toss deals to Tracked targets on each Track level: Level 1: 112\/168\/224\/280 damage. Level 2: 136\/204\/272\/340 damage. Level 3: 160\/240\/320\/400 damage.",
        "Level 1: 112\/168\/224\/280 damage.",
        "Level 2: 136\/204\/272\/340 damage.",
        "Level 3: 160\/240\/320\/400 damage.",
        "",
        "Both leveling up the ability and the damage increasing talent immediately upgrades all of Bounty Hunter's currently flying shurikens.",
        "SCEPTER NOTES Shuriken Toss now applies the current level of Jinada on its target upon projectile impact. Jinada notes fully apply. If it is not leveled, it is not applied. Does not use instant attacks to apply the Jinada. The effects are applied by Shuriken Toss itself. Shuriken Toss' Jinada is independent of the Jinada applied by attacks, regardless of cooldown, and works even when dead. The 60\/100\/140\/180 (TagTalent 100\/140\/180\/220) damage is applied as spell damage in a separate damage instance, it is affected by spell damage amplification and works with spell lifesteal. However, it is still affected by damage block sources and Bulwark, but not Resonant Pulse.",
        "Jinada notes fully apply. If it is not leveled, it is not applied.",
        "Does not use instant attacks to apply the Jinada. The effects are applied by Shuriken Toss itself.",
        "Shuriken Toss' Jinada is independent of the Jinada applied by attacks, regardless of cooldown, and works even when dead.",
        "The 60\/100\/140\/180 (TagTalent 100\/140\/180\/220) damage is applied as spell damage in a separate damage instance, it is affected by spell damage amplification and works with spell lifesteal.",
        "However, it is still affected by damage block sources and Bulwark, but not Resonant Pulse.",
        "TALENT NOTES Acquiring the Shuriken Toss charges talent instantly grants 1 extra charge.",
        "SPELL STEAL Jinada applied is based on Bounty Hunter's current ability level when acquired."
      ],
      "mana": "5 (TagTalent 0)",
      "item_behaviour": [],
      "name": "Shuriken Toss",
      "cooldown": "5",
      "description": "Hurls a deadly shuriken at an enemy unit, dealing damage and mini-stunning the target. The shuriken will bounce to any Tracked units who are within a 1200 radius of each other. Deals bonus damage to Tracked targets.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.43",
        "Cast Range:  375\/425\/475\/525 ( 700)",
        "Bounce Search Radius: 1200",
        "Damage: 80\/120\/160\/200",
        "Stun Duration: 0.2"
      ],
      "legacy_key": "T",
      "story": "While the shuriken may be small, Gondar's precise aim can cause critical damage."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/df\/Bounty_Hunter_Jinada.mp3\/revision\/latest?cb=20191216011329",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Enemies \/ Self"
      ],
      "notes": [
        "Upon leveling Jinada the first time, it has Autocast on by default. Despite being an active ability, Jinada can trigger while silenced, if set to Autocast.",
        "Despite being an active ability, Jinada can trigger while silenced, if set to Autocast.",
        "Jinada's cast range can only be further increased by attack range bonuses of the same range type as the caster. However, it is not affected by cast range bonuses. Both Autocast and manually casting it uses Bounty Hunter's current attack range.",
        "Both Autocast and manually casting it uses Bounty Hunter's current attack range.",
        "When off cooldown, Bounty Hunter's weapons emit particle effects.",
        "Checks its cooldown on attack begin, not on attack hit. This means Jinada does not apply when its cooldown finishes during the attack animation.",
        "This means Jinada does not apply when its cooldown finishes during the attack animation.",
        "Grants regular flat bonus attack damage whenever the ability goes off cooldown, and the bonus is removed when going on cooldown. When attacking any other units (including buildings and wards), only the attack damage bonus is applied, triggering the cooldown. Does not work against allies.",
        "When attacking any other units (including buildings and wards), only the attack damage bonus is applied, triggering the cooldown.",
        "Does not work against allies.",
        "Only steals unreliable gold, removing it from the target and adding it to his own unreliable gold. Steals gold only when attacking enemy heroes and clones, excluding illusions. Bounty Hunter gains exactly how much the target loses.",
        "Steals gold only when attacking enemy heroes and clones, excluding illusions.",
        "Bounty Hunter gains exactly how much the target loses."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Jinada",
      "cooldown": null,
      "description": "Bounty Hunter plans his next hit, dealing bonus damage and stealing some unreliable gold.",
      "hot_key": "W",
      "params": [
        "Cast Range:  150",
        "Attack Damage Bonus: 60\/100\/140\/180 ( 100\/140\/180\/220)",
        "Gold Stolen: 12\/20\/28\/36 ( 62\/70\/78\/86)"
      ],
      "legacy_key": "J",
      "story": "Gondar's vast experience ensures he never walks away from a transaction empty-handed."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Bounty_Hunter_Shadow_Walk.mp3\/revision\/latest?cb=20191216011331",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies"
      ],
      "notes": [
        "Does not interrupt Bounty Hunter's channeling abilities upon cast.",
        "The attack first applies the Shadow Walk debuff and then the attack damage.",
        "The Shadow Walk buff is lost upon reaching the cast point of abilities or items, or upon landing an attack. Missed attacks do not break it. Casting Track or casting ability on allied heroes does not break the invisibility of Shadow Walk. Bounty Hunter can pick up, drop or attack items without breaking the invisibility. Successive casts do not update the movement speed and attack speed slow values but refresh the invisibility duration.",
        "Casting Track or casting ability on allied heroes does not break the invisibility of Shadow Walk.",
        "Bounty Hunter can pick up, drop or attack items without breaking the invisibility.",
        "Successive casts do not update the movement speed and attack speed slow values but refresh the invisibility duration.",
        "Grants phased movement while fully invisible. Upon breaking invisibility, Shadow Walk applies the debuff, then the attack damage. TALENT NOTES The silence on hit talent instantly updates the current active instance, with the next successful attack applying a 2-second silence on the target.",
        "Upon breaking invisibility, Shadow Walk applies the debuff, then the attack damage.",
        "TALENT NOTES The silence on hit talent instantly updates the current active instance, with the next successful attack applying a 2-second silence on the target.",
        "SHARD NOTES Acquiring Aghanim's Shard instantly grants 1 extra charge. Shadow Walk now goes on a 0.5-second cooldown when cast, to prevent accidental double-casts. ↓↓ Double-tapping automatically targets self. Can only be cast on allied heroes, including illusions and creep-heroes, except clones. The silence on hit talent upgrade is also applied. Other Shadow Walk notes fully apply.",
        "Shadow Walk now goes on a 0.5-second cooldown when cast, to prevent accidental double-casts.",
        "↓↓ Double-tapping automatically targets self.",
        "Can only be cast on allied heroes, including illusions and creep-heroes, except clones.",
        "The silence on hit talent upgrade is also applied.",
        "Other Shadow Walk notes fully apply."
      ],
      "mana": "18\/17\/16\/15 (TagTalent 0.5)",
      "item_behaviour": [],
      "name": "Shadow Walk",
      "cooldown": "15\/14\/13\/12",
      "description": "Bounty Hunter becomes invisible and gains the ability to move through other units until he attacks or uses an ability. If he breaks the invisibility with an attack, that attack will slow the target's movement and attack speed.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Fade Time: 1\/0.75\/0.5\/0.25",
        "Move Speed Slow: 16%\/24%\/32%\/40% ( 26%\/34%\/42%\/50%)",
        "Attack Speed Slow: 16\/24\/32\/40 ( 26\/34\/42\/50)",
        "Invisibility Duration: 20\/25\/30\/35",
        "Slow Duration: 4",
        "Cast Range: 650",
        "Ally Fade Time: 1",
        "<span image=\"images\\Talent\"><\/span> Silence Duration: 2"
      ],
      "legacy_key": "W",
      "story": "The court jesters present during King Goff's assassination can recount no other image than a dancing shadow."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Bounty_Hunter_Track.mp3\/revision\/latest?cb=20191216011326",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Heroes"
      ],
      "notes": [
        "Despite the visual effect, the Track debuff is applied instantly on the target.",
        "Exposes the target, provides True Sight over and ground vision around it.",
        "Grants unreliable gold to Bounty Hunter and his allies around the target when the target dies, no matter how it dies. Allies only get the bonus gold if they are within 1200 range of the tracked hero while alive. Bounty Hunter himself gets the gold regardless of distance, even while dead. Can be cast on illusions and the Tempest Double, but does not grant any gold when they die. When multiple Meepo Clones are tracked and one of them dies, each clone grants the Track gold around them.",
        "Allies only get the bonus gold if they are within 1200 range of the tracked hero while alive. Bounty Hunter himself gets the gold regardless of distance, even while dead.",
        "Can be cast on illusions and the Tempest Double, but does not grant any gold when they die.",
        "When multiple Meepo Clones are tracked and one of them dies, each clone grants the Track gold around them.",
        "The movement speed bonus is provided by an aura on the target and its buff lingers for 0.5 seconds. Multiple instances of the aura do not stack. The aura does not affect invulnerable or hidden units.",
        "The aura does not affect invulnerable or hidden units.",
        "The critical strike only applies to the caster's attacks against the tracked enemy, other units under their control do not crit. If the caster is a ranged hero, already launched attacks do not crit if the target gets tracked before projectile impact. Vice versa, already launched attacks do crit if the track debuff expires before the projectiles land. If another source of critical strike procs on the same attack, the higher multiplier has priority.",
        "If the caster is a ranged hero, already launched attacks do not crit if the target gets tracked before projectile impact.",
        "Vice versa, already launched attacks do crit if the track debuff expires before the projectiles land.",
        "If another source of critical strike procs on the same attack, the higher multiplier has priority.",
        "The visual and sound effects of Track are only visible and audible to Bounty Hunter and his allies. However, the debuff is visible to everyone.",
        "The visual effects from the movement speed buff are visible to everyone as well.",
        "The debuff icon on the target shows how much Gold it currently has. Alt+ Left Click the debuff announces the tracked hero's current gold in the chat.",
        "Alt+ Left Click the debuff announces the tracked hero's current gold in the chat.",
        "TALENT NOTES Both the ground vision granting and ally movement speed bonus talents immediately updates all existing Track debuffs."
      ],
      "mana": "4",
      "item_behaviour": [],
      "name": "Track",
      "cooldown": "60",
      "description": "Tracks an enemy hero, granting True Sight of the target, and information on how much gold it is carrying. Bounty Hunter moves fast when near the tracked unit and deals critical strikes when attacking it. If the target dies, Bounty Hunter and nearby heroes collect a bonus bounty of gold. Casting Track does not take you out of invisibility.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.43",
        "Cast Range:  1000",
        "Radius: 1200",
        "Self Move Speed Bonus: 16%\/20%\/24%",
        "Self Critical Damage Against Target: 140%\/170%\/200%",
        "Self Bonus Gold: 130\/225\/320 ( 380\/475\/570)",
        "Ally Bonus Gold: 40\/80\/120 ( 290\/330\/370)",
        "Shuriken Toss Damage Multiplier: 1.4\/1.7\/2",
        "Duration: 30",
        "Aura Linger Duration: 0.5",
        "<span image=\"images\\Talent\"><\/span> Ally Move Speed Bonus: 8%\/10%\/12%",
        "<span image=\"images\\Talent\"><\/span> Vision Radius: 600"
      ],
      "legacy_key": "R",
      "story": "Using his elevated senses of sight and smell, Gondar's hits have quite a good chance of success."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 20.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.6,
    "attrAgility": 21.0
  },
  "description": "Loots and collects bounties off of his enemies. Fear is the mother of rumor, and tales of Gondar's origins are nothing but hearsay. For the right price, the Bounty Hunter will Track down any target to deliver their heads and collect their bounties. He Walks through Shadows into the best guarded keeps, crippling his target with a surprise attack, and steal some of their riches with a calculated strike. Even targets at a greater distance are not safe from the Bounty Hunter, as his trusty Shuriken seemingly has a mind on its own, seeking out and striking all targets the Bounty Hunter keeps track of. Because in the end, it's all about the gold.  Escape Nuker ★☆☆",
  "trivia": [
    "In DotA, Gondar shared the same hero model and dialogue as Akama, a playable Broken Draenei hero in the campaign of Warcraft III: Frozen Throne, and later an NPC in World of Warcraft.[1]",
    "Gondar's line, Link▶️ \"No job is too big, no fee is too big.\" is a direct quote from the movie Ghostbusters.[2]",
    "Gondar's line, Link▶️ \"Dead or Alive you're coming with me.\" is the same line used multiple times by the main protagonist of the movie \"Robocop\".[3]",
    "Bounty Hunter's line, Link▶️ \"You can run but you can't hide.\" is the same line from the movie \"Liar Liar.\""
  ],
  "history": "When the hunted tell tales of Gondar the Bounty Hunter, none are sure of which are true. In whispered tones they say he was abandoned as a kit, learning his skill in tracking as a matter of simple survival. Others hear he was an orphan of war, taken in by the great Soruq the Hunter to learn the master's skill with a blade as they plumbed the dark forests for big game. Still others believe he was a lowly street urchin raised among a guild of cutpurses and thieves, trained in the arts of stealth and misdirection. Around campfires in the wild countryside his quarry speaks the rumors of Gondar's work, growing ever more fearful: they say it was he who tracked down the tyrant King Goff years after the mad regent went into hiding, delivering his head and scepter as proof. That it was he who infiltrated the rebel camps at Highseat, finally bringing the legendary thief White Cape to be judged for his crimes. And that it was he who ended the career of Soruq the Hunter, condemned as a criminal for killing the Prince's prized hellkite. The tales of Gondar's incredible skill stretch on, with each daring feat more unbelievable than the last, each target more elusive. For the right price, the hunted know, anyone can be found. For the right price, even the mightiest may find fear in the shadows.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "2 Shuriken Toss Charges",
        "talent_left": "+250 Track Gold"
      },
      {
        "talent_lvl": "20",
        "talent_right": "Track Grants 600 Ground Vision",
        "talent_left": "+50 Jinada Gold Steal"
      },
      {
        "talent_lvl": "15",
        "talent_right": "2s Silence on Hit with Shadow Walk",
        "talent_left": "Half Track Bonus Speed to Allies"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+10\/+10% Shadow Walk Attack\/Move Slow",
        "talent_left": "+40 Jinada Damage"
      }
    ]
  }
}