{
  "abilities": [
    {
      "notes": [
        "Чернила движутся со скоростью в 2000, достигая максимальной дистанции за 0,7 секунды",
        "Может поражать существ на расстоянии до 1560 ( 2560) единиц (складывается из дистанции прохождения и радиуса)",
        "Чернила появляются в 120 единицах слева от Grimstroke и движутся напрямую к выбранной точке\n То есть дистанция прохождения чернил зависит не от направления, куда смотрит заклинатель, а от угла между двумя точками",
        "У увеличения урона нет ограничения и оно учитывает любое пораженное чернилами существо",
        "Проигрывает начальный звук и частицы при начале применения, которые слышны и видны всем",
        "Снаряд даёт наземный обзор в момент движения в пределах радиуса\n Даёт наземный обзор в радиусе 160 единиц на месте каждого задетого существа и в конечной точке снаряда, который длится 2 секунды"
      ],
      "item_behaviour": [],
      "description": "Взмахом кисти герой проводит линию из чернил, нанося урон врагам на её пути и замедляя их. Урон увеличивается с каждым задетым врагом.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,6+0,53",
        "Дальность применения: 1400 ( 2400)",
        "Дистанция волны: 1400 ( 2400)",
        "Начальный радиус: 120",
        "Конечный радиус: 160",
        "Базовый урон: 100\/160\/220\/280 ( 150\/240\/330\/420)",
        "Увеличение урона за удар: 20\/30\/40\/50 ( 30\/45\/60\/75)",
        "Замедление скорости передвижения: 50%\/60%\/70%\/80%",
        "Длительность замедления: 1,75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Grimstroke_Stroke_of_Fate_1.mp3\/revision\/latest?cb=20191216013954",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "11\/9\/7\/5",
      "aghanim": null,
      "name": "Stroke of Fate",
      "cooldown": "100\/110\/120\/130",
      "legacy_key": "F",
      "story": "Губительная сила чернил, которую вознесённый вычерпал из своего павшего народа, поглотит любого врага на своём пути."
    },
    {
      "notes": [
        "Фантом летит со скоростью 850",
        "С момента запуска фантома можно атаковать (A или  Нажатие ЛКМ), поэтому он может умереть, не долетев до цели\n Фантом имеет самый высокий приоритет для правил автоатаки",
        "Фантом цепляется за цель как только оказывается в 130 единицах от неё\n Зацепившись, он всегда остается в 130 от цели",
        "Фантом мгновенно умирает, если цель стала невидимой или получила невосприимчивость к магии, даже если он только летел к цели\n Фантом также умрет, если цель стала неуязвимой или спряталась, но не во время полёта к ней",
        "Фантом застывает, если попадает в  Chronosphere\n Он продолжит преследовать цель, как только покинет Chronosphere\n При этом, если фантом уже привязался к герою до попадания в Chronosphere, то он мгновенно начнет возвращаться, если его эффект завершился",
        "Фантом возвращается к заклинателю со скоростью 1150 при окончании времени действия или при смерти цели\n Фантом не возвращается, если он был убит",
        "При прикреплении фантом обезмолвивает цель и наносит ей урон\n Наносит 5\/10\/15\/20 ( 30\/35\/40\/45) урона с интервалом в 0,5 секунды сразу после достижения цели, срабатывая 10 раз\n Может нанести до 170 ( 420\/550\/680\/810) единиц урона каждому врагу, включая финальный урон при возврате (до учета сопротивлений)",
        "Фантом сбрасывает перезарядку способности только после полного возвращения к заклинателю\n Перезарядка также сбросится, если цель, к которой был прикреплён фантом, умерла во время действия способности",
        "Фантом дает общий обзор на цель как при полете к ней, так и зацепившись за неё\n Обзор мгновенно прекращается как только существо отцепится от цели\n У самого фантома также есть небольшая дальность обзора, действующая как при полете, так и при зацеплении\n При этом данный обзор не действует при возвращении фантома к заклинателю",
        "С фантомом нельзя взаимодействовать при возврате к заклинателю",
        "Несколько применений складываются, несмотря на то, что применения делят один дебафф\n Периодический урон увеличивается за каждый заряд\n Применения используют один интервал нанесения урона и наносят общий урон за интервал",
        "При использовании в комбинации с  Soulbind, только фантом, зацепившийся к первичной цели, может сбросить перезарядку способности"
      ],
      "item_behaviour": [],
      "description": "Призывает фантома, который летит к выбранной цели и сжимает её в своих объятьях, нанося периодический урон и запрещая применять способности. Если фантом продержится на жертве до конца действия, он нанесёт ей большой урон от разрыва и вернётся к владельцу, а время перезарядки способности сбросится. Одна геройская атака по фантому считается за три обычных.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 900",
        "Атак героев для убийства: 2\/2\/3\/3 ( 3\/3\/4\/4)",
        "Атак прочих существ для убийства: 6\/6\/9\/9 ( 9\/9\/12\/12)",
        "Урон в секунду: 10\/20\/30\/40 ( 60\/70\/80\/90)",
        "Урон при возврате: 120\/200\/280\/360",
        "Длительность прикрепления: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Grimstroke_Phantom%27s_Embrace_1.mp3\/revision\/latest?cb=20191216013948",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "36\/30\/24\/18",
      "aghanim": null,
      "name": "Phantom's Embrace",
      "cooldown": "80\/100\/120\/140",
      "legacy_key": "E",
      "story": "Страж нисколько не опечален смертью своего народа. Лишь память о Яови, что была ему ближе всех, вызывает некий отголосок тоски."
    },
    {
      "notes": [
        "Имеет более долгую остаточную анимацию в 0,86 сек\n после применения при использовании на себя из-за разницы в анимациях\n ↓↓ Двойное нажатие автоматически применит способность на владельца",
        "Наносит 5\/7\/9\/11 ( 7\/9,8\/12,6\/15,4) единиц урона с интервалом в 0,2 секунды сразу после применения дебаффа, срабатывая 15 раз\n Щупальца могут нанести до 75\/105\/135\/165 ( 105\/147\/189\/231) единиц урона одному существу до учета сопротивлений",
        "Урон и оглушение при потере баффа основано на том, сколько раз был нанесен урон одному вражескому герою с помощью щупалец\n То есть, для максимального урона и оглушения как минимум один вражеский герой должен получать урон всю длительность способности\n Учитывает только непосредственно героев, исключая иллюзии и крипов-героев, но учитывая клонов\n Значение фактически нанесенного урона не имеет такого значения, как количество срабатываний\n Длительность оглушения увеличивается на 0,09\/0,15\/0,22\/0,28, а урон — на 7,2\/14,4\/21,6\/28,8 ( 10,08\/20,16\/30,24\/40,32) за каждое срабатывание, достигая максимального значения после 12,5 срабатываний",
        "Если дебафф преждевременно теряется, то он применит урон по области и оглушение, основываясь на количестве уже сработавших на этот момент интервалов\n Однако если цель умрёт, то оглушение и урон не применятся",
        "Урон при окончании эффекта и оглушение прмиеняются только в том случае, если в области действия есть хотя бы один вражеский герой",
        "Повторное применение Ink Swell на одну и ту же цель обновит длительность без сбрасывания счетчика урона",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, союзная цель будет также получать лечение за каждое нанесение урона этой способности\n Лечение рассчитывается от базового урона способности до его уменьшений и увеличений, поэтому настоящий нанесённый противнику урон не имеет значения\n Щупальца восстанавливают 2,8\/3,92\/5,04\/6,16 за каждое срабатывание\n Щупальца могут восстановить до 42\/58,8\/75,6\/92,4 единиц здоровья за каждого противника, который будет под воздействием способности всё её время действия\n Урон при окончании эффекта может восстановить до 50,4\/100,8\/151,2\/201,6 единиц здоровья за каждого задетого врага\n Применяет сильное развеивание при окончании вне зависимости от того, каким образом эффект был снят"
      ],
      "item_behaviour": [],
      "description": "Герой покрывает себя или союзника чернилами, которые повышают скорость передвижения и наносят урон противникам вокруг. Через 3 сек. чернила расплёскиваются, оглушая противников и нанося им урон. Длительность оглушения и урон от всплеска зависят от того, как долго чернила действовали на вражеских героев.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,15+0,73\/0,86",
        "Дальность применения: 400\/525\/650\/775",
        "Радиус: 375 ( 525)",
        "Доп\n скорость передвижения: 12%\/14%\/16%\/18% ( 28%\/30%\/32%\/34%)",
        "Урон в секунду: 25\/35\/45\/55 ( 35\/49\/63\/77)",
        "Макс\n урон при завершении: 90\/180\/270\/360 ( 126\/252\/378\/504)",
        "Макс\n длительность оглушения: 1,1\/1,9\/2,7\/3,5",
        "Длительность для макс\n эффекта: 2,5",
        "Длительность эффекта: 3",
        "Лечение от наносимого урона:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Grimstroke_Ink_Swell_1.mp3\/revision\/latest?cb=20191216014001",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "30\/26\/22\/18 (TagTalent 25\/21\/17\/13)",
      "aghanim": null,
      "name": "Ink Swell",
      "cooldown": "120\/130\/140\/150",
      "legacy_key": "W",
      "story": "Теперь, когда поглощение чернилами больше не угрожает вознесённому, их мощь всегда у него под рукой."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter для разблокировки",
        "Созданные иллюзии визуально отличимы от реального героя для союзников и врагов",
        "Иллюзия появляется на расстоянии в 108 единиц от цели\n Она может появиться севернее, восточнее, южнее или западнее от цели",
        "Иллюзия получает невосприимчивость к магии и дополнительную скорость передвижения в качестве баффа, поэтому противники могут проверить бафф и ‼ Сообщение для проверки оставшейся длительности жизни иллюзии"
      ],
      "item_behaviour": [],
      "description": "Создаёт чернильную иллюзию вражеского героя. Она невосприимчива к магии и имеет увеличенные скорость передвижения и урон.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0,54",
        "Дальность применения: 1200",
        "Количество иллюзий: 1",
        "Урон иллюзии: 150%",
        "Урон по иллюзии: 300%",
        "Доп\n скорости передвижения иллюзии: 30%",
        "Длительность иллюзии: 25"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c2\/Grimstroke_Dark_Portrait.mp3\/revision\/latest?cb=20210120230733",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев"
      ],
      "mana": "35",
      "aghanim": null,
      "name": "Dark Portrait",
      "cooldown": "200",
      "legacy_key": "D",
      "story": "Руке мастера подвластно любое тёмное творение."
    },
    {
      "notes": [
        "Перекрестие указателя должно выделять вражеское существо",
        "Связывает основную цель только с героями (исключая иллюзии, но включая клонов) или крипов-героев\n Основная цель может быть иллюзией",
        "Не связывается с ближайшими невидимыми или неуязвимыми героями",
        "Чем сильнее цепь растягивается, тем медленнее затронутые герои движутся друг от друга, пока полностью не остановятся\n Способность напрямую влияет на их скорость передвижения\n Цепь считается полностью растянутой на расстоянии 600 единиц, но может растягиваться до 700 единиц пока не разорвется\n Растянуть цепь на расстояние более 600 единиц можно исключительно принудительным движением\n Следующие заклинания не могут разорвать цепь:  Skewer,  Leap,  Pounce,  Tree Dance,  Primal Spring,  Toggle Movement, <span image=\"items\/force_staff\/full.webp\">[Force Staff]<\/span> Force Staff и <span image=\"items\/hurricane_pike\/full.webp\">[Hurricane Pike]<\/span> Hurricane Pike\n Однако <span image=\"items\/force_staff\/full.webp\">[Force Staff]<\/span> Force Staff и <span image=\"items\/hurricane_pike\/full.webp\">[Hurricane Pike]<\/span> Hurricane Pike (при применении на союзника) могут разорвать цепь, если оба героя смотрят в разные друг от друга стороны\n Все прочие источники принудительного движения, включая заклинания  Primal Roar и  Blinding Light, могут разорвать связь",
        "Связывает цель и её союзника друг с другом, предотвращая применение некоторых способностей для перемещения",
        "Если враги смогли разорвать цепь, то дебафф все равно остается активным на основной цели и мгновенно свяжет цель с ближайшим вражеским героем в радиусе",
        "В связанном состоянии любое направленное на одиночную цель заклинание применится на второго связанного героя, следуя тем же правилам, что и механика отражения заклинаний, но с некоторыми исключениями\n Заклинания, которые не работают:   Dive Bomb,  Hurl Boulder,  Cyclone,  Omnislash,   Infest,   Mana Drain (требуется третья цель для работы),  Static Link,  Charge of Darkness,  Nether Strike,  Snowball,  Soul Assumption и  Focus Fire\n Источником применения заклинания на связанного героя является заклинатель, поэтому его атрибуты и предметы также применяются к заклинанию\n Если первичная цель отразила заклинание, то эффект всё равно сработает на вторичную цель\n Увеличивающий урон от заклинаний по связанным целям  талант увеличивает только исходящий урон от заклинаний по связанным целей",
        "Следующие способности и предметы сработают на связанного героя с невосприимчивостью к магии, хотя в нормальных условиях они не должны были это сделать:  Brain Sap,  Spirit Siphon,  Lightning Storm,   Finger of Death (не наносит урон цели с невосприимчивостью, наносит урон по площади рядом с этой целью),  Laguna Blade,  Wrath of Nature,  Reaper's Scythe,  Decrepify,  Sunder,  Soul Rip, и  Dagon",
        "Дает общий обзор на обе цели, очерчивая их силуэты в невидимом состоянии",
        "На героя может действовать только одна связка\n Повторное применение Soulbind на ту же цель или на вторичную обновит длительность на двух героях\n Применение Soulbind на третьего героя в пределах уже связанных двух не свяжет его с ними до завершения действия первого применения\n Некоторые способности дают интересные эффекты при активном Soulbind:  Duel действует как обычно, но в ней участвуют оба героя\n Если один из героев умирает, то дуэль заканчивается\n Даваемый урон не удваивается\n При этом, если Legion Commander умирает, то урон дается обоим врагам\n  Winter's Curse помещает двух существ под эффект, но враги атакуют ближайшего союзника\n Кроме того, они не смогут нанести урон своему союзнику"
      ],
      "item_behaviour": [],
      "description": "Связывает выбранного вражеского героя с его ближайшим союзником, замедляя их и не позволяя им разойтись слишком далеко друг от друга. Если на одну из жертв применить способность, направленную на существо, она автоматически применится и на вторую. Если связь разорвётся раньше времени, первоначальная цель способности привяжется к ближайшему союзному герою в радиусе действия.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,15+0,5",
        "Дальность применения: 700\/800\/900",
        "Радиус захвата: 600",
        "Дистанция разрыва: 700",
        "Длительность: 6\/7\/8",
        "Доп\n урон от заклинаний по связанным жертвам:  25%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Grimstroke_Soulbind_1.mp3\/revision\/latest?cb=20191216013951",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев"
      ],
      "mana": "90\/70\/50",
      "aghanim": null,
      "name": "Soulbind",
      "cooldown": "150\/200\/250",
      "legacy_key": "B",
      "story": "Вознесённые — избранные сыны Ашкавора, чьи души связаны с душами тех, кого они должны защищать, и потому наделены невероятной мощью. Уничтожив свой народ, с годами последний страж узнал, каким нечестивым может стать ритуал связи..."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.9,
    "attrAgility": 18.0
  },
  "description": "Выводит врагов из строя одним взмахом кисти Мастерски манипулируя битвой со стороны, Grimstroke изучает каждого неприятеля до самых мелочей, чтобы появиться из чернильной тьмы и мановением кисти оглушить врагов и связать их вместе. Он с наслаждением досаждает противникам, натравливая на них своих фантомных рабов, и аккуратно выбирает момент, когда сможет отправить нескольких врагов на тот свет судьбоносным взмахом кисти.  Поддержка Быстрый урон Контроль Побег ★★☆",
  "history": "Жители Ашкавора столпились вокруг храмовой площади, желая узреть вознесение своего нового стража... Желая быть рядом с ним, когда их и его души свяжутся воедино. Но когда кисть последний раз коснулась рунного камня и связь с новым вознесённым зародилась, каждый — даже тот, кто остался дома — ощутил, что свершилось нечто ужасное. Он же сразу понял причину. Капли сукровицы, что должны были приумножить магические силы чернил, вместо этого отравили их, и теперь мощь связующего заклинания грозила поглотить его. Чернильная скверна заструилась вверх по рунному камню, по кисти — и вскоре захватила руки стража. Она быстро растекалась по телу. Тьма охватила лицо и рот — он уже не мог закричать, даже если бы пожелал. Всю свою жизнь он высчитывал, как заполучить силу выше тех пределов, которым учили наставники... Даже если ради этого он нарушит священный завет о чистоте чернил. Воистину, источник связующей силы открылся ему и направил в его душу такую мощь, которую нельзя и представить. Триумф был совсем близко; осталось только не погибнуть. Страж вобрал в себя силы из созданной связи, оттесняя поток чёрной скверны. Раздался страшный стон — то был общий плач его народа. Некоторые едва держались на ногах. Слабые пали оземь. Многие пытались бежать. А он черпал их жизненные силы ещё и ещё. Но даже они не могли остановить чернильный поток. Лишь когда воздух покинул залитые чернью лёгкие, а тело полностью поглотили чернила, он нашёл выход. Связь с народом Ашкавора — его народом, — должна была черпать их силы только во имя защиты... но протекала и обратно. Собрав оставшиеся силы, и в сей раз движимый не только слепым отвращением, страж пустил поток чернил по священной связи. Понемногу он чувствовал, как поток отступает... И слышал горькие стенания своего народа, окутанного скверной. Когда последняя капля чернил покинула тело стража, его глазам предстал совсем другой мир. Жителей Ашкавора, что он знал, больше не существовало. Все до последней души обратились в кошмарные тени прежних себя — в существ без плоти и крови; существ лишь из вязких, осквернённых чернил."
}