{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/48\/Maelstrom.mp3\/revision\/latest?cb=20141214010930",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Не сочетается с Chain Lightning от Mjollnir или других Maelstrom.",
        "При наличии нескольких предметов со способностью Chain Lightning, работать будет тот который был первым в инвентаре.",
        "Молнии отскакивают с интервалом в 0.25 секунды, так что поражение всех целей займёт 0.75 секунды.",
        "Не отскакивает на невидимых юнитов или юнитов в тумане войны.",
        "Никогда не может поразить одного юнита дважды за одно срабатывания.",
        "Может сработать только от успешных атак, не сработает на промахнувшихся атаках.",
        "Все отскоки в сумме нанесут до 560 урона (до уменьшений).",
        "Chain Lightning может сработать пока предыдущая еще отскакивает.",
        "Chain Lightning использует псевдо-случайное распределение.",
        "Бафф Maelstrom Chain спрятан и необходим для прыжков молний.",
        "Chain Lightning не использует обычную перезарядку. Она не отображается на иконке предмета при срабатывании, и не попадает под влияение эффектов манипулирующих перезарядкой."
      ],
      "mana": null,
      "abilityName": "Chain Lightning",
      "cooldown": "0.2",
      "description": "Каждая атака с вероятностью в 30% может создать разряд цепной молнии, которая 4 раза перескочит между случайными врагами в радиусе 650, нанося каждому по 140 магического урона. От атаки с цепной молнией нельзя уклониться.",
      "params": [
        "Шанс срабатывания: 30%",
        "Дистанция между отскоками: 650",
        "Количество отскоков: 4",
        "Интервал отскока: 0.25",
        "Урон: 140"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_partial_symbol)^Частично проходит сквозь иммунитет к заклинаниям\nМожет срабатывать и пытается нанести урон врагам с иммунитетом к заклинаниям\nНе может перескочить на врагов с иммунитетом."
      ],
      "story": null
    }
  ],
  "cost": "2700",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Javelin"
  ],
  "boughtFrom": "Артефакты",
  "name": "Maelstrom",
  "description": "Молот Maelstrom, будучи кованным самими богами, позволяет своему владельцу подчинить силу молнии.",
  "trivia": null,
  "upgradeIn": [
    "Gleipnir",
    "Mjollnir"
  ],
  "bonuses": [
    "+24 к урону"
  ],
  "tips": [
    "Maelstrom третий по эффективности предмет в игре в плане урона в секунду после Mask of Madness и Diffusal Blade (для героев ловкости).",
    "Maelstrom очень хорош для ускорения фарма. Если герой не нуждается в дополнительном опыте, то предмет будет отличной альтернативой Hand of Midas. Поскольку у молний большая дистанция отскоков, то их можно использовать для фарма нескольких лагерей в лесу одновременно, если на них есть обзор.",
    "Предмет также отлично подходит для противостояния иллюзиям или множеству призываемых существ: паукам Broodmother, энтам Nature's Prophet и прочим. Особенно он будет полезен героям дальнего боя без урона по области, поскольку они не могут использовать прорубание.",
    "Chain Lightning наносит магический урон, игнорирующий броню и блокировку урона, делая предмет хорошим выбором против героев, приобревших Vanguard или Tidehunter с его Kraken Shell и героев с большим количеством брони - Dragon Knight или Terrorblade.",
    "Задумайтесь о покупке Infused Raindrops, чтобы поглощать урон Chain Lightning.",
    "Maelstrom эффективен в защите против мегакрипов."
  ]
}