{
  "abilities": [
    {
      "notes": [
        "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.",
        "The cooldown reduction talent stacks multiplicatively with other sources cooldown reduction."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "450 AoE Living Armor",
          "talentRight": "100 DPS Overgrowth"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 Leech Seed Damage\/Heal",
          "talentRight": "12% Cooldown Reduction"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+24 Nature's Grasp Damage",
          "talentRight": "+48 Living Armor Heal"
        },
        {
          "talentLvl": "10",
          "talentLeft": "Nature's Guise Invisibility",
          "talentRight": "+60 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f8\/Treant_Protector_Nature%27s_Grasp_1.mp3\/revision\/latest?cb=20191215183430",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Nature's Grasp's effects are not instantly applied within its whole area. There is is a travel time.",
        "The vine path consists of 8 thickets, which are placed in a straight line in front of Treant Protector. The thickets are placed with 175 distance from each other, with the first one starting 100 range in front of Treant Protector, resulting in a total length of 1500. The brambles spawn in 0.1 second intervals, with the first one spawning right upon cast, resulting in a formation time of 0.8 seconds. Together with the effect radius, the path can hit units up to 1635 range away.",
        "The thickets are placed with 175 distance from each other, with the first one starting 100 range in front of Treant Protector, resulting in a total length of 1500.",
        "The brambles spawn in 0.1 second intervals, with the first one spawning right upon cast, resulting in a formation time of 0.8 seconds.",
        "Together with the effect radius, the path can hit units up to 1635 range away.",
        "A thicket's duration starts after the thicket was created. This means the last thicket disappears 12.8 seconds after cast.",
        "When there is a tree within the radius of any thicket, all thickets deal increased damage. Checks for trees once upon creation of the path. Trees created or destroyed after creation are ignored.",
        "Checks for trees once upon creation of the path. Trees created or destroyed after creation are ignored.",
        "The slow and damage are provided by an aura, which is applied by each thicket in the path. There are 2 different modifiers modifier_treant_natures_grasp_damage is used by regular thickets. modifier_treant_natures_grasp_damage_bonus is used by thickets boosted by trees. These 2 modifiers stack with each other, but do not stack with multiple of themselves.",
        "There are 2 different modifiers modifier_treant_natures_grasp_damage is used by regular thickets. modifier_treant_natures_grasp_damage_bonus is used by thickets boosted by trees.",
        "These 2 modifiers stack with each other, but do not stack with multiple of themselves.",
        "Deals 7.5\/10\/12.5\/15 (3.75\/5\/6.25\/7.5 against creeps) damage in 0.25 second intervals, starting 0.25 seconds after the debuff is placed. When buffed by a tree, deals 11.25\/15\/18.75\/22.5 (5.63\/7.5\/9.38\/11.25 against creeps) damage in 0.25 second intervals",
        "When buffed by a tree, deals 11.25\/15\/18.75\/22.5 (5.63\/7.5\/9.38\/11.25 against creeps) damage in 0.25 second intervals",
        "With the level 15 talent, deals 13.5\/16\/18.5\/21 (6.75\/8\/9.25\/10.5 against creeps) damage in 0.25 second intervals, starting 0.25 seconds after the debuff is placed. When buffed by a tree, deals 20.25\/24\/27.75\/31.5 (10.13\/12\/13.88\/15.75 against creeps) damage in 0.25 second intervals",
        "When buffed by a tree, deals 20.25\/24\/27.75\/31.5 (10.13\/12\/13.88\/15.75 against creeps) damage in 0.25 second intervals",
        "Can deal up to 375\/500\/625\/750 (187.5\/250\/312.5\/375 to creeps) damage to a single unit (before reductions). When buffed by a tree, can deal up to 562.5\/750\/937.5\/1125 (281.25\/375\/468.75\/562.5 to creeps) damage to a single unit (before reductions).",
        "When buffed by a tree, can deal up to 562.5\/750\/937.5\/1125 (281.25\/375\/468.75\/562.5 to creeps) damage to a single unit (before reductions).",
        "With the level 15 talent, can deal up to 675\/800\/925\/1050 (337.5\/400\/462.5\/525 to creeps) damage to a single unit (before reductions). When buffed by a tree, can deal up to 1012.5\/1200\/1387.5\/1575 (506.25\/600\/693.75\/787.5 to creeps) damage to a single unit (before reductions).",
        "When buffed by a tree, can deal up to 1012.5\/1200\/1387.5\/1575 (506.25\/600\/693.75\/787.5 to creeps) damage to a single unit (before reductions)."
      ],
      "mana": "75\/80\/85\/90",
      "hotKey": "Q",
      "cooldown": "20\/19\/18\/17 (TagTalent 17.6\/16.72\/15.84\/14.96)",
      "description": "Creates vines towards the target location. Vines slow down and deal damage to enemies that walk through. Vines deal 50% more damage if they touch a tree. Does half damage to creeps.",
      "spellName": "Nature's Grasp",
      "params": [
        "Cast Animation: 0.2+0.7",
        "Cast Range: 1500",
        "Vine Path Length: 1500",
        "Vines Radius: 135",
        "Damage per Second: 30\/40\/50\/60 (TagTalent 54\/64\/74\/84)",
        "Tree Contact Damage Increase: 50%",
        "Creep Damage Percentage: 50%",
        "Move Speed Slow: 25%\/30%\/35%\/40%",
        "Vines Duration: 12",
        "Aura Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The Protectors don't often come into vision; their natural state being nestled within their leafy brethren."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Treant_Protector_Leech_Seed.mp3\/revision\/latest?cb=20201009120946",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "Deals damage and sends healing projectiles in 1-second intervals, starting 1 second after the cast, resulting in 5 pulses.",
        "Can deal up to 80\/160\/240\/320 (TagTalent 280\/360\/440\/520) damage (before reductions) and heal a single unit for the same amount.",
        "The heal is independent from the damage and always heals for the same amount, regardless of how much damage the target takes.",
        "Healing projectiles travel at a speed of 450.",
        "The debuff persists through death, so even when the target dies, it continues pulsing.",
        "If the target turns invisible, the pulses continue coming from its current actual position, making it possible to track it.",
        "Healing pulse projectiles cannot target invulnerable or hidden units, but already flying projectiles still heal them."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "W",
      "cooldown": "18\/16\/14\/12 (TagTalent 15.84\/14.08\/12.32\/10.56)",
      "description": "Treant plants a life-sapping seed in an enemy unit, draining its health, while simultaneously slowing it. The seed heals friendly units around it.",
      "spellName": "Leech Seed",
      "params": [
        "Cast Animation: 0.5+0.4",
        "Cast Range: 400",
        "Radius: 650",
        "Pulse Interval: 1",
        "Damage\/Heal per Pulse: 16\/32\/48\/64 (TagTalent 56\/72\/88\/104)",
        "Move Speed Slow: 8%\/14%\/20%\/26%",
        "Duration: 5",
        "Can heal spell immune allies. Slow persists, attempts to damage and continues to pulse, if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Rooftrellen nurtures the beings under his stewardship, sustained by the lifeforce of trespassers into his sacred ground."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Treant_Protector_Living_Armor_1.mp3\/revision\/latest?cb=20191215183426",
      "effects": [
        "Ability Target Point \/ Target Unit (TagAghanim Target Area)",
        "Affects Allies"
      ],
      "notes": [
        "When targeting the ground, the closest unit to the target point is targeted instead. ↓↓ Double-tapping automatically targets self (TagTalent 450 radius centered around Treant Protector).",
        "↓↓ Double-tapping automatically targets self (TagTalent 450 radius centered around Treant Protector).",
        "Can be cast on buildings, providing all its effects to them.",
        "Heals 5\/8.33\/11.67\/15 (TagTalent 9\/12.33\/15.67\/19) health in 1 second intervals, starting 1 second after the buff is placed, resulting in 12 instances.",
        "The level 25 talent turns Living Armor into an area-targeted spell, so that it cannot directly target units anymore. Self-casting the ability still targets Treant Protector, centering the radius around him. In this form, it only affects heroes (including illusions and clones, excluding creep-heroes) and buildings (excluding effigy buildings). It can no longer be used on creeps.",
        "Self-casting the ability still targets Treant Protector, centering the radius around him.",
        "In this form, it only affects heroes (including illusions and clones, excluding creep-heroes) and buildings (excluding effigy buildings). It can no longer be used on creeps."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "26\/22\/18\/14 (TagTalent 22.88\/19.36\/15.84\/12.32)",
      "description": "Infuses the target hero or structure with a protective coating which heals the target and provides bonus armor.",
      "spellName": "Living Armor",
      "params": [
        "Cast Animation: 0.4+0.5",
        "Cast Range: Global",
        "Total Heal: 60\/100\/140\/180 (TagTalent 108\/148\/188\/228)",
        "Armor Bonus: 5\/6\/7\/8",
        "Duration: 12",
        "Radius: 450"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "The roots and tendrils of the Treant Protectors are far-reaching, stimulating the growth and rejuvenation of all of nature."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1b\/Treant_Protector_Eyes_In_The_Forest.mp3\/revision\/latest?cb=20191215183440",
      "effects": [
        "Ability Target Unit",
        "Affects Trees"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. In Ability Draft, Eyes In The Forest can be unlocked by the player that drafted Overgrowth.",
        "In Ability Draft, Eyes In The Forest can be unlocked by the player that drafted Overgrowth.",
        "There is no limit on how many enchanted trees can be up at one time.",
        "The Enchantment of a tree has no expire time; it lasts until the tree gets destroyed.",
        "Enchanted trees have distinct icons on the minimap. Just like buildings, it is colored green if allied.",
        "Enchanted trees have 800 range flying vision and are invisible (0-second fade time).",
        "If the enemy has True Sight over the enchanted tree, they are able to see the visual effects on both the affected tree and the 800 radius around it.",
        "The sound effect upon cast is audible to allies only.",
        "Upon dropping, selling or destroying Aghanim's Scepter, the enchanted trees still provide vision, and are not removed. However, Overgrowth does not root enemies around enchanted trees, and does not deal damage.",
        "However, Overgrowth does not root enemies around enchanted trees, and does not deal damage.",
        "The tree respawn aspect sets the respawn time of all trees on the map to 10 seconds. This does not include trees created by abilities and items. If Aghanim's Scepter is acquired while there already are destroyed trees, they respawn immediately.",
        "If Aghanim's Scepter is acquired while there already are destroyed trees, they respawn immediately."
      ],
      "mana": "100",
      "hotKey": "D",
      "cooldown": "",
      "description": "Treant Protector enchants a tree, which grants him unobstructed vision in that location. If Overgrowth is cast, units within a 800 radius of an enchanted tree will be entangled and damaged.",
      "spellName": "Eyes In The Forest",
      "params": [
        "Cast Animation: 0.2+0.83",
        "Cast Range: 160",
        "Vision\/Overgrowth Radius: 800",
        "Global Tree Respawn Time: 10",
        "Number of Charges: 3",
        "Charge Replenish Time: 40 (TagTalent 35.2)"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "One can never be too certain who, or what, might need protecting."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Treant_Protector_Nature%27s_Guise_2.mp3\/revision\/latest?cb=20191215183434",
      "effects": [
        "Ability Passive",
        "Affects Self (TagAghanim Enemies)",
        "Damage Magical"
      ],
      "notes": [
        "This is an innate ability and does not need to be learned. Treant Protector does not have this ability in Ability Draft, nor is it bound to any of his abilities.",
        "Treant Protector does not have this ability in Ability Draft, nor is it bound to any of his abilities.",
        "This ability gets only disabled when taking damage while not already affected by it. This means when within range of a tree already, taking damage does not disable any of the bonuses.",
        "This means when within range of a tree already, taking damage does not disable any of the bonuses.",
        "Reacts on any damage greater than 0 from any player (including allies and self) or Roshan.",
        "Applies heal amplification and health regeneration amplification, but not lifesteal amplification or spell lifesteal amplification.",
        "When the level 10 talent is chosen, Treant Protector also gains invisibility when within 150 range of a tree. Unlike the other bonuses, the invisibility has a grace time of 0.75 seconds. This means the invisibility is not lost instantly upon getting out of range of a tree, and may be not lost at all when coming within range of a tree again. Casting spells or using items does not break the invisibility. Performing an attack breaks the invsibility, regardless of whether the attack actually landed or not. When still within tree radius while attacking, the invisibility gets re-applied seconds later.",
        "Unlike the other bonuses, the invisibility has a grace time of 0.75 seconds.",
        "This means the invisibility is not lost instantly upon getting out of range of a tree, and may be not lost at all when coming within range of a tree again.",
        "Casting spells or using items does not break the invisibility.",
        "Performing an attack breaks the invsibility, regardless of whether the attack actually landed or not.",
        "When still within tree radius while attacking, the invisibility gets re-applied seconds later.",
        "With Aghanim's Shard, attacks root the target whenever off cooldown, preventing it from moving and casting certain mobility spells. If Treant Protector has the tree-walking modifier, the increased root duration is used. Deals 4 instances of 50 damage over the total duration. The interval adapts to the duration. The first damage instance is dealt after th of the duration is over, and not immediately upon placing the debuff. Provides True Sight over the target.",
        "If Treant Protector has the tree-walking modifier, the increased root duration is used.",
        "Deals 4 instances of 50 damage over the total duration. The interval adapts to the duration.",
        "The first damage instance is dealt after th of the duration is over, and not immediately upon placing the debuff.",
        "Provides True Sight over the target."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Tree Search Radius: 150",
      "spellName": "Nature's Guise",
      "params": [
        "Tree Search Radius: 150",
        "Move Speed Bonus: 15% (TagTalent 30%)",
        "Heal and Health Regen Amplification: 40%",
        "Damage Disable Duration: 3",
        "Fade Delay: 0",
        "Invisibility Linger Duration: 0.75",
        "Root Total Damage: 200",
        "Default Root Duration: 1",
        "Near-Tree Root Duration: 2",
        "Causes Nature's Guise to root enemies upon attacking. Roots them for 2 second and deals a total of 200 damage. Lasts an extra second when attacking near a tree. Increases movement speed bonus by 15%.",
        "Neither invisibility nor root on attack are disabled by Break.",
        "Invisibility component fully works for illusions. Root on attack does not work for illusions."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": "The Protectors don't often come into vision; their natural state being nestled within their leafy brethren."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Treant_Protector_Overgrowth_1.mp3\/revision\/latest?cb=20191215183435",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Roots and disarms the targets, preventing them from moving, attacking and casting certain mobility spells. Provides True Sight over the targets, but does not affect already invisible targets.",
        "Provides True Sight over the targets, but does not affect already invisible targets.",
        "Forces a stop command onto affected units upon placing the debuff, canceling ability casts and interrupting channeling abilities.",
        "Deals damage in 1-second intervals, starting 1 second after cast, resulting in 3\/4\/5 instances.",
        "Can deal up to 225\/300\/375 (TagTalent 525\/700\/875) damage (before reductions).",
        "With Aghanim's Scepter, Overgrowth also affects enemies within 800 range of a tree enchanted by Eyes In The Forest."
      ],
      "mana": "200\/250\/300",
      "hotKey": "R",
      "cooldown": "100 (TagTalent 88)",
      "description": "Summons an overgrowth of vines and branches around Treant that prevent afflicted enemies from moving, blinking, going invisible, or attacking.",
      "spellName": "Overgrowth",
      "params": [
        "Cast Animation: 0.5+1.17",
        "Radius: 800",
        "Damage per Second: 75 (TagTalent 175)",
        "Duration: 3\/4\/5",
        "Grants a new ability: Eyes In The Forest. If Overgrowth is cast, units within a radius of an enchanted tree will be entangled and damaged. Passively causes all trees to respawn much faster."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Rooftrellen calls the ancestral spirit of nature, releasing its power through all of his kin."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 25.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.0,
    "attrAgility": 15.0
  },
  "description": "Rooftrellen, the Treant Protector, is a melee strength hero who excels in supporting and strengthening his allies with his beneficial set of spells, which use the power of nature. He is a natural tank, offensively and defensively, having both the highest natural attack damage and the third highest overall strength in the game. Manipulating the power of the plants to his will, he can grant invisibility and stealth to himself with Nature's Guise and move quickier, being a good ganking skill and rather efficient for scouting, provided that he remains within close proximity to a tree. He can use Leech Seed to sap the life from a target, slowing and dealing moderate damage over time to it while nearby allies are replenished by the same amount. His signature Living Armor makes him truly live up his title, as he is able to provide allies and even friendly buildings with increased health regeneration and armour from anywhere on the map. Finally, his ultimate Overgrowth roots nearby enemies with vines, branches, and roots, it immobilizes them and renders them unable to attack for several crucial seconds while also damaging them over time. Although Rooftrellen is not able to dish out much damage outside of his regular attacks, he is able to provide an enormous amount of defensive utility and survivability to himself and his teammates, thereby planting the seeds for a decisive victory",
  "history": "Far to the west, in the mountains beyond the Vale of Augury, lie the remains of an ancient power, a fount of eldritch energy nestled deep in the high woods. It is said that the things that grow here, grow strangely. To the forces of nature this is a sacred place, made to stay hidden and unknown. Many are the traps and dangers of this land--all-consuming grasses and crossbred fauna and poisonous flowers--but none are so fierce as the mighty Treant Protectors. These ageless, titanic beings, charged with keeping the peace in this dangerous land, ensure that none within encroach without reason, and none without poach their secrets. For time untold they tended to their holy ground, uninterrupted, only dimly aware of the changing world beyond. Yet inevitably the wider world grew aware of this untamed land, and with each passing winter the outsiders grew bolder. Soon they arrived with tools to cut and with flames to burn, and often the Treants would ponder: who are these fragile, industrious creatures? What now had become of the wild, green world? There came and went an age of questions and of doubts, a thousand summers of long traditions set to scrutiny, while more and more the outsiders died and fed their earth. When all that bloomed had finally finished their stay, curiosity had overcome caution. It was decided: a lone Protector would be sent into the wider world, and instructed to wander until the glaciers arose once more, to observe the changing land and its creatures, and to discover what unknown dangers could threaten their sacred ground.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "450 AoE Living Armor",
      "talentRight": "100 DPS Overgrowth"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 Leech Seed Damage\/Heal",
      "talentRight": "12% Cooldown Reduction"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+24 Nature's Grasp Damage",
      "talentRight": "+48 Living Armor Heal"
    },
    {
      "talentLvl": "10",
      "talentLeft": "Nature's Guise Invisibility",
      "talentRight": "+60 Damage"
    }
  ]
}