{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "450 AoE Living Armor",
          "talentRight": "100 DPS Overgrowth"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 Leech Seed Damage\/Heal",
          "talentRight": "+8 Living Armor Bonus Armor"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 Nature's Grasp Damage",
          "talentRight": "+15% Leech Seed Movement Slow"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-5s Nature's Grasp Cooldown",
          "talentRight": "+36 Living Armor Heal"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f8\/Treant_Protector_Nature%27s_Grasp_1.mp3\/revision\/latest?cb=20191215183430",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Nature's Grasp's effects have a travel time, and are not instantly applied within its whole area.",
        "The vine path consists of 8 thickets, which are placed in a straight line in front of Treant Protector. The thickets are placed with 175 distance from each other, with the first one starting 100 range in front of Treant Protector, resulting in a total length of 1500. The brambles spawn in 0.1-second intervals, with the first one spawning upon cast, resulting in a formation time of 0.8 seconds. With the path length and effect radius, Nature's Grasp can hit units up to 1635 range away.",
        "The thickets are placed with 175 distance from each other, with the first one starting 100 range in front of Treant Protector, resulting in a total length of 1500.",
        "The brambles spawn in 0.1-second intervals, with the first one spawning upon cast, resulting in a formation time of 0.8 seconds.",
        "With the path length and effect radius, Nature's Grasp can hit units up to 1635 range away.",
        "The thicket's duration starts after it was created. This means the last thicket disappears 9.8\/10.8\/11.8\/12.8 seconds after cast. If a tree is within the radius of any thicket, all thickets deal increased damage. Checks for trees once upon creation of the path. Trees created or destroyed after the thickets' creation are ignored.",
        "If a tree is within the radius of any thicket, all thickets deal increased damage.",
        "Checks for trees once upon creation of the path. Trees created or destroyed after the thickets' creation are ignored.",
        "The movement speed slow and damage are provided by an aura, which is applied by each thicket in the path, it has a linger duration of 0.5 seconds. There are 2 different modifiers used — the damage modifier is used by regular thickets, while the damage bonus modifier is used by thickets buffed by trees. These 2 modifiers stack with each other, but do not stack with multiple of themselves.",
        "There are 2 different modifiers used — the damage modifier is used by regular thickets, while the damage bonus modifier is used by thickets buffed by trees.",
        "These 2 modifiers stack with each other, but do not stack with multiple of themselves.",
        "Deals 7.5\/10\/12.5\/15 (TagTalent 15\/17.5\/20\/22.5) damage in 0.25-second intervals, starting 0.25 seconds after the debuff is placed. Can deal up to 285\/420\/575\/750 (TagTalent 570\/735\/920\/1125) damage (before reductions) to a single unit. When buffed by a tree, deals 11.25\/15\/18.75\/22.5 (TagTalent 22.5\/26.25\/30\/33.75) damage in 0.25-second intervals. When buffed by a tree, can deal up to 427.5\/630\/862.5\/1125 (TagTalent 855\/1102.5\/1380\/1687.5) damage to a single unit.",
        "Can deal up to 285\/420\/575\/750 (TagTalent 570\/735\/920\/1125) damage (before reductions) to a single unit.",
        "When buffed by a tree, deals 11.25\/15\/18.75\/22.5 (TagTalent 22.5\/26.25\/30\/33.75) damage in 0.25-second intervals.",
        "When buffed by a tree, can deal up to 427.5\/630\/862.5\/1125 (TagTalent 855\/1102.5\/1380\/1687.5) damage to a single unit.",
        "Against non-hero units, it deals 3.75\/5\/6.25\/7.5 (TagTalent 7.5\/8.75\/10\/11.25) damage in 0.25-second intervals, starting 0.25 seconds after the debuff is placed. Can deal up to 142.5\/210\/287.5\/375 (TagTalent 285\/367.5\/460\/562.5) damage (before reductions) to a single non-hero unit. When buffed by a tree, deals 5.63\/7.5\/9.38\/11.25 (TagTalent 11.25\/13.13\/15\/16.88) damage in 0.25-second intervals. When buffed by a tree, can deal up to 213.75\/315\/431.25\/562.5 (TagTalent 427.5\/551.25\/690\/843.75) damage to a single non-hero unit.",
        "Can deal up to 142.5\/210\/287.5\/375 (TagTalent 285\/367.5\/460\/562.5) damage (before reductions) to a single non-hero unit.",
        "When buffed by a tree, deals 5.63\/7.5\/9.38\/11.25 (TagTalent 11.25\/13.13\/15\/16.88) damage in 0.25-second intervals.",
        "When buffed by a tree, can deal up to 213.75\/315\/431.25\/562.5 (TagTalent 427.5\/551.25\/690\/843.75) damage to a single non-hero unit."
      ],
      "mana": "75\/80\/85\/90",
      "item_behaviour": [],
      "name": "Nature's Grasp",
      "cooldown": "20\/19\/18\/17 (TagTalent 15\/14\/13\/12)",
      "description": "Creates vines towards the target location. Vines slow down and deal damage to enemies that walk through. Vines deal 50% more damage if they touch a tree. Does half damage to creeps.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.7",
        "Cast Range: 1500",
        "Vine Path Length: 1500",
        "Vines Radius: 135",
        "Damage per Second: 30\/40\/50\/60 (TagTalent 60\/70\/80\/90)",
        "Tree Contact Damage Increase: 50%",
        "Creep Damage Percentage: 50%",
        "Move Speed Slow: 25%\/30%\/35%\/40%",
        "Vines Duration: 9\/10\/11\/12",
        "Aura Linger Duration: 0.5"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Treant_Protector_Leech_Seed.mp3\/revision\/latest?cb=20201009120946",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "The healing projectiles travel at a speed of 450. Healing projectiles cannot target invulnerable or hidden units, but airborne projectiles still heal them. The heal is independent from the damage and always heals for the same amount, regardless of how much damage the target takes.",
        "Healing projectiles cannot target invulnerable or hidden units, but airborne projectiles still heal them.",
        "The heal is independent from the damage and always heals for the same amount, regardless of how much damage the target takes.",
        "Deals damage and sends healing projectiles in 1-second intervals, starting immediately upon cast, resulting in 5 pulses. Can deal up to 80\/160\/240\/320 (TagTalent 280\/360\/440\/520) damage (before reductions) and heal for the same amount of health a single unit for the same amount.",
        "Can deal up to 80\/160\/240\/320 (TagTalent 280\/360\/440\/520) damage (before reductions) and heal for the same amount of health a single unit for the same amount.",
        "The debuff persists through death, so even when the target dies, Leech Seed continues pulsing.",
        "If the target turns invisible while Leech Seed is still active, the pulses continue coming from its current actual position, making it possible to track the target."
      ],
      "mana": "80\/90\/100\/110",
      "item_behaviour": [],
      "name": "Leech Seed",
      "cooldown": "18\/16\/14\/12",
      "description": "Treant plants a life-sapping seed in an enemy unit, draining its health, while simultaneously slowing it. The seed heals friendly units around it.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.5+0.4",
        "Cast Range: 400",
        "Radius: 650",
        "Pulse Interval: 1",
        "Damage\/Heal per Pulse: 16\/32\/48\/64 (TagTalent 56\/72\/88\/104)",
        "Move Speed Slow: 8%\/14%\/20%\/26% (TagTalent 23%\/29%\/35%\/41%)",
        "Duration: 5",
        "Can heal spell immune allies. Slow persists, attempts to damage and continues to pulse, if debuff was placed before spell immunity and when not dispelled."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Treant_Protector_Living_Armor_1.mp3\/revision\/latest?cb=20191215183426",
      "effects": [
        "Ability Target Point \/ Target Unit (TagAghanim Target Area)",
        "Affects Allies"
      ],
      "notes": [
        "When ground-targeted, the closest unit to the target point is targeted instead. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Can be cast on buildings, providing all its effects to them.",
        "Heals 5\/8.33\/11.67\/15 (TagTalent 8\/11.33\/14.67\/18) health in 1-second intervals, starting 1 second after the buff is placed, resulting in 12 instances.",
        "With the level 25 talent, Living Armor turns into an area-targeted ability, so that it cannot directly target units anymore. ↓↓ Double-tapping centering the radius around Treant Protector.",
        "↓↓ Double-tapping centering the radius around Treant Protector."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Living Armor",
      "cooldown": "26\/22\/18\/14",
      "description": "Infuses the target hero or structure with a protective coating which heals the target and provides bonus armor.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0.66",
        "Cast Range: Global",
        "Total Heal: 60\/100\/140\/180 (TagTalent 96\/136\/176\/216)",
        "Armor Bonus: 5\/6\/7\/8 (TagTalent 13\/14\/15\/16)",
        "Duration: 12",
        "Radius: 450"
      ],
      "legacy_key": "V",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1b\/Treant_Protector_Eyes_In_The_Forest.mp3\/revision\/latest?cb=20191215183440",
      "effects": [
        "Ability Target Unit",
        "Affects Trees"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Eyes In The Forest sets the respawn time of all natural trees on the map to 10 seconds, down from the default 3 minutes. Planted trees are not affected. Acquiring Aghanim's Scepter causes destroyed trees on the map to respawn immediately.",
        "Acquiring Aghanim's Scepter causes destroyed trees on the map to respawn immediately.",
        "There is no limit on how many enchanted trees can be up at one time, and the enchantment lasts until the tree is destroyed. A single tree can be enchanted multiple times. However, this provides no gameplay benefit.",
        "A single tree can be enchanted multiple times. However, this provides no gameplay benefit.",
        "Enchanted trees have distinct icons on the minimap. It is colored green\/blue if Treant Protector is an ally.",
        "Enchanted trees have 800 radius flying vision. If enemies have True Sight over the enchanted tree, the visual effects on both the affected tree and the 800 radius circle around it can be seen.",
        "If enemies have True Sight over the enchanted tree, the visual effects on both the affected tree and the 800 radius circle around it can be seen.",
        "The sound effect upon cast is audible to allies only.",
        "Applies Overgrowth based on the current level within 800 radius of every enchanted tree when Overgrowth is cast. Overgrowth notes fully apply. Multiple overlapping areas do not cause Overgrowth to stack.",
        "Overgrowth notes fully apply.",
        "Multiple overlapping areas do not cause Overgrowth to stack.",
        "When losing Aghanim's Scepter, the enchanted trees still provide vision, and the enchantment is not removed. However, Overgrowth no longer root enemies around the enchanted trees anymore.",
        "However, Overgrowth no longer root enemies around the enchanted trees anymore."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Eyes In The Forest",
      "cooldown": "",
      "description": "Treant Protector enchants a tree, which grants him unobstructed vision in that location. If Overgrowth is cast, units within a 800 radius of an enchanted tree will be entangled and damaged.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.83",
        "Cast Range: 160",
        "Vision\/Overgrowth Radius: 800",
        "Global Tree Respawn Time: 10",
        "Number of Charges: 3",
        "Charge Replenish Time: 40"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Treant_Protector_Nature%27s_Guise_2.mp3\/revision\/latest?cb=20191215183434",
      "effects": [
        "Ability Passive",
        "Affects Self (TagAghanim Enemies)",
        "Damage Magical"
      ],
      "notes": [
        "This is an innate ability and does not need to be learned.",
        "Nature's Guise is disabled when taking damage greater than 0 (after reductions), while not already affected by it. This means when Treant Protector is within the tree search radius, taking damage does not disable any of the bonuses. Only damage from player-controlled sources, including allies, and Roshan can disable Nature's Guise.",
        "This means when Treant Protector is within the tree search radius, taking damage does not disable any of the bonuses.",
        "Only damage from player-controlled sources, including allies, and Roshan can disable Nature's Guise.",
        "Applies heal amplification and health regeneration amplification, but not lifesteal amplification or spell lifesteal amplification.",
        "With Aghanim's Shard, attacks root the target whenever the ability is off cooldown, preventing them from moving and casting certain mobility abilities. If Treant Protector has the tree-walking modifier, the root duration is increased to 2 seconds. Deals 4 instances of 50 damage over the total duration. The damage interval adapts to the root duration. The first damage instance is dealt after th of the root duration is over, and not immediately upon placing the debuff. Provides True Sight over the target.",
        "If Treant Protector has the tree-walking modifier, the root duration is increased to 2 seconds.",
        "Deals 4 instances of 50 damage over the total duration. The damage interval adapts to the root duration.",
        "The first damage instance is dealt after th of the root duration is over, and not immediately upon placing the debuff.",
        "Provides True Sight over the target.",
        "With Aghanim's Shard, Treant Protector also gains invisibility within 150 range of a tree. Unlike the other bonuses, the invisibility has a linger duration of 0.75 seconds. This means the invisibility is not lost instantly upon getting out of range of a tree, and may not be lost at all when coming within range of a tree again. Casting abilities does not break the invisibility. Performing an attack breaks the invisibility, regardless of whether the attack actually landed or not. While attacking within the tree search radius, it causes the invisibility to be re-applied on him 0.75 seconds later.",
        "Unlike the other bonuses, the invisibility has a linger duration of 0.75 seconds.",
        "This means the invisibility is not lost instantly upon getting out of range of a tree, and may not be lost at all when coming within range of a tree again.",
        "Casting abilities does not break the invisibility.",
        "Performing an attack breaks the invisibility, regardless of whether the attack actually landed or not.",
        "While attacking within the tree search radius, it causes the invisibility to be re-applied on him 0.75 seconds later."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Nature's Guise",
      "cooldown": null,
      "description": "Provides Treant with Tree Walking whenever he hasn't taken damage for 3 seconds. While active, Treant gains movement speed bonus and amplified healing and regeneration on himself.",
      "hot_key": null,
      "params": [
        "Tree Search Radius: 150",
        "Move Speed Bonus: 15% (TagTalent 30%)",
        "Heal and Health Regen Amplification: 40%",
        "Damage Disable Duration: 3",
        "Fade Delay: 0",
        "Invisibility Linger Duration: 0.75",
        "Root Total Damage: 200",
        "Default Root Duration: 1",
        "Near-Tree Root Duration: 2",
        "Causes you to become invisible with Nature's Guise and root enemies upon attacking. Roots them for 2 second and deals a total of 200 damage. Lasts an extra second when attacking near a tree. Increases movement speed bonus by 15%.",
        "Invisibility component fully works for illusions. Root on attack does not work for illusions."
      ],
      "legacy_key": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Treant_Protector_Overgrowth_1.mp3\/revision\/latest?cb=20191215183435",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Roots and disarms the targets, preventing them from moving, attacking, and casting certain mobility abilities. Provides True Sight over the targets, but does not affect already invisible targets.",
        "Provides True Sight over the targets, but does not affect already invisible targets.",
        "Forces a stop command onto affected units upon placing the debuff, canceling ability casts, and interrupting channeling abilities. Since this only happens once upon placing the debuff, it does not prevent other channeling abilities after the debuff is placed.",
        "Since this only happens once upon placing the debuff, it does not prevent other channeling abilities after the debuff is placed.",
        "Deals damage in 1-second intervals, starting 1 second after cast, resulting in 3\/4\/5 instances.",
        "Can deal up to 225\/300\/375 (TagTalent 525\/700\/875) damage (before reductions).",
        "With Aghanim's Scepter, Overgrowth also affects enemies within 800 range of a tree enchanted by Eyes In The Forest."
      ],
      "mana": "200\/250\/300",
      "item_behaviour": [],
      "name": "Overgrowth",
      "cooldown": "100",
      "description": "Summons an overgrowth of vines and branches around Treant that prevent afflicted enemies from moving, blinking, going invisible, or attacking.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.5+1.17",
        "Radius: 800",
        "Damage per Second: 75 (TagTalent 175)",
        "Duration: 3\/4\/5",
        "Grants a new ability: Eyes In The Forest. If Overgrowth is cast, units within a radius of an enchanted tree will be entangled and damaged. Passively causes all trees to respawn much faster."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 25.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.0,
    "attrAgility": 15.0
  },
  "description": "Rooftrellen, the Treant Protector, is a melee strength hero who excels in supporting and strengthening his allies with his beneficial set of spells, which use the power of nature. He is a natural tank, offensively and defensively, having both the highest natural attack damage and the third highest overall strength in the game. Manipulating the power of the plants to his will, he can grant invisibility and stealth to himself with Nature's Guise and move quicker, being a good ganking skill and rather efficient for scouting, provided that he remains within close proximity to a tree. He can use Leech Seed to sap the life from a target, slowing and dealing moderate damage over time to it while nearby allies are replenished by the same amount. His signature Living Armor makes him truly live up his title, as he is able to provide allies and even friendly buildings with increased health regeneration and armour from anywhere on the map. Finally, his ultimate Overgrowth roots nearby enemies with vines, branches, and roots, it immobilizes them and renders them unable to attack for several crucial seconds while also damaging them over time. Although Rooftrellen is not able to dish out much damage outside of his regular attacks, he is able to provide an enormous amount of defensive utility and survivability to himself and his teammates, thereby planting the seeds for a decisive victory",
  "history": "Far to the west, in the mountains beyond the Vale of Augury, lie the remains of an ancient power, a fount of eldritch energy nestled deep in the high woods. It is said that the things that grow here, grow strangely. To the forces of nature this is a sacred place, made to stay hidden and unknown. Many are the traps and dangers of this land. There are all-consuming grasses, crossbred fauna and poisonous flowers, but none are so fierce as the mighty Treant Protectors. These ageless, titanic beings, charged with keeping the peace in this dangerous land, ensure that none within encroach without reason, and none without poach their secrets. For time untold they tended to their holy ground, uninterrupted, only dimly aware of the changing world beyond. Yet inevitably the wider world grew aware of this untamed land, and with each passing winter the outsiders grew bolder. Soon they arrived with tools to cut and with flames to burn, and often the Treants would ponder: who are these fragile, industrious creatures? What now had become of the wild, green world? There came and went an age of questions and of doubts, a thousand summers of long traditions set to scrutiny, while more and more the outsiders died and fed their earth. When all that bloomed had finally finished their say, curiosity had overcome caution. It was decided: a lone Protector would be sent into the wider world, and instructed to wander until the glaciers arose once more, to observe the changing land and its creatures, and to discover what unknown dangers could threaten their sacred ground.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "450 AoE Living Armor",
      "talentRight": "100 DPS Overgrowth"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 Leech Seed Damage\/Heal",
      "talentRight": "+8 Living Armor Bonus Armor"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 Nature's Grasp Damage",
      "talentRight": "+15% Leech Seed Movement Slow"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-5s Nature's Grasp Cooldown",
      "talentRight": "+36 Living Armor Heal"
    }
  ]
}