{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Enchantress до 40%.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+20 к лечению от Nature's Attendants",
          "talentRight": "+6,5% к урону от Impetus"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Enchant действует на древних крипов",
          "talentRight": "+65 к замедлению от Untouchable"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+6 светлячков от Nature's Attendants",
          "talentRight": "+40 к урону"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости передвижения",
          "talentRight": "+12% к сопротивлению магии"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Impetus.mp3\/revision\/latest?cb=20141207171051",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Дистанция рассчитывается в тот момент, когда снаряд достигнет цель. То есть, увеличение расстояния от цели увеличит урон от способности, а уменьшение - снизит.",
        "То есть, увеличение расстояния от цели увеличит урон от способности, а уменьшение - снизит.",
        "Дополнительный урон наносится отдельным источником урона и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Урон от Impetus наносится раньше, чем урон с руки, но его нанесение все равно зависит от попадания атаки по цели.",
        "Увеличение урона ограничено расстоянием в 1750 единиц, что соответствует 140\/210\/280\/350 (TagTalent 253,75\/323,75\/393,75\/463,75) единицам урона.",
        "Действует на все цели, кроме вардов и строений."
      ],
      "mana": "65",
      "hotKey": "Q",
      "cooldown": "6\/4\/2\/0",
      "description": "Усиливает атаки героя, добавляя к ним урон, зависящий от расстояния до цели. Чем она дальше, тем больше урон.",
      "spellName": "Impetus",
      "params": [
        "Дальность применения: 575",
        "Урон от расстояния: 8%\/12%\/16%\/20% (TagTalent 14,5%\/18,5%\/22,5%\/26,5%)"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Несмотря на то что Аюшта преследует мирные цели, она вполне способна нанести магический удар издалека: её копья черпают энергию из окружающей природы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Enchant_slow.mp3\/revision\/latest?cb=20141207171008",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских существ \/ Вражеских героев"
      ],
      "notes": [
        "Применение Enchant на героев (включая клонов и иллюзию Vengeance Aura) или крипов-героев замедляет их и применяет на них базовое развеивание (при этом проигрывая длительный звук).",
        "Применение Enchant на остальных вражеских существ, которые не относятся к вардам или строениям, приручает их (проигрывая короткий звук). Сюда входят остальные иллюзии. При приручении применяет к цели базовое развеивание, которое снимает положительные и отрицательные эффекты. Прирученный крип излечивается. Его мана не восстанавливается.",
        "При приручении применяет к цели базовое развеивание, которое снимает положительные и отрицательные эффекты.",
        "Прирученный крип излечивается. Его мана не восстанавливается.",
        "Нельзя применить к древним крипам, катапультам Necronomicon Warrior и Necronomicon Archer. С выбранным на 20 уровне талантом можно приручать древних крипов, но Рошан и крипы-герои, которые также относятся к древним крипам, лишь замедляются. С талантом на 20 уровне курьера можно выбрать целью для приручения, но способность на него не сработает, потратит ману и уйдет в перезарядку.",
        "С выбранным на 20 уровне талантом можно приручать древних крипов, но Рошан и крипы-герои, которые также относятся к древним крипам, лишь замедляются.",
        "С талантом на 20 уровне курьера можно выбрать целью для приручения, но способность на него не сработает, потратит ману и уйдет в перезарядку.",
        "При приручении нового крипа прирученный ранее умирает.",
        "Если приручение закончило свое действие, существа сразу умирают. Эта смерть никому не зачитывается, поэтому опыт никто не получает."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "W",
      "cooldown": "28\/24\/20\/16",
      "description": "Очаровывает врага, забирая его под свой контроль с увеличенным здоровьем и уроном от атак (если это крип), либо замедляя его передвижение (если это герой).",
      "spellName": "Enchant",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Дальность применения: 700",
        "Замедление передвижения героя: 55%",
        "Длительность замедления: 3,75\/4,5\/5,25\/6",
        "Макс. число крипов: 1",
        "Доп. макс. здоровье крипа: 200\/300\/400\/500",
        "Доп. урон крипа: 10\/30\/50\/70",
        "Доп. броня крипа: 2\/4\/6\/8",
        "Длительность очарования: 30\/60\/90\/120",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Как истинная хранительница леса, Аюшта дружна со всеми в нем — от низших троллей до могучих кентавров."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Nature%27s_Attendants.mp3\/revision\/latest?cb=20141207171117",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Каждую секунду духи выбирают случайное союзное существо для лечения. Способность может лечить до 8 (TagTalent 14) союзников одновременно.",
        "Цели для лечения выбираются совершенно случайно без каких-либо приоритетов. Несколько духов могут случайно выбрать целью для лечения одного и того же суещства. При лечении каждый дух приближается к выбранной цели. Но при выборе таланта на увеличение числа духов визуальный эффект не адаптируется.",
        "При лечении каждый дух приближается к выбранной цели. Но при выборе таланта на увеличение числа духов визуальный эффект не адаптируется.",
        "Но при выборе таланта на увеличение числа духов визуальный эффект не адаптируется.",
        "Способность игнорирует древних крипов и союзников, если у них полный показатель здоровья.",
        "Духи могут лечить неуязвимых существ, но не лечат спрятанных.",
        "Центр площади действия способности закреплена за местоположением Enchantress, а не за местом, где способность была применена.",
        "При смерти Enchantress духи продолжают лечить существ, находящихся недалеко от места её смерти.",
        "Несколько применений Nature's Attendants не складываются. При повторном применении с действующей способностью длительность баффа обновится.",
        "Может лечить до 32 здоровья в секунду. Лечит до 56 здоровья в секунду, если был выбран талант на дополнительное количество светлячков. Лечит до 192\/\/\/ здоровья в секунду, если был выбран талант на дополнительное лечение от светлячков. Лечит до 336\/\/\/ здоровья в секунду, если были выбраны оба таланта.",
        "Лечит до 56 здоровья в секунду, если был выбран талант на дополнительное количество светлячков.",
        "Лечит до 192\/\/\/ здоровья в секунду, если был выбран талант на дополнительное лечение от светлячков.",
        "Лечит до 336\/\/\/ здоровья в секунду, если были выбраны оба таланта.",
        "Может вылечить до 384 здоровья за все время действия способности. Вылечит до 672 здоровья, если выбран талант на дополнительное количество духов. Вылечит до 2304\/\/\/ здоровья, если выбран талант на дополнительное лечение от светлячков. Вылечит до 4032\/\/\/ здоровья, если выбраны оба таланта.",
        "Вылечит до 672 здоровья, если выбран талант на дополнительное количество духов.",
        "Вылечит до 2304\/\/\/ здоровья, если выбран талант на дополнительное лечение от светлячков.",
        "Вылечит до 4032\/\/\/ здоровья, если выбраны оба таланта.",
        "С Aghanim's Shard постоянные светлячки могут вылечить 12\/24\/36\/48 (TagTalent 72\/84\/96\/108) здоровья в секунду или 720\/1440\/2160\/2880 (TagTalent 4320\/5040\/5760\/6480) здоровья в минуту."
      ],
      "mana": "170\/160\/150\/140",
      "hotKey": "E",
      "cooldown": "35",
      "description": "Призывает рой светлячков, которые лечат героя и всех ближайших союзников в течение 12 секунд.",
      "spellName": "Nature's Attendants",
      "params": [
        "Анимация применения: 0,3+0,93",
        "Радиус поиска: 275",
        "Число светлячков: 8 (TagTalent 14)",
        "Лечения в секунду за светлячка: 4\/8\/12\/16 (TagTalent 24\/28\/32\/36)",
        "Длительность: 12",
        "Количество постоянных светлячков: 3",
        "Добавляет 3 светлячков, которые всегда летают возе владельца."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Капризные духи леса очень слабы поодиночке, но стоит им собраться в рой, как их исцеляющая сила многократно возрастает."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Weapons_hero_enchantress_sproink.mp3\/revision\/latest?cb=20191215175958",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "При применении Sproink прерывает произносимые заклинания Enchantress.",
        "Отпрыгивает со скоростью 1250 за секунду.",
        "Всегда перемещает в противоположную сторону от того направления, куда смотрит Enchantress (180°). Не блокирует поворот Enchantress во время прыжка.",
        "Герой может перепрыгивать через непроходимую территорию и над другими существами.",
        "Во время Sproink Enchantress может атаковать, использовать заклинания и предметы.",
        "На середине прыжка, то есть спустя 0,2 секунд, Enchantress выполняет мгновенные атаки, усиленные Impetus текущего уровня на 3 самых дальних противниках в радиусе её атаки + бонус. Ищет противников со всех сторон вокруг Enchantress, то есть позади неё тоже. На эти мгновенные атаки могут сработать любые модификаторы атаки и эффекты, активирующиеся при ударе. Эти атаки могут промахнуться. Атаки не будут выполнены, если герой будет обезоружен или проклят. Также атаки не будут выполнены, если прыжок будет остановлен до его середины, то есть до момента осуществления этих атак. Однако атаки будут осуществлены, если герой будет оглушён или обезмолвлен. В обоих случаях будет применён эффект способности Impetus. Если Impetus не изучена, то атаки не будут выполняться в принципе.",
        "Ищет противников со всех сторон вокруг Enchantress, то есть позади неё тоже.",
        "На эти мгновенные атаки могут сработать любые модификаторы атаки и эффекты, активирующиеся при ударе.",
        "Эти атаки могут промахнуться.",
        "Атаки не будут выполнены, если герой будет обезоружен или проклят.",
        "Также атаки не будут выполнены, если прыжок будет остановлен до его середины, то есть до момента осуществления этих атак.",
        "Однако атаки будут осуществлены, если герой будет оглушён или обезмолвлен. В обоих случаях будет применён эффект способности Impetus.",
        "Если Impetus не изучена, то атаки не будут выполняться в принципе.",
        "Примечания для Impetus полностью применимы."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "5",
      "description": "Герой отскакивает назад, уворачиваясь от летящих в него снарядов, и запускает копья с эффектом Impetus в 3 самых отдалённых врагов в радиусе своей атаки + 200.",
      "spellName": "Sproink",
      "params": [
        "Анимация применения: 0+0",
        "Дальность прыжка: 500",
        "Длительность: 0,4",
        "Дополнительная дальность атаки: 200",
        "Число атак при прыжке: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Вот так прыг да скок."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Untouchable.mp3\/revision\/latest?cb=20160827205958",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Замедление срабатывает при начале атаки по Enchantress независимо от расстояния. При этом не важно, успешно ли прошла атака или нет, замедление все равно сработает.",
        "При этом не важно, успешно ли прошла атака или нет, замедление все равно сработает.",
        "Замедление также действует до тех пор, пока длится анимация завершения атаки. Отмена анимации завершения атаки не отменит замедления и не вернет скорость атаки. При смене цели атаки дебафф сохраняется, но не добавляет замедление к новой атаке по новой цели. Дебафф остается до завершения или отмены атаки по новой цели. То есть можно пропустить замедление, работающее на анимацию завершения атаки, меняя цель атаки в пределах дальности атаки героя перед каждой атакой.",
        "Отмена анимации завершения атаки не отменит замедления и не вернет скорость атаки.",
        "При смене цели атаки дебафф сохраняется, но не добавляет замедление к новой атаке по новой цели.",
        "Дебафф остается до завершения или отмены атаки по новой цели.",
        "То есть можно пропустить замедление, работающее на анимацию завершения атаки, меняя цель атаки в пределах дальности атаки героя перед каждой атакой.",
        "Не действует на варды и строения."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Пленённые красотой героя, противники атакуют его с уменьшенной скоростью.",
      "spellName": "Untouchable",
      "params": [
        "Замедление скорости атаки: 120\/160\/200 (TagTalent 185\/225\/265)",
        "Дарует новую способность: Sproink.",
        "Хоть дебафф продолжает применятся с каждой атакой, но под действием истощения замедление от него не работает."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "После нападения на Аюшту большинство соперников испытывают чувство вины за то, что осмелились поднять руку на такую прекрасную деву."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.7,
    "attrStrength": 17.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.8,
    "attrAgility": 19.0
  },
  "description": "Enchantress — это герой с дальним типом атаки, основным атрибутом которого является интеллект. В ранней игре Enchantress является хорошим героем-лесовиком, а ближе к середине и поздней этапам игры - может стать хорошим Carry-героем, который способен наносить большое количество урона. Пассивная способность Untouchable дает возможность герою замедлять атаки противников, которые ее атакуют. Способность Enchant позволяет очаровывать крипа, захватывая его под свой контроль. Если целью является вражеский герой, то способность замедлит его скорость передвижения. Способностью Nature's Attendants герой вызывает духов-целителей вокруг себя, которые лечат героя и всех ближайших дружественных героев. Главная способность героя - Impetus - усиливает каждую атаку, добавляя к ней урон, зависящий от того, как далеко находится цель. Чем она дальше, тем сильнее урон.",
  "history": "Аюшта кажется невинным и беззаботным лесным существом, и пусть это первое впечатление не обманчиво, оно едва ли раскрывает её натуру. Аюшта прекрасно понимает, отчего страдает природа. Она прошла многими тропами, приветливыми и угрюмыми лесами, бывала во всех краях в любое время года — и всюду искала дружбы, несла вести, смех и исцеление. Иначе никак: где разразилась война, там лес идёт на суда и осадные орудия, а в мирных местах деревья вырубают, чтобы строить дома и топить бесчисленные очаги. Аюшта внимает мольбам беззащитных существ, которые так нуждаются в лиственной тени и зелёном крове. Она прислушивается к тем, до кого никому нет дела, и несёт их истории по всему миру, уверенная в том, что её доброе слово — словно чары, от которых наш мир расцветёт.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+20 к лечению от Nature's Attendants",
      "talentRight": "+6,5% к урону от Impetus"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Enchant действует на древних крипов",
      "talentRight": "+65 к замедлению от Untouchable"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+6 светлячков от Nature's Attendants",
      "talentRight": "+40 к урону"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости передвижения",
      "talentRight": "+12% к сопротивлению магии"
    }
  ]
}