{"abilities":[{"spell":"Rubick uses his telekinetic powers to lift the enemy into the air briefly and then hurls them back at the ground. The unit lands on the ground with such force that it stuns nearby enemies.","effects":["Ability Target Unit","Affects Enemies"],"notes":["The lift duration consists of 0.5\/0.9\/1.3\/1.7 seconds static air time and 0.3 seconds landing time.","The lifted unit is stunned while in the air and is not affected by the area stun upon landing.","While in the air, other units may pass below the lifted unit.","When the lift ends prematurely, the lifted unit instantly lands and applies the area stun.","Destroys trees within 325 radius of the lifted target upon landing.","Cannot lift Roshan, he will be stunned for the lift duration instead."],"mana":"125","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"34\/30\/26\/22 ( 19\/15\/11\/7)","name":"Telekinesis","description":["Cast Animation: 0.1+0.97","Cast Range: 550\/575\/600\/625 ( 675\/700\/725\/750)","Stun Radius: 325","Lift Duration: 0.8\/1.2\/1.6\/2","Stun Duration: 1\/1.25\/1.5\/1.75"],"hot_key":"Q","legacy_key":"Z"},{"spell":"Chooses the location the target will land when Telekinesis finishes.","effects":["Ability Target Area","Affects Enemies"],"notes":["Replaces Telekinesis until the lifted unit lands.","Allows Rubick to determine where the lifted unit will land after the lift duration. Does not prematurely end the lift.","Targeting further than the maximum allowed throw distance will throw the target 375 distance towards the targeted point.","The unit moves towards the targeted point during the last 0.3 seconds of the lift duration, so the speed varies between 0 and 1250 ( 2250), depending on the chosen distance.","Can be cast multiple times during the lift. The unit will land on the last chosen location.","The center of the targeted area is marked with green particles, which are visible to allies only."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Does not pierce spell immunity."],"cooldown":"0","name":"Telekinesis Land","description":["Cast Animation: 0.1+1.07","Cast Range: Global","Max Throw Distance: 375 ( 675)","Stun Radius: 325","Stun Duration: 1\/1.25\/1.5\/1.75"],"hot_key":"Q","legacy_key":"Z"},{"spell":"Rubick creates a powerful stream of arcane energy that travels between enemy units, dealing damage and reducing their attack damage. Each jump deals less damage.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Fade Bolt has no bounce limit. Bounces in 0.25 second intervals. Each bounce decreases the bolt's current damage by 8%.","Does not bounce on invisible units or units in the Fog of War.","Can never hit the same unit twice per cast.","Counts illusions and creep-heroes as heroes.","This is how much damage the first 15 bounces on each level deal (before reductions): Level 1: 80 \/ 73.6 \/ 67.7 \/ 62.3 \/ 57.3 \/ 52.7 \/ 48.5 \/ 44.6 \/ 41.1 \/ 37.8 \/ 34.8 \/ 32 \/ 29.4 \/ 27.1 \/ 24.9 damage, 713.7 total damage, 54 bounces to reach 1 damage Level 2: 160 \/ 147.2 \/ 135.4 \/ 124.6 \/ 114.6 \/ 105.5 \/ 97 \/ 89.3 \/ 82.1 \/ 75.5 \/ 69.5 \/ 63.9 \/ 58.8 \/ 54.1 \/ 49.8 damage, 1427.4 total damage, 62 bounces to reach 1 damage Level 3: 240 \/ 220.8 \/ 203.1 \/ 186.9 \/ 171.9 \/ 158.2 \/ 145.5 \/ 133.9 \/ 123.2 \/ 113.3 \/ 104.3 \/ 95.9 \/ 88.2 \/ 81.2 \/ 74.7 damage, 2141.1 total damage, 67 bounces to reach 1 damage Level 4: 320 \/ 294.4 \/ 270.8 \/ 249.2 \/ 229.2 \/ 210.9 \/ 194 \/ 178.5 \/ 164.2 \/ 151.1 \/ 139 \/ 127.9 \/ 117.7 \/ 108.2 \/ 99.6 damage, 2854.8 total damage, 71 bounces to reach 1 damage","The bolt first applies the damage, then the debuff.","The Fade Bolt buff is a hidden buff required for the lightning to jump."],"mana":"120\/130\/140\/150","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"16\/14\/12\/10 ( 11\/9\/7\/5)","name":"Fade Bolt","description":["Cast Animation: 0.1+0.93","Cast Range: 800 ( 925)","Bounce Distance: 440","Number of Bounces: Infinite","Base Damage: 80\/160\/240\/320","Bounce Damage Reduction: 8%","Hero Attack Damage Reduction: 20\/25\/30\/35 ( 80\/85\/90\/95)","Creep Attack Damage Reduction: 10\/13\/15\/17","Duration: 10"],"hot_key":"W","legacy_key":"X"},{"spell":"Rubick's mastery of the arcane allows him to deal more spell damage and create spells that last longer on enemies.","effects":["Ability Passive","Affects Self"],"notes":["Fully stacks with other sources of spell damage amplification.","The debuff duration amplification only affects the duration of debuffs placed on enemies. A debuff is identified by the red border on the status icon.","Follows the same rules as status resistance."],"mana":"0","elements":["Can be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Arcane Supremacy","description":["Spell Damage Amplification: 14%\/18%\/22%\/26%","Debuff Duration Amplification: 20%\/28%\/36%\/44%"],"hot_key":"E","legacy_key":"N"},{"spell":"Rubick studies the trace magical essence of one enemy hero, learning the secrets of the last spell the hero cast. Rubick can use this spell as his own for several minutes or until he dies.","effects":["Ability Target Unit","Affects Enemy Heroes \/ Self"],"notes":["A full list of unique interactions with Spell Steal can be found here.","The stolen spell travels as a projectile towards Rubick at a speed of 900. Rubick gains the spell (and loses the previous stolen spell) as the projectile reaches him.","Cannot steal passive abilities, item abilities, or active attack modifiers (except for Walrus PUNCH!). Can only steal from heroes (including clones, excluding illusions).","Cannot steal the following spells: Quas, Wex, Exort, Invoke, Assimilate, Mischief, Morph, Walrus Kick, Mortal Strike and Vampiric Aura.","The stolen spell's level is based on its level on the enemy as it was stolen. The level only updates upon stealing it again.","Rubick has a cast time of 0.15, except for the spells listed in here.","Talent bonuses to any spell are not copied.","Cannot have more than 1 stolen spell at a time. Sub-spells from spells are automatically acquired and cannot be manually stolen. Sub-spells are spells which do not do anything on their own. The 3 Shadowrazes or the two Whirling Axes are not sub-spells. This also goes for spells provided by an Aghanim's Scepter (e.g. Eyes In The Forest, Unrefined Fireblast and Nimbus). Rubick's Aghanim's Scepter causes the stolen spell to be upgraded. Since the above-mentioned spells are not upgrades to existing spells, but rather just extra spells granted to the hero, they are treated as their own spells by Spell Steal. This means, for example, Rubick with an Aghanim's Scepter will not get both Fireblasts by stealing one of them, but he can steal Unrefined Fireblast by itself without having the Scepter.","The cooldown of all stolen spells is saved. When re-acquiring a lost spell which was used recently, it will not be instantly ready to use again. Cooldown reseting effects have no effect on the cooldowns of spells Rubick currently does not have.","Using Spell Steal twice in a row on the same spell refreshes the duration and updates the level of the spell. The cooldown of the stolen spell is not affected.","The stolen spell is lost upon death."],"mana":"25","elements":["Cannot be disjointed.","Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"20\/18\/16 ( 2)","name":"Spell Steal","description":["Cast Animation: 0.1+0.93","Cast Range: 1000 ( 1125) ( 1400, 1525)","Stolen Spell Cast Time: 0.15","Spell Duration: 180\/240\/300"],"hot_key":"R","legacy_key":"Q"}],"bio":"Any mage can cast a spell or two, and a few may even study long enough to become a wizard, but only the most talented are allowed to be recognized as a Magus. Yet as with any sorcerer’s circle, a sense of community has never guaranteed competitive courtesy. Already a renowned duelist and scholar of the grander world of sorcery, it had never occurred to Rubick that he might perhaps be Magus material until he was in the midst of his seventh assassination attempt. As he casually tossed the twelfth of a string of would-be killers from a high balcony, it dawned on him how utterly unimaginative the attempts on his life had become. Where once the interruption of a fingersnap or firehand might have put a cheerful spring in his step, it had all become so very predictable. He craved greater competition. Therefore, donning his combat mask, he did what any wizard seeking to ascend the ranks would do: he announced his intention to kill a Magus. Rubick quickly discovered that to threaten one Magus is to threaten them all, and they fell upon him in force. Each antagonist's spell was an unstoppable torrent of energy, and every attack a calculated killing blow. But very soon something occurred that Rubick's foes found unexpected: their arts appeared to turn against them. Inside the magic maelstrom, Rubick chuckled, subtly reading and replicating the powers of one in order to cast it against another, sowing chaos among those who had allied against him. Accusations of betrayal began to fly, and soon the sorcerers turned one upon another without suspecting who was behind their undoing. When the battle finally drew to a close, all were singed and frozen, soaked and cut and pierced. More than one lay dead by an ally’s craft. Rubick stood apart, sore but delighted in the week’s festivities. None had the strength to argue when he presented his petition of assumption to the Hidden Council, and the Insubstantial Eleven agreed as one to grant him the title of Grand Magus.","talentsTips":["The cast range talent does not affect the jump distance of Fade Bolt.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["In both DotA and Dota 2, he is the son of Aghanim. He also possesses an imitation of Aghanim's scepter as one of his cosmetic items.","Upon using Walrus PUNCH!, he would launch a projectile of himself, spinning and with head ahead, towards the target. When his target was Tusk, the overhead text on the target read \"Sucker Punch!\" in green colors. The text read \"Stolen Punch! on other targets.","Rubick is named after Ernő Rubik, the Hungarian inventor who designed the \"Magic Cube\" (now more commonly called as the \"Rubik's Cube\"), a popular combination puzzle. His response, \"Now, where's my cube?\", and his cosmetic item, Staff of Perplex, are also references to the Rubik's Cube.","In DotA, Rubick couldn't steal several spells due to several reasons: Transformation spells caused various issues, so they all could not be stolen. The following abilities are transformation spells and thus unstealable in DotA: Chemical Rage, God's Strength, Elder Dragon Form, Shapeshift, Flesh Golem, Flak Cannon, True Form, Berserker's Rage, Split Shot, Metamorphosis, Spirit Form, Firefly and Arctic Burn Besides transformation spells, several other spells could also not be stolen due to either engine errors or other coding conflicts: Morph, Summon Spirit Bear, Spin Web, Soul Assumption, Refraction, Borrowed Time, Overcharge, Spirits, Insatiable Hunger, Devour, Fire Remnant, Activate Fire Remnant, Rolling Boulder and Tempest Double Since DotA only uses legacy hotkeys, he could not steal any spell which uses the hotkey X, Z and Q. The following abilities could not be stolen due to hotkey conflicts: Abilities with hotkey X: X Marks the Spot, Shadowraze (Medium), Tornado, Exorcism Abilities with hotkey Z: Shadowraze (Near), Alacrity Abilities with hotkey Q: None","Due to Rubick's nature of using spells of other heroes, he has many custom animations for a lot of spells. He has custom animations for all spells of the following heroes, and for the following individual spells: Anti-Mage, Crystal Maiden, Dark Willow, Earthshaker, Lina, Monkey King, Nature's Prophet, Omniknight, Queen of Pain, Shadow Fiend, Sniper, Storm Spirit, Sven, Ursa and Venomancer. Culling Blade, Brain Sap, Fiend's Grip, Firefly, Wild Axes, Primal Roar, Wall of Replica, Black Hole, Blade Fury, Omnislash, Earth Spike, Mana Drain, Finger of Death, Leap, Void, Crippling Fear, Darkness, Shield Crash, Rolling Thunder, Meat Hook, Dismember, Life Drain, Burrowstrike, Charge of Darkness, Nether Strike, Ravage, Tree Grab, Tree Throw, Viper Strike, Shackleshot, Powershot, Windrun, Arctic Burn and Death Ward. All other spells share 2 generic animations and 1 generic channel animation."],"talents":["+50% Spell Amp For Stolen Spells:-15s Telekinesis Cooldown","+300 Telekinesis Land Distance:-5s Fade Bolt Cooldown","-60 Fade Bolt Hero Attack:+125 Cast Range","+60 Damage:+200 Health"],"desc":"Rubick, the Grand Magus, is a ranged intelligence hero best known for his ability to copy the spells of his enemies and use them as his own. Although he is mostly played as a support and is extremely fragile the entire length of the game, he can still prove to be one of the most influential heroes if he utilizes good positioning and well-timed usage of his ultimate, Spell Steal. Spell Steal allows Rubick to cast an enemy hero's most recently used spell, giving him supreme versatility throughout the game. By stealing the right abilities, the Grand Magus can aid himself and allies by casting crippling disables, applying curses, unleashing powerful nukes, disorienting the enemy team, supporting his allies with buffs, escaping from rough situations, or even enhancing his own physical attacks. His other abilities are just as worthy of a Magus: Telekinesis lets Rubick magically lift an enemy into the air, rendering the target helpless and vulnerable, before hurling the lifted enemy to the ground up to a short distance away and stunning nearby foes on impact. Fade Bolt blasts enemies with a stream of arcane energy which bounces to all enemies nearby, dealing damage and reducing their attack damage. Arcane Supremacy is a passive ability, which amplifies the spell damage and debuffs of Rubick's spells, both his and the ones he's stolen. Rubick's versatile ability-set and his infamous Spell Steal make him a flexible and powerful hero that can work in any lineup although he does suffer from long cooldowns and the surfacing predictability of his ultimate."}