{
  "abilities": [
    {
      "spell": "Используя телекинез, Rubick ненадолго поднимает противника в воздух, а затем швыряет его обратно на землю. Этого хватает, чтобы оглушить всех окружающих его врагов.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов"
      ],
      "notes": [
        "Длительность подъема состоит из 0.7\/1.1\/1.5\/1.9 секунд зависания в воздухе и 0,3 секунд приземления.",
        "Поднятый юнит оглушается при нахождении в воздухе и на него не действует оглушение по области при приземлении.",
        "Когда юнит в воздухе, остальные юниты могут под ним проходить.",
        "При досрочном завершении подъема юнит мгновенно приземляется и применяет оглушение по области.",
        "При приземлении поднятый юнит разрушает деревья в радиусе 325 единиц вокруг себя.",
        "Не может поднять Рошана; он будет оглушен на длительность подъема."
      ],
      "mana": "125",
      "elements": [
        "Частично блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "34\/30\/26\/22 ( 19\/15\/11\/7)",
      "name": "Telekinesis",
      "description": [
        "Анимация применения: 0,1+0,97",
        "Дальность применения: 550\/575\/600\/625 ( 675\/700\/725\/750)",
        "Радиус оглушения: 325",
        "Длительность подъема: 1\/1.4\/1.8\/2.2",
        "Длительность оглушения: 1\/1.25\/1.5\/1.75"
      ],
      "hot_key": "Q",
      "legacy_key": "Z"
    },
    {
      "spell": "Устанавливает место, в которое цель приземлится после окончания действия Telekinesis.",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Заменяет Telekinesis до приземления выбранного юнита.",
        "Позволяет выбрать место приземления юнита после завершения длительности подъема. Не прерывает досрочно подъем.",
        "Выбор точки, превышающую максимально доступную дистанцию, приведет к смене точки на находящуюся на расстоянии 375 по направлению к изначально выбранной.",
        "Юнит движется к выбранной точке за последние 0,3 секунды от длительности подъема, поэтому скорость может варьироваться от 0 до 1250 ( 2250) в зависимости от выбранной дистанции.",
        "Можно использовать несколько раз, пока юнит подвешен. Он приземлится на последнюю выбранную точку.",
        "Центр выбранной области отмечен зелеными частицами, которые видны только союзникам."
      ],
      "mana": "0",
      "elements": [
        "Не провоцирует эффекты своим применением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Telekinesis Land",
      "description": [
        "Анимация применения: 0,1+1,07",
        "Дальность применения: Глобальная",
        "Макс. дальность приземления: 375 ( 675)",
        "Радиус оглушения: 325",
        "Длительность оглушения: 1\/1,25\/1,5\/1,75"
      ],
      "hot_key": "Q",
      "legacy_key": "Z"
    },
    {
      "spell": "Rubick создает мощный поток магической энергии, которая перемещается между противниками, нанося им урон и снижая силу их атак. Каждый последующий скачок наносит меньше урона.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Для Fade Bolt нет лимита по скачкам. Скачки происходят с интервалом в 0,25 секунды. Каждый скачок снижает урон скачков на 8%.",
        "Не перескакивает на невидимых юнитов и юнитов в тумане войны.",
        "Не может попасть в того же юнита несколько раз за одно применение.",
        "Считает иллюзий и крипов-героев за героев.",
        "Здесь указано, сколько урона нанесут первые 15 скачков на каждом уровне способности (до учета сопротивления): 1 уровень: 80 \/ 73.6 \/ 67.7 \/ 62.3 \/ 57.3 \/ 52.7 \/ 48.5 \/ 44.6 \/ 41.1 \/ 37.8 \/ 34.8 \/ 32 \/ 29.4 \/ 27.1 \/ 24.9 единиц урона, 713.7 единиц урона в целом, 54 скачка до достижения 1 единицы урона 2 уровень: 160 \/ 147.2 \/ 135.4 \/ 124.6 \/ 114.6 \/ 105.5 \/ 97 \/ 89.3 \/ 82.1 \/ 75.5 \/ 69.5 \/ 63.9 \/ 58.8 \/ 54.1 \/ 49.8 единиц урона, 1427.4 единиц урона в целом, 62 скачка до достижения 1 единицы урона 3 уровень: 240 \/ 220.8 \/ 203.1 \/ 186.9 \/ 171.9 \/ 158.2 \/ 145.5 \/ 133.9 \/ 123.2 \/ 113.3 \/ 104.3 \/ 95.9 \/ 88.2 \/ 81.2 \/ 74.7 единиц урона, 2141.1 единиц урона в целом, 67 скачка до достижения 1 единицы урона 4 уровень: 320 \/ 294.4 \/ 270.8 \/ 249.2 \/ 229.2 \/ 210.9 \/ 194 \/ 178.5 \/ 164.2 \/ 151.1 \/ 139 \/ 127.9 \/ 117.7 \/ 108.2 \/ 99.6 единиц урона, 2854.8 единиц урона в целом, 71 скачка до достижения 1 единицы урона",
        "Fade Bolt сначала наносит урон, затем применяет дебафф.",
        "Бафф \"Fade Bolt\" - скрытый и требуется для подсветки скачков."
      ],
      "mana": "120\/130\/140\/150",
      "elements": [
        "Частично блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "16\/14\/12\/10 ( 11\/9\/7\/5)",
      "name": "Fade Bolt",
      "description": [
        "Анимация применения: 0,1+0,93",
        "Дальность применения: 800 ( 925)",
        "Дистанция отскока: 440",
        "Количество отскоков: Неограниченно",
        "Базовый урон: 80\/160\/240\/320",
        "Снижение урона за скачок: 8%",
        "Снижение урона героев: 20\/25\/30\/35 ( 65\/70\/75\/80)",
        "Снижение урона крипов: 10\/13\/15\/17",
        "Длительность снижения урона: 10"
      ],
      "hot_key": "W",
      "legacy_key": "X"
    },
    {
      "spell": "Знания тайной магии позволяют герою наносить больше урона от способностей, а его заклинания действуют на врага дольше обычного.",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Сочетается с другими источниками усиления урона заклинаний.",
        "Дополнительная длительность дебаффов распространяется только на длительность дебаффов, примененных на врагов. Дебафф очерчивается красной рамкой в иконках состояния.",
        "Следует тем же правилам, что и сопротивление эффектам"
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Не отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Arcane Supremacy",
      "description": [
        "Доп. урон от способностей: 14%\/18%\/22%\/26%",
        "Доп. время действия эффектов: 20%\/28%\/36%\/44%"
      ],
      "hot_key": "E",
      "legacy_key": "N"
    },
    {
      "spell": "Герой улавливает следы магической энергии, обучаясь таинствам последней способности, применённой выбранным противником. Полученная способность находится в распоряжении героя несколько минут либо пока он не погибнет.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Вражеских героев \/ Себя"
      ],
      "notes": [
        "Полный перечень уникальных взаимодействий с Spell Steal можно найти здесь.",
        "Украденное заклинание летит к Rubick в виде снаряда со скоростью в 900 единиц. Rubick получает заклинание (и теряет предыдущее украденное) при попадании в него снаряда.",
        "Невозможно украсть пассивные способности, способности предметов или активные модификаторы атаки (за исключением Walrus PUNCH!). Можно украсть только у героев (включая клонов, но исключая иллюзии).",
        "Невозможно украсть следующие заклинания: Quas, Wex, Exort, Invoke, Assimilate, Morph, Walrus Kick, Mortal Strike и Vampiric Aura.",
        "Уровень украденного заклинания основан на уровне заклинания у врага на момент кражи. Уровень обновляется только при повторной краже.",
        "Время применения Rubick всех украденных заклинаний равно 0,15, за исключением заклинаний, перечисленных здесь.",
        "Бонусы от талантов для заклинаний не копируются.",
        "Не может быть больше 1 украденного заклинания одновременно. Вспомогательные заклинания приобретаются автоматически и не могут быть вручную украдены. Вспомогательными считаются те заклинания, которые не могут ничего сделать без основного. 3 Shadowraze или 2 Whirling Axes не являются вспомогательными. Также это относится к заклинаниям, даваемыми Aghanim's Scepter ( Eyes In The Forest, Unrefined Fireblast и Nimbus). Aghanim's Scepter Rubick позволяет украденным заклинаниям улучшаться. Поскольку вышеупомянутые заклинания не улучшаются, но дают дополнительные герою, то они считаются отдельными для Spell Steal. То есть, к примеру, Rubick с Aghanim's Scepter не получает оба Fireblasts при краже одной из способностей, но может украсть Unrefined Fireblast без наличия у себя Aghanim's Scepter.",
        "Перезарядка для всех украденных заклинаний сохраняется. При повторном получении потерянного заклинания, которое было ранее использовано, оно не будет моментально готово к повторному использованию. Эффекты, сбрасывающие перезарядку, не действуют на заклинания, которых нет у Rubick на момент сброса.",
        "Использование Spell Steal дважды на одно и то же заклинание обновляет длительность и уровень заклинания. Это не влияет на перезарядку заклинания.",
        "Украденное заклинание пропадает при смерти."
      ],
      "mana": "25",
      "elements": [
        "Нельзя избежать.",
        "Блокируется Linken's Sphere.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "20\/18\/16 ( 2)",
      "name": "Spell Steal",
      "description": [
        "Анимация применения: 0,1+0,93",
        "Дальность применения: 1000 ( 1125) ( 1400, 1525)",
        "Время применения украденного заклинания: 0,15",
        "Длительность заклинания: 180\/240\/300"
      ],
      "hot_key": "R",
      "legacy_key": "Q"
    }
  ],
  "bio": "Любому колдуну под силу использовать заклинание или два, а некоторые из них могут даже обучаться достаточно долго, чтобы стать волшебником, но лишь самым талантливым дозволено носить титул мага. Впрочем, как и в любом другом кругу колдунов, ощущение сплоченности никогда не гарантировало гладкого соперничества. Уже известный в высшем колдовском кругу как дуэлянт и ученый, Rubick никогда и не думал, что у него есть задатки мага. До тех пор, пока его не попытались убить в седьмой раз. Со вздохом выкинув двенадцатого из так называемых убийц со своего балкона, он осознал, насколько безнадежно неинтересны стали покушения на его жизнь. Раньше внезапный щелчок пальца или воспламеняющийся на чьей-то руке огонь заставляли его радостно пружинить при ходьбе, но теперь все стало страшно предсказуемо. Ему хотелось более серьезной борьбы. Итак, надев свою боевую маску, он сделал то, что сделал бы любой волшебник, желающий продвинуться в сообществе: он объявил о своих намерениях убить мага. Вскоре Rubick осознал, что напав на одного мага, он напал на них всех, и те обрушились на него всеми силами. Каждое заклинание любого из его противников было неостановимым потоком энергии, всякая атака - рассчитанным на убийство ударом. Но очень скоро случилось то, чего враги Рубика не ожидали: их мастерство обратилось против них. Внутри урагана магии Рубик хохотал, незаметно читая и копируя способности одного, чтобы использовать их против другого, создавая хаос в ряду тех, кто объединился против него. Посыпались обвинения в предательстве, и вскоре колдуны обратились друг против друга, даже не подозревая, кто привел их к такой гибели. Когда битва наконец утихла, все вокруг было обуглено и заморожено, изрезано, облито и порвано. Лишь Рубик выделялся из беспорядка, слегка побитый, но восхищенный случившемуся на этой неделе торжеству. Ни у кого не нашлось мощи возразить ему, когда он подал заявку на принятие в Скрытый Совет, и Одиннадцать Иллюзорных как один согласились вручить ему титул Великого мага.",
  "talentsTips": [
    "Талант на дальность применения не влияет на дистанцию отскоков Fade Bolt.",
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
  ],
  "trivia": [
    "Rubick и Invoker учились в одной школе магии, и Rubick называл его \"Arsenal Magus\".",
    "У Rubick время применения любой способности является мгновенным. Таким образом, своровав способность у героев, имеющие задержку, Rubick применит его без задержки (мгновенно). Такими способностями являются Ice Path ( Jakiro - 0.4 секунды), Exorcism ( Death Prophet) и прочие. Однако, есть способности, которые имеют отдельную задержку, не зависящую от задержки самого героя. К примеру: Epicenter ( Sand King), Echo Stomp ( Elder Titan) и т.д.",
    "Фраза Играть \"Now, where's my cube?\" (Рус. Так, где же мой куб) и Косметический предмет Staff of Perplex являются ссылками на Кубик Рубика, популярный пазл-головоломку.",
    "Как в DotA, так и в Dota 2 Rubick является сыном Aghanim`а."
  ],
  "talents": [
    "+50% к урону от украденных способностей:-15 сек. к перезарядке Telekinesis",
    "+300 к дальности броска Telekinesis:-5 сек. перезарядки Fade Bolt",
    "-45 к снижению урона героев от Fade Bolt:+125 к дальности способностей",
    "+60 к урону:+200 к здоровью"
  ],
  "tips": [
    "Telekinesis: Оглушение близлежащих юнитов от способности происходит лишь при приземлении (не оглушает юнитов с иммунитетом к магии). Также это заклинание не оглушает поднятого юнита. Уничтожает деревья в небольшой области от точки приземления юнита. Только Rubick и его союзники могут видеть точку приземления поднятого юнита. С помощью данной способности можно несколько раз изменить место приземления юнита, пока он поднят.",
    "Spell Steal: Если вы украдёте Plague Ward, ваш герой будет накладывать Poison Sting того уровня, которого была способность у Venomancer на момент кражи. То же применяется к самим Plague Ward. Старайтесь все время следить за последней использованной врагом способностью, чтобы копировать только необходимое и наиболее полезное. Лучшим вариантом будет мощный ультимейт. Например, Black Hole, или же Chaotic Offering. Главное - это внимание и хорошее знание противника. Урон от Requiem of Souls будет таким, каким было количество душ у Shadow Fiend на момент копирования. При краже Shadowraze Rubick украдёт только одну способность вместо трёх (последнюю использованную). Подвергшись нападению Anti-Mage, скорее всего, последнее использованное им заклинание, чтобы подобраться к вам, будет Blink. Таким образом, можно быстро скопировать у него эту способность и также быстро отступить в безопасное место. Rubick теряет украденную способность, если время его использования закончится, если Rubick умрет или украдет другую способность. Способности предметов, пассивные способности и способности крипов нельзя украсть, но Rubick может украсть способности крипов, которые использовал Doom. Нельзя украсть Quas, Wex, Exort, Invoke и способности автоатаки, такие как Frost Arrows, Arcane Orb, Searing Arrows, Poison Attack, Burning Spear и Liquid Fire. Однако, можно красть переключаемые способности, такие как Rot и т.п. Если у врага есть Aghanim's Scepter, а у Rubick нет, то вражеский ультимэйт возможно украсть только не улучшенным. Если использовать True Form во время, когда произносится Spell Steal для кражи другого заклинания, то Rubick останется в форме медведя, даже если умрёт или будет использовать другие украденные заклинания. Вернуться в прежнюю форму можно, снова украв и использовав True Form. Эффект от использования Attribute Shift (Сила) и Attribute Shift (Ловкость) останется, даже если Rubick украдёт другое заклинание или умрёт. В пользовательском интерфейсе есть место для второй способности украденного заклинания. Вы можете воспользоваться ею, если украдёте Illusory Orb, Shadow Poison, Haunt и т.п. Использование Darkness уменьшит радиус обзора врагов, вражеских крипов, башен и вардов на 25% и Rubick получит бонусы от пассивной способности Hunter in the Night текущего уровня. Так же как и Night Stalker, Rubick получит неограниченный обзор в размере 1800 единиц, если в инвентаре будет Aghanim's Scepter на момент кражи. Способность полезно использовать после смерти Night Stalker."
  ],
  "desc": "Rubick — Великий Маг, герой с дальним типом атаки, основной характеристикой которого является интеллект. Свою известность приобрел благодаря своей специфической особой способности, которой ворует последнее использованное заклинание вражеского героя. Это дает ему возможность быть очень разноплановым героем. Так, украв Purification или Shallow Grave, Rubick может исполнять роль поддержки. А будучи вооруженным Sun Strike, или Chaos Meteor, может наносить огромный урон. Так же, Rubick может поднимать врага в воздух, благодаря своему Telekinesis. По приземлению, враг так же оглушает ближайших вражеских юнитов. Второе умение Fade Bolt - мощный поток энергии, прыгающих от врага к врагу и наносящий на ранних стадиях игры большой урон. Далее более полезен своим свойством снижения урона у противников. Помимо всего, Rubick обладает и пассивным навыком - Arcane Supremacy. Это умение повышает магический урон Rubick, а также увеличивает длительность его заклинаний, действующих на противников. Таким образом, он является очень многогранным героем, который может исполнять в команде как роль поддержки, так и роль Damage Dealer."
}