{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Hand_of_Midas_Transmute.mp3\/revision\/latest?cb=20191227195428",
      "effects": [
        "Дальность применения: 600",
        "Дополнительное золото: 160",
        "Множитель дополнительного опыта: 2,1"
      ],
      "notes": [
        "При использовании, мгновенно убивает выбранное существо и даёт владельцу 160 и 2,1 * награду в опыте за цель.",
        "Обычные награды в этом случае не даются. Это значит, что ни один герой поблизости не получит за смерть существа ни стандартного золота, ни опыта. Даётся ненадёжное золото.",
        "Даётся ненадёжное золото.",
        "Вопреки визуальным эффектам золото и опыт даются мгновенно.",
        "Для убийства наносит урон, равный текущему здоровью цели. Этот урон игнорирует любые виды уменьшений или усилений. Это значит, что урон активирует большинство эффектов, реагирующих на урон, таких как провокация крипов.",
        "Это значит, что урон активирует большинство эффектов, реагирующих на урон, таких как провокация крипов.",
        "Нельзя применить на варды, постройки, древних крипов и воинов Некрономикона."
      ],
      "mana": "0",
      "abilityName": "Transmute",
      "cooldown": "90",
      "description": "Убивает выбранную цель (но не героя), давая за неё 160 золота и в 2,1 раза больше опыта. Не действует на древних крипов.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Transmute целиком заменяет награду в золоте за существо, так что стандартная награда за существо не даётся. Это значит, что эффективно она даёт 160 - НаградаЗаСуществоЗолотом. Из-за этой особенности, при использовании на больших существ, герой теряет почти половину от награды за существо в золоте, но получает вдвое больше опыта.",
    "Для большей информации, смотрите сюда."
  ],
  "cost": "2200",
  "lore": null,
  "consistFrom": [
    "Gloves of Haste",
    "Recipe"
  ],
  "name": "Hand of Midas",
  "description": "Эта перчатка, сохранившаяся благодаря неведомой магии, служит жадности владельца, наполняя его карманы золотом в обмен на жизни животных.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}