{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Tumbler%27s_Toy_Vault.mp3\/revision\/latest?cb=20210829215114",
      "effects": [
        "Leap Distance: 300",
        "Damage Duration: 3"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Leaps at a speed of 1300 for up to 0.23 seconds.",
        "Always leaps towards the direction the user is facing. Locks the user's facing angle during the leap.",
        "Can leap over other units and over impassable terrain.",
        "During Leap, the user can attack, use items and cast abilities, except recasting Vault. However, they cannot turn, so targeted abilities and items may only be used in the direction they are facing.",
        "However, they cannot turn, so targeted abilities and items may only be used in the direction they are facing.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan puts Tumbler's Toy on a 3-second cooldown. The damage cooldown always triggers, even if the item is e.g. dropped on the ground or not dropped by a neutral creep yet. Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm. However, this cooldown is not affected by percentage-based cooldown reductions. Does not get disabled by damage flagged as HP Removal.",
        "The damage cooldown always triggers, even if the item is e.g. dropped on the ground or not dropped by a neutral creep yet.",
        "Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm.",
        "However, this cooldown is not affected by percentage-based cooldown reductions.",
        "Does not get disabled by damage flagged as HP Removal."
      ],
      "mana": "0",
      "abilityName": "Vault",
      "cooldown": "15",
      "description": "Propels your hero forward 300 units. Tumbler's Toy gets disabled for 3 seconds if its owner receives damage from a player source.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Tumbler's Toy",
  "description": "An antique plaything found in the ruins of an Ozenja circus bazaar.",
  "trivia": [
    "This item's internal name is \"Pogo Stick\"."
  ],
  "upgradeIn": null,
  "tips": null
}