{"abilities":[{"effects":["Cast Range: 600","Movement Speed Slow: 100%","Slow Duration: 0.4","Duration: 6"],"notes":["The projectile travels at a speed of 750.","Applies a basic dispel and mute on the target upon projectile hit.","The slow immediately triggers on the target upon projectile hit as well, so that it gets slowed on hit. When the target already has the Nullify debuff, refreshing it with a new cast does not trigger the slow.","After that, the slow triggers on every successful attack hitting the target. This means missed attacks do not trigger it. The slow does not trigger when the target turns ethereal before attack projectiles hit it.","The slow has no trigger cooldown, so that the target can get slowed for the whole duration if it gets hit by attacks at most every 0.4 seconds.","Can be cast on invulnerable units, applying the dispel and the debuff if the invulnerability can be dispelled. However, if the invulnerability cannot be dispelled, the debuff cannot be applied, but can be refreshed, if already debuffed."],"elements":["Ability Target Unit","Affects Enemies"],"description":"Dispels the target and mutes them for 6 seconds. Anytime the muted target is attacked, it will be slowed by 100% for 0.4 seconds."}],"cost":"4700","description":"A dangerous weapon pilfered from an inverse dimension.","further":["Sacred_Relic","Helm_of_Iron_Will"],"tips":["Use Nullifier on heroes with defensive items like Black King Bar, Eul's Scepter of Divinity, Guardian Greaves, Lotus Orb, Blade Mail and Manta Style.","Use Nullifier on heroes with mobility items Shadow Blade, Blink Dagger, Force Staff and Town Portal Scroll.","Nullify can be dispelled. Beware of enemy heroes with dispels like Oracle or Abaddon.","Combined with Bloodthorn and Silver Edge, one may completely shut down an enemy. Even if they have Linken's Sphere off cooldown, that means they're still cut off from their passive abilities, and either their active abilities or items, depending on which effect was applied."],"attrs":["Active Nullify","Bonus +6 Health regeneration +5 Armor +65 Attack damage","Disassemble? No","Alert allies? No"]}