{"abilities":[{"spell":"Ember Spirit unleashes fiery bolas that wrap around nearby enemies, anchoring them in place and dealing damage each second.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Searing Chains interrupts Ember Spirit's channeling spells upon cast.","Despite the visual effects, the Searing Chains' effects are applied instantly and cannot be disjointed.","The units are selected randomly within its range. There are no priorities.","Roots the targets, preventing them from moving and casting certain mobility spells. Provides True Sight over the targets, but only when the targets were not invisible or within a fade time upon cast.","Does not target invisible units or units inside the Fog of War.","Deals damage in 0.5 second intervals, starting 0.5 second after cast, resulting in 3\/4\/5\/6 ( 5\/6\/7\/8) damage instances.","Can deal up to 75\/150\/225\/300 ( 125\/225\/315\/400) damage to each unit."],"mana":"110","elements":["Does not pierce spell immunity."],"cooldown":"14\/12\/10\/8","name":"Searing Chains","description":["Cast Animation: 0+0.87","Search Radius: 400","Max Targets: 2","Damage per Second: 50\/75\/90\/100","Duration: 1.5\/2\/2.5\/3 ( 2.5\/3\/3.5\/4)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Ember Spirit dashes around with blazing speed, attacking all enemies in the targeted area of effect, then returning to his start location. Deals bonus damage to heroes, and less damage to creeps.","effects":["Ability Target Area","Affects Enemies \/ Self"],"notes":["Ember Spirit is invulnerable during Sleight of Fist. Does not disjoint projectiles upon cast.","During Sleight of Fist, this ability is inactive, so that it cannot be recast until the current cast finishes.","Upon cast, all targets within the area are marked. A flaming sword appears above them as an indicator, which lasts until they get hit.","Sleight of Fist has no range limit. Once a target is marked, it cannot escape Sleight of Fist with distance.","Does not affect invisible or attack immune units. When a marked unit turns invisible or attack immune, it gets fully skipped on its turn.","Fully affects units in the Fog of War. Fogged units get marked on cast, and get hit as well.","Jumps in 0.2 second intervals. The jumps are random between all marked units, there are no priorities.","On each jump, Ember Spirit is positioned 50 range away from his target, on a line between the target and the cast location of Sleight of Fist.","Makes Ember Spirit perform an instant attack on each jump against the targets. This means the hits can proc any attack modifiers or on-hit effects like a regular attack. If Ember Spirit is blinded, the hits can miss, unless he has True Strike. They can also miss to evasion. When Ember Spirit is disarmed, no instant attack is performed on the jump. The instant attacks of Sleight of Fist do not break Smoke of Deceit's invisibility.","During Sleight of Fist, Ember Spirit does not need to turn to cast targeted spells or items.","After all marked targets have been slashed, Ember Spirit returns to the position he had upon casting Sleight of Fist. That position is marked by a remnant for the duration.","Casting Activate Fire Remnant cancels Sleight of Fist. However, other sources of forced movement do not."],"mana":"50","elements":["Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"18\/14\/10\/6 ( 0)","name":"Sleight of Fist","description":["Cast Animation: 0+0.7","Cast Range: 700","Effect Radius: 250\/350\/450\/550","Jump Interval: 0.2","Hero Attack Damage Bonus: 40\/80\/120\/160","Creep Attack Damage Reduction: 50%","Number of Charges: 0 ( 2)","Charge Replenish Time: 0 ( 18\/14\/10\/6)"],"hot_key":"W","legacy_key":"T"},{"spell":"Ember Spirit surrounds himself with a ring of fire that consumes incoming magic damage, leaving him unharmed. Flame Guard deals damage per second in an area around Ember Spirit while Flame Guard is active. If the shield is broken, the damage is also lost.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Magical"],"notes":["Flame Guard interrupts Ember Spirit's channeling spells upon cast.","Deals 6\/8\/10\/12 ( 18\/20\/22\/24) damage in 0.2 seconds intervals, starting 0.2 seconds after cast.","Can deal a total of 240\/480\/800\/1200 ( 720\/1200\/1760\/2400) damage to a single unit (before reductions), assuming a max duration Flame Guard.","Blocks damage before any reductions, except when spell immune, during which it does not block any magical damage.","Recasting Flame Guard refreshes the buff and resets the barrier's absorb capacity.","Does not stack with other magical damage barriers. If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance.","Only blocks magical damage, coming from spells and attacks. Does not block any physical or pure damage."],"mana":"80\/90\/100\/110","elements":["Cannot be used by illusions.","Does not pierce spell immunity."],"cooldown":"35","name":"Flame Guard","description":["Cast Animation: 0+1.07","Damage Radius: 400","Damage per Second: 30\/40\/50\/60 ( 90\/100\/110\/120)","Magical Damage Absorbed: 80\/220\/360\/500 ( 330\/470\/610\/750)","Duration: 8\/12\/16\/20"],"hot_key":"E","legacy_key":"E"},{"spell":"Ember Spirit generates Fire Remnant charges every 38 seconds, with a max of 3 charges. Releasing a charge sends a Fire Remnant that runs to the target location at 2.5x Ember Spirit's speed. Using Activate Fire Remnant, Ember Spirit can dash out to his Remnants, exploding them for area of effect damage. The targeted Remnant will be arrived at last.","effects":["Ability Target Point"],"notes":["Ember Spirit gets all 3 charges immediately upon learning Fire Remnant. Acquiring Aghanim's Scepter the first time instantly grants 2 charges as well. This only happens once, so re-acquiring it does not grant another 2 charges.","Fire Remnants move to their targeted location at a speed of 250% ( 500%) of Ember Spirit's movement speed. The speed is set upon cast and does not adapt.","Since Fire Remnants last for 45 seconds and the replenish time is 38 ( 18) seconds, it is possible to have 4 ( 5) ( 6, 7) remnants up at a time.","Every time a Fire Remnant is placed, Ember Spirit gets a status buff, showing the duration of the remnant. The status buff disappears once the Remnant expires or is used.","Fire Remnants are visible to everyone. They do not grant any vision and thus cannot be seen when sent into the Fog of War.","Fire Remnants deal no damage when they expire."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Fire Remnant","description":["Cast Animation: 0+0.53","Cast Range: 1500 ( 4500)","Remnant Travel Speed: 250% ( 500%)","Remnant Duration: 45","Number of Charges: 3 ( 5)","Charge Replenish Time: 38 ( 18)"],"hot_key":"R","legacy_key":"F"},{"spell":"Select the Fire Remnant to arrive at.","effects":["Ability Target Point","Affects Self \/ Enemies","Damage Magical"],"notes":["Ember Spirit moves to a Fire Remnant with a speed of 1300, or reaches it in 0.4 seconds, whichever is faster.","Ember Spirit is invulnerable while traveling to a Fire Remnant.","The mana cost of Activate Fire Remnant is always the same, regardless of how many remnants he is traveling to with a single cast.","Does not disjoint projectiles that are traveling towards Ember Spirit when he casts this spell.","While traveling, Ember Spirit can attack, cast spells, and use items (but still requires facing his targets).","Forced movement cancels the movement of Activate Fire Remnant and removes its invulnerability. However, the remnants still get used up and Ember Spirit gets instantly moved to the last one's location once it explodes.","Always travels to the Fire Remnant furthest away from the targeted point first.","Ember Spirit damages enemies within a 225 radius around him as he travels, and in a 450 radius around a remnant upon reaching it. Enemies may only be damaged once per remnant, either by Ember Spirit as he travels towards the remnant, or by him upon reaching the remnant.","Destroys trees within 200 radius around Ember Spirit while traveling to a remnant. Though at high speeds, some trees may be skipped."],"mana":"150 ( 25)","elements":["Cannot be cast while rooted or leashed.","Does not pierce spell immunity."],"cooldown":"0","name":"Activate Fire Remnant","description":["Cast Animation: 0+1.07","Cast Range: Global","Remnant Damage Radius: 450","Remnant Damage: 100\/200\/300"],"hot_key":"D","legacy_key":"R"}],"bio":"Lost within the Wailing Mountains, the Fortress of Flares lay abandoned, its training halls empty, its courtyard covered in leaves and dust. Upon a dais in its sealed temple rests a topaz cauldron filled with ancient ash, remnants of a pyre for the warrior-poet Xin. For three generations, Xin taught his acolytes the Bonds of the Guardian Flame, a series of mantras to train the mind and body for the harsh realities beyond the fortress walls. However, in teaching a warrior's way he earned a warrior's rivals, and in his autumn Xin was bested and slain. His followers spread to the wind. Yet as years turned to centuries and followers to descendants, his teachings endured by subtle whisper and deed. Touched by the teacher's lasting legacy, the Burning Celestial, inquisitive aspect of fire, cast himself to the Fortress of Flares and reignited the pyre ash. From these glowing embers emerged an image of Xin, wreathed in flame, his thoughtful countenance prepared to train and to teach, and to spread the fires of knowledge to all who seek guidance.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Ember Spirit, like Brewmaster, Earth Spirit, and Storm Spirit, was a Pandaren in DotA. However, he was re-skinned to avoid copyright issues with Blizzard Entertainment, since Pandaren are a race of creatures in the Warcraft Universe.","The hat on Ember Spirit's back was originally intended to be worn on his head. This model and positioning can still be seen when using Ember Spirit's Hat, a cosmetic item that was made available via drops when Ember Spirit was released.","Most of Ember Spirit's responses are exactly four words long, a reference to four-character Chinese idioms known as chengyu. According to Xin himself: \"Four words is plenty.\""],"talents":["-20 Remnant Charge Restore Time:2 Sleight of Fist Charges","True Strike:+10% Spell Amplification","+1s Searing Chains:+60 Flame Guard DPS","+250 Flame Guard Absorption:+25 Damage"],"desc":"Xin, the Ember Spirit, is a highly mobile and versatile melee agility hero whose abilities make him a slippery foe who can dance around his enemies at will. His skill set allows for aggressive assaults on other heroes, as he can engage on them from long range using Sleight of Fist and tie them down with Searing Chains. His Flame Guard ability deals damage in a small area around him while shielding him from magic nukes, making him a force to be reckoned with by enemy casters. Finally, his Fire Remnant spell enables him to engage, escape, or move instantaneously around the map, allowing him to appear where the enemy least expects and disappear just as quickly."}