{"abilities":[{"spell":"Ember Spirit выпускает горящие бола, которые удерживают врагов на месте и наносят ежесекундный урон.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Searing Chains прерывает произносимые способности Ember Spirit.","Несмотря на визуальные эффекты, эффект от Searing Chains применяется мгновенно и его нельзя избежать.","Способность применяется на случайных юнитов рядом с Зином, для неё нет приоритетных целей.","Применяет оцепенение к целям, предотвращая их передвижение и использование способностей для перемещения. Дает эффект True Sight на цели. Не дает обзор, если способность была применена в момент ухода в невидимость у способностей, дающих невидимость.","При использовании отдает команду \"стоп\" целям, поэтому их текущие приказы на движение, атаку и использование заклинаний отменяются.","Не действует на невидимых юнитов или юнитов в тумане войны.","Наносит урон с интервалом в 0,5 секунды спустя 0,5 секунды после применения, нанося урон 3\/4\/5\/6 ( 5\/6\/7\/8) раз.","Может нанести до 150\/300\/450\/600 ( 250\/450\/630\/800) единиц урона каждому юниту (до учета сопротивления)."],"mana":"110","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/12\/10\/8","name":"Searing Chains","description":["Анимация применения: 0+0,87","Радиус: 400","Максимум целей: 2","Урон в секунду: 50\/75\/90\/100","Длительность: 1.5\/2\/2.5\/3 ( 2.5\/3\/3.5\/4)"],"hot_key":"Q","legacy_key":"C"},{"spell":"Ember Spirit стремительно атакует всех врагов в указанной области, затем возвращается к его исходному местонахождению. Крипам наносится только часть дополнительного урона.","effects":["Способность Направленная на область","Действует на Врагов \/ Себя"],"notes":["Ember Spirit неуязвим, пока действует Sleight of Fist. Способность не позволяет избегать снаряды.","Пока действует Sleight of Fist, способность неактивна, поэтому её нельзя повторно использовать до завершения предущего применения.","При использовании все цели в области помечаются. Над ними появляется горящий меч в виде индикатора, который остается до того момента, пока они не получат удар.","Для Sleight of Fist нет лимита по дальности. Получив отметку, цель не может избежать Sleight of Fist, увеличив дистанцию.","Не действует на невидимых юнитов. Когда отмеченный юнит становится невидимым, способность его пропускает, если он к моменту использования уже невидим.","Полностью работает на юнитов в тумане войны. Они также получают отметку и урон.","Скачки происходят с интервалом в 0,2 секунды. Они происходят в случайном порядке между всеми отмеченными юнитами без какого-либо приоритета.","С каждым скачком Ember Spirit находится в 50 единицах от его цели на линии между ней и местом применения Sleight of Fist.","С каждым прыжком Ember Spirit совершает мгновенную атаку по целям. То есть на удары (как и на обычные атаки) может сработать любой модификатор атаки или эффект, срабатывающий при ударе. Если Ember Spirit ослеплен, то удары могут промахнутся, кроме случая, когда у него есть эффект точности. Также удары могут промахнутся из-за уклонения. Если Ember Spirit обезоружен, при скачках мгновенные атаки совершаться не будут.","Пока действует Sleight of Fist, Ember Spirit не нужно разворачиваться, чтобы применить направленную способность или предмет.","После совершения ударов по всем отмеченным целям, Ember Spirit возвращается к месту, где он использовал Sleight of Fist. Это место отмечается духом на всё время действия.","Использование Activate Fire Remnant отменяет Sleight of Fist. Остальные источники принудительного движения этого не делают."],"mana":"50","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"18\/14\/10\/6 ( 0)","name":"Sleight of Fist","description":["Анимация применения: 0+0,7","Дальность применения: 700","Радиус: 250\/350\/450\/550","Интервал между прыжками: 0,2","Доп. урон по героям: 40\/80\/120\/160","Урон по крипам: 50%","Количество зарядов: 0 ( 2)","Время восстановления зарядов: 0 ( 18\/14\/10\/6)"],"hot_key":"W","legacy_key":"T"},{"spell":"Окружает героя огненным щитом, который полностью поглощает магический урон и наносит периодический урон всем противникам вокруг. Если щит разбить, то защита и урон по площади пропадут.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["При использовании Flame Guard прерывает произносимые способности Ember Spirit.","Наносит 6\/8\/10\/12 ( 18\/20\/22\/24) единиц урона с интервалом в 0,2 секунды спустя 0,2 секунды после применения.","Может нанести до 240\/480\/800\/1200 ( 720\/1200\/1760\/2400) единиц урона одному юниту (до учета сопротивления), учитывая максимальную длительность Flame Guard.","Блокирует урон (до учета любых сопротивлений), кроме момента, когда действует иммунитет к заклинаниям, когда способность не блокирует никакой магический урон.","Повторное использование Flame Guard обновляет бафф и сбрасывает впитанный барьером урон.","Не сочетается с другими источниками магического барьера. Если на юнита действует несколько источников барьера, они все впитывают одинаковое количество урона одновременно.","Блокирует только магический урон, исходящий от способностей и атак. Не блокирует любой физический или чистый урон."],"mana":"80\/90\/100\/110","elements":["Не может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"35","name":"Flame Guard","description":["Анимация применения: 0+1,07","Радиус: 400","Урон в секунду: 30\/40\/50\/60 ( 90\/100\/110\/120)","Поглощение маг. урона: 80\/220\/360\/500 ( 330\/470\/610\/750)","Длительность: 8\/12\/16\/20"],"hot_key":"E","legacy_key":"E"},{"spell":"Герой создает свою огненную копию, которая бежит к указанному месту со скоростью в 2,5 раза большей скорости героя. На это расходуется один из 3 зарядов способности, которые восстанавливаются по 38 секунд. Используя способность Activate Fire Remnant, герой может быстро переместиться по всем копиям, отчего они взорвутся и нанесут урон противникам. Выбранная копия будет конечной целью полёта.","effects":["Способность Направленная на точку"],"notes":["При изучении Fire Remnant Ember Spirit сразу получает все 45 заряда. При первом получении Aghanim's Scepter у героя сразу активны 2 заряда. Повторное получение предмета зарядов не дает.","Копии движутся к выбранной области с увеличенной на 250% ( 500%) скоростью передвижения Ember Spirit. Скорость фиксируется при использовании и не адаптируется.","Поскольку копия Fire Remnants существует 45 секунд, а время восстановления заряда составляет 38 ( 18), то одновременно можно установить 4 ( 5) ( 6, 7) копии.","Каждый раз, устанавливая копию Fire Remnant, Ember Spirit получает значок баффа, отображающий время жизни копии. Значок баффа исчезает при истечении действия копии или при её использовании.","Fire Remnants видны всем. Они не дают обзора и с их помощью нельзя разведать, что находится в тумане войны.","При истечении времени жизни Fire Remnants не наносят урона."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Fire Remnant","description":["Анимация применения: 0+0,53","Дальность применения: 1500 ( 4500)","Скорость копии: 250% ( 500%)","Длительность копии: 45","Число зарядов: 3 ( 5)","Время восстановления заряда: 38 ( 18)"],"hot_key":"R","legacy_key":"F"},{"spell":"Выбрать, к какому Fire Remnant переместиться.","effects":["Способность Направленная на точку","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Ember Spirit перемещается к Fire Remnant со скоростью в 1300 единиц или за 0,4 секунды, в зависимости от того, что произойдет быстрее.","В момент полета к Fire Remnant Ember Spirit неуязвим.","Расход маны для активации способности всегда одинаков, независимо от того, на какое количество копий герой летит.","Fire Remnant не позволяет избегать снаряды, которые летят в героя, когда он использует способность.","Во время применения способности Ember Spirit может атаковать, использовать способности и предметы (но герой все равно должен смотреть в сторону цели).","Принудительное движение отменяет движение от Activate Fire Remnant и убирает неуязвимость. При этом копии остаются использованными и Ember Spirit мгновенно перемещается к месту расположения последнего, когда он врывается.","Всегда сначала перемещается к самому дальнему Fire Remnant от выбранной точки.","Ember Spirit наносит урон врагам в радиусе 225 при движении и в радиусе 450 при достижении копии. Враги получают урон только один раз за копию: либо в момент движения, либо при достижении копии Ember Spirit.","Уничтожает деревья в радиусе 200 единиц вокруг Ember Spirit при перемещении к копии. Поскольку герой летит с высокой скоростью, часть деревьев может быть пропущена."],"mana":"150 ( 25)","elements":["Нельзя применять в оцепенении.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Activate Fire Remnant","description":["Анимация применения: 0+1,07","Дальность применения: Глобальная","Радиус урона копии: 450","Урон: 100\/200\/300"],"hot_key":"D","legacy_key":"R"}],"bio":"Крепость Непослушного пламени затеряна среди Скулящих гор, пусты её учебные залы, листвой и пылью застелены её дворы. На помосте в запечатанном храме стоит топазовый котёл, наполненный древним пеплом погребального костра воина-поэта Сина. Три поколения он обучал своих последователей технике Оков хранящего пламени — набору мантр для тренировки ума и тела, подготавливая их к суровой жизни за крепостной стеной. Преподавая путь воина, Син нажил себе воинов-врагов, и когда наступила осень его жизни, противники превзошли и убили его. Верные последователи разлетелись по миру, словно пепел. Года сменялись веками, последователи — потомками, но его учение передавалось тихим шёпотом из уст в уста. Тронутый многолетним наследием учителя, Горящий небожитель — пытливое проявление огня — бросился в крепость, и вновь воспламенил останки. Из раскалённых углей появился образ охваченного пламенем Сина. Он вновь готов невозмутимо обучать своей мудрости, и вновь готов дарить огонь познания всем, кто ищет наставления.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Ember Spirit, также как и Brewmaster, Storm Spirit и Earth Spirit, были пандаренами в DotA. Они были переделаны, дабы избежать конфликта за авторские права с Blizzard, так как Пандарены являются расой в мире Warcraft.","Большинство реплик Ember Spirit состоят только из 4 слов. Зин говорит о себе: \"Four words is plenty.\"."],"talents":["-20 сек. восстановления заряда Fire Remnant:2 заряда Sleight of Fist","Атаки без промахов:+10% к урону от способностей","+1 сек. действия Searing Chains:+60 к урону в секунду от Flame Guard","+250 к поглощению урона от Flame Guard:+25 к урону"],"desc":"Ember Spirit — это герой с ближним типом атаки, основная характеристика которого является ловкость. Его первая способность, Searing Chains, выпускает горящие болы, которые удерживают врагов на месте и наносят ежесекундный урон. Вторая способность, Sleight of Fist, стремительно атакует всех врагов в указанной области, затем возвращается к его исходному местонахождению. Третья способность, Flame Guard, окружает Ember Spirit огненным щитом, который поглощает магический урон. Когда способность активна, она наносит периодический урон по площади вокруг Ember Spirit. Ультимативной способностью, Fire Remnant, герой создает свою огненную копию, которая бежит к указанному месту. Используя Activate Fire Remnant, Ember Spirit может быстро переместиться по всем копиям, взрывая их и нанося урон по площади."}