{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Fallen_Sky_Fallen_Sky_1.mp3\/revision\/latest?cb=20191227195658",
      "effects": [
        "Ability Target Area",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Disjoints projectiles and teleports the caster upon cast.",
        "The meteor takes 0.5 seconds to land. During this period, the caster is invulnerable and hidden.",
        "Upon landing, all enemies within the area, including buildings but excluding wards, get damaged, stunned and receive a damaging debuff.",
        "The meteor first applies the debuffs, then the impact damage.",
        "Deals damage in 1 second intervals, starting 1 second after the debuff is placed, resulting in 7 total instances, including the impact damage.",
        "Can deal a total of 690 damage to units and 375 to buildings (before reductions).",
        "Multiple casts on the same targets do not stack, but refresh the duration instead. Stacks with the debuff of Meteor Hammer.",
        "Stacks with the debuff of Meteor Hammer.",
        "Destroys trees within the radius upon impact.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan puts Fallen Sky on a 3 second cooldown. Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm. However, this cooldown is not affected by Octarine Core or Arcane Rune. Does not get disabled by damage flagged as HP Removal.",
        "Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm.",
        "However, this cooldown is not affected by Octarine Core or Arcane Rune.",
        "Does not get disabled by damage flagged as HP Removal.",
        "Does not share cooldowns with Blink Dagger or Meteor Hammer."
      ],
      "mana": null,
      "abilityName": "Fallen Sky",
      "cooldown": "15",
      "description": "Transforms into a meteor that strikes down at the target area after 0.5 seconds in a 315 AoE, stunning enemies for 2 seconds and dealing impact damage. Continues to deal damage every 1 seconds to enemy units and buildings for 6 seconds.",
      "params": [
        "Cast Range: 1600",
        "Impact Radius: 315",
        "Effect Delay: 0.5",
        "Impact Damage (Units): 150",
        "Impact Damage (Buildings): 75",
        "Damage per Second (Units): 90",
        "Damage per Second (Buildings): 50",
        "Burn Duration: 6",
        "Stun Duration: 2",
        "Damage Cooldown: 3"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Fallen Skies are fully sharable."
  ],
  "cost": "N\/A",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Neutral Drop Only",
  "name": "Fallen Sky",
  "description": "One of the few surviving creations of the acolytes of the Wyrmforge.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+20 Strength",
    "+20 Intelligence",
    "+15 Health regeneration",
    "+10 Mana regeneration"
  ],
  "tips": [
    "Fallen Sky is best used as both initiation and escape tool, as it works like a combination of Meteor Hammer and Blink Dagger.",
    "Sometimes it is wise to sell your Blink Dagger to save a slot for an another item once you have obtained Fallen Sky due to its longer cast range and attributes."
  ]
}