{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Linken%27s_Sphere.mp3\/revision\/latest?cb=20141117002607",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Не блокирует способности от союзников.",
        "Не блокирует Ion Shell, Toss и Snowball.",
        "Не блокирует Urn of Shadows, Spirit Vessel, Medallion of Courage и Solar Crest.",
        "Для списка блокируемых заклинаний смотрите Блокировка заклинаний."
      ],
      "mana": null,
      "abilityName": "Spellblock",
      "cooldown": "13",
      "description": "Блокирует одну направленную способность каждые 13 сек.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Transfer_Spellblock.mp3\/revision\/latest?cb=20141119014503",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Владелец предмета не может использовать способность на себя.",
        "Несколько баффов будут работать абсолютно независимо друг от друга. Это значит что возможно применить два эффекта на одного и того же союзного героя, и каждый может заблокировать заклинание. Это также значит что если союзник применит бафф на героя который имеет свой Linken's Sphere, оба заблокирует заклинание. В этом случае бафф союзника сработает первым.",
        "Это значит что возможно применить два эффекта на одного и того же союзного героя, и каждый может заблокировать заклинание.",
        "Это также значит что если союзник применит бафф на героя который имеет свой Linken's Sphere, оба заблокирует заклинание. В этом случае бафф союзника сработает первым.",
        "При передаче баффа Linken's Sphere идет на перезарядку. Во время этого периода, он не будет блокировать заклинания на владельце.",
        "Идет на перезарядку как только бафф заблокирует заклинание на выбранном союзном герое.",
        "Не идет на перезарядку если бафф не заблокировал никакого заклинания и исчез.",
        "Можно применять на крипов-героев."
      ],
      "mana": null,
      "abilityName": "Transfer Spellblock",
      "cooldown": "12",
      "description": "Временно отключает пассивную способность предмета, передавая её выбранному союзнику на 12 сек.",
      "params": [
        "Дальность применения: 700",
        "Длительность эффекта: 12"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 280 здоровья, 8,4 регенерации здоровья, 2,33 брони, 14 скорости атаки, 168 маны, 5,7 регенерации маны и 14 урона от атаки.",
    "Для героев ловкости, даёт 280 здоровья, 8,4 регенерации здоровья, 2,33 брони, 14 скорости атаки, 168 маны, 5,7 регенерации маны и 14 урона от атаки.",
    "Для героев интеллекта, даёт 280 здоровья, 8,4 регенерации здоровья, 2,33 брони, 14 скорости атаки, 168 маны, 5,7 регенерации маны и 14 урона от атаки."
  ],
  "cost": "4600",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Ultimate Orb",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Linken's Sphere",
  "description": "Эта магическая сфера однажды защитила одного из самых знаменитых героев в истории.",
  "trivia": [
    "Название Linken's Sphere ссылается на Linken, героя World of Warcraft, который в свою очередь назван в честь Link[1] - одного из главных героев серии игр \"The Legend of Zelda\".[2]"
  ],
  "upgradeIn": null,
  "bonuses": [
    "+14 к силе",
    "+14 к ловкости",
    "+14 к интеллекту",
    "+7 к регенерации здоровья",
    "+5 к регенерации маны"
  ],
  "tips": null
}