{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c2\/Manta_Style.mp3\/revision\/latest?cb=20141214202530",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Для героев ближнего боя перезарядка длится 30 секунд, для дальнего боя — 45 секунд.",
        "При применении на игрока действует неуязвимость, исчезновение и иммунитет к заклинаниям во время разделения.",
        "При применении позволяет избегать снаряды.",
        "При использовании применяет к владельцу базовое развеивание.",
        "Во время разделения сбрасывает все текущие приказы на атаку и применение направленных заклинаний.",
        "После разделения заклинатель появляется со своими иллюзиями. Место появления основано на позиции при применении: один из юнитов появляется на месте использования, а остальные — на севере, западе, юге или востоке от этой точки. Расстояние между существами составляет 108, если размер столкновения героя равен 24, и 24 — если размер столкновения равен 8. Поскольку порядок появления всегда одинаков, то заклинатель и иллюзии занимают случайную позицию и смотрят в одну сторону.",
        "Место появления основано на позиции при применении: один из юнитов появляется на месте использования, а остальные — на севере, западе, юге или востоке от этой точки.",
        "Расстояние между существами составляет 108, если размер столкновения героя равен 24, и 24 — если размер столкновения равен 8.",
        "Поскольку порядок появления всегда одинаков, то заклинатель и иллюзии занимают случайную позицию и смотрят в одну сторону.",
        "При применении дает наземный обзор в радиусе 1000 единиц на одну секунду.",
        "Повторное применение заменит иллюзии, находящиеся под контролем заклинателя."
      ],
      "mana": "125",
      "abilityName": "Mirror Image",
      "cooldown": null,
      "description": "Создаёт 2 иллюзии вашего героя, которые существуют 20 сек. Иллюзии ближнего боя наносят 33% урона и получают 350% урона. Иллюзии дальнего боя наносят 28% урона и получают 400% урона. У героев дальнего боя перезаряжается на 15 сек. дольше.",
      "params": [
        "Время разделения: 0,1",
        "Количество иллюзий: 2",
        "Урона наносят иллюзии (ближний бой): 33%",
        "Урона наносят иллюзии (дальний бой): 28%",
        "Урона получают иллюзии (ближний бой): 350%",
        "Урона получают иллюзии (дальний бой): 400%",
        "Длительность иллюзий: 20"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 200 здоровья, 1 регенерации здоровья, 4,33 брони, 38 скорости атаки, 120 маны, 0,5 регенерации маны и 10 урона от атаки.",
    "Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья, 4,33 брони, 38 скорости атаки, 120 маны, 0,5 регенерации маны и 26 урона от атаки.",
    "Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья, 4,33 брони, 38 скорости атаки, 120 маны, 0,5 регенерации маны и 10 урона от атаки.",
    "Дополнительная скорость передвижения от нескольких предметов, основанных на Yasha ( Yasha, Sange and Yasha, Yasha and Kaya, Manta Style, Trident), не складывается."
  ],
  "cost": "4600",
  "lore": null,
  "consistFrom": [
    "Yasha",
    "Ultimate Orb",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Manta Style",
  "description": "Топор, созданный из отражающих материалов, которые вызывает смятение во вражеских рядах.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 к силе",
    "+26 к ловкости",
    "+10 к интеллекту",
    "+8% к скорости передвижения",
    "+12 к скорости атаки"
  ],
  "tips": null
}