{
  "abilities": [
    {
      "notes": [
        "Interrupts Lifestealer's channeling abilities upon cast",
        "Upon cast, Rage first applies the spell immunity, then the basic dispel",
        "During Rage, Lifestealer cannot be affected by <span image=\"items\/ghost_scepter\/full.webp\">[Ghost Scepter]<\/span> Ghost Form\n The buff gets removed immediately"
      ],
      "item_behaviour": [],
      "description": "Launch into a maddened rage, becoming Spell Immune, and gaining increased movement speed.",
      "hot_key": "Q",
      "params": [
        "Cast Animation:  0+0",
        "Move Speed Bonus: 15%\/16%\/17%\/18% ( 27%\/28%\/29%\/30%)",
        "Duration: 3\/4\/5\/6 ( 4.5\/5.5\/6.5\/7.5)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Lifestealer_Rage.mp3\/revision\/latest?cb=20191216015435",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "21\/20\/19\/18",
      "aghanim": null,
      "name": "Rage",
      "cooldown": "75\/100\/125\/150",
      "legacy_key": "R",
      "story": "The madness and brutality of N'aix makes him a vicious and unrelenting foe in combat."
    },
    {
      "notes": [
        "Stacks additively with other sources of lifesteal",
        "Cannot lifesteal off of wards, buildings and allied units",
        "Does not work against  Roshan",
        "The max health as bonus damage is considered as a conditional attack damage bonus\n Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Lifestealer's attack damage\n The attack damage bonus values are considered by lifesteal, critical strike, and cleave, and it can be reduced only by flat reductions (e.g\n damage block)\n Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions"
      ],
      "item_behaviour": [],
      "description": "Lifestealer's attacks deal damage and provide heal for a percentage of his target's max health.",
      "hot_key": "W",
      "params": [
        "Enemy Max Health as Lifesteal: 1.6%\/2.2%\/2.8%\/3.4% ( 2.8%\/3.4%\/4%\/4.6%)",
        "Enemy Max Health as Damage: 0.8%\/1.1%\/1.4%\/1.7%"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies \/ Self",
        "Damage: Physical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Feast",
      "cooldown": null,
      "legacy_key": "F",
      "story": "After escaping from his cell in Devarque, N'aix subsisted on flesh and bones of those unfortunate to cross his path."
    },
    {
      "notes": [
        "Debuff of successive attacks does not stack but refresh the duration"
      ],
      "item_behaviour": [],
      "description": "Passively causes Lifestealer's attacks to significantly slow enemy movement speed for 1.5 seconds. Grants you Attack Speed.",
      "hot_key": "E",
      "params": [
        "Attack Speed Bonus: 25\/40\/55\/70",
        "Move Speed Slow: 10%\/15%\/20%\/25% ( 25%\/30%\/35%\/40%)",
        "Slow Duration: 1.5"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies \/ Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Ghoul Frenzy",
      "cooldown": null,
      "legacy_key": "G",
      "story": null
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Open Wounds spreads to a random unit within 700 radius that do not have the debuff already, prioritizing heroes, once the affected target collectively takes 500 damage (after all reductions)\n Treat creep-heroes as creeps\n Successive casts on the same target neither stack nor allows the debuff to spread, but refreshes its movement speed slow values and duration\n Each Open Wounds debuff can only spread once\n It cannot spread to the same unit again per cast\n The debuff also does not spread while reaching the damage threshold with no valid targets within its search radius",
        "The spreading is not limited to the unit Open Wounds was cast on, the Open Wounds debuffs created via spreading can spread as well",
        "The debuff can spread onto invisible units and units in the Fog of War\n Does not spread to invulnerable units\n Neutral creeps are not aggro'd when the debuff is spread onto them",
        "Casting instant kill sources (e.g\n  Transmute) on a unit affected by Open Wounds heals the caster based on the affected target's current health\n The spread damage threshold condition still applies\n The heal values are considered and stacks additively with other sources of lifesteal",
        "Does not heal from and count the following damage sources to its damage threshold: Damage flagged as HP Removal and\/or self-damage\n Damage damage dealt by buildings, wards, neutral creeps, or the affected target's allies",
        "Applies 7 instances 50%\/50%\/40%\/30%\/20%\/10%\/10% decreasing movement speed slow, decreasing one step per second for its duration",
        "The max health as bonus damage is only applied to attacks done by heroes, including clones, excluding creep-heroes\n The damage is considered as a conditional attack damage bonus\n Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to the hero's attack damage\n The attack damage bonus values are considered by lifesteal, critical strike, and cleave, and it can be reduced only by flat reductions (e.g\n damage block)\n Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions\n The conditional attack damage bonus does not affect  Roshan"
      ],
      "item_behaviour": [],
      "description": "Lifestealer rends an enemy unit, slowing the victim's movement speed and allowing all allies to regain health for a percentage of the damage they deal to that unit. All damage dealt will steal life, including damage from spells. The victim recovers movement speed over the duration. Deals 2% of the target's max health per attack on the target from real heroes. After receiving 500 damage, the Open Wounds fester and spread to a non-infected random enemy within 700 radius.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.4",
        "Cast Range:  800",
        "Spread Search Radius: 700",
        "Spread Damage Threshold: 500",
        "Lifesteal: 50%",
        "Enemy Max Health as Damage: 2%",
        "Max Move Speed Slow: 50%",
        "Slow Duration: 7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Lifestealer_Open_Wounds.mp3\/revision\/latest?cb=20191216015434",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Allies",
        "Damage: Physical"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Open Wounds",
      "cooldown": "75",
      "legacy_key": "W",
      "story": "Fresh wounds and the scent of blood often draw out the scavengers to finish the job."
    },
    {
      "notes": [
        "Applies a basic dispel and disjoints projectiles upon cast\n Unlike a regular basic dispel, Infest also dispels various buffs (e.g\n  Double Damage Rune) on Lifestealer",
        "During Infest, all of Lifestealer's abilities are hidden, while Infest is replaced by the  Consume sub-ability\n Lifestealer is now invulnerable, hidden, and is periodically moved to the host's current position\n This affects the following things: Upon Infest ending in any way, Lifestealer reappears at the host's current location\n Every aura Lifestealer has (e.g\n  Radiance) is bestowed around the host\n Ability effects that interact with heroes' presence (e.g\n  Smoke of Deceit,  Marksmanship) react on the host's presence\n  Relocate forces Lifestealer out of the Infested unit, dealing its area damage\n  Recall get dispeled upon casting Infest",
        "Can fully regenerate Lifestealer's health within 33.33\/25\/20 ( 16.67\/12.5\/10) seconds",
        "The following effects are applied to the Infested unit: Grants current and max health bonuses by the given value\n This counts as setting health\n Does not increase the health of ancient creeps\n If the affected target is a hero, including illusions and creep-heroes, it grants percentage-based movement speed bonus\n If the affected target is a creep, Lifestealer automatically takes control of it, turning it into his unit\n Infest also replenishes its mana and set its base movement speed to EXPR LifestealerCurrentMS × 115%\/120%\/125% ( 130%\/135%\/140%)\n The controlled creep also retains its health bar colors for camouflaging purposes\n It also can be dominated (e.g\n  Holy Persuasion) normally, with its source ability notes fully apply\n The affected unit also receives a hidden modifier, which creates the visual effect above it, visible to allies only",
        "The same target can be affected by multiple sources of Infest\n However, the health increase effect does not stack\n If the target is a creep, only the first Infest cast can control the unit and use the  Consume sub-ability",
        "Infest also has the following cast restrictions on units: Can be cast on and control ancient creeps when on Level 2+\n Can be cast on, but cannot control ally heroes and ally creep-heroes\n Cannot be cast on  Roshan,  Couriers,  Undying Zombies, wards, buildings, enemy heroes and enemy creep-heroes",
        "The ability's cooldown starts upon leaving the Infested unit, not upon cast",
        "SCEPTER NOTES Infest can now be cast on enemy heroes and creep-heroes\n Does not increase the health or movement speed of such targets, but disarms them\n Although having a limited duration on these targets, Lifestealer still may use  Consume to leave the host earlier\n Causes Lifestealer to perform instant attacks on the Infested enemy target in 1.25-second intervals, starting immediately upon cast, resulting in up to 5 attacks\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They do not have True Strike, but completely ignore disarms\n SOULBIND  Infest only affects the primary target"
      ],
      "item_behaviour": [],
      "description": "Lifestealer infests the body of a target unit, becoming undetectable, and healing for a portion of his max hitpoints every second while inside. He can then explode from the host body, dealing damage to nearby enemies. If the infested unit is an enemy creep or a neutral creep, he can take control of the unit's ability to move and attack. Does not work on enemy heroes.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range:  150 ( 500)",
        "Target Max Health Bonus: 400\/800\/1200 ( 460\/920\/1380)",
        "Target Move Speed Bonus: 15%\/20%\/25% ( 30%\/35%\/40%)",
        "Self Max Health as Health Regen Bonus: 3%\/4%\/5% ( 6%\/8%\/10%)",
        "Enemy Hero Attack Interval:  1.25",
        "Enemy Hero Duration:  5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0e\/Lifestealer_Infest.mp3\/revision\/latest?cb=20191216015431",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self ",
        "Damage: "
      ],
      "mana": "100\/75\/50 (TagTalent 20)",
      "aghanim": null,
      "name": "Infest",
      "cooldown": "100\/125\/150",
      "legacy_key": "T",
      "story": "With this infestation, N'aix consumes the life blood of the host, restoring him back to full unholy power."
    },
    {
      "notes": [
        "Replaces  Infest until the sub-ability is used, or until Lifestealer gets out of the host\n If the infested target is a creep, and Lifestealer takes control over it, it also appears in the infested unit's HUD, in the next available ability slot",
        "Consume only instant kill creeps upon cast",
        "Applies the area damage even when the Infested unit dies before Lifestealer consumes it\n The damage is applied instantly and does not have a travel time"
      ],
      "item_behaviour": [],
      "description": "Lifestealer eats the host body from the inside out, exploding from within.",
      "hot_key": "R",
      "params": [
        "Cast Animation:  0+0",
        "Effect Radius: 700",
        "Damage: 150\/275\/400 ( 300\/425\/550)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Lifestealer_Consume.mp3\/revision\/latest?cb=20191216015429",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Consume",
      "cooldown": "0",
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 25.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.6,
    "attrAgility": 19.0
  },
  "description": "Infests other units for mobility and strength. What was once a man is now little more than a husk, its mind long since departed from lifetimes of imprisonment. Or has it? Now on the loose, N'aix appears to be driven by a new purpose, although what precisely that is, none would know. The Lifestealer Feasts on raw flesh, nourishing himself with every attack while inflicting grievous Open Wounds that make escape near impossible. By sheer ferocity, or perhaps a Ghoulish Frenzy, N'aix flies into a Rage, intensifying his assault while defying all wizardry. For a particularly nasty surprise, the Lifestealer Infests an unhappy victim, laying dormant inside its body in wait for the opportunity to Consume its host inside-out in a gory explosion.  Carry Durable Jungler Escape Disabler ★★☆",
  "trivia": [
    "Lifestealer's fun\/alternate name in DotA was Gollum, a significant character in the Lord of the Rings and Hobbit book series. The references to Gollum are kept up in Dota 2: Just like written in Lifestealer's lore, Lifestealer is no longer the former self he was, but rather a possessed body. Gollum has a similar story. Once being a Hobbit, his soul got corrupted by the ring, turning into the Gollum he is now. Both Lifestealer and Gollum sometimes speak from themselves in plural form (\"we\", instead of \"I\"). They also talk to or about a \"master\". His rivalry line towards Tidehunter Link▶️ \"Tidehunter…I love a bit of raw fish now and again.\" refers to Gollum's hate towards stewing - or the preparing in general - of fish. Gollum prefers his fish raw and \"wriggling\".[1]",
    "The references to Gollum are kept up in Dota 2: Just like written in Lifestealer's lore, Lifestealer is no longer the former self he was, but rather a possessed body. Gollum has a similar story. Once being a Hobbit, his soul got corrupted by the ring, turning into the Gollum he is now. Both Lifestealer and Gollum sometimes speak from themselves in plural form (\"we\", instead of \"I\"). They also talk to or about a \"master\". His rivalry line towards Tidehunter Link▶️ \"Tidehunter…I love a bit of raw fish now and again.\" refers to Gollum's hate towards stewing - or the preparing in general - of fish. Gollum prefers his fish raw and \"wriggling\".[1]",
    "Ghoul Frenzy shares the same name with the passive upgrade for the Ghoul units of Warcraft 3, an Undead unit whom Lifestealer was based off of in DotA. Both abilities increase the respective user's attack speed, but the similarities end there since Lifestealer's passive has a slow effect, while the Ghoul's passive grants bonus movement speed.[2]"
  ],
  "history": "In the dungeons of Devarque, a vengeful wizard lay in shackles, plotting his escape. He shared his cell with a gibbering creature known as N'aix, a thief cursed by the Vile Council with longevity, so that its life-sentence for theft and cozening might be as punishing as possible. Over the years, its chains had corroded, along with its sanity; N'aix retained no memory of its former life and no longer dreamt of escape. Seeing a perfect vessel for his plans, the wizard wove a spell of Infestation and cast his life-force into N'aix's body, intending to compel N'aix to sacrifice itself in a frenzy of violence while the mage returned to his body and crept away unnoticed. Instead, the wizard found his mind caught in a vortex of madness so powerful that it swept away his plans and shattered his will. Jarred to consciousness by the sudden infusion of fresh life, N'aix woke from its nightmare of madness and obeyed the disembodied voice that filled its skull, which had only the one thought: To escape. In that moment Lifestealer was born. The creature cast its mind into dungeon guards and soldiers, compelling them to open locks and cut down their companions, opening an unobstructed path to freedom while feeding on their lives. Lifestealer still wears the broken shackles as a warning that none may hold him, but on the inside remains a prisoner. Two minds inhabit the single form--a nameless creature of malevolent cunning, and the Master whose voice he pretends to obey.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+1.2% Feast Lifesteal",
        "talent_left": "+1.5s Rage Duration"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+15% Infest Target Movespeed\/Health",
        "talent_left": "+15% Ghoul Frenzy Slow"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+25 Damage",
        "talent_left": "+325 Health"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+150 Infest Damage",
        "talent_left": "+12% Rage Move Speed"
      }
    ],
    "notes": [
      "The health talent increases maximum health capacity, and keeps the current health percentage.",
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
    ]
  }
}