{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0d\/Storm_Spirit_Static_Remnant_1.mp3\/revision\/latest?cb=20191216024539",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "При применении Static Remnant прерывает произносимые заклинания Storm Spirit.",
        "После создания копии потребуется 1 сек. для срабатывания, чтобы взорваться и нанести урон. Когда время жизни копии истечет, она взорвется и нанесет урон вокруг себя.",
        "Когда время жизни копии истечет, она взорвется и нанесет урон вокруг себя.",
        "Копия может активироваться от невидимых существ и нанести им урон.",
        "Копии отображаются на мини-карте тем же цветом, что и существа Света\/Тьмы, а не цветом игрока.",
        "Копии дают летающий обзор в радиусе 500 единиц там, где они размещены, пока не пропадут или взорвутся."
      ],
      "mana": "3,5 (TagTalent 2,25)",
      "item_behaviour": [],
      "name": "Static Remnant",
      "cooldown": "70\/80\/90\/100",
      "description": "Создаёт свою энергетическую копию, которая существует 12 сек. и взрывается, если поблизости окажется враг.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+1,1",
        "Радиус срабатывания: 235",
        "Радиус урона: 260",
        "Задержка: 1",
        "Урон: 120\/175\/230\/285 ( 370\/425\/480\/535)",
        "Длительность копии: 12"
      ],
      "legacy_key": "R",
      "story": "Самовлюблённость Райдзина Громокега поражает как его самого, так и всех окружающих."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1a\/Storm_Spirit_Electric_Vortex.mp3\/revision\/latest?cb=20191216024545",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя"
      ],
      "notes": [
        "Притягивает существ со скоростью 128,57\/122,22\/118,18\/115,38 (TagTalent 100\/100\/100\/100).",
        "Если на цель воздействует другой источник горизонтального принудительного движения, то способность остановит притягивание и продолжит после завершения действия другого источника. То есть, в отличии от других эффектов принудительного движения, Electric Vortex не прерывается другими эффектами, а лишь приостанавливается.",
        "То есть, в отличии от других эффектов принудительного движения, Electric Vortex не прерывается другими эффектами, а лишь приостанавливается.",
        "Если цель переместилась на расстояние более 1200 единиц от изначального места применения, то связь мгновенно разрывается.",
        "С Aghanim's Scepter Electric Vortex становится ненаправленной способностью с радиусом 475, действующей на всех вражеских существ вокруг Storm Spirit; ей больше нельзя выбрать существо напрямую. Не притягивает невидимых, неуязвимых и спрятанных существ и существ в Тумане войны. Если при использовании в радиусе действия не было врагов, то Overload всё равно сработает.",
        "Не притягивает невидимых, неуязвимых и спрятанных существ и существ в Тумане войны.",
        "Если при использовании в радиусе действия не было врагов, то Overload всё равно сработает.",
        "Несколько применений на одну и ту же цель обновит длительность притягивания и её расстояние, но не расположение конечной точки привязки."
      ],
      "mana": "16",
      "item_behaviour": [],
      "name": "Electric Vortex",
      "cooldown": "60\/70\/80\/90",
      "description": "Создаёт вихрь, затягивающий врага в место, где находится герой.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,77",
        "Дальность применения: 300 ( 0)",
        "Длительность притягивания: 1,4\/1,8\/2,2\/2,6 ( 1,8\/2,2\/2,6\/3)",
        "Дальность притягивания: 180\/220\/260\/300",
        "Радиус: 475"
      ],
      "legacy_key": "E",
      "story": "Неистовая громовая энергичность Райдзина часто втягивает других в напряженную ситуацию."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Storm_Spirit_Overload.mp3\/revision\/latest?cb=20191216024538",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов ",
        "Урон: Магический"
      ],
      "notes": [
        "Использование предметов не активирует Overload.",
        "Дополнительный урон наносится отдельным источником урона и считается за урон от заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Замедление и урон действует на всех вражеских существ вокруг атакуемой цели в определенном радиусе. На основную цель атака сначала применяет дебафф, затем наносит урон. На вторичные атака сначала наносит урон, затем применяет дебафф.",
        "На основную цель атака сначала применяет дебафф, затем наносит урон.",
        "На вторичные атака сначала наносит урон, затем применяет дебафф.",
        "Заряд тратится при успешном попадании в цель. Если атака промахнулась или её избежали, ничего не произойдет.",
        "Каждая атака проверяет наличие баффа у Storm Spirit при успешном попадании в цель. Если бафф есть, заряд срабатывает. То есть, если Storm Spirit получает бафф, пока снаряд летит, то на эту атаку сработает заряд при попадании в цель.",
        "То есть, если Storm Spirit получает бафф, пока снаряд летит, то на эту атаку сработает заряд при попадании в цель.",
        "Атака строений или союзников не расходует заряд, но разрушение вардов его тратит.",
        "С талантом атака с Overload отскакивает к ближайшему вражескому существу на расстоянии 700 от цели. Отскочившая атака движется со скоростью 1100 (основываясь на скорости снаряда заклинателя). Скорость может быть увеличена другими бонусами к скорости полета снаряда. Множитель в 75% действует на значения урона как атаки, так и Overload. При отскоке наносит 30\/45\/60\/75 урона Overload. Отскок — часть заклинания. Он игнорирует уклонение и блокировку урона. Этот урон считается за урон от заклинаний; при этом он игнорирует усиление урона заклинаний и от него не идет вампиризм заклинаний. Урон отскока рассчитывается от урона изначальной атаки и его значение определяется во время начала атаки. То есть на него влияет критический удар и Quell, поскольку они включаются в изначальный расчет урона. Также неважно, сколько фактически урона нанесет атака цели, поскольку это рассчитывается при попадании снаряда. При этом дополнительный урон от других источников (например, срабатывание Javelin) не учитывается, поскольку он наносится после урона атаки.",
        "Отскочившая атака движется со скоростью 1100 (основываясь на скорости снаряда заклинателя). Скорость может быть увеличена другими бонусами к скорости полета снаряда.",
        "Множитель в 75% действует на значения урона как атаки, так и Overload. При отскоке наносит 30\/45\/60\/75 урона Overload.",
        "При отскоке наносит 30\/45\/60\/75 урона Overload.",
        "Отскок — часть заклинания. Он игнорирует уклонение и блокировку урона.",
        "Этот урон считается за урон от заклинаний; при этом он игнорирует усиление урона заклинаний и от него не идет вампиризм заклинаний.",
        "Урон отскока рассчитывается от урона изначальной атаки и его значение определяется во время начала атаки. То есть на него влияет критический удар и Quell, поскольку они включаются в изначальный расчет урона. Также неважно, сколько фактически урона нанесет атака цели, поскольку это рассчитывается при попадании снаряда. При этом дополнительный урон от других источников (например, срабатывание Javelin) не учитывается, поскольку он наносится после урона атаки.",
        "То есть на него влияет критический удар и Quell, поскольку они включаются в изначальный расчет урона.",
        "Также неважно, сколько фактически урона нанесет атака цели, поскольку это рассчитывается при попадании снаряда.",
        "При этом дополнительный урон от других источников (например, срабатывание Javelin) не учитывается, поскольку он наносится после урона атаки.",
        "С Aghanim's Shard Overload становится активной способностью, сохраняющую пассивную часть. При применении прервает произносимые заклинания Storm Spirit. При применении активирует Overload и сочетается с его эффектом. Дает 3 баффа Overload текущего уровня способности союзным героям, включая клонов и крипов-героев, но исключая иллюзии. Бафф не применяется к неуязвимым или спрятанным существам. Значения баффа Overload устанавливаются при применении и не адаптируются при повышении уровня способности. Число зарядов видно в иконке баффа. Повторное применение Overload обновит длительность баффа и число зарядов. Урон Overload от союзников исходит от них, а не от Storm Spirit. Союзные герои не получают талант на отскок атаки с Overload.",
        "При применении прервает произносимые заклинания Storm Spirit.",
        "При применении активирует Overload и сочетается с его эффектом.",
        "Дает 3 баффа Overload текущего уровня способности союзным героям, включая клонов и крипов-героев, но исключая иллюзии. Бафф не применяется к неуязвимым или спрятанным существам.",
        "Бафф не применяется к неуязвимым или спрятанным существам.",
        "Значения баффа Overload устанавливаются при применении и не адаптируются при повышении уровня способности. Число зарядов видно в иконке баффа. Повторное применение Overload обновит длительность баффа и число зарядов.",
        "Число зарядов видно в иконке баффа.",
        "Повторное применение Overload обновит длительность баффа и число зарядов.",
        "Урон Overload от союзников исходит от них, а не от Storm Spirit.",
        "Союзные герои не получают талант на отскок атаки с Overload."
      ],
      "mana": "30",
      "item_behaviour": [],
      "name": "Overload",
      "cooldown": "150",
      "description": "Применение способностей создаёт заряд электричества, который наполняет следующую атаку героя. Она нанесёт урон всем врагам вокруг цели и замедлит их.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 300",
        "Урон: 40\/60\/80\/100",
        "Замедление скорости передвижения: 80%",
        "Замедления скорости атаки: 80",
        "Длительность замедления: 0,6",
        "Число отскоков: 2",
        "Радиус отскока: 700",
        "Урон отскока от атаки: 75%",
        "Радиус: 750",
        "Доп. скорость атаки: 40",
        "Число зарядов: 3",
        "Длительность: 12"
      ],
      "legacy_key": "V",
      "story": "Пуф! Бах! Вжих!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Storm_Spirit_Ball_Lightning.mp3\/revision\/latest?cb=20191216024543",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "При применении Ball Lightning позволяет избегать снаряды.",
        "Storm Spirit неуязвим во время действия Ball Lightning. Он может поворачиваться, использовать заклинания, предметы и атаковать во время Ball Lightning.",
        "Он может поворачиваться, использовать заклинания, предметы и атаковать во время Ball Lightning.",
        "Повторное использование Ball Lightning не даст результата, но будет засчитываться как использование для некоторых способностей (при этом потраченная начальная мана возвращается).",
        "Если во время полета у Storm Spirit закончится мана, он незамедлительно остановится.",
        "Во время полета Ball Lightning разрушает деревья в радиусе 100 единиц вокруг Storm Spirit.",
        "Дает летающий обзор в радиусе 400 единиц вокруг Storm Spirit, пока действует Ball Lightning.",
        "Тратит ману Storm Spirit каждые 100 единиц с интервалом в 0,07\/0,05\/0,04 сек.",
        "Указанная в описании способности стоимость использования показывает начальное значение, рассчитываемое с учетом текущего максимального запаса маны Storm Spirit.",
        "Урон от Ball Lightning действует так же, как и способности, идентичные по механике способности Magnus Shockwave, т.е. Storm Spirit ведет себя как снаряд. То есть урон врагам, находящимся в радиусе применения, наносится мгновенно, но только один раз за применение. В отличии от обычных заклинаний, похожих на Shockwave, урон от Ball Lightning увеличивается от того, насколько далеко снаряд (т.е. сам Storm Spirit) пролетел. Урон увеличивается на 8\/12\/16 за каждые 100 единиц, поэтому первые преодаленные 99 единицы нанесут 0 урона в радиусе действия. То есть, если Storm Spirit передвинется на 99 единиц прямо перед врагом, то не нанесет никакого урона в радиусе 299 единиц от начальной точки (99 единиц расстояния + радиус нанесения урона).",
        "То есть урон врагам, находящимся в радиусе применения, наносится мгновенно, но только один раз за применение.",
        "В отличии от обычных заклинаний, похожих на Shockwave, урон от Ball Lightning увеличивается от того, насколько далеко снаряд (т.е. сам Storm Spirit) пролетел.",
        "Урон увеличивается на 8\/12\/16 за каждые 100 единиц, поэтому первые преодаленные 99 единицы нанесут 0 урона в радиусе действия.",
        "То есть, если Storm Spirit передвинется на 99 единиц прямо перед врагом, то не нанесет никакого урона в радиусе 299 единиц от начальной точки (99 единиц расстояния + радиус нанесения урона).",
        "Ниже указано, сколько урона от Ball Lightning нанесет вокруг себя Storm Spirit в зависимости от дальности полета (до уменьшений): 500 единиц: 40\/60\/80 урона, 80 + 11,25% от максимального запаса маны 1000 единиц: 80\/120\/160 урона, 130 + 14,5% от максимального запаса маны 2500 единиц: 200\/300\/400 урона, 280 + 24,25% от максимального запаса маны 5000 единиц: 400\/600\/800 урона, 530 + 40,5% от максимального запаса маны",
        "500 единиц: 40\/60\/80 урона, 80 + 11,25% от максимального запаса маны",
        "1000 единиц: 80\/120\/160 урона, 130 + 14,5% от максимального запаса маны",
        "",
        "2500 единиц: 200\/300\/400 урона, 280 + 24,25% от максимального запаса маны",
        "5000 единиц: 400\/600\/800 урона, 530 + 40,5% от максимального запаса маны",
        "",
        "При выборе таланта на создание копии в Ball Lightning при полете каждые 550 единиц появляется копия от Static Remnant. Эти копии не расходуют ману и не мешают применению Static Remnant во время полета.",
        "Эти копии не расходуют ману и не мешают применению Static Remnant во время полета."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Ball Lightning",
      "cooldown": "30 + 8% от макс. маны",
      "description": "Герой оборачивается нестабильным электричеством и несётся по полю боя, пока не достигнет своей цели либо не исчерпает запас маны. Заклинание имеет начальную стоимость в 30+8% от общего запаса маны. Затем тратится 0,65%+ от общего запаса маны за каждые 100 единиц передвижения. Урон выражен в количестве урона за 100 единиц передвижения.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: Глобальная",
        "Радиус урона: 200",
        "Скорость: 1400\/1850\/2300",
        "Урон за 100 единиц: 8\/12\/16",
        "Начальное кол-во маны за 100 единиц: 10",
        "Макс. кол-во маны за 100 единиц: 0,65%",
        "Расстояние между Static Remnant: 550"
      ],
      "legacy_key": "G",
      "story": "Приближается буря."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.9,
    "attrAgilityInc": 1.7,
    "attrAgility": 22.0
  },
  "description": "Создание копии каждые 550 единиц в Ball Lightning 2 отскока атаки с Overload –1,25 сек. перезарядки Static Remnant +0,4 сек. действия Electric Vortex +50 к урону от Static Remnant +250 к здоровью +1,5 маны в секунду +20 к скорости атаки",
  "history": "Райдзин Громокег — сила природы в самом буквальном смысле: это буйная энергия ветра и непогоды, заключённая в человеческом обличье. Как же он неистов, неудержим и задорен! Весёлый, словно любимый дядюшка, Райдзин заряжает всё вокруг своей искрящейся энергией. Но не всегда всё было именно так: начало его жизни положила трагедия. Много поколений назад, на плато за Скулящими горами, добрые люди страдали от голода и засухи. Обычный маг стихий Громокег запретным заклинанием призвал духа бури, умоляя его о дожде. Разгневанный дерзостью смертного, небесный Райдзин обрушил на землю потопы и ураганы. Громокег не мог противостоять духу, пока не произнёс самоубийственное заклятье, сковавшее их судьбы: он запер небесного духа в клетке собственного тела. С тех пор громогласный Райдзин и задорный Громокег навсегда стали жизнерадостным небожителем, ступающим по земле — и имя ему Райдзин Громокег."
}