{"abilities":[{"spell":"Охватывает одинокое вражеское существо нестабильной энергией, замедляя его передвижение и нанося периодический урон. Эффект не действует, если рядом с целью есть её союзник.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Если в радиусе 225 появятся союзники или нейтральные крипы, то урон и замедление от способности прекратят своё действие, пока цель снова не останется одна.","Проверяет нахождение союзников или нейтралов с интервалом в 0.5 секунд сразу после применения. Обновление замедления зависит от результата этих проверок.","Также способность будет наносить урон в интервалах, основанных на проверках, нанося 7.5\/15\/22.5\/30 урона до 13 раз.","В то время когда Flux отключен, эффекты частиц на цели исчезают, и только красное свечение, оставшееся на юните, указывает на то, что негативный эффект еще наложен.","Строения, варды и близстоящие исчезнувшие юниты игнорируются и не отключают эффект способности. Однако неуязвимые юниты не игнорируются.","В общей сложности может нанести до 97.5\/195\/292.5\/390 ( 7.5\/15\/22.5\/30) урона цели, если способность наносила урон во всех интервалах (до учета сопротивлений).","Несколько применений на одну и ту же цель полностью сочетаются, поскольку все применения действуют независимо друг от друга.","Выбор таланта на увеличение длительность не улучшает ни один из существующих в настоящее время дебаффов от Flux."],"mana":"75","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16 ( 14.72)","name":"Flux","description":["Анимация применения: 0,3+0,77","Дальность применения: 500\/600\/700\/800 ( 900\/1000\/1100\/1200)","Радиус поиска: 225","Урон в секунду: 15\/30\/45\/60","Замедление скорости передвижения: 20%\/30%\/40%\/50%","Длительность: 6"],"hot_key":"Q","legacy_key":"C"},{"spell":"Создаёт круглое магнитное поле, дающее героям и строениям внутри него уклонение от всех атак, совершённых извне, а также увеличивающее скорость атаки.","effects":["Способность Направленная на область","Действует на Союзных героев"],"notes":["Накладывает бонус к скорости атаки и уклонению к союзникам внутри радиуса.","Эффекты предоставлены в виде ауры. Их бафф задерживается на 0.1 секунды.","Уклонение не действует на союзников, атакованных врагом внутри Magnetic Field.","Эффект уклонения от полей Arc Warden и его Tempest Double действуют независимо друг от друга. То есть, если союзник находится в пересечении двух полей, то атаки будут промахиваться до тех пор, пока их источник также не окажется в пересечении, а не в одном из полей.","Действует на героев (включая иллюзии и клонов), крипов-героев и строения. На всех остальных эффект не распространяется. Таким образом, находящиеся внутри поля Tombstone, Nether Ward, Supernova и т.п. свободно могут быть разрушены.","Не действует на неуязвимых юнитов, поэтому эффект действует только на строения, которые можно атаковать."],"mana":"50\/70\/90\/110","elements":["Может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"20 ( 18.4)","name":"Magnetic Field","description":["Анимация применения: 0,3+0","Дальность применения: 900","Радиус эффекта: 300","Уклонение: 100%","Бонус к скорости атаки: 50\/60\/70\/80","Длительность задержки ауры: 0.1","Длительность: 3,5\/4,5\/5,5\/6,5"],"hot_key":"W","legacy_key":"F"},{"spell":"Призывает призрачную искру, которая медленно материализуется и сторожит выделенную область. При появлении врага искра бросается на него и взрывается, нанося жертве магический урон и замедляя её.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Spark Wraith летит со скоростью в 400 единиц.","Как только задержка активации закончится, искра будет проверять наличие вблизи врагов (включая нейтральных крипов) с интервалом в 0.2 секунды и полетит в направлении первой замеченной цели.","Если в радиусе действия искры находится несколько врагов, она полетит к ближайшей цели.","Наносит урон, основанный на уровне способности при использовании. Улучшение Spark Wraith не обновляет значение урона у уже размещенных Spark Wraiths.","Искра сначала наносит урон, затем применяет дебафф.","Spark Wraith могут видеть противники.","Реагирует на невидимых юнитов. Может выбрать юнитов в тумане войны, но не неуязвимых или спрятанных юнитов.","Задержка активации не включена в длительность искры.","Дает наземный обзор в радиусе 300 на время существования искры. Видимость не задерживается.","Запущенный снаряд также дает обзор, который задерживается на 3.34 секунд при достижении цели.","Выбор таланта на урон мгновенно обновляет все уже размещенные искры, включая те, которые уже засекли цель.","У способности отображается только снижение перезарядки от таланта 20-го уровня. Вместе с талантом на 10-ом уровне перезарядка может уменьшится до 1.84 (3.68 без таланта 20-го уровня)."],"mana":"80","elements":["Нельзя избежать.","Блокируется иммунитетом к заклинаниям."],"cooldown":"4 ( 2)","name":"Spark Wraith","description":["Анимация применения: 0,3+0,77","Дальность применения: 2000","Радиус поиска: 375","Задержка активации: 2","Замедление скорости передвижения: 100%","Урон: 100\/170\/240\/310 ( 450\/520\/590\/660)","Длительность замедления: 0,4\/0,5\/0,6\/0,7","Длительность искры: 50"],"hot_key":"E","legacy_key":"R"},{"spell":"Сконцентрировав свои осколки в единую сущность, герой создаёт свою электрическую копию, которая может применять его способности и использовать все предметы, кроме расходуемых и тех, что теряются при смерти. Копия имеет отдельное время перезарядки способностей и предметов.","effects":["Способность Ненаправленная","Действует на Самость"],"notes":["Tempest Double всегда создается с текущим запасом здоровья и маны Arc Warden.","При первом применении Tempest Double двойник призывается. С каждым следующим применением он лишь излечивается или возрождается. То есть невозможно создать больше одной копии за раз, поскольку повторное применение Tempest Double просто обновит одно из предыдущих. К копии также применяется развеивание, снимая с неё все баффы и дебафф, включая неразвеиваемые в обычной ситуации. Перезарядка на предметах и способностях не сбрасывается при перепризыве. Перепризыв Tempest Double не позволяет избегать снаряды.","Arc Warden и его клон отображаются в виде иконок с полосами здоровья и маны в верхнем левом углу экрана. При выборе героя его иконка становится ярче, а при получении урона - мигает красным.","Tempest Double визуально отличается от героя как для врагов, так и для союзников.","Баффы от поглощенных Moon Shard и Эссенции Aghanim's Scepter копируются. При этом другие постоянные баффы (например, Duel, Intelligence Steal) - нет. Любой урон от победы в Duel, получаемый при длительности копии, теряется при её смерти.","На копию воздействуют любые заклинания, поскольку она считается за героя, а не за иллюзию.","За копию дают 180\/240\/300 золота и 180\/240\/300 опыта в зависимости от уровня ультимейта Arc Warden только юниту, добившему копию.","Эффекты заклинания, дающие бонус за смерть вражеского юнита (как, например, Death Pulse), не получают бонусов за смерть копии. Эта особенность предотвращает получение бонуса за победу в Duel над копией. Копия под действием Track также не дает золота. Улучшенная версия Wrath of Nature на месте убийства копии создает обычного Энта (а не Большого энта).","Tempest Double не накапливает опыт, так как не является героем. Соответственно, копия не участвует в распределении опыта за убийство героев или крипов."],"mana":"0","elements":[],"cooldown":"60\/50\/40 ( 55.2\/46\/36.8)","name":"Tempest Double","description":["Анимация применения: 0,15+0,5","Количество копий: 1","Длительность: 16\/20\/24"],"hot_key":"R","legacy_key":"D"},{"spell":"Создаёт перед героем случайную руну.","effects":["Способность Ненаправленная"],"notes":["Требует Aghanim's Scepter для разблокировки.","Руна появляется в 200 единицах от заклинателя. Может появляться на непроходимой территории.","Шанс появления каждой из 7 рун одинаковый.","Руна исчезает спустя 20 секунд, если её никто не поднял."],"mana":"100","elements":[],"cooldown":"60","name":"Rune Forge","description":["Анимация применения: 0,15+0,5","Дальность появления руны: 200","Длительность руны: 20"],"hot_key":"D","legacy_key":"G"}],"bio":"До начала всего в абсолютной пустоте обитала единая сущность — первородное сознание. Бесконечное, невероятное, оно следовало лишь своим загадочным целям. Вместе с громом, ознаменовавшим создание вселенной, раздался и треск: первородное сознание раскололось. Два самых крупных его осколка, которые много времени спустя прозовут Светом и Тьмой, открыли друг в друге злейших врагов, и посвятили всё свое существование полному уничтожению противника. Война стала угрожать существованию едва зародившегося космоса, и тогда третий осколок изъявил желание вмешаться. Чистый разум, назвавший себя Зет, хотел прекратить этот хаос и восстановить единство бытия. Поражённый неизмеримой жестокостью братьев, Зет собрал все свои силы и одной яркой вспышкой одолел обе враждующие стороны. Два противника были сжаты воедино, пока не образовали космическое тело, отправленное кружить вокруг неизвестной планеты в далеком краю вселенной. Зет почти полностью лишился сил, но во вселенной воцарился порядок. Обратив свой взор на созданную темницу, Зет направил остатки сил на её охрану. Многие тысячелетия страж оставался непоколебимым. Планета расцветала, полная жизни и сует, освобождённая от мыслей об ужасах, таящихся под поверхностью ночного светила, и стараниях Зета их сдержать. Но когда внутренняя схватка дошла до такой силы, что поверхность спутника начала трещать по швам, Зет понял, что его истощённых сил больше не достаточно. Спутник разорвался на кусочки и выпустил на волю древних узников, жаждущих битвы. Взрыв отбросил Зета на далекий край галактики, преобразив его сущность. Он разбился на множество осколков, лишённых единой формы и мысли, да удерживаемых лишь энергией парящего разума. Подавив чувство собственной разрозненности, Зет помчался в сторону возобновившейся битвы братьев. В этот раз он знал, что нужно делать. Чтобы положить конец вечной войне, призраков былого сознания нужно либо объединить, либо уничтожить…","talentsTips":["Таланты полностью копируются Tempest Double.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"trivia":["Реплика \"You will just have to accept this, and move on.\" Является отсылкой к известному веб-сериалу The Dota 2 Reporter, в котором этой фразой объясняется большая часть логики игры.","Реплика \"You will be back.\" Является отсылкой к известной фразе в фильме \"Терминатор\" \"I'll be back\"","Реплика \"Selfie.\" Является отсылкой к фото самого себя, а также когда Arc Warden подбирает руну иллюзий он говорит \"So many selves\" или \"So many selves,so little time\" что в переводе означает \"Так много самости,за так мало времени\" это отсылка к популярному интернет мему \"Так много селфи\"","Две фразы Arc Warden \"Subte self\" и \"The Self is made whole\" что в дословном переводе означает \"Выздоровел самостоятельно\" и \"Похудел самостоятельно\"","Если Arc Warden убивает Lycan то он говорит \"Inferior form.\" - \"Низшая форма.\" , \"Apex predator, you are not.\" - \"Ты низ пищевой цепочки.\" Это является отсылкой к его старой модельки в \"WarCraft 3\" где тот был собакой","Реплика \"Flame is no match for the Arc.\" - \"Пламя не может тягаться с электричеством.\" Возможно является отсылкой к мультсериалу \"Аватар\" где некоторые маги огня могли стать мастерами молний.","Реплика \" Self knows what you once were.\" - \"Самость помнит твой прежний облик.\" Рассказывает о том что Enigma был заточен в \"Безумную луну\" из-за Arc Warden и из-за которой произошли \"Крепости\"","Когда Arc Warden встречает Phoenix он говорит \"Phoenix, your light glittered from the afar as Self traveled the cosmos.\" - \"Феникс, твой свет был виден, когда Самость борозидила космос.\" Возможно Arc Warden прибыл на землю благодаря Phoenix","У Arc Warden хорошие отношение к Elder Titan Faceless Void Phoenix Enigma Io Keeper of the Light Chaos Knight , Ведь возможно он знал их всех до того как попал на землю, но также он может говорить Elder Titan \"World breaker, this is justice.\" - \"Возмездие за разрушенные миры.\" когда он того убивает, или говорит Outworld Devourer \"You devour your last.\" - \"Твоя последняя трапеза.\"","Внешне Arc Warden напоминает Мистерио из вселенной Марвел, возможно это совпадение намекает на то, что один из разработчиков фанат Человека-Паука","Большинство реплик Arc Warden были неправильно переведены, и большинство игр слов не было переведено на русский, так например \"Pretty Butterfly \", что в переводе \"Красивая бабочка\", а также \"Warding Warden.\" Observer Ward , \"You are silenced.\" это обращение к Anti-Mage в переводе звучит так - \"Ты замолк\" , а в русской версии \"Тебя больше не услышат\""],"talents":["+350 к урону от Spark Wraith:+30% к вампиризму","+125 к дальности атаки:-2 сек. перезарядки Spark Wraith","+400 к дальности применения Flux:+300 к здоровью","+35 к скорости атаки:-8% перезарядки способностей"],"desc":"Arc Warden — это герой с дальним типом атаки, основной характеристикой которого является ловкость, хотя прирост силы и интеллекта у него больше. Его первая способность, Flux, охватывает вражеское существо, замедляя его скорость передвижения и нанося урон, если он один. Эффект блокируется, если рядом с целью есть ее союзники. Вторая способность, Magnetic Field, генерирует поле, дающее 100% шанс уклонения от атак, произведённых снаружи, а так же дополнительную скорость атаки союзным героям и строениям внутри его. Третья способность, Spark Wraith, призывает призрачную искру, которая медленно материализуется. При появлении врага в радиусе действия искра наносит цели магический урон и замедляет её. Ультимативная способность, Tempest Double, создает электрическую копию Arc Warden, которая может использовать все его способности (кроме Tempest Double) и предметы (за исключением некоторых)."}