{
  "abilities": [
    {
      "notes": [
        "Dragon Slave travels at a speed of 1200, taking 0.9 seconds to travel the full distance",
        "With the travel distance and end radius, it can hit units up to 1275 range away",
        "The complete area is shaped like a cone",
        "For how much damage Dragon Slave deals with each amount of   Fiery Soul stacks on each level and with  Flame Cloak's spell damage amplification, please refer to the chart below"
      ],
      "item_behaviour": [],
      "description": "Lina channels the breath of a dragon, sending out a wave of fire that scorches every enemy in its path.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.45+0.38",
        "Cast Range:  800",
        "Starting Radius: 275",
        "Travel Distance:  1075",
        "End Radius: 200",
        "Damage: 85\/160\/235\/310"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/66\/Lina_Dragon_Slave_1.mp3\/revision\/latest?cb=20191216015459",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "9 (TagTalent 5.5)",
      "aghanim": null,
      "name": "Dragon Slave",
      "cooldown": "100\/115\/130\/145",
      "legacy_key": "D",
      "story": "In the scorched barren of Misrule, Lina learned to manipulate the fiery breath of the Desert Wyrm as a form of entertainment."
    },
    {
      "notes": [
        "Light Strike Array first applies the debuff, then the damage",
        "Destroys trees within its radius after the effect delay",
        "The visual effects and the sound during the 0.5-second effect delay are only visible and audible to allies",
        "Lina has two different animations for this ability, leading to two possible cast backswing durations",
        "For how much damage Light Strike Array deals with each amount of   Fiery Soul stacks on each level and with  Flame Cloak's spell damage amplification, please refer to the chart below"
      ],
      "item_behaviour": [],
      "description": "Summons a column of flames that damages and stuns enemies.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.45+0.67\/0.43",
        "Cast Range:  625",
        "Effect Radius: 250",
        "Effect Delay: 0.5",
        "Damage: 100\/150\/200\/250 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 230\/280\/330\/380)",
        "Stun Duration: 1.6\/1.9\/2.2\/2.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Lina_Light_Strike_Array_1.mp3\/revision\/latest?cb=20191216015451",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "13\/11\/9\/7",
      "aghanim": null,
      "name": "Light Strike Array",
      "cooldown": "100\/105\/110\/115",
      "legacy_key": "T",
      "story": "Lina's essence allows her to focus the sun's energies, causing air to combust at will."
    },
    {
      "notes": [
        "Grants a stack whenever one of Lina's abilities deal damage to enemies (before reductions), including to buildings. Does not trigger on active item abilities, on abilities with 0 cooldown, or on abilities which do not trigger on-cast effects. The stacks share a duration, gaining a new instance refreshes the entire stack",
        "This is how much bonus movement speed and attack speed Fiery Soul grants respectively, up to stacks on each level: 2 Stacks: 3%\/4%\/5%\/6% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 5%\/6%\/7%\/8%) movement speed 20\/40\/60\/80 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 50\/70\/90\/110) attack speed. 3 Stacks: 4.5%\/6%\/7.5%\/9% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 7.5%\/9%\/10.5%\/12%) movement speed 30\/60\/90\/120 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 75\/105\/135\/165) attack speed. 4 Stacks: 6%\/8%\/10%\/12% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 10%\/12%\/14%\/16%) movement speed 40\/80\/120\/160 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 100\/140\/180\/220) attack speed. 5 Stacks: 7.5%\/10%\/12.5%\/15% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 12.5%\/15%\/17.5%\/20%) movement speed 50\/100\/150\/200 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 125\/175\/225\/275) attack speed. 6 Stacks: 9%\/12%\/15%\/18% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 15%\/18%\/21%\/24%) movement speed 60\/120\/180\/240 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 150\/210\/270\/330) attack speed. 7 Stacks: 10.5%\/14%\/17.5%\/21% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 17.5%\/21%\/24.5%\/28%) movement speed 70\/140\/210\/280 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 175\/245\/315\/385) attack speed.  SHARD NOTES Also increases the damage of Lina's abilities by a flat 15\/30\/45\/60\/75\/90\/105 with each amount of stacks"
      ],
      "item_behaviour": [],
      "description": "Grants bonus attack and movement speed each time Lina hits an enemy with a spell. Stacks with itself. Lasts 18 seconds.",
      "hot_key": "E",
      "params": [
        "Max Stacks: 7",
        "Move Speed Bonus per Stack: 1.5%\/2%\/2.5%\/3% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2.5%\/3%\/3.5%\/4%)",
        "Attack Speed Bonus per Stack: 10\/20\/30\/40 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 25\/35\/45\/55)",
        "Stack Duration: 18",
        "Ability Damage Bonus per Stack:  15"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Fiery Soul",
      "cooldown": null,
      "legacy_key": "F",
      "story": "Dancing flames embody Lina's playful nature, bringing out her true blazing self."
    },
    {
      "notes": [
        "Requires  Aghanim's Scepter to be unlocked",
        "Interrupts Lina's channeling abilities upon cast",
        "Turns Lina into a flying unit, allowing her to fly over impassable terrain, trees, units, and buildings for its duration. However, it does not grant her flying vision. Lina is not disabled while flying and can use any items and abilities normally",
        "Upon cast, Lina ascends 100 units above the z-axis at a speed of 350, taking 0.29 seconds to fully ascend up and down. The flight speed equals Lina's current movement speed",
        "Increases Lina's total magic resistance to 51.25%. SPELL STEAL Turns  Rubick into a flying unit upon cast"
      ],
      "item_behaviour": [],
      "description": "Grants Lina unobstructed movement and increases her spell damage and magic resistance",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0",
        "Magic Resistance Bonus: 35%",
        "Outgoing Spell Amplification Bonus: 30%",
        "Duration: 6"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "25",
      "aghanim": null,
      "name": "Flame Cloak",
      "cooldown": "50",
      "legacy_key": "L",
      "story": "A natural defense equally suited to keeping anything from unwanted sisters to snarling hellbeasts at bay."
    },
    {
      "notes": [
        "Places a debuff on the target, which applies the damage upon expiring. The debuff lasts 0.25 seconds. This means the ability can be avoided by being invulnerable or hidden as the debuff expires",
        "TALENT NOTES Laguna Blade's damage type is changed to pure and pierces spell immunity",
        "For how much damage Laguna Blade deals with each amount of   Fiery Soul stacks on each level and with  Flame Cloak's spell damage amplification, please refer to the chart below"
      ],
      "item_behaviour": [],
      "description": "Fires off a bolt of lightning at a single enemy unit, dealing massive damage.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.45+0.7",
        "Cast Range:  600",
        "Effect Delay: 0.25",
        "Damage: 500\/700\/900"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f0\/Lina_Laguna_Blade_1.mp3\/revision\/latest?cb=20191216015450",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "70\/60\/50 (TagTalent 45\/35\/25)",
      "aghanim": null,
      "name": "Laguna Blade",
      "cooldown": "150\/300\/450",
      "legacy_key": "G",
      "story": "The air around Lina becomes so intensely torrid that it scorches a foe that came too close with white-hot lightning."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 20.0,
    "attrIntelligence": 30.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 2.4,
    "attrAgility": 23.0
  },
  "description": "Increases attack and speed with every spell. Like her younger sister, Lina's elemental affinity was the source of many headaches. Sent south to live with a patient aunt, she learned to master her Fiery Soul in the blazing Desert of Misrule. Channeling the breath of Desert Wyrms, she unleashes her Dragon Slave to burn a path before her. Attuned to fire, Lina ignites the ground, incinerating foes in a Column of Flame. Even the hardiest of heroes fear the Slayer's signature spell — The Laguna Blade. Focusing every bit of heat around her, and Cloaking Herself in Flames, Lina fires a condensed bolt of white-hot energy, instantly evaporating her opponent with minimal struggle or effort.  Support Carry Nuker Disabler ★☆☆",
  "trivia": [
    "The original Lina Inverse \"The Slayer\" was modeled after the main character from the novels\/anime\/manga Slayers where Light Strike Array, Dragon Slave and Laguna Blade are all spells used by the original Lina Inverse.[1]",
    "Lina's line Link▶️ \"Better to burn out than fade away\" is a reference to the Neil Young song, My, My, Hey, Hey. The line also appears in the suicide note of Kurt Cobain.",
    "The line also appears in the suicide note of Kurt Cobain.",
    "The line Link▶️ \"Turn me over... I'm done.\" is a reference to Lawrence of Rome who was roasted alive on a giant grill and joked, \"Turn me over — I'm done on this side.\"",
    "Lina's rival response towards Batrider Link▶️ \"Why'd you stop? This isn't Batrider country.\" is a reference to a line in the movie Fear and Loathing in Las Vegas.[2]",
    "In older versions of DotA, Lina was a male hero that used the Blood Mage model, also used by the Invoker. In these versions, Lina was known as Link Inverse.",
    "Lina's line Link▶️ \"It's not the heat, it's the humiliation.\" is a reference to \"It's not the heat, it's the humidity.\" a quote from Yogi Berra.",
    "Lina's coils around her neck are possibly a representation of Kayan Lahwi women in Myanmar, who are also referred to as \"dragon women\"."
  ],
  "history": "The sibling rivalries between Lina the Slayer, and her younger sister Rylai, the Crystal Maiden, were the stuff of legend in the temperate region where they spent their quarrelsome childhoods together. Lina always had the advantage, however, for while Crystal was guileless and naive, Lina's fiery ardor was tempered by cleverness and conniving. The exasperated parents of these incompatible offspring went through half a dozen homesteads, losing one to fire, the next to ice, before they realized life would be simpler if the children were separated. As the oldest, Lina was sent far south to live with a patient aunt in the blazing Desert of Misrule, a climate that proved more than comfortable for the fiery Slayer. Her arrival made quite an impression on the somnolent locals, and more than one would-be suitor scorched his fingers or went away with singed eyebrows, his advances spurned. Lina is proud and confident, and nothing can dampen her flame.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-25s Laguna Blade Cooldown",
        "talent_left": "Laguna Blade damage is Pure and pierces Spell Immunity"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+11% Spell Amplification",
        "talent_left": "+15\/1% Fiery Soul Per Stack"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+350 Health",
        "talent_left": "+130 Light Strike Array Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+20 Damage",
        "talent_left": "-3.5s Dragon Slave Cooldown"
      }
    ],
    "notes": [
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}