{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1.5 Terrorize Duration",
          "talentRight": "+110 Attack Speed"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-7s Bramble Maze CD",
          "talentRight": "+2s Shadow Realm Duration"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+160 Cursed Crown AoE",
          "talentRight": "+32 Bedlam Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-2s Shadow Realm Cooldown",
          "talentRight": "+0.5s Cursed Crown Stun Duration"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Dark_Willow_Bramble_Maze_1.mp3\/revision\/latest?cb=20191216012330",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The visual effects and the sound during the 0.5-second bramble spawn delay are only visible and audible to allies.",
        "The projectile launched upon cast has only cosmetic purposes, and does not affect the delay.",
        "The brambles are always placed in the same formation. 4 brambles are placed 200 range away from the center of the target area, towards north, east, south, and west. 4 brambles are placed 500 range away from the center of the target area, towards north-east, south-east, south-west, and north-west. The brambles spawn in 0.075-second intervals, starting 0.5 seconds after cast, so it takes 1.025 seconds for all brambles to spawn. The inner circle spawns first, starting with the east bramble, going counter-clockwise. The outer circle starts with the north-east bramble.",
        "4 brambles are placed 200 range away from the center of the target area, towards north, east, south, and west.",
        "4 brambles are placed 500 range away from the center of the target area, towards north-east, south-east, south-west, and north-west.",
        "The brambles spawn in 0.075-second intervals, starting 0.5 seconds after cast, so it takes 1.025 seconds for all brambles to spawn.",
        "The inner circle spawns first, starting with the east bramble, going counter-clockwise. The outer circle starts with the north-east bramble.",
        "Each bramble is inactive for 0.1 seconds after spawning.",
        "A bramble roots the first enemy unit which comes within 90 range of it, after which it then disappears. The brambles require no vision and can hit invisible enemies, or enemies in the Fog of War. Does not provide True Sight over rooted enemies.",
        "The brambles require no vision and can hit invisible enemies, or enemies in the Fog of War.",
        "Does not provide True Sight over rooted enemies.",
        "Deals 60\/53.33\/50\/48 damage in 0.5-second intervals, starting 0.5 seconds after the buff is applied, resulting in 2\/3\/4\/5 instances. Can deal a total of 120\/160\/200\/240 damage to the target (before reductions).",
        "Can deal a total of 120\/160\/200\/240 damage to the target (before reductions).",
        "The brambles' duration starts after the initial creation delay. This means the last bramble disappears 16.025 seconds after cast.",
        "Multiple instances of the debuff fully stack. Each bramble places its own independent debuff.",
        "Leveling the ability up while there are other active brambles does not update the root duration."
      ],
      "mana": "100\/120\/140\/160",
      "hotKey": "Q",
      "cooldown": "20 (TagTalent 13)",
      "description": "Dark Willow creates a maze of brambles that grow in the target area after 0.5 seconds. Enemies that walk into a bramble are rooted and take damage over time.",
      "spellName": "Bramble Maze",
      "params": [
        "Cast Animation: 0.3+0.8",
        "Cast Range: 1000\/1100\/1200\/1300",
        "Bramble Spawn Radius: 500",
        "Root Search Radius: 90",
        "Bramble Spawn Delay: 0.5",
        "Bramble Spawn Interval: 0.075",
        "Bramble Activation Delay: 0.1",
        "Number of Brambles: 8",
        "Total Damage: 120\/160\/200\/240",
        "Root Duration: 1\/1.5\/2\/2.5",
        "Bramble Duration: 15"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Dark_Willow_Shadow_Realm_1.mp3\/revision\/latest?cb=20191216012334",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not interrupt channeling abilities upon cast.",
        "Shadow Realm disjoints projectiles upon cast.",
        "During Shadow Realm, Dark Willow is phased, attack immune and unselectable. Any attack or ability targeting Dark Willow which is already in its attack or cast animation gets canceled. Due to this, Dark Willow (or ↓↓ Double-tapping) cannot target herself with most of her own items either, with the following exceptions: Glimmer Cape, Healing Salve, Moon Shard and Shadow Amulet. Does not prevent Spell Reflection from reflecting abilities back at her.",
        "Any attack or ability targeting Dark Willow which is already in its attack or cast animation gets canceled.",
        "Due to this, Dark Willow (or ↓↓ Double-tapping) cannot target herself with most of her own items either, with the following exceptions: Glimmer Cape, Healing Salve, Moon Shard and Shadow Amulet.",
        "Does not prevent Spell Reflection from reflecting abilities back at her.",
        "Due to the unselectability, almost every ability treats Dark Willow as if she were invisible, except the following abilities: Heat-Seeking Missile, Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism, and Thundergod's Wrath. Unlike with invisibility, Beetles, Phantoms and Undying Zombies do not instantly die when Shadow Realm is cast.",
        "Heat-Seeking Missile, Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism, and Thundergod's Wrath.",
        "Unlike with invisibility, Beetles, Phantoms and Undying Zombies do not instantly die when Shadow Realm is cast.",
        "When cast while attacking an enemy, Dark Willow is ordered to stop, so that the attack out of Shadow Realm is not wasted. However, when she is given an attack order (A) while outside attack range, casting Shadow Realm while she moves does not stop her from attacking immediately.",
        "However, when she is given an attack order (A) while outside attack range, casting Shadow Realm while she moves does not stop her from attacking immediately.",
        "Casting abilities or items during Shadow Realm does not end it, only attacking does.",
        "The Shadow Realm buff is lost upon launching an attack. Upon launch, Dark Willow gets the attack logic buff, which is responsible for the damage. This buff disappears upon hitting the target, or within 3 seconds, whichever is shorter. This means if the projectile flies for more than 3 seconds, the damage is not applied. The buff responsible for the damage is lost on death, so when dying before projectile hit negates the damage. The buff only works for the attack that created it. Any other projectiles launched afterwards do not apply the bonus damage. With Aghanim's Scepter, attacking no longer ends Shadow Realm, and each attack launched applies the Shadow Realm damage.",
        "This buff disappears upon hitting the target, or within 3 seconds, whichever is shorter.",
        "This means if the projectile flies for more than 3 seconds, the damage is not applied.",
        "The buff responsible for the damage is lost on death, so when dying before projectile hit negates the damage.",
        "The buff only works for the attack that created it. Any other projectiles launched afterwards do not apply the bonus damage.",
        "With Aghanim's Scepter, attacking no longer ends Shadow Realm, and each attack launched applies the Shadow Realm damage.",
        "The damage increases by 0.77\/1.54\/2.31\/3.09 on each server tick, reaching its maximum in 3.5 seconds.",
        "The damage stops growing as soon as the attack is launched. It does not continue to grow while flying towards the target.",
        "The damage is dealt in a separate instance and is not added to Dark Willow's attack damage.",
        "The bonus damage of Shadow Realm does not work against buildings and wards, but works on allies."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "W",
      "cooldown": "26\/22\/18\/14 (TagTalent 24\/20\/16\/12)",
      "description": "Dark Willow recedes into the shadows, becoming untargetable. Her next attack has increased attack range and deals bonus magic damage, and will end Shadow Realm. Damage scales based on how long she remains under the effects of Shadow Realm, the maximum being reached after 3.5 seconds.",
      "spellName": "Shadow Realm",
      "params": [
        "Cast Animation: 0+0",
        "Attack Range Bonus: 600",
        "Max Damage: 90\/180\/270\/360",
        "Max Damage Duration: 3.5",
        "Duration: 5 (TagTalent 7)",
        "Attacking no longer takes you out of Shadow Realm. Each attack still has bonus damage based on the duration of the buff.",
        "Does not attempt to damage spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Dark_Willow_Cursed_Crown_1.mp3\/revision\/latest?cb=20191216012332",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "The sound and visual effect during the delay on the target is audible and visible to everyone. The visual effect indicates the area to be affected on each second.",
        "The visual effect indicates the area to be affected on each second.",
        "Turning invulnerable or hidden does not prevent the debuff from affecting the area around the target.",
        "With Aghanim's Shard, losing the initial debuff in any way causes 4 Brambles based on the current level to spawn around the target. Bramble Maze's notes fully apply. If it is not leveled, no brambles spawn. The brambles are always placed 175 range away from the target, towards north, east, south, and west. Unlike the brambles from a regular cast, these brambles spawn simultaneously.",
        "Bramble Maze's notes fully apply. If it is not leveled, no brambles spawn.",
        "The brambles are always placed 175 range away from the target, towards north, east, south, and west.",
        "Unlike the brambles from a regular cast, these brambles spawn simultaneously."
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "E",
      "cooldown": "18\/16\/14\/12 (TagTalent 16\/14\/12\/10)",
      "description": "Dark Willow casts an ancient fae curse on the target. After a delay, the target and nearby enemies are stunned.",
      "spellName": "Cursed Crown",
      "params": [
        "Cast Animation: 0.2+0.83",
        "Cast Range: 600\/625\/650\/675",
        "Stun Radius: 360 (TagTalent 520)",
        "Effect Delay: 4 (TagTalent 3)",
        "Stun Duration: 1.5\/2\/2.5\/3 (TagTalent 2\/2.5\/3\/3.5)",
        "Bramble Spawn Radius: 175",
        "Cursed Crown creates four brambles around the target after the counter ends. Triggers even upon dispel. Reduces cooldown by 2 seconds and stun delay by 1 second.",
        "Blocked upon cast."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/87\/Dark_Willow_Bedlam_1.mp3\/revision\/latest?cb=20191216012342",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Leveling this ability automatically levels Terrorize as well.",
        "Interrupts Dark Willow's channeling abilities upon cast.",
        "While active, Terrorize is inactive and cannot be cast.",
        "Bedlam is inactive during Terrorize's cast time, and stays inactive until Jex fully returns to Dark Willow after terrorizing enemies.",
        "On cast, Jex always appears on the west side and rotates clockwise around Dark Willow.",
        "Jex rotates around Dark Willow at a speed of 698.13, taking 1.8 seconds to finish a revolution. This results in 2.78 revolutions over the whole duration.",
        "This results in 2.78 revolutions over the whole duration.",
        "On each attack, Jex chooses a visible random target within range. There are no priorities. Does not attack buildings or wards. The attack radius is centered on Jex. A light pink glow surrounds it, indicating the attack area. Jex continues attacking even when Dark Willow is disabled. It stops only when she dies, or when expiring. Jex' attacks are not regular attacks. They are treated like an ability, and thus do not interact with any on attack effects. This means that both spell damage amplification and spell lifesteal does work with it. Dark Willow is the damage source. The attack projectiles traveling at a speed of 1400.",
        "The attack radius is centered on Jex. A light pink glow surrounds it, indicating the attack area.",
        "Jex continues attacking even when Dark Willow is disabled. It stops only when she dies, or when expiring.",
        "Jex' attacks are not regular attacks. They are treated like an ability, and thus do not interact with any on attack effects.",
        "This means that both spell damage amplification and spell lifesteal does work with it. Dark Willow is the damage source.",
        "The attack projectiles traveling at a speed of 1400.",
        "With its 0.25-second attack rate, it can attack up to 20 times.",
        "With the current attack rate and damage, it can deal up to 300\/500\/700 (TagTalent 428\/628\/828) damage per second to a single unit. Can deal up to 1500\/2500\/3500 (TagTalent 2140\/3140\/4140) damage to a single unit (before reductions).",
        "Can deal up to 1500\/2500\/3500 (TagTalent 2140\/3140\/4140) damage to a single unit (before reductions).",
        "Recasting Bedlam before the previous cast finishes refreshes the duration.",
        "The ability itself provides no vision, but Jex has 600 ground vision which he provides for the duration."
      ],
      "mana": "100\/150\/200",
      "hotKey": "D",
      "cooldown": "30",
      "description": "Dark Willow's pet wisp roams around her for the duration, rapidly attacking nearby enemies. Bedlam cannot be used while Terrorize is active.",
      "spellName": "Bedlam",
      "params": [
        "Cast Animation: 0+0",
        "Roam Radius: 200",
        "Attack Radius: 300",
        "Attack Interval: 0.25",
        "Damage per Attack: 75\/125\/175 (TagTalent 107\/157\/207)",
        "Seconds per Revolution: 1.8",
        "Duration: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Dark_Willow_Terrorize_1.mp3\/revision\/latest?cb=20191216012339",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "Leveling this ability automatically levels Bedlam as well.",
        "Terrorize is inactive during Bedlam.",
        "Terrorize is also inactive during its cast time, and stays inactive until Jex fully returns to Dark Willow after terrorizing enemies. This means Terrorize cannot be cast again until Jex returned from a previous cast.",
        "This means Terrorize cannot be cast again until Jex returned from a previous cast.",
        "Jex travels to the target point at a speed of 2000, and returns to Dark Willow at a speed of 600.",
        "The visual effect at the target area during the cast time\/effect delay is visible to allies only. The sound is audible to everyone.",
        "Applies fear on all hit enemies within the radius, forcing them to run towards their team's Fountain, while preventing them from acting. When hitting neutral creeps, they retreat to their camps instead.",
        "When hitting neutral creeps, they retreat to their camps instead.",
        "Provides shared vision over all hit enemies for its duration. Affects invisible units, but does not provide True Sight.",
        "The ability itself provides no vision, but Jex has 600 ground vision which he provides during the duration."
      ],
      "mana": "150",
      "hotKey": "R",
      "cooldown": "100\/90\/80",
      "description": "Dark Willow releases her pet wisp to terrorize her enemies. After a short delay, all enemies in the target area become fearful and run toward their home fountain. Terrorize cannot be used while Bedlam is active.",
      "spellName": "Terrorize",
      "params": [
        "Cast Animation: 1+2.57",
        "Cast Range: 1200",
        "Radius: 400",
        "Duration: 3.5\/3.75\/4 (TagTalent 5\/5.25\/5.5)"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 20.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.6,
    "attrAgility": 18.0
  },
  "description": "Mireska Sunbreeze, the Dark Willow, is a ranged intelligence hero with a powerful array of disables and nukes. She can summon a tangle of thorns to root enemies in her Bramble Maze, or curse an enemy to stun them after a delay with Cursed Crown. Slipping into the Shadow Realm to avoid attacks, she re-emerges with a powerful magical burst. Calling upon her companion Jex, Dark Willow dishes out a flurry of heavy magic damage with Bedlam, or sends her enemies fleeing in fear with Terrorize. This wide arsenal of disables and nukes allows her to gank, roam, and support with equal efficiency, making her indispensable in teamfights.",
  "history": "Children love telling stories about the whimsical adventures of fairies... That's because children don't know that most fairies are spiteful jerks. And in the world of spiteful fairies there are few names spoken of with more contempt than Mireska Sunbreeze. Born to a fae merchant king, Mireska grew up in Revtel; a cutthroat nation where manipulation and murder were the norm. But while she was quite adept at navigating the etiquette, unspoken laws, and social rituals that permeated every element of her life, she found the whole thing rather boring. So, Mireska did what most rebellious children do: burn down her family estate and set off with her pet wisp Jex to live the life of a wandering grifter.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1.5 Terrorize Duration",
      "talentRight": "+110 Attack Speed"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-7s Bramble Maze CD",
      "talentRight": "+2s Shadow Realm Duration"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+160 Cursed Crown AoE",
      "talentRight": "+32 Bedlam Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-2s Shadow Realm Cooldown",
      "talentRight": "+0.5s Cursed Crown Stun Duration"
    }
  ]
}