{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Necrophos: 160 здоровья и 0,8 восстановления здоровья.",
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Necrophos до 49%."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−2,5 сек. перезарядки Death Pulse",
          "talentRight": "+0,5% к к эффекту Heartstopper Aura"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+32 к снижению здоровья от Heartstopper Aura",
          "talentRight": "+15% к сопротивлению магии"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+32 к лечению от Death Pulse",
          "talentRight": "+24% к замедлению от Ghost Shroud"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8 к силе",
          "talentRight": "+100 к дальности применения Reaper's Scythe"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Necrophos_Death_Pulse.mp3\/revision\/latest?cb=20191216020945",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "При применении Death Pulse прерывает произносимые заклинания Necrophos.",
        "Волна летит со скоростью 400 единиц.",
        "Действует на невидимых существ и существ в тумане войны.",
        "Не действует на неуязвимых и спрятанных существ.",
        "Действует на курьеров: лечит союзного курьера, но не наносит урон вражескому."
      ],
      "mana": "100\/130\/160\/190",
      "item_behaviour": [],
      "name": "Death Pulse",
      "cooldown": "8\/7\/6\/5 (TagTalent 5,5\/4,5\/3,5\/2,5)",
      "description": "Герой выпускает вокруг себя волну смерти, которая наносит урон врагам и исцеляет союзников.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,77",
        "Радиус: 500",
        "Урон: 100\/150\/200\/250",
        "Лечение: 60\/80\/100\/120 (TagTalent 92\/112\/132\/152)",
        "Дарует новую способность: Death Seeker.",
        "Не выбирает целью врагов с иммунитетом к заклинаниям. Уже запущенные снаряды пытаются нанести урон врагам с иммунитетом. Действует на союзников с иммунитетом."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Necrophos_Ghost_Shroud.mp3\/revision\/latest?cb=20191216020946",
      "effects": [
        "Способность Ненаправленная \/ Аура",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Necrophos.",
        "Применяет к Necrophos призрачную форму, обезоруживая его, делая его неуязвимым к атакам и давая 100% сопротивление к физическому урону.",
        "Снижает общее сопротивление магии Necrophos до -5%, учитывая его базовое сопротивление в 25% и не учитывая другие источники сопротивления.",
        "Снижение сопротивления магии от Ghost Shroud не складывается с другими эффектами, дающими призрачную форму, поскольку имеет наивысший приоритет.",
        "Применяет усиление лечения, регенерации здоровья, восстановления и регенерации маны, но не усиление вампиризма или вампиризма заклинаний. Увеличивает лечение Necrophos от Death Pulse до 105\/140\/175\/210 (TagTalent 161\/196\/231\/266) здоровья за применение. Увеличивает дополнительную регенерацию здоровья от Heartstopper Aura за заряд до 1,75. Увеличивает дополнительную регенерацию маны от Heartstopper Aura за заряд до 6,125\/7,875\/9,625\/11,375 за заряд.",
        "Увеличивает лечение Necrophos от Death Pulse до 105\/140\/175\/210 (TagTalent 161\/196\/231\/266) здоровья за применение.",
        "Увеличивает дополнительную регенерацию здоровья от Heartstopper Aura за заряд до 1,75.",
        "Увеличивает дополнительную регенерацию маны от Heartstopper Aura за заряд до 6,125\/7,875\/9,625\/11,375 за заряд.",
        "Замедление представлено в виде ауры. Дебафф задерживается на 0,5 сек."
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Ghost Shroud",
      "cooldown": "28\/24\/20\/16 (TagTalent 10)",
      "description": "Герой открывает связь с миром усопших, замедляя врагов вокруг. В этой форме он не может атаковать, получает повышенный магический урон, но защищён от физических атак и быстрее восстанавливает свои здоровье и ману.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус замедления: 750",
        "Замедление передвижения врага: 6%\/12%\/18%\/24% (TagTalent 30%\/36%\/42%\/48%)",
        "Усиление восстановления: 75%",
        "Доп. магический урон: 40%",
        "Длительность задержки ауры: 0,5",
        "Длительность: 3\/3,5\/4\/4,5",
        "Уменьшает перезарядку.",
        "Можно применить при иммунитете к заклинаниям. При этом бафф будет мгновенно снят, если иммунитет будет обнаружен. Замедление остается, если дебафф был применен до иммунитета."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов \/ Себя",
        "Урон Магический Отнимающий здоровье"
      ],
      "notes": [
        "Дебафф от Heartstopper Aura задерживается на 7 сек.",
        "Потеря здоровья от Heartstopper Aura — это отнимающий здоровье урон, поэтому на него не срабатывают любые эффекты, реагирующие на урон. Так же на него не действует усиление урона заклинаний.",
        "С улучшением от Aghanim's Scepter наносит 1,2%\/2,4%\/3,6%\/4,8% (TagTalent 2,2%\/3,4%\/4,6%\/5,8%) от максимального здоровья в секунду, пока на Necrophos действует Ghost Shroud.",
        "Наносит 0,12%\/0,24%\/0,36%\/0,48% (TagTalent 0,22%\/0,34%\/0,46%\/0,58%) от максимального здоровья существа в качестве урона с интервалом в 0,2 секунды спустя 0,2 секунды после изучения способности. С Aghanim's Scepter наносит 0,24%\/0,48%\/0,72%\/0,96% (TagTalent 0,44%\/0,68%\/0,92%\/1,16%) от максимального здоровья существа в качестве урона с интервалом в 0,2 секунды, пока активна Ghost Shroud.",
        "С Aghanim's Scepter наносит 0,24%\/0,48%\/0,72%\/0,96% (TagTalent 0,44%\/0,68%\/0,92%\/1,16%) от максимального здоровья существа в качестве урона с интервалом в 0,2 секунды, пока активна Ghost Shroud.",
        "Иконка дебаффа показывается врагам в случае, если у затронутого существа есть обзор на Necrophos. Но цифры урона видны всегда.",
        "Но цифры урона видны всегда.",
        "Не действует на древних крипов.",
        "Выбор таланта, увеличивающего урон, не подействует на существ до тех пор, пока они не покинут и вновь не окажутся в радиусе действия.",
        "Necrophos получает заряд за каждое совершенное убийство, включая добивание союзных существ, но исключая убийство иллюзий и Tempest Double. Каждый заряд действует независимо от других. Они не обновляются при появлении нового, но делят между собой иконку в строке эффектов. Текущее число зарядов видно в иконке. Каждый заряд восстанавливает до 24,5\/31,5\/38,5\/45,5 единиц здоровья и маны за всю длительность. Убийство героя добавляет сразу 6 зарядов, которые восстанавливают до 147\/189\/231\/273 здоровья и маны за всю длительность.",
        "Каждый заряд действует независимо от других. Они не обновляются при появлении нового, но делят между собой иконку в строке эффектов. Текущее число зарядов видно в иконке.",
        "Каждый заряд восстанавливает до 24,5\/31,5\/38,5\/45,5 единиц здоровья и маны за всю длительность.",
        "Убийство героя добавляет сразу 6 зарядов, которые восстанавливают до 147\/189\/231\/273 здоровья и маны за всю длительность.",
        "Талант 20-го уровня добавляет к Heartstopper Aura уменьшение регенерации здоровья, но не уменьшение лечения или вампиризма.",
        "Периодический урон от способности уменьшается сопротивлением к магии"
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Heartstopper Aura",
      "cooldown": null,
      "description": "Герой останавливает сердца врагов вокруг, отчего они постепенно теряют часть максимального здоровья. Также на 0,5 сек. ускоряет восстановление здоровья и маны за каждое убитое существо.",
      "hot_key": "E",
      "params": [
        "Радиус: 800",
        "Уменьшение макс. здоровья в секунду: 0,6%\/1,2%\/1,8%\/2,4% (TagTalent 1,1%\/1,7%\/2,3%\/2,9%)",
        "Множитель урона от Ghost Shroud: 1 (TagAghanim 2)",
        "Зарядов за убийство героя: 6",
        "Зарядов за убийство не-героя: 1",
        "Восстановление здоровья за убийство: 3,5\/4,5\/5,5\/6,5",
        "Восстановление маны за убийство: 3,5\/4,5\/5,5\/6,5",
        "Длительность заряда: 7",
        "Длительность задержки ауры: 0,5",
        "Уменьшение регенерации здоровья: 32%",
        "Увеличивает урон от этой способности во время действия Ghost Shroud.",
        "Предотвращает появление новых зарядов. Уже действующие заряды продолжают давать дополнительную регенерацию здоровья и маны. Также отключает ауру.",
        "Иллюзии распространяют ауру и получают собственные заряды."
      ],
      "legacy_key": "I",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Necrophos_Death_Seeker.mp3\/revision\/latest?cb=20210101213914",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Снаряд летит со скоростью 900.",
        "Действуют те же примечания, что и для Death Pulse. Если Death Pulse не изучена, то при применении снаряд не выпустится, мана потратится и начнется перезарядка.",
        "Если Death Pulse не изучена, то при применении снаряд не выпустится, мана потратится и начнется перезарядка.",
        "Всего Death Seeker наносит 150\/225\/300\/375 урона и лечит 90\/120\/150\/180 (TagTalent 138\/168\/198\/228) (до уменьшений).",
        "Если цель при попадании снаряда неуязвима или спрятана, то Death Pulse не выпустится."
      ],
      "mana": "150",
      "item_behaviour": [],
      "name": "Death Seeker",
      "cooldown": "20",
      "description": "Выпускает в выбранного врага или союзника один быстрый и большой снаряд способности Death Pulse, лечение и урон которого увеличены на 50%. Долетев до цели, снаряд применит Death Pulse вокруг цели.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,67",
        "Дальность применения: 900",
        "Урон\/лечение цели: 150%",
        "Можно применить на союзника с иммунитетом к заклинаниям. Нельзя применить на врага с иммунитетом. Если враг получил иммунитет до попадания снаряда, то Death Pulse все равно применится.",
        "Блокируется при попадании.",
        ""
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a9\/Necrophos_Reaper%27s_Scythe.mp3\/revision\/latest?cb=20191216020948",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Урон рассчитывается и наносится в конце действия оглушения.",
        "Наносит достаточно урона для убийства героя (до уменьшений), если у цели максимум 41%\/44%\/47% от её здоровья.",
        "Если выбранная цель умирает от раскола Ice Blast, убийство не будет приписано Necrophos, если только он не оказался причиной, из-за которой произошел взрыв цели.",
        "Если выбранное существо было убито союзником, то убийство не считается за добивание — убийцей будет Necrophos.",
        "Можно применить к иллюзиям и крипам-героям."
      ],
      "mana": "200\/350\/500",
      "item_behaviour": [],
      "name": "Reaper's Scythe",
      "cooldown": "120",
      "description": "Оглушает выбранного вражеского героя, а затем наносит ему урон, пропорциональный отсутствующему у него здоровью. Герой, убитый этой способностью, возрождается на 15\/25\/35 сек. дольше обычного. Убийство врага под действием этой способности засчитывается её владельцу.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,55+1,3",
        "Дальность применения: 600",
        "Урон за единицу здоровья: 0,7\/0,8\/0,9",
        "Увеличение времени возрождения: 15\/25\/35",
        "Длительность оглушения: 1,5",
        "Нанесет урон, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 18.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Necrophos — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Способность, Death Pulse, создает вокруг Necrophos волну смерти, которая наносит урон врагам и исцеляет союзников. Вторая способность, Ghost Shroud, делает героя неуязвимым к физическому урону, а так-же увеличивает входящее лечение здоровья и маны на 75% и замедляет ближайших противников, при этом уменьшает сопротивление магии и запрещает герою атаковать. Пассивная способность, Heartstopper Aura, заставляет врагов поблизости периодически терять часть их максимального здоровья. Ультимативная способность, Reaper's Scythe, оглушает выбранного вражеского героя, а затем наносит ему урон, пропорциональный количеству отсутствующего у него здоровья. Герой, убитый этой способностью, будет возрождаться на 15\/25\/35 секунд дольше обычного. Убийство врага под действием этой способности засчитывается Necrophos. Улучшение с Aghanim's Scepter уменьшает перезарядку способности.",
  "history": "В годы ужасной чумы один безвестный монах с дурными наклонностями по имени Ротунд'йер неожиданно для себя занял пост кардинала: все другие претенденты на должность скоропостижно скончались. В то время как другие братья-монахи облегчали участь больных, новоиспечённый кардинал заседал в Соборе Румуска, обещая умирающим богачам духовное вознаграждение, коли те передадут свои земли их ордену. Со временем чума угасла, оставив лишь пару неуступчивых очагов, а на деяния Ротунд'йера обратила внимание высшая власть. Бывшего кардинала обвинили в ереси и отрядили ухаживать за чумными, где его медленно и мучительно пожрала бы болезнь. Но судьи не учли, что чума стала Ротунд'йеру родной. Хворь вошла в тело монаха — но не убила, а стала кормить его силы и превратила в сущего чумного мага, Епископа мора. Теперь он ходит по земле, распространяя свою эпидемию, и мощь его растёт с каждой деревней, сгинувшей в его губительном присутствии.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−2,5 сек. перезарядки Death Pulse",
      "talentRight": "+0,5% к к эффекту Heartstopper Aura"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+32 к снижению здоровья от Heartstopper Aura",
      "talentRight": "+15% к сопротивлению магии"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+32 к лечению от Death Pulse",
      "talentRight": "+24% к замедлению от Ghost Shroud"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8 к силе",
      "talentRight": "+100 к дальности применения Reaper's Scythe"
    }
  ]
}