{
  "abilities": [
    {
      "notes": [
        "Визуальные и звуковые эффекты в области применения во время анимации применения видны и слышны только союзникам",
        "Создает волны с интервалом в 1 секунду сразу после применения, вызывая 5 ( 8) волн",
        "Вопреки визуальным эффектам урон волн наносится мгновенно, а не при приземлении",
        "Дебафф горения наносит урон с интервалом в 1 секунду сразу после применения дебаффа, срабатывая 3 раза",
        "Эффект горения от нескольких применений не складывается\n Каждый интервал обновляет длительность, в результате получается 8 возможных интервалов горения",
        "С каждой волной Firestorm сначала наносит урон, затем применяет дебафф",
        "Не применяет дебафф горения к  Рошану, но наносит урон от волн",
        "Наносит до 150\/240\/330\/420 + 8%\/16%\/24%\/32% ( 225\/360\/495\/630 + 11%\/22%\/33%\/44%) урона от максимального здоровья (до уменьшений), если существо попало под все волны, а дебафф не был развеян",
        "С <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Firestorm можно применять на Underlord, но не на других существ\n После применения волны появляются не в месте применения, а в текущем местоположении Underlord\n ↓↓ Двойное нажатие автоматически выбирает себя"
      ],
      "item_behaviour": [],
      "description": "Обрушивает на указанную область волны пламени, наносящие урон врагам. Жертвы также получают периодический урон, зависящий от их максимального запаса здоровья.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,5+0,6 ( 0,25+0,85)",
        "Дальность применения: 600\/625\/650\/675",
        "Радиус: 425",
        "Число волн: 6 ( 9)",
        "Интервал волн: 1",
        "Урон от волны: 25\/40\/55\/70",
        "Макс\n здоровья в периодический урон: 1%\/2%\/3%\/4%",
        "Длительность горения: 2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Underlord_Firestorm_1.mp3\/revision\/latest?cb=20191216025834",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов ",
        "Урон: Магический"
      ],
      "mana": "12 (TagTalent 8)",
      "aghanim": null,
      "name": "Firestorm",
      "cooldown": "100\/110\/120\/130",
      "legacy_key": "F",
      "story": "Из темнейших глубин бездны вспыхивает пламя завоевания."
    },
    {
      "notes": [
        "Визуальные эффекты и звуки в выбранной области во время анимации применения видны и слышны только союзникам",
        "Применяет к целям оцепенение, предотвращая их передвижение, атаки и использование определенных заклинаний для передвижения\n Дает эффект True Sight на цели",
        "Периодически применяет оцепенение на каждого врага в области\n При этом модификатор Buff Placer предотвращает преждевременное оцепенение\n Этот модификатор применяется к любому существу в области, на которого он еще не действовал\n Модификатор длится 3,6 секунды\n При завершении действия к врагам мгновенно применяется оцепенение и скрытый модификатор\n То есть Pit of Malice не применяет оцепенение к каждому существу с установленным интервалом\n Оцепенение действует на существо каждые 3,6 секунды с момента попадания в область\n Скрытый модификатор не пропадает при покидании области\n То есть быстрое покидание, а затем возвращение в область не применит оцепенение мгновенно\n Все применения способности делят один и тот же модификатор, поэтому, попав под оцепенение от одного разлома, существо получает иммунитет к другим до завершения модификатора",
        "Действует на невидимых существ и существ в тумане войны",
        "Опутывает существо до 4 раз, если оно оставалось в области всю длительность, достигая длительность оцепенения до 4,8\/5,6\/6,4\/7,2 ( 7,4\/8,2\/9\/9,8) секунд",
        "Создает опутывающий визуальный эффект вокруг затронутых героев и иллюзий, но не вокруг других затронутых существ"
      ],
      "item_behaviour": [],
      "description": "Создаёт разлом в выбранной области. Любое попавшее в него существо цепенеет. Срабатывает на каждое вражеское существо лишь раз в 3,6 сек.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,45+0,6",
        "Дальность применения: 675",
        "Радиус эффекта: 400 ( 475)",
        "Интервал оцепенения: 3,6",
        "Длительность оцепенения: 1,2\/1,4\/1,6\/1,8 ( 1,85\/2,05\/2,25\/2,45)",
        "Длительность разлома: 12"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Underlord_Pit_of_Malice_1.mp3\/revision\/latest?cb=20191216025837",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов"
      ],
      "mana": "21\/19\/17\/15",
      "aghanim": null,
      "name": "Pit of Malice",
      "cooldown": "80\/100\/120\/140",
      "legacy_key": "T",
      "story": "Открытая ненависть Врогроша выворачивает реальность наизнанку, сковывая тех, кто отказывается повиноваться ему."
    },
    {
      "notes": [
        "Уменьшает только базовый урон и урон, даваемый основным атрибутом затронутого юнита\n Фиксированный дополнительный урон не уменьшается",
        "Эффект ауры задерживается на 0,5 сек",
        "Не важно как умрет враг, Underlord всегда получает урон, пока на цель действует дебафф",
        "Каждое увеличение урона за умершее существо длится определенное время\n Получение дополнительного урона не обновляет длительность предыдущих накоплений",
        "Дополнительный урон не исчезает при смерти Underlord",
        "Иконка статуса эффекта появляется, когда Underlord получает урон от ауры\n Эффект показывает сколько урона дает аура\n Оружие Underlord также начинает светиться и испускать зеленые частицы тем сильнее, чем больше накоплений получает герой",
        "Не получает дополнительный урон от смерти иллюзий, курьеров, строений, вардов,  Tempest Double и  нетленных зомби",
        "Если в радиусе несколько  Meepo, то Underlord получает урон только от одного из умерших клонов",
        "Считает крипов-героев за крипов",
        "Аура не влияет на неуязвимых и спрятанных существ",
        "Снижение урона не действует на врагов, если у них нет обзора на Underlord\n При этом Underlord продолжает получать дополнительный урон от смертей в радиусе ауры, даже если дебафф не отображается"
      ],
      "item_behaviour": [],
      "description": "Уменьшает базовый урон всех вражеских существ неподалёку. Если жертва способности погибнет, герой временно получит дополнительный урон.",
      "hot_key": "E",
      "params": [
        "Радиус: 900",
        "Снижение урона: 5%\/15%\/25%\/35%",
        "Доп\n урон за смерть героя: 30\/35\/40\/45",
        "Доп\n урон за смерть не-героя: 2\/4\/6\/8",
        "Длительность: 30\/45\/60\/75",
        "Длительность задержки ауры: 0,5",
        "Доп\n урон для союзных героев:  40%"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Врагов \/ Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Atrophy Aura",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Одно лишь присутствие Врогроша подрывает уверенность врагов в исходе битвы."
    },
    {
      "notes": [
        "Порталы нельзя размещать внутри фонтана (включая небольшую зону перед рампой) или в логове Рошана\n Нельзя размещать в непроходимой местности или в местах, закрытых деревьями\n При использовании союзники и враги получают уведомление на своей миникарте, показывая, где расположены порталы\n Порталы отмечены на карте зеленым цилиндром, если это союзный портал, или красным, если это вражеский портал\n Оба портала при создании обращены друг к другу, их эффекты частиц указывают друг на друга, показывая, в каком направлении находится другой портал\n Уничтожает деревья в радиусе 300 вокруг порталов при применении\n Порталы получают иммунитет к заклинаниям с помощью баффа, из-за чего враги могут уведомить об этом для отображения их оставшейся длительности\n Использование  Fiend's Gate заставляет  Underlord немедленно начать телепортацию, если не будет дана команда отмены (S)\n Щелчок правой кнопкой мыши (Rm) или приказ атаковать (A) на портал запускает его применение\n Только герои, клоны  Meepo,  Tempest Double и Vengeance Illusion могут использовать портал\n Невозможно начать применение во время безмолвия, однако безмолвие во время применения портала не прерывает его\n Во время применения персонаж перемещается к центру портала в течение 2 секунд, при этом скорость перемещения меняется в зависимости от расстояния к порталу\n По окончании применения персонаж телепортируется на другой портал\n Не избегает снарядов после телепортации\n Не прерывает очередь или приказы через ⇧ Shift после телепортации\n С <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter под обоими порталами и по центру создаётся  Pit of Malice на основе его текущего уровня\n Примечания  Pit of Malice полностью применимы\n Если  Pit of Malice не изучен, то разломы не появляются"
      ],
      "item_behaviour": [],
      "description": "Открывает два портала: один рядом с владельцем способности, а второй — в указанной точке. Герои могут использовать портал, чтобы после 3 секунд применения перенестись на его другой конец. Союзники, прошедшие через портал, некоторое время передвигаются быстрее и получают меньше урона. Минимальное расстояние между порталами должно составлять 2000.0.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0.45+0",
        "Радиус призыва: Глобальный",
        "Минимальное расстояние: 2000",
        "Дистанция начала телепортации:  300",
        "Время телепортация: 3",
        "Снижение урона: 14.0% \/ 22.0% \/ 30.0%",
        "Доп\n скорость передвижения: 10.0% \/ 20.0% \/ 30.0%",
        "Длительность эффекта: 5.0 \/ 6.0 \/ 7.0",
        "Время жизни портала: 20.0"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Underlord_Fiend%27s_Gate_1.mp3\/revision\/latest?cb=20220412214405",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Союзников \/ Врагов"
      ],
      "mana": "120\/110\/100",
      "aghanim": null,
      "name": "Fiend's Gate",
      "cooldown": "100",
      "legacy_key": "D",
      "story": "Они пришли без предупреждения, оставив на месте процветающих королевств лишь кровь и огонь."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 25.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.3,
    "attrAgilityInc": 1.6,
    "attrAgility": 12.0
  },
  "description": "50% урона от Atrophy Aura для союзных героев +0,65 сек. оцепенения от Pit of Malice +15% к снижению урона от Atrophy Aura +1% к периодическому урону от Firestorm −4 сек. перезарядки Firestorm +75 к радиусу Pit of Malice +100 к радиусу Firestorm +5 к броне",
  "history": "Сей рок не предрекала ни одна песнь, ни одна легенда. Глубоко под поверхностью внешнего мира лежат неведомые чудеса и ужасы. Закованный в земной тверди, далеко под беспокойными лавовыми полями и подножиями спящих вулканов раскинулся обсидиановый город Азийог, бесподобная каменная кладка которого простирается по безграничной пещере. В ячеистых стенах, построенных на костях бесчисленных рабов, лежат территории Орды бездны и её жестокого владыки, Врогроша. Вооружённый лучшими кузнецами своего вида и обученный управлять самим пространством, в непрерывной жажде власти он несет пламя и отчаяние в каждый мир, уничтожая или порабощая всё встреченное. Тем не менее, подземный мир невелик, и потому Врогрош обратил свой взор ко внешним просторам. Одним своим словом он обрек на погибель легионы своих разведчиков, отправив тех на растерзание обитателям поверхности, дабы оценить их мощь. Теперь же, готовый продолжить завоевание, Врогрош лично ступит на освещённую солнцем землю и провозгласит своё грядущее правление. Те же, кто встретятся ему, падут ниц и выплатят дань — или умрут на месте."
}