{
  "abilities": [
    {
      "notes": [
        "Talents are fully copied by the Divided We Stand clones.",
        "This attack damage talent is added as base attack damage. It benefits illusions, and is affected by every percentage-based damage increasing or reducing effects.",
        "It benefits illusions, and is affected by every percentage-based damage increasing or reducing effects.",
        "The strength talent effectively grants Meepo 120 health and 0.6 health regeneration.",
        "The evasion talent stacks multiplicatively with other sources of evasion.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1 Divided We Stand Clone",
          "talentRight": "+375 Health"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+8 Ransack Health Steal",
          "talentRight": "-3s Earthbind Cooldown"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+40 Poof Damage",
          "talentRight": "15% Evasion"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Base Damage",
          "talentRight": "+6 Strength"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5f\/Meepo_Earthbind_1.mp3\/revision\/latest?cb=20191216020328",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "The net travels at a speed of 900.",
        "With the maximum cast range and radius, Earthbind can hit units up to 720\/970\/1220\/1470 range away.",
        "Roots the targets, preventing them from moving and casting certain mobility spells. Provides True Sight and shared vision over the targets.",
        "Provides True Sight and shared vision over the targets.",
        "The net provides 300 radius flying vision around itself as it travels. This vision does not last.",
        "Fully affects invisible units and units inside the Fog of War."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "20\/16\/12\/8 (TagTalent 17\/13\/9\/5)",
      "description": "Tosses a net at the target point, rooting down all enemy units in an area around it.",
      "spellName": "Earthbind",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 500\/750\/1000\/1250",
        "Radius: 220",
        "Duration: 2",
        "Root effect persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Catching dinner in the Riftshadow Ruins can be quite the task."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Meepo_Poof_1.mp3\/revision\/latest?cb=20191216020330",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies \/ Self",
        "Damage Pure"
      ],
      "notes": [
        "Poof does not disjoint projectiles.",
        "Poof can only target self, clones and illusions of the caster. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Cannot directly target, but can still poof to invulnerable clones and illusions. Cannot Poof to hidden targets at all.",
        "When targeting ground, the Meepo closest to the target point is chosen upon cast (which can be the same Meepo who casts it).",
        "Poof deals its damage once at the cast location and once at the destination point. The damage from Poof stacks, so enemies within the cast location and destination point effectively take double the damage.",
        "The damage from Poof stacks, so enemies within the cast location and destination point effectively take double the damage.",
        "This is how much damage Poof can deal (before reductions) when a certain number of Meepos casts it at the same spot: 1 Meepo: 90\/120\/150\/180 (TagTalent 170\/200\/230\/260) 2 Meepos: 180\/240\/300\/360 (TagTalent 340\/400\/460\/520) 3 Meepos: 270\/360\/450\/540 (TagTalent 510\/600\/690\/780) 4 Meepos: 360\/480\/600\/720 (TagTalent 680\/800\/920\/1040) 5 Meepos: 450\/600\/750\/900 (TagTalent 850\/1000\/1150\/1300)",
        "1 Meepo: 90\/120\/150\/180 (TagTalent 170\/200\/230\/260)",
        "2 Meepos: 180\/240\/300\/360 (TagTalent 340\/400\/460\/520)",
        "3 Meepos: 270\/360\/450\/540 (TagTalent 510\/600\/690\/780)",
        "4 Meepos: 360\/480\/600\/720 (TagTalent 680\/800\/920\/1040)",
        "5 Meepos: 450\/600\/750\/900 (TagTalent 850\/1000\/1150\/1300)",
        "",
        ""
      ],
      "mana": "80",
      "hotKey": "W",
      "cooldown": "12\/10\/8\/6",
      "description": "Drawing mystical energies from the earth, a Meepo can teleport to another Meepo or itself after channeling for 1.5 seconds, dealing damage in both the departure and arrival locations.",
      "spellName": "Poof",
      "params": [
        "Cast Animation: 1.5+0",
        "Cast Range: Global",
        "Damage Radius: 400",
        "Damage: 45\/60\/75\/90 (TagTalent 85\/100\/115\/130)"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Sometimes breaking one of the Riftshadow Crystals can be just the trick for getting yourself out of a bind. Or your other self."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Meepo_Ransack_1.mp3\/revision\/latest?cb=20210109141441",
      "effects": [
        "Ability Passive",
        "Affects Enemies \/ Self",
        "Damage Pure"
      ],
      "notes": [
        "Deals pure damage to enemies on attack. The damage is applied before the attack damage.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "Heals all Meepoes, including the attacker himself, by a set amount. The actual damage dealt to the target does not matter. The heal counts as lifesteal, so that it is affected by lifesteal manipulation, but not by heal manipulation.",
        "The heal counts as lifesteal, so that it is affected by lifesteal manipulation, but not by heal manipulation.",
        "Does not work against Roshan.",
        "Treats creep-heroes as creeps."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Steals health from the enemy with each strike and heals all other Meepos for that amount.",
      "spellName": "Ransack",
      "params": [
        "Hero Health Steal: 6\/10\/14\/18 (TagTalent 14\/18\/22\/26)",
        "Creep Health Steal: 4\/6\/8\/10 (TagTalent 12\/14\/16\/18)",
        "Illusions neither can steal health, nor get healed by Meepo or a clone attacking."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "So you gonna need that, or...?"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Meepo_Dig_1.mp3\/revision\/latest?cb=20210101011436",
      "effects": [
        "Ability No Target \/ Channeled",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. This ability is not available in Ability Draft, since Divided We Stand is unavailable and Dig is bound to it.",
        "This ability is not available in Ability Draft, since Divided We Stand is unavailable and Dig is bound to it.",
        "Applies a basic dispel on the caster upon finishing the channeling.",
        "Stuns the caster for the duration, and turns them invulnerable and unselectable. Any attack or abilities targeting Meepo which is already in its attack or cast animation gets canceled. Does not prevent Spell Reflection from reflecting abilities back at Meepo.",
        "Any attack or abilities targeting Meepo which is already in its attack or cast animation gets canceled.",
        "Does not prevent Spell Reflection from reflecting abilities back at Meepo.",
        "Restores health in the form of health regeneration, increasing it by 10% of maximum health per second."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "40",
      "description": "Channels for 0.75 seconds and digs into the ground for 4 seconds, dispelling Meepo and causing him to be come invulnerable and untargetable for 4. Restores 40% of his max health over that duration. Can't be cast while rooted.",
      "spellName": "Dig",
      "params": [
        "Cast Animation: 0+0",
        "Channel Time: 0.75",
        "Max Health Restored: 40%",
        "Duration: 4",
        "Root prevents casting Dig. Does not stop the channeling if it already started."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive (TagAghanim Target Unit)",
        "Affects Self",
        "Damage Instant Kill"
      ],
      "notes": [
        "Unlike most other ultimates, Divided We Stand can be leveled up at level 4\/11\/18 instead of 6\/12\/18.",
        "Upon leveling, the Meepo clones always spawn with full health and mana next to Meepo prime, even when leveling from a clone.",
        "Meepo and his clones are represented each by an icon with health and mana bars for each on the top left corner of the screen. When a Meepo is selected, its icon becomes brighter. When a Meepo takes damage, its icon blinks red.",
        "When a Meepo is selected, its icon becomes brighter. When a Meepo takes damage, its icon blinks red.",
        "Clones benefit from talents bonuses, and from any attributes granted by items or buffs. However, they do not benefit from any other item bonuses (damage, health, armor, etc.). This also means that Attribute Bonus and the strength talent are effectively applied twice on Meepo clones. When Meepo prime loses attributes (to e.g. Decay or Intelligence Steal), the clones' attributes adapt. However, Meepo clones themselves are still subject to attribute loss and the other Meepos do not adapt to a clone losing attributes.",
        "However, they do not benefit from any other item bonuses (damage, health, armor, etc.).",
        "This also means that Attribute Bonus and the strength talent are effectively applied twice on Meepo clones.",
        "When Meepo prime loses attributes (to e.g. Decay or Intelligence Steal), the clones' attributes adapt.",
        "However, Meepo clones themselves are still subject to attribute loss and the other Meepos do not adapt to a clone losing attributes.",
        "When Meepo respawns with Reincarnation, all clones respawn next to the Meepo prime, and not at their death location.",
        "The level 25 talent automatically grants the extra Meepo clone and does not require Divided We Stand to be leveled.",
        "This ability is not available in Ability Draft."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "18\/16\/14",
      "description": "Meepo summons an imperfect, semi-autonomous duplicate of himself, which can gain gold and experience as he does and shares his experience, attributes and abilities. However, the clones cannot wield any items but the boots that Meepo himself wears. If any of the clones die, they all die.",
      "spellName": "Divided We Stand",
      "params": [
        "Number of Meepo Clones: 1\/2\/3 (TagTalent 2\/3\/4)",
        "Clone Experience Gain: 30%",
        "Meepo Clone Search Radius: 300",
        "Cast Range: 900",
        "Damage: 100",
        "Slow: 50%",
        "Slow Duration: 3",
        "Grants a new ability: Dig.",
        "Divided we Stand can be cast from any Meepo as long as there's another Meepo within 300 radius, causing the nearby Meepo to fling you towards a target within 900 range, dealing 100 damage and slowing the target's movement speed by 50% for 3s. (TagTalentEach Meepo has its own independent cooldown)"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Do I know you?"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.6,
    "attrStrength": 24.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.6,
    "attrAgility": 17.0
  },
  "description": "Meepo, the Geomancer, is a melee agility hero who is notorious for being one of the most difficult carries in the game to play effectively due to his heavy reliance on micromanagement. Meepo's defining ultimate, Divided We Stand, allows Meepo to create up to 3 additional clones of himself, (4 with the level 25 talent), each of which has its own mana and hit points, as well as individual cooldowns on Meepo's spells. The clones cannot use any items besides the boots that the main Meepo himself wears, but each clone can gain experience and gold additively with the original Meepo, allowing him to gain levels and gold extremely fast. This means that a well-played Meepo can gain experience faster than any other hero, capable of reaching maximum level extremely early into the game and overpowering his unsuspecting opponents; however, Meepo's greatest strength is also his greatest weakness, as the death of any Meepo, including the clones, spells death for all Meepos.",
  "history": "\"If you ask me, life is all about who you know and what you can find. When you live up in the Riftshadow Ruins, just finding food can be tough. So you need to cut corners, you need to scrounge, you need to know your strengths. Some of the beasts up there can kill you, so you need a way to trap the weak and duck the strong. On the upside, the ruins have history, and history is worth a lot to some people. There used to be a palace there, where they had all these dark rituals. Bad stuff. If you survived the ceremony, they would shatter a crystal and split your soul into pieces. They made great art though! Sculptures and such. Let me tell you: sometimes you stumble onto some of those old carvings. Take a pack full of those to town and sell them, then get yourself food for a few weeks. If luck is really on your side, you might find a Riftshadow crystal. Get it appraised and start asking around. Someone always knows some crazy fool looking for this kind of thing. If all else fails, sell it to a Magus the next time one's in town. They love that stuff. Still, whatever you do, be careful handling those crystals. You do not want one to go off on you. It really hurts.\"",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1 Divided We Stand Clone",
      "talentRight": "+375 Health"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+8 Ransack Health Steal",
      "talentRight": "-3s Earthbind Cooldown"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+40 Poof Damage",
      "talentRight": "15% Evasion"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Base Damage",
      "talentRight": "+6 Strength"
    }
  ]
}