{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Urn_of_Shadows_Soul_Release.mp3\/revision\/latest?cb=20191227195544",
      "effects": [
        "Cast Range: 750",
        "Charge Gain Radius: 1400",
        "Ally Health Regen Bonus: 30",
        "Enemy Damage per Second: 25",
        "Duration: 8"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "Successive casts on the same target do not stack but refresh the duration instead. The buff and debuff are independent and stack with each other, although the heal gets canceled as soon as the damage ticks.",
        "The buff and debuff are independent and stack with each other, although the heal gets canceled as soon as the damage ticks.",
        "Both Urn of Shadows' and Spirit Vessel's heal and damage debuffs do not stack, with Spirit Vessel's modifiers overriding both of Urn of Shadows' modifiers. When attempting to do so, Urn of Shadows goes on cooldown, without losing charges.",
        "When attempting to do so, Urn of Shadows goes on cooldown, without losing charges.",
        "Can regenerate up to 240 health over its full duration.",
        "Deals 25 damage in 1-second intervals, starting 1 second after cast, resulting in 8 damage instances. Can deal a total of 200 damage to the target (before reductions).",
        "Can deal a total of 200 damage to the target (before reductions).",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan dispels the healing effect, but not the damaging effect. Does not get dispelled by damage flagged as HP Removal.",
        "Does not get dispelled by damage flagged as HP Removal.",
        "Can only be cast on heroes (including illusions and clones) and creep-heroes.",
        "When no charges are left, Soul Release gains 2 charges from the next enemy hero's death instead of 1. Does not gain charges if the dying hero has Reincarnation, is an illusion, or the Tempest Double. Soul Release charges cannot be gathered by clones, illusions, and creep-heroes.",
        "Does not gain charges if the dying hero has Reincarnation, is an illusion, or the Tempest Double.",
        "Soul Release charges cannot be gathered by clones, illusions, and creep-heroes.",
        "When having multiple Urn of Shadows and\/or Spirit Vessels, the one in the higher inventory slot gains charges. The top left inventory slot has the highest priority, the bottom right one the lowest. Cannot gain charges while inside the backpack. When multiple heroes in a team have Urn of Shadows, the hero who is closest to the dying enemy hero gains charges. Shares cooldown with Spirit Vessel. All current charges are carried over when upgrading Urn of Shadows-based items.",
        "The top left inventory slot has the highest priority, the bottom right one the lowest.",
        "Cannot gain charges while inside the backpack.",
        "When multiple heroes in a team have Urn of Shadows, the hero who is closest to the dying enemy hero gains charges.",
        "Shares cooldown with Spirit Vessel.",
        "All current charges are carried over when upgrading Urn of Shadows-based items."
      ],
      "mana": "0",
      "abilityName": "Soul Release",
      "cooldown": "7",
      "description": "Provides 30 health regeneration when cast on allies, and deals 25 damage per second when cast on enemies. Lasts 8 seconds. Gains charges every time an enemy hero dies within 1400 units. Only the closest Urn to the dying hero will gain a charge.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "40 health and 0.2 health regeneration.",
    "24 mana and 0.1 mana regeneration.",
    "2 attack speed and 0.33 main armor.",
    "2 main attack damage to all \/ \/ heroes."
  ],
  "cost": "880",
  "lore": null,
  "consistFrom": [
    "Sage's Mask",
    "Circlet",
    "Ring of Protection",
    "Recipe"
  ],
  "name": "Urn of Shadows",
  "description": "Contains the ashes of powerful demons.",
  "trivia": null,
  "upgradeIn": [
    "Spirit Vessel"
  ],
  "tips": [
    "Urn of Shadows is a great item to have when going for a heavy ganking lineup, as it helps heal any damage taken while finishing off any low health enemies."
  ]
}