{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/14\/Lone_Druid_Summon_Spirit_Bear.mp3\/revision\/latest?cb=20191216015759",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя",
        "Урон: Чистый"
      ],
      "notes": [
        "Чтобы посмотреть все характеристики духа-медведя, перейдите сюда.",
        "Медведь — крип-герой, поэтому некоторые способности действуют на него иначе. Для более подробной информации перейдите по ссылке.",
        "При первом применении Summon Spirit Bear призывается медведь. Каждое следущее использование просто его лечит или воскрешает. То есть баффы и дебаффы не развеиваются при повторном призыве. Медведь не избегает снарядов.",
        "То есть баффы и дебаффы не развеиваются при повторном призыве. Медведь не избегает снарядов.",
        "Урон по себе от смерти медведя наносит чистый урон, приписываемый существу, убившему духа-медведя. Добивание духа-медведя не наносит урон, если только он не умер от нейтральных крипов.",
        "Добивание духа-медведя не наносит урон, если только он не умер от нейтральных крипов.",
        "Духа-медведя нельзя перепризвать к себе, если тот получил в течение последних 3 секунд урон от игрока. Для урона нет минимального порога. Урон проверяется до любого вида уменьшения, поэтому даже полностью заблокированный урон предотвращает призыв к заклинателю. Если дух-медведь умер, то его можно мгновенно призвать.",
        "Урон проверяется до любого вида уменьшения, поэтому даже полностью заблокированный урон предотвращает призыв к заклинателю.",
        "Если дух-медведь умер, то его можно мгновенно призвать.",
        "Дух-медведь может использовать любой предмет, но не может устанавливать Observer Ward и Sentry Ward. Также может использовать руны.",
        "При использовании духом-медведем Hand of Midas золото и опыт даются Lone Druid.",
        "Дух-медведь не призывает иллюзии, поэтому руна иллюзий и Manta Style их не создают.",
        "Когда дух-медведь отходит от Lone Druid на расстояние, превышающее 1100, медведь получает обезоруживание, становится серым и использует другие анимации. Серый оттенок и значок обезоруживания видны только союзникам. Анимации видны всем.",
        "Серый оттенок и значок обезоруживания видны только союзникам. Анимации видны всем.",
        "В форме True Form способность использует остаточную анимацию в 0,57 секунды."
      ],
      "mana": "120",
      "item_behaviour": [],
      "name": "Summon Spirit Bear",
      "cooldown": "75",
      "description": "Призывает могучего медведя, который может использовать предметы. Он не может атаковать, если расстояние до владельца больше 1100. Если медведь погибнет, герой получит урон в размере 20% от своего максимального здоровья. Сила, ловкость или интеллект от предметов не влияют на медведя. У медведя есть способности Return, Demolish и Entangling Roots.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,5+0,63",
        "Макс. здоровья в урон заклинателю от смерти: 20%",
        "Дальность для атаки врагов: 1100 ( Глобальная)",
        "Бонус к здоровью за уровень: 90",
        "Бонус к урону от атаки за уровень: 5",
        "Длительность: Постоянно"
      ],
      "legacy_key": "B",
      "story": "Вечный компаньон Силлы един с его духом и сердцем, приходя ему на помощь в любое время."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Lone_Druid_Spirit_Link.mp3\/revision\/latest?cb=20191216015758",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "notes": [
        "Использует вампиризм, но вместо лечения духа-медведя лечит владельца способности. На эффект действует усиление вампиризма, но только если источник усиления находится у Lone Druid.",
        "На эффект действует усиление вампиризма, но только если источник усиления находится у Lone Druid.",
        "Визуальные эффекты улучшения способности появляются только в случае, если дух-медведь находится в 1500 единицах от Lone Druid.",
        "Spirit Link действует только на владельца способности и его дух-медведя, но не на других подконтрольных существ. Правило действует и в режиме Ability Draft."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Spirit Link",
      "cooldown": null,
      "description": "Связывает медведя с его владельцем, увеличивая скорость атаки обоих. Урон, наносимый медведем, восстанавливает здоровье владельцу.",
      "hot_key": "W",
      "params": [
        "Доп. скорость атаки: 15\/30\/45\/60",
        "Общий вампиризм: 20%\/35%\/50%\/65%",
        "Общая броня: 8%\/12%\/16%\/20%"
      ],
      "legacy_key": "R",
      "story": "Силла бодрится в присутствии своего компаньона, ощущая прилив сил с каждым взмахом медвежьих когтей."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Lone_Druid_Savage_Roar.mp3\/revision\/latest?cb=20191216015752",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов"
      ],
      "notes": [
        "Эффект всегда применяется вокруг Lone Druid и духа-медведя, независимо от того, кто из них использовал заклинание. При этом, если кто-либо их них не может применить способность (например, из-за оглушения или безмолвия), то эффект не применится. Перезарядка всегда запускается, независимо от результата.",
        "При этом, если кто-либо их них не может применить способность (например, из-за оглушения или безмолвия), то эффект не применится.",
        "Перезарядка всегда запускается, независимо от результата.",
        "Применяет эффект страха ко всем врагам в радиусе, заставляя их бежать к своему фонтану и предотвращая совершение каких-либо действий.",
        "Действует только на вражеских существ, подконтрольных игроку. Не действует на существ под контролем ИИ (линейных и нейтральных крипов).",
        "Делит перезарядку с Savage Roar у духа-медведя.",
        "В режиме Ability Draft для применения духом-медведем страха должна быть выбрана Savage Roar."
      ],
      "mana": "38\/32\/26\/20 (TagTalent 30\/24\/18\/12)",
      "item_behaviour": [],
      "name": "Savage Roar",
      "cooldown": "50",
      "description": "Герой и его медведь издают яростный рёв, заставляя врагов в ужасе бежать к своей базе. Скорость передвижения жертв увеличивается на 20%.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0,57",
        "Радиус: 325",
        "Доп. скорость передвижения противника: 20%",
        "Длительность: 1,2\/1,6\/2\/2,4"
      ],
      "legacy_key": "E",
      "story": "Силла изучает искусства забытого клана Медведя, усиливая свое родство с дикой природой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/28\/Lone_Druid_True_Form.mp3\/revision\/latest?cb=20191216015802",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "Во время трансформации Lone Druid не может ничего сделать. Также её нельзя прервать.",
        "Уменьшает базовую дальность атаки до 225, присваивая герою ближний тип атаки. То есть, предметы будут считать его за героя ближнего боя (например, Manta Style, Skull Basher и прочие).",
        "То есть, предметы будут считать его за героя ближнего боя (например, Manta Style, Skull Basher и прочие).",
        "Максимальное и текущее здоровье Lone Druid увеличиваются на заданное значение. Действие не считается за лечение.",
        "В форме Lone Druid получает Demolish и Entangling Claws того же уровня, что и у духа-медведя.",
        "True Form остается после смерти Lone Druid. Если способность была активна на момент смерти, герой возродится в форме True Form.",
        "Меняет модель и голос Lone Druid."
      ],
      "mana": "100 (TagTalent 50)",
      "item_behaviour": [],
      "name": "True Form",
      "cooldown": "200",
      "description": "Герой приобретает способность превращаться в разъярённого медведя. При этом он переходит из дальнего боя в ближний, но получает увеличенное сопротивление, а также способности Entangling Roots и Demolish.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Время трансформации: 1,933",
        "Дополнительная броня: 8\/10\/12",
        "Дополнительное здоровье: 500\/1000\/1500 ( 1500\/2000\/2500)",
        "Уменьшение дальности атаки: 325",
        "Длительность: 40"
      ],
      "legacy_key": "F",
      "story": "Могучий медведь — царь леса, удерживающий трон грубой силой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f4\/Lone_Druid_Spirit_Bear_Return.mp3\/revision\/latest?cb=20191216015757",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "При телепортации позволяет избегать снаряды.",
        "Можно применить в любой точке карты.",
        "После телепортации отдает команду «стоп» для духа-медведя.",
        "Если при использовании Return Lone Druid умирает, то дух-медведь телепортируется к месту смерти героя."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Return",
      "cooldown": null,
      "description": "После подготовки в 3 сек. переносит медведя обратно к владельцу.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Время возврата: 3"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5f\/Lone_Druid_Spirit_Bear_Entangling_Claws.mp3\/revision\/latest?cb=20191216015754",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Применяет к цели оцепенение, препятствуя её движению и использованию определенных способностей для передвижения. Раскрывает невидимость цели.",
        "Раскрывает невидимость цели.",
        "Спровоцировавшая атака сначала применяет дебафф, а затем — урон.",
        "Наносит 6\/8\/10\/12 урона в 0,2-секундных интервалах, начиная после наложения дебаффа, нанося урон 6\/9\/12\/15 раз. Всего наносит 36\/72\/120\/180 урона (до уменьшений).",
        "Всего наносит 36\/72\/120\/180 урона (до уменьшений).",
        "Не действует на древних крипов.",
        "Entangling Claws использует псевдослучайное распределение."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Entangling Claws",
      "cooldown": null,
      "description": "Каждая атака может запутать врага в корнях, не позволяя ему двигаться и ежесекундно нанося урон.",
      "hot_key": "?",
      "params": [
        "Шанс срабатывания: 20%",
        "Урон в секунду: 30\/40\/50\/60",
        "Длительность: 1\/1,6\/2,2\/2,8"
      ],
      "legacy_key": "",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Lone_Druid_Savage_Roar.mp3\/revision\/latest?cb=20191216015752",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов"
      ],
      "notes": [
        "Все примечания к способности Savage Roar у Lone Druid таким же образом относятся и к способности медведя.",
        "Дух-медведь получает эту способность, как только её изучит Lone Druid."
      ],
      "mana": "38\/32\/26\/20 (TagTalent 28\/22\/16\/10)",
      "item_behaviour": [],
      "name": "Savage Roar",
      "cooldown": "50",
      "description": "Герой и его медведь издают яростный рёв, заставляя врагов в ужасе бежать к своей базе. Скорость передвижения жертв увеличивается на 20%.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0,64",
        "Радиус: 325",
        "Доп. скорость передвижения противника: 20%",
        "Длительность: 1,2\/1,6\/2\/2,4"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя \/ Врагов"
      ],
      "notes": [
        "Повышает итоговое сопротивление магии духа-медведя до 33%. Сочетается по закону убывающей полезности с другими источниками сопротивления магии.",
        "Сочетается по закону убывающей полезности с другими источниками сопротивления магии.",
        "Бонусный урон от атаки по постройкам от Demolish добавляется как бонусный условный урон от атаки поверх рассчитанного итогового урона от атаки. Итоговый урон от атаки включает все уже существующие изменения урона от атаки, включая источники бонусного условного урона от атаки (например, Quell). Это можно определить как ΣАтак × 110%\/120%\/130%\/140% Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он всё ещё учитывается и напрямую добавляется к урону от атаки существа. Его можно уменьшить лишь прямыми снижениями (например, блокировкой урона). Так как урон считается бонусным уроном от атаки, то на него не влияют процентные бонусы или снижения урона от атаки.",
        "Итоговый урон от атаки включает все уже существующие изменения урона от атаки, включая источники бонусного условного урона от атаки (например, Quell).",
        "Это можно определить как ΣАтак × 110%\/120%\/130%\/140%",
        "Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он всё ещё учитывается и напрямую добавляется к урону от атаки существа.",
        "Его можно уменьшить лишь прямыми снижениями (например, блокировкой урона).",
        "Так как урон считается бонусным уроном от атаки, то на него не влияют процентные бонусы или снижения урона от атаки."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Demolish",
      "cooldown": null,
      "description": "Мощь духа-медведя позволяет ему наносить повышенный урон постройкам, а также делает его менее восприимчивым к магии.",
      "hot_key": "?",
      "params": [
        "Доп. сопротивление магии: 33%",
        "Доп. урон постройкам: 10%\/20%\/30%\/40%"
      ],
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 18.0,
    "attrIntelligence": 13.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.8,
    "attrAgility": 20.0
  },
  "description": "Дух-медведь  Здоровье 1100\/1400\/1700\/2000 +5\/6\/7\/8 ⤷ 2100\/2400\/2700\/3000здоровья Мана 300 +0,5 Уровень 1 Длительность Постоянно Броня 3\/4\/5\/6 ( 11\/12\/13\/14) Сопр. магии 0% Сопр. эффектам 0% Урон от атаки Link▶️ По умолчанию 36 Дальность атаки 150 Дальность обнар. 500 Скорость атаки ? 100 • 1,75\/1,65\/1,55\/1,45 с. БВА ( 1,65\/1,55\/1,45\/1,35 с. БВА) Анимация атаки 0,43+0,4 Скорость снаряда Мгновенная Скорость передв. Link▶️ 340\/360\/380\/400 (100) ( 365\/385\/405\/425) Скорость повор. 0,6 Размер столкн. 24 Дальность обзора (Н) 1400 • 800 Награда 300 Опыт 300 Способности Return Demolish Savage Roar Entangling Claws Примечания Имеет инвентарь и ранец. ⤷ 2100\/2400\/2700\/3000здоровья  1  Постоянно  3\/4\/5\/6 ( 11\/12\/13\/14)  0%  0% Link▶️ По умолчанию 36  150  500 ? 100 • 1,75\/1,65\/1,55\/1,45 с. БВА ( 1,65\/1,55\/1,45\/1,35 с. БВА)  0,43+0,4  Мгновенная Link▶️ 340\/360\/380\/400 (100) ( 365\/385\/405\/425)  0,6  24 (Н) 1400 • 800  300  300  Return Demolish Savage Roar Entangling Claws Имеет инвентарь и ранец.",
  "history": "Друидский Клан Медведя процветал задолго до первых слов самых ранних исторических сказаний. Мудры и справедливы были его члены, и стремились они понить порядки природы. Высшие силы природы узрели это и призвали самого просвещённого друида к себе. Мудрый старец Силла, судья и провидец клана, выступил из рядов своих соплеменников и получил дар, а вместе с ним наставление: «Когда весь мир угаснет, когда цивилизация покинет эти земли, когда мир будет повержен и испещрён бесграничными пустынями конца времён, посади Семя». Преисполнившись верой, Силла почувствовал, как вес лет на его плечах стал легче, а жизненные силы вернулись в тело. В разум его впиталось непомерное знание. Он стал способен воплощать свою волю в материи и менять свобственную физическую форму усилием воли. Но злые языки и податливые уши донесли весть о Семени и его мощи до других людей, и те обрушились страшной войной на Клан Медведя. Шли годы... Легенды и даже само время позабыли про Клан Медведя, позабыли про Силлу и Семя, позабыли великие цивилизации, расцветшие и сгинувшие после Клана. Тысячи лет Силла ждал: ждал весточки от своих божеств, ждал мира в неизменно воинствующих землях, ждал в отшельничестве и в тайне ото всех, ждал конца сущего и завершения своей священной миссии, всегда готовый уничтожить то, что помешало бы свершить посев."
}