{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на силу в общем даёт Dazzle: 400 здоровья и 2 восстановления здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+0,5 к снижению брони от Bad Juju",
          "talentRight": "−32% к скорости врагов от Poison Touch"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 к урону в секунду от Poison Touch",
          "talentRight": "250 лечения по окончании Shallow Grave"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+60 к скорости атаки",
          "talentRight": "+20 к силе"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1,75 маны в секунду",
          "talentRight": "+50 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/39\/Poison_Touch.mp3\/revision\/latest?cb=20141212110654",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Снаряд Poison Touch летит со скоростью 1300.",
        "Может задеть существ на расстоянии до 1000 (складывается из начального радиуса, расстояния и конечного радиуса).",
        "Конечная область по форме напоминает конус, исходящий от Dazzle.",
        "Цели в области действия выбираются не случайно: способность выбирает ближайшие подходящие цели от первичной в области конуса.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 2%\/2.5%\/3%\/3.5% раз.",
        "Может нанести до 64\/140\/240\/364 (TagTalent 224\/340\/480\/644) единиц урона каждой цели, если действие способности не обновлялось (до уменьшения).",
        "Несколько применений Poison Touch складываются.",
        "Bad Juju снижает перезарядку до: Уровень 1: 19,98\/17,76\/15,54\/13,32 Уровень 2: 16,74\/14,88\/13,02\/11,16 Уровень 3: 13,5\/12\/10,5\/9",
        "Уровень 1: 19,98\/17,76\/15,54\/13,32",
        "Уровень 2: 16,74\/14,88\/13,02\/11,16",
        "Уровень 3: 13,5\/12\/10,5\/9"
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "Q",
      "cooldown": "27\/24\/21\/18",
      "description": "Выпускает конус яда, поражающий нескольких врагов. Наносит жертвам периодический урон и замедляет их, а атаки владельца способности обновляют время действия эффекта и усиливают замедление.",
      "spellName": "Poison Touch",
      "params": [
        "Анимация применения: 0,3+0,57",
        "Дальность применения: 500\/600\/700\/800 (TagTalent 520\/620\/720\/820)",
        "Начальный радиус: 200",
        "Максимальное расстояние: 500",
        "Конечный радиус: 300",
        "Количество целей: 2\/4\/6\/8",
        "Урон в секунду: 16\/28\/40\/52 (TagTalent 56\/68\/80\/92)",
        "Замедление скорости передвижения: 16%\/18%\/20%\/22% (TagTalent 48%\/50%\/52%\/54%)",
        "Замедление за атаку: 2%\/2.5%\/3%\/3.5%",
        "Длительность: 4\/5\/6\/7",
        "Способность превращает жертв в зверушек на 1,25 секунды.",
        "Замедление остается и наносит урон, если дебафф был применен до иммунитета к заклинаниям и не был ранее развеян.",
        "Блокируется при применении только первичной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e3\/Shallow_Grave.mp3\/revision\/latest?cb=20141212110707",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Предотвращает смерть цели путем приравнивания её минимального здоровья к 1. То есть цель не может умереть от урона (даже отмеченного как отнимающий здоровье), поэтому способность предотвращает смерть от отложенного False Promise урона. Не защищает от смертельного урона Culling Blade или завершения действия задержки от Reincarnation. Не дает Ice Blast расколоть цель, если способность применена до преодоления порога здоровья.",
        "То есть цель не может умереть от урона (даже отмеченного как отнимающий здоровье), поэтому способность предотвращает смерть от отложенного False Promise урона.",
        "Не защищает от смертельного урона Culling Blade или завершения действия задержки от Reincarnation.",
        "Не дает Ice Blast расколоть цель, если способность применена до преодоления порога здоровья.",
        "Технически получаемый урон не уменьшается, поэтому любой источник урона учитывается полностью.",
        "Можно применить на иллюзии и крипов-героев.",
        "Bad Juju снижает перезарядку до: Уровень 1: 44,4\/34,04\/23,68\/13,32 Уровень 2: 37,2\/28,52\/19,84\/11,16 Уровень 3: 30\/23\/16\/9",
        "Уровень 1: 44,4\/34,04\/23,68\/13,32",
        "Уровень 2: 37,2\/28,52\/19,84\/11,16",
        "Уровень 3: 30\/23\/16\/9"
      ],
      "mana": "150",
      "hotKey": "W",
      "cooldown": "60\/46\/32\/18",
      "description": "Накладывает на союзника священную защиту, не позволяющую ему умереть.",
      "spellName": "Shallow Grave",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 550\/700\/850\/1000 (TagTalent 570\/720\/870\/1020)",
        "Длительность: 4.0\/4.5\/5.0\/5.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/04\/Shadow_Wave.mp3\/revision\/latest?cb=20141212110700",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Физический"
      ],
      "notes": [
        "У Shadow Wave нет задержки для отскоков, поэтому все цели вылечатся одновременно.",
        "Порядок приоритета: раненые союзные герои > раненые союзные существа не-герои (включая иллюзии) > союзные герои > существа не-герои. Чем ниже здоровье ближайших союзников, тем выше приоритет их лечения. То есть самое раненное существо получит лечение первым. Если у нескольких существ одинаковые критерии выбора (например, поблизости только существа не-герои с полным здоровьем), то цели будут выбраны случайно.",
        "Чем ниже здоровье ближайших союзников, тем выше приоритет их лечения. То есть самое раненное существо получит лечение первым.",
        "Если у нескольких существ одинаковые критерии выбора (например, поблизости только существа не-герои с полным здоровьем), то цели будут выбраны случайно.",
        "Независимо от цели, сам Dazzle всегда получает лечении без расчета количества целей отскока, исцеляя 4\/5\/6\/7 существ.",
        "В общем может исцелить до 320\/500\/720\/980 (TagTalent 560\/800\/1080\/1400) здоровья за все отскоки.",
        "Радиус урона считает за центр каждое излеченное существо. Вражеское существо может получить урон от всех излеченных существ за раз.",
        "Может нанести до 320\/500\/720\/980 (TagTalent 560\/800\/1080\/1400) урона одному существу (до уменьшений).",
        "Bad Juju снижает перезарядку до: Уровень 1: 10,36\/8,88\/7,4\/5,92 Уровень 2: 8,68\/7,44\/6,2\/4,96 Уровень 3: 7\/6\/5\/4",
        "Уровень 1: 10,36\/8,88\/7,4\/5,92",
        "Уровень 2: 8,68\/7,44\/6,2\/4,96",
        "Уровень 3: 7\/6\/5\/4"
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "E",
      "cooldown": "14\/12\/10\/8",
      "description": "Выпускает мощный заряд, который передаётся от союзника к союзнику, излечивая их и нанося урон противникам неподалёку. Способность всегда лечит своего владельца.",
      "spellName": "Shadow Wave",
      "params": [
        "Анимация применения: 0,3+0,57",
        "Дальность применения: 800 (TagTalent 820)",
        "Радиус урона: 185",
        "Радиус отскока: 475",
        "Количество отскоков: 3\/4\/5\/6",
        "Лечение: 80\/100\/120\/140 (TagTalent 140\/160\/180\/200)",
        "Урон: 80\/100\/120\/140 (TagTalent 140\/160\/180\/200)",
        "Увеличивает лечение и урон от способности на 100"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Weave.mp3\/revision\/latest?cb=20141212110713",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "Складывается мультипликативно с другими источниками уменьшения перезарядки.",
        "Снижает броню врагов до срабатывания активировавшего заклинания .",
        "Действует на невидимых существ и существ в тумане войны. Не действует на неуязвимых или спрятанных.",
        "Не действует на Рошана.",
        "Не срабатывает от активных способностей предметов, заклинаний с нулевой перезарядкой или на которые не реагируют эффекты, срабатывающие от применения.",
        "Накладывает один дебафф на врагов. Дебафф становится сильнее с каждым обновлением от успешного применения. Число в иконке отображает, сколько раз обновлялся дебафф, включая первое применение.",
        "Число в иконке отображает, сколько раз обновлялся дебафф, включая первое применение."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Уменьшает перезарядку способностей и предметов. Каждое применение заклинания уменьшает броню врагов неподалёку. При этом эффект складывается, а время действия обновляется.",
      "spellName": "Bad Juju",
      "params": [
        "Уменьшение перезарядки: 26%\/38%\/50%",
        "Радиус: 1200",
        "Снижение брони за применение: 2\/2.25\/2.5 (TagTalent 2,5\/2,75\/3)",
        "Длительность: 8",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 18.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 1.7,
    "attrAgility": 21.0
  },
  "description": "Dazzle — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первая способность, Poison Touch, накладывает отравляющее заклинание на вражеского юнита, которое наносит переодический урон, и всё сильнее замедляет с каждой атакой владельца. Второй способностью, Shallow Grave, герой кидает крест на союзника, после чего он не может умереть независимо от того, как он близок к смерти. Третья способность, Shadow Wave, выпускает мощный заряд, который передается от союзника к союзнику и наносит урон противникам, находящимся неподалеку. Его ультимативная способность, Bad Juju является пасивной и позволяет герою чаще использовать все его заклинания и предметы, а также уменьшает броню противников при использовании способностей. Aghanim's Scepter улучшает способность Shadow Wave, что позволяет ему снимать отрицательные эффекты со своих союзников.",
  "history": "Прежде чем назваться жрецом теней, каждый юный послушник ордена Дезун должен пройти несколько ритуалов. Последний из них, ритуал теней, представляет собой опасное путешествие в мир Нотл, непредсказуемую реальность, откуда возвращается далеко не каждый. Часть тех, что возвращались, теряли рассудок. У других проявлялись странные способности. Но так или иначе, всякий, кто попадал в мир Нотл, бесповоротно изменялся. Одного послушника — самого юного среди тех, кто когда-либо стремился пройти ритуал, — орден поначалу отвергал, называя слишком молодым. Но юнца было не отговорить. Всё же увидев что-то особенное в упрямом послушнике, старейшины уступили ему. Он выпил священное зелье и сел у ночного огня, пока племя исполняло ритуальный танец. В отражении мира Нотл, куда попал юнец, признаки света и тени поменялись местами. Поэтому на самом деле приятно мерцающий целительный свет — воплощение зла, и в его завораживающих отблесках происходят самые кошмарные события. Провидение старейшин оказалась пророческим: послушник вернулся жрецом теней невиданной силы, способный как исцелять, так и убивать. И теперь его дар сокрушает врагов и спасает союзников.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+0,5 к снижению брони от Bad Juju",
      "talentRight": "−32% к скорости врагов от Poison Touch"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 к урону в секунду от Poison Touch",
      "talentRight": "250 лечения по окончании Shallow Grave"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+60 к скорости атаки",
      "talentRight": "+20 к силе"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1,75 маны в секунду",
      "talentRight": "+50 к урону"
    }
  ]
}