{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Skull_Basher.mp3\/revision\/latest?cb=20141214201224",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Не сочетается с другим Abyssal Blade, Skull Basher.",
        "При наличии нескольких предметов со способностью Bash, работать будет та, которая дольше находится в инвентаре.",
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Бонусный урон от Bash может использоваться вампиризмом. Однако, не может быть критическим или прорубающим.",
        "Урон можно уменьшить с Static Link. Однако его нельзя усилить с помощью Empower или Руна двойного урона.",
        "Однако его нельзя усилить с помощью Empower или Руна двойного урона.",
        "В среднем добавляет 25 урона каждой атаке для героев ближнего боя, и 10 урона для героев дальнего боя.",
        "Не работает против вардов и строений, но работает против союзных юнитов.",
        "Bash использует псевдослучайное распределение."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": "2,3",
      "description": "Каждая атака может оглушить цель на 1,5 сек. и нанести 100 физического урона. Вероятность зависит от типа атаки владельца: 25% в ближнем бою, 10% — в дальнем.",
      "params": [
        "Шанс для героев ближнего боя: 25%",
        "Шанс для героев дальнего боя: 10%",
        "Урон: 100",
        "Длительность оглушения: 1,5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 200 здоровья, 1 регенерации здоровья и 35 урона от атаки.",
    "Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья и 25 урона от атаки.",
    "Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья и 25 урона от атаки.",
    "У Slardar, Spirit Breaker или Faceless Void Bash не может сработать."
  ],
  "cost": "2950",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Belt of Strength",
    "Recipe"
  ],
  "boughtFrom": "Оружие",
  "name": "Skull Basher",
  "description": "Устрашающее оружие в умелых руках, этот молот способен уничтожить любую защиту. Не стоит его недооценивать.",
  "trivia": null,
  "upgradeIn": [
    "Abyssal Blade"
  ],
  "bonuses": [
    "+10 к силе",
    "+25 к урону"
  ],
  "tips": null
}