{
  "abilities": [
    {
      "notes": [
        "The projectile travels at a speed of 1300",
        "Deals pure damage to self and magical damage to enemies",
        "The self-inflicted damage is applied instantly upon cast and never lethal, so it cannot be used to deny oneself\n Deals 55\/80\/105\/130 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 80\/105\/130\/155) damage to self",
        "If the target ally turns invulnerable, hidden or untargetable before projectile impact, it still gets healed by it",
        "Does not affect <span image=\"images\/animal_courier_radiant_minimap.png\">[picture:animal_courier_radiant_minimap]<\/span> Couriers",
        "SHARD NOTES Mist Coil now causes Abaddon to perform an instant attack on enemy targets on projectile hit\n These instant attacks can proc any attack modifiers (e.g\n <span image=\"images\/curse_of_avernus.webp\">[picture:curse_of_avernus]<\/span> Curse of Avernus) and on-hit effects normally\n They do not have True Strike, but completely ignore disarms\n If the caster is a <span image=\"images\/ranged.png\">[picture:ranged]<\/span> ranged hero, the instant attacks do not use attack projectiles and are instant, but still count as ranged attacks\n Cleave effects are based on the target's position, damaging a trapezoid area in the opposite direction where the projectile came from\n Mist Coil first applies its own damage, then the instant attack",
        "TALENT NOTES The heal and damage increasing <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent immediately upgrades all of Abaddon's currently flying Mist Coil projectiles",
        "The area of effect <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent adds a radius to this ability\n The ability must be centered over a unit still\n Upon cast, Abaddon sends Mist Coils based on its current level towards every ally and enemy within  radius, excluding himself\n These behave just like a regular cast, and can be disjointed normally\n Also targets units inside the Fog of War and invisible units\n However, invisible targets instantly disjoint it\n Deals one instance of self-damage to Abaddon, regardless of how many Mist Coils are released\n SCEPTER NOTES Does not upgrade the passive releases of <span image=\"images\/borrowed_time.webp\">[picture:borrowed_time]<\/span> Borrowed Time"
      ],
      "item_behaviour": [],
      "description": "Abaddon releases a coil of deathly mist that can damage an enemy unit or heal a friendly unit at the cost of some of Abaddon's health.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.25+0.4",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 575",
        "Self Damage Percentage: 50%",
        "Enemy Target Damage: 110\/160\/210\/260 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 160\/210\/260\/310)",
        "Ally Target Heal: 110\/160\/210\/260 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 160\/210\/260\/310)",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Radius:  400"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Abaddon_Mist_Coil_1.mp3\/revision\/latest?cb=20191216010529",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self \/ Allies \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "5.5",
      "aghanim": null,
      "name": "Mist Coil",
      "cooldown": "50",
      "legacy_key": "D",
      "story": "A mysterious vapor from the Font of Avernus now infuses the breath of Abaddon, who releases it at will."
    },
    {
      "notes": [
        "Applies a strong dispel on the target upon cast\n ↓↓ Double-tapping automatically targets self",
        "Aphotic Shield fully negates damage (after all reductions), causing several on-damage effects to not trigger",
        "Aphotic Shield has the second lowest priority in the group of damage negating effects\n This means when combined with other damage negating abilities (e.g\n <span image=\"images\/borrowed_time.webp\">[picture:borrowed_time]<\/span> Borrowed Time or <span image=\"images\/refraction.webp\">[picture:refraction]<\/span> Refraction), the shield does not absorb any damage until the other sources are gone",
        "Does not deal damage to invisible units or units in the Fog of War\n Losing the Aphotic Shield buff always causes it to burst and deal area damage, no matter how the shield was lost",
        "The area damage is independent from the amount of absorbed damage\n It always deals the full 110\/140\/170\/200 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 210\/240\/270\/300) damage (before reductions)",
        "Successive casts on the same unit do not stack\n Upon recast, the previous shield gets destroyed, dealing its area damage and a new one gets applied",
        "TALENT NOTES The shield capacity and damage increasing <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent does not affect any of the current active Aphotic Shields\n Increases both shield capacity and burst area damage despite the talent description stating it increases the shield capacity only"
      ],
      "item_behaviour": [],
      "description": "Summons dark energies around an ally unit, creating a shield that absorbs a set amount of damage before expiring. When the shield is destroyed it will burst and deal damage equal to the amount it could absorb to an area around it. Removes certain types of negative buffs and stuns on cast.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.33",
        "Cast Range: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 550",
        "Damage Radius: 675",
        "Shield Capacity: 110\/140\/170\/200 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 210\/240\/270\/300)",
        "Burst Damage: 110\/140\/170\/200 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 210\/240\/270\/300)",
        "Duration: 15"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Abaddon_Aphotic_Shield_1.mp3\/revision\/latest?cb=20191216010532",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "12\/10\/8\/6",
      "aghanim": null,
      "name": "Aphotic Shield",
      "cooldown": "85\/100\/115\/130",
      "legacy_key": "T",
      "story": "The powers of the black mist rise to absorb attacks like the black mist absorbs light."
    },
    {
      "notes": [
        "Each successful attack done on an enemy unit without the curse debuff, places the initial debuff, or increases its counter if it already has the debuff",
        "The initial debuff's duration gets refreshed on each hit\n The required hits do not need to all happen within 5 seconds",
        "When the initial debuff's counter reaches 4 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3), it gets removed and replaced by the curse debuff\n TALENT NOTES The movement speed slow increasing <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent only increases the curse movement speed slow",
        "Any allied heroes attacking the cursed enemy get the speed buff\n The buff is granted upon successfully landing an attack on the cursed target\n This means missed attacks do not grant the buff\n For <span image=\"images\/ranged.png\">[picture:ranged]<\/span> ranged heroes, this also means they gain the buff only on projectile impact\n The speed buff only works when attacking cursed targets\n When executing an attack against a unit that is not cursed, the buff gets removed",
        "The speed buff is only granted to allied heroes, illusions, and clones\n Non-hero units do not get the buff\n Treats creep-heroes as creeps",
        "The debuffs can be placed on buildings, but cannot be placed on wards, allied or attached units"
      ],
      "item_behaviour": [],
      "description": "Abaddon strikes an enemy, slowing the target's movement speed. If the target gets hit 4 times, they become affected by a chilling curse causing them to be silenced and slowed, and all attacks against them gain an attack speed boost.",
      "hot_key": "E",
      "params": [
        "Required Hits: 4 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 3)",
        "Initial Move Speed Slow: 10%\/15%\/20%\/25% (<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> 20%\/25%\/30%\/35%)",
        "Curse Move Speed Slow: 15%\/30%\/45%\/60% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 30%\/45%\/60%\/75%)",
        "Curse Attack Speed Bonus: 40\/60\/80\/100",
        "Initial Debuff Duration: 5",
        "Curse Debuff Duration: 4.5",
        "Speed Buff Duration: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Abaddon_Curse_of_Avernus.mp3\/revision\/latest?cb=20191216010528",
      "effects": [
        "Ability: Passive",
        "Affects: Allies \/ Enemies"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Curse of Avernus",
      "cooldown": null,
      "legacy_key": "F",
      "story": "While the baptized draw strength from the Font, the gifts of Avernus are debilitating to the uninitiated."
    },
    {
      "notes": [
        "Interrupts Abaddon's channeling abilities when manually cast\n However, it does not interrupt Abaddon's channeling abilities when passively activated\n The passive activation does not count as an ability cast",
        "Can be manually activated even while stunned, cycloned, slept, taunted, hidden, or during forced movement",
        "Borrowed Time cannot be manually activated while silenced, hexed or prevented from acting, but it can be passively activated\n Abaddon is unable to ⇧ Shift-queue this ability",
        "Applies a strong dispel upon activation, be it manually or passively activated",
        "Activates automatically when a damage instance (without the HP Removal flag) drops Abaddon's health below 400, or hits Abaddon while already below 400 health\n The damage is dealt before Borrowed Time is activated, meaning if the damage instance exceeds Abaddon's current health, he dies without Borrowed Time activating\n This also means that it does not save Abaddon from instantly killing effects (e.g\n <span image=\"images\/culling_blade.webp\">[picture:culling_blade]<\/span> Culling Blade and <span image=\"images\/ice_blast.webp\">[picture:ice_blast]<\/span> Ice Blast)",
        "Borrowed Time fully negates damage (after most reductions), causing several on-damage effects to not trigger",
        "Borrowed Time converts damage into healing after reductions",
        "Borrowed Time has the second highest priority in the group of damage-negating abilities\n This means when combined with other damage-negating effects (e.g\n <span image=\"images\/aphotic_shield.webp\">[picture:aphotic_shield]<\/span> Aphotic Shield), Borrowed Time negates the damage while the others do not\n If combined with <span image=\"images\/false_promise.webp\">[picture:false_promise]<\/span> False Promise, both effects attempt to negate damage\n Therefore both the incoming damage and the resultant healing are registered and delayed by False Promise",
        "Borrowed Time negates and heals from all damage types\n This includes damage flagged as HP Removal; however, Borrowed Time does not passively activate from them",
        "SCEPTER NOTES Borrowed Time now provides a 1200 radius aura and its buff lingers for 0.5 seconds\n The aura does not affect invulnerable or hidden units\n Places a damage-counting buff on allies within the radius, counting any damage the ally takes after all reductions\n The damage counter does not react on damage flagged as HP Removal\n The counted damage is checked on each damage instance\n This means only one <span image=\"images\/mist_coil.webp\">[picture:mist_coil]<\/span> Mist Coil may be released per damage instance, no matter the amount of damage taken\n If the counted damage is higher than the 525 health trigger threshold, the threshold value gets subtracted from it, and a Mist Coil gets released\n Since the threshold value gets subtracted from the counted damage, excess damage of big damage instances is not lost, and directly counts towards the next possible trigger\n This means a single 1575 damage instance (3 times larger than the trigger threshold) triggers one Mist Coil, but the next two damage instances are guaranteed to trigger a Mist Coil each\n The damage counter has no reset timer\n It only resets when the ally loses the buff in between damage instances\n Mist Coils based on the current level are passively cast automatically and instantly, regardless of mana and cooldown, and even while Abaddon is disabled\n Mist Coil notes fully apply\n If it is not learned, no coils are released\n TALENT NOTES The area of effect <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> talent does not upgrade passively released Mist Coils\n SPELL STEAL Does not require <span image=\"images\/mist_coil.webp\">[picture:mist_coil]<\/span> Mist Coil to be acquired for it to be passively released"
      ],
      "item_behaviour": [],
      "description": "When activated, all damage dealt to you will heal instead of harm. Most negative buffs will also be removed. If the ability is not on cooldown, it will automatically activate if your health falls below 400.",
      "hot_key": "R",
      "params": [
        "Cast Animation: <span image=\"images\/instant_cast_time.png\">[picture:instant_cast_time]<\/span> 0+0",
        "Passive Health Threshold: 400",
        "Duration: 4\/5\/6 (<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> 7\/8\/9)",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Radius:  1200",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Mist Coil Trigger Health Threshold:  525",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Aura Linger Duration:  0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8e\/Abaddon_Borrowed_Time.mp3\/revision\/latest?cb=20191216010527",
      "effects": [
        "Ability: No Target",
        "Affects: Self "
      ],
      "mana": "60\/50\/40 (TagTalent 52\/42\/32)",
      "aghanim": null,
      "name": "Borrowed Time",
      "cooldown": "0",
      "legacy_key": "B",
      "story": "The most unnatural of all the gifts of the Font of Avernus, this power defies mortal understanding. What should hurt, instead heals; and what should kill gives strength anew."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 1.5,
    "attrAgility": 23.0
  },
  "description": "Shields his allies or himself from attacks. Unlike the other scions of his house, Abaddon drank deeper than any from the prophetic vapors that flowed from the Font of Avernus. Now a being of unnatural powers, Abaddon stifles his foes by spreading the Curse of Avernus, and releases deathly double-edged Mist Coils to damage adversaries and heal allies. The black mist swirls around his compatriots, forming an Aphotic Shield that absorbs attacks before bursting in a wide radius. But the Font's greatest gift is revealed only in the desperation of battle. Bestowed with Borrowed Time, Abaddon charges the enemy ranks, riding down foes with his cursed blade, his health returning with each welcoming blow. For all that was meant to kill did nothing but make the Lord of Avernus even more formidable.  Support Carry Durable ★☆☆",
  "trivia": [
    "Abaddon's title, Lord of Avernus, is a reference to the famous crater in Italy, which was, in ancient times, believed to be the entrance to the underworld.",
    "In DotA, Abaddon's third ability was originally called \"Frostmourne.\" It was changed in the transition to Dota 2 due to copyright reasons, since Frostmourne exists as a famed weapon in the Warcraft universe. When using Curse of Avernus, Abaddon says 'The mistblade bites', which is similar to Arthas's Quote: 'Frostmourne hungers'. Similarly, his first ability was originally named \"Death Coil\", but was likely changed to differentiate it from the ability used by death knights in the Warcraft universe; one of his responses when using Mist Coil references the original name.",
    "In the Christian Bible, Abaddon is the name of an angel who rises from the Abyss and commands an army of locusts. Coming from Hebrew, Abaddon as a name translates to \"Destroyer\".",
    "Abaddon's response to killing Phoenix \"That Phoenix flew too close to the mist.\" is a reference to the Greek myth of Icarus and Daedalus where Icarus flew to close the sun and crashed to the sea when his wax wings melted."
  ],
  "history": "The Font of Avernus is the source of a family's strength, a crack in primal stones from which vapors of prophetic power have issued for generations. Each newborn of the cavernous House Avernus is bathed in the black mist, and by this baptism they are given an innate connection to the mystic energies of the land. They grow up believing themselves fierce protectors of their lineal traditions, the customs of the realm—but what they really are protecting is the Font itself. And the motives of the mist are unclear. When the infant Abaddon was bathed in the Font, they say something went awry. In the child's eyes there flared a light of comprehension that startled all present and set the sacerdotes to whispering. He was raised with every expectation of following the path all scions of Avernus took—to train in war, that in times of need he might lead the family's army in defense of the ancestral lands. But Abaddon was always one apart. Where others trained with weapons, he bent himself to meditation in the presence of the mist. He drank deep from the vapors that welled from the Font, learning to blend his spirit with the potency that flowed from far beneath the House; he became a creature of the black mist. There was bitterness within the House Avernus—elders and young alike accusing him of neglecting his responsibilities. But all such accusations stopped when Abaddon rode into battle, and they saw how the powers of the mist had given him mastery over life and death beyond those of any lord the House had ever known.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "-1 Curse of Avernus Attacks Required",
        "talent_left": "400 AoE Mist Coil"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+100 Aphotic Shield Health",
        "talent_left": "-8s Borrowed Time Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+65 Damage",
        "talent_left": "+50 Mist Coil Heal\/Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+15% Curse of Avernus Movement Slow",
        "talent_left": "+8 Strength"
      }
    ],
    "notes": [
      "The strength talent effectively grants Abaddon 160 health, 0.8 health regeneration, and 8 main attack damage bonus.",
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
    ]
  }
}