{
  "abilities": [
    {
      "notes": [
        "Illusory Orb travels at a speed of 550, taking 3.55 seconds to reach max distance",
        "With the travel distance and damage radius, the orb can hit units up to 2175 range away",
        "The orb starts emitting red pulses after having traveled for 2.5 seconds, indicating that it is about to reach its maximum travel range",
        "Leveling the ability immediately updates the damage values of the current instance\n TALENT NOTES However, the damage increasing  talent does not update the current instance",
        "The orb leaves behind a trail of flying vision, with a radius of 450\n The vision lingers for 5 seconds"
      ],
      "item_behaviour": [],
      "description": "Puck launches a magic orb that floats in a straight path, damaging enemy units along the way. At any point, Puck may teleport to the orb's location using Ethereal Jaunt.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.1+0.27",
        "Cast Range:  3000",
        "Travel Distance:  1950",
        "Damage Radius: 225",
        "Damage: 75\/150\/225\/300 ( 125\/200\/275\/350)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Puck_Illusory_Orb_1.mp3\/revision\/latest?cb=20191216021933",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "12\/11\/10\/9",
      "aghanim": null,
      "name": "Illusory Orb",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "R",
      "story": "The playful Faerie Dragon delights in confusing others, vanishing and reappearing where unexpected."
    },
    {
      "notes": [
        "↓↓ Double-tapping automatically targets 25 range in front of Puck",
        "Waning Rift does not disjoint projectiles upon cast",
        "Despite the visual effects, the silence and damage are applied instantly in the entire radius\n It first applies the damage, then the silence debuff, then the knockback, then the True Sight debuff",
        "SCEPTER NOTES Waning Rift now knocks units back at a speed of 800\n The knockback distance is always 400, no matter how far the unit is from the center\n Units are not disabled during the knockback\n They can still turn, attack, and use items\n Does not interrupt channeling abilities\n Can push units over impassable terrain\n Destroys trees enemies come in contact with during the knockback\n Places the same debuff as  Reveal on enemies to reveal them\n However, it does not slow enemies\n Successive reveal debuffs do not stack but refresh its duration\n The debuff is placed on wards, attached units and  Couriers as well"
      ],
      "item_behaviour": [],
      "description": "Puck teleports to the target location and releases a burst of faerie dust that deals damage and silences enemy units nearby.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0.27",
        "Cast Range: Global",
        "Max Distance:  400 ( 550)",
        "Radius: 400 ( 550)",
        "Damage: 70\/130\/190\/250 ( 145\/205\/265\/325)",
        "Silence Duration: 2\/2.5\/3\/3.5 ( 2.75\/3.25\/3.75\/4.25)",
        "Knockback Distance:  400",
        "Knockback Duration:  0.5",
        "True Sight Duration:  5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0c\/Puck_Waning_Rift.mp3\/revision\/latest?cb=20191216021936",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": "16\/15\/14\/13 (TagTalent 12\/11\/10\/9)",
      "aghanim": null,
      "name": "Waning Rift",
      "cooldown": "100\/110\/120\/130",
      "legacy_key": "W",
      "story": "With a mischievous grin, Puck spreads its enchanted powder which disrupts magical flow."
    },
    {
      "notes": [
        "Disjoints projectiles upon cast",
        "Certain items abilities which do not cancel channeling (e.g\n <span image=\"items\/shadow_blade\/full.webp\">[Shadow Blade]<\/span> Shadow Walk or <span image=\"items\/shiva's_guard\/full.webp\">[Shiva's Guard]<\/span> Arctic Blast) do cancel Phase Shift",
        "Turns the caster invulnerable and hidden for its duration\n Does not provide phased movement, so the caster can still block other units during Phase Shift\n The buff lingers for one server tick once the channeling ends or is interrupted, which allows using items while still invulnerable and hidden",
        "SHARD NOTES Phase Shift now causes Puck to perform instant attacks on all enemies within range whenever Phase Shift is cast\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They do not have True Strike, but completely ignore disarms\n Every visible and attackable enemy nearby, including buildings and  Couriers, are attacked\n Does not attack wards and  Undying Zombies\n For  melee units, if the enemy target is farther than 350 range more than the attacker's range, the attack will always miss\n The search radius can be further increased by other attack range bonuses\n SPELL STEAL Does not interrupt the channeling upon losing ability"
      ],
      "item_behaviour": [],
      "description": "Puck briefly shifts into another dimension where it is immune from harm.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Max Channel Time: 1\/1.75\/2.5\/3.25",
        "Instant Attack Radius:  750"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ac\/Puck_Phase_Shift.mp3\/revision\/latest?cb=20191216021935",
      "effects": [
        "Ability: No Target",
        "Affects: Self ",
        "Damage: "
      ],
      "mana": "8\/7.5\/7\/6.5",
      "aghanim": null,
      "name": "Phase Shift",
      "cooldown": "0",
      "legacy_key": "F",
      "story": "With a quip and flash, Puck returns to the alien dimension from whence it came."
    },
    {
      "notes": [
        "This sub-ability is inactive until Illusory Orb is cast, and turns inactive again once the  Illusory Orb of that cast is gone",
        "Ethereal Jaunt disjoints projectiles upon cast",
        "When two Illusory Orbs are cast in succession, this ability only stays active for the duration of the first cast\n However, it always teleports the caster to their last created Illusory Orb"
      ],
      "item_behaviour": [],
      "description": "Teleports Puck to a flying Illusory Orb.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0.53"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/43\/Puck_Ethereal_Jaunt.mp3\/revision\/latest?cb=20191216021932",
      "effects": [
        "Ability: No Target",
        "Affects: Self"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Ethereal Jaunt",
      "cooldown": "0",
      "legacy_key": "E",
      "story": null
    },
    {
      "notes": [
        "Every enemy hero within 375 range of the coil gets leashed upon cast, preventing them from casting certain mobility abilities\n Entering the area after cast has no effect\n The coil does not leash enemies after cast\n Treat illusions, clones and creep-heroes as heroes",
        "If a leashed enemy moves 600 range away from the coil, the leash snaps, stunning and damaging the enemy\n It does not matter how far or how fast the enemy moves away, the stun and damage always hit it if possible\n The leash snap first applies the damage, then the debuff",
        "Dream Coil leashes invisible units and on units in the Fog of War as well, but it does not provide vision over them\n The link visually draws to their last known location",
        "Multiple instances of Dream Coil fully stack, with each cast placing its own separate leash",
        "TALENT NOTES The Dream Coil rapid fire  talent causes Puck to perform instant attacks on all leashed enemies, as long as it stays within 775 radius of the targeted area\n The instant attack radius is not affected by other attack range bonuses\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They do not have True Strike, but completely ignore disarms\n The attacks are performed even while Puck is disabled, or hidden\n This means the attacks happen even during  Phase Shift\n The attacks are performed in 0.6-second intervals, starting 0.6 seconds after cast, resulting in up to 10 instances\n Since the instant attacks are bound to the leash, snapping it, or dispelling it with spell immunity causes the instant attacks to stop\n Multiple instances of Dream Coil on enemies cause Puck to perform instant attacks multiple times, for each instance, with the interval based on when the debuffs were received"
      ],
      "item_behaviour": [],
      "description": "Creates a coil of volatile magic that latches onto enemy Heroes, damaging and leashing them. If the enemy hero stretches the coil by moving too far away, it snaps, stunning and dealing additional damage.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.1+0.27",
        "Cast Range: 750",
        "Coil Latch Radius:  375",
        "Link Break Radius: 600",
        "Initial Damage: 150\/230\/310 ( 300\/380\/460)",
        "Link Break Damage: 200\/300\/400 ( 350\/450\/550)",
        "Link Break Stun Duration: 1.8\/2.4\/3",
        "Coil Duration: 6",
        "Instant Attack Radius:  775",
        "Instant Attack Interval:  0.6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Puck_Dream_Coil_1.mp3\/revision\/latest?cb=20200822132902",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "mana": "75 (TagTalent 65)",
      "aghanim": null,
      "name": "Dream Coil",
      "cooldown": "100\/150\/200",
      "legacy_key": "C",
      "story": "The Faerie Dragon sows confusion by forcing its enemies to vividly dream about their own mortality."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 17.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 2.5,
    "attrAgility": 22.0
  },
  "description": "Orbs to enemies and silences them. Hatched on the frond of the Undertree, Puck's youthful mischievousness belied inscrutable motives. By teleporting to its Illusory Orb to Jaunt through short distances, it attacks and disrupt foes with bursts of Silencing Dust, Phase Shifting in and out of existence to avoid swords and spells alike. Equally adept at fighting and play, Puck Coils its foes to a single point, forcing them to break their restraints and be stunned, or stay and face Puck's advancing allies.  Initiator Disabler Escape Nuker ★★☆",
  "trivia": [
    "Puck's alternate name was Kupu-Kupu, which means \"moth\" or \"butterfly\" in the Malay and Indonesian languages.",
    "Puck was introduced in Version 6.48 as a result of a hero creation contest held on the DotA-Allstars forum, in which players designed a new hero to suit the faerie dragon model from Warcraft III. This makes Puck the first and only hero created by the community.",
    "Puck pays homage to a character of the same name from Shakespeare's A Midsummer Night's Dream. Aside from Puck's playful attitude, its line \"A midsummer nightmare\" is also an allusion to the play.",
    "Since Puck pays homage to a Shakespeare character, most of its lines are delivered in phrasing similar to iambic pentameter.",
    "The Version 6.87 Illusory Orb speed change was a developer's joke based on this reddit thread.",
    "This line Link▶️ \"One Puck, two Puck, three Puck more!\" is a reference to Eminem's final rap battle in 8 Mile movie (2002).",
    "This line Link▶️ \"One and one and one is three!\" is a reference to The Beatles' song \"Come Together\" (1969)."
  ],
  "history": "While Puck seems at first glance a mischievous, childish character, this quality masks an alien personality. The juvenile form of a Faerie Dragon, a creature that lives for eons, Puck spends countless millennia in its childish form. So while it is technically true that Puck is juvenile, it will continue to be so when the cities of the present age have sloughed away into dust. Its motives are therefore inscrutable, and what appears to be play may in fact indicate a darker purpose or just its endless fondness for mischief.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Dream Coil Pierces Magic Immunity",
        "talent_left": "Dream Coil Rapid Fire"
      },
      {
        "talent_lvl": "20",
        "talent_right": "-4s Waning Rift Cooldown",
        "talent_left": "+150 Initial\/Break Dream Coil Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-10s Dream Coil Cooldown",
        "talent_left": "+75 Waning Rift Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+50 Illusory Orb Damage",
        "talent_left": "+0.75s Waning Rift Silence Duration"
      }
    ]
  }
}