{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Складывается с другими источниками вампиризма.",
        "Вампиризм не работает на вардах, строениях или дружественных юнитах."
      ],
      "mana": null,
      "abilityName": "Lifesteal",
      "cooldown": null,
      "description": "Каждая атака восстанавливает владельцу здоровье в размере 25% от нанесённого урона.",
      "params": [
        "Вампиризм: 25%"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3f\/Satanic.mp3\/revision\/latest?cb=20141214203513",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания владельца.",
        "Напрямую увеличивает вампиризм, даваемый пассивной способностью, на 175%, в итоге давая 200% вампиризма."
      ],
      "mana": null,
      "abilityName": "Unholy Rage",
      "cooldown": "35",
      "description": "Увеличивает эффект вампиризма до 200% на 6 сек.",
      "params": [
        "Бонус к вампиризму: 175%",
        "Длительность: 6"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 500 здоровья, 2,5 регенерации здоровья и 70 урона от атаки.",
    "Для героев ловкости, даёт 500 здоровья, 2,5 регенерации здоровья и 45 урона от атаки.",
    "Для героев интеллекта, даёт 500 здоровья, 2,5 регенерации здоровья и 45 урона от атаки."
  ],
  "cost": "5100",
  "lore": null,
  "consistFrom": [
    "Morbid Mask",
    "Claymore",
    "Reaver"
  ],
  "boughtFrom": "Артефакты",
  "name": "Satanic",
  "description": "Почти безграничная сила в обмен на вашу душу.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+25 к силе",
    "+45 к урону"
  ],
  "tips": [
    "Активная способность Satanic - Unholy Rage - длится недолго. Если у врагов много обезвреживающих способностей, то рекомендуется сначала приобрести Black King Bar и использовать предметы вместе или подождать ключевые способности, чтобы использовать BKB и присоединится к сражению.",
    "Поскольку лечение от вампиризма использует текущее значение наносимого урона, то атака целей с маленьким количеством брони и небольшим уменьшением урона и\/или высокое значение урона от атаки у владельца предмета может сильно увеличить выживаемость в битве. С достаточно большим уроном один критический удар во время действия Unholy Rage может почти полностью восстановить здоровье владельца.",
    "На промахнувшуюся атаку не действует вампиризм. Рассмотрите покупку Monkey King Bar, если у цели есть источники уклонения.",
    "Вампиризм действует более эффективно с предметами, дающими эффективные очки здоровья, как, например, броня, блокировка урона, уклонение и сопротивление магии, нежели предметы, дающие только здоровье."
  ]
}