{"abilities":[{"spell":"Discharges high-powered shrapnel at random nearby enemy units, dealing minor magical damage and ministun.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Interrupts Clockwerk's channeling spells upon cast.","Remains active even if Clockwerk is disabled.","Discharges a total of 16 ( 27) shrapnels, starting immediately upon cast.","Can deal a total of 320\/720\/1120\/1520 damage without any talents (before reductions). Can deal a total of 800\/1200\/1600\/2000 damage when the damage increasing talent is chosen. Can deal a total of 540\/1215\/1890\/2565 damage when the interval reducing talent is chosen. Can deal a total of 1350\/2025\/2700\/3375 damage when both talents are chosen.","Each shrapnel first applies the damage, then the debuff.","Hits units in the Fog of War, but not invisible, invulnerable and hidden units.","The buff from multiple casts of Battery Assault does not stack but gets refreshed instead.","Choosing the damage increasing talent immediately updates the currently running instance of Battery Assault.","Choosing the interval reducing talent does not affect the currently running instance of Battery Assault. Does not update the interval upon refreshing the current instance either. The current instance must expire first."],"mana":"100","elements":["Does not pierce spell immunity."],"cooldown":"24\/22\/20\/18","name":"Battery Assault","description":["Cast Animation: 0+0","Search Radius: 275","Shrapnel Interval: 0.7 ( 0.4)","Damage per Shrapnel: 20\/45\/70\/95 ( 50\/75\/100\/125)","Stun Duration: 0.1","Assault Duration: 10.5"],"hot_key":"Q","legacy_key":"E"},{"spell":"Forms a barrier of energized cogs around Clockwerk, trapping any units that are near. Enemies outside the trap that touch a cog are knocked back, losing health and mana. Once a cog has delivered a shock, it will power down. Cogs can be destroyed by enemy attacks, but Clockwerk can destroy them with just one.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["The cogs are always placed in the same formation. 8 cogs are placed so that they form a circle around Clockwerk. The center of the circle is empty. Each cog is spawned 215 range away from Clockwerk, effectively blocking a 255 radius circle due to their collision size. All cogs are placed with a 164.5 range distance from each other. Together with their collision size, the gap between the cogs is 4.5. This means that any unit trapped within the center of the circle cannot move out unless it has unobstructed movement.","A cog shocks the first enemy unit which comes within 185 range of it from the outside. A cog can only shock a unit once.","The cogs only shock units that have mana (e.g. ranged creeps). Units without a mana pool are not shocked (e.g. Roshan).","The shock requires no vision and can hit invisible enemies, or enemies in the Fog of War.","The shock is a 300 distance knock back at a speed of 300, so it lasts exactly 1 seconds.","Knocks units back into the direction they approach the cog from.","During the knock back, the unit is fully disabled. The damage and mana loss are applied at the end of the knock back.","Does not shock units who are already under the effect of other sources of forced movement, except for Force Staff and Hurricane Pike.","Although the cogs deliver the shocks, the effects (damage, mana loss, knockback) are sourced to the caster, not the cog.","Applies the damage first, and then the mana loss.","At the end of the knock back, trees within a 100 radius of the unit are destroyed.","Despite having 100 health, attacking the cogs deals 0 damage. The cogs' health bar does not visually decrease when attacking them either.","Units not controlled by any player do not try to path around the cogs, but simply walk against them as if they are not there. This effectively causes them to get stuck until they change directions (e.g. when aggro-ing them).","The cogs can also be attacked and destroyed\/denied by allies, however, taking the same amount of attacks as enemies."],"mana":"80","elements":["Does not pierce spell immunity."],"cooldown":"15","name":"Power Cogs","description":["Cast Animation: 0.2+0.5","Cogs Spawn Radius: 215","Number of Cogs: 8","Attacks to Destroy: 2","Shock Search Radius: 185","Shock Damage: 50\/125\/200\/275","Shock Mana Loss: 50\/80\/110\/140","Shock Knockback Distance: 300","Shock Knock Back Duration: 1","Cogs Duration: 5\/6\/7\/8"],"hot_key":"W","legacy_key":"C"},{"spell":"Fires a global range flare that explodes over a given area, damaging enemies and providing vision for 10 seconds.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The Rocket Flare travels at a speed of 2250.","Provides flying vision in a 600 radius for 1 second while traveling and for 10 seconds at the targeted area after reaching it. When choosing the talent, also provides 600 radius True Sight at the targeted area for 10 seconds. The True Sight is provided by an aura which affects enemies. Its debuff lingers for 0.5 seconds. Cannot reveal Eyes In The Forest.","The rocket can be seen on the minimap. It appears green to allies and red to enemies (enemies require vision over it to see it).","Choosing the damage upgrading talent immediately upgrades all of Clockwerk's currently flying rockets.","Choosing the True Sight granting talent immediately grants it to Clockwerk's currently flying rockets. However, it does not add True Sight to rockets which already reached their targeted point and exploded."],"mana":"35\/40\/45\/50","elements":["Does not pierce spell immunity."],"cooldown":"20\/18\/16\/14","name":"Rocket Flare","description":["Cast Animation: 0.3+0","Cast Range: Global","Radius: 600","Damage: 80\/120\/160\/200 ( 205\/245\/285\/325)","Vision Duration: 10","True Sight Linger Duration: 0 ( 0.5)"],"hot_key":"E","legacy_key":"R"},{"spell":"Fires a grappling device rapidly at the target location. If the hook hits a unit, Clockwerk launches himself into the target, stunning and dealing damage. Any enemies Clockwerk collides with along the way are damaged and stunned.","effects":["Ability Target Point","Affects Self \/ Enemies","Damage Magical"],"notes":["The hook travels at a speed of 4000\/5000\/6000, taking a maximum of 0.5 seconds to reach max length.","When the hook latches on a unit, Clockwerk gets pulled towards it at the same speed as the hook itself.","Clockwerk is silenced and disarmed during the pull, preventing ability usage and attacking. Items can be used.","The pull gets canceled when Clockwerk gets affected by other sources of forced movement.","Clockwerk gets pulled towards the latched unit's current location, and not towards the original location where the hook latched on it. This means when the target moves or gets moved, Clockwerk's trajectory adapts immediately. The pulling lasts a maximum of 0.5 seconds, so if the target moves away, Clockwerk may not fully reach it.","The area damage and stun around Clockwerk always happens, regardless of whether the hook latched on an ally or enemy.","When latching on an ally, the ally is not disabled and can act freely. It is not interrupted either.","When latching on an enemy, it gets stunned for 1.5\/1.75\/2 seconds, or until Clockwerk reaches it. This means if Clockwerk does not reach it, it is stunned for the full duration. This can happen when either the pull gets canceled, or when the target gets moved too far away during the pull.","The latched enemy is also hit by the area damage\/stun. This means the latched target is stunned up to 0.5 seconds longer than secondary targets, due to the initial latch stun.","Hookshot first applies the debuff, then the damage.","Fully ignores couriers."],"mana":"150","elements":["Partially pierces spell immunity."],"cooldown":"60\/45\/30","name":"Hookshot","description":["Cast Animation: 0.3+0","Cast Range: 2000\/2500\/3000","Max Travel Distance: 2000\/2500\/3000","Hook Latch Radius: 125","Stun & Damage Radius: 175","Damage: 75\/175\/275","Stun Duration: 1.5\/1.75\/2"],"hot_key":"R","legacy_key":"T"},{"spell":"Resets Clockwerk's ability cooldowns and grants him bonus movement and attack speed for a duration. Clockwerk becomes stunned after the duration runs out.","effects":["Ability No Target","Affects Self"],"notes":["Requires Aghanim's Scepter to be unlocked.","The sound can be heard by enemies only when the spell was cast within their vision range.","The Overclocking buff particles are visible to everyone.","Overclocking self stun can not be reduced by any status resistance item.","Successive applications of Overclocking while the buff is active refreshes the buff but does not refresh ability cooldowns."],"mana":"150","elements":["Pierces spell immunity."],"cooldown":"60","name":"Overclocking","description":["Cast Animation: 0.0+0.0","Bonus Movement Speed: 40%","Bonus Attack Speed: 200","Overclocking Duration: 8","Self Stun Duration: 4"],"hot_key":"D","legacy_key":"D"}],"bio":"Rattletrap descends from the same far-flung kindred as Sniper and Tinker, and like many of the Keen Folk, has offset his diminutive stature through the application of gadgetry and wit. The son of the son of a clockmaker, Rattletrap was many years apprenticed to that trade before war rode down from the mountains and swept the plains villages free of such innocent vocations. “Your new trade is battle,” his dying father told him as the village of their ancestors lay in charred and smoking ruins. It is a poor tradesman who blames his tools, and Rattletrap was never one to make excuses. After burying his father among the ruins of their village, he set about to transform himself into the greatest tool of warfare that any world had ever seen. He vowed to never again be caught unprepared, instead using his talents to assemble a suit of powered Clockwerk armor to make the knights of other lands look like tin cans by comparison. Now Rattletrap is alive with devices—a small but deadly warrior whose skills at ambush and destruction have risen to near-automated levels of efficiency. An artisan of death, his mechanizations make short work of the unwary, heralding a new dawn in this age of warfare. What time is it? It's Clockwerk time!","talentsTips":["The armor talent does not benefit illusions.","The strength talent effectively grants Clockwerk 300 health, 1.5 health regen, 1.2% magic resistance and 15 attack damage.","The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Clockwerk's magic resistance to 62.5%."],"trivia":["One of Clockwerk's death animations is a reference to the movie Terminator 2: Judgment Day.","An old competitive strategy that was used in DotA was sending a rocket flare over to the enemy fountain, and having Nature's Prophet teleport to the enemy base and snipe the courier. This tactic has long been discontinued due to triggers being implemented to stop it.","The line \" I'm lost... like gears in the rain.\" (death line) is a reference to the movie Blade Runner.","The line \" Some assembly required\" (spawn line) is a reference to a song of the same name composed by Mike Morasky, for the game Portal 2, another game made by Valve.","The line \" I'm the six million gold piece man!\" (respawn line) is a reference to the American television series The Six Million Dollar Man.","The line \" The turtle wins the race\" (move line) is a reference to one of Zeno's Paradoxes named Achilles and the tortoise."],"talents":["-0.3s Battery Assault Interval:+50% Magic Resistance","+125 Rocket Flare Damage:Rocket Flare True Sight","+30 Battery Assault Damage:+15 Strength","+20 Movement Speed:+5 Armor"],"desc":"Rattletrap, the Clockwerk, is a melee strength hero known as being one of the most well-rounded initiator-gankers in the game. Rattletrap's wide array of disables and nukes allows him to cause chaos among the enemy team and break up their formation, giving his team a powerful advantage in any fight. Battery Assault allows Clockwerk to inflict repeated damage ticks and mini-stuns on nearby enemies, allowing him to constantly hinder any enemies he manages to get close to and single out. He can also disrupt enemy movement and pen in foes with his Power Cogs, which induces an electric shock to foes outside, stunning them while damaging them and burning their mana, and can render enemies caught inside helpless. His damage nuke, Rocket Flare, gives him global nuking power that also provides scouting vision for him and his team. Finally, his ultimate, Hookshot, allows Rattletrap to instantaneously latch onto and stun a foe from long range, making him a very strong ganker. Few can escape Clockwerk once he has his sights locked in, and his machinations make him a powerful ally to have on any team."}