{"abilities":[{"spell":"Выпускает высокомощную шрапнель в случайных существ неподалёку, нанося им незначительный магический урон и ненадолго их оглушая.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Продолжает действовать даже если герой обезврежен.","Всего выстреливает шрапнелью 16 ( 27) раз сразу после использования способности.","Может нанести до 320\/720\/1120\/1520 единиц урона без талантов (до учета сопротивления). Может нанести до 800\/1200\/1600\/2000 единиц урона с выбранным талантом на увеличение урона. Может нанести до 540\/1215\/1890\/2565 единиц урона с выбранным талантом на снижение интервала между выстрелами. Может нанести до 1350\/2025\/2700\/3375 единиц урона при двух выбранных талантах.","Наносит урон юнитам в тумане войны, но не работает на невидимых, неуязвимых и исчезнувших юнитах.","Бафф от нескольких применений Battery Assault не складывается, но обновляет длительность.","Выбор таланта на усиление урона мгновенно обновляет урон, наносимый действующей Battery Assault.","Выбор таланта на снижение интервала между выстрелами не влияет на интервалы уже действующей Battery Assault. Не изменяет интервалы при обновлении действующей способности. Способность должна сначала закончиться."],"mana":"100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"24\/22\/20\/18","name":"Battery Assault","description":["Анимация применения: 0+0","Радиус: 275","Интервал выстрелов: 0.7 ( 0.4)","Урон за выстрел: 20\/45\/70\/95 ( 50\/75\/100\/125)","Длительность оглушения: 0.1","Длительность: 10.5"],"hot_key":"Q","legacy_key":"E"},{"spell":"Создаёт вокруг героя барьер из заряженных шестерней, захватывая в ловушку всех ближайших существ. Шестерни отталкивают коснувшихся их снаружи врагов, сжигая здоровье и ману. Сработавшие шестерни отключаются. Враги могут уничтожить шестерню несколькими атаками, а владельцу способности на это требуется один удар.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Шестерни всегда размещаются одинаково. 8 шестерней располагаются так, что образуют круг вокруг Clockwerk. Центр круга остаётся пустым. Каждая шестерня появляется на расстоянии 215 единиц от Clockwerk, эффективно блокируя радиус в 255 единиц благодаря своим размерам столкновения. Все шестерни располагаются на расстоянии 164,5 единиц друг от друга. Вместе с их размером столкновения промежуток между шестернями составляет 4,5 единицы. Это означает, что любой юнит, оказавшийся внутри круга из шестерней, не сможет выбраться, кроме случаев беспрепятственного движения.","Шестерня ударяет первого юнита, подошедшего к ней с внешней стороны ближе, чем на 160 единиц. Шестерня может нанести удар юниту лишь один раз.","Удар отбрасывает юнита назад на дистанцию в 3000 единицы со скоростью в 3000 единиц за 1 секунды.","Юниты отбрасываются назад в том же направлении, с которого они затронули шестерню.","Во время отбрасывания назад юнит полностью обезврежен. Нанесение урона и потеря маны происходят после окончания отбрасывания.","Не ударяет юнитов, которые ранее уже были затронуты эффектом принудительного движения от других источников, исключая Force Staff.","Сначала наносится урон, потом происходит потеря маны.","По окончанию отбрасывания деревья в радиусе 100 единиц вокруг юнита уничтожаются.","Хотя шестерня имеет 100 единиц здоровья, атака по ней наносит 0 единиц урона. Полоска здоровья тоже не меняется при атаке шестерни.","Шестерни ударяют только тех юнитов, которые имеют ману (например, крипа-мага). Юнитам без запаса маны удар шестерни не наносится (к примеру, Рошан).","Юниты, которые не находятся под контролем любого из игроков, не пытаются обойти шестерни, а просто идут на них, как будто их вообще нет. Фактически это заставляет их застревать в шестернях до тех пор, пока они не сменят направление (например, если их отвлечёт другой юнит).","Также союзники могут атаковать и разрушать\/добивать шестерни, при этом им нужно сделать столько же атак, сколько и врагам."],"mana":"80","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"15","name":"Power Cogs","description":["Анимация применения: 0,2+0,5","Радиус появления шестерней: 215","Количество шестерней: 8","Атак для уничтожения: 2","Радиус для отталкивания: 160","Урон: 50\/100\/150\/200","Сжигание маны: 50\/80\/110\/140","Дальность отталкивания: 3000","Длительность отталкивания: 1","Длительность: 5\/6\/7\/8"],"hot_key":"W","legacy_key":"C"},{"spell":"Выпускает сигнальную ракету в любую точку карты. Ракета взрывается в указанной зоне, нанося урон противникам и давая обзор данной зоны в течение 10 секунд.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Скорость полета ракеты - 2250.","Дает летающий обзор в радиусе 600 единиц на 1 секунду во время полета и на 10 секунд после приземления в выбранной области. При выборе таланта также дает в выбранной области радиусом 600 единиц эффект True Sight на 10 секунд. Эффект True Sight предоставляется в виде ауры, которая влияет на врагов. Дебафф задерживается на 0,5 секунды. Не может раскрывать Eyes In The Forest.","Ракету можно увидеть на миникарте. Для союзников она отображается зеленым, для врагов - красным (для этого им нужен обзор).","Выбор таланта на усиление урона мгновенно обновляет урон у всех летящих ракет Clockwerk.","Выбор таланта, дающего ракетам эффект True Sight, мгновенно дает этот эффект всем летящим ракетам Clockwerk. При этом талант не добавляет эффект ракетам, которые уже достигли точки и взорвались."],"mana":"35\/40\/45\/50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Rocket Flare","description":["Анимация применения: 0,3+0","Дальность применения: Глобальная","Радиус: 600","Урон: 80\/120\/160\/200 ( 205\/245\/285\/325)"],"hot_key":"E","legacy_key":"R"},{"spell":"Быстро выпускает захватное устройство в указанном направлении. Если крюк попадает в живое существо, герой запускает себя в цель, оглушая её и нанося урон. Любые враги, с которыми герой сталкивается по пути, также получают урон и оглушаются.","effects":["Способность Направленная на точку","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Скорость полета крюка 4000\/5000\/6000, требуется 0,5, чтобы ему достигнуть максимальной длины.","Когда крюк цепляется за юнита, Clockwerk притягивается к нему с той же скоростью, с которой крюк летит к цели.","В момент притягивания на Clockwerk действует безмолвие и обезоруживание, предотвращая атаки и использование им способностей. Можно использовать предметы.","Притягивание отменяется, когда Clockwerk попадает под действие других источников принудительного движения.","Clockwerk притягивается в направлении текущего местоположения выбранного юнита, а не к месту, где юнит изначально находился. То есть, если цель переместилась или её передвинули, то траектория притягивания Clockwerk мгновенно изменится. Притягивание максимально занимает 0,5 секунды, поэтому если цель переместилась слишком далеко, то Clockwerk не сможет полностью до неё дотянутся.","Область урона и оглушения вокруг Clockwerk срабатывает всегда вне зависимости от того, кого зацепил крюк - союзника или врага.","При цеплянии за союзника он не оглушается и продолжает действовать как обычно. Не прерывает его действия.","При цеплянии за врага он оглушается на 1\/1.5\/2 секунду или до момента приближения Clockwerk. То есть, если Clockwerk не притянулся к врагу, то враг оглушается только один раз. Это может произойти, если притягивание отменилось или цель передвинулась слишком далеко, пока длилось притягивание.","Враг, за которого зацепились, также получит урон от области урона\/оглушения. То есть выбранная цель оглушается на 0,5 дольше, чем вторичные цели, поскольку на неё действует и базовое оглушение от крюка.","Полностью игнорирует курьеров."],"mana":"150","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"70\/55\/40 ( 12)","name":"Hookshot","description":["Анимация применения: 0,3+0","Дальность применения: 2000\/2500\/3000","Максимальная дистанция: 2000\/2500\/3000","Радиус захвата: 125","Радиус получения оглушения и урона: 175","Урон: 75\/175\/275","Длительность оглушения: 1\/1.5\/2"],"hot_key":"R","legacy_key":"T"}],"bio":"Ратлтрап — выходец из того же многочисленного народа, что и Кардел с Боушем, и он тоже возмещает свою низкорослость механическими приспособлениями и хитростью ума. Сын сына часовщика, Ратлтрап много лет учился ремеслу отца — до тех пор, пока война не сошла с гор и не унесла из равнинных поселений мирные профессии. «Теперь твоё ремесло — война», — сказал ему умирающий отец, пока деревня их прадедов дымилась, обугленная и сожжённая. Плох тот ремесленник, что винит свои инструменты, и Ратлтрап никогда не искал отговорок. Похоронив отца в руинах деревни, он устремился превратить себя в величайшее орудие войны всех миров и времён. Он поклялся, что его больше никогда не застанут врасплох — и соорудил, используя свои знания, механические доспехи, в сравнении с которыми снаряжение иноземцев было подобно консервным банкам. Теперь Ратлтрап не расстаётся со своими устройствами — некрупный, но смертоносный воин, достигший невероятных вершин в искусстве засад и разрушений. Он промышляет смертью, быстро прекращает жизнь неподготовленных противников с помощью своих творений и несёт знамя нового слова в военном ремесле. Который час? Час часовщика!","talentsTips":["Талант на броню не дается иллюзиям.","Талант на силу в общем даёт Clockwerk: 300 здоровья, 1.5 регенерации здоровья, 1.2% сопротивления магии и 15 урона от атаки.","Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.","Талант на сопротивление магии увеличивает сопротивление магии Clockwerk до 62.5%."],"trivia":["Одна из анимаций смерти Clockwerk повторяет смерть одного из героев фильма Терминатор 2: Судный день.","В оригинальной DotA часто использовалась такая тактика: Clockwerk запускал свою Rocket Flare на фонтан к врагу (для разведки территории). А Nature's Prophet используя Teleportation телепортировался туда, и убивал вражеского курьера. В Dota 2 такая тактика невозможна, так как в зоне фонтана курьер неуязвим.","Судя по репликам Sniper и Tinker являются его братьями.","Одна из его реплик при возрождении \" I'm the six million gold piece man!\" является отсылкой к сериалу The Six Million Dollar Man.","Так-же одна из реплик смерти Clockwerk \" I'm lost... like gears in the rain.\" - отсылка к фильму Ридли Скотта \"Бегущий по лезвию\".","А также, его реплика \" Some assembly required\" - отсылка к одноимённой песне, написанной Майком Моравски к игре Portal 2, так-же созданной Valve."],"talents":["-0,3 сек. от интервала у Battery Assault:+50% к сопротивлению магии","+125 к урону от Rocket Flare:Rocket Flare раскрывает невидимость","+30 к урону от Battery Assault:+15 к силе","+20 к скорости передвижения:+5 к броне"],"desc":"Clockwerk — это герой характеристики сила с ближним типом атаки. Clockwerk известен как один из самых разносторонних инициаторов-ганкеров в игре. Широкий спектр обезвреживающих способностей позволяет Clockwerk сеять хаос среди врагов и ломать их построение, давая своей команде большое преимущество в любой схватке. Его первая способность, Battery Assault, производит выстрел высокомощной шрапнелью в случайных ближайших юнитов, нанося незначительный магический урон и ненадолго оглушая. Вторая способность, Power Cogs, создает барьер из заряженных шестерней вокруг Clockwerk, захватывая в ловушку всех ближайших юнитов. Враги вне ловушки, пытаясь дотронуться до шестеренок, будут отбрасываться назад, теряя здоровье и ману. Нанесшие удар шестерни отключаются. Враги могут уничтожить шестерню, самому Clockwerk на это требуется один удар. Третьей способностью, Rocket Flare, герой выпускает сигнальную ракету в любую точку карты. Ракета взрывается в указанной зоне, нанося урон противникам и давая обзор данной зоны. Ультимативная способность, Hookshot, запускает захват в указанном направлении. Если крюк попадает в живое существо, Clockwerk запускает себя в цель, оглушая ее и нанося урон. Любые враги, с которыми Clockwerk сталкивается по пути, получают урон и оглушение. Немногие способны сбежать от Clockwerk, если он положит на них свой глаз, и его козни дают ему репутацию сильного союзника, которому рады в любой команде."}