{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies \/ Enemies"
      ],
      "notes": [
        "Multiple instances of Assault Aura do not stack. Fully stacks with other sources of armor, including Buckler and its other upgrades. Fully stacks with other sources of attack speed.",
        "Fully stacks with other sources of armor, including Buckler and its other upgrades.",
        "Fully stacks with other sources of attack speed.",
        "A unit can be affected by the positive and the negative aura at the same time.",
        "The aura's buff and debuff linger for 0.5 seconds.",
        "The status debuff icon on enemies only shows up when the affected unit has vision over the source. However, the armor reduction in the HUD is always visible.",
        "However, the armor reduction in the HUD is always visible.",
        "Both the positive and the negative aura affect buildings.",
        "Affects invulnerable allies and enemies, but not hidden ones."
      ],
      "mana": null,
      "abilityName": "Assault Aura",
      "cooldown": null,
      "description": "Grants 30 attack speed and 5 armor to nearby allied units and structures, and decreases nearby enemy unit and structure armor by 5.",
      "params": [
        "Radius: 1200",
        "Allies Attack Speed Bonus: 30",
        "Allies Armor Bonus: 5",
        "Enemy Armor Reduction: 5",
        "Aura Linger Duration: 0.5",
        "Does not affect spell immune enemies. Affects spell immune allies."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Together with the aura, one Assault Cuirass grants a total of 15 armor and 60 attack speed to the owner."
  ],
  "cost": "5075",
  "lore": null,
  "consistFrom": [
    "Platemail",
    "Hyperstone",
    "Buckler",
    "Recipe"
  ],
  "boughtFrom": "Armor",
  "name": "Assault Cuirass",
  "description": "Forged in the depths of the nether reaches, this hellish mail provides an army with increased armor and attack speed.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 Armor",
    "+30 Attack Speed"
  ],
  "tips": [
    "The Assault Aura is a great tool for pushing enemy towers, as it provides reliable attack speed and armor. In addition to that, it also reduces the nearby structure and enemies' armor which can help the nearby ally heroes take them down."
  ]
}