{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Wraith_Pact_Wraith%27s_Reprisal.mp3\/revision\/latest?cb=20220618225125",
      "effects": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 350",
        "Радиус: 900",
        "Атак героя для уничтожения тотема: 4",
        "Атак не-героя для уничтожения тотема: 8",
        "Уменьшение исходящего урона: 30%",
        "Урон в секунду: 30",
        "Длительность задержки ауры: 0,5",
        "Длительность: 25"
      ],
      "notes": [
        "Применение Wraith's Reprisal уничтожит текущие активные тотемы от предыдущего применения. Тем не менее, предыдущий тотем продолжает издавать пульсации в месте своей смерти до полного исчезновения, или пока не закончится его таймер.",
        "Тем не менее, предыдущий тотем продолжает издавать пульсации в месте своей смерти до полного исчезновения, или пока не закончится его таймер.",
        "После применения, тотем автоматически начинает следовать за заклинателем, если ему не была отдана другая команда.",
        "Уменьшение исходящего урона даётся аурой, её дебафф задерживается на 0,5 сек. Урон не зависит от ауры. Применяет уменьшение основного исходящего урона на врагов в радиусе. Аддитивно сочетается с другими источниками манипуляции основным исходящим уроном. Уменьшение действует на весь урон, наносимый врагами, который не имеет пометку «отнимающий здоровье». Несколько аур не складываются.",
        "Применяет уменьшение основного исходящего урона на врагов в радиусе. Аддитивно сочетается с другими источниками манипуляции основным исходящим уроном.",
        "Уменьшение действует на весь урон, наносимый врагами, который не имеет пометку «отнимающий здоровье».",
        "Несколько аур не складываются.",
        "Наносит урон в 1-секундных интервалах, начиная с 1 секунды после создания, что в итоге даёт 25 тиков урона.",
        "Может нанести до 750 урона одному существу (до снижений).",
        "Источником урона является сам тотем, то есть определённые эффекты от урона (например, Damage Return) будут реагировать на тотем, а не на носителя предмета.",
        "Не действует на неуязвимых или спрятанных существ. Полностью действует на невидимых существ и существ в тумане войны.",
        "Так как урон не зависит от ауры, то урон от нескольких тотемов полностью складывается."
      ],
      "mana": "100",
      "abilityName": "Wraith's Reprisal",
      "cooldown": "60",
      "description": "Призывает тотем, который уменьшает весь урон врагов в радиусе 900 на 30% и наносит им 30 урона в секунду. Тотем способен передвигаться и существует 25 сек. Тотем можно уничтожить за 4 атак. Крипы наносят тотему половину обычного урона.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Вампиризм: 18%",
        "Доп. восстановление маны: 2",
        "Доп. урон: 18%",
        "Доп. броня: 3",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Несколько аур Vladmir's Aura не сочетаются. Это включает ауры от Vladmir's Offering и Helm of the Overlord. Полностью сочетается с другими источниками ауры на броню от Buckler и источниками ауры на восстановление маны от Ring of Basilius.",
        "Полностью сочетается с другими источниками ауры на броню от Buckler и источниками ауры на восстановление маны от Ring of Basilius.",
        "Сочетается аддитивно с другими источниками вампиризма.",
        "Аура вампиризма не будет восстанавливать здоровье за удары по вардам, постройкам и союзным существам.",
        "Даёт прямой бонусный урон от атаки основанный на основном уроне от атаки затронутого существа. Не увеличивает бонусный урон от атаки.",
        "Восстанавливает до 120 маны в минуту.",
        "Действует на неуязвимых, но не на спрятанных существ.",
        "Эффект от ауры задерживается на 0,5 сек."
      ],
      "mana": null,
      "abilityName": "Vladmir's Aura",
      "cooldown": null,
      "description": "Увеличивает вампиризм союзников на 18%, их урон на 18%, броню на 3 и восстановление маны на 2.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4050",
  "lore": null,
  "consistFrom": [
    "Vladmir's Offering",
    "Point Booster",
    "Recipe"
  ],
  "name": "Wraith Pact",
  "description": "Разумный амулет, враждебность которого повергает в трепет даже сильнейших врагов.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}