{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям.",
        "Талант на ночной обзор не поддается никакому эффекту уменьшения обзора.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+800 к здоровью",
          "talentRight": "+20% к шансу Greater Bash"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−5,5 сек. перезарядки Bulldoze",
          "talentRight": "+12% к урону от Greater Bash"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+40 к урону",
          "talentRight": "+10 здоровья в секунду"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+4 к броне",
          "talentRight": "+500 к ночному обзору"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/db\/Spirit_Breaker_Charge_of_Darkness_1.mp3\/revision\/latest?cb=20191216024518",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "Увеличивает скорость передвижения Spirit Breaker на указанное значение и позволяет во время разбега превышать лимит скорости. То есть дополнительная скорость от Charge of Darkness влияет на урон от Greater Bash.",
        "То есть дополнительная скорость от Charge of Darkness влияет на урон от Greater Bash.",
        "Скорость разгона основана на текущей скорости передвижения героя. Способность периодически проверяет скорость передвижения и мгновенно под неё адаптируется.",
        "Уходит на перезарядку только при завершении или отмене разбега, а не при использовании.",
        "Указатель над целью, как и бафф цели на заклинателе, виден только союзникам. Alt+ЛКМ по иконке баффа выведет в чат команды информацию о выбранном в качестве цели герое.",
        "Alt+ЛКМ по иконке баффа выведет в чат команды информацию о выбранном в качестве цели герое.",
        "Пока активна Charge of Darkness, Spirit Breaker проходит сквозь других существ и по непроходимой территории.",
        "Разбег отменяется, если Spirit Breaker получил оглушение, проклятие, оцепенение, сон, был спрятан, попал в ураган, под действие страха или гипноза, или на него воздействовали принудительным движением.",
        "Разбег не отменяется провокацией. Spirit Breaker начинает атаковать спровоцировавшее его существо после остановки разбега. Charge of Darkness нельзя вручную отменить, пока действует провокация.",
        "Charge of Darkness нельзя вручную отменить, пока действует провокация.",
        "Игрок может вручную отменить разбег, отдав герою команду \"стоп\", \"удерживать позицию\" или приказом с выбором цели. Ненаправленные способности и предметы не отменяют разбег.",
        "Ненаправленные способности и предметы не отменяют разбег.",
        "Поскольку способность не является произносимой, то приказы, поставленные в очередь, не действуют и отменяют разбег. Исключением является поставленная в очередь команда патрулирования; в этом случае разбег не отменяется. При этом при завершении разбега Spirit Breaker получит приказ атаковать цель, который перезапишет поставленные в очередь приказы.",
        "Исключением является поставленная в очередь команда патрулирования; в этом случае разбег не отменяется.",
        "При этом при завершении разбега Spirit Breaker получит приказ атаковать цель, который перезапишет поставленные в очередь приказы.",
        "При включенной автоатаке Spirit Breaker может автоматически атаковать без отмены разбега существ, которые будут достаточно близко к нему.",
        "Любое существо, оказавшееся в радиусе 300 единиц от Spirit Breaker в момент его разбега, получит урон, равный текущему уровню Greater Bash. Существо оглушается лишь один раз за применение, поэтому последующие вход или покидание области его не оглушит. Радиус оглушения находится в 20 единицах перед Spirit Breaker, поэтому он может задевать существ в 280 единицах перед ним и в 320 единицах позади Spirit Breaker. Цель оглушается при врезании в неё, а не при её попадании в радиус оглушения. В режиме Ability Draft для оглушения врагов с помощью Charge of Darkness должна быть выбрана Greater Bash.",
        "Существо оглушается лишь один раз за применение, поэтому последующие вход или покидание области его не оглушит.",
        "Радиус оглушения находится в 20 единицах перед Spirit Breaker, поэтому он может задевать существ в 280 единицах перед ним и в 320 единицах позади Spirit Breaker.",
        "Цель оглушается при врезании в неё, а не при её попадании в радиус оглушения.",
        "В режиме Ability Draft для оглушения врагов с помощью Charge of Darkness должна быть выбрана Greater Bash.",
        "Если цель умирает в момент разбега, то способность переключается на ближайшую подходящую цель в радиусе 4000 единиц от предыдущей.",
        "Разбег дает общий обзор на выбранное существо. Поэтому цель отслеживается, даже если стала невидимой.",
        "Не дает общий обзор при выборе нейтральных крипов.",
        "При завершении разбега разрушает деревья в небольшом радиусе от Spirit Breaker.",
        "Скрытый бафф применяется при достижении цели и длится 0,1 секунды. Он отвечает за Greater Bash."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "Q",
      "cooldown": "17\/15\/13\/11 (TagTalent 7)",
      "description": "Герой мчится на врага, игнорируя препятствия на своём пути. На цель разбега и любых врагов, которых он заденет, сработает способность Greater Bash. Если цель умрёт раньше, чем герой добежит до неё, то целью станет ближайший враг неподалёку.",
      "spellName": "Charge of Darkness",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: Глобальная",
        "Радиус Greater Bash: 300",
        "Доп. скорость при разбеге: 300\/325\/350\/375 (TagAghanim 475\/500\/525\/550)",
        "Длительность оглушения: 1,2\/1,6\/2\/2,4",
        "Увеличивает скорость передвижения и уменьшает перезарядку.",
        "Greater Bash все равно применяется, поскольку проходит сквозь иммунитет к заклинаниям.",
        "Блокируется только основной целью в момент применения. Если разбег уже начался, то столкновение не блокируется."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Баратрум прорывается сквозь тьму с неудержимой силой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/25\/Spirit_Breaker_Bulldoze.mp3\/revision\/latest?cb=20191216024528",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении Bulldoze прерывает произносимые заклинания Spirit Breaker.",
        "Сопротивление эффектам сочетается по закону убывающей полезности с другими источниками сопротивления."
      ],
      "mana": "30\/40\/50\/60",
      "hotKey": "W",
      "cooldown": "22\/20\/18\/16 (TagTalent 16,5\/14,5\/12,5\/10,5)",
      "description": "Герой увеличивает свои скорость передвижения и сопротивление эффектам, чтобы пробиваться через ряды врагов. Можно применить во время разбега.",
      "spellName": "Bulldoze",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость передвижения: 10%\/16%\/22%\/28%",
        "Сопротивление эффектам: 34%\/46%\/58%\/70%",
        "Длительность: 8"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Баратрум искажает ткань мироздания вокруг себя, дабы меньше подвергать физическое тело её влиянию."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Spirit_Breaker_Greater_Bash_1.mp3\/revision\/latest?cb=20191216024523",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Не сочетается с другими эффектами, дающими оглушающий удар. Оглушение от Skull Basher и Abyssal Blade отключено для Spirit Breaker. В режиме Ability Draft эти эффекты оглушения не отключаются для игрока, выбравшего Greater Bash.",
        "В режиме Ability Draft эти эффекты оглушения не отключаются для игрока, выбравшего Greater Bash.",
        "Greater Bash сначала применяет дебафф, а затем наносит урон; не имеет значение, сработала ли способность от атаки или же от заклинаний Spirit Breaker. Эффекты Greater Bash срабатывают до урона активировавшей атаки и урона Nether Strike.",
        "Эффекты Greater Bash срабатывают до урона активировавшей атаки и урона Nether Strike.",
        "Отбрасывает оглушенных существ на 143\/152\/158\/162 единиц за 0,5 сек. со скоростью в 286\/304\/316\/324. Также подбрасывает затронутых врагов на 50 единиц, образуя небольшую арку. Это действие имеет лишь визуальное значение.",
        "Также подбрасывает затронутых врагов на 50 единиц, образуя небольшую арку. Это действие имеет лишь визуальное значение.",
        "С ограничением скорости передвижения в рамках 100—550 единиц минимальный и максимальный возможный урон (до уменьшений) равен 14\/20\/26\/32 и 77\/110\/143\/176 (TagTalent 26\/32\/38\/44 и 143\/176\/209\/242).",
        "Дополнительный урон наносится отдельным источником урона и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Может сработать на Рошана, уходя на перезарядку и давая дополнительную скорость передвижения герою, но ни отбрасывание, ни оглушение к Рошану не применяются.",
        "В среднем добавляет к каждой атаке 2,38%\/3,4%\/4,42%\/5,44% от скорости передвижения Spirit Breaker в виде магического урона. С талантом на дополнительный урон в среднем добавляет к каждой атаке 4,42%\/5,44%\/6,46%\/7,48% урона. С талантом на дополнительный шанс срабатывания в среднем добавляет к каждой атаке 5,18%\/7,4%\/9,62%\/11,84% урона. С двумя талантами в среднем добавляет к каждой атаке 9,62%\/11,84%\/14,06%\/16,28% урона.",
        "С талантом на дополнительный урон в среднем добавляет к каждой атаке 4,42%\/5,44%\/6,46%\/7,48% урона.",
        "С талантом на дополнительный шанс срабатывания в среднем добавляет к каждой атаке 5,18%\/7,4%\/9,62%\/11,84% урона.",
        "С двумя талантами в среднем добавляет к каждой атаке 9,62%\/11,84%\/14,06%\/16,28% урона.",
        "Не уходит на перезарядку при срабатывании от Charge of Darkness или Nether Strike.",
        "Не действует на варды, постройки и союзных существ.",
        "Greater Bash использует псевдослучайное распределение."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Каждая атака может оглушить и оттолкнуть цель. Наносит дополнительный урон, зависящий от скорости передвижения.",
      "spellName": "Greater Bash",
      "params": [
        "Шанс оглушения: 17% (TagTalent 37%)",
        "Скорости в виде урона: 14%\/20%\/26%\/32% (TagTalent 26%\/32%\/38%\/44%)",
        "Дальность толчка: 143\/152\/158\/162",
        "Длительность толчка: 0,5",
        "Длительность оглушения: 0,9\/1,2\/1,5\/1,8",
        "Отключает оглушение от атак, но не от заклинаний."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Фирменный удар призрачного цепа Баратрума."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/ff\/Spirit_Breaker_Nether_Strike.mp3\/revision\/latest?cb=20210424160249",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Nether Strike не позволяет при использовании избегать снаряды.",
        "В момент задержки перед применением размещает дебафф скрытый дебафф на цель. Этот дебафф раскрывает модель цели в тумане войны, но не дает на неё эффект True Sight.",
        "Этот дебафф раскрывает модель цели в тумане войны, но не дает на неё эффект True Sight.",
        "Nether Strike мгновенно перемещает Spirit Breaker на противоположную сторону от цели на расстояние в 54 единицы.",
        "Мгновенно применяет к цели Greater Bash текущего уровня. Если способность не изучена, то оглушение не применяется. Дальность толчка удваивается, отталкивая существ на 286\/304\/316\/324 единиц за 0,5 сек. со скоростью 572\/608\/632\/648. Также подбрасывает затронутых врагов на 50 единиц. Оглушение применяется до нанесения урона Nether Strike. В режиме Ability Draft для применения способностью оглушения должна быть выбрана Greater Bash.",
        "Дальность толчка удваивается, отталкивая существ на 286\/304\/316\/324 единиц за 0,5 сек. со скоростью 572\/608\/632\/648.",
        "Также подбрасывает затронутых врагов на 50 единиц.",
        "Оглушение применяется до нанесения урона Nether Strike.",
        "В режиме Ability Draft для применения способностью оглушения должна быть выбрана Greater Bash.",
        "Nether Strike сначала применяет дебафф Greater Bash, затем урон от Greater Bash, истощение, а затем наносит урон. С Aghanim's Shard Spirit Breaker получает невосприимчивость к магии до воздействия на цель эффектов. Модификатор «Nether Strike» отвечает за задержку после успешного применения Nether Strike, давая на её длительность Spirit Breaker иммунитет к заклинаниям.",
        "С Aghanim's Shard Spirit Breaker получает невосприимчивость к магии до воздействия на цель эффектов.",
        "Модификатор «Nether Strike» отвечает за задержку после успешного применения Nether Strike, давая на её длительность Spirit Breaker иммунитет к заклинаниям.",
        "Spirit Breaker получает приказ атаковать цель. Этот приказ игнорирует настройки автоатаки.",
        "Можно применить на курьера, применяя к нему все эффекты.",
        "Скрытый дебафф применяется после достижения цели Charge of Darkness и длится 0,1 секунды. Он отвечает за Greater Bash."
      ],
      "mana": "125\/150\/175",
      "hotKey": "R",
      "cooldown": "90\/70\/50",
      "description": "Герой ускользает в иной мир, по возвращении появляясь рядом с жертвой и применяя на неё способность Greater Bash текущего уровня с дополнительным уроном и отбрасывая жертву вдвое дальше обычного.",
      "spellName": "Nether Strike",
      "params": [
        "Анимация применения: 1+0",
        "Дальность применения: 700",
        "Урон: 100\/175\/250 (TagTalent 300\/375\/450)",
        "Длительность истощения: 4",
        "Длительность невосприимчивости к магии: 2",
        "Эта способность наносит на 200 урона больше, применяет на жертву истощение на 4 секунды и даёт владельцу невосприимчивость к магии на 2 секунды после применения."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Баратрум на время возвращается в свою реальность, неся с собой возмездие обоих миров."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.1,
    "attrStrength": 29.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.7,
    "attrAgility": 17.0
  },
  "description": "Spirit Breaker — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Charge of Darkness, фокусируется на враге и кидается в атаку на него, игнорируя препятствия на своем пути. Любой враг, которого он заденет, и цель заклинания попадут под воздействие Greater Bash. Если цель умрет раньше, чем Spirit Breaker добежит до нее, фокус сменится на другую ближайшую цель. Вторая способность, Bulldoze, увеличивает герою скорость передвижения и сопротивление к эффектам. Третья способность, Greater Bash, дает шанс оглушить врага и отбросить его, а также, в случае успешного оглушения, увеличивает скорость передвижения. Наносит дополнительный урон, равный некоторому проценту от скорости передвижения. Ультимативной способностью, Nether Strike, Spirit Breaker ускользает в преисподнюю, по возвращении появляясь рядом с жертвой и применяя на нее Greater Bash текущего уровня с дополнительным уроном. Улучшение с Aghanim's Scepter будет использовать Greater Bash на всех врагов рядом с целью. Также увеличивается дальность применения способности и уменьшается время перезарядки.",
  "history": "Баратрум — гордое и могущественное существо, яростный первичный разум. В мир материи он пришёл, чтоб участвовать в событиях, отзвуки которых донесутся до его родной первичной вселенной. Сам собрал своё тело Баратрум, и послужит оно ему как в нашем мире, так и за его пределами. Его бренная оболочка черпает силы из нашей вселенной, объединяет она формы быка и обезьяны: рога, копыта и лапы воплощают его силу, скорость и ловкость. Кольцо в носу напоминает Баратруму, что служит он тайному господину и что мир, где трудится он, — лишь тень настоящего бытия.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+800 к здоровью",
      "talentRight": "+20% к шансу Greater Bash"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−5,5 сек. перезарядки Bulldoze",
      "talentRight": "+12% к урону от Greater Bash"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+40 к урону",
      "talentRight": "+10 здоровья в секунду"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+4 к броне",
      "talentRight": "+500 к ночному обзору"
    }
  ]
}