{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e1\/Aeon_Disk.mp3\/revision\/latest?cb=20171111013143",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Срабатывает при получении урона, превышающего 0 (до уменьшений), от вражеских или союзных игроков. Не срабатывает от урона, наносимого себе или помеченного как отнимающий здоровье.",
        "Не срабатывает от урона, наносимого себе или помеченного как отнимающий здоровье.",
        "При активации однократно применяет сильное развеивание к владельцу.",
        "Дает владельцу 100% уменьшение получаемого урона, но не его отрицание. Отнимающий здоровье урон не уменьшается. То есть усиление получаемого урона можно противопоставить эффекту.",
        "То есть усиление получаемого урона можно противопоставить эффекту.",
        "Также дает владельцу 100% уменьшение наносимого урона, поэтому урон им не наносится, если у владельца нет усиления наносимого урона.",
        "Также дает 75% сопротивления эффектам; сочетается по закону убывающей полезности с другими источниками сопротивления.",
        "Источник урона, активировавший Combo Breaker, нивелируется. Но, если здоровье владельца было выше 70%, оно исчезнет, но не упадет ниже 70%.",
        "Но, если здоровье владельца было выше 70%, оно исчезнет, но не упадет ниже 70%.",
        "Не защищает от мгновенно убивающих эффектов."
      ],
      "mana": null,
      "abilityName": "Combo Breaker",
      "cooldown": "105",
      "description": "Если здоровье владельца упадёт ниже 70%, он получит магический щит, который сильным очищением развеет большинство эффектов, а также на 2,5 сек. увеличит сопротивление эффектам на 75% и не даст наносить или получать урон. Срабатывает только от урона игроков.",
      "params": [
        "Граница здоровья: 70%",
        "Уменьшение получаемого\/наносимого урона: 100%",
        "Сопротивление эффектам: 75%",
        "Длительность: 2,5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3100",
  "lore": null,
  "consistFrom": [
    "Vitality Booster",
    "Energy Booster",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Aeon Disk",
  "description": "Могущественный артефакт, давным-давно, как поговаривают, выкраденный из Белого инкубатория.",
  "trivia": [
    "Рабочее название предмета до обновления от 30 ноября 2017 - Combo Breaker."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+300 к здоровью",
    "+300 к мане"
  ],
  "tips": [
    "Покупка Blink Dagger вместе с ним желательна, так как противник попытается вызвать срабатывание Combo Breaker издалека, чтобы включить его перезарядку. Также если вы прыгнете в середину боя, вы заставите врагов атаковать вас. В центре боя даже при нулевом уроне вы можете использовать сильные негативные эффекты, например Arctic Blast для замедления скорости передвижения и атаки противника. Вы также можете применять эффекты проклятия, оглушения, обезоруживания или безмолвия для спасения союзников. Хотя ваш герой и не наносит урона, вы можете атаковать при помощи Necronomicon.",
    "В центре боя даже при нулевом уроне вы можете использовать сильные негативные эффекты, например Arctic Blast для замедления скорости передвижения и атаки противника.",
    "Вы также можете применять эффекты проклятия, оглушения, обезоруживания или безмолвия для спасения союзников.",
    "Хотя ваш герой и не наносит урона, вы можете атаковать при помощи Necronomicon.",
    "Защищает от большого распределённого по времени урона, например от Skywrath Mage, Windranger или особой способности Witch Doctor.",
    "Может защитить от таких мощных эффектов, как Black Hole, Chronosphere, Shackles, проклятие и Bloodthorn. Комбинируйте его с предметами, помогающими сбежать ( Town Portal Scroll, Shadow Blade, Force Staff и Shiva's Guard) для побега от нападения.",
    "Комбинируйте его с предметами, помогающими сбежать ( Town Portal Scroll, Shadow Blade, Force Staff и Shiva's Guard) для побега от нападения.",
    "После Combo Breaker можно активировать Blade Mail для большей выживаемости. Не используйте Blade Mail до или во время Combo Breaker, так как урон не будет возвращаться.",
    "Не используйте Blade Mail до или во время Combo Breaker, так как урон не будет возвращаться.",
    "Если у вас имеются источники быстрого урона, например Dagon, не используйте их во время действия Combo Breaker."
  ]
}