{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Refresher_Orb.mp3\/revision\/latest?cb=20141214200918",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Прерывает произносимые заклинания при применении.",
        "Обновляет предметы только в инвентаре использовавшего. Предметы в тайнике, в инвентарях других юнитов или выброшенные предметы не будут затронуты.",
        "Обновляет только те предметы, которыми владеет заклинатель. Предметы союзников в инвентаре не будут обновлены.",
        "Обновляет все заклинания у использовавшего. Это включает скрытые или неактивные заклинания (например способности с Invoke или Battle Cry). Это значит что предмет не обновит все заклинания для Rubick. Украденные заклинания обновляются только если герой владеет ими во время использования предмета.",
        "Это значит что предмет не обновит все заклинания для Rubick. Украденные заклинания обновляются только если герой владеет ими во время использования предмета.",
        "Также обновляет все заряды способностей основаных на механике зарядов.",
        "Не обновляет перезарядку Cloak and Dagger и таймеры крита\/уклонения Drunken Brawler.",
        "Визуально обновляет перезарядку Tranquil Boots, однако это не пропустит неактивное состояние.",
        "Не сбрасывает перезарядку Refresher Shard, Ex Machina и других Refresher Orb.",
        "Не делит перезарядку с Refresher Shard."
      ],
      "mana": "300",
      "abilityName": "Reset Cooldowns",
      "cooldown": "160",
      "description": "Сбрасывает время перезарядки всех ваших предметов и способностей.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "5000",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Perseverance",
    "Recipe"
  ],
  "boughtFrom": "Магия",
  "name": "Refresher Orb",
  "description": "Могущественный артефакт, созданный для волшебников.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+13 к регенерации здоровья",
    "+12 к регенерации маны"
  ],
  "tips": null
}