{"abilities":[{"spell":"Огненная ярость героя отталкивает всех врагов неподалёку на определённое расстояние, наносит им урон и накладывает на них бессилие.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Обезоруживание применяется одновременно с отталкиванием, а не после него.","У отталкивания нет фиксированной дистанции. Оно толкает каждого врага, пока они не достигнут расстояния в 550 от точки применения. Поэтому минимальная дистанция равна 50.","Длительность отталкивания всегда равна 0.6, поэтому скорость варьируется между 83.33 и 916.67 в зависимости от расстояния.","Враги во время отталкивания не обезвреживаются, поэтому могут свободно действовать, но не атаковать или передвигаться.","Может оттолкнуть юнитов на непроходимую территорию. Любые деревья, с которым сталкиваются юниты, разрушаются.","Не может оттолкнуть Рошана, но наносит ему урон и обезоруживает.","Inner Fire сначала наносит урон, затем применяет дебафф."],"mana":"75\/100\/125\/150","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"18\/16\/14\/12","name":"Inner Fire","description":["Анимация применения: 0,2+0,64","Радиус: 500","Урон: 100\/155\/210\/265","Макс. дистанция отталкивания: 550","Длительность отталкивания: 0.6","Длительность обезоруживания: 1.75\/2.5\/3.25\/4"],"hot_key":"Q","legacy_key":"V"},{"spell":"Huskar поджигает свои копья, нанося периодический урон своей обычной атакой. Дополнительный урон складывается с несколькими атаками. Каждая атака поглощает часть здоровья Huskar. Длится 8 секунд.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Магический ( Чистый)"],"notes":["Расход здоровья (15) - это способность, напрямую отнимающая здоровье.","Этой способностью нельзя совершить самоубийство.","Способность при автоприменении использует дальность атаки Huskar в 400 ( 575) единиц. Ручное применение использует дальность применения в 450 ( 625) единиц.","Эффекты от этой способности складываются при нескольких использований на цель. Каждая атака размещает на цель дебафф Burning Spear Debuff. Число атак отображается и складывается в одной иконке в статус-баре атакуемого врага. Число в иконке отображает количество зарядов. Оно видно всем. Длительность каждой атаки не зависит от других зарядов. Они не продляются и не обновляются от новых зарядов. Дебафф Burning Spear Counter размещается один раз и обновляется при успешных применениях. Дебафф наносит урон равный 5\/10\/15\/20 ( 15\/20\/25\/30) единиц урона за каждый заряд спустя 1 секунду после размещения дебаффа.","Всего наносит 40\/80\/120\/160 ( 120\/160\/200\/240) единиц урона за заряд Burning Spear (до учета сопротивления).","Нельзя применять к строениям, вардам и союзным юнитам."],"mana":"0","elements":["Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Burning Spear","description":["Дальность применения: 450 ( 625)","Здоровья за удар: 15","Периодический урон: 5\/10\/15\/20 ( 15\/20\/25\/30)","Длительность: 8"],"hot_key":"W","legacy_key":"R"},{"spell":"Раны делают героя сильнее, увеличивая его скорость атаки и восстановление здоровья в зависимости от доли недостающего здоровья. Восстановление зависит от силы героя.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Размер модели Huskar увеличивается на 35%, чем ближе он к максимальному бонусу от Berserker's Blood.","Несмотря на то, что интерфейс не ототбражает десятичные значения, каждая потерянная единица здоровья дает бонусы.","Бонус увеличивается экспоненциально, достигая максимума тем быстрее, чем ниже здоровье владельца.","Бонусы не применяются при 100% здоровья, но максимальное их значение применяется при уровне здоровья ниже 10%.","Процент здоровья периодически проверяется и эффекты мгновенно к нему адаптируются."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Berserker's Blood","description":["Макс. доп. скорость атаки: 160\/220\/280\/340","Макс. регенерация от силы: 20%\/40%\/60%\/80%","Здоровья для макс. эффекта: 10%"],"hot_key":"E","legacy_key":"B"},{"spell":"Huskar ценой собственного здоровья наносит огромный урон врагу. Он прыгает к цели в радиусе своей атаки, отнимая часть ее текущего здоровья и замедляя ее. Во время прыжка Huskar невосприимчив к заклинаниям.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Huskar прыгает со скоростью в 1200 единиц.","При использовании применяет к Huskar базовое развеивание.","При использовании Huskar получает бафф Life Break Charge, который длится 5 секунд или до достижения Huskar цели в зависимости от того, что произойдет раньше. Этот модификатор дает Huskar иммунитет к заклинаниям, обезоруживание, заставляет развернуться лицом к цели и отвечает за анимацию прыжка. Поскольку у модификатора есть установленная максимальная длительность, то она может истечь в момент прыжка, продолжая оставшуюся часть прыжка без эффектов.","Huskar может использовать предметы и заклинаниям в момент прыжка. При этом эффекты, меняющие позицию (например, Blink Dagger), отменят прыжок.","Урон, наносимый себе - магический. Поэтому его можно снизить с помощью сопротивления магии. Урон, наносимый себе, не летальный, без разницы, насколько он был усилен. Huskar не может совершить самоубийство с помощью Life Break. Урон, наносимый себе, наносится при попадании и не наносится при преждевременном прерывании прыжка.","Если во время прыжка Huskar будет обезврежен или цель передвинется на расстояние более 1450 единиц, то прыжок остановится.","Life Break сначала наносит урон, а затем применяет дебафф.","Не может выбрать в качестве цели курьера."],"mana":"0","elements":["Нельзя избежать.","Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"12 ( 4)","name":"Life Break","description":["Анимация применения: 0,3+0,5","Дальность применения: 550 ( 950)","Текущего здоровья в урон по себе: 32%\/38%\/44%","Текущего здоровья цели в урон: 32%\/38%\/44% ( 65%)","Замедление скорости передвижения: 40%\/50%\/60%","Длительность замедления: 4\/5\/6"],"hot_key":"R","legacy_key":"F"}],"bio":"Очнувшись от агонии священного мира Нотл, воин открыл глаза и узрел, как одарённый жрец теней накладывает на него глубокое заклятие. Вопреки древним обрядам ордена Дезун душа воина была спасена от вечности, но, как и все побывавшие в мире Нотл, он необратимо изменился. Более неподвластная смертной плоти, его кровь обратилась источником невообразимой силы; каждая пролитая капля с лихвой возвращалась лютой, горящей мощью. Однако новообретённый дар разъярил спасённого, ведь жрец теней лишил его места среди богов, отказал в собственном священном жертвоприношении. Со временем старайшины ордена собрались расширить своё влияние и согласились между собой, что такой внушительный боец пригодится в грядущих кампаниях. Однако воин не желал быть жалким оружием ордена, что отказал ему в родовых правах. Когда на горизонте воспылали первые огни восходящей войны, он покинул отчий дом, чтобы найти новых союзников и достойный повод выпустить силу, что придёт с его безраздельным самопожертвованием.","talentsTips":["Увеличение дальности атаки также влияет на дальность применения способности Burning Spear.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма.","Талант на силу в общем даёт Huskar: 400 здоровья, 2 регенерации здоровья, 1.6% сопротивления магии и 20 урона от атаки."],"trivia":["Имя Huskar могло быть получено от старого норвежского слова \"Huskarl\". Это имя носили высококвалифицированные телохранители важных норвежских лордов и королей.","Также, его имя может быть отсылкой к Уаскар, правителю Империи Инков 16 века. По истории Huskar связан с Dazzle, жрецом теней (что похоже на шаманов коренных народов Америки)."],"talents":["Burning Spear наносит чистый урон сквозь защиту от магии:+175 к дальности атаки","+400 к дальности применения Life Break:+20 к силе","+15% к вампиризму:+10 к урону в секунду от Burning Spear","+15 к урону:+225 к здоровью"],"tips":["Вы можете использовать Inner Vitality до того, как вступите в драку. Так вы снизите полученный урон.","Burning Spear и Life Break понижают уровень вашего здоровья, но в тоже время повышают бонус от Berserker's Blood. Berserker's Blood отключается способностью Doom.","Помните, что урон от нескольких Burning Spear складываются. Можно использовать это, чтобы нанести больше количество урона врагу.","Никогда не используйте Life Break на врага неуязвимого к заклинаниям. Вы нанесете себе повреждения, а врагу будет дано только замедление, но не урон.","Никогда не используйте Life Break на врага, использующего Blade Mail, пока не станете неуязвимым к заклинаниям, вы рискуете умереть сразу после завершения заклинания. При атаке такого врага обязательно используйте Black King Bar, чтобы не получать урон по себе от действия предмета Blade Mail.","Black King Bar – один из основных предметов для героя, поскольку под его действием вы не получаете урон от использования Life Break. Также, такое можно использовать, при наличии некоторых союзников в команде. Например, отлично подходит герой Omniknight - он также может дать герою невосприимчивость к магии, или после прыжка к противнику - вылечить вас."],"desc":"Huskar — это герой с дальним типом атаки, основной характеристикой которого является сила. Его первая способность, Inner Fire, отталкивает всех врагов неподалёку на определённое расстояние, наносит им урон и накладывает на них бессилие. Вторая способность, Burning Spear, наносит периодический урон огнем. Дополнительный урон складывается с несколькими атаками. Каждая атака поглощает часть здоровья Huskar. Пассивная способность, Berserker's Blood, увеличивает скорость атаки и восстановление здоровья в зависимости от количества недостающего здоровья. Чем меньше у героя здоровья - тем сильнее бонусы от пассивной способности. Ультимативной способностью, Life Break, Huskar прыгает к цели в радиусе своей атаки, отнимая часть ее текущего здоровья и замедляя ее. Улучшение с Aghanim's Scepter увеличивает наносимый урон и уменьшает время перезарядки."}