{
  "abilities": [
    {
      "spell": "Hurls a poisoned dagger which deals large initial damage, and then deals damage over time. The poisoned unit has its movement speed slowed for 15 seconds. An instance of damage is dealt every 3 seconds.",
      "effects": [
        "Ability Target Unit \/ Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The dagger travels at a speed of 900.",
        "The slow decreases in 1 second intervals. This is how much Shadow Strike slows on each level at each second: Level 1: 20.0% \/ 16.3% \/ 13.1% \/ 10.3% \/ 8.1% \/ 6.2% \/ 4.7% \/ 3.5% \/ 2.5% \/ 1.8% \/ 1.3% \/ 0.9% \/ 0.6% \/ 0.4% \/ 0.3% Level 2: 30.0% \/ 24.5% \/ 19.6% \/ 15.5% \/ 12.1% \/ 9.3% \/ 7.0% \/ 5.2% \/ 3.8% \/ 2.8% \/ 2.0% \/ 1.4% \/ 1.0% \/ 0.6% \/ 0.4% Level 3: 40.0% \/ 32.6% \/ 26.2% \/ 20.7% \/ 16.1% \/ 12.4% \/ 9.3% \/ 7.0% \/ 5.1% \/ 3.7% \/ 2.6% \/ 1.8% \/ 1.3% \/ 0.9% \/ 0.6% Level 4: 50.0% \/ 40.8% \/ 32.7% \/ 25.9% \/ 20.1% \/ 15.5% \/ 11.7% \/ 8.7% \/ 6.4% \/ 4.6% \/ 3.3% \/ 2.3% \/ 1.6% \/ 1.1% \/ 0.7%",
        "A unit with less than 25% of its maximum health can be denied when it has the Shadow Strike debuff on.",
        "Deals the initial damage upon impact and the damage over time in 3 second intervals, resulting in overall 6 damage instances.",
        "Can deal up to 200\/300\/400\/500 damage to the target (before reductions).",
        "Successive casts on the same target remove the debuff from the previous cast and place a new one. This means the initial damage is dealt again, and the slow value and tick interval are effectively reset.",
        "The level 20 talent adds a 650 radius to this spell. The targeting reticule must be centered over an enemy unit. Upon cast, Queen of Pain sends daggers towards every enemy within the radius. These behave just like a regular cast, and can be disjointed normally. Also targets units inside the fog of war and invisible units. However, invisible targets instantly disjoint it."
      ],
      "mana": "110",
      "elements": [
        "Can be disjointed.",
        "Partially blocked by Linken's Sphere.",
        "Does not pierce spell immunity."
      ],
      "cooldown": "16\/12\/8\/4 ( 14.08\/10.56\/7.04\/3.52)",
      "name": "Shadow Strike",
      "description": [
        "Cast Animation: 0.4+0.67",
        "Cast Range: 450\/500\/550\/600",
        "Radius: 0 ( 650)",
        "Initial Damage: 50\/75\/100\/125",
        "Number of Instances: 5",
        "Damage per Instance: 30\/45\/60\/75",
        "Move Speed Slow: 20%\/30%\/40%\/50%",
        "Duration: 15"
      ],
      "hot_key": "Q",
      "legacy_key": "D"
    },
    {
      "spell": "Short distance teleportation that allows Queen of Pain to move in and out of combat.",
      "effects": [
        "Ability Target Point",
        "Affects Self"
      ],
      "notes": [
        "Disjoints projectiles upon cast.",
        "Does not blink for the full distance when targeting closer than the max distance.",
        "When targeting beyond the max blink distance, Queen of Pain will blink for the max distance towards the targeted point."
      ],
      "mana": "60",
      "elements": [
        "Cannot be cast while rooted or leashed."
      ],
      "cooldown": "15\/12\/9\/6 ( 13.2\/10.56\/7.92\/5.28)",
      "name": "Blink",
      "description": [
        "Cast Animation: 0.33+0.07",
        "Cast Range: Global",
        "Max Blink Distance: 1300"
      ],
      "hot_key": "W",
      "legacy_key": "B"
    },
    {
      "spell": "The Queen of Pain lets loose a piercing scream around her, damaging nearby enemies.",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Scream of Pain interrupts Queen of Pain's channeling spells upon cast.",
        "The projectiles travel at a speed of 900.",
        "Affects invisible units and units in the Fog of War.",
        "Does not affect invulnerable or hidden units.",
        "The talent adds fear to Scream of Pain, forcing them to run towards their team's fountain, while preventing them from acting. When hitting neutral creeps, they retreat to their camps instead. The scream first applies the damage, then the debuff."
      ],
      "mana": "95\/110\/125\/140",
      "elements": [
        "Cannot be disjointed.",
        "Does not pierce spell immunity."
      ],
      "cooldown": "7 ( 6.16)",
      "name": "Scream of Pain",
      "description": [
        "Cast Animation: 0+0.63",
        "Search Radius: 475",
        "Damage: 75\/150\/225\/300",
        "Fear Duration: 0 ( 1.5)"
      ],
      "hot_key": "E",
      "legacy_key": "F"
    },
    {
      "spell": "Creates a gigantic wave of sound in front of Queen of Pain, dealing heavy damage to all enemy units in its wake and pushing them back.",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Sonic Wave travels at a speed of 900, taking 1 second to travel the full distance.",
        "Can hit units up to 1350 range away (travel distance + end radius).",
        "The complete area is shaped like a cone.",
        "The knockback angle depends on the angle between the hit target and Queen of Pain's cast location. This means the knockback direction does not equal the cast direction. Very close enemies may get pushed to the sides. Knocks hit enemies 350 range back over 1.4 seconds, resulting in a speed of 250.",
        "The knockback destroys trees around the units while being moved.",
        "Sonic Wave first applies its damage, then the knockback debuff.",
        "Fully affects couriers."
      ],
      "mana": "250\/360\/500",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "135 ( 118.8) ( 40, 35.2)",
      "name": "Sonic Wave",
      "description": [
        "Cast Animation: 0.452+0.9",
        "Cast Range: 700",
        "Starting Radius: 100",
        "Travel Distance: 900",
        "End Radius: 450",
        "Damage: 320\/410\/500 ( 370\/480\/590)",
        "Knockback Distance: 350",
        "Knockback Duration: 1.4"
      ],
      "hot_key": "R",
      "legacy_key": "W"
    },
    {
      "spell": "There is no description for this ability.",
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Does not block spells cast by allies.",
        "Does not block Ion Shell, Toss, and Snowball.",
        "Does not block Urn of Shadows, Spirit Vessel, Medallion of Courage, and Solar Crest.",
        "For a list of blocked spells, see Spell Block.",
        "Fully stacks with the Spell Block of Linken's Sphere, with the one acquired first also proccing first.",
        "Cooldown reductions fully affect the cooldown, but cooldown resets do not."
      ],
      "mana": "0",
      "elements": [
        "Cannot be used by illusions.",
        "Pierces spell immunity."
      ],
      "cooldown": "15",
      "name": "Spell Block",
      "description": []
    }
  ],
  "bio": "The Ecclesiast-King of Elze nursed a desire for pain — forbidden pain. In a less prominent political figure, such desires might be considered unwise, but in a monarch of his stature, to satisfy such thirsts would have threatened the virtue of the Divine Throne itself. Therefore he turned to his dungeon full of demonologists, promising freedom to whoever could summon a personal succubus of torment and bind it entirely to his service. The creature who arrived, Akasha by name, visited upon him such exquisite torments that he named her his Secret Queen, and he began to spend all his spare moments submitting to her clever torments—eventually abdicating all his responsibilities in his pursuit of the painful pleasures that only she could bring. Queen of Pain could bring him to the brink of death, but she was rune-bound to keep him alive. At last the King's neglect of state brought on an uprising. He was dragged from his chamber and hurled from the Tower of Invocations, and at the moment of death, Queen of Pain was let loose into the world, freed from servitude—freed to visit her sufferings on anyone she deigned to notice.",
  "talentsTips": [
    "The strength talent effectively grants Queen of Pain 180 health, 1 health regen and 0.8% magic resistance.",
    "This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.",
    "The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction.",
    "The spell lifesteal talent stacks additively with other sources of spell lifesteal.",
    "The spell lifesteal talent heals for 6% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions."
  ],
  "trivia": [
    "Akasha is the name (or variant of the name) of the fifth element in many religions such as Hinduism, Wicca (or other Neopaganism), with its roots deriving from ancient Paganism. \"Akasha\", when translated to English (from Sanskrit), means \"aether\" (air\/spirit, depending on context). This element is seen\/represented as the top point of a pentagram, a symbol sometimes misused as one of evil (there is no devil-esque figure in Paganism), and could have been intended to show or derive from Queen of Pain's sadistic nature. Doom's Doom skill icon is a regular pentagram, so it might be a misconception held by the DotA staff and reasoning for her name. A regular pentagram on someone, ignoring misconceptions, is actually protective. The name Aether is one of the many references Dota 2 makes to Greek mythology, as it is derived from a Greek deity of the same name. Akasha is also the name of the Queen of the Damned from Anne Rice's Vampire Chronicles novel series, which could have inspired Queen of Pain's name, who, in turn, could have derived her name from the above roots.",
    "Scream of Pain's and Sonic Wave's sounds are based on some voice lines of Queen of Pain. Scream of Pain is based on this Play, while Sonic Wave uses a part of this Play.",
    "Queen of Pain's dying line \"Your queen is dead\" is possibly a reference to The Smiths' album, The Queen is Dead.",
    "Most of Queen of Pain's abilities were derived from the Warcraft III Night Elf hero, the Warden, with Sonic Wave being the only new ability introduced, replacing Vengeance. Fan of Knives was also substituted for Scream of Pain with the same effect, though an older version of Queen of Pain did have the Fan of Knives ability.",
    "Queen of Pain's response for killing Phantom Assassin \"Blink! You're dead.\" likely refers to the popular Dr. Who episode \"Don't Blink\" in which the Doctor says, referring to Weeping Angels, \"Don't blink, don't even blink. Blink, and you're dead.\"",
    "This line \"The Queen is dead, long live the Queen.\" is a reference to the movie Robin Hood (2010), when Prince John received King Richard's crown from Eleanor of Aquitaine."
  ],
  "talents": [
    "15s Spell Block:Scream of Pain 1.5s Fear",
    "650 AoE Shadow Strike:30% Spell Lifesteal",
    "+40 Attack Speed:12% Cooldown Reduction",
    "+10 Strength:+25 Damage"
  ],
  "desc": "Akasha the Queen of Pain is a ranged intelligence hero who uses her abilities to close in and deal huge area damage to the enemy. She is typically played in the middle lane as a ganker and semi-carry, with her ability to appear in battle and deal damage in quick succession, as well as hunt down fleeing heroes with ease. Her Blink ability is the lynchpin of her skill set, allowing her to enter and leave fights at her whim. Once in position to attack, Akasha can unleash her Scream of Pain and Sonic Wave, able to devastate an entire team at once. Chasing down straggling prey is another of her fortes, with Shadow Strike crippling their ability to escape. Akasha is very adept at getting kills early in the game, and transitions very well into a semi-carry if she acquires the proper items."
}