{"abilities":[{"spell":"Бросает кинжал, который наносит урон при попадании и отравляет цель на 15 секунд. Жертва передвигается медленнее и каждые 3 секунды получает урон от яда.","effects":["Способность Направленная на юнита \/ Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Кинжал летит со скоростью 900 единиц.","Замедление уменьшается каждую секунду. Здесь указано, как Shadow Strike замедляет с каждой секундой на каждом уровне: Уровень 1: 20,0%\/16,3%\/13,1%\/10,3%\/8,1%\/6,2%\/4,7%\/3,5%\/2,5%\/1,8%\/1,3%\/0,9%\/0,6%\/0,4%\/0,3% Уровень 2: 30,0%\/24,5%\/19,6%\/15,5%\/12,1%\/9,3%\/7,0%\/5,2%\/3,8%\/2,8%\/2,0%\/1,4%\/1,0%\/0,6%\/0,4% Уровень 3: 40,0%\/32,6%\/26,2%\/20,7%\/16,1%\/12,4%\/9,3%\/7,0%\/5,1%\/3,7%\/2,6%\/1,8%\/1,3%\/0,9%\/0,6% Уровень 4: 50,0%\/40,8%\/32,7%\/25,9%\/20,1%\/15,5%\/11,7%\/8,7%\/6,4%\/4,6%\/3,3%\/2,3%\/1,6%\/1,1%\/0,7%","Юнит под воздействием этой способности может быть добит союзниками, если уровень его здоровья опустится ниже 25%.","Наносит начальный урон при попадании и периодический урон с интервалом в 3 секунды, нанося урон 6 раз.","Может нанести до 200\/325\/450\/575 единиц урона по цели (до учета сопротивления).","Несколько применений способности обновляют длительность замедления и периодического урона и наносят начальный урон.","Талант на 20 уровне добавляет способности применение по области в 650 единиц. Перекрестие должно находится на вражеском юните. При использовании Queen of Pain посылает кинжалы каждому врагу в радиусе. Эти кинжалы действуют как и при обычном применении способности и их можно избежать. Также выбирает юнитов в тумане войны и невидимых юнитов. При этом невидимые юниты могут их мгновенно избежать."],"mana":"110","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/12\/8\/4 ( 14.08\/10.56\/7.04\/3.52)","name":"Shadow Strike","description":["Анимация применения: 0,4+0,67","Дальность применения: 450\/500\/550\/600","Радиус: 0 ( 650)","Начальный урон: 50\/75\/100\/125","Кол-во тиков: 5","Урон за тик: 30\/50\/70\/90","Замедление скорости передвижения: 20%\/30%\/40%\/50%","Длительность: 15"],"hot_key":"Q","legacy_key":"D"},{"spell":"Телепортация на короткую дистанцию, позволяющая ворваться в схватку или быстро из неё сбежать.","effects":["Способность Направленная на точку","Действует на Себя"],"notes":["Можно использовать для избежания летящих в вас снарядов.","Не телепортирует на полное расстояние при выборе точки, находящейся на меньшем расстоянии, чем максимальное.","При выборе точки, находящейся дальше, чем это позволяет способность, дистанция перемещения будет максимальной."],"mana":"60","elements":["Нельзя применять в оцепенении."],"cooldown":"15\/12\/9\/6 ( 13.2\/10.56\/7.92\/5.28)","name":"Blink","description":["Анимация применения: 0,33+0,07","Дальность применения: Глобальная","Макс. дальность телепортации: 1300"],"hot_key":"W","legacy_key":"B"},{"spell":"Герой издаёт пронзительный вопль, нанося урон всем врагам поблизости.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При использовании Scream of Pain прерывает произносимые способности Queen of Pain.","Снаряды летят со скоростью в 900 единиц.","Поражает невидимых юнитов и юнитов в тумане войны.","Не поражает неуязвимых или спрятанных юнитов.","Талант добавляет к Scream of Pain эффект страха, заставляя юнитов бежать к их фонтану, предотвращая совершение каких-либо действий. При поражении нейтральных крипов они возвращаются к своим лагерям."],"mana":"80\/100\/120\/140","elements":["Нельзя избежать.","Блокируется иммунитетом к заклинаниям."],"cooldown":"7 ( 6.16)","name":"Scream of Pain","description":["Анимация применения: 0+0,63","Радиус: 475","Урон: 75\/150\/225\/300","Длительность страха: 0 ( 1,5)"],"hot_key":"E","legacy_key":"F"},{"spell":"Создаёт перед героем гигантскую звуковую волну, наносящую огромный урон всем вражеским существам и отталкивающую их.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Чистый"],"notes":["Sonic Wave летит со скоростью 900 единиц; требуется 1 секунда, чтобы преодолеть всю дистанцию.","Может поражать юнитов на расстоянии до 1350 единиц (складывается из дистанции прохождения и конечного радиуса).","Полная площадь имеет форму конуса.","Угол отталкивания зависит от угла между целью и точкой применения способности Queen of Pain. То есть направление отталкивания не равно направлению применения. Близко находящихся врагов может просто откинуть в стороны. Откидывает врагов на расстояние 350 за 1.4 секунды со скоростью 250.","Отброшенные юниты разрушают деревья при перемещении.","Sonic Wave сначала наносит урон, затем применяет дебафф отталкивания.","Действует на курьеров."],"mana":"250\/360\/500","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"135 ( 118.8) ( 40, 35.2)","name":"Sonic Wave","description":["Анимация применения: 0,452+0,9","Дальность применения: 700","Начальный радиус: 100","Дистанция прохождения: 900","Конечный радиус: 450","Урон: 340\/430\/520 ( 390\/500\/610)","Дистанция отталкивания: 350","Длительность отталкивания: 1.4"],"hot_key":"R","legacy_key":"W"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Не блокирует способности, примененные союзниками.","Не блокирует Ion Shell, Toss и Snowball.","Чтобы увидеть список блокируемых способностей, смотрите механику блокировки заклинаний.","Полностью сочетается с способностью Spell Block у Linken's Sphere.","Снижение времени перезарядки работает на перезарядку способности, но сброс перезарядки - нет."],"mana":"0","elements":["Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"15","name":"Блокировка заклинания","description":[]}],"bio":"Правитель и верховный жрец королевства Эльзе таил страсть к боли — запретной боли. У обычного сановника такие желания сочли бы неразумными, но прознай кто, что им предаётся монаршья особа, вся вера в праведность самого Божественного престола оказалась бы под угрозой. Потому король обратился к пленным демонологам, обещая свободу тому, кто сможет призвать суккуба мучений и подчинить её воле правителя. Так и явилась в наш мир сущность по имени Акаша, и доставляла она столь изысканные муки, что монарх прозвал её своей тайной королевой и стал проводить с ней каждую свободную минуту, отдаваясь изощрённым мукам. Со временем он оставил все свои королевские обязанности в погоне за сладострастными страданиями, что могла принести лишь его королева. Она доводила его до полусмерти, однако руны повиновения сдерживали её, сохраняя правителю жизнь. В конце концов народ восстал против нерадивого монарха: его вытащили из покоев и сбросили с башни заклинателей. Стоило ему умереть, как Акаша обрела свободу, сбросила свои оковы... и теперь несёт мучения каждому, кто ей приглянется.","talentsTips":["Талант на силу в общем даёт Queen of Pain: 200","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки.","Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.","Талант вампиризма заклинаний лечит на 6% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."],"trivia":["Акаша - название (или его вариант) пятого элемента во многих религиях(например,в индуизме или неоязычестве). В переводе с санскрита, это слово переводится как \"эфир\"(или в зависимости от контекста как \"воздух\" или \"дух\". Символ этого элемента также находится на вершине пентаграммы. Возможно, разработчики таким образом хотели подчеркнуть садистскую сущность Queen of Pain. Имя Эфир (Зефир) - одна из многих отсылок к древнегреческой мифологии, где так звали бога западного ветра. Акашей также зовут Королеву Проклятых из романа Энн Райс \"Вампирские Хроники\", который мог подсказать разработчикам имя для Queen of Pain.","Озвучки Scream of Pain и Sonic Wave основаны на репликах Queen of Pain: Scream of Pain - на этой Играть, в то время, как Sonic Wave - на отрывке из этойИграть."],"talents":["Блокировка направленных заклинаний с перезарядкой в 15 сек.:Scream of Pain накладывает страх на 1,5 сек.","Shadow Strike в радиусе 650 вокруг героя:+30% к вампиризму способностями","+40 к скорости атаки:-12% перезарядки способностей","+10 к силе:+25 к урону"],"tips":["Способности данного героя направлены на сокрушительный урон и внезапность. Используйте Blink, чтобы влететь в схватку, а затем применить Scream of Pain и Sonic Wave. Однако, учтите что за это время противники могут выжить и смогут нанести ответный удар. В таких случаях, Blink нужно тратить только на побег от врагов, не тратя его в начале сражения."],"desc":"%"}