{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/07\/Blink_Dagger_Blink_1.mp3\/revision\/latest?cb=20191227195354",
      "effects": [
        "Дальность применения: Глобальная",
        "Максимальная дистанция телепортации: 1200",
        "Неполная дистанция телепортации: 960",
        "Перезарядка при получении урона: 3"
      ],
      "notes": [
        "Двойной щелчок по Blink Dagger переместит вас в сторону вашего фонтана, используя неполную дистанцию телепортации.",
        "Избегает снаряды при применении.",
        "Не телепортирует на полную дистанцию, если использовать ближе, чем максимальная дистанция.",
        "При использовании дальше максимальной дистанции телепортации, перемещает на расстояние 960 в указанном направлении, вместо 1200.",
        "Второй звук воспроизводится только тогда, когда дистанция телепортации больше, чем 960. Звук слышен всем.",
        "Урон свыше 0 от игрока (включая союзников, исключая себя) или Рошана увеличивает перезарядку Blink Dagger на 3 секунд. Во время перезарядки и вне её, Blink Dagger можно перезарядить при помощи Refresher Orb, Refresher Shard и Rearm. Однако, на перезарядку не влияет Octarine Core или руна волшебства. Не уходит на перезарядку уроном, помеченным как отнимающий здоровье.",
        "Во время перезарядки и вне её, Blink Dagger можно перезарядить при помощи Refresher Orb, Refresher Shard и Rearm.",
        "Однако, на перезарядку не влияет Octarine Core или руна волшебства.",
        "Не уходит на перезарядку уроном, помеченным как отнимающий здоровье.",
        "Не делит перезарядку с Fallen Sky."
      ],
      "mana": null,
      "abilityName": "Blink",
      "cooldown": null,
      "description": "Мгновенно перемещает к указанной точке на расстоянии до 1200. Предмет нельзя использовать, если последние 3 сек. его владелец получал урон от вражеских героев или Рошана.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2250",
  "lore": null,
  "consistFrom": null,
  "name": "Blink Dagger",
  "description": "Легендарный кинжал, которым когда-то пользовался самый быстрый убийца на свете.",
  "trivia": null,
  "upgradeIn": [
    "Overwhelming Blink",
    "Swift Blink",
    "Arcane Blink"
  ],
  "tips": null
}