{
  "abilities": [
    {
      "notes": [
        "Дальность применения Impetus зависит от дальности атаки. Дальность применения может быть увеличена бонусами дальности атаки, но не дальности применения",
        "Дистанция рассчитывается в тот момент, когда снаряд достигнет цель. То есть, увеличение расстояния от цели увеличит урон от способности, а уменьшение — снизит",
        "Дополнительный урон наносится отдельным источником урона и считается за урон от заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона от заклинаний и вампиризм заклинаниями",
        "Урон от Impetus наносится раньше, чем урон с руки, но его нанесение все равно зависит от попадания атаки по цели",
        "Действует на все цели, кроме союзных существ, вардов и построек",
        "Увеличение урона ограничено расстоянием в 1750 единиц, что соответствует максимальным единицам урона: Наносит до 140\/210\/280\/350 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 253,75\/323,75\/393,75\/463,75 урона героям, крипам-героям и  Рошану. наносит до 280\/420\/560\/700 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 507,5\/647,5\/787,5\/927,5) урона крипам и иллюзиям"
      ],
      "item_behaviour": [],
      "description": "Усиливает атаки героя, добавляя к ним урон, зависящий от расстояния до цели. Чем она дальше, тем больше урон.",
      "hot_key": "Q",
      "params": [
        "Дальность применения: 575",
        "Урон от расстояния: 8%\/12%\/16%\/20% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 14,5%\/18,5%\/22,5%\/26,5%)",
        "Ограничение расстояния: 1750",
        "Множитель урона по крипам: 2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Enchantress_Impetus_1.mp3\/revision\/latest?cb=20191216013613",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "mana": "6\/4\/2\/0",
      "aghanim": null,
      "name": "Impetus",
      "cooldown": "50",
      "legacy_key": "T",
      "story": "Несмотря на то что Аюшта преследует мирные цели, она вполне способна нанести магический удар издалека: её копья черпают энергию из окружающей природы."
    },
    {
      "notes": [
        "Применение Enchant на героев (включая клонов и иллюзию   Vengeance Aura) или крипов-героев замедляет их и применяет на них базовое развеивание (при этом проигрывая длительный звук)",
        "Enchant сначала применяет развеивание, затем замедление",
        "Замедленное существо при движении оставляет за собой след из цветов, который виден тогда, когда это существо видимо",
        "Применение Enchant на остальных вражеских существ, которые не относятся к вардам или постройкам, приручает их (проигрывая короткий звук). Сюда входят остальные иллюзии. При приручении применяет к цели базовое развеивание, которое снимает положительные и отрицательные эффекты. Прирученный крип излечивается. Его мана не восстанавливается",
        "Следующие крипы не могут быть приручены из-за ограничения в уровне: 4-й уровень: Может приручить любого крипа 3-й уровень: Может приручить любого крипа 2-й уровень:  Древний гранитный голем,  Древний громозавр,  Древний чёрный дракон,  Древний шаман льда,  Сатир-мучитель,  Тролль-некромант, 1-й уровень, также не может приручить:  Вожак волков,  Воин Некрономикона,  Дикокрыл-потрошитель,  Древний грохозавр,  Древний каменный голем,  Древний морозный голем,  Кентавр-захватчик,  Лучник Некрономикона,  Медведемон-крушитель,  Сосновый налётчик,",
        "Нельзя применить к древним крипам, катапультам,  воинам Некрономикона и  лучникам Некрономикона. С выбранным на 20 уровне <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом можно приручать древних крипов, но  Рошан и крипы-герои, которые также относятся к древним крипам, лишь замедляются. Несмотря на то, что  курьера можно выбрать целью для приручения, способность на него не сработает, потратит ману и уйдет в перезарядку",
        "При приручении нового крипа прирученный ранее мгновенно умирает. Если приручение закончило свое действие, существа сразу умирают. Эти смерти никому не зачитываются, поэтому опыт никто не получает"
      ],
      "item_behaviour": [],
      "description": "Очаровывает врага, либо забирая его под свой контроль с увеличенным здоровьем и уроном от атак (если это крип), либо замедляя его передвижение (если это герой). Одновременно под контролем может быть только один крип.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Дальность применения: 500\/550\/600\/650",
        "Замедление передвижения героя: 55%",
        "Длительность замедления: 3,75\/4,5\/5,25\/6",
        "Макс. число крипов: 1",
        "Доп. макс. здоровье крипа: 200\/300\/400\/500",
        "Доп. урон крипа: 10\/30\/50\/70",
        "Доп. броня крипа: 2\/4\/6\/8",
        "Макс. уровень крипа: 4\/5\/6\/6",
        "Длительность очарования: 30\/60\/90\/120"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Enchantress_Enchant_1.mp3\/revision\/latest?cb=20191216013612",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "28\/24\/20\/16",
      "aghanim": null,
      "name": "Enchant",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "C",
      "story": "Как истинная хранительница леса, Аюшта дружна со всеми в нем — от низших троллей до могучих кентавров."
    },
    {
      "notes": [
        "Каждые 0,5 секунды, один светлячок выбирает случайное союзное существо для лечения. Может восстановить до 8 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 13) союзников одновременно",
        "Цели для лечения выбираются абсолютно случайно, не имея приоритетов. Несколько светлячков могут лечить одну цель. Каждый светлячок приближается к выбранной цели, что указывает на то, что светлячок исцеляет цель. <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Талант на увеличение количества светлячков визуально не изменяет количество светлячков",
        "Игнорирует древних крипов и союзников с полным здоровьем",
        "Светлячки могут восстановить неуязвимых существ, но не спрятанных существ",
        "Область действия находится вокруг текущего местонахождения Enchantress и всегда следует на ней",
        "После смерти Enchantress, светлячки продолжают восстанавливать существ поблизости от места её смерти",
        "Эффект от нескольких применений Nature's Attendants не складывается, но обновляет его действие",
        "Может восстановить до 32\/64\/96\/128 здоровья в секунду или 392\/864\/1416\/2048 здоровья за всё время действия. С <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом на увеличение количества светлячков может восстановить до 52\/104\/156\/208 здоровья в секунду или 468\/1040\/1716\/2496 здоровья за всё время действия. С <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом на бонус лечения за светлячка может восстановить до 192\/224\/256\/288 здоровья в секунду или 1728\/2240\/2816\/3456 здоровья за всё время действия. С обоими <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантами, может восстановить до 312\/364\/416\/468 здоровья в секунду или 2808\/3640\/4576\/5616 здоровья за всё время действия",
        "Дающий бонус к скорости передвижения <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талант увеличивает общую скорость передвижения Enchantress до 330 на время действия. Бонус не даётся союзникам, которые получают лечение от светлячков"
      ],
      "item_behaviour": [],
      "description": "Призывает рой светлячков, которые лечат героя и всех ближайших союзников в течение 9\/10\/11\/12 секунд.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,93",
        "Радиус поиска: 275",
        "Число светлячков: 8 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 13)",
        "Лечения в секунду за светлячка: 4\/8\/12\/16 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 24\/28\/32\/36)",
        "Длительность: 9\/10\/11\/12",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Ускорение от светлячков:  10"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Nature%27s_Attendants.mp3\/revision\/latest?cb=20141207171117",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Союзников"
      ],
      "mana": "35",
      "aghanim": null,
      "name": "Nature's Attendants",
      "cooldown": "140",
      "legacy_key": "R",
      "story": "Капризные духи леса очень слабы поодиночке, но стоит им собраться в рой, как их исцеляющая сила многократно возрастает."
    },
    {
      "notes": [
        "Требуется  Aghanim's Scepter для разблокировки",
        "Способность прерывает произносимые заклинания",
        "После применения способность позволяет избежать снаряды",
        "После применения Enchantress прыгает по дуге с высотой в 150 и 180° от направления, в котором смотрит Enchantress. Прыгает со скоростью 1250 в течении 0,4 секунд, или пока не коснется земли. Может прыгать через существ и непроходимую территорию. Это значит, что дальность и длительность прыжка могут быть уменьшены\/увеличены, если герой запрыгивает\/спрыгивает на спуск или непроходимую поверхность",
        "Во время дейсвтия способности Enchantress может атаковать, использовать способности и предметы",
        "Спустя 0,2 секунд после применения Enchantress совершает мгновенные атаки по 3 самым дальным целям в радиусе поиска. Это значит, что если прыжок будет прерван до этого, атаки не будут произведены. Атаки так же не будут произведены если способность  Impetus не изучена, или если она обезоружена. Атаки используют на цели Impetus текущего уровня, они не требуют маны, так же они будут произведены если Impetus нельзя применить. На эти атаки действуют модификаторы атаки и эффекты попадания. Атаки могут промахнутся",
        "С учетом базовой дальности атаки Enchantress и бонусом Sproink, радиус поиска способности составляет 775. Радиус поиска может быть увеличен другими модификаторами дальности атаки. Ищет врагов вокруг нее, то есть, что атаки могут также произведены на целей позади"
      ],
      "item_behaviour": [],
      "description": "Герой отскакивает назад, уворачиваясь от летящих в него снарядов, и запускает копья с эффектом Impetus в 3 самых отдалённых врагов в радиусе своей атаки + 200.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Дальность прыжка: 500",
        "Длительность: 0,4",
        "Дополнительная дальность атаки: 200",
        "Число атак при прыжке: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Weapons_hero_enchantress_sproink.mp3\/revision\/latest?cb=20191215175958",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Мгновенная атака"
      ],
      "mana": "4",
      "aghanim": null,
      "name": "Sproink",
      "cooldown": "50",
      "legacy_key": "F",
      "story": "Вот так прыг да скок."
    },
    {
      "notes": [
        "Требуется  Aghanim's Shard для разблокировки",
        "Раскрывает невидимость цели, пока все крипы, то есть союзные (кроме крипов-героев), вражеские и нейтральные крипы, в радиусе действия провоцируются на цель, принудительно атакуя её. Не-герои, которые входят в радиус действия, также подвергаются действию способности на оставшееся время. Не действует на невосприимчивых к магии, неуязвимых, спрятанных крипов, варды или постройки в радиусе действия",
        "Провокация основана на ауре с бесконечной длительностью задержки. Дебафф мгновенно очищается, если дебафф на основной цели исчез или если цель погибла. Это значит, что провокация остаётся на задетых существах даже в том случае, если они покинули область действия",
        "Область провокации перемещается вместе с основной целью и сопровождает её даже в случае принудительного передвижения",
        "Если цель умирает во время действия провокация, то Enchantress будет считаться убийцей. Имеет приоритет ниже, чем  Reaper's Scythe и  Winter's Curse, поэтому при действии одной из них на противника, вышеупомянутые способности будут иметь приоритет"
      ],
      "item_behaviour": [],
      "description": "Все союзные, вражеские и нейтральные крипы в радиусе действия атакуют цель способности, имея увеличенную скорость передвижения и атаки. Действует 6 сек.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 600",
        "Радиус: 1200",
        "Доп. скорость передвижения: 100%",
        "Доп. скорость атаки: 100",
        "Длительность: 6"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Little Friends",
      "cooldown": "75",
      "legacy_key": "L",
      "story": null
    },
    {
      "notes": [
        "Замедление срабатывает при начале атаки по Enchantress независимо от расстояния. При этом не важно, успешно ли прошла атака или нет, замедление все равно сработает",
        "Замедление также действует до тех пор, пока длится анимация завершения атаки. Отмена анимации завершения атаки не отменит замедления и не вернет скорость атаки. При смене цели атаки дебафф сохраняется, но не добавляет замедление к новой атаке по новой цели. Дебафф остается до завершения или отмены атаки по новой цели. То есть можно пропустить замедление, работающее на анимацию завершения атаки, меняя цель атаки в пределах дальности атаки героя перед каждой атакой. Это также значит, что дебафф не влияет на анимацию бездействия внутри анимации атаки после замаха",
        "Не действует на постройки, союзников, или неуязвимых существ. Действует на уязвимые варды"
      ],
      "item_behaviour": [],
      "description": "Пленённые красотой героя, противники атакуют его с уменьшенной скоростью.",
      "hot_key": "R",
      "params": [
        "Замедление скорости атаки: 120\/160\/200 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 185\/225\/265)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Untouchable.mp3\/revision\/latest?cb=20160827205958",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Untouchable",
      "cooldown": null,
      "legacy_key": "N",
      "story": "После нападения на Аюшту большинство соперников испытывают чувство вины за то, что осмелились поднять руку на такую прекрасную деву."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.7,
    "attrStrength": 17.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 2.1,
    "attrAgility": 19.0
  },
  "description": "Переманивает нейтральных крипов на свою сторону «Спройнк!» Беспечная и чистая душой, Аюшта странствует по лесам, слушая истории их обитателей. Nature's Attendants — живые духи, исцеляющие как малых, так и больших существ — порхают вокруг неё. При необходимости она очаровывает лесных созданий Enchants для выполнения поручений. Untouchable — прекрасный образ неприкасаемой невинности, увидев который охотники не решаются хоть немного шевельнутся в сторону Аюшты. Это нежелание редко встречается. Угрозы, нависшие над её друзьям, наполняют Enchantress решимостью пойти против своего мягкого характера и взять как оружие Impetus, чтобы привести тех, кто нарушает мирное существование, к скорому и окончательному правосудию.  Поддержка Лес Осада Стойкость Контроль ★★☆",
  "history": "Аюшта кажется невинным и беззаботным лесным существом, и пусть это первое впечатление не обманчиво, оно едва ли раскрывает её натуру. Аюшта прекрасно понимает, отчего страдает природа. Она прошла многими тропами, приветливыми и угрюмыми лесами, бывала во всех краях в любое время года — и всюду искала дружбы, несла вести, смех и исцеление. Иначе никак: где разразилась война, там лес идёт на суда и осадные орудия, а в мирных местах деревья вырубают, чтобы строить дома и топить бесчисленные очаги. Аюшта внимает мольбам беззащитных существ, которые так нуждаются в лиственной тени и зелёном крове. Она прислушивается к тем, до кого никому нет дела, и несёт их истории по всему миру, уверенная в том, что её доброе слово — словно чары, от которых наш мир расцветёт."
}