{
  "abilities": [
    {
      "notes": [
        "Талант на вампиризм аддитивно складывается с другими источниками вампиризма."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,25 сек. длительности оглушения Storm Hammer",
          "talentRight": "+50% к урону God's Strength"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+10 к броне от Warcry",
          "talentRight": "+25 к скорости передвижения"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25% к прорубающему урону от Great Cleave",
          "talentRight": "+15% к вампиризму"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости атаки",
          "talentRight": "+3 сек. действия Warcry"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Sven_Storm_Hammer_1.mp3\/revision\/latest?cb=20191216024629",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Перекрестие указателя должно выделять вражеское существо.",
        "Storm Hammer летит со скоростью 1000.",
        "Во время полета снаряд дает летающий обзор в радиусе 225.",
        "Невидимость или исчезновение цели не предотвращает действие эффекта по области вокруг неё. Можно применять на неуязвимых врагов, но способность на них не действует.",
        "Можно применять на неуязвимых врагов, но способность на них не действует.",
        "Storm Hammer сначала применяет развеивание, затем наносит урон (TagTalent а потом применяет дебафф).",
        "Во время применения меч Sven испускает немного частиц, видимых всем.",
        "С улучшением от Aghanim's Scepter Sven движется вместе со снарядом. Во время движения Sven обезврежен, неуязвим и его нельзя выбрать. Если движение прервется (например, с помощью телепортации), то данные эффекты на героя действовать не будут. Sven перестает двигаться к цели, если расстояние до нее превышает 2200 или же сам заклинатель умер.",
        "Во время движения Sven обезврежен, неуязвим и его нельзя выбрать.",
        "Если движение прервется (например, с помощью телепортации), то данные эффекты на героя действовать не будут.",
        "Sven перестает двигаться к цели, если расстояние до нее превышает 2200 или же сам заклинатель умер."
      ],
      "mana": "110\/120\/130\/140",
      "item_behaviour": [],
      "name": "Storm Hammer",
      "cooldown": "18\/16\/14\/12 (TagTalent 14\/12\/10\/8)",
      "description": "Герой высвобождает всю мощь своей магической рукавицы, нанося жертве и её союзникам в небольшой области урон и оглушая их.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 600 (TagAghanim 900)",
        "Радиус: 255",
        "Урон: 110\/180\/250\/320",
        "Длительность оглушения: 1,25\/1,5\/1,75\/2 (TagTalent 2,5\/2,75\/3\/3,25)",
        "Увеличивает дальность применения и перемещает владельца вместе со снарядом.",
        "Способность развеивает с жертв положительные эффекты. Уменьшает перезарядку на 4 секунды.",
        "Не может выбрать целью существ с иммунитетом к заклинаниям. Когда снаряд соприкасается с существом, имеющим иммунитет, соседние цели все равно оглушаются.",
        "Блокируется только основной целью. Блокируется при попадании.",
        "Избегание снаряда все равно применит эффект по области."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Sven_Great_Cleave.mp3\/revision\/latest?cb=20191216024628",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Прорубающий урон не может быть увеличен с помощью усиления исходящего урона заклинаний и он не дает лечения от вампиризма заклинаний. Может быть увеличен усилением входящего урона заклинаний",
        "Может быть увеличен усилением входящего урона заклинаний",
        "Прорубающий урон уменьшается блокировкой урона.",
        "Область поражения выглядит как равнобедренная трапеция, исходящая от героя.",
        "Складывается с другими источниками прорубания. Каждый источник действует независимо от другого.",
        "Прорубание не применятся при атаке вардов, строений или союзных существ. На варды и строения прорубание не действует.",
        "Несмотря на визуальные эффекты, прорубающий урон наносится мгновенно по области."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Great Cleave",
      "cooldown": null,
      "description": "Могучие удары героя прорубают жертву, поражая всех врагов вокруг неё.",
      "hot_key": "W",
      "params": [
        "Начальный радиус: 150",
        "Дальность: 700",
        "Конечный радиус: 360",
        "Прорубающий урон: 25%\/50%\/75%\/100% (TagTalent 50%\/75%\/100%\/125%)"
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f1\/Sven_Warcry.mp3\/revision\/latest?cb=20191216024631",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "При применении прерывает произносимые способности Sven.",
        "Действует только на союзных героев, включая клонов, иллюзии и крипов-героев."
      ],
      "mana": "30\/40\/50\/60",
      "item_behaviour": [],
      "name": "Warcry",
      "cooldown": "32\/28\/24\/20",
      "description": "Боевой клич поднимает дух союзных героев и увеличивает их броню и скорость передвижения на 8 сек.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 700",
        "Доп. скорость передвижения: 8%\/12%\/16%\/20%",
        "Доп. броня: 6\/9\/12\/15 (TagTalent 16\/19\/22\/25)",
        "Длительность: 8 (TagTalent 11)"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Sven_God%27s_Strength.mp3\/revision\/latest?cb=20191216024643",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом Sven. Бонусный урон не увеличивается.",
        "Периодически проверяет основной урон Sven и мгновенно адаптирует дополнительный."
      ],
      "mana": "100\/150\/200",
      "item_behaviour": [],
      "name": "God's Strength",
      "cooldown": "110",
      "description": "Sven концентрирует свою неконтролируемую силу, получая бонус к урону на 40 секунд.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дополнительный урон: 120%\/160%\/200% (TagTalent 170%\/210%\/250%)",
        "Длительность: 40"
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 22.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.3,
    "attrAgilityInc": 2.0,
    "attrAgility": 21.0
  },
  "description": "Sven — это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность Storm Hammer, Sven использует всю мощь своей магической рукавицы, нанося урон и оглушая врагов. Пассивная способность Great Cleave добавляет к атакам героя эффект прорубающего удара. Третья способность Warcry, боевой клич Sven воодушевляет союзников в бою, увеличивая их скорость передвижения и броню. Его особая способность God's Strength, Sven концентрирует свою неконтролируемую силу, получая бонус к физическому урону. Улучшение с Aghanim's Scepter улучшает Storm Hammer даёт полёт к сопернику и увеличение радиуса полёта",
  "history": "Внебрачный сын вигильского рыцаря, урожденный бледный меранс, взращенный в руинах Тенистого взморья. Его отца казнили за нарушение Вигильского кодекса, а мать отвергло ее дикое племя, поэтому Sven считает, что честь следует искать не в обществе, но в себе. Когда из жизни ушла мать, о которой Sven заботился до самой ее смерти, он отправился на службу вигильским рыцарям, не раскрывая своей личности. На протяжении тринадцати лет он учился в школе своего отца, постигая суровый закон, который объявлял само его существование мерзостью. И вот, в день, когда Sven должен был принести присягу, он завладел Клинком изгоя, разбил Священный шлем и сжег кодекс в священном вигильском пламени. Он покинул вигильскую цитадель, навсегда одинокий, строго следующий своим личным законам до последней руны. Да, он рыцарь… но рыцарь мятежный.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,25 сек. длительности оглушения Storm Hammer",
      "talentRight": "+50% к урону God's Strength"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+10 к броне от Warcry",
      "talentRight": "+25 к скорости передвижения"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25% к прорубающему урону от Great Cleave",
      "talentRight": "+15% к вампиризму"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости атаки",
      "talentRight": "+3 сек. действия Warcry"
    }
  ]
}