{"abilities":[{"spell":"Sends a swarm of winged beasts to savage enemy units in front of Death Prophet.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["When targeting a unit, the Crypt Swarm is released towards its current location upon cast.","Crypt Swarm travels at a speed of 1100, taking 0.74 ( 0.9) seconds to travel the full distance.","Can hit units up to 1110 ( 1285) range away (travel distance + end radius).","The complete area is shaped like a cone."],"mana":"85\/110\/135\/160","elements":["Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"8\/7\/6\/5 ( 5\/4\/3\/2)","name":"Crypt Swarm","description":["Cast Animation: 0.4+0.87","Cast Range: 600 ( 775)","Starting Radius: 110","Travel Distance: 810 ( 985)","End Radius: 300","Damage: 75\/150\/225\/300"],"hot_key":"Q","legacy_key":"R"},{"spell":"Prevents enemy units in a target area from casting spells.","effects":["Ability Target Area","Affects Enemies"],"notes":["Applies a debuff on enemies within the area on cast. Entering or leaving the area afterwards has no effect."],"mana":"80\/90\/100\/110","elements":["Does not pierce spell immunity."],"cooldown":"15\/14\/13\/12","name":"Silence","description":["Cast Animation: 0.4+0.87","Cast Range: 900 ( 1075)","Radius: 425","Duration: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"E"},{"spell":"Creates a spirit link between Death Prophet and an enemy unit, draining 14 + 1%\/2.5%\/4%\/5.5% Max HP per second and steal 4%\/6%\/8%\/10% movement speed from the enemy.","effects":["Ability Target Unit","Affects Enemies \/ Self","Damage Magical"],"notes":["Upon learning, Death Prophet instantly gains 1 charges. However, leveling it up further does not instantly grant the other charges.","The link breaks only when the target gets out of range or dies.","The health restored on Death Prophet is independent from the actual amount of damage dealt. This means even if the target takes no damage at all, Death Prophet still gets healed.","Drains 3.5 + 0.25%\/0.625%\/1%\/1.375% ( 0.5%\/0.875%\/1.25%\/1.625%) of the enemy's max health in 0.25 second intervals, starting 0.25 seconds after cast, resulting in 24 instances.","Can drain up to 84 + 6%\/15%\/24%\/33% ( 12%\/21%\/30%\/39%) of the enemy's max health when the link lasts its full duration (before reductions).","The slow and speed bonus are independent from each other. Spirit Siphon does not literally steal the speed. This means Death Prophet gains movement speed based on her movement speed, and the target loses it based on their speed. This also means when one of them loses the buff or debuff, the other still keeps theirs.","When cast on a unit Death Prophet is currently attacking, she continues attacking it after cast, regardless of auto-attack settings.","Cannot be cast on units which already are affected by Spirit Siphon.","Does not provide vision over the target. However, the link does not break upon losing vision. When losing vision over the target, the link visually draws to the location where the target was seen last time.","Cannot be cast on Roshan.","Choosing the health drain increasing talent does not increase the draining of any currently active Spirit Siphon links."],"mana":"70","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"0","name":"Spirit Siphon","description":["Cast Animation: 0.1+0","Cast Range: 500 ( 675)","Link Break Distance: 750 ( 925)","Base Health Drain per Second: 14","Max Health Drain per Second: 1%\/2.5%\/4%\/5.5% ( 2%\/3.5%\/5%\/6.5%)","Move Speed Change: 4%\/6%\/8%\/10%","Duration: 6","Number of Charges: 1\/2\/3\/4","Charge Replenish Time: 60\/52\/44\/36"],"hot_key":"E","legacy_key":"C"},{"spell":"Unleashes evil spirits to drain the life of nearby enemy units and structures. At the end of the spell's duration, Death Prophet is healed in proportion to the damage dealt. Lasts 35 seconds.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Physical"],"notes":["Spirits spawn from Death Prophet in 0.35 second intervals, starting immediately on cast, taking 2.45\/5.25\/8.05 ( 5.25\/8.05\/10.85) seconds for all spirits to be released.","The spirits are not units and cannot be interacted with, or affected by anything in any way.","The spirits move at a speed of 500, roaming around Death Prophet within a 700 radius. They can only turn by moving in approximately 150 radius arcs.","Spirits automatically attack nearby enemies within the 700 radius around Death Prophet. They choose their target randomly, but prioritize units Death Prophet is attacking currently. Once having chosen a target, a spirit usually sticks to that target until it dies, gets out of range, or until Death Prophet attacks a new target. A spirit's ongoing chase cannot be canceled. A spirit only stops chasing its target after reaching it, or when the distance gets greater than 1900. This means when giving Death Prophet an attack order, already attacking spirits do not switch targets. Although chasing for much further, the spirits cannot damage units which are 1200 range away from Death Prophet. After each attack, the spirits need to return to Death Prophet before being able to attack again.","The spirits can attack every attackable enemy unit, including buildings, wards, and units inside the Fog of War, but not invisible units. Spirits do not choose invulnerable or ethereal units as their attack targets, but will continue to attack a unit if turns invulnerable or ethereal after already acquired as a target.","The attacks of the spirits are not regular attacks, so they fully ignore things like evasion and damage block. They deal spell damage, not attack damage, so they are affected by spell amplification and spell lifesteal. This also means that they cannot trigger the on-attack effects of Counter Helix, Moment of Courage and Reactive Armor or break enemy Tranquil Boots. They also cannot damage units which require a certain amount of attacks to be killed, since they do not count as regular attacks.","When a spirit gets 2000 range away from Death Prophet, it disappears and then respawns from Death Prophet. Reappearing spirits are still bound to the spawn interval, so when multiple spirits disappear, they do not reappear simultaneously on Death Prophet.","The spirits heal Death Prophet upon returning once the duration is up. They do not heal her upon returning after each attack. The heal amount per spirit is based on their damage value, and not on how much damage they actually dealt. This means upon having fully returned, a spirit heals Death Prophet for 14.75-16 for each attack it did, regardless of how much damage the enemies actually took.","Recasting Exorcism causes the previous cast to end prematurely, making the spirits start returning to Death Prophet and heal her.","Choosing the haste talent immediately applies the haste to the currently active Exorcism instance.","The spirits spawned with Aghanim's Scepter behave like the spirits from a regular cast, meaning they still obey the max distances, and have the same move behaviors. A spirit spawns for every unit hit by Crypt Swarm, and Silence, for the Spirit Siphon target, and for every unit hit by Death Prophet's regular attacks. If Spirit Siphon is blocked with Spell Block, or if her attack is evaded or disjointed, no spirit spawns. Spirits also spawn for buildings when attacking them, but not for wards or allies. These spirits deal 103.25-112 damage, and therefore also heal for 25.8125-28 health upon returning. These spirits can chase their targets for up to 20 seconds before giving up and returning to Death Prophet."],"mana":"200\/300\/400","elements":["Not disabled by Break.","Pierces spell immunity."],"cooldown":"145","name":"Exorcism","description":["Cast Animation: 0.5+0.77","Spirits Acquisition Radius: 700","Max Attack Radius: 1200","Max Leash Range: 2000","Spirits Spawn Interval: 0.35","Number of Spirits: 8\/16\/24 ( 16\/24\/32)","Spirits Minimum Damage: 59","Spirits Maximum Damage: 64","Life Drain: 25%","Haste Speed: 0 ( 550)","Exorcism Duration: 35","Scepter Spirit Movement Speed Slow: 0% ( 100%)","Scepter Spirit Slow Duration: 0 ( 0.3)","Scepter Spirit Max Duration: 0 ( 20)"],"hot_key":"R","legacy_key":"X"}],"bio":"Krobelus was a Death Prophet—which is one way of saying she told fortunes for the wealthiest of those who wished to look beyond the veil. But after years of inquiring on behalf of others, she began to seek clues on her own fate. When death refused to yield its secrets, she tried to buy them with her life. But the ultimate price proved insufficient. Death disgorged her again and again, always holding back its deepest mysteries. Her jealousy grew. Others could die for eternity—why not she? Why must she alone be cast back on the shores of life with such tiresome regularity? Why was she not worthy of the one thing all other living creatures took for granted? Still, she would not be discouraged. Each time she returned from the grave, she brought a bit of death back with her. Wraiths followed her like fragments of her shattered soul; her blood grew thin and ectoplasmic; the feasting creatures of twilight took her for their kin. She gave a little of her life with every demise, and it began to seem as if her end was in sight. With her dedication to death redoubled, and no client other than herself, Krobelus threw herself ever more fervently into death's abyss, intent on fulfilling the one prophecy that eluded her: That someday the Death Prophet would return from death no more.","talentsTips":["The cast range talent also affects the max distance of Crypt Swarm and the link break distance of Spirit Siphon.","The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Death Prophet's magic resistance to 36.25%.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["At some point, she, along with Io and Silencer, had her costume and ability color palettes changed. Before, Death Prophet's garments and ability icons were more purple in color.","The icon for her old ability, Witchcraft, shows a pentacle, a symbol that became associated with magic in the Middle Ages and traditionally used in witchcraft."],"talents":["+8 Exorcism Spirits:Exorcism Grants Haste","-3s Crypt Swarm Cooldown:+500 Health","+175 Cast Range:+1% Max Health Spirit Siphon","+15% Magic Resistance:+40 Damage"],"desc":"Krobelus, the Death Prophet, is a ranged intelligence hero who excels at pushing lanes. She is often played in the mid lane, since her Crypt Swarm gives her strong magic damage that can be spammed to her heart's content. As she levels her ultimate, Exorcism, Death Prophet can deal a huge amount of damage to towers and heroes alike, while healing at the end of the duration. If Exorcism's own heal isn't enough, she still has Spirit Siphon which drains health based on the target's health and can even be used on multiple targets at the same time. Finally, her Silence gives her a powerful tool to disable enemy casters and heroes that rely on escape abilities. Because she can deal large amounts of damage over time with her ultimate and Crypt Swarm, Death Prophet is mostly built as a tank, to ensure she can continue to stay in the fight."}