{"abilities":[{"spell":"Посылает вперёд стаю крылатых тварей, наносящих урон врагам на своём пути.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["При выборе юнита Crypt Swarm выпускается по направлению его текущего расположения.","Crypt Swarm летит со скоростью 1100, пролетая все расстояние за 0.74 ( 0.87) секунды.","Может поражать юнитов на расстоянии до 1110 ( 1260) (складывается из дистанции прохождения и конечного радиуса).","Площадь поражения по форме похожа на конус."],"mana":"105\/120\/140\/165","elements":["Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"8\/7\/6\/5 ( 5\/4\/3\/2)","name":"Crypt Swarm","description":["Анимация применения: 0,5+0,77","Дальность применения: 600 ( 750)","Начальный радиус: 110","Дистанция прохождения: 810 ( 960)","Конечный радиус: 300","Урон: 75\/150\/225\/300"],"hot_key":"Q","legacy_key":"R"},{"spell":"Запрещает врагам в указанной области применять способности.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Применяет дебафф на врагов по области применения. Вхождение или покидание области после применения не даст эффекта."],"mana":"80\/90\/100\/110","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"15\/14\/13\/12","name":"Silence","description":["Анимация применения: 0,5+0,77","Дальность применения: 900 ( 1050)","Радиус: 425","Длительность: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"E"},{"spell":"Герой создаёт мистическую связь с вражеским существом, забирая себе 4%\/6%\/8%\/10% от скорости передвижения жертвы и каждую секунду нанося ей 14 + 1%\/2.5%\/4%\/5.5% урона от максимального запаса здоровья.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Связь разрывается только если цель заклинания умрет или отойдет на расстояние, превышающее дистанцию действия.","Восстановление здоровья для Death Prophet независимо от фактического количества нанесённого урона. Это значит, даже если цель не получает урон, то Death Prophet всё равно излечивается.","Высасывает 3.5 + 0.25%\/0.625%\/1%\/1.375% ( ) от максимального здоровья врага каждые 0,25 секунды спустя 0,25 секунды после применения, срабатывая 24 раз.","Может нанести до 84 + 6%\/15%\/24%\/33% ( ) от максимального запаса здоровья врага при полном действии связи (до учета сопротивления).","Замедление и дополнительная скорость не связаны друг с другом. Spirit Siphon непосредственно не крадет скорость. То есть и Death Prophet получает скорость передвижения, связанную с её текущей, и цель теряет скорость также от текущей. Также это означает, что при потере баффа или дебаффа другой юнит его сохранит.","При применении на юнита, которого Death Prophet уже атакует, герой продолжит его атаковать, несмотря на настройки авто-атаки.","Не может быть применена на юнита уже находящегося под эффектом Spirit Siphon. Death Prophet получает здоровье от каждого юнита под эффектом Spirit Siphon.","Не дает обзор на цель, при этом связь не рвется при потере обзора. При потере обзора цели, связь визуально рисует то место, где цель была видна последний раз.","Не может быть применена к Рошану."],"mana":"70","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Spirit Siphon","description":["Анимация применения: 0,1+0","Дальность применения: 500 ( 650)","Дистанция разрыва связи: 750 ( 900)","Начальное высасывание здоровья в секунду: 14","Высасывание от максимального здоровья в секунду: 1%\/2.5%\/4%\/5.5% ( )","Изменение скорости передвижения: 4%\/6%\/8%\/10%","Длительность: 6","Число зарядов: 1\/2\/3\/4","Время восстановления заряда: 60\/52\/44\/36"],"hot_key":"E","legacy_key":"C"},{"spell":"Герой выпускает злых духов, высасывающих жизнь из вражеских существ и сооружений поблизости. Через 0 секунд они возвращаются к владельцу, исцеляя его. Сила исцеления зависит от количества нанесённого духами урона.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Физический"],"notes":["Духи появляются вокруг Death Prophet с интервалом в 0.35 секунды сразу после применения; для появления всех духов нужно 2.45\/5.25\/8.05 ( 5.25\/8.05\/10.85) секунды.","Духи не являются юнитами, поэтому с ними нельзя взаимодействовать или чем-то на них повлиять.","Духи движутся со скоростью 500, витая в радиусе 700 вокруг Death Prophet. Духи могут разворачиваться только путем движения по дуге радиусом примерно 150.","Духи автоматически атакуют ближайших врагов в радиусе 700 от Death Prophet. Каждый из духов получает свою цель случайно, но приоритетом для атаки духов является та цель, которую атакует Death Prophet. При получении цели дух обычно преследует юнита до его смерти, выхода из зоны действия или до выбора новой цели героем. Преследование нельзя отменить. Дух прервет его после достижения цели или если расстояние между ним и целью превысит 1900 единиц. То есть с выбором новой цели Death Prophet уже атакующие духи не переключаются на новую. Духи не наносят урон юнитам, находящимся более чем в 1200 единицах от Death Prophet, хотя могут преследовать на гораздо большее расстояние. Для повторной атаки духи должны возвращаться к Death Prophet после каждой совершенной.","Духи могут атаковать любой доступный для атаки вражеский юнит, включая строения, варды и юнитов в тумане войны, но не невидимых юнитов.","Атаки духов не считаются обычными атаками, поэтому они полностью игнорируют такие понятия, как уклонение и блокировка урона. Духи также не могут активировать эффекты, срабатывающие на атаки, такие как Counter Helix, Moment of Courage и Reactive Armor, и не могут сбить врагу Tranquil Boots. Духи также не наносят урон юнитам, которым для смерти нужно определенное число ударов, поскольку их атаки не считаются обычными.","Если дух улетел на расстояние более 2000 единиц от Death Prophet, он исчезает и появляется рядом с ней. Появление таких духов связано с интервалами появления, поэтому несколько исчезнувших духов не появятся одновременно возле героя.","Лечение происходит единоразово при возвращении духов обратно к Death Prophet с завершением длительность способности. Духи не лечат героя при возвращении после каждой атаки. Лечение от духов основано на значении их урона, а не фактически нанесенном уроне. То есть после возврата духи излечат Death Prophet на 14.75-16 за каждую совершенную атаку вне зависимости от того, получили ли враги урон или нет.","Повторное применение Exorcism досрочно прервет предыдущее примененение, заставляя духов вернутся к Death Prophet и исцелить."],"mana":"200\/300\/400","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"145","name":"Exorcism","description":["Анимация применения: 0,5+0,77","Радиус появления духов: 700","Макс. радиус атаки: 1200","Макс. дальность преследования: 2000","Интервал появления духов: 0.35","Количество духов: 8\/16\/24 ( 16\/24\/32)","Мин. урон духов: 59","Макс. урон духов: 64","Восстановление здоровья: 25%","Скорость ускорения: 0 ( 550)","Длительность: 35"],"hot_key":"R","legacy_key":"X"}],"bio":"Когда-то Кробелус была пророчицей смерти — другими словами, она предсказывала судьбы богачам, пожелавшим заглянуть за вуаль загробного мира. Но спустя годы гаданий ворожея захотела узнать свою собственную судьбу. Когда смерть отказалась открывать свои тайны, пророчица решила заплатить за них своей жизнью. Однако даже такой жертвы оказалось недостаточно. Смерть отвергала ворожею снова и снова, ни за что не раскрывая своих глубоких секретов. В Кробелус начала расти зависть. Если другим дано умереть навсегда — почему не могла она? Почему лишь она возвращается к бренной жизни с таким утомительным постоянством? Почему она недостойна того единственного, что остальные существа принимают как должное? Несмотря ни на что, Кробелус не опускала руки. Возвращаясь из могилы вновь и вновь, она приносила с собой частичку смерти. Призраки стали следовать за ней, словно осколки её раздробленной души, кровь её поблекла и стала походить на эктоплазму, а ненасытные обитатели сумеречных миров начали принимать её за свою... С каждой смертью пророчица отдавала крупицу своей жизни, и её конец словно бы приближался. Стремясь к погибели как никогда, забыв о всякой судьбе кроме своей, ворожея страстно бросается в пучину смерти, надеясь осуществить несбыточное до сих пор пророчество — пророчество о том, что однажды Кробелус обретёт вечный покой.","talentsTips":["Талант на дальность применения также действует на дальность Crypt Swarm и дистанцию разрыва Spirit Siphon.","Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.","Талант на сопротивление магии увеличивает сопротивление магии Death Prophet до 55%.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["По какой-то причине, она,вместе с Io и Silencer, поменяла цветовую палитру своих способностей и одежды. До того, одеяние Death Prophet's и иконки способностей были более фиолетового цвета .","Её значок Witchcraft(старое заклинание) изображалась в виде пентаграммы, символ колдовства в религии Wicca."],"talents":["+8 духов для Exorcism:Exorcism дает ускорение","-3 сек. к перезарядке Crypt Swarm:+500 к здоровью","+150 к дальности способностей:+1% к макс. здоровью от Spirit Siphon","+15% к сопротивлению магии:+40 к урону"],"tips":["Exorcism является хорошей способностью, чтобы уничтожать башни противника. А способность Crypt Swarm поможет очистить вражескую волну крипов, чтобы ваша волна также атаковала башню. Если Death Prophet погибнет во время действия Exorcism, все духи исчезнут."],"desc":"Death Prophet — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Crypt Swarm, посылает вперед стаю крылатых тварей, наносящих урон врагам на своем пути. Вторая способность, Silence, не дает использовать заклинания врагам в указанной области. Активная способность, Spirit Siphon, высасывает жизнь из врагов замедляя их и восстанавливая себе здоровье. Ультимативная способность Exorcism, выпускает злобных духов, высасывающих жизнь из вражеских юнитов и сооружений поблизости. Через время они возвращаются к хозяйке, исцеляя ее. Сила исцеления зависит от количества нанесенного духами урона."}