{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Arc_Warden_Flux.mp3\/revision\/latest?cb=20191216010757",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Если в радиусе 225 появятся союзники или нейтральные крипы, то урон и замедление от способности прекратят своё действие, пока цель снова не останется одна.",
        "Проверяет нахождение союзников или нейтралов с интервалом в 0,5 секунды сразу после применения. Обновление замедления зависит от результата этих проверок.",
        "Также способность будет наносить урон в интервалах, основанных на проверках, нанося 7,5\/15\/22,5\/30 (TagTalent 27,5\/35\/42,5\/50) урона до 13(TagTalent 17) раз.",
        "В то время когда Flux отключен, эффекты частиц на цели исчезают, и только красное свечение, оставшееся на существе, указывает на то, что негативный эффект еще наложен.",
        "Постройки, варды и близстоящие исчезнувшие существа игнорируются и не отключают эффект способности. Однако неуязвимые существа не игнорируются.",
        "В общей сложности может нанести до 97,5\/195\/292,5\/390 357,5\/455\/552,5\/650) урона цели, если способность наносила урон во всех интервалах (до учета сопротивлений). С талантом на увеличения урона в секунду способность наносит до 357,5\/455\/552,5\/650 урона за все срабатывания. С талантом на увеличение время действия спобосбость наносит до 127,5\/255\/382,5\/510 урона за все срабатывания. С обоими талантами, наносит до 467,5\/595\/722,5\/850 урона за все срабатывания способности. Талант на увеличение урона в секунду не увеличивает количество срабатываний способности.",
        "С талантом на увеличения урона в секунду способность наносит до 357,5\/455\/552,5\/650 урона за все срабатывания.",
        "С талантом на увеличение время действия спобосбость наносит до 127,5\/255\/382,5\/510 урона за все срабатывания.",
        "С обоими талантами, наносит до 467,5\/595\/722,5\/850 урона за все срабатывания способности.",
        "Талант на увеличение урона в секунду не увеличивает количество срабатываний способности.",
        "Несколько применений на одну и ту же цель полностью сочетаются, поскольку все применения действуют независимо друг от друга."
      ],
      "mana": "16",
      "item_behaviour": [],
      "name": "Flux",
      "cooldown": "75",
      "description": "Охватывает одинокого врага нестабильной энергией, замедляя его передвижение и нанося урон. Урон блокируется, если рядом с целью есть ее союзники.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,77",
        "Дальность применения: 500\/600\/700\/800 ( 675\/775\/875\/975)",
        "Радиус поиска: 225",
        "Урон в секунду: 15\/30\/45\/60 ( 55\/70\/85\/100)",
        "Замедление скорости передвижения: 14%\/21%\/28%\/35%",
        "Длительность: 6 ( 8)"
      ],
      "legacy_key": "C",
      "story": "Лишь крохотная частица мощи, закованной в Крепостях."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2c\/Arc_Warden_Magnetic_Field.mp3\/revision\/latest?cb=20191216010749",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Союзных героев"
      ],
      "notes": [
        "Накладывает бонус к скорости атаки и уклонению к союзникам внутри радиуса.",
        "Эффекты предоставлены в виде ауры. Их бафф задерживается на 0,1 секунды.",
        "Уклонение не действует на союзников, атакованных врагом внутри Magnetic Field.",
        "Эффект уклонения от полей Arc Warden и его Tempest Double действуют независимо друг от друга. То есть, если союзник находится в пересечении двух полей, то атаки будут промахиваться до тех пор, пока их источник также не окажется в пересечении, а не в одном из полей.",
        "То есть, если союзник находится в пересечении двух полей, то атаки будут промахиваться до тех пор, пока их источник также не окажется в пересечении, а не в одном из полей.",
        "Действует на героев (включая иллюзии и клонов), крипов-героев и постройки. На всех остальных эффект не распространяется. Таким образом, находящиеся внутри поля Tombstone, Nether Ward, Supernova и т.п. свободно могут быть разрушены.",
        "Таким образом, находящиеся внутри поля Tombstone, Nether Ward, Supernova и т.п. свободно могут быть разрушены.",
        "Не действует на неуязвимых существ, поэтому эффект действует только на строения, которые можно атаковать.",
        "Бонусы к скорости атаки от нескольких Magnetic Field не сочетаются.",
        "Несмотря на визуальные эффекты, эффективная площадь представляет собой цилиндр, а не сферу.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Magnetic Field отталкивает каждого врага внутри радиуса поля. Отталкивание не имеет точного расстояния. Оно отталкивает так, что противники находились на расстоянии 350 от центра поля. Таким образом, минимальное расстояние составляет 50, а максимальное — 350. Длительность отталкивания всегда составляет 0,3, то есть скорость варьируется от 1166,67 до 166,67 в зависимости от расстояния отталкивания. Враги не обезвреживаются во время отталкивания, они могут совершать любые действия, кроме передвижения. Может затолкнуть существ на непроходимую территорию. Любое дерево на пути отталкивания будет срублено.",
        "Отталкивание не имеет точного расстояния. Оно отталкивает так, что противники находились на расстоянии 350 от центра поля. Таким образом, минимальное расстояние составляет 50, а максимальное — 350.",
        "Длительность отталкивания всегда составляет 0,3, то есть скорость варьируется от 1166,67 до 166,67 в зависимости от расстояния отталкивания.",
        "Враги не обезвреживаются во время отталкивания, они могут совершать любые действия, кроме передвижения.",
        "Может затолкнуть существ на непроходимую территорию. Любое дерево на пути отталкивания будет срублено.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Немедленно применяет новые эффекты к уже существующим полям: 40% сопротивления магии союзникам и 30% замедления скорости передвижения противникам внутри поля. Увеличивает сопротивление магии героям и постройкам внутри поля. Замедление от нескольких полей складывается аддитивно друг с другом и другими источниками замедления. Сопротивление магии складывается мультипликативно друг с другом и другими источниками сопротивления магии. При условии базового 25% сопротивления магии у героев и 0% у построек и при отсутствии других источников сопротивления магии: Увеличивает магическое сопротивление большинства героев до 55% (или до 73% при наложении двух полей). Увеличивает магическое сопротивление большинства построек до 40% (или 64% при наложении двух полей).",
        "Увеличивает сопротивление магии героям и постройкам внутри поля.",
        "Замедление от нескольких полей складывается аддитивно друг с другом и другими источниками замедления.",
        "Сопротивление магии складывается мультипликативно друг с другом и другими источниками сопротивления магии.",
        "При условии базового 25% сопротивления магии у героев и 0% у построек и при отсутствии других источников сопротивления магии: Увеличивает магическое сопротивление большинства героев до 55% (или до 73% при наложении двух полей). Увеличивает магическое сопротивление большинства построек до 40% (или 64% при наложении двух полей).",
        "Увеличивает магическое сопротивление большинства героев до 55% (или до 73% при наложении двух полей).",
        "Увеличивает магическое сопротивление большинства построек до 40% (или 64% при наложении двух полей).",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Талант на увеличение скорости атаки немедленно улучшает все активные Magnetic Fields, но не активные эффекты."
      ],
      "mana": "20",
      "item_behaviour": [],
      "name": "Magnetic Field",
      "cooldown": "50\/70\/90\/110",
      "description": "Создаёт круглое магнитное поле, дающее героям и строениям внутри него уклонение от всех атак, совершённых извне, а также увеличивающее скорость атаки.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 900",
        "Радиус поля: 300",
        "Доп. уклонение: 100%",
        "Доп. скорость атаки: 50\/60\/70\/80 ( 90\/100\/110\/120)",
        "Задержка ауры: 0,1",
        "Длительность: 3,5\/4,5\/5,5\/6,5",
        "Доп. магическое сопротивление: 40%",
        "Замедление передвижения противника: 30%",
        "Максимальная дальность отталкивания: 350",
        "Длительность отталкивания: 0,3"
      ],
      "legacy_key": "F",
      "story": "Время и пространство не важны такому древнему существу, как Зет."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/96\/Arc_Warden_Spark_Wraith_1.mp3\/revision\/latest?cb=20191216010752",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Spark Wraith летит со скоростью в 400 единиц.",
        "Как только задержка активации закончится, искра будет проверять наличие вблизи врагов (включая нейтральных крипов) с интервалом в 0,2 секунды и полетит в направлении первой замеченной цели.",
        "Если в радиусе действия искры находится несколько врагов, она полетит к ближайшей цели.",
        "Наносит урон, основанный на уровне способности при использовании. Улучшение Spark Wraith не обновляет значение урона у уже размещенных Spark Wraiths.",
        "Искра сначала наносит урон, затем применяет дебафф.",
        "Spark Wraith могут видеть противники.",
        "Реагирует на невидимых существ. Может выбрать существ в тумане войны, но не неуязвимых или спрятанных существ.",
        "Задержка активации не включена в длительность искры.",
        "Дает наземный обзор в радиусе 300 на время существования искры. Видимость не задерживается.",
        "Запущенный снаряд также дает обзор, который задерживается на 3,34 секунды при достижении цели.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Spark Wraiths создаёт вторую искру немедленно после нанесения урона. Вторая искра имеет задержку перед активацией в размере 2. Этот эффект действует только на первую искру Spark Wraith. Вторые Spark Wraith не могут создавать новых искр.",
        "Вторая искра имеет задержку перед активацией в размере 2.",
        "Этот эффект действует только на первую искру Spark Wraith. Вторые Spark Wraith не могут создавать новых искр.",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Выбор таланта на урон мгновенно обновляет все уже размещенные искры, включая те, которые уже засекли цель."
      ],
      "mana": "4",
      "item_behaviour": [],
      "name": "Spark Wraith",
      "cooldown": "80",
      "description": "Призывает призрачную искру, которая медленно материализуется и сторожит выделенную область. При появлении врага искра бросается на него и взрывается, нанося жертве магический урон и замедляя её.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,77",
        "Дальность применения: 2000",
        "Радиус поиска: 375",
        "Задержка активации: 2",
        "Замедление скорости передвижения: 100%",
        "Урон: 100\/170\/240\/310 ( 225\/295\/365\/435)",
        "Длительность замедления: 0,4\/0,5\/0,6\/0,7",
        "Длительность искры: 45",
        "Задержка активации второй искры: 2",
        "Длительность второй искры: 15"
      ],
      "legacy_key": "R",
      "story": "Низшие частицы настоящей сущности Зета."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2b\/Arc_Warden_Tempest_Double.mp3\/revision\/latest?cb=20191216010755",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Самость"
      ],
      "notes": [
        "Tempest Double всегда создается с текущим запасом здоровья и маны Arc Warden.",
        "При первом применении призывается двойник Tempest Double. С каждым следующим применением он лишь излечивается или возрождается. То есть невозможно создать больше одной копии за раз, поскольку повторное применение Tempest Double просто обновит одно из предыдущих. К копии также применяется развеивание, снимая с неё все баффы и дебафф, включая неразвеиваемые в обычной ситуации. Перезарядка на предметах и способностях не сбрасывается при перепризывании. Перепризывание Tempest Double не позволяет избегать снаряды.",
        "То есть невозможно создать больше одной копии за раз, поскольку повторное применение Tempest Double просто обновит одно из предыдущих.",
        "К копии также применяется развеивание, снимая с неё все баффы и дебафф, включая неразвеиваемые в обычной ситуации.",
        "Перезарядка на предметах и способностях не сбрасывается при перепризывании.",
        "Перепризывание Tempest Double не позволяет избегать снаряды.",
        "Если растояние между Arc Warden и Tempest Double больше чем 2000, то его итоговый урон от атаки его урон будет снижен на 50%. Снижение урона будет действовать даже если Arc Warden мертв, если у него нет источников воскрешения. Не понижает бонусный условный урон от атаки (например, Monkey King Bar или Silver Edge).",
        "Снижение урона будет действовать даже если Arc Warden мертв, если у него нет источников воскрешения.",
        "Не понижает бонусный условный урон от атаки (например, Monkey King Bar или Silver Edge).",
        "Arc Warden и его клон отображаются в виде иконок с полосами здоровья и маны в верхнем левом углу экрана. При выборе героя его иконка становится ярче, а при получении урона — мигает красным.",
        "При выборе героя его иконка становится ярче, а при получении урона — мигает красным.",
        "Tempest Double визуально отличается от героя как для врагов, так и для союзников.",
        "Баффы от поглощённых Moon Shard и Aghanim's Blessing копируются. При этом другие постоянные баффы (например, Duel, Glaives of Wisdom) — нет. Любой урон от победы в Duel, получаемый при длительности копии, теряется при её смерти.",
        "При этом другие постоянные баффы (например, Duel, Glaives of Wisdom) — нет.",
        "Любой урон от победы в Duel, получаемый при длительности копии, теряется при её смерти.",
        "На копию воздействуют любые заклинания, поскольку она считается героем, а не иллюзией.",
        "За копию дают 180\/240\/300 и 180\/240\/300XP в зависимости от уровня ультимейта Arc Warden только существу, добившему копию.",
        "Эффекты заклинания, дающие бонус за смерть вражеского существа (как, например, Death Pulse), не получают бонусов за смерть копии. Эта особенность предотвращает получение бонуса за победу в Duel над копией. Копия под действием Track также не даёт золота. Улучшенная версия Wrath of Nature на месте убийства копии создает обычного Энта (а не Большого энта).",
        "Эта особенность предотвращает получение бонуса за победу в Duel над копией.",
        "Копия под действием Track также не даёт золота.",
        "Улучшенная версия Wrath of Nature на месте убийства копии создает обычного Энта (а не Большого энта).",
        "Tempest Double не накапливает опыт, так как не является героем. Соответственно, копия не участвует в распределении опыта за убийство героев или крипов.",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Талант на уменьшение перезарядок дает Tempest Double уменьшение перезарядок на его способности и предметы. Складывается мультипликативно с другие источниками процентного уменьшения перезарядок.",
        "Складывается мультипликативно с другие источниками процентного уменьшения перезарядок.",
        "ПРИМЕЧАНИЯ К SPELL STEAL Создаёт двойника, основанного на модели Rubick со всеми базовыми способностями Rubick, неактивной Spell Steal и отсутствием других приобретённых способностей. Потеря Tempest Double и переобретение способности позволяет Rubick призвать нового Двойника без уничтожения предыдущего."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Tempest Double",
      "cooldown": null,
      "description": "Сконцентрировав свои осколки в единую сущность, герой создаёт свою электрическую копию, которая может применять его способности и использовать все предметы, кроме расходуемых и тех, что теряются при смерти. Копия имеет отдельное время перезарядки способностей и предметов.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,15+0,5",
        "Количество копий: 1",
        "Длительность: 18\/22\/26 ( 30\/34\/38)",
        "Награда: 180\/240\/300",
        "Расстояние для снижения: 2000",
        "Снижение урона: 50%",
        "Уменьшение перезарядок: 40%"
      ],
      "legacy_key": "D",
      "story": "Искаженный мощью своих сверстников, Arc Warden принимает своего злейшего врага: внутренний хаос."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 2.6,
    "attrAgilityInc": 3.0,
    "attrAgility": 20.0
  },
  "description": "Копирует себя, чтобы вести войну на два фронта Зет, Arc Warden — разбитый осколок той древней мощи, что породила самих Древних, и он намерен прекратить схватку Света и Тьмы. Сковывайте одиноких врагов потоками энергии или искажайте пространство, создавая защитное поле для союзников. Призывайте призрачные искры, нападающие на приблизившихся противников, или же полную копию самого себя со всеми предметами и способностями, способную сокрушить неприятеля.  Керри Побег Быстрый урон ★★★",
  "history": "До начала всего в абсолютной пустоте обитала единая сущность — первородное сознание. Бесконечное, невероятное, оно следовало лишь своим загадочным целям. Вместе с громом, ознаменовавшим создание вселенной, раздался и треск: первородное сознание раскололось. Два самых крупных его осколка, которые много времени спустя прозовут Светом и Тьмой, открыли друг в друге злейших врагов, и посвятили всё свое существование полному уничтожению противника. Война стала угрожать существованию едва зародившегося космоса, и тогда третий осколок изъявил желание вмешаться. Чистый разум, назвавший себя Зет, хотел прекратить этот хаос и восстановить единство бытия. Поражённый неизмеримой жестокостью братьев, Зет собрал все свои силы и одной яркой вспышкой одолел обе враждующие стороны. Два противника были сжаты воедино, пока не образовали космическое тело, отправленное кружить вокруг неизвестной планеты в далеком краю вселенной. Зет почти полностью лишился сил, но во вселенной воцарился порядок. Обратив свой взор на созданную темницу, Зет направил остатки сил на её охрану. Многие тысячелетия страж оставался непоколебимым. Планета расцветала, полная жизни и сует, освобождённая от мыслей об ужасах, таящихся под поверхностью ночного светила, и стараниях Зета их сдержать. Но когда внутренняя схватка дошла до такой силы, что поверхность спутника начала трещать по швам, Зет понял, что его истощённых сил больше не достаточно. Спутник разорвался на кусочки и выпустил на волю древних узников, жаждущих битвы. Взрыв отбросил Зета на далекий край галактики, преобразив его сущность. Он разбился на множество осколков, лишённых единой формы и мысли, да удерживаемых лишь энергией парящего разума. Подавив чувство собственной разрозненности, Зет помчался в сторону возобновившейся битвы братьев. В этот раз он знал, что нужно делать. Чтобы положить конец вечной войне, призраков былого сознания нужно либо объединить, либо уничтожить…"
}