{"abilities":[{"spell":"Герой выпускает вокруг себя волну смерти, которая наносит урон врагам и исцеляет союзников.","effects":["Способность Ненаправленная","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["При использовании Death Pulse прерывает произносимые способности Necrophos.","Волна летит со скоростью 400 единиц.","Действует на невидимых юнитов и юнитов в тумане войны.","Не действует на неуязвимых и спрятанных юнитов.","Действует на курьеров: лечит союзного курьера, но не наносит урон вражескому."],"mana":"100\/130\/160\/190","elements":["Нельзя избежать.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"8\/7\/6\/5 ( 5.5\/4.5\/3.5\/2.5)","name":"Death Pulse","description":["Анимация применения: 0+0,77","Радиус: 475","Урон: 100\/150\/200\/250","Лечение: 60\/80\/100\/120 ( 100\/120\/140\/160)"],"hot_key":"Q","legacy_key":"D"},{"spell":"Герой открывает связь с миром усопших, замедляя окружающих врагов. В этой форме он не может атаковать, получает повышенный магический урон, но защищён от физических атак и ускоряет восстановление своих здоровья и маны.","effects":["Способность Ненаправленная \/ Аура","Действует на Себя \/ Врагов"],"notes":["При использовании Death Pulse прерывает произносимые способности Necrophos.","Применяет к Necrophos призрачную форму, делая его неуязвимым к атакам и не позволяя атаковать и давая 100% сопротивление к физическому урону.","Понижает сопротивление магии Necrophos до -5%.","Снижение сопротивления магии от Ghost Shroud не складывается с другими эффектами, дающими призрачную форму, поскольку обладает наивысшим приоритетом над другими эффектами.","Любое лечение и восстановление маны, примененное к Necrophos, усилится на 75%. Усиление включает регенерацию. Цифры регенерации в интерфейсе показывают увеличенное значение. Увеличивает лечение от Death Pulse до 105\/140\/175\/210 единиц за применение. Усиливает дополнительную регенерацию здоровья от Heartstopper Aura до за заряд. Усиливает дополнительную регенерацию маны от Heartstopper Aura до за заряд. Не усиливает эффекты Sunder, Decay, Time Lapse, Howl, Armlet of Mordiggian или здоровье, получаемое от покупки предметов, дающих силу\/здоровье. Усиливает лечение до того, как оно блокируется False Promise, имея в виду, что False Promise блокирует усиленное значение. Также усиливает лечение, которое можно получить в конце False Promise.","Замедление представлено в виде ауры. Дебафф задерживается на 0,5 секунд."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"28\/24\/20\/16","name":"Ghost Shroud","description":["Анимация применения: 0+0","Радиус замедления: 750","Замедление передвижения врага: 6%\/12%\/18%\/24% ( 36%\/42%\/48%\/54%)","Усиление восстановления: 75%","Дополнительный магический урон: 40%","Длительность: 3\/3.5\/4\/4.5"],"hot_key":"W","legacy_key":"T"},{"spell":"Герой останавливает сердца врагов вокруг, отчего они постепенно теряют часть максимального здоровья. Также ускоряет восстановление здоровья и маны на 7 сек. за каждое убитое существо.","effects":["Способность Аура","Действует на Врагов \/ Себя","Урон Магический (Отнимающий здоровье)"],"notes":["Дебафф от Heartstopper Aura задерживается на 0.5 секунд.","Здоровье, отнимаемое Heartstopper Aura, напрямую отнимает здоровье, поэтому на него не срабатывают любые эффекты, срабатывающие от урона.","Наносит 0.12%\/0.24%\/0.36%\/0.48% ( 0.28%\/0.4%\/0.52%\/0.64%) от максимального запаса здоровья юнита в качестве урона с интервалом в 0,2 секунды спустя 0,2 секунды после изучения способности.","Вражеские юниты под действием способности имеют видимую иконку дебаффа только в случае, если они видят Necrophos. В случае, если обзора нет, иконка дебаффа невидима. Но цифры урона продолжат появлятся над юнитами, даже если Necrophos им не виден.","Не работает на древних крипов.","Necrophos получает заряд за каждое совершенное убийство, включая добивание союзных юнитов, но исключая убийство иллюзий и Tempest Double. Каждый заряд работает отдельно друг от друга. Они не обновляются при появлении нового, но делят между собой иконку в статус-баре. Текущее количество зарядов видно в иконке. Восстанавливает здоровье и ману в виде регенерации; восстанавливает 0.35\/0.45\/0.55\/0.65 единиц здоровья и 0.35\/0.45\/0.55\/0.65 единиц маны в 0,1-секундном интервале за заряд. Каждый заряд может восстановить до 24.5\/31.5\/38.5\/45.5 единиц здоровья и маны. Убийство героя добавляет сразу 6 зарядов, восстанавливая в общем 147\/189\/231\/273 единиц здоровья и маны."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Heartstopper Aura","description":["Радиус: 700","Уменьшение здоровья в секунду: 0.6%\/1.2%\/1.8%\/2.4% ( 1.4%\/2%\/2.6%\/3.2%)","Зарядов за убийство героя: 6","Зарядов за убийство не-героя: 1","Восстановление маны за убийство: 3.5\/4.5\/5.5\/6.5","Восстановление здоровья за убийство: 3.5\/4.5\/5.5\/6.5","Длительность восстановления: 7","Длительность задержки ауры: 0.5"],"hot_key":"E","legacy_key":"I"},{"spell":"Оглушает выбранного вражеского героя, а затем наносит ему урон, пропорциональный количеству отсутствующего у него здоровья. Герой, убитый этой способностью, будет возрождаться на 15\/25\/35 секунд дольше обычного. Убийство врага под действием этой способности засчитывается её владельцу.","effects":["Способность Направленная на юнита","Действует на Вражеских героев","Урон Магический"],"notes":["Урон рассчитывается и наносится в конце действия оглушения.","Наносит урон, достаточный для убийства героя (до учета сопротивления), если у цели 38%\/43%\/47% от его максимального здоровья.","Если выбранная цель умирает от взрыва Ice Blast, убийство не будет приписано Necrophos, если только он не оказался причиной, из-за которой произошел взрыв цели.","Если выбранный юнит был убит союзником, то убийство не будет считаться добиванием и Necrophos будет считаться убийцей цели.","Можно применить к иллюзиям и крипам-героям."],"mana":"200\/350\/500","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"120 ( 60\/50\/40)","name":"Reaper's Scythe","description":["Анимация применения: 0,55+1,3","Дальность применения: 600","Урон за единицу здоровья: 0.6\/0.75\/0.9","Увеличение времени возрождения: 15\/25\/35","Длительность оглушения: 1.5"],"hot_key":"R","legacy_key":"R"}],"bio":"В годы ужасной чумы один безвестный монах с дурными наклонностями по имени Ротунд'йер неожиданно для себя занял пост кардинала: все другие претенденты на должность скоропостижно скончались. В то время как другие братья-монахи облегчали участь больных, новоиспечённый кардинал заседал в Соборе Румуска, обещая умирающим богачам духовное вознаграждение, коли те передадут свои земли их ордену. Со временем чума угасла, оставив лишь пару неуступчивых очагов, а на деяния Ротунд'йера обратила внимание высшая власть. Бывшего кардинала обвинили в ереси и отрядили ухаживать за чумными, где его медленно и мучительно пожрала бы болезнь. Но судьи не учли, что чума стала Ротунд'йеру родной. Хворь вошла в тело монаха — но не убила, а стала кормить его силы и превратила в сущего чумного мага, Епископа мора. Теперь он ходит по земле, распространяя свою эпидемию, и мощь его растёт с каждой деревней, сгинувшей в его губительном присутствии.","talentsTips":["Талант на силу в общем даёт Necrophos: 200 здоровья, 1 регенерации здоровья и 0.8% сопротивления магии.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.","Талант на сопротивление магии увеличивает сопротивление магии Necrophos до 40%."],"trivia":["Реплика героя \"My name is lesion!\" возможно отсылает к одному из посланий Марка под номером 5:9 которая читается в NIV библии, т.е обновлённой. \"Тогда Иисус спросил его, как тебя зовут?\" \"меня зовут Легион\", ответил он, \"ибо нас много\"\"","Реплика героя \"You reap what you sow.\" может отсылаться к посланию к Галатам 6:7 \"Не обманывайте, ибо Бог не может быть обманут. Вы пожинаете то, что садите\"","Реплика героя \"Red Death.\" может быть отсылкой к одноимённому короткому рассказу Эдгара Аллана По.","Альтернативное имя героя в оригинальной Dota было \"A Phoe Gyi\", что означает \"старик\" на Бирманском языке. It also sounds similar to 'a fogey', which is an elderly, normally grumpy individual.","Изначальное имя героя звучало как \"Necrophiliac\" что можно перевести как \"некрофил\", но создатель героя поменял ему имя на \"Necrolyte\" (от греческого \"некрос\" - что означает труп, псаломщик, религиозный служитель) после осознания, что имя содержит сексуальный подтекст. 21 ноября 2013 года было выпущено обновление, в котором имя героя Necrolyte было изменено на Necrophos. Вероятно это было сделано, чтобы избежать проблем с авторским правом компании Blizzard. В греческом переводе слово \"phos\" означает \"свет\", и тогда имя Necrolyte было изменено, теоретически, на \"Necrolight\", чтобы оно было больше схоже с его предыдущим именем. (То есть Necrolyte = Necrolight - это такая игра слов в английском языке.) В том же обновлении голос Necrophos был изменён. Он звучал на 10% выше, чтобы реплики Warlock и Necrophos отличались друг от друга. Тем не менее, вместо 10% тон голоса изменился на 110%, и голос Necrophos был более медленным и низким, чем предполагалось."],"talents":["-2,5 сек. к перезарядке Death Pulse:+0,8% к урону от Heartstopper Aura","+70 к скорости атаки:+20% к сопротивлению магии","+30% к замедлению от Ghost Shroud:+40 к лечению от Death Pulse","+10 к силе:+30 к урону"],"desc":"Necrophos — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Способность, Death Pulse, создает вокруг Necrophos волну смерти, которая наносит урон врагам и исцеляет союзников. Вторая способность, Ghost Shroud, делает героя неуязвимым к физическому урону, а так-же увеличивает входящее лечение здоровья и маны на 75% и замедляет ближайших противников, при этом уменьшает сопротивление магии и запрещает герою атаковать. Пассивная способность, Heartstopper Aura, заставляет врагов поблизости периодически терять часть их максимального здоровья. Ультимативная способность, Reaper's Scythe, оглушает выбранного вражеского героя, а затем наносит ему урон, пропорциональный количеству отсутствующего у него здоровья. Герой, убитый этой способностью, будет возрождаться на 15\/25\/35 секунд дольше обычного. Убийство врага под действием этой способности засчитывается Necrophos. Улучшение с Aghanim's Scepter уменьшает перезарядку способности."}