{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2b\/Eternal_Shroud_Shroud.mp3\/revision\/latest?cb=20210120233507",
      "effects": [
        "Magical Damage Absorbed: 400",
        "Duration: 12"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Blocks damage before any reductions, except Mana Shield.",
        "Only blocks magical damage, coming from abilities and attacks. Does not block any physical or pure damage.",
        "The amount of mana restored equals the exact amount of damage blocked. Fully affected by mana restore manipulation.",
        "Recasting Shroud refreshes the buff and resets the barrier's absorb capacity.",
        "Does not stack with other magical damage barriers. If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance. However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity.",
        "If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance.",
        "However, if a damage instance is greater than the capacity of all barriers individually, the damage gets blocked as if the barriers were one barrier with combined capacity.",
        "Does not share cooldown with Pipe of Insight or Hood of Defiance."
      ],
      "mana": "50",
      "abilityName": "Shroud",
      "cooldown": "45",
      "description": "Creates a spell shield that absorbs up to 400 magical damage, converting damage taken into mana. Lasts 12 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks multiplicatively with other sources of magic resistance. Increases all heroes' total magic resistance to 43.75%.",
    "Increases all heroes' total magic resistance to 43.75%.",
    "Multiple instances of spell lifesteal from the same source do not stack.",
    "Spell lifesteal from different sources stacks additively."
  ],
  "cost": "3300",
  "lore": null,
  "consistFrom": [
    "Voodoo Mask",
    "Hood of Defiance",
    "Recipe"
  ],
  "name": "Eternal Shroud",
  "description": "A pristine hood that feeds upon strife to empower its owner.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}