{
  "abilities": [
    {
      "notes": [
        "The attack range talent also affects the cast range of Focus Fire.",
        "The cooldown reduction talent stacks multiplicatively with other sources cooldown reduction."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "25% Cooldown Reduction",
          "talentRight": "Windrun Grants Invisibility"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-16% Focus Fire Damage Reduction",
          "talentRight": "+0.8s Shackleshot Duration"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 Attack Range",
          "talentRight": "+100 Powershot Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-2s Shackleshot Cooldown",
          "talentRight": "+1.5 Mana Regen"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Windranger_Shackleshot_1.mp3\/revision\/latest?cb=20191216030602",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Shackleshot travels at a speed of 1650.",
        "The projectile searches for enemies or trees within 46° at the opposite side of the target from where Shackleshot was cast. This means when Windranger teleports away after cast, it latches on targets based on the cast location, not her new location. The complete search area is shaped like a triangle. 575 is the triangle's height. Therefore, the triangle has two sides with a length of 624.66, and the third side has a length of 488.15.",
        "This means when Windranger teleports away after cast, it latches on targets based on the cast location, not her new location.",
        "The complete search area is shaped like a triangle. 575 is the triangle's height.",
        "Therefore, the triangle has two sides with a length of 624.66, and the third side has a length of 488.15.",
        "Shackleshot always prioritizes units over trees as a secondary target.",
        "If the target does not get shackled, it is only briefly stunned (using the default Stunned debuff).",
        "If the target gets shackled to a unit, both of them are stunned for the full duration (using the Shackle Shot debuff).",
        "The stun persists, even when the primary or the secondary unit dies, or the tree is destroyed earlier.",
        "The stun also persists, when one of the targets gets freed from the stun earlier.",
        "When the primary target dies before the shackle reaches it, it still can latch to a secondary unit and stun it.",
        "Can latch on invisible units and units in the fog of war.",
        "The level 20 stun duration increasing talent only affects the success stun duration. The fail stun duration is not increased.",
        "Only the cooldown reduction from the level 10 talent is displayed. The level 25 talent can further reduce the cooldown to 10.5\/9\/7.5\/6. The level 25 talent alone reduces the cooldown to 12\/10.5\/9\/7.5.",
        "The level 25 talent alone reduces the cooldown to 12\/10.5\/9\/7.5."
      ],
      "mana": "70\/85\/100\/115",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10 (TagTalent 14\/12\/10\/8)",
      "description": "Shackles the target to an enemy unit or tree in a line directly behind it. If no unit or tree is present, the stun duration is reduced to 0.75.",
      "spellName": "Shackleshot",
      "params": [
        "Cast Animation: 0.15+0.45",
        "Cast Range: 800",
        "Shackle Search Range: 575",
        "Shackle Search Angle: 46°",
        "Max Shackle Targets: 2",
        "Success Stun Duration: 2\/2.6\/3.2\/3.8 (TagTalent 2.8\/3.4\/4\/4.6)",
        "Fail Stun Duration: 0.75",
        "Blocked fully only when primary target. Blocked upon impact."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Windranger's variety of bow skills includes an arrow with thick ropes attached to encumber any escaping target."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Windranger_Powershot_1.mp3\/revision\/latest?cb=20191216030558",
      "effects": [
        "Ability Target Point \/ Channeled",
        "Affects Enemies",
        "Damage Magical (TagAghanim Instant Kill)"
      ],
      "notes": [
        "The arrow travels at a speed of 3000, taking 0.87 seconds to reach max distance.",
        "The arrow can damage units up to 2725 range away (travel distance + damage radius).",
        "The full damage is done after the full 1 second of channeling. Each channeled 0.03 seconds increase its damage by 5\/8.33\/11.67\/15 (TagTalent 8.33\/11.67\/15\/18.33).",
        "Every time the arrow hits an enemy, its current damage is reduced by 20%.",
        "This is how much damage a fully channeled arrow deals (before reductions) after hitting up to 10 units:",
        "This is how much it deals with the Powershot damage talent leveled:",
        "To reach 1 damage, the arrow needs to hit 23\/25\/27\/28 (TagTalent 25\/27\/28\/29) units.",
        "The arrow provides 400 radius flying vision as it travels, which sticks at its final location for 3.34 seconds.",
        "The arrow destroys trees within 75 radius around it while traveling. Hit trees do not reduce its damage.",
        "The sound of a bow getting stretched during channeling time is audible to allies only.",
        "With Aghanim's Shard, Powershot travels globally. It only stops traveling upon hitting an enemy hero (including illusions and clones, excluding creep-heroes) beyond the initial 2600 range. When hitting a hero, it first applies its damage, and then checks the target's current health. The instant kill threshold increases by 0.43% for each 0.03 seconds spent channeling. Stops hitting creeps after traveling the initial 2600 distance. Still destroys trees and provides vision along the entire path.",
        "It only stops traveling upon hitting an enemy hero (including illusions and clones, excluding creep-heroes) beyond the initial 2600 range.",
        "When hitting a hero, it first applies its damage, and then checks the target's current health.",
        "The instant kill threshold increases by 0.43% for each 0.03 seconds spent channeling.",
        "Stops hitting creeps after traveling the initial 2600 distance.",
        "Still destroys trees and provides vision along the entire path."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "12\/11\/10\/9 (TagTalent 9\/8.25\/7.5\/6.75)",
      "description": "Windranger charges her bow for up to 1 second for a single powerful shot, which deals more damage the longer it is charged. The arrow damages enemies along its path. For each enemy that Powershot hits, its damage is reduced by 20%.",
      "spellName": "Powershot",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 2600",
        "Travel Distance: 2600 (TagTalent Global)",
        "Damage Radius: 125",
        "Max Channel Time: 1",
        "Max Damage: 150\/250\/350\/450 (TagTalent 250\/350\/450\/550)",
        "Damage Reduction per Unit Hit: 20%",
        "Max Kill Health Threshold: 13%",
        "Powershot now becomes global, but only hits heroes beyond its default range (TagTalentmax 1 hero). Impacted heroes will be killed if they are under 13% after taking the impact damage (TagTalentscales based on Powershot channel)."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "During her early years of training, Lyralei learned to fire powerful arrows that cleaved even trees to reach their targets on the other side."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0a\/Windranger_Windrun.mp3\/revision\/latest?cb=20191216030607",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Windrun interrupts Windranger's channeling spells upon cast.",
        "Grants Windranger 100% evasion for its duration. This means attacks with True Strike are not avoided.",
        "The slow is provided by an aura on Windranger. Its debuff lingers for 2.5 seconds.",
        "With the level 25 talent, Windrun turns Windranger invisible and phased for its duration. During the fade time, Windranger can cast spells, use items and perform attacks without breaking the invisibility. Invisibility is broken upon reaching the cast point of spells or items, or upon launching an attack. The invisibility is provided by a second buff, so breaking it prevents Windranger from going invisible again. Windranger can pick up or drop items without breaking the invisibility.",
        "During the fade time, Windranger can cast spells, use items and perform attacks without breaking the invisibility.",
        "Invisibility is broken upon reaching the cast point of spells or items, or upon launching an attack.",
        "The invisibility is provided by a second buff, so breaking it prevents Windranger from going invisible again.",
        "Windranger can pick up or drop items without breaking the invisibility."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "15\/14\/13\/12 (TagTalent 11.25\/10.5\/9.75\/9) (TagTalent 0.25, 0.19)",
      "description": "Increases movement speed and adds evasion from all physical attacks, while slowing movement of nearby enemies.",
      "spellName": "Windrun",
      "params": [
        "Cast Animation: 0+0",
        "Slow Radius: 325",
        "Evasion: 100%",
        "Move Speed Bonus: 60% (TagAghanim 100%)",
        "Move Speed Slow: 15%\/20%\/25%\/30%",
        "Aura Linger Duration: 2.5",
        "Duration: 3\/4\/5\/6",
        "Invisibility Fade Time: 0.2",
        "Number of Charges: 2",
        "Charge Replenish Time: 15\/14\/13\/12 (TagAghanim 11.25\/10.5\/9.75\/9)",
        "Grants 2 charges to Windrun, increases movement speed, and removes movement speed limit.",
        "Slow persists if debuff was placed before spell immunity."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Lyralei enchants gusts of winds to flight incoming attacks."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Windranger_Focus_Fire.mp3\/revision\/latest?cb=20191216030555",
      "effects": [
        "Ability Target Unit",
        "Affects Self"
      ],
      "notes": [
        "The cast range of Focus Fire always equals the caster's attack range. However, this does not include the unlimited range while Hurricane Pike is active.",
        "However, this does not include the unlimited range while Hurricane Pike is active.",
        "Focus Fire orders Windranger to attack the target upon cast.",
        "Focus Fire allows Windranger to move while attacking the Focus Fire target.",
        "Windranger automatically attacks the Focus Fire target whenever she is in range, unless she is given an order that is not a move or attack order. The automatic attacking can be paused by ordering her to stop or hold position once. When paused, she no longer attacks the target while moving. To resume the automatic attacking, a new attack order must be given to her.",
        "The automatic attacking can be paused by ordering her to stop or hold position once. When paused, she no longer attacks the target while moving.",
        "To resume the automatic attacking, a new attack order must be given to her.",
        "Only reduces Windranger's main and bonus damage when attacking the target. Damage from item effects (e.g. Monkey King Bar, Diffusal Blade) is unaffected.",
        "Windranger can switch attack targets without losing the buff against the Focus Fire target.",
        "When switching attack targets, the attack speed and damage adapt as soon as the attack begins.",
        "Casting Focus Fire on multiple targets only grants the attack speed and damage reduction against the most recent target.",
        "Focus Fire ends prematurely when Windranger dies, but persists through the target's death.",
        "Can be cast on any enemy unit, including buildings, excluding wards, invulnerable or hidden units."
      ],
      "mana": "75\/100\/125",
      "hotKey": "R",
      "cooldown": "70\/50\/30 (TagTalent 52.5\/37.5\/22.5)",
      "description": "Windranger channels the wind to gain 475 additional attack speed against a single enemy unit or structure, though with a reduction to her attack damage. Extra damage from secondary item effects is not reduced. Lasts 20 seconds.",
      "spellName": "Focus Fire",
      "params": [
        "Cast Animation: 0+0",
        "Attack Speed Bonus: 475",
        "Attack Damage Reduction: 50%\/40%\/30% (TagTalent 34%\/24%\/14%)",
        "Duration: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Lyralei's ability to bombard opponents with a flurry of arrows is unparalleled - even at the expense of accuracy."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.4,
    "attrAgility": 17.0
  },
  "description": "Lyralei, the Windranger, is a ranged intelligence hero that uses powerful abilities in conjunction with her physical attack to take down enemies. Despite being an intelligence Hero, Windranger's playstyle resembles that of an agility Hero, due in large part to her skill set. Windranger is most often played as an offlane solo due to her escape, long range harass, and farm capability; however, she is quite versatile and can be fielded as a midlaner, roamer, lane support, or even a carry, if the game calls for it. She is famous for her immense utility and versatility.",
  "history": "The western forests guard their secrets well. One of these is Lyralei, master archer of the wood, and favored godchild of the wind. Known now as Windranger, Lyralei's family was killed in a storm on the night of her birth--their house blown down by the gale, contents scattered to the winds. Only the newborn survived among the debris field of death and destruction. In the quiet after the storm, the wind itself took notice of the lucky infant crying in the grass. The wind pitied the child and so lifted her into the sky and deposited her on a doorstep in a neighboring village. In the years that followed, the wind returned occasionally to the child's life, watching from a distance while she honed her skills. Now, after many years of training, Windranger fires her arrows true to their targets. She moves with blinding speed, as if hastened by a wind ever at her back. With a flurry of arrows, she slaughters her enemies, having become, nearly, a force of nature herself.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "25% Cooldown Reduction",
      "talentRight": "Windrun Grants Invisibility"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-16% Focus Fire Damage Reduction",
      "talentRight": "+0.8s Shackleshot Duration"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 Attack Range",
      "talentRight": "+100 Powershot Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-2s Shackleshot Cooldown",
      "talentRight": "+1.5 Mana Regen"
    }
  ]
}