{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Focus Fire Kills Advance Cooldown by 20s.",
          "talentRight": "Windrun Grants Invisibility"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-16% Focus Fire Damage Reduction",
          "talentRight": "+0.8s Shackleshot Duration"
        },
        {
          "talentLvl": "15",
          "talentLeft": "Undispellable Windrun",
          "talentRight": "+100 Powershot Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-2s Shackleshot Cooldown",
          "talentRight": "+1.5 Mana Regen"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Windranger_Shackleshot_1.mp3\/revision\/latest?cb=20191216030602",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "The travels at a speed of 1650 and searches for enemies or trees within 46° at the opposite side of the target from where Shackleshot was cast. This means when Windranger teleports away after cast, it latches on targets based on the cast location, not her new location. The complete search area is shaped like a triangle, with 575 being the triangle's height. Therefore, the triangle has two sides with a length of 624.66, and the third side has a length of 488.15.",
        "This means when Windranger teleports away after cast, it latches on targets based on the cast location, not her new location.",
        "The complete search area is shaped like a triangle, with 575 being the triangle's height.",
        "Therefore, the triangle has two sides with a length of 624.66, and the third side has a length of 488.15.",
        "Shackleshot always prioritizes units over trees as its secondary target, and picks the furthest suitable unit or tree. If the primary target dies before Shackleshot reaches it, the projectile can still latch to a secondary unit and stun it. It can also latch on invisible units and units in the Fog of War.",
        "If the primary target dies before Shackleshot reaches it, the projectile can still latch to a secondary unit and stun it.",
        "It can also latch on invisible units and units in the Fog of War.",
        "If the target is not shackled, it is stunned for 0.75 seconds using the default stunned debuff. If the target is shackled to a unit, both of them are stunned for 2\/2.6\/3.2\/3.8 (TagTalent 2.8\/3.4\/4\/4.6) seconds using the shackleshot debuff. The stun persists, even when the primary or the secondary unit dies, or if the tree is destroyed earlier. The stun also persists when one of the targets is freed from the stun earlier.",
        "If the target is shackled to a unit, both of them are stunned for 2\/2.6\/3.2\/3.8 (TagTalent 2.8\/3.4\/4\/4.6) seconds using the shackleshot debuff.",
        "The stun persists, even when the primary or the secondary unit dies, or if the tree is destroyed earlier.",
        "The stun also persists when one of the targets is freed from the stun earlier.",
        "The stun duration increasing talent only increases the success stun duration. The fail stun duration is not increased."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10 (TagTalent 14\/12\/10\/8)",
      "description": "Shackles the target to an enemy unit or tree in a line directly behind it. If no unit or tree is present, the stun duration is reduced to 0.75.",
      "spellName": "Shackleshot",
      "params": [
        "Cast Animation: 0.15+0.45",
        "Cast Range: 800",
        "Shackle Search Range: 575",
        "Shackle Search Angle: 46°",
        "Max Shackle Targets: 2",
        "Success Stun Duration: 2\/2.6\/3.2\/3.8 (TagTalent 2.8\/3.4\/4\/4.6)",
        "Fail Stun Duration: 0.75",
        "Blocked fully only when primary target. Blocked upon impact."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Windranger_Powershot_1.mp3\/revision\/latest?cb=20191216030558",
      "effects": [
        "Ability Target Point \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Powershot travels at a speed of 3000, taking 0.87 seconds to reach the maximum distance. The arrow provides 400 radius flying vision while traveling forwards, and the vision sticks at its final location for 3.34 seconds. With the travel distance and damage radius, the arrow can damage units up to 2725 range away. Powershot destroys trees within 50 radius around it while traveling. Trees destroyed do not reduce the arrow's damage.",
        "The arrow provides 400 radius flying vision while traveling forwards, and the vision sticks at its final location for 3.34 seconds.",
        "With the travel distance and damage radius, the arrow can damage units up to 2725 range away.",
        "Powershot destroys trees within 50 radius around it while traveling. Trees destroyed do not reduce the arrow's damage.",
        "The maximum damage is done after the fully channeling for 1 second. Each channeled server tick increase its damage by 5\/8.33\/11.67\/15 (TagTalent 8.33\/11.67\/15\/18.33). The sound of a bow getting stretched during channeling time is audible to allies only.",
        "The sound of a bow getting stretched during channeling time is audible to allies only.",
        "Every time Powershot hits an enemy, its current damage is reduced by 20%. For how much damage a fully channeled arrow deals, and with the max damage increasing talent (before reductions), please refer to the chart below. To reach 1 damage, the arrow needs to hit 23\/25\/27\/28 (TagTalent 25\/27\/28\/29) units.",
        "For how much damage a fully channeled arrow deals, and with the max damage increasing talent (before reductions), please refer to the chart below.",
        "To reach 1 damage, the arrow needs to hit 23\/25\/27\/28 (TagTalent 25\/27\/28\/29) units."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "12\/11\/10\/9",
      "description": "Windranger charges her bow for up to 1 second for a single powerful shot, which deals more damage the longer it is charged. The arrow damages enemies along its path. For each enemy that Powershot hits, its damage is reduced by 20%.",
      "spellName": "Powershot",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 2600",
        "Travel Distance: 2600",
        "Damage Radius: 125",
        "Max Channel Time: 1",
        "Max Damage: 150\/250\/350\/450 (TagTalent 250\/350\/450\/550)",
        "Damage Reduction per Unit Hit: 20%"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0a\/Windranger_Windrun.mp3\/revision\/latest?cb=20191216030607",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Interrupts Windranger's channeling abilities upon cast.",
        "Grants 100% evasion for its duration.",
        "The movement speed slow is provided by an aura on Windranger. Its debuff lingers for 2.5 seconds.",
        "With the level 25 talent, Windrun turns Windranger invisible and phased for its duration. During the fade time, Windranger can cast abilities, use items and perform attacks without breaking the invisibility. Invisibility is broken upon reaching the cast point of abilities or items, or upon launching an attack. The invisibility is provided by a second buff, so breaking it prevents Windranger from going invisible again. Windranger can pick up or drop items without breaking the invisibility.",
        "During the fade time, Windranger can cast abilities, use items and perform attacks without breaking the invisibility.",
        "Invisibility is broken upon reaching the cast point of abilities or items, or upon launching an attack.",
        "The invisibility is provided by a second buff, so breaking it prevents Windranger from going invisible again.",
        "Windranger can pick up or drop items without breaking the invisibility.",
        "Both Windrun undispelable and invisibility granting talents do not update the current active instance.",
        "With Aghanim's Scepter, Windrun passively grants evasion, and applies haste on Windranger while active, meaning she cannot be slowed while affected. The evasion stacks diminishingly with other sources of evasion and uses pseudo-random distribution. On average, the passive evasion increases Windranger's survivability against physical attacks by 42.86%. Acquiring Aghanim's Scepter instantly grants 1 extra charge. This only happens once, so re-acquiring it does not grant another charge.",
        "The evasion stacks diminishingly with other sources of evasion and uses pseudo-random distribution.",
        "On average, the passive evasion increases Windranger's survivability against physical attacks by 42.86%.",
        "Acquiring Aghanim's Scepter instantly grants 1 extra charge. This only happens once, so re-acquiring it does not grant another charge."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "15\/14\/13\/12 (TagTalent 0.25)",
      "description": "Increases movement speed and adds evasion from all physical attacks, while slowing movement of nearby enemies.",
      "spellName": "Windrun",
      "params": [
        "Cast Animation: 0+0",
        "Slow Radius: 325",
        "Evasion: 100%",
        "Move Speed Bonus: 60%",
        "Move Speed Slow: 15%\/20%\/25%\/30%",
        "Aura Linger Duration: 2.5",
        "Duration: 3\/4\/5\/6",
        "Invisibility Fade Time: 0.2",
        "Passive Evasion: 30%",
        "Haste Speed: 550",
        "Number of Charges: 2",
        "Charge Replenish Time: 15\/14\/13\/12",
        "Grants 2 charges to Windrun and grants haste movement speed. Passively provides 30% Evasion.",
        "Slow persists if debuff was placed before spell immunity.",
        "The passive evasion is disabled by Break.",
        "The passive evasion works for illusions."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Windranger_Gale_Force.mp3\/revision\/latest?cb=20210829210057",
      "effects": [
        "Ability Target Point \/ Vector Targeting",
        "Affects Enemies"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Recasting Gale Force while a previous cast is still active immediately ends the previous cast.",
        "The effect is provided by an aura, its debuff lingers for 0.5 seconds.",
        "Pushes enemies within the radius at a speed of 250 towards the selected direction. With the duration and aura linger duration, Gale Force can push enemies for a total distance of 875.",
        "With the duration and aura linger duration, Gale Force can push enemies for a total distance of 875.",
        "The push does not impede enemies at all, and even allows them to move still.",
        "Does not push enemies that are affected by sources of forced movement that disable enemies in some way."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "40",
      "description": "Summons a strong wind that pushes all enemies within 1000 radius by 250 units per second in the target direction for 3 seconds. Vector Targeted. Global Range. Mana Cost: 150 Cooldown: 40s",
      "spellName": "Gale Force",
      "params": [
        "Cast Animation: 0.2+0.47",
        "Cast Range: Global",
        "Radius: 1000",
        "Push Speed: 250",
        "Aura Linger Duration: 0.5",
        "Duration: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Windranger_Focus_Fire.mp3\/revision\/latest?cb=20191216030555",
      "effects": [
        "Ability Target Unit",
        "Affects Self"
      ],
      "notes": [
        "The cast range of Focus Fire is based on the attack range of the caster. The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses. However, this does not include the unlimited range while Hurricane Pike is active.",
        "The cast range can be further increased by other attack range bonuses. However, it is not affected by cast range bonuses.",
        "However, this does not include the unlimited range while Hurricane Pike is active.",
        "Upon cast, Focus Fire orders Windranger to attack the target, and allows her to move while attacking the target.",
        "Windranger automatically attacks the Focus Fire target whenever she is in range, unless she is given an order that is not a move or attack order. The automatic attacking can be paused by ordering her to stop (S) or hold position (H) once. When paused, she no longer attacks the target while moving. To resume the automatic attacking, a new attack order (TagTalent Right Click on target or (A) must be given to her.",
        "The automatic attacking can be paused by ordering her to stop (S) or hold position (H) once. When paused, she no longer attacks the target while moving.",
        "To resume the automatic attacking, a new attack order (TagTalent Right Click on target or (A) must be given to her.",
        "Reduces Windranger's main and bonus attack damage when attacking the target. The reduction amount can be defined as (Am + Abonus) × 50%\/40%\/30% Other conditional bonus sources added to the primary attack are not reduced (e.g. Mana Break).",
        "The reduction amount can be defined as (Am + Abonus) × 50%\/40%\/30%",
        "Other conditional bonus sources added to the primary attack are not reduced (e.g. Mana Break).",
        "Windranger can switch attack targets without losing the buff against the Focus Fire target.",
        "When switching attack targets, the attack speed and damage adapt as soon as the attack begins.",
        "Casting Focus Fire on multiple targets only grants the attack speed and damage reduction against the most recent target.",
        "Focus Fire ends prematurely when Windranger dies, but persists through the target's death.",
        "Can be cast on any enemy unit, including buildings, excluding wards, invulnerable or hidden units.",
        "The Focus Fire cooldown advance talent cause Focus Fire to skip 20 seconds of its current cooldown if the target dies. The cooldown skip only happens if the dying target is a hero (or clones), excluding illusions and creep-heroes. It does not matter how the target dies or is credited for, the cooldown skip always triggers. This effect can be triggered multiple times per cast, possible if the target reincarnates, buys back, or against a resummoned Tempest Double.",
        "The cooldown skip only happens if the dying target is a hero (or clones), excluding illusions and creep-heroes.",
        "It does not matter how the target dies or is credited for, the cooldown skip always triggers.",
        "This effect can be triggered multiple times per cast, possible if the target reincarnates, buys back, or against a resummoned Tempest Double."
      ],
      "mana": "75\/100\/125",
      "hotKey": "R",
      "cooldown": "70\/50\/30",
      "description": "Windranger channels the wind to gain 475 additional attack speed against a single enemy unit or structure, though with a reduction to her attack damage. Extra damage from secondary item effects is not reduced. Lasts 20 seconds.",
      "spellName": "Focus Fire",
      "params": [
        "Cast Animation: 0+0",
        "Attack Speed Bonus: 475",
        "Attack Damage Reduction: 50%\/40%\/30% (TagTalent 34%\/24%\/14%)",
        "Duration: 20",
        "Cooldown Skip on Target Death: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.4,
    "attrAgility": 17.0
  },
  "description": "Lyralei, the Windranger, is a ranged intelligence hero that uses powerful abilities in conjunction with her physical attack to take down enemies. Despite being an intelligence Hero, Windranger's playstyle resembles that of an agility Hero, due in large part to her skill set. Windranger is most often played as an offlane solo due to her escape, long range harass, and farm capability; however, she is quite versatile and can be fielded as a midlaner, roamer, lane support, or even a carry, if the game calls for it. She is famous for her immense utility and versatility.",
  "history": "The western forests guard their secrets well. One of these is Lyralei, master archer of the wood, and favored godchild of the wind. Known now as Windranger, Lyralei's family was killed in a storm on the night of her birth--their house blown down by the gale, contents scattered to the winds. Only the newborn survived among the debris field of death and destruction. In the quiet after the storm, the wind itself took notice of the lucky infant crying in the grass. The wind pitied the child and so lifted her into the sky and deposited her on a doorstep in a neighboring village. In the years that followed, the wind returned occasionally to the child's life, watching from a distance while she honed her skills. Now, after many years of training, Windranger fires her arrows true to their targets. She moves with blinding speed, as if hastened by a wind ever at her back. With a flurry of arrows, she slaughters her enemies, having become, nearly, a force of nature herself.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Focus Fire Kills Advance Cooldown by 20s.",
      "talentRight": "Windrun Grants Invisibility"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-16% Focus Fire Damage Reduction",
      "talentRight": "+0.8s Shackleshot Duration"
    },
    {
      "talentLvl": "15",
      "talentLeft": "Undispellable Windrun",
      "talentRight": "+100 Powershot Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-2s Shackleshot Cooldown",
      "talentRight": "+1.5 Mana Regen"
    }
  ]
}