{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Boots_of_Bearing_Endurance.mp3\/revision\/latest?cb=20220618225121",
      "effects": [
        "Радиус: 1200",
        "Бонус к скорости передвижения: 15%",
        "Бонус к скорости атаки: 50",
        "Длительность невосприимчивости к замедлению: 1,5",
        "Длительность: 6",
        "Количество зарядов: 8",
        "Время восстановления заряда: 180"
      ],
      "notes": [
        "Не прерывает произносимые способности заклинателя при применении.",
        "Boots of Bearing всегда начинает с максимальным количеством зарядов, независимо от того как много зарядов было у Drum of Endurance при улучшении. Предметы со способностями, основанными на зарядах, должны быть в основном инвентаре владельца, чтобы восполнить заряды. Не восполняет заряды при нахождении в ранце, на земле, в тайнике или у курьера. При наличии нескольких Boots of Bearing в инвентаре, заряды получит самый старый. Если он полон, то заряды начнёт получать второй по давности.",
        "Предметы со способностями, основанными на зарядах, должны быть в основном инвентаре владельца, чтобы восполнить заряды.",
        "Не восполняет заряды при нахождении в ранце, на земле, в тайнике или у курьера.",
        "При наличии нескольких Boots of Bearing в инвентаре, заряды получит самый старый. Если он полон, то заряды начнёт получать второй по давности.",
        "Применение Endurance без зарядов отправит предмет на перезарядку без любых других эффектов.",
        "Несколько применений Endurance не складывают бафф, но обновляют длительность.",
        "Оба баффа от Boots of Bearing и Drum of Endurance не складываются, существо под действием одного не может попасть под действие другого. Это значит, что если существо уже имеет бафф от Boots of Bearing, то применение Drum of Endurance не заменит бафф и не обновит его, и наоборот.",
        "Это значит, что если существо уже имеет бафф от Boots of Bearing, то применение Drum of Endurance не заменит бафф и не обновит его, и наоборот.",
        "Первые 1,5 сек. действия баффа существо полностью невосприимчиво к замедлениям. Не работает против эффектов оцепенения, барьеров и установки скорости передвижения.",
        "Не работает против эффектов оцепенения, барьеров и установки скорости передвижения.",
        "Действует только на подконтрольных игроку существ, включая неуязвимых существ, исключая варды.",
        "Не делит перезарядку с Drum of Endurance."
      ],
      "mana": "0",
      "abilityName": "Endurance",
      "cooldown": "30",
      "description": "Расходует заряд, чтобы увеличить их скорость атаки на 50 и скорость передвижения на 15%. Действует 6 сек. В первые 1,5 сек. союзников нельзя замедлить. Изначально имеет 8 зарядов. Получает 1 заряд каждые 3 минуты.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Доп. скорость передвижения: 20",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Несколько источников Swiftness Aura не складываются. Это включает ауру от Drum of Endurance.",
        "Полностью сочетается с другими бонусами к скорости передвижения.",
        "Не действует на неуязвимых существ.",
        "Эффект ауры задерживается на 0,5 сек."
      ],
      "mana": null,
      "abilityName": "Swiftness Aura",
      "cooldown": null,
      "description": "Увеличивает союзникам вокруг скорость передвижения на 20.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "160 здоровья и 0,8 восстановления здоровья.",
    "96 маны и 0,4 восстановления маны.",
    "8 основного урона от атаки \/ героям."
  ],
  "cost": "4125",
  "lore": null,
  "consistFrom": [
    "Tranquil Boots",
    "Drum of Endurance",
    "Recipe"
  ],
  "name": "Boots of Bearing",
  "description": "Ослепительная обувь, сделанная для древнего герольда, первым осмелившегося распространить славу Стоунхолла за пределы изначальных владений.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}