{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Pipe_of_Insight.mp3\/revision\/latest?cb=20141214195933",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания заклинателя.",
        "Блокирует урон до до любых уменьшений, исключая иммунитет к заклинаниям, во время действия которого способность не блокирует магический урон.",
        "Повторное применение обновляет бафф и сбрасывает счетчик поглощенного урона барьера.",
        "Не сочетается с другими магическими барьерами. Если на существе будет активно несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно. При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Если на существе будет активно несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно.",
        "При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Блокирует только магический урон от заклинаний и атак. Не блокирует физический или чистый урон.",
        "Не делит перезарядку с Pipe of Insight."
      ],
      "mana": "75",
      "abilityName": "Barrier",
      "cooldown": null,
      "description": "Создаёт щит, блокирующий до 325 магического урона. Действует 12 сек.",
      "params": [
        "Поглощение магического урона: 325",
        "Длительность: 12"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Сочетается по закону убывающей полезности с другими источниками сопротивления магии.",
    "Увеличивает сопротивление магии героев до 40%, учитывая базовое сопротивление в 25% и не учитывая другие источники."
  ],
  "cost": "1450",
  "lore": null,
  "consistFrom": [
    "Ring of Health",
    "Cloak",
    "Ring of Regen"
  ],
  "boughtFrom": "Броня",
  "name": "Hood of Defiance",
  "description": "Этот подбитый мехом капюшон защищает от магии, поэтому его сторонится любой колдун.",
  "trivia": [],
  "upgradeIn": [
    "Pipe of Insight",
    "Eternal Shroud"
  ],
  "bonuses": [
    "+8,5 к регенерации здоровья",
    "+20% к сопротивлению магии"
  ],
  "tips": null
}