{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,5 сек. действия Terrorize",
          "talentRight": "+110 к скорости атаки"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-8 сек. перезарядки Bramble Maze",
          "talentRight": "+50 к урону"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+125 к дальности заклинаний",
          "talentRight": "+32 к урону от Bedlam"
        },
        {
          "talentLvl": "10",
          "talentLeft": "–2 сек. перезарядки Shadow Realm",
          "talentRight": "+0,6 сек. оглушения от Cursed Crown"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5e\/Bramble_Maze.mp3\/revision\/latest?cb=20171105022300",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Задержка визуальных и звуковых эффектов длится 0,5 секунды и видна только союзникам.",
        "Полет снаряда имеет лишь косметическое назначение и не влияет на задержку.",
        "Кусты всегда появляются в одном и том же порядке. 4 куста располагаются в радиусе 200 от центра области по четырем сторонам. Ещё 4 куста располагаются в радиусе 500 от центра области со смещением в 45 градусов относительно предыдущих. Кусты появляются с интервалом в 0,075 секунды спустя 0,5 секунды после применения, так что появление всех кустов занимает 1,025 секунды. Внутренний круг появляется первым, начиная с правого куста против часовой стрелки. Внешний — с верхнего правого куста.",
        "4 куста располагаются в радиусе 200 от центра области по четырем сторонам.",
        "Ещё 4 куста располагаются в радиусе 500 от центра области со смещением в 45 градусов относительно предыдущих.",
        "Кусты появляются с интервалом в 0,075 секунды спустя 0,5 секунды после применения, так что появление всех кустов занимает 1,025 секунды.",
        "Внутренний круг появляется первым, начиная с правого куста против часовой стрелки. Внешний — с верхнего правого куста.",
        "Каждый куст неактивен 0,1 секунды после появления.",
        "Куст связывает первого врага в радиусе 90 от него, после чего исчезает. Привязка не дает эффект True Sight на связанного врага.",
        "Привязка не дает эффект True Sight на связанного врага.",
        "Для привязки кустам не нужен обзор, поэтому они могут связать невидимых врагов или врагов в тумане войны.",
        "Наносит 62,5\/50\/43,75\/40 урона с интервалом в 0,5 секунды спустя 0,5 секунд после связки, срабатывая 2\/3\/4\/5 раз. Может нанести цели до 125\/150\/175\/200 единиц урона (до учета сопротивления).",
        "Может нанести цели до 125\/150\/175\/200 единиц урона (до учета сопротивления).",
        "Отсчет времени жизни кустов начинается после задержки создания. Следовательно, последний куст исчезнет через 16,025 секунд после применения заклинания.",
        "Несколько источников дебаффа сочетаются. Каждый из кустов применяет свой дебафф отдельно от других кустов.",
        "Повышение уровня заклинания после его применения не обновляет длительность оцепенения кустов."
      ],
      "mana": "100\/120\/140\/160",
      "hotKey": "Q",
      "cooldown": "20 (TagTalent 12)",
      "description": "Герой зачаровывает выбранную область, где через 0,5 сек. вырастает лабиринт из терновых кустов. Они накладывают оцепенение на задетых противников и наносят им периодический урон.",
      "spellName": "Bramble Maze",
      "params": [
        "Анимация применения: 0,3+0,8",
        "Дальность применения: 1100\/1200\/1300\/1400 (TagTalent 1225\/1325\/1425\/1525)",
        "Радиус появления кустов: 500",
        "Радиус поиска цели для оцепенения: 90",
        "Задержка появления куста: 0,5",
        "Интервал появления кустов: 0,075",
        "Задержка активации куста: 0,1",
        "Количество кустов: 8",
        "Урон в секунду: 125\/100\/87,5\/80",
        "Длительность оцепенения: 1\/1,5\/2\/2,5",
        "Длительность лабиринта: 15"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Волшебный мир фей всегда рядом с вами - он лишь ждет, когда вы придёте..."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/51\/Shadow_Realm.mp3\/revision\/latest?cb=20190530174715",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании не прерывает произносимые способности.",
        "С помощью Shadow Realm можно избежать снаряды.",
        "Во время действия Shadow Realm, Dark Willow нельзя выбрать целью для атаки или направленного на цель заклинания. Любые атаки или заклинания, направленные на Dark Willow в момент анимации атаки или применения, будут отменены. При этом Dark Willow также не сможет выбрать себя своими предметами. Способность не предотвращает отражение заклинаний обратно в Dark Willow.",
        "Любые атаки или заклинания, направленные на Dark Willow в момент анимации атаки или применения, будут отменены.",
        "При этом Dark Willow также не сможет выбрать себя своими предметами.",
        "Способность не предотвращает отражение заклинаний обратно в Dark Willow.",
        "Во время действия Shadow Realm каждое заклинание будет считать, будто Dark Willow невидима и имеет иммунитет к эффекту True Sight.",
        "Во время действия Shadow Realm на Dark Willow действует сквозное передвижение, позволяя ей проходить сквозь других юнитов.",
        "Использование способности при атаке врага отдаст приказ \"стоп\" Dark Willow, поэтому заряд не будет потрачен впустую. При этом, если герою отдали команду атаковать не в пределах дальности атаки, то использование Shadow Realm при движении не прервет его атаку мгновенно.",
        "При этом, если герою отдали команду атаковать не в пределах дальности атаки, то использование Shadow Realm при движении не прервет его атаку мгновенно.",
        "Использование заклинаний или предметов во время действия Shadow Realm не прерывает бафф, но атака это сделает. При улучшении, атаки также не прервут бафф.",
        "При улучшении, атаки также не прервут бафф.",
        "Бафф \"Shadow Realm\" пропадает при запуске снаряда от атаки. При запуске Dark Willow получает другой бафф, отвечающий за урон. Этот бафф исчезает при поражении цели или спустя 3 секунды, в зависимости от того, что произойдет раньше. То есть, если снаряд летит более чем 3 секунды, то урон от баффа не нанесется. Бафф, отвечающий за урон, пропадает при смерти владельца способности, поэтому смерть до попадания снаряда в цель отменит дополнительный урон. Бафф работает только на ту атаку, что вызвала его. Любые другие снаряды, запущенные позже, не нанесут дополнительный урон.",
        "Этот бафф исчезает при поражении цели или спустя 3 секунды, в зависимости от того, что произойдет раньше.",
        "То есть, если снаряд летит более чем 3 секунды, то урон от баффа не нанесется.",
        "Бафф, отвечающий за урон, пропадает при смерти владельца способности, поэтому смерть до попадания снаряда в цель отменит дополнительный урон.",
        "Бафф работает только на ту атаку, что вызвала его. Любые другие снаряды, запущенные позже, не нанесут дополнительный урон.",
        "Урон усиливается на 0,77142857142857\/1,5428571428571\/2,3142857142857\/3,0857142857143 с каждым обновлением сервера (0,03 секунды), достигая максимального значения за 3.5 секунды.",
        "Урон перестает увеличиваться в момент запуска снаряда и не возрастает при полете к цели.",
        "Урон наносится отдельным источником и не добавляется к урону Dark Willow.",
        "Дополнительный урон от Shadow Realm не работает на строения и варды, но наносится союзникам."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "W",
      "cooldown": "32\/26\/20\/14 (TagTalent 30\/24\/18\/12)",
      "description": "Анимация применения: 0+0 Бонус к дальности атаки: 600 Максимальный урон: 90\/180\/270\/360 Время до максимального урона: 3.5 Длительность: 5 32\/26\/20\/14 ( 30\/24\/18\/12) 70\/80\/90\/100 Атаки больше не выводят героя из Shadow Realm. Каждая атака имеет бонусный урон основанный на длительности эффекта. Не пытается нанести урон врагам с иммунитетом к заклинаниям. Модификаторы Shadow Realm Buff: Нельзя развеять. Остаётся после смерти. Shadow Realm Buff Attack Logic: Нельзя развеять. Остаётся после смерти. То, что ты не видишь, наверняка тебе навредит.",
      "spellName": "Shadow Realm",
      "params": [
        "Анимация применения: 0+0",
        "Бонус к дальности атаки: 600",
        "Максимальный урон: 90\/180\/270\/360",
        "Время до максимального урона: 3.5",
        "Длительность: 5",
        "Атаки больше не выводят героя из Shadow Realm. Каждая атака имеет бонусный урон основанный на длительности эффекта.",
        "Не пытается нанести урон врагам с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "0",
      "story": "То, что ты не видишь, наверняка тебе навредит."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/70\/Cursed_Crown.mp3\/revision\/latest?cb=20171105022324",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Звуковой и визуальный эффект над целью в момент задержки слышны и видны всем. Визуальный эффект показывает затрагиваемую область каждую секунду.",
        "Визуальный эффект показывает затрагиваемую область каждую секунду.",
        "Получение неуязвимости или исчезновение не предотвращает срабатывание дебаффа по области вокруг цели.",
        "При улучшении с Aghanim's Shard любая потеря негативного эффекта будет приводить к появлению 4 кустов от Bramble Maze вокруг цели. Если Bramble Maze не изучена, то кусты не появятся. Кусты всегда появляется на расстоянии 175 от цели по всем сторонам света. В отличие от обычного применения Bramble Maze, кусты от Cursed Crown появляются одновременно со всех сторон и активируются без задержки.",
        "Если Bramble Maze не изучена, то кусты не появятся.",
        "Кусты всегда появляется на расстоянии 175 от цели по всем сторонам света.",
        "В отличие от обычного применения Bramble Maze, кусты от Cursed Crown появляются одновременно со всех сторон и активируются без задержки."
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "E",
      "cooldown": "18\/16\/14\/12 (TagTalent 15\/13\/11\/9)",
      "description": "Dark Willow насылает на противника древнее проклятье фей. Спустя некоторое время оно оглушает жертву и всех противников вокруг неё.",
      "spellName": "Cursed Crown",
      "params": [
        "Анимация применения: 0,2+0,83",
        "Дальность применения: 600\/625\/650\/675 (TagTalent 725\/750\/775\/800)",
        "Радиус оглушения: 360",
        "Радиус появления кустов: 0 (TagTalent 175)",
        "Задержка: 4",
        "Длительность оглушения: 1,75\/2,25\/2,75\/3,25 (TagTalent 4,6)",
        "Когда отсчёт Cursed Crown заканчивается или её эффект развеивают, вокруг цели появляются 4 терновых куста. Уменьшает перезарядку на 3 секунды.",
        "Блокируется при использовании."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Тебя что, не предупреждали? Не заключай сделок с феями..."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cd\/Bedlam.mp3\/revision\/latest?cb=20171105022144",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Bedlam и Terrorize - связанные способности; улучшение одной автоматически улучшает другую способность.",
        "При использовании прерывает произносимые способности Dark Willow.",
        "При активации Terrorize становится неактивной и её нельзя использовать.",
        "Bedlam неактивна, если была использована Terrorize и остается в таком состоянии до возвращения Джекса от затронутых врагов к Dark Willow.",
        "При использовании Джекс всегда появляется на западе и облетает Dark Willow по часовой стрелке.",
        "Джекс облетает Dark Willow со скоростью в 698,13 единиц, завершая круг за 1.8 секунд. В итоге Джекс совершает 2,78 оборотов за всю длительность.",
        "В итоге Джекс совершает 2,78 оборотов за всю длительность.",
        "С каждой атакой Джекс выбирает случайную видимую цель в пределах дальности атаки. Для атаки нет приоритетов. Джекс не атакует строения или варды. Радиус атаки закреплен за Джексом. Его окружает светло-розовое свечение, обозначающее область атаки. Джекс продолжает атаковать даже когда Dark Willow обезврежена. Атаки прекращаются только в случае смерти героя или истечении длительности. Атаки Джекса - не обычная атака. Они считаются за заклинание и не взаимодействуют с любыми другими эффектами атаки. То есть на атаки работает усиление урона заклинаний и магический вампиризм. Источником урона является Dark Willow. Снаряд от атаки летит со скоростью в 1400 единиц.",
        "Радиус атаки закреплен за Джексом. Его окружает светло-розовое свечение, обозначающее область атаки.",
        "Джекс продолжает атаковать даже когда Dark Willow обезврежена. Атаки прекращаются только в случае смерти героя или истечении длительности.",
        "Атаки Джекса - не обычная атака. Они считаются за заклинание и не взаимодействуют с любыми другими эффектами атаки.",
        "То есть на атаки работает усиление урона заклинаний и магический вампиризм. Источником урона является Dark Willow.",
        "Снаряд от атаки летит со скоростью в 1400 единиц.",
        "С интервалом между атаками в 0.25 секунды способность может нанести до 20 ударов.",
        "С интервалом между атаками и уроном способность может нанести до 300\/500\/700 единиц урона в секунду одному герою.",
        "Может нанести до 1500\/2500\/3500 единиц урона одному юниту (до учета сопротивления).",
        "Повторное использование Bedlam до завершения предыдущего обновит длительность.",
        "Само заклинание не дает обзор, но у Джекса есть наземный обзор в радиусе 600, который светлячок дает при использовании."
      ],
      "mana": "100\/150\/200",
      "hotKey": "D",
      "cooldown": "30",
      "description": "Dark Willow призывает на помощь ручного светлячка, который начинает вращаться вокруг своего владельца, быстро атакуя ближайших противников. Невозможно применить во время действия способности Terrorize.",
      "spellName": "Bedlam",
      "params": [
        "Анимация применения: 0+0",
        "Радиус облета: 200",
        "Дальность атаки: 300",
        "Интервал между атаками: 0.25",
        "Урон от атаки: 75\/125\/175 (TagTalent 107\/157\/207)",
        "Секунд для полного оборота: 1.8",
        "Длительность облета: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Прошу, не обижайся на Джекса. Просто ему очень нравится убивать."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/40\/Terrorize.mp3\/revision\/latest?cb=20171105022430",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Bedlam и Terrorize - связанные способности; улучшение одной автоматически улучшает другую способность.",
        "При активации Bedlam становится неактивной и её нельзя использовать.",
        "Terrorize неактивна, если была использована Terrorize и остается в таком состоянии до возвращения Джекса от затронутых врагов к Dark Willow. То есть Terrorize нельзя использовать повторно до возвращения Джекса.",
        "То есть Terrorize нельзя использовать повторно до возвращения Джекса.",
        "Джекс летит к выбранной точке со скоростью в 2000 единиц и возвращается к Dark Willow со скоростью в 600 единиц.",
        "Визуальные эффекты над выбранной областью в момент анимации применения\/задержки эффекта видны только союзникам. Звук слышен всем.",
        "Применяет эффект страха ко всем пораженным врагам в радиусе, заставляя их бежать к фонтану своей команды, предотвращая их действия. При поражении нейтральных крипов они возвращаются к своим лагерям.",
        "При поражении нейтральных крипов они возвращаются к своим лагерям.",
        "Дает общий обзор на всех пораженных врагов на всю длительность. Действует на невидимых юнитов, но не дает на них эффект True Sight.",
        "Само заклинание не дает обзор, но у Джекса есть наземный обзор в радиусе 600, который светлячок дает при использовании."
      ],
      "mana": "150",
      "hotKey": "R",
      "cooldown": "100\/90\/80",
      "description": "Dark Willow натравливает на врагов своего ручного светлячка. После небольшой задержки он пугает всех противников в выбранной области, от чего они начинают бежать к своей базе. Невозможно применить во время действия способности Bedlam.",
      "spellName": "Terrorize",
      "params": [
        "Анимация применения: 1+2,57",
        "Дальность применения: 1300 (TagTalent 1425)",
        "Радиус применения: 400",
        "Длительность страха: 3,5\/3,75\/4 (TagTalent 5\/5,25\/5,5)"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Думаешь, ты знаешь, что такое настоящий страх? Ты не знаешь страха, если Джекс тебе незнаком..."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 20.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.6,
    "attrAgility": 18.0
  },
  "description": "Миреска Ветреная, Dark Willow — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Она имеет пять способностей, каждая из которых является активной. Первой способностью, Bramble Maze, Миреска призывает кустистый лабиринт. Задетые кусты применяют на врагов оцепенение и наносят им периодический урон. При помощи второй способности, Shadow Realm, фея прячется в мир теней, отчего её нельзя атаковать или применять на неё направленные способности. Атака, прерывающая способность, позволяет Миреске нанести увеличенный урон. Чем дольше она пробыла в этом состоянии, тем больше урон. Третьей способностью, Cursed Crown, Dark Willow накладывает на противника проклятую корону, и после небольшой задержки сам враг и все союзники в небольшом радиусе вокруг него оглушаются. Ультимейт героя состоит из двух активных способностей. Одна из них, Bedlam, призывает ручного светлячка Мирески, Джекса, который кружится вокруг неё и наносит урон рядом стоящим врагам. Чем ближе враги к герою, тем больше урон. А второй способностью, Terrorize, Джекс летит на область, врагов в которой он пугает, отчего они начинают бежать к своему фонтану. Ни первую, ни вторую способность нельзя применить одновременно.",
  "history": "Детишки обожают рассказывать о чудных похождениях феечек... Ах, если бы они знали, что многие феи — просто коварные гадины! А в их коварном мире немногие похвастаются такой дурной славой, как Миреска Ветреная. Миреска приходилась дочерью одному важному фейскому купцу, и росла она в беспощадном Ревтеле, где каждый без стыда плутовал и убивал. Но хоть она весьма ловко управлялась с этикетом, негласными правилами и светскими ритуалами, что пронизывали каждый её день, такая жизнь ей наскучила. Потому Миреска и поступила как самый обычный ребёнок-бунтарь: сожгла фамильное поместье до основания и вместе с верным светлячком Джексом стала жить жизнью бродячей мошенницы.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,5 сек. действия Terrorize",
      "talentRight": "+110 к скорости атаки"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-8 сек. перезарядки Bramble Maze",
      "talentRight": "+50 к урону"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+125 к дальности заклинаний",
      "talentRight": "+32 к урону от Bedlam"
    },
    {
      "talentLvl": "10",
      "talentLeft": "–2 сек. перезарядки Shadow Realm",
      "talentRight": "+0,6 сек. оглушения от Cursed Crown"
    }
  ]
}