{
  "abilities": [
    {
      "notes": [
        "The visual and audio effects at the targeted area during the cast point are visible and audible to allies only",
        "Creates 6 ( 9) waves in 1-second ( 0.75-second) intervals, starting immediately upon cast, resulting in duration of 5 ( 6) seconds",
        "Despite the visual effects, the damage is applied instantly, and not upon the waves landing",
        "On each wave, Firestorm first applies the damage, then the debuff\n Does not place the burn debuff on  Roshan, but does apply the wave damage",
        "The burn debuff deals damage in 1-second (0.75-second) intervals, starting immediately as the debuff is applied, resulting in 3 instances\n The burn debuff does not stack per interval\n Each interval refreshes its duration, resulting in 8 ( 11) possible instances",
        "Can deal up to 180\/300\/420\/540 + 12%\/16%\/20%\/24% ( 20%\/24%\/28%\/32%) of max health as damage (before reductions) when all waves hit\n SHARD NOTES it can deal up to 270\/450\/630\/810 + 15.75%\/21%\/26.25%\/31.5% ( 26.25%\/31.5%\/36.75%\/42%) of max health as damage",
        "SHARD NOTES ↓↓ Double-tapping now automatically targets self\n Firestorm still cannot target other units\n When self-targeting, all effects stay centered on Underlord, following him as he moves, and continues at his corpse's location upon death"
      ],
      "item_behaviour": [],
      "description": "Calls down waves of fire that damage enemy units in the target area, burning for additional damage over time.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.5+0.6",
        "Cast Range:  600\/625\/650\/675",
        "Effect Radius: 425 ( 500)",
        "Number of Waves: 6 ( 9)",
        "Wave\/Burn Interval: 1 ( 0.75)",
        "Damage per Wave: 30\/50\/70\/90",
        "Max Health as Damage per Second: 1.5%\/2%\/2.5%\/3% ( 2.5%\/3%\/3.5%\/4%)",
        "Burn Duration: 2 ( 1.5)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Underlord_Firestorm_1.mp3\/revision\/latest?cb=20191216025834",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "15\/14\/13\/12 (TagTalent 11\/10\/9\/8)",
      "aghanim": null,
      "name": "Firestorm",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "F",
      "story": "The flames of conquest blaze forth from the darkest depths of the abyss."
    },
    {
      "notes": [
        "The visual and audio effects at the targeted area during the cast point are visible and audible to allies only",
        "Roots the targets, preventing them from moving and casting certain mobility abilities\n Fully affects invisible units and units inside the Fog of War\n Provides True Sight over the targets",
        "The root is applied periodically to every enemy within the area\n However, the hidden modifier prevents them from being continuously rooted for the whole duration\n This hidden modifier is applied to every unit within the area which does not have the modifier yet\n The modifier lasts for 3.6 seconds\n Whenever the modifier expires, enemies get instantly rooted again, and then the hidden modifier is reapplied again\n This means that Pit of Malice does not root every unit within the area in set intervals\n Each unit is rooted every 3.6 seconds based on when they entered the area\n The hidden modifier does not disappear upon leaving the area\n Quickly leaving and re-entering does not result in an instant root\n All pits share the same modifier, therefore the root does not stack — once rooted, the unit becomes immune to all other pits until the modifier wears off",
        "Can root a unit up to 4 times if it stays within the area for the full duration, resulting in a total root time of 4.8\/5.6\/6.4\/7.2 ( 7.4\/8.2\/9\/9.8) seconds",
        "Creates a distinct visual effect around, and plays a distinct sound on affected heroes and illusions, but not around other affected units",
        "SCEPTER NOTES Adds a 400 radius aura to the center of Pit of Malice, which reduces enemy's movement speed by 40%\n The aura's debuff lingers for 0.5 seconds\n Acquiring <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter immediately updates all current active instances"
      ],
      "item_behaviour": [],
      "description": "A deadly pit is conjured at the target location; any unit that enters will be rooted. Each enemy unit within the pit are affected every 3.6 seconds.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.45+0.6",
        "Cast Range:  675",
        "Effect Radius: 400 ( 475)",
        "Root Interval: 3.6",
        "Root Duration: 1.2\/1.4\/1.6\/1.8 ( 1.85\/2.05\/2.25\/2.45)",
        "Pit Duration: 12",
        "Move Speed Slow:  40%",
        "Aura Linger Duration:  0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Underlord_Pit_of_Malice_1.mp3\/revision\/latest?cb=20191216025837",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies"
      ],
      "mana": "21\/19\/17\/15",
      "aghanim": null,
      "name": "Pit of Malice",
      "cooldown": "80\/100\/120\/140",
      "legacy_key": "T",
      "story": "Twisting into the seams of reality itself, Vrogros' manifest hatred paralyzes those who defy his will."
    },
    {
      "notes": [
        "Reduces the main attack damage of affected units\n Bonus attack damage is not reduced\n The aura does not affect invulnerable or hidden units, and its debuff lingers for 0.5 seconds\n Does not affect enemies which have no vision over Underlord\n However, Underlord still gains attack damage from dying enemies within the radius, despite the debuff not being present",
        "Grants flat bonus attack damage as long as the dying enemy unit was affected by the debuff, regardless of how it dies\n Grants a stack of attack damage bonus when there are multiple  Meepo Clones within the radius\n Does not grant bonus attack damage from dying illusions, buildings, wards,  Undying Zombies,  Couriers and the  Tempest Double\n Does not grant bonus attack damage if he is invulnerable or hidden as the enemy dies\n Each stack places a new buff on Underlord\n This means their durations are independent of each other, gaining a new stack does not refresh the existing stacks",
        "Treats creep-heroes as creeps",
        "A status buff is visible on the HUD, showing the current amount of bonus attack damage the aura currently grants\n Underlord's weapon also glows stronger with green particle effects the more damage stacks he has",
        "TALENT NOTES Atrophy Aura now grants 50% of the bonus attack damage to all allied heroes, including illusions, clones, and creep-heroes within its radius\n However, the bonus attack damage is not provided by an aura, it is placed as an expiring buff on allies\n It uses the same modifiers for allies as it does for Underlord, so they work exactly the same\n Affected allies gain 15\/17.5\/20\/22.5 bonus attack damage per dying hero and 1\/2\/3\/4 bonus attack damage per dying non-hero units"
      ],
      "item_behaviour": [],
      "description": "Nearby enemy units are weakened, losing a portion of their base damage. If an enemy dies while under this effect, Underlord gains temporary bonus damage.",
      "hot_key": "E",
      "params": [
        "Radius: 900",
        "Attack Damage Reduction: 5%\/15%\/25%\/35% ( 20%\/30%\/40%\/50%)",
        "Attack Damage Bonus per Hero Death: 30\/35\/40\/45",
        "Attack Damage Bonus per Non-Hero Death: 2\/4\/6\/8",
        "Buff Duration: 30\/45\/60\/75",
        "Aura Linger Duration: 0.5",
        "Allied Bonus Percentage:  50%"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Aura",
        "Affects: Enemies \/ Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Atrophy Aura",
      "cooldown": null,
      "legacy_key": "R",
      "story": "To merely stand in the presence of the Underlord is to feel the conviction of battle sapped from one's soul."
    },
    {
      "notes": [
        "The exit portal must not be within 2000 radius of Underlord\n A red range indicator around Underlord indicates the restricted area\n The portals cannot be placed inside the fountain areas, including the ramps, or inside  Roshan's pit\n Cannot be placed on impassable terrain, or spots obscured by buildings or trees",
        "Upon cast, allies and enemies get a ‼ Ping on their minimap, showing where the portals are placed\n The portals have distinct icons  on the minimap\n It is colored green if Underlord is an ally, and red if he is an enemy\n Both portals face each other when created, their particle effects point towards each other, indicating in which direction the other portal lies",
        "Destroy trees and provides flying vision within 200 radius around the portals upon spawning",
        "The portals gain their  Spell Immunity through a buff, allowing enemies to ‼ Ping it to display their remaining duration",
        "Only units with the  Warp ability may  Right Click or give an attack order (A) on the portal to start the channeling\n This includes heroes,  Meepo Clones, the  Tempest Double and the   Vengeance Illusion,  Warlock Golems and  Familiars\n Cannot start the channeling while silenced\n However, getting silenced while already channeling does not interrupt it\n While channeling, the unit gets moved towards the center of the portal over the 3 second channel time",
        "Underlord immediately starts channeling the teleport upon cast\n This can be canceled by the player",
        "Upon finishing the channeling, the unit gets teleported to the other portal\n Does not disjoint projectiles upon teleporting\n Does not interrupt queued and\/or ⇧ Shift-queue orders upon teleporting",
        "SCEPTER NOTES Fiend's Gate now creates  Pits of Malice based on its current level centered on both portals\n Pit of Malice's notes fully apply\n If it is not leveled, no pits are spawned"
      ],
      "item_behaviour": [],
      "description": "Opens 2 portals, one next to Underlord and one in the target location. Heroes can channel a portal for 3 seconds to teleport to the other side. Allies that pass through the portal temporarily gain Damage Reduction and Movement Speed. Portals have to be at least 2000 away from each other.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.45+0",
        "Cast Range: Global",
        "Min Distance: 2000",
        "Channel Distance:  300",
        "Channel Time: 3",
        "Incoming Damage Reduction: 14%\/22%\/30%",
        "Move Speed Bonus: 10%\/20%\/30%",
        "Buff Duration: 5\/6\/7",
        "Portals Duration: 20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Underlord_Fiend%27s_Gate_1.mp3\/revision\/latest?cb=20220412214405",
      "effects": [
        "Ability: Target Point",
        "Affects: Allies \/ Enemies"
      ],
      "mana": "120\/110\/100",
      "aghanim": null,
      "name": "Fiend's Gate",
      "cooldown": "100",
      "legacy_key": "D",
      "story": "They come without warning, leaving fire and blood where kingdoms once flourished."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 25.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.3,
    "attrAgilityInc": 1.6,
    "attrAgility": 12.0
  },
  "description": "Teleports his team in and out of battle. Through a Fiend's Gate comes the legions of the Abyssal Horde, marching out of their subterranean city with intent to conquer the nations above. Amidst the invaders stood Vrogros, the demonic hulk who conjured and rained apocalyptic Firestorms from the sky, engulfing towns and villages in emerald flame. Immolated enemies are held paralyzed in his spiteful, Malicious Grip. Feasting upon the carnage of battle, gaining strength as foes perish around him, causing their attacks to Atrophy by his very presence, delivering bloody retribution to any who would defy the will the Underlord.  Support Durable Nuker Disabler Escape ★★☆",
  "trivia": [
    "Underlord is named Azgalor, the Pit Lord in DotA.[1] His title, Pit Lord, was changed to avoid possible copyright infringements with Blizzard Entertainment, since the Pit Lords are a race of demons in the Warcraft universe.[2] His name, Azgalor, was also changed for the same reason. Azgalor was a character from the Warcraft universe as well, who served one of the main antagonists of the Warcraft universe as a well known commander.[3] According to the Bastion Announcer, Link▶️ \"Pyre Lord\" was also a proposed name for Underlord. Up until the June 23, 2016 Patch, Underlord's title was \"Abyssal Underlord\". While the rationale of dropping \"Abyssal\" is unclear, it may have been to prevent confusion with the shorthand terminology of Abyssal Blade.",
    "His title, Pit Lord, was changed to avoid possible copyright infringements with Blizzard Entertainment, since the Pit Lords are a race of demons in the Warcraft universe.[2]",
    "His name, Azgalor, was also changed for the same reason. Azgalor was a character from the Warcraft universe as well, who served one of the main antagonists of the Warcraft universe as a well known commander.[3]",
    "According to the Bastion Announcer, Link▶️ \"Pyre Lord\" was also a proposed name for Underlord.",
    "Up until the June 23, 2016 Patch, Underlord's title was \"Abyssal Underlord\". While the rationale of dropping \"Abyssal\" is unclear, it may have been to prevent confusion with the shorthand terminology of Abyssal Blade.",
    "Underlord had been developed since 2012; he already had a beta model, placeholder ability icons and fully finished and working abilities. He could also be spawned in lobbies with cheats enabled for a short while before it was disabled. This suggests that his release was originally planned much earlier (as a comparison, all other heroes were released shortly after their files were added to the game), but was delayed for reasons unknown.",
    "This suggests that his release was originally planned much earlier (as a comparison, all other heroes were released shortly after their files were added to the game), but was delayed for reasons unknown.",
    "Before his release, Underlord was showcased at the All-Star match of The International 2016, played by N0tail. He originally picked Sand King, but a bit after the start of the game, SirActionSlacks replaced his pick by Underlord.",
    "The line Underlord says after killing Bane, Link▶️ \"You have my permission to die.\", is a reference to the famous line \"When Gotham is ashes, you have my permission to die\", said by the villain Bane from the movie The Dark Knight Rises.",
    "Underlord's line when casting Dark Rift, Link▶️ \"Hold on to your butts!\", was spoken by Samuel L. Jackson's character Ray Arnold in the movie Jurassic Park (1993).",
    "Underlord was the final DotA hero ported over, before Dota 2 began to feature original heroes."
  ],
  "history": "Neither myth nor song exist to tell of their coming. Deep below the surface of the world lay unknown wonders and horrors. Down and down again, well beneath the slithering magma fields and simmering roots of dormant volcanoes stands the obsidian city of Aziyog, its incomparable stonework spanning an endless cavern. Within honeycomb walls mortared with the bones of countless slaves lies the domain of the Abyssal Horde, and their brutal underlord Vrogros. Armed by the monstrous forgemasters of his kind and well-practiced in the arts of the Dark Rift, Vrogros is able to conjure forth flame and crippling malice through the twist between worlds. He seeks always to expand his holdings, destroying or enslaving all he encounters. Yet the lands offered by the subterranean realm are few, and so his sights have turned upward. By his command the first waves of abyssal invaders have already marched through the rift, a few doomed legions meant merely to test the might of nations above. Now, as his full force readies itself for unending conquest, Vrogros himself steps into a sunlit world to announce his coming reign. Those who face the Underlord will bow and pay tribute, or be crushed where they stand.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+0.65s Pit of Malice Root",
        "talent_left": "+50% Atrophy Allied Hero Bonus"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+1% Firestorm Burn Damage",
        "talent_left": "+15% Atrophy Aura Attack Damage Reduction"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+75 Pit of Malice AoE",
        "talent_left": "-4s Firestorm Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+5 Armor",
        "talent_left": "+100 Firestorm Radius"
      }
    ],
    "notes": [
      "The armor talent does not benefit illusions."
    ]
  }
}