{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1100 к дальности применения Celestial Hammer",
          "talentRight": "2 заряда Starbreaker"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−1 атака для срабатывания Luminosity",
          "talentRight": "+150 к радиусу Solar Guardian"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−20 сек. перезарядки Solar Guardian",
          "talentRight": "+40% к критическому урону от Luminosity"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15% к замедлению от Celestial Hammer",
          "talentRight": "+30 к доп. урону от взмахов у Starbreaker"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/39\/Dawnbreaker_Starbreaker.mp3\/revision\/latest?cb=20210410152229",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Starbreaker нельзя применить, пока молот отсутствует из-за Celestial Hammer. Solar Guardian нельзя применить при активной Starbreaker.",
        "Solar Guardian нельзя применить при активной Starbreaker.",
        "↓↓ Двойное нажатие автоматически применит способность в сторону взгляда героя.",
        "Во время действия Starbreaker герой перемещается в указанное направление со скоростью в 215 единиц. Передвижение не прерывается другими необезвреживающими источниками принудительного передвижения. Передвижение от Starbreaker продолжится как только закончится действие другого источника. Не перемещает героя на возвышенности. При достижении непроходимой местности движение останавливается, а способность продолжает действие на месте. Перемещает Dawnbreaker на расстояние до 236,5 единиц за 1,1 сек. Уничтожает деревья на пути.",
        "Передвижение не прерывается другими необезвреживающими источниками принудительного передвижения. Передвижение от Starbreaker продолжится как только закончится действие другого источника.",
        "Не перемещает героя на возвышенности. При достижении непроходимой местности движение останавливается, а способность продолжает действие на месте.",
        "Перемещает Dawnbreaker на расстояние до 236,5 единиц за 1,1 сек.",
        "Уничтожает деревья на пути.",
        "Во время комбо герой обезоружен и не способен применять Celestial Hammer и Solar Guardian. Предметы можно использовать как обычно. Также можно использовать другие способности (например, использование Rubick или в Ability Draft). Использование предметов на передвижение не отменит эффекты Starbreaker.",
        "Предметы можно использовать как обычно. Также можно использовать другие способности (например, использование Rubick или в Ability Draft).",
        "Использование предметов на передвижение не отменит эффекты Starbreaker.",
        "Способность отменится, если Dawnbreaker получает дебафф оглушения, урагана, проклятия, провокации, страха или гипноза. Однако безмолвие не отменит её.",
        "Однако безмолвие не отменит её.",
        "Заставляет Dawnbreaker совершать мгновенные атаки по врагам в радиусе взмаха и на врагов в радиусе удара по земле по окончанию. Эти мгновенные атаки могут вызвать срабатывание любых модификаторов атаки и эффектов при ударе, кроме прорубания. Атаки имеют эффект True Strike и игнорируют обезоруживание. Luminosity получает только 1 заряд за атаку, независимо от количества врагов, пораженных мгновенными атаками за каждый удар. Применяет мгновенные атаки в интервалах 0,55 сек. сразу после применения, в результате совершая 3 атаки. Фактические эффекты способности не зависят от анимации вращения Dawnbreaker. Все враги получают удары от мгновенных атак одновременно на каждом интервале.",
        "Эти мгновенные атаки могут вызвать срабатывание любых модификаторов атаки и эффектов при ударе, кроме прорубания. Атаки имеют эффект True Strike и игнорируют обезоруживание.",
        "Luminosity получает только 1 заряд за атаку, независимо от количества врагов, пораженных мгновенными атаками за каждый удар.",
        "Применяет мгновенные атаки в интервалах 0,55 сек. сразу после применения, в результате совершая 3 атаки.",
        "Фактические эффекты способности не зависят от анимации вращения Dawnbreaker. Все враги получают удары от мгновенных атак одновременно на каждом интервале.",
        "Первые 2 удара применяются в радиусе 360 вокруг Dawnbreaker. Эти удары используют наименьший дополнительный урон и применяют замедление скорости передвижения. Сперва атаки наносят урон, потом — дебафф замедления.",
        "Эти удары используют наименьший дополнительный урон и применяют замедление скорости передвижения.",
        "Сперва атаки наносят урон, потом — дебафф замедления.",
        "Последний удар наносится в радиусе 250 на расстоянии в 250 единиц перед Dawnbreaker. Этот удар использует наибольший дополнительный урон и применяет оглушение вместе с небольшим подбрасыванием на расстояние в 90 единиц. Сперва атаки наносят урон, потом — дебафф оглушения. Удар по земле может поразить существ на расстоянии в 500 от Dawnbreaker.",
        "Этот удар использует наибольший дополнительный урон и применяет оглушение вместе с небольшим подбрасыванием на расстояние в 90 единиц.",
        "Сперва атаки наносят урон, потом — дебафф оглушения.",
        "Удар по земле может поразить существ на расстоянии в 500 от Dawnbreaker.",
        "Dawnbreaker оглушается на 0,2 сек. при нанесении удара по земле.",
        "С талантом 25-го уровня перезарядка заменяется 2 зарядами с временем восстановления в 17\/15\/13\/11 сек."
      ],
      "mana": "80",
      "item_behaviour": [],
      "name": "Starbreaker",
      "cooldown": "17\/15\/13\/11 (TagTalent 0)",
      "description": "Герой 3 раза вращает молотом вокруг себя, нанося врагам увеличенный урон от своей атаки. С последним взмахом герой бьёт молотом по земле, оглушая врагов перед собой и нанося им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,1",
        "Дальность применения: Глобальная",
        "Установленная скорость передвижения: 215",
        "Количество атак: 3",
        "Длительность комбо: 1,1",
        "Радиус взмаха: 360",
        "Доп. урон от взмахов: 20\/30\/40\/50 (TagTalent 50\/60\/70\/80)",
        "Замедление скорости передвижение от взмаха: 100%",
        "Длительность замедления от взмаха: 0,12",
        "Радиус удара по земле: 250",
        "Расстояние удара по земле: 250",
        "Доп. урон от удара по земле: 40\/65\/90\/115",
        "Длительность оглушения от удара по земле: 0,8\/1\/1,2\/1,4",
        "Длительность оглушения по себе: 0,2",
        "Количество зарядов: 2",
        "Время восстановления зарядов: 17\/15\/13\/11",
        "Мгновенные атаки полностью проходят сквозь иммунитет к заклинаниям. Замедление и оглушение не проникают сквозь иммунитет к заклинаниям.",
        "Получение дебаффа оцепенения во время действия способности мгновенно отменит её."
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c5\/Dawnbreaker_Celestial_Hammer_1.mp3\/revision\/latest?cb=20210410152231",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Несмотря на то что визуально используется оружие Dawnbreaker, она не обезоруживается и её атаки никак не модифицируются пока активна Celestial Hammer. Starbreaker и Solar Guardian нельзя применить, пока молот отсутствует из-за Celestial Hammer.",
        "Starbreaker и Solar Guardian нельзя применить, пока молот отсутствует из-за Celestial Hammer.",
        "Молот движется со скоростью в 1500 единиц до достижения указанной точки или максимального расстояния за 0,67\/0,73\/0,8\/0,87 (TagTalent 1,4\/1,47\/1,53\/1,6) сек. При возвращении молот движется со скоростью в 1500 или пока не достигнет Dawnbreaker за 1,5 секунды, в зависимости от того, что произойдет раньше.",
        "При возвращении молот движется со скоростью в 1500 или пока не достигнет Dawnbreaker за 1,5 секунды, в зависимости от того, что произойдет раньше.",
        "По достижении точки назначения молот даёт летающий обзор в радиусе 150, который длится 1 секунду.",
        "В полёте молот уничтожает деревья вокруг себя на расстоянии в 150 единиц.",
        "В полёте молот поражает каждого врага, подошедшего на расстояние в 150. Если враг подойдёт к молоту на расстояние в 150 единиц, все враги на расстоянии в 250 получат урон. Пока молот летит к точке назначения, каждый враг может получить урон лишь один раз, и ещё один раз по возвращении. То есть молот может нанести каждому врагу 120\/180\/240\/300 урона при столкновении.",
        "Если враг подойдёт к молоту на расстояние в 150 единиц, все враги на расстоянии в 250 получат урон.",
        "Пока молот летит к точке назначения, каждый враг может получить урон лишь один раз, и ещё один раз по возвращении.",
        "То есть молот может нанести каждому врагу 120\/180\/240\/300 урона при столкновении.",
        "Молот возвращается только при наличии модификатора у заклинателя. При потере модификатора от смерти, молот исчезнет после остановки, вместо того чтобы вернуться.",
        "При потере модификатора от смерти, молот исчезнет после остановки, вместо того чтобы вернуться.",
        "Огненный след создаётся на пути возвращения молота. Он остаётся 2,5 сек. от момента создания. Это значит что огонь созданный в начальной точке исчезнет раньше чем огонь созданный в конечной точке. Огонь даёт ауру, которая применяет дебафф огненного следа на врагов в радиусе 150. Дебафф ауры задерживается на 0,5 сек. Дебафф наносит 10\/15\/20\/25 урона интервалами в 0,5 сек., начиная мгновенно при применении. В итоге выходит до 7 возможных попаданий и они могут нанести до 60\/90\/120\/150 урона в области за всё время действия.",
        "Это значит что огонь созданный в начальной точке исчезнет раньше чем огонь созданный в конечной точке.",
        "Огонь даёт ауру, которая применяет дебафф огненного следа на врагов в радиусе 150. Дебафф ауры задерживается на 0,5 сек.",
        "Дебафф наносит 10\/15\/20\/25 урона интервалами в 0,5 сек., начиная мгновенно при применении.",
        "В итоге выходит до 7 возможных попаданий и они могут нанести до 60\/90\/120\/150 урона в области за всё время действия.",
        "При использовании Converge и молот и Dawnbreaker создают огненный след позади себя."
      ],
      "mana": "110\/120\/130\/140",
      "item_behaviour": [],
      "name": "Celestial Hammer",
      "cooldown": "18\/16\/14\/12",
      "description": "Герой бросает свой молот в цель, нанося урон всем врагам на пути. Молот застывает на месте на 2 сек., а затем возвращается, оставляя за собой замедляющий огненный след. Герой может воззвать к своему молоту и раньше, чтобы полететь ему навстречу и встретиться посередине.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,25+0,77",
        "Дальность применения: Глобальная",
        "Максимальное расстояние: 1000\/1100\/1200\/1300 (TagTalent 2100\/2200\/2300\/2400)",
        "Радиус поиска молота: 150",
        "Радиус урона от молота: 250",
        "Урон при столкновении: 60\/90\/120\/150",
        "Длительность остановки молота: 2",
        "Радиус огненного следа: 150",
        "Урон в секунду от огненного следа: 20\/30\/40\/50",
        "Замедление скорости передвижения от огненного следа: 24%\/28%\/32%\/36% (TagTalent 39%\/43%\/47%\/51%)",
        "Длительность огненного следа: 2,5",
        "Длительность задержки дебаффа огненного следа: 0,5"
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f9\/Dawnbreaker_Converge.mp3\/revision\/latest?cb=20210410152219",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Заменяет Celestial Hammer пока не используется подспособность, к герою не вернется молот, или пока Dawnbreaker не умрёт.",
        "При применении прерывает произносимые способности Dawnbreaker.",
        "Уходит на перезарядку в 0,25 сек. сразу после применения Celestial Hammer. Это защищает от случайного двойного нажатия, досрочно завершающего действие способности.",
        "Перемещает Dawnbreaker со скоростью в 1500 единиц.",
        "Не может переместить Dawnbreaker больше чем на максимальное значение в 1000\/1100\/1200\/1300 (TagTalent 2100\/2200\/2300\/2400) единиц. Это значит что способность может перемещать Dawnbreaker до 1,5\/1,36\/1,25\/1,15 (TagTalent 0,71\/0,68\/0,65\/0,63) сек.",
        "Это значит что способность может перемещать Dawnbreaker до 1,5\/1,36\/1,25\/1,15 (TagTalent 0,71\/0,68\/0,65\/0,63) сек.",
        "Converge отменяется, если во время её действия Dawnbreaker получает дебаффы оглушения, урагана, провокации, страха или гипноза. Другие обезвреживания не отменят её.",
        "И молот, и Dawnbreaker создают огненный след позади себя."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Converge",
      "cooldown": "0,25",
      "description": "Герой взывает к своему молоту, и они летят навстречу друг другу, встречаясь посередине.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        ""
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Dawnbreaker_Luminosity_1.mp3\/revision\/latest?cb=20210410152220",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Каждая успешная атака по вражескому герою или крипу добавляет один стак к счётчику баффа. Luminosity даёт 1 заряд за один удар Starbreaker, не важно сколько врагов было поражено одним ударом. Бафф действует всегда, но прячется при отсутствии зарядов.",
        "Luminosity даёт 1 заряд за один удар Starbreaker, не важно сколько врагов было поражено одним ударом.",
        "Бафф действует всегда, но прячется при отсутствии зарядов.",
        "Не считает атаки по союзникам, вардам или строениям, а так же не применяет на них усиленную атаку.",
        "Как только счетчик достигнет 3, Dawnbreaker получит бафф атаки. Следующая атака с баффом активирует критический урон, вампиризм и лечение ближайших союзников. Ближайшие союзники излечиваются на процент от значения вампиризма, так что они получают 10,5%\/14%\/17,5%\/21% от урона атаки. Если цель атаки не-герой, значение вампиризма уменьшается до 15%\/20%\/25%\/30%. То есть для союзников лечение так же уменьшается до 5,25%\/7%\/8,75%\/10,5%. Считает крипов-героев за героев.",
        "Следующая атака с баффом активирует критический урон, вампиризм и лечение ближайших союзников.",
        "Ближайшие союзники излечиваются на процент от значения вампиризма, так что они получают 10,5%\/14%\/17,5%\/21% от урона атаки.",
        "Если цель атаки не-герой, значение вампиризма уменьшается до 15%\/20%\/25%\/30%.",
        "То есть для союзников лечение так же уменьшается до 5,25%\/7%\/8,75%\/10,5%.",
        "Считает крипов-героев за героев.",
        "И заряды, и бафф атаки не имеют длительности и сохраняются бесконечно. Но поскольку бафф атаки можно развеять, его может убрать враг или он исчезнет при смерти. При потере баффа атаки заряды так же обнуляются.",
        "Но поскольку бафф атаки можно развеять, его может убрать враг или он исчезнет при смерти.",
        "При потере баффа атаки заряды так же обнуляются.",
        "Усиленная атака сперва лечит Dawnbreaker, затем союзников, а потом наносит критический урон. Luminosity наносит гарантированный критический удар; критические удары с меньшим значением не учитываются при срабатывании, так как приоритет имеет наивысшее значение критического урона. Складывается с другими источниками вампиризма. Значение лечения для Dawnbreaker и её союзников считается вампиризмом и увеличивается усилением вампиризма, но только если эффект применен к Dawnbreaker.",
        "Luminosity наносит гарантированный критический удар; критические удары с меньшим значением не учитываются при срабатывании, так как приоритет имеет наивысшее значение критического урона.",
        "Складывается с другими источниками вампиризма.",
        "Значение лечения для Dawnbreaker и её союзников считается вампиризмом и увеличивается усилением вампиризма, но только если эффект применен к Dawnbreaker."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Luminosity",
      "cooldown": null,
      "description": "После 3 атак герой преисполняется мощью, отчего его следующая атака наносит критический урон и излечивает всех союзных героев в радиусе 650 на 35% от урона. Лечение от атаки по крипу или нейтральному существу будет слабее.",
      "hot_key": "E",
      "params": [
        "Необходимо атак: 4 (TagTalent 3)",
        "Радиус лечения: 650",
        "Критический урон: 120%\/140%\/160%\/180% (TagTalent 160%\/180%\/200%\/220%)",
        "Вампиризм: 30%\/40%\/50%\/60%",
        "Процент лечения от урона: 35%",
        "Уменьшение лечения при атаке по крипу: 50%",
        "Предотвращает получение стаков. При наличии 3 стаков не предотвращает критический удар следующей атаки и обнуляет стаки, но предотвращает лечение."
      ],
      "legacy_key": "L",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/62\/Dawnbreaker_Solar_Guardian_1.mp3\/revision\/latest?cb=20210410152224",
      "effects": [
        "Способность Направленная на область \/ Произносимая",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Solar Guardian нельзя применять при активированной Starbreaker, отсутствующем из-за Celestial Hammer молоте или его возвращении при использовании подспособности Converge.",
        "↓↓ Двойное нажатие автоматически выберет текущую позицию курсора. Способность нельзя нацелить через мини-карту. Применение на портрет автоматически нацелит способность на текущее местоположение Dawnbreaker.",
        "Способность нельзя нацелить через мини-карту. Применение на портрет автоматически нацелит способность на текущее местоположение Dawnbreaker.",
        "При прицеливании автоматически ищет ближайшую подходящую цель для телепортации на расстояние в 1400 единиц от указанной точки. Подходящими целями являются все союзные герои, включая иллюзии, клонов и крипов-героев. Если на расстоянии нет подходящей цели, появится сообщение об ошибке и способность не применится.",
        "Подходящими целями являются все союзные герои, включая иллюзии, клонов и крипов-героев.",
        "Если на расстоянии нет подходящей цели, появится сообщение об ошибке и способность не применится.",
        "После прицеливания точка назначения остаётся неизменной. Она не следует за целью.",
        "Во время произнесения и времени полёта, Dawnbreaker не может выполнять никакие действия. То есть игрок не может вручную отменить произнесение. Произнесение можно отменить обезвреживаниями, примененными другими существами. Как только завершится произнесение и начнётся полёт, Dawnbreaker становится невосприимчивой к заклинаниям и полёт нельзя прервать большинством способностей. Chronosphere и Dismember полностью отменяют Solar Guardian. К тому же применение принудительного движения на Dawnbreaker во время скачка отменит телепортацию в точку назначения. В этом случае она упадёт вниз туда, куда приведет принудительное движение, применяя в это место урон и оглушение от приземления.",
        "Произнесение можно отменить обезвреживаниями, примененными другими существами.",
        "Как только завершится произнесение и начнётся полёт, Dawnbreaker становится невосприимчивой к заклинаниям и полёт нельзя прервать большинством способностей.",
        "Chronosphere и Dismember полностью отменяют Solar Guardian.",
        "К тому же применение принудительного движения на Dawnbreaker во время скачка отменит телепортацию в точку назначения.",
        "В этом случае она упадёт вниз туда, куда приведет принудительное движение, применяя в это место урон и оглушение от приземления.",
        "Полёт начинается по окончанию произнесения. В первой половине Dawnbreaker летит вверх в небо. По достижению половины времени она телепортируется в точку назначения, а затем за оставшееся время спускается с неба.",
        "По достижению половины времени она телепортируется в точку назначения, а затем за оставшееся время спускается с неба.",
        "Во время произнесения и длительности полёта в указанной точке создаётся пульсация. Пульсация лечит союзников и наносит урон врагам в области. В выбранной местности создаются визуальные эффекты и звуки, которые видны и слышны всем. Пульсации лечения и урона происходят интервалами в 0,5 секунды, начиная мгновенно после начала произнесения, в конечном счете выходит 6 пульсаций. Лечение не действует на саму Dawnbreaker, но действует на её подконтрольных существ. Может излечить союзникам до 270\/420\/570 здоровья. Значение лечения подвергается манипуляции лечением.",
        "В выбранной местности создаются визуальные эффекты и звуки, которые видны и слышны всем.",
        "Пульсации лечения и урона происходят интервалами в 0,5 секунды, начиная мгновенно после начала произнесения, в конечном счете выходит 6 пульсаций.",
        "Лечение не действует на саму Dawnbreaker, но действует на её подконтрольных существ.",
        "Может излечить союзникам до 270\/420\/570 здоровья. Значение лечения подвергается манипуляции лечением.",
        "Значение лечения подвергается манипуляции лечением.",
        "В конце длительности полёта враги в радиусе 500 от Dawnbreaker оглушаются и получают урон от приземления. В конечном счете наносит до 310\/460\/610 урона, учитывая урон от приземления и все пульсации.",
        "В конечном счете наносит до 310\/460\/610 урона, учитывая урон от приземления и все пульсации.",
        "Приземление сперва наносит урон, потом — оглушение."
      ],
      "mana": "150\/200\/250",
      "item_behaviour": [],
      "name": "Solar Guardian",
      "cooldown": "120\/110\/100 (TagTalent 100\/90\/80)",
      "description": "Герой создаёт пульсирующий эффект в радиусе 500 от любого союзного героя. Каждая пульсация наносит урон врагам и излечивает союзников. После небольшой задержки герой летит в указанную область, при приземлении нанося врагам дополнительный урон и оглушая их. Начав применение этой способности, её нельзя прервать.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: Глобальная",
        "Максимальное расстояние поиска: 1400",
        "Максимальное расстояние прицеливания: 350",
        "Длительность произнесения: 1,7",
        "Радиус эффекта: 500 (TagTalent 650)",
        "Урон за пульсацию: 30\/50\/70",
        "Лечение за пульсацию: 45\/70\/95",
        "Урон от приземления: 130\/160\/190",
        "Длительность полёта: 0,8",
        "Длительность оглушения от приземления: 1,5\/1,75\/2",
        "Не действует на врагов с иммунитетом к заклинаниям. Полностью действует на союзников с иммунитетом к заклинаниям."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.6,
    "attrStrength": 26.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 1.7,
    "attrAgility": 14.0
  },
  "description": "Dawnbreaker, или Валора — это герой с ближним типом атаки, основным атрибутом которой является сила. Валора проявляет себя в гуще боя, с радостью круша врагов своим небесным молотом и излечивая союзников вокруг. Она охотно швырнёт свой молот в противников, чтобы воссоединиться с ним в пламенном полёте, и всегда готова обратиться к своей истинной космической мощи, чтобы прилететь на помощь союзникам, где бы они ни были, и разгромить неприятеля.",
  "history": "Спустя века после того, как исход Хранителя ознаменовал эпоху света, некоторые из наследников первого солнца начали объединяться в борьбе с хаосом, что преследовал создателя их предка. Назвавшись Детьми Сияния, они сочли себя достойными взять дело Хранителя в свои руки и стали сдерживать натиск тьмы, избавляя космос от порождений первородной ночи в блистательных походах своих армий. Валора, самая почтенная воительница среди древних творений Детей, была вестницей великих порядка и сияния. Созданная из сердца молодой металлической звезды и одарённая золотым дыханием новой жизни, Валора разносила зарево мудрости Детей в темнейшие уголки вселенной — распаляя небосвод каждым взмахом своего молота в бесконечной битве с хаосом. Со временем Дети открыли Валоре и другое её предназначение. Они узнали, как могут пронзить своим внутренним сиянием весь космос — дабы навеки изничтожить все проявления тьмы, — и отправили Валору за источником великой силы, последней части их великого плана. Но впервые Валора и её молот познали неудачу, и вместе со своими повелителями она заплатила сполна. Искра Детей Сияния совершенно затухла, и Валора осталась парить в чёрной глади, потерянная на бессчётные тысячелетия, пока не обрушилась на незнакомую ей планету. Там она погрузилась в сон и покоилась до тех пор, пока присутствие блуждающей молодой звезды не разожгло древнюю кузницу энергии — реликвию Детей, которая, как и сама Валора, долгие годы была погребена под жгучей красной массой. Вернув лишь малую долю своих сил, она пробудилась в землях, охваченных войной и неумолимым хаосом. Пусть её богов уже нет, но с крепостью её молота сравнится лишь её воля нести его в справедливый бой во имя добра и сияния.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1100 к дальности применения Celestial Hammer",
      "talentRight": "2 заряда Starbreaker"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−1 атака для срабатывания Luminosity",
      "talentRight": "+150 к радиусу Solar Guardian"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−20 сек. перезарядки Solar Guardian",
      "talentRight": "+40% к критическому урону от Luminosity"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15% к замедлению от Celestial Hammer",
      "talentRight": "+30 к доп. урону от взмахов у Starbreaker"
    }
  ]
}