{"abilities":[{"spell":"Throws down a smoke bomb, silencing enemies, and causing them to miss most attacks, as well as slowing movement and reducing their vision.","effects":["Ability Target Area","Affects Enemies"],"notes":["Silence, slow, blind and vision reduction are all provided by an aura. Its debuff lingers for 0.5 seconds.","Reduces affected enemy units' vision to 200.","Although the debuff lingers, it does nothing when the target turns invulnerable.","Smoke Screen's blind uses pseudo-random distribution."],"mana":"90","elements":["Does not pierce spell immunity."],"cooldown":"17\/15\/13\/11 ( 9\/7\/5\/3)","name":"Smoke Screen","description":["Cast Animation: 0.2+0","Cast Range: 550","Effect Radius: 325","Move Speed Slow: 8%\/12%\/16%\/20%","Miss Chance: 10%\/30%\/50%\/70%","Aura Linger Duration: 0.5","Duration: 6"],"hot_key":"Q","legacy_key":"C"},{"spell":"Teleports behind the target unit, striking for bonus damage if it is an enemy.","effects":["Ability Target Unit","Affects Self \/ Enemies","Damage Magical"],"notes":["The bonus damage is independent from Riki's attack damage and is instantly dealt to the target.","Always teleports Riki behind the target.","Does not disjoint projectiles upon teleporting.","When targeting an enemy, Riki receives the Blinkstrike buff. This buff makes his next attack apply an ensured backstab hit with Cloak and Dagger, regardless of angle. This means when the target manages to turn around before Riki's attack hits, it still applies the backstab. The buff lasts for 1 attack, or for up to 1 second, whichever happens first. The buff is used up upon starting an attack, not upon landing it, so canceling or missing the attack wastes it. The 1 second duration allows Riki to use the ensured backstab against other units than the Blink Strike target if quick enough.","Riki is ordered to attack the target if it is an enemy.","Can be cast on allies without damaging them.","Cannot be cast on couriers."],"mana":"50","elements":["Cannot be cast while rooted or leashed.","Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"10\/8\/6\/4","name":"Blink Strike","description":["Cast Animation: 0.3+0","Cast Range: 600\/700\/800\/900 ( 1200\/1300\/1400\/1500)","Damage: 75\/90\/105\/120"],"hot_key":"W","legacy_key":"B"},{"spell":"Riki fades into the shadows, becoming invisible and gaining bonus health regeneration. Every time Riki strikes his enemy from behind, he deals bonus damage based on his Agility. When Riki attacks, he becomes visible.","effects":["Ability Passive","Affects Self \/ Enemies","Damage Physical"],"notes":["The health regeneration is independent from the invisibility, and is always present.","Can regenerate up to 120\/180\/240\/300 health in one minute.","Riki does not automatically attack enemies while invisible.","When respawning or reincarnating, Riki starts off invisible and does not need to go through the fade delay.","Casting spells or using items does not break the invisibility. When the talent is chosen, attacks do not break the invisibility either, so that only True Sight can reveal him.","The ability icon shows a cooldown whenever the invisibility is broken. However, this has only informative purposes. This means that using Refresher Orb does not refresh it. This also means it is not affected by the Cooldown Reduction of Octarine Core and Arcane Rune. Time Dilation and Chakra Magic affect the cooldown visually, but do not affect the fade delay in any way.","Backstab damage is applied when attacking and denying allies.","The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, and is considered by crit or cleave. It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.","The sound effect plays at the start of the attack, but the damage is applied on hit."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Cloak and Dagger","description":["Fade Delay: 6\/5\/4\/3","Back Angle: 105°","Backstab Damage per Agility: 0.4\/0.6\/0.8\/1 ( 0.7\/0.9\/1.1\/1.3)","Health Regen Bonus: 2\/3\/4\/5"],"hot_key":"E","legacy_key":"K"},{"spell":"Riki phases out of the world while striking random enemy heroes from behind in an area around him.","effects":["Ability No Target ( Target Unit) \/ Channeled","Affects Self \/ Enemy Heroes","Damage Instant Attack"],"notes":["Tricks of the Trade disjoints projectiles upon cast.","Certain items which do not cancel channeling spells (e.g. Shadow Blade or Shiva's Guard) do cancel Tricks of the Trade.","Riki is invulnerable and hidden during Tricks of the Trade, turning him to an invalid target for every spell.","Riki is phased during Tricks of the Trade, so that other units can pass through.","Causes Riki to perform instant attacks on a random enemy unit within range on each interval, starting immediately on cast. The instant attacks can proc any attack modifier or any on-hit effect like regular attacks. If Riki is blinded, the attacks can miss, unless he has True Strike. They can also miss to evasion. The instant attacks completely ignore disarms, so Riki still attacks normally during Tricks of the Trade. The instant attacks do not break Cloak and Dagger's invisibility, although it visually goes on cooldown. The instant attacks of Tricks of the Trade do not break Smoke of Deceit's invisibility. The instant attacks completely ignore attack immune enemies.","The instant attacks always trigger a backstab from Cloak and Dagger, based on its current level. On each instant attack, Riki's facing angle is changed to match the target's direction, which causes the backstab to apply. This means once Tricks of the Trade ends, Riki's facing angle is not the same as it was upon cast, but matches the last target's angle.","Can perform up to 7\/9\/11 ( 14\/17\/21) instant attacks over the full duration.","The attacks prioritize heroes over creeps. Treats creep-heroes and illusions as creeps.","Does not affect invisible units, but does affect units inside the Fog of War.","The visual effects indicating Tricks of the Trade's attack radius are visible to both allies and enemies.","The radius is always centered on Riki and follows him even when he gets moved (e.g. Glimpse). However, the radius indicating visual effects on the ground do not follow Riki, and stay at the cast location.","When upgraded with Aghanim's Scepter, Riki can target an allied hero with Tricks of the Trade. Riki and all of the spell's effects then follow the allied hero. He still remains hidden. Does not end when the target dies. The ability continues at its corpse's location. It is still bound to the ally, so when it resurrects, it follows it still. Cannot target creep-heroes. Can target illusions."],"mana":"75","elements":["Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"50\/45\/40","name":"Tricks of the Trade","description":["Cast Animation: 0.3+0","Cast Range: 0 ( 1000)","Max Channel Time: 4\/4.5\/5 ( 8\/9\/10)","Radius: 450 ( 750)","Attack Interval: 0.6\/0.55\/0.5"],"hot_key":"R","legacy_key":"E"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies"],"notes":["Increases attack damage by an average of 10%.","The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority.","Critical Strike uses pseudo-random distribution.","Does not work against wards, buildings, and allied units."],"mana":"0","elements":["Can be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Critical Strike","description":["Proc Chance: 20%","Critical Damage: 150%"]}],"bio":"Riki was born middle child to the great dynasty of Tahlin. With an older brother groomed for the throne, and a younger brother coddled and kept, Riki, the small middle son, seemed born for the art of invisibility. It was an art he cultivated, and one which ultimately saved his life on the night that his people were betrayed and his family slaughtered. Of all the royal line, he alone escaped—small and agile, unassuming, using smoke as cover. He cut his way out of the royal grounds, using the advantage of surprise, quietly slitting the throats of one enemy warrior after another. Now free of his royal responsibilities, Riki uses his talents in service to a new trade: Stealth Assassin. He silences his enemies, sharpening his skills, hoping to one day take revenge on those who killed his family and robbed him of his birthright.","talentsTips":["The agility talent effectively grants Riki 1.28 armor, 8 attack speed, 0.4% movement speed and 8 attack damage."],"trivia":["In DotA, Riki was named \"Rikimaru\", a reference to one of the main characters in the Tenchu video game series.","Riki's fun\/alternate name was Riki Martin, which is a pun on Ricky Martin, a famous Latino pop singer.","Riki's line upon dying, \"Good assassins never die… they just fade away.'\", is a reference to a quote by General Douglas MacArthur, \"Old soldiers never die; they just fade away.\"","Riki's line \"There are none so stabbed as those who will not see.\" is a reference to a proverb: \"There are none so blind as those who will not see.\"","Riki's line \"I speak softly, but carry a sharp knife.\" is a reference to the West African Proverb \"Speak softly and carry a big stick.\", popularized by U.S. president Theodore Roosevelt."],"talents":["Cloak and Dagger Doesn't Reveal:+300 Tricks of the Trade AoE","+600 Blink Strike Cast Range:+0.3 Backstab Multiplier","-8s Smoke Screen Cooldown:+20% Critical Strike (1.5x)","+8 Agility:+6 Health Regen"],"desc":"Riki, the Stealth Assassin, is a melee agility hero that uses stealth in order to surprise enemies and quickly kill them. His trademark ability, Cloak and Dagger, lets him sneak up on his enemies from behind and deal massive backstab damage, and then quickly escape. This enables him to close in on the enemy and drop his devastating Smoke Screen, which cripples fighters and spellcasters alike. Blink Strike allows Riki to chase with impunity, while Tricks of the Trade makes quick work of his enemies during teamfights."}