{"abilities":[{"spell":"Бросает дымовую бомбу, которая замедляет передвижение врагов, а также не позволяет им применять способности и заставляет их промахиваться почти всеми атаками.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Безмолвие, замедление, ослепление и снижение обзора предоставляются в виде ауры. Дебафф задерживается на 0,5 секунды.","Снижает обзор затронутых вражеских юнитов до 200 единиц.","Несмотря на то, что дебафф задерживается на юнитах, его эффекты не будут действовать на неуязвимые цели."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"17\/15\/13\/11 ( 10\/8\/6\/4)","name":"Smoke Screen","description":["Анимация применения: 0,2+0","Дальность применения: 550","Радиус: 325","Замедление скорости передвижения: 8%\/12%\/16%\/20%","Шанс промаха: 10%\/30%\/50%\/70%","Длительность задержки ауры: 0,5","Длительность: 6"],"hot_key":"Q","legacy_key":"C"},{"spell":"Герой телепортируется за спину цели и, если это враг, наносит ему урон.","effects":["Способность Направленная на юнита","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Дополнительный урон наносится отдельно от атаки Riki и мгновенно наносится цели.","Всегда телепортирует Riki за спину цели.","При выборе врага Riki получает бафф Blinkstrike. Этот бафф применяет к его следующей атаке гарантированный урон со спины от Cloak and Dagger независимо от угла, под которым Riki находится к врагу. То есть когда цель начнет разворачиваться до поражения атакой Riki, к атаке все равно применится урон со спины. Бафф длится до совершения атаки или 1 секунду, в зависимости от того, что произойдет раньше. Бафф используется при начале атаки, а не при попадании её по цели, поэтому отмена или промах атаки бафф потратит. Длительность в 1 секунду позволяет Riki использовать повторно гарантированную атаку со спины по другим юнитам, а не по цели Blink Strike, если та была достаточно быстра.","Riki получает приказ атаковать цель, если целью был противник.","Эту способность можно использовать на союзниках — они не получат никакого урона.","Нельзя использовать на курьеров."],"mana":"50","elements":["Нельзя применять в оцепенении.","Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"10\/8\/6\/4","name":"Blink Strike","description":["Анимация применения: 0,3+0","Дальность применения: 500\/600\/700\/800 ( 1200\/1300\/1400\/1500)","Урон: 75\/90\/105\/120"],"hot_key":"W","legacy_key":"B"},{"spell":"Герой уходит в тень, становясь невидимым. Каждая его атака со спины наносит дополнительный урон, который зависит от ловкости. Если атаковать врага, невидимость пропадёт.","effects":["Способность Пассивная","Действует на Себя \/ Врагов","Урон Физический"],"notes":["В невидимости Riki не атакует автоматически врагов.","После возрождения Riki мгновенно становится невидимым, поэтому он никому не виден после использования Aegis of the Immortal.","Использование способностей и предметов не прерывает невидимость. При выборе таланта атаки также не прерывают невидимость, поэтому только эффект True Sight может его обнаружить.","Иконка способности показывает время перезарядки всякий раз, когда герой выходит из невидимости. Но у него только информационное значение. То есть использование Refresher Orb не обновит способность. Также на отсчет не влияет снижение времени перезарядки от Octarine Core и Руна волшебства. Time Dilation и Chakra Magic визуально действуют на перезарядку, но не влияют на время до невидимости.","Урон со спины применяется при атаке и добивании союзников.","Спиной юнита считается зона в 105 градусов вокруг спины.","Riki может получать лечение от вампиризма от урона, наносимого Cloak and Dagger. На урон также действует критический и прорубающий удар.","Урон может быть снижен Enfeeble или Static Link. При этом его нельзя увеличить с помощью Empower или Руна двойного урона.","Звуковой эффект способности проигрывается до начала атаки, но урон применяется после попадания."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Cloak and Dagger","description":["Время до невидимости: 7.5\/6\/4,5\/3","Множитель урона ловкости: 0.4\/0.6\/0.8\/1 ( 0.6\/0.8\/1\/1.2)"],"hot_key":"E","legacy_key":"K"},{"spell":"Герой пропадает из нашего мира, каждую секунду атакуя со спины всех противников в радиусе 450 ед. вокруг себя.","effects":["Способность Ненаправленная ( Направленная на юнита) \/ Произносимая","Действует на Себя \/ Вражеских героев"],"notes":["Tricks of the Trade при использовании позволяет избегать снаряды.","Некоторые предметы, которые не прерывают произносимые способности (к примеру, Shadow Blade или Shiva's Guard), отменяют действие Tricks of the Trade.","Riki неуязвим и спрятан, пока действует Tricks of the Trade, делая его недоступным для выбора в качестве цели для любой способности.","Пока действует способность, остальные юниты могут проходить сквозь Riki.","Заставляет Riki совершать мгновенную атаку по случайному герою в радиусе действия раз в 0.6\/0.55\/0.5 секунды сразу после использования. На мгновенные атаки могут сработать любые модификаторы атаки или эффекты, срабатывающие при атаке (как и на обычные атаки). Если Riki ослеплен, атаки могут промахнутся, кроме случая, когда у него есть эффект точности. Также удары могут промахнутся из-за уклонения. Мгновенные атаки полностью игнорируют обезоруживание, поэтому Riki может продолжить атаковать, пока действует Tricks of the Trade. Мгновенные атаки не выводят из невидимости от Cloak and Dagger, хоть визуально способность уходит на перезарядку. Мгновенные атаки Tricks of the Trade не выводят из невидимости от Smoke of Deceit.","На мгновенные атаки всегда срабатывает удар со спины от Cloak and Dagger текущего уровня.","Способность будет действовать на крипов, если в области действия нет героев.","Не задевает невидимых юнитов, но поражает юнитов в тумане войны.","Визуальные эффекты, отмечающие радиус атаки Tricks of the Trade, виден как союзникам, так и врагам.","Радиус всегда закреплен за Riki и следует за ним, даже если его передвинут (к примеру, с помощью Glimpse). При этом круг на земле, отмеченный визуальными эффектами, не следует за Riki и остается на месте применения.","При улучшении Aghanim's Scepter Riki может выбрать союзного героя, чтобы закрепить за ним Tricks of the Trade. Riki и все эффекты способности следуют за союзным героем. Сам Riki остается спрятанным. Не завершается при смерти цели. Способность продолжается в месте смерти союзника. Она остается связана с союзником, поэтому при его воскрешении способность вернется к нему. Нельзя выбрать в качестве цели крипов-героев, но можно выбрать иллюзии."],"mana":"75","elements":["Нельзя применять в оцепенении.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"50\/45\/40","name":"Tricks of the Trade","description":["Анимация применения: 0,3+0","Дальность применения: 0 ( 1000)","Макс. длительность: 4\/4.5\/5 ( 7\/8\/9)","Радиус: 450 ( 750)","Интервал между атаками: 0.6\/0.55\/0.5"],"hot_key":"R","legacy_key":"E"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["В среднем усиливает урон на 10%.","Шанс срабатывания сочетается с другими источниками критического урона. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","Критический удар использует псевдослучайное распределение.","Не работает на варды, строения и союзных юнитов."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Критический удар","description":["Шанс срабатывания: 20%","Критический урон: 150%"]}],"bio":"Он родился средним сыном в великой династии Талин. В то время, как его старшего брата готовили к трону, а младшего окружали удовольствиями и заботой, середнячок оказался прирожденным невидимкой. Всю свою жизнь он оттачивал это искусство, и именно оно спасло его в тот роковой день, когда его народ предали, а родных убили. Не выжил никто из царской семьи — кроме незаметной, ловкой и хитрой тени в клубах дыма. Внезапно нападая и бесшумно взрезая глотки врагов, сирота сбежал с монарших владений. Ныне свободный от престола, бесшумный убийца предоставляет иные услуги. Он оставляет врагов безмолвными навечно и оттачивает своё мастерство, надеясь когда-нибудь отомстить тем, кто убил его семью и лишил его прав наследника.","talentsTips":["Талант на ловкость в общем даёт Riki: 1,6 брони, 10 скорости атаки, 0,5% скорости передвижения и 8 урона от атаки."],"trivia":["В DotA, Riki зовут \"Rikimaru\" (Рикимару); Rikimaru имя главного персонажа в игре Tenchu.","Альтернативное имя Riki в DotA было Riki Martin являющееся отсылкой к Рики Мартину (Ricky Martin), популярному поп-певцу.","Одна из фраз Riki: \"Играть Cloak and Daggered\" является отсылкой к выражению \"Рыцари Плаща и Кинжала\", которым называют шпионов и воров. Отсылкой к этому же выражению являются часы невидимости «Cloak and Dagger» (Плащ и Кинжал), которые использует Шпион из Team Fortress 2.","Riki's line upon dying, \"ИгратьGood assassins never die…they just fade away.\" is a reference to the General Douglas MacArthur quote, \"Old soldiers never die; they just fade away.\"","Riki's line, \"There are none so stabbed as those who will not see\" is a reference to \"A christmas Carol\" where a blind woman says, \"I am not so blind as those who will not see\".","Riki has the highest base stat of any hero.","In the early versions of DoTA, Witch Doctor's Death Ward was actually Riki's ultimate ability which did not require any channeling and allowed him to place the ward anywhere to attack enemies. Riki's skill set also included a regular blink ability and a critical strike instead of the current Backstab and Blink Strike."],"talents":["Невидимость от Cloak and Dagger не спадает.:+300 к радиусу у Tricks of the Trade","+700 к дальности Blink Strike.:+0,2 урона за ловкость у Backstab.","-7 сек. перезарядки Smoke Screen.:Шанс в 20% нанести 150% урона","+8 к ловкости:+6 здоровья в секунду"],"tips":["Используйте Smoke Screen после Blink Strike - это затруднит врагам отступление.","Blink Strike можно применять как на врагов, так и на союзников. Прыжок на союзников может помочь Вам сбежать из боя.","Использование предметов не сможет прервать невидимость. Не бойтесь использовать в невидимости Magic Wand или любые другие предметы.","Ранняя покупка Orb of Venom даст Riki неплохое замедление при атаках, что поможет в ранних убийствах героев.","Способность Cloak and Dagger действует при атаке союзных целей, что облегчит добивание союзных крипов."],"desc":"Riki — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Smoke Screen, бросает дымовую бомбу, замедляя скорость передвижения вражеских юнитов в зоне охвата, не позволяя им колдовать и заставляя их промахиваться в большинстве случаев. Вторая способность, Blink Strike, Телепортируется за спину выбранного юнита и наносит дополнительный урон, если это вражеский юнит. Пассивная способность, Cloak and Dagger, Riki скрывается в тени, становясь невидимым. Если Riki атакует со спины, то он наносит дополнительный урон, зависящий от его текущей ловкости. Ультимативная способность, Tricks of the Trade, Riki пропадает из нашего мира, атакуя со спины всех противников в радиусе вокруг себя."}