{"abilities":[{"effects":["Radius: 1200","Health Restored: 275","Armor Bonus: 2","Duration: 15","Heal Stack Limit Duration: 65"],"notes":["Interrupts the user's channeling spells upon cast.","Affects every allied unit, including illusions, invulnerable units and hidden units, excluding wards and buildings.","Does not heal units that have been affected by Restore in the last 65 seconds, or by Guardian Greaves's Mend in the last 40 seconds. Still grants the armor to units that have been affected by Restore or Mend in that time. A status buff icon on affected units shows how much time is left for it to be able to get affected again. The status buff is affected by cooldown reductions.","Restore armor bonus does not stack with the armor gained from Buckler and Crimson Guard active abilities."],"elements":["Ability No Target","Affects Allies"],"name":"Restore","description":"Heals 275 health and gives +2 armor to allied units in a 1200 radius."},{"effects":["Radius: 1200","Health Regeneration Bonus: 4.5","Aura Linger Duration: 0.5"],"notes":["Stacks with all other sources of flat health regeneration, except with Mekansm Aura from multiple Mekansms.","Can regenerate up to 270 health in one minute.","Does not affect wards, buildings and invulnerable units.","The aura's buff lingers for 0.5 seconds."],"elements":["Ability Aura","Affects Allies"],"name":"Mekansm Aura","description":"Grants 4.5 health regeneration to allied units in a 1200 radius."}],"contains":["Headdress","Buckler","Recipe"],"cost":"2275","description":"A glowing jewel formed out of assorted parts that somehow fit together perfectly.","further":["Guardian_Greaves"],"tips":["If the player drops items which provides a large amount of health (e.g. Vanguard or Eye of Skadi), then uses Mekansm, and then picks up the dropped items again, the player will overall heal for more than 250 health. This is because upon dropping the health granting items, the player's maximum health drops while the current health percentage stays the same, but Mekansm still heals for the full amount. After picking up the items again, its maximum health raises, and its current health percentage stays the same."],"attrs":["Active Restore","Passive Mekansm Aura","Bonus +5 Strength +5 Agility +5 Intelligence +5 Armor","Disassemble? No","Alert allies? Yes"],"info":["For strength heroes, it grants 100 health, 0.5 health regen, 0.4% magic resistance, 5.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","For agility heroes, it grants 100 health, 0.5 health regen, 0.4% magic resistance, 5.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","For intelligence heroes, it grants 100 health, 0.5 health regen, 0.4% magic resistance, 5.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage."]}