{"abilities":[{"effects":["Радиус: 900","Восстановление здоровья: 275","Бонус к броне: 2","Длительность: 25","Время до повторной активации: 65"],"notes":["При использовании прерывает произносимые заклинания.","Действует на союзников, включая иллюзии, неуязвимых и невидимых юнитов, кроме вардов и строений.","Не лечит героев, на которых уже подействовал эффект Restore менее 65 секунд назад или Mend от Guardian Greaves менее 38 секунд назад. В этот период юнитам все равно будет даваться броня от Restore или Mend. В панели эффектов можно посмотреть время окончания бафа для его повторной активации.","Бонус к броне не суммируется с активными способностями Buckler и Crimson Guard."],"elements":["Способность Ненаправленная","Действует на Союзников"],"description":"Действует на союзников в радиусе 900. Восстанавливает 275 здоровья и даёт 2 брони."},{"effects":["Радиус: 900","Бонус регенерации здоровья: 3.5","Длительность задержки ауры: 0,5"],"notes":["Сочетается с другими источниками фиксированной регенерации здоровья, за исключением Mekansm Aura от нескольких Mekansm.","Восстанавливает до 210 здоровья в минуту.","Не действует на варды, строения и неуязвимых юнитов.","Аура регенерации задерживается на 0,5 секунд."],"elements":["Способность Аура","Действует на Союзников"],"description":"Увеличивает восстановление здоровья на 3.5 всем союзникам в радиусе 900."}],"contains":["Buckler","Headdress","Рецепт"],"cost":"1750","description":"Сияющий алмаз, собранный из разных частей, которые почему-то прекрасно объединяются.","further":["Guardian_Greaves"],"attrs":["Активируемая Restore","Пассивная Mekansm Aura","Бонус +5 к силе +5 к ловкости +5 к интеллекту +5 к броне","Можно разобрать? Нет","Можно сообщать? Да"],"info":["Для героев силы, даёт 100 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 5,8 брони, 5 скорости атаки, 0,25% скорости передвижения, 60 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки.","Для героев ловкости, даёт 100 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 5,8 брони, 5 скорости атаки, 0,25% скорости передвижения, 60 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки.","Для героев интеллекта, даёт 100 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 5,8 брони, 5 скорости атаки, 0,25% скорости передвижения, 60 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки."]}