{"abilities":[{"effects":["Радиус: 1200","Восстановление здоровья: 275","Время до повторной активации: 64"],"notes":["При использовании прерывает произносимые заклинания.","Действует на союзников, включая иллюзии, неуязвимых и невидимых существ, кроме вардов и строений.","Не лечит героев, на которых уже подействовал эффект Restore менее 64 секунд назад или Ошибка Lua в Модуль:Ability_icon на строке 32: attempt to call global 'cargoQuery' (a nil value). менее 39 секунд назад. В панели эффектов можно посмотреть время окончания баффа для его повторной активации."],"elements":["Способность Ненаправленная","Действует на Союзников"],"name":"Restore","description":"Действует на союзников в радиусе 1200. Восстанавливает 275 здоровья."},{"effects":["Радиус: 1200","Бонус регенерации здоровья: 2,5","Длительность задержки ауры: 0,5"],"notes":["Сочетается с другими источниками фиксированной регенерации здоровья, за исключением Mekansm Aura от нескольких Mekansm.","Восстанавливает до 150 здоровья в минуту.","Не действует на варды, строения и неуязвимых юнитов.","Аура регенерации задерживается на 0,5 секунды."],"elements":["Способность Аура","Действует на Союзников"],"name":"Mekansm Aura","description":"Увеличивает восстановление здоровья на 2,5 всем союзникам в радиусе 1200."}],"contains":["Headdress","Chainmail","Рецепт"],"cost":"1950","description":"Сияющий алмаз, собранный из разных частей, которые почему-то прекрасно объединяются.","further":["Guardian_Greaves"],"attrs":["Активная Restore","Пассивная Mekansm Aura","Бонус +4 к силе +4 к ловкости +4 к интеллекту +6 к броне","Можно разобрать? Нет","Можно сообщать? Да"],"info":["Для героев силы, даёт 80 здоровья, 0,4 регенерации здоровья, 0,32% сопротивления магии, 6,64 брони, 4 скорости атаки, 0,2% скорости передвижения, 48 маны, 0,2 регенерации маны, 0,28% урона от способностей и 4 урона от атаки.","Для героев ловкости, даёт 80 здоровья, 0,4 регенерации здоровья, 0,32% сопротивления магии, 6,64 брони, 4 скорости атаки, 0,2% скорости передвижения, 48 маны, 0,2 регенерации маны, 0,28% урона от способностей и 4 урона от атаки.","Для героев интеллекта, даёт 80 здоровья, 0,4 регенерации здоровья, 0,32% сопротивления магии, 6,64 брони, 4 скорости атаки, 0,2% скорости передвижения, 48 маны, 0,2 регенерации маны, 0,28% урона от способностей и 4 урона от атаки."]}