{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям.",
        "Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.",
        "Талант вампиризма заклинаний лечит на 2% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,5 силы за заряд Flesh Heap",
          "talentRight": "Урон и лечение от Dismember умножаются на 1,8"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-4 сек. перезарядки Meat Hook",
          "talentRight": "+0,8 сек. действия Dismember"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-16% к скорости врагов от Rot",
          "talentRight": "+10% к вампиризму заклинаниями"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+30 к урону от Rot",
          "talentRight": "+4 к броне"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/62\/Pudge_Meat_Hook_1.mp3\/revision\/latest?cb=20191216022014",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Союзников",
        "Урон Чистый"
      ],
      "notes": [
        "Крюк летит со скоростью 1450, достигая максимального расстояния за 0,9 сек.",
        "При применении Pudge получает бафф Followthrough, обезвреживающий героя. Длительность модификатора равна времени, необходимому для преодоления крюком 66% максимального расстояния. То есть при стандартном максимальном расстоянии в 1300 модификатор самообезвреживания длится 0,59 секунды. Длительность рассчитывается от максимального расстояния (включая бонусы к дальности) и не учитывает фактически преодаленное расстояние. То есть при захвате существа перед Pudge самообезвреживание будет действовать на свое полное значение.",
        "Длительность модификатора равна времени, необходимому для преодоления крюком 66% максимального расстояния.",
        "То есть при стандартном максимальном расстоянии в 1300 модификатор самообезвреживания длится 0,59 секунды.",
        "Длительность рассчитывается от максимального расстояния (включая бонусы к дальности) и не учитывает фактически преодаленное расстояние.",
        "То есть при захвате существа перед Pudge самообезвреживание будет действовать на свое полное значение.",
        "Крюк цепляет существ на расстоянии до 1400 единиц (складывается из макс. расстояния и радиуса захвата).",
        "Центром радиуса захвата является верхушка крюка. Приближение к остальным частям крюка никакого эффекта не даст.",
        "Действует на существ только при запуске, но не при втягивании. Действует на невидимых существ.",
        "Не может зацепить древних крипов, спрятанных или неуязвимых существ.",
        "Крюк проходит сквозь непроходимую территорию и деревья и может протаскивать через них существ.",
        "Зацепленные враги обезвреживаются на всю длительность притягивания. Союзники не обезвреживаются. Во время притягивания они могут свободно действовать.",
        "Союзники не обезвреживаются. Во время притягивания они могут свободно действовать.",
        "При захвате существа крюк в этой области дает летающий обзор в радиусе 500 единиц на 4 секунды.",
        "Pudge может притягивать руны. При попадании затраченная маны восполняется."
      ],
      "mana": "125\/130\/135\/140",
      "hotKey": "Q",
      "cooldown": "21\/18\/15\/12 (TagTalent 17\/14\/11\/8)",
      "description": "Бросает окровавленный крюк в указанную цель или в выбранном направлении. Крюк зацепится за первое существо, в которое попадёт, притащит его к герою и нанесёт урон, если целью оказался враг.",
      "spellName": "Meat Hook",
      "params": [
        "Анимация применения: 0,3+0,59",
        "Дальность применения: 1300",
        "Макс. расстояние: 1300",
        "Радиус захвата: 100",
        "Урон: 150\/220\/290\/360",
        "Может зацепить и притянуть союзников с иммунитетом к заклинаниям. Может нанести урон и притянуть врагов с иммунитетом. Не обезвреживает врагов с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Крюк мясника — это воплощение кошмара: его изогнутое лезвие всем своим видом требует крови."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Pudge_Rot.mp3\/revision\/latest?cb=20191216022017",
      "effects": [
        "Способность Переключаемая \/ Аура",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "При переключении Rot не прерывает произносимые заклинания Pudge.",
        "Урон по себе не смертелен, поэтому им нельзя добить себя.",
        "Урон по области и урон по себе не связаны друг с другом, поэтому при блокировке урона по себе урон по области все равно применяется.",
        "Замедление и урон представлены в виде ауры. Дебафф ауры задерживается на 0,5 секунды. Когда враги покидают область, то оставшийся дебафф продолжает замедлять и наносить урон до завершения. Когда Rot отключается, то дебафф продолжает замедлять, но больше не наносит урон.",
        "Когда враги покидают область, то оставшийся дебафф продолжает замедлять и наносить урон до завершения.",
        "Когда Rot отключается, то дебафф продолжает замедлять, но больше не наносит урон.",
        "Наносит 6\/12\/18\/24 (TagTalent 12\/18\/24\/30) урона с интервалом в 0,2 секунды. Интервал времени устанавливается при первом использовании Rot.",
        "Если герой обезмолвлен, оглушен или спрятан, то выключить активированную способность нельзя."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Ядовитое облако, которое замедляет врагов и наносит значительный урон как им, так и владельцу способности.",
      "spellName": "Rot",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 250",
        "Урон в секунду: 30\/60\/90\/120 (TagTalent 60\/90\/120\/150)",
        "Замедление скорости передвижения: 14%\/20%\/26%\/32% (TagTalent 30%\/36%\/42%\/48%)",
        "Длительность задержки ауры: 0,5",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Чувствуете удушающий запах гнили? Это ядовитый газ, что источает прелая пухнущая плоть мясника."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Сочетается по закону убывающей полезности с другими источниками сопротивления магии.",
        "Увеличивает общее сопротивление магии Pudge до 31%\/32,5%\/34%\/35,5%.",
        "Добитый вражеский герой так же дает заряд, если он был в пределах 450 от Pudge.",
        "Не получает заряд, если у погибшего было воскрешение, это была иллюзия или Tempest Double или же Pudge мертв в момент убийства. Дает только один заряд за клонов Meepo независимо от их числа.",
        "Дает только один заряд за клонов Meepo независимо от их числа.",
        "Для получения заряда вне стандартного радиуса Pudge должен сам добить врага. Убийство подконтрольными существами или иллюзиями не засчитывается.",
        "Каждый заряд дает 30\/40\/50\/60 здоровья, 0,15\/0,2\/0,25\/0,3 регенерации здоровья и 1,5\/2\/2,5\/3 урона. Талант увеличивает показатели до 60\/70\/80\/90 здоровья, 0,3\/0,35\/0,4\/0,45 регенерации здоровья и 3\/3,5\/4\/4,5 урона.",
        "Талант увеличивает показатели до 60\/70\/80\/90 здоровья, 0,3\/0,35\/0,4\/0,45 регенерации здоровья и 3\/3,5\/4\/4,5 урона.",
        "Число зарядов и силы можно увидеть на иконке баффа.",
        "При поднятии уровня Flesh Heap все заряды адаптируются к новым значениям.",
        "После получения заряда над головой героя появляется красная надпись \"+1\", информирующая о увеличении значения."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Увеличивает сопротивление магии, а также даёт дополнительную силу за каждого убитого или погибшего поблизости вражеского героя. Заряды накапливаются с начала игры, но герой получит силу только после изучения способности.",
      "spellName": "Flesh Heap",
      "params": [
        "Радиус от умершего врага: 450",
        "Радиус учета убийства: 1600",
        "Сопротивление магии: 8%\/10%\/12%\/14%",
        "Доп. сила за заряд: 1,5\/2\/2,5\/3 (TagTalent 3\/3,5\/4\/4,5)"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Мясник не понаслышке знает, каково это — быть толстокожим."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо \/ Произносимая",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Обезвреживает цель на всю длительность произнесения.",
        "Тащит цель к Pudge со скоростью 75. Дебафф притягивания исчезает как только цель оказывается в 125 единицах от Pudge.",
        "Дает эффект True Sight на цель, но только в случае, если цель не была невидима или не уходила в невидимость при применении.",
        "Если цель исчезла или стала неуязвимой, то произнесение прерывается.",
        "Наносит урон с интервалом в 0,5 секунды сразу после применения, нанося урон до 6 (TagTalent 7,6) (12 13,6 для не-героев) раз.",
        "Наносит до 180\/270\/360 + 90%\/180%\/270% урона (360\/540\/720 + 180%\/360%\/540% не-героям) от своей силы без выбранных талантов (до уменьшений). Наносит до 324\/486\/648 + 162%\/324%\/486% урона (648\/972\/1296 + 324%\/648%\/972% не-героям) от своей силы, если выбран талант на множитель урона. Наносит до 228\/342\/456 + 114%\/228%\/342% урона (408\/612\/816 + 204%\/408%\/612% не-героям) от своей силы, если выбран талант на увеличение длительности способности. Наносит до 410,4\/615,6\/820,8 + 205,2%\/410,4%\/615,6% урона (734,4\/1101,6\/1468,8 + 367,2%\/734,4%\/1101,6% не-героям) от своей силы, если выбраны оба таланта. При полном произнесении излечивает Pudge на те же значения.",
        "Наносит до 324\/486\/648 + 162%\/324%\/486% урона (648\/972\/1296 + 324%\/648%\/972% не-героям) от своей силы, если выбран талант на множитель урона.",
        "Наносит до 228\/342\/456 + 114%\/228%\/342% урона (408\/612\/816 + 204%\/408%\/612% не-героям) от своей силы, если выбран талант на увеличение длительности способности.",
        "Наносит до 410,4\/615,6\/820,8 + 205,2%\/410,4%\/615,6% урона (734,4\/1101,6\/1468,8 + 367,2%\/734,4%\/1101,6% не-героям) от своей силы, если выбраны оба таланта.",
        "При полном произнесении излечивает Pudge на те же значения.",
        "Урон и лечение не связаны друг с другом: способность всегда излечивает на полное значение за интервал вне зависимости от количества полученного урона целью.",
        "Считает крипов-героев за героев.",
        "Реплики Pudge при использовании Dismember слышны всем даже сквозь туман войны.",
        "С улучшением от Aghanim's Shard можно использовать на союзных героев, включая клонов и иллюзий, но исключая крипов-героев. При использовании применяет к цели сильное развеивание и позволяет избежать снаряды. Пока союзный герой поглощен, он неуязвим, спрятан и обладает иммунитетом к заклинаниям. Герой может сам выбраться из Pudge, отдав любой приказ через 3 секунды после поглощения.",
        "При использовании применяет к цели сильное развеивание и позволяет избежать снаряды.",
        "Пока союзный герой поглощен, он неуязвим, спрятан и обладает иммунитетом к заклинаниям.",
        "Герой может сам выбраться из Pudge, отдав любой приказ через 3 секунды после поглощения.",
        "Поглощение союзника дает Pudge способность Eject, позволяя выплюнуть его в любой момент. Способность игнорирует длительность запрета.",
        "Заклинатель может проглотить только одного героя. Проглатывание нового автоматически выплевывает старого.",
        "Во время Dismember союзный герой периодически перемещается к текущему положению носителя. То есть ауры союзника распространяются вокруг Pudge до выплевывания. Периодическое перемещение прерывается эффектами телепортации без извлечения союзника. Они остаются проглоченными в той точке, куда их телепортировало.",
        "Периодическое перемещение прерывается эффектами телепортации без извлечения союзника. Они остаются проглоченными в той точке, куда их телепортировало.",
        "Восстанавливает до 240% от максимального здоровья проглоченного союзника в минуту.",
        "Восстанавливает всё здоровье союзника за 25 секунд.",
        "Pudge получает бафф Swallow Effect, создающий над ним видимый только союзникам визуальный эффект."
      ],
      "mana": "100\/130\/170",
      "hotKey": "R",
      "cooldown": "30\/25\/20 (TagTalent 11)",
      "description": "Герой заживо пожирает врага, оглушая его и нанося периодический урон, который зависит от силы владельца способности и излечивает его. На крипов действует дольше.",
      "spellName": "Dismember",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 160",
        "Макс. длительность на героев: 3 (TagTalent 3,8)",
        "Макс. длительность на не-героев: 6 (TagTalent 6,8)",
        "Начальное урон и лечение за тик: 60\/90\/120 (TagTalent 108\/162\/216)",
        "Силы в урон и лечение за тик: 30%\/60%\/90% (TagTalent 54%\/108%\/162%)",
        "Скорость притягивания: 75",
        "Лечение союзника от его макс. здоровья: 0% (TagAghanim 4%)",
        "Длительность запрета действий союзника: 0 (TagAghanim 3)",
        "Уменьшает перезарядку. Позволяет применять эту способность на союзника, чтобы проглотить его и излечивать на 4% от его максимального здоровья каждую секунду. Союзник может вылезти когда угодно, отдав любую команду."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "«Есть с падалью одна загвоздка: час как поел - и опять голодный!»"
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки. Доступна в режиме Ability Draft.",
        "Появляется в 4-ом слоте способностей после использования Dismember на союзного героя.",
        "При применении прерывает произносимые заклинания Pudge.",
        "Если Pudge умирает, то союзник автоматически выплевывается."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Извергнуть проглоченного героя.",
      "spellName": "Eject",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Жизнь союзника никогда не будет прежней."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 25.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 1.5,
    "attrAgility": 14.0
  },
  "description": "Pudge – это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Meat Hook, бросает окровавленный крюк в определенную область или юнита. Крюк зацепится за первого юнита, в которого попадет, притащит его к Pudge и нанесет урон, если это враг. Вторая способность, Rot, токсичное облако, вызванное из-за гноения, постоянно наносит урон и замедляет противников, ранит не только вражеских юнитов, но и самого Pudge. Пассивная способность, Flesh Heap, дает Pudge дополнительное сопротивление магии, а также дополнительную силу, которая увеличивается, когда Pudge убивает вражеского героя, или тот умирает поблизости. Способность начинает накапливать заряды уже до того, как будет выучена, но получить силу герой сможет, только изучив ее. Ультимативной способностью, Dismember, Pudge начинает заживо пожирать вражеского юнита, обездвиживая его и нанося периодический урон. Покупка Aghanim's Scepter позволяет использовать Dismember на союзника, тем самым проглотив его, сделав неуязвимым и восстанавливая 4% от максимального здоровья в секунду, союзник может в любой момент вылезти из владельца способности.",
  "history": "На полях Вечной бойни, далеко на юге от Квойджа, тучная фигура упорно трудится под покровом ночи — убирает, а затем расчленяет, потрошит, сгружает в кучи конечности и внутренние органы павших. И все это лишь для того, чтобы на следующее утро бойня могла повториться. В том проклятом мире ничто не разлагается само по себе — мертвецам никогда не суждено вернуться обратно в землю, и не важно, насколько глубока могила. Окруженный стаями птиц-падальщиков, которым нужны порезанные кусочки трупов, мясник Pudge упражняется с лезвиями, которые затачиваются от резки трупов. Вжик-вжик-тух. Плоть отсекается от костей, связки и сухожилия отрываются как кусочки мокрой бумаги. И хоть у Pudge всегда было пристрастие к мясницкому ремеслу, со временем тучный здоровяк полюбил и то, что получается, когда он заканчивает работу над трупом. Сначала кусочек мускула там, глоточек крови... Вскоре Pudge уже вгрызался в тела самых крепких существ подобно грызущей кость собаке. Даже те, кто не питает страха перед жнецом Смерти, предпочитают не связываться с мясником.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,5 силы за заряд Flesh Heap",
      "talentRight": "Урон и лечение от Dismember умножаются на 1,8"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-4 сек. перезарядки Meat Hook",
      "talentRight": "+0,8 сек. действия Dismember"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-16% к скорости врагов от Rot",
      "talentRight": "+10% к вампиризму заклинаниями"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+30 к урону от Rot",
      "talentRight": "+4 к броне"
    }
  ]
}