{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Centaur_Warrunner_Hoof_Stomp.mp3\/revision\/latest?cb=20191216011917",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Способность сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "18\/16\/14\/12",
      "item_behaviour": [],
      "name": "Hoof Stomp",
      "cooldown": "100\/110\/120\/130",
      "description": "Герой бьёт о землю, оглушая противников неподалёку и нанося им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,5+0,3",
        "Радиус: 330",
        "Урон: 120\/180\/240\/300",
        "Длительность оглушения: 2\/2,2\/2,4\/2,6 ( 3\/3,2\/3,4\/3,6)"
      ],
      "legacy_key": "F",
      "story": "Когда кентавр бьет своим могучим копытом по земле, за далекие километры с домов сыпется пыль."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6d\/Centaur_Warrunner_Double_Edge.mp3\/revision\/latest?cb=20191216011916",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "Double Edge наносит магический урон как цели, так и самому заклинателю.",
        "Центром радиуса урона является сама цель, а не Centaur Warrunner.",
        "Double Edge сначала наносит урон всем противникам (в случайном порядке), а потом заклинателю. Урон, наносимый себе, не может быть смертельным, поэтому его нельзя использовать для добивания себя. Сначала даёт бонус к силе, затем накладывает замедление, после наносит урон.",
        "Урон, наносимый себе, не может быть смертельным, поэтому его нельзя использовать для добивания себя.",
        "Сначала даёт бонус к силе, затем накладывает замедление, после наносит урон.",
        "При улучшении с Aghanim's Shard повышение силы даётся только в том случае, если задетый враг — герой (включая клонов, исключая иллюзии и крипов героев). Применение способности по герою увеличит накопленное число эффектов и обновит их длительность. Может увеличить всю силу (базовую и бонусную) на 15%\/30%\/45%\/60%\/75% за каждое число эффектов.",
        "Применение способности по герою увеличит накопленное число эффектов и обновит их длительность.",
        "Может увеличить всю силу (базовую и бонусную) на 15%\/30%\/45%\/60%\/75% за каждое число эффектов.",
        "Увеличивает здоровье на 20, бонус к восстановлению здоровья на 0,1 и основной урон от атаки за каждую единицу силы. При обновлении значений силы текущее здоровье Centaur Warrunner остаётся на прежнем уровне. Бонус к характеристикам убирается по истечении баффа или при смерти. Текущий процент здоровья не сохраняется. Увеличение здоровья не считается лечением, оно не взаимодействует с усилением лечения. Таким образом, увеличение здоровья не учитывается в процентном пороге здоровья Ice Blast и отложенном лечении False Promise.",
        "При обновлении значений силы текущее здоровье Centaur Warrunner остаётся на прежнем уровне.",
        "Бонус к характеристикам убирается по истечении баффа или при смерти. Текущий процент здоровья не сохраняется.",
        "Увеличение здоровья не считается лечением, оно не взаимодействует с усилением лечения. Таким образом, увеличение здоровья не учитывается в процентном пороге здоровья Ice Blast и отложенном лечении False Promise.",
        "Таким образом, увеличение здоровья не учитывается в процентном пороге здоровья Ice Blast и отложенном лечении False Promise."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Double Edge",
      "cooldown": null,
      "description": "Герой совершает сокрушительный удар, нанося урон себе, цели и всем врагам неподалёку от неё. Урон этой способности частично зависит от силы владельца, и он не может погибнуть от её применения.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 150",
        "Радиус урона: 220",
        "Базовый урон: 120\/180\/240\/300",
        "Дополнительный урон от силы: 60%\/80%\/100%\/120% ( 100%\/120%\/140%\/160%)",
        "Максимальное число эффектов: 5",
        "Бонус к силе за эффект: 15%",
        "Замедление скорости передвижения: 25%",
        "Длительность замедления: 2",
        "Длительность эффекта: 15"
      ],
      "legacy_key": "D",
      "story": "Иногда Брэдводен сражается так свирепо, что в пылу битвы может задеть даже самого себя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Centaur_Warrunner_Retaliate_1.mp3\/revision\/latest?cb=20191216011907",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов \/ Себя",
        "Урон: Физический"
      ],
      "notes": [
        "Retaliate срабатывает только при попадании атаки по Centaur Warrunner вне зависимости от расстояния. Это значит, что способность не срабатывает на промахнувшиеся атаки.",
        "Сначала возвращаемый урон наносится атакующему, и только после этого — самому Centaur Warrunner.",
        "Вторичные атаки от Moon Glaives, Split Shot до выбора героем таланта и Flak Cannon не активируют Retaliate. При этом вторичные атаки от других источников мгновенных атак способность активируют. Не срабатывает от атак вардов и нетленных зомби.",
        "При этом вторичные атаки от других источников мгновенных атак способность активируют.",
        "Не срабатывает от атак вардов и нетленных зомби.",
        "Срабатывает от атак построек. Наносит 7,5\/12,5\/17,5\/22,5 (TagTalent 30\/35\/40\/45) + 10%\/13%\/16%\/19% от силы в качестве урона за каждое срабатывание (до учёта сопротивлений) постройкам.",
        "Наносит 7,5\/12,5\/17,5\/22,5 (TagTalent 30\/35\/40\/45) + 10%\/13%\/16%\/19% от силы в качестве урона за каждое срабатывание (до учёта сопротивлений) постройкам.",
        "Действует на союзных существ: если союзник умрет от возвращаемого урона - это будет засчитано за добивание.",
        "Изначально Retaliate — это аура, но она распространяется только на владельца до выбора соответствующего таланта. Бафф не отображается на владельце. При выборе дающего ауру таланта она начинает распространятся только на героев и крипов-героев. Влияет на неуязвимых союзников, но не на спрятанных союзников. Бафф от ауры задерживается на 0,5 сек.",
        "При выборе дающего ауру таланта она начинает распространятся только на героев и крипов-героев.",
        "Влияет на неуязвимых союзников, но не на спрятанных союзников.",
        "Бафф от ауры задерживается на 0,5 сек."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Retaliate",
      "cooldown": null,
      "description": "Каждый удар по герою наносит урон и атакующему. Помимо базового урона наносится дополнительный, зависящий от силы владельца способности. Наносит башням половину урона.",
      "hot_key": "E",
      "params": [
        "Ответный урон: 15\/25\/35\/45 ( 60\/70\/80\/90)",
        "Силы в виде урона: 20%\/26%\/32%\/38%",
        "Длительность задержки ауры: 0,5",
        "Радиус ауры: 1200"
      ],
      "legacy_key": "R",
      "story": "Брэдводену даже не нужно парировать атаки противника — его кожа, больше похожая на броню, сама отвечает на любое нападение."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзных героев"
      ],
      "notes": [
        "Требуется Aghanim's Scepter для разблокировки.",
        "Считает крипов-героев за героев.",
        "Союзный герой запрыгивает в тележку по дуге с высотой 450 и вариативной длинной. Длительность прыжка всегда составляет 0,5 сек. Союзный герой также находится в оцепенении во время прыжка.",
        "Союзный герой также находится в оцепенении во время прыжка.",
        "Во время поездки союзный герой имеет сквозное передвижение, иммунитет к атакам и становится невыбираемым. Любая атака или способность, целящаяся в героя в тележке и уже находящаяся в процессе замаха или анимации, будет отменена. При этом союзный также не сможет выбрать себя своими предметами (включая ↓↓ Двойное нажатие), кроме следующий исключений: Glimmer Cape, Healing Salve, Moon Shard и Shadow Amulet. Способность не предотвращает отражение заклинаний обратно в союзного героя.",
        "Любая атака или способность, целящаяся в героя в тележке и уже находящаяся в процессе замаха или анимации, будет отменена.",
        "При этом союзный также не сможет выбрать себя своими предметами (включая ↓↓ Двойное нажатие), кроме следующий исключений: Glimmer Cape, Healing Salve, Moon Shard и Shadow Amulet.",
        "Способность не предотвращает отражение заклинаний обратно в союзного героя.",
        "Во время действия Hitch A Ride каждое заклинание будет считать, будто союзный героей невидим и имеет иммунитет к раскрытию невидимости. Следующие способности проходят через её невидимость: Heat-Seeking Missile, Cinder Brew, Ошибка Lua в Модуль:Ability_ID на строке 62: Не найдено данных Cargo для \"Ethernal Chains\"., Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism и Thundergod's Wrath В отличие от взаимодействия с другими источниками невидимости, жуки, фантомы и нетленные зомби не будут мгновенно умирать при запрыгивания героя в тележку.",
        "Heat-Seeking Missile, Cinder Brew, Ошибка Lua в Модуль:Ability_ID на строке 62: Не найдено данных Cargo для \"Ethernal Chains\"., Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism и Thundergod's Wrath",
        "В отличие от взаимодействия с другими источниками невидимости, жуки, фантомы и нетленные зомби не будут мгновенно умирать при запрыгивания героя в тележку.",
        "Если Centaur Warrunner телепортируется на расстояние больше, чем 600, то тележка мгновенно исчезнет, а союзный герой спешится. Hitch A Ride перекрывается все эффекты, меняющее местоположение цели, делая телепортацию единственной возможностью для спешивания союзника. Если союзный герой телепортируется на любое расстояние (даже 0), то тележка исчезнет. Тележка также исчезнет, если Centaur Warrunner или союзник в тележке умрёт.",
        "Hitch A Ride перекрывается все эффекты, меняющее местоположение цели, делая телепортацию единственной возможностью для спешивания союзника.",
        "Если союзный герой телепортируется на любое расстояние (даже 0), то тележка исчезнет.",
        "Тележка также исчезнет, если Centaur Warrunner или союзник в тележке умрёт."
      ],
      "mana": "45",
      "item_behaviour": [],
      "name": "Hitch A Ride",
      "cooldown": "75",
      "description": "Герой забрасывает союзника в тележку за собой. Союзник в тележке может применять заклинания и атаковать, но не может передвигаться сам по себе, а враги не могут выбрать его целью. Эффекты без цели действуют на союзника в тележке. Увеличивает дальность атаки героев ближнего боя на 200.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 300",
        "Бонус к дальности атаки для героев ближнего боя: 200",
        "Длительность поездки: 8"
      ],
      "legacy_key": "V",
      "story": "Для Брэдводена желание сохранить свою пространную гордость не идёт ни в какое сравнение с жаждой победы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Centaur_Warrunner_Stampede_1.mp3\/revision\/latest?cb=20191216011910",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Союзников \/ Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания Centaur Warrunner.",
        "Действует на каждого подконтрольного игрокам союзного юнита, исключая курьеров, варды, постройки и иллюзии на основе Haunt.",
        "Затронутые союзники получают эффект сквозного передвижения и ускорение, поэтому их нельзя замедлить ниже установленного значения.",
        "Урон от силы рассчитывается при каждом отдельном прохождении через врага, поэтому он мгновенно адаптируется при изменении силы Centaur Warrunner. Тем не менее, множитель урона фиксируется до окончания действия и не изменится, если увеличить уровень Stampede.",
        "Тем не менее, множитель урона фиксируется до окончания действия и не изменится, если увеличить уровень Stampede.",
        "Stampede сначала наносит урон, затем применяет дебафф.",
        "Источником урона является союзник под эффектом, поэтому эффекты от урона будут действовать на союзника, а не на Centaur Warrunner (например Blade Mail).",
        "Звуковой эффект является глобальным и может быть услышан врагами даже сквозь туман войны."
      ],
      "mana": "100 (TagTalent 75)",
      "item_behaviour": [],
      "name": "Stampede",
      "cooldown": "150\/200\/250",
      "description": "Герой ведёт союзников в яростное наступление. Они проходят сквозь существ на максимальной скорости и втаптывают в землю всех врагов на пути, останавливая их и нанося им урон, зависящий от силы владельца способности. Каждого врага можно втоптать в землю лишь один раз.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Радиус урона\/замедления: 105",
        "Множитель урона за силу: 200%\/250%\/300%",
        "Скорость ускорения: 550",
        "Замедление скорости передвижения: 100%",
        "Длительность замедления: 3",
        "Длительность: 3,5\/4\/4,5",
        "Уменьшение получаемого союзниками урона:"
      ],
      "legacy_key": "T",
      "story": "Великий пояс Омекса, означающий величайшего воина своего вида, побуждает товарищей Брэдводена следовать за ним в самые жестокие схватки."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.0,
    "attrStrength": 27.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.0,
    "attrAgility": 15.0
  },
  "description": "Отражает урон в нападающих. Centaur Warrunner умело наносит и принимает урон. Он ведёт команду в наступление, оглушает своим топотом врагов и мгновенно отвечает на каждый удар, ускоряя как союзников, так и смерть неприятелей.  Стойкость Инициация Контроль Быстрый урон Побег ★☆☆",
  "history": "Говорят, что жизненный путь кентавра вымощен телами павших. И для кентавра по имени Warrunner этот путь был действительно длинным. Многие чужестранцы ошибочно принимают четырёхногих воинов из кланов Друуда за простоватых громил. У их языка нет письменной формы, культура бедна на графические символы; в музыке нет четкой структуры, а в религии — строгих правил и догм. Для кентавров лучшее выражение их мыслей и чувств — это битва. И если убийство среди кентавров считается искусством, то самый талантливый из их творцов — Брэдводен. Свою несокрушимую мощь он взрастил на землях Омекса, на древней арене, где тысячелетиями кланы кентавров собирались, чтобы провести гладиаторские церемонии. И чем дальше распространялась слава о нём, тем больше зрителей со всего света прибывало, чтобы увидеть великого кентавра в действии. Всегда выходя на арену первым и уходя последним, он создавал шедевры каждым брызгом крови, каждым взмахом окровавленного лезвия. Такова поэзия крови и стали, сложный узор на бледных песках бойни. Warrunner побеждал одного воина за другим до тех пор, пока арена не взрывалась выкриками его имени, и он не становился единственным, несравненным чемпионом. Ему был вручен великий пояс Омекса, но в победе ощущалась лишь пустота. Каков же воин без постоянного вызова? Великий кентавр ускакал из Омекса в тот же день с новой целью. Для своего народа Warrunner — это величайший воин, который ступал на арену. Теперь Warrunner стремится доказать, что он — величайший воин во всей истории."
}