{
  "abilities": [
    {
      "notes": [
        "Существо под действием этой способности могут добить союзники, если уровень его здоровья опустится ниже 25%",
        "Шар летит со скоростью 1200; требуется 0.71 сек., чтобы он достиг максимальной дистанции",
        "Поражает существ на расстоянии до 975 единиц (складывается из дальности прохождения и радиуса)",
        "Замедление уменьшается со временем. Пораженным существам возвращается 1% от их скорости передвижения с интервалом в 0,3 секунды спустя 0,3 секунды после применения дебаффа",
        "После нанесения базового урона способность наносит периодический урон с интервалом в 3 сек., срабатывая 6 раз",
        "Venomous Gale наносит до 125\/300\/475\/650 единиц урона одному существу до уменьшений",
        "Дебаффы от нескольких применений не складываются, но обновляют длительность. То есть базовый урон вновь не наносится, поскольку он связан с фактом применения дебаффа, а не с обновлением",
        "Снаряд дает летающий обзор радиусом в 280 единиц, пока летит",
        "Создающий чумные тотемы при попадании Venomous Gale <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талант создаёт 2  чумных тотема, характеристики которых основаны на текущем уровне способность  Plague Ward, при попадании по героям, включая клонов, но исключая иллюзии. Тотемы устанавливаются на расстоянии в 100 от каждого задетого противника с противоположной стороны от друг друга. Если  Plague Ward не изучена, то тотемы не устанавливаются"
      ],
      "item_behaviour": [],
      "description": "Выплевывает в указанном направлении ядовитый шар, который наносит урон всем задетым врагам и отравляет их. Пораженные цели медленнее передвигаются, а также получают урон каждые 3 секунды действия способности.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,57",
        "Дальность применения: 800",
        "Макс. дальность прохождения:  850",
        "Радиус: 125",
        "Урон от попадания: 50\/75\/100\/125",
        "Число срабатываний: 5",
        "Периодический урон: 15\/45\/75\/105",
        "Замедление скорости передвижения: 50%",
        "Длительность: 15",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Число чумных тотемов:  2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Venomancer_Venomous_Gale_1.mp3\/revision\/latest?cb=20191216030202",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "21\/20\/19\/18 (TagTalent 16\/15\/14\/13)",
      "aghanim": null,
      "name": "Venomous Gale",
      "cooldown": "95\/105\/115\/125",
      "legacy_key": "E",
      "story": "Смесь различных жал, ядов и токсинов, найденных в лесах острова Джиди, обычно выживших не оставляет."
    },
    {
      "notes": [
        "Урон от Poison Sting отмечен как эффект, отнимающий здоровье, поэтому на него не реагируют эффекты, срабатывающие от урона",
        "Урон наносится с интервалом в 1 секунду сразу после размещения дебаффа, срабатывая 6\/9\/12\/15 раз",
        "Может нанести до 48\/144\/288\/480 урона (до учёта сопротивлений)",
        "Дебаффы от нескольких атак не складываются, но обновляют длительность",
        "Атаки  чумных тотемов также накладывают на противников Poison Sting текущего уровня. Если Poison Sting не изучена, то дебафф не накладывается Poison Sting, накладываемый тотемами и самим Venomancer, имеют разные модификаторы. Они действуют отдельно друг от друга. Однако дебафф от тотемов не наносит урон, не замедляет скорость передвижения и не снижает восстановление здоровья, если цель находится под действием сразу двух дебаффов. Poison Sting от тотемов может нанести до 24\/72\/144\/240 урона"
      ],
      "item_behaviour": [],
      "description": "Добавляет в обычные атаки героя яд, который наносит периодический урон и снижает скорость передвижения жертвы.",
      "hot_key": "W",
      "params": [
        "Урон в секунду: 8\/16\/24\/32",
        "Процент урона у чумных тотемов: 50%",
        "Замедление скорости передвижения: 8%\/10%\/12%\/14% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 16%\/18%\/20%\/22%)",
        "Длительность: 6\/9\/12\/15",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Снижение восстановления здоровья:  20%"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Poison Sting",
      "cooldown": null,
      "legacy_key": "T",
      "story": "Лисейл перенял парализующий токсин существа, вызвавшего его трансформацию."
    },
    {
      "notes": [
        "Чумной тотем автоматически атакует врагов в его радиусе атаки, используя стандартные правила автоатаки. Можно вручную дать тотему цель для атаки при помощи A или  Нажатие ПКМ по врагу в радиусе атаки. При включенной опции «Приказ всем юнитам» Ctrl+ Нажатие ПКМ на противника отдаст команду всем тотемам атаковать выбранную цель. Также можно остановить атаку, отдав команду S (работает только в случае отключенной опции автоатаки)",
        "Атаки чумного тотема применяют  Poison Sting текущего уровня к врагам. Примечания к Poison Sting полностью применимы. Источником урона от Poison Sting тотемов является Venomancer, а не сами тотемы, поэтому эффекты от урона (например,  Damage Return)) будут оказывать воздействие на Venomancer, а не на тотемы",
        "Урон от тотемов не снижается способностями, блокирующими урон",
        "Приоритет в качестве целей для атак у чумного тотема ниже, чем у существ и героев, поэтому башни и крипы на линии атакуют их в последнюю очередь.  Рошан всегда ставит в приоритете тотемы, если в радиусе атаки нет других существ. Он также уничтожает тотемы за 1 атаки",
        "Тотемы получают иммунитет к заклинаниям в качестве баффа, поэтому враги могут проверить бафф и вывести ‼ Сообщение (Alt+ Нажатие ЛКМ) в чат оставшееся время жизни тотема",
        "Несмотря на описание <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта, увеличивающий здороье\/урон чумных тотемов <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талант не умножает здоровье и урон в 2,5 раза. Вместо этого талант добавляет 120\/320\/520\/720 здоровья и 32\/56\/79\/103 ‒ 34\/58\/81\/105 минимальный\/максимальный урона от атаки чумным тотемам. Увеличивает здоровье чумных тотемов в 2\/2,39\/2,53\/2,6 раза. Увеличивает минимальный средний и общий урон от атаки в 3,67\/3,67\/3,63\/3,64 и 3,14\/3,35\/3,41\/3,46 раза соответственно"
      ],
      "item_behaviour": [],
      "description": "Призывает чумной тотем, атакующий вражеских существ и сооружения. Тотем невосприимчив к магии. Он имеет текущий уровень способности Poison Sting, нанося 50% от её урона.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0,63",
        "Дальность применения:  850",
        "Длительность: 40"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Venomancer_Plague_Ward.mp3\/revision\/latest?cb=20191216030158",
      "effects": [
        "Способность: Направленная на точку"
      ],
      "mana": "5 (TagTalent 4)",
      "aghanim": null,
      "name": "Plague Ward",
      "cooldown": "21\/24\/27\/30",
      "legacy_key": "W",
      "story": "Сочетание давних талантов травника и новообретённых умений в приготовлении ядов становится живым воплощением чумы."
    },
    {
      "notes": [
        "Требуется  Aghanim's Shard для разблокировки",
        "Снаряд летит со скоростью 1800",
        "После развеивания дебаффа Latent Toxicity сначала наносит урон, затем оглушает. Оглушение после развеивания проходит сквозь Невосприимчивость к магии, но не оглушает во время неуязвимости или невидимости",
        "Наносит урон с интервалом 1 секунду, в результате срабатывая раз. Может нанести до 140 урона (до уменьшений)",
        "Может нанести до 420 урона, если дебафф был снят в интервале, предшествующему последнему нанесению урону",
        "Дебафф последовательных применений не суммируется, но обновляет продолжительность"
      ],
      "item_behaviour": [],
      "description": "Накладывает на цель слабый яд, немного замедляющий жертву и наносящий ей урон. Если эффект этого яда развеется любым способом, жертва получит значительный урон и будет оглушена.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения:  800",
        "Урон в секунду: 20",
        "Замедление скорости передвижения: 10%",
        "Урон при развеивании: 300",
        "Длительность эффекта: 7",
        "Длительность оглушения: 2"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Latent Toxicity",
      "cooldown": "75",
      "legacy_key": "L",
      "story": "Как подтверждает происхождение самого Веномант, некоторые из самых ужасающих опасностей Джиди проявляют себя только со временем."
    },
    {
      "notes": [
        "При применении прерывает произносимые заклинания Venomancer",
        "Кольцо Poison Nova распространяется со скоростью 550, достигая максимального радиуса за 1,08\/1,17\/1,26 секунды. Начальный радиус равен 255, цели в этом радиусе мгновенны подвергаются воздействию способности при её применении",
        "Наносит урон с интервалом в 1 секунду, начиная сразу после накладывания дебаффа, в результате срабатывания 21 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 26) раз. Poison Nova никогда не сможет убить существо. Здоровье существ от этого урона никогда не опустится ниже 1. Может нанести до 420\/630\/840 + 42%\/57,75%\/73,5% от максимального здоровья (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 520\/780\/1040 + 52%\/71,5%\/91%) урона одному существу (до учёта сопротивлений). С  Aghanim's Scepter может нанести 420\/630\/840 + 63%\/78,75%\/94,5% от максимального здоровья (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 520\/780\/1040 + 78%\/97,5%\/117%) урона одному существу",
        "Дебаффы от нескольких применений не складываются, но обновляют длительность"
      ],
      "item_behaviour": [],
      "description": "Герой распыляет яд на врагов вокруг. От этого яда жертвы постепенно теряют здоровье, но не могут умереть.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0,87",
        "Начальный радиус: 255",
        "Конечный радиус: 850\/900\/950",
        "Урон в секунду: 20\/30\/40",
        "Урон от макс. здоровья: 2%\/2,75%\/3,5% ( 3%\/3,75%\/4,5%)",
        "Длительность: 20 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 25)",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Замедление скорости атаки:  100"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/49\/Venomancer_Poison_Nova_1.mp3\/revision\/latest?cb=20191216030159",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "140\/120\/100 (TagTalent 100\/80\/60)",
      "aghanim": null,
      "name": "Poison Nova",
      "cooldown": "200\/300\/400",
      "legacy_key": "V",
      "story": "Отравлять обидчиков пагубным ядом — обычное дело для обитателей Кислотных джунглей; Лисейл помог этому бедствию выйти за пределы острова Джиди."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.1,
    "attrStrength": 19.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.8,
    "attrAgility": 24.0
  },
  "description": "Наносит периодический урон ядовитыми атаками Venomancer несёт своим врагам медленную смерть. Он взращивает бесконечную армию прыскающих ядом защитников, а стоит неприятелям показаться рядом, он выпускает огромное облако яда, надолго ослабляющего недругов.  Поддержка Быстрый урон Инициация Осада Контроль ★☆☆",
  "history": "В Кислотных джунглях острова Джиди всякая ползучая, летучая или ходячая тварь содержит в себе яд — он бурлит в венах и пузырится в желудках, и ядовитые звери прыгают с одного токсичного дерева на другое по лианам брызжущим разъедающей кислотой. Но даже во всём этом ядовитом безумии одно существо считается гораздо опаснее всех местных обитателей. Много лет назад залив Фраджи на своей лодчонке пересёк травник по имени Лисейл. Он прибыл на опасный остров в поисках полезных экстрактов, добываемых из корней и коры местной флоры, но нашёл лишь жестокую судьбу. Зайдя на десять километров вглубь джунглей, Лисейл набрёл на искомый эпифит. Только растение оказалось замаскированным ящером, который сразу укусил потянувшуюся к нему руку. Травник отчаянно бросился делать из местных растений антидот, благо знаний хватало: нужно лишь смешать яд свежезадушенной рептилии с нектаром броненосной орхидеи. За считанные мгновения до полного паралича Лисейл ввел себе антидот через шип орхидеи и впал в кому. Семнадцать лет спустя что-то зашевелилось под многолетним слоем перегноя — но то был уже не травник Лисейл. То был Лисейл-смертоносец, веномант. Его сознание хоть и сохранилось, но необратимо исказилось, а старая плоть перегнила в новую материю — живую ткань, в которой смешались яд той рептилии и токсичная оболочка броненосной орхидеи. Так родился новый повелитель Кислотных джунглей, которого в скором времени уважали и боялись даже самые свирепые хищники. Но небольшой остров оказался недостаточно велик для веноманта — отголоски человеческих страстей повели Лисейла прочь, на поиски новых смертоносных токсинов и достойных жертв."
}