{"abilities":[{"spell":"Tusk compresses shards of ice into a ball of frozen energy that damages all enemies it comes in contact with. When the ball reaches its target destination the shards are released, creating a barrier that lasts for 4\/5\/6\/7 seconds.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The projectile travels at a speed of 1200 and travels until reaching the targeted point.","The ice shards are always created in the same formation. The shards' formation is a 200 radius circle with one open side, the center of the circle is 200 range before the targeted point. The first shard is always created at the targeted point, so it is always in one line with Tusk's position upon cast. The next shards are placed 40° further to the left and the right respectively, up to 7 shards. 9 shards would make a full circle. So the open side of the shards circle is always facing towards Tusk's position upon cast. The shards' collision radius is approximately 67, the distance between them is about 6, which is too small for any unit to move through.","Units not controlled by any player do not try to path around the shards, but simply walk against them as if they are not there. This effectively causes them to get stuck until they change directions (e.g. when aggro-ing them).","The projectile has 100 radius flying vision. This vision lasts for 2 seconds at the targeted point upon reaching it."],"mana":"100\/105\/110\/115","elements":["Partially pierces spell immunity."],"cooldown":"23\/20\/17\/14 ( 17\/14\/11\/8)","name":"Ice Shards","description":["Cast Animation: 0.1+0","Cast Range: 2000","Damage Radius: 200","Shards Spawn Radius: 200","Damage: 60\/120\/180\/240","Shards Duration: 4\/5\/6\/7"],"hot_key":"Q","legacy_key":"E"},{"spell":"Tusk begins rolling into a snowball. Allies within a 350 radius can also be added to the snowball by right-clicking on them, even while the snowball is moving. Once launched, any enemies caught in the snowball's path will be stunned and take damage. Each allied Hero in the snowball will add to its damage.","effects":["Ability Target Unit","Affects Allies \/ Enemies","Damage Magical"],"notes":["The snowball travels at a speed of 600\/625\/650\/675","The Snowball chases the target for up to 3 seconds, so it can travel for up to 1800\/1875\/1950\/2025 range.","Allies can be added by right-clicking them at any point. Allies can jump inside the Snowball by themselves as well, by right-clicking it. Allies affected by Black Hole, Chronosphere, or Flaming Lasso cannot join the Snowball. However, attempting to load in an ally affected by these still adds damage to the Snowball. Can gather summoned units, except for wards. Can gather allies while they are invisible or invulnerable.","Units inside Snowball are invulnerable, hidden and spell immune. Allies inside the Snowball are also fully disabled.","Tusk himself is only muted and disarmed inside it, meaning he can cast his spells, but cannot use items or attack.","The radius increases by 40 per second, starting immediately as it begins rolling, so the radius during each second is 240\/280\/320.","Only gathered allied heroes (including clones) increase its damage. Other added units do not. Illusions do not count as heroes.","Tusk cannot be forced out of the Snowball, while other units can still be forced out by teleporting spells, without reducing the damage. Dark Rift is the only abilty able to force Tusk out of the Snowball. Upon doing so, the spell gets fully canceled.","When Snowball connects with its target, Tusk is given an attack order on the target. This means that Tusk will attack the target even if the player has \"Auto Attack\" option disabled.","The disable help function prevents an allied Tusk from getting you inside his Snowball.","The snowball destroys trees within its radius as it rolls forward.","This is how much damage Snowball deals (before reductions) with a certain amount of heroes (counting Tusk): 2 Heroes: 100\/150\/200\/250 ( 250\/300\/350\/400) 3 Heroes: 120\/180\/240\/300 ( 270\/330\/390\/450) 4 Heroes: 140\/210\/280\/350 ( 290\/360\/430\/500) 5 Heroes: 160\/240\/320\/400 ( 310\/390\/470\/550)","Snowball first applies the debuff, then the damage.","The Snowball Visible debuff provides shared vision over the target until the Snowball stops. Does not provide True Sight."],"mana":"75","elements":["Cannot be cast while rooted or leashed.","Cannot be disjointed.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"21\/20\/19\/18 ( 14\/13\/12\/11)","name":"Snowball","description":["Cast Animation: 0.1+0.5","Cast Range: 1250","Damage & Stun Radius: 200","Radius Increase per Second: 40","Gather Radius: 350","Max Stationary Time: 3","Max Chase Duration: 3","Base Damage: 80\/120\/160\/200 ( 230\/270\/310\/350)","Damage per Gathered Hero: 20\/30\/40\/50","Snowball Speed: 600\/625\/650\/675","Stun Duration: 0.5\/0.75\/1\/1.25"],"hot_key":"W","legacy_key":"W"},{"spell":"Launch the snowball toward the target.","effects":["Ability No Target"],"notes":["Replaces Snowball until the Snowball reaches its target or expires.","Tusk may use Ice Shards, Tag Team, Walrus Kick and toggle autocast of Walrus PUNCH! during the launch time, other gathered units may not use any spells."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Launch Snowball","description":["Cast Animation: 0+0"],"hot_key":"W","legacy_key":"W"},{"spell":"Temporarily applies a negative debuff aura around you, causing enemies that are attacked under it to take bonus physical damage and reduced movement speed. Lasts 5 seconds.","effects":["Ability No Target \/ Aura","Affects Enemies"],"notes":["Interrupts Tusk's channeling spells upon cast.","Grants Tusk a temporary aura. The aura's debuff lingers for 0.5 seconds.","Only triggers on allied hero attacks (including illusions and clones, excluding creep-heroes.), and on any attacks done by units owned by Tusk.","The damage is directly added to the triggering unit's attack damage, so it works with crit, cleave and lifesteal. However, it is added as a raw damage bonus, so illusions cannot use it, and it is unaffected by percentage-based damage bonuses or reductions.","The slow from multiple attacks fully stacks, with each attack placing a separate debuff.","Triggering attacks first places the slow debuff, then the attack damage."],"mana":"70","elements":["Does not pierce spell immunity."],"cooldown":"24\/21\/18\/15","name":"Tag Team","description":["Cast Animation: 0+0","Radius: 350","Attack Damage Bonus on Proc: 25\/50\/75\/100","Movement Speed Slow: 75%","Slow Duration: 0.4","Aura Duration: 5","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"T"},{"spell":"Tusk connects with his mighty Walrus Punch, a critical strike so powerful it launches its victim into the air. The victim is slowed upon landing.","effects":["Ability Target Unit \/ Autocast","Affects Enemies"],"notes":["The cast range of Walrus Punch always equals the caster's attack range.","Despite being an active attack modifier, Walrus Punch does proc all on-cast effects like a regular spell.","Walrus Punch cannot miss to evasion and blindness.","The victim is hurled 650 range (1200 if lethal) into the air during the stun duration. Walrus Punch cannot be overridden by any other upward movement.","While in the air, other units may pass below the punched unit.","The slow is applied right upon cast, so the effective slow duration is 2\/3\/4 seconds since the target is stunned for the first second.","The punch first applies the debuffs, then the damage.","Can punch everything, except wards, buildings, allied and own units. Tusk can attack those without wasting it when on autocast.","Since the damage is a simple crit, it can cleave and Tusk can lifesteal off of it.","Plays a sound as soon as the attack starts. The sound only stops playing upon landing the punch.","Can be cast on Roshan, but only the stun and slow are applied.","When the level 25 talent is chosen, Walrus Punch on the current level may passively proc on regular attacks. These procs are independent from the cooldown, they do not trigger the cooldown and work while on cooldown. They do not cost mana either. Increases Tusk's attack damage by an average of 37.5% ( 52.5%). The passive punches use true random distribution."],"mana":"50\/75\/100","elements":["Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"36\/24\/12","name":"Walrus PUNCH!","description":["Proc Chance on Attack: 0 ( 15%)","Critical Damage: 350% ( 450%)","Move Speed Slow: 40%","Slow Duration: 3\/4\/5","Stun Duration: 1"],"hot_key":"R","legacy_key":"R"},{"spell":"Kicks the target unit back, damaging them and slowing their movement speed.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Requires Aghanim's Scepter to be unlocked.","Unlike Walrus Punch, Walrus Kick is not an active attack modifier.","The target travels away from Tusk in an arc 1400 range far and 360 range high. Walrus Kick cannot be overridden by any other forced movement.","While in the air, other units may pass below the kicked unit.","The slow debuff is applied right upon cast, so the effective slow duration is 4 seconds since the target is stunned for the first second.","The kick first applies the debuff, then the damage.","Does not affect wards and buildings.","Destroys trees within a 100 radius around the kicked unit during the knockback.","Can be cast on Roshan, but only the stun, damage and slow are applied."],"mana":"100","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"8","name":"Walrus Kick","description":["Cast Animation: 0.2+1.3","Cast Range: 150","Knockback Distance: 1400","Damage: 350","Move Speed Slow: 40%","Slow Duration: 5","Stun Duration: 1"],"hot_key":"D","legacy_key":"D"}],"bio":"It had been a brawl to remember. There stood Ymir, the Tusk, the Terror from the Barrier, the Snowball from Cobalt, the only fighter to have bested the Bristled Bruiser in a fair fight, and now the last man standing in Wolfsden Tavern. What started as a simple bar bet of supremacy ended with four regulars, a blacksmith, and six of the Frost Brigade's best soldiers writhing against the shards and splinters of almost every bottle, mug, and chair in the building. The Tusk boasted and toasted his victory as he emptied his brew. No sooner had the defeated regained consciousness than the cries for double-or-nothing rang out. The Tusk was pleased at the prospect, but none could think of a bet bigger than the one he just conquered. Horrified at the damage to his tavern and desperate to avoid another brawl, the barkeep had an idea. As skilled as he was, Ymir had never taken part in a real battle, never tested himself against the indiscriminate death and chaos of war. He proposed a wager to the fighter: seek out the biggest battle he could find, survive, and win it for whichever side he chose. The stakes? The next round of drinks.","talentsTips":["Gold granted from the talent is unreliable gold.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["In DotA, Tusk's title is Tuskarr. The Tuskarr are a race of humanoid walruses in the Warcraft universe.","His response \"Falcon Punch!\" is a reference to Captain Falcon's signature move in the Super Smash Bros. franchise, which has also become a popular internet meme.","His response \"Bang! Zoom! To the Mad Moon!\" is likely a reference to The Honeymooners character Ralph Kramden, who would frequently say \"Bang! Zoom! Straight to the moon!\".","His response \"Coulda been a contender.\" is likely a reference to the quote from the movie On the Waterfront.","His response \"My fight money.\" is likely a reference to Balrog from Street Fighter who says the same thing whenever he loses a round.","His response to missing a Walrus Punch, \"Well there's your problem.\" is likely a reference to Adam Savage from Mythbusters, who has made it a show catchphrase. Savage often jokes that the mustache of his co-host Jamie Hyneman makes him look like a walrus.","His response \"Double Dragon Punch Punch!\" is a reference to the game, \"Double Dragon\".","In Tusk's lore, the Bristled Bruiser is Bristleback, who was ported to Dota 2 roughly a month after Tusk; Bristleback's lore makes mention of Tusk as well, and the two heroes share rival and ally lines with regards to this relationship.","Before 6.80, where Walrus PUNCH! dealt higher crit damage to targets below 50% health, the floating text above the target would change: When landed on an enemy creep whose health was above 50%, the caption read \"Penguin Punch!\" in small blue letters. When landed on an enemy hero whose health was above 50%, the caption read \"Polar Punch!\" in medium blue letters. When landed on any enemy whose health was below 50%, it read \"Walrus Punch!\" in large letters. In the current version, it always displays \"Walrus Punch\", no matter what is targeted.","Rubick's version of Walrus Punch would throw a projectile which uses Rubick's model and spins towards the target. When used on Tusk, it would read \"Sucker Punch!\" in green. On other targets, it read \"Stolen Punch\"."],"talents":["-7s Snowball Cooldown:15% Chance Walrus Punch","+100% Walrus Punch Crit:-6s Ice Shards Cooldown","+150 Snowball Damage:+350 Health","+90 Gold\/Min:+40% XP Gain"],"desc":"Ymir, the Tusk, is a melee strength hero whose array of icy disables make him a very strong team initiator and ganker. He has a damage nuke and a disable in Ice Shards, which lets him precisely place a barrier in an enemy's path, inhibiting their movement and blocking off their escape path. Should his teammates need help closing the distance to enemies, Tusk can assist them with Snowball, which surrounds Tusk and any nearby allies in a protective shell of snow as he rolls at a target enemy, damaging and stunning everything in its path. Once in a fight, Tusk also has the ability to Tag Team, which allows all nearby allies to slow enemies they attack with physical damage. His ultimate, Walrus PUNCH!, sends a target enemy flying with a mighty uppercut, stunning and disabling them while dealing a critical strike and slowing them upon landing for a moderate amount of time. A strong initiator and powerful brawler, the Terror from the Barrier should never be bet against in a fight, as he can put his foes down for the count with his unique assortment of spells and disables."}