{"abilities":[{"spell":"Tusk сжимает осколки льда в шар холодной энергии, который наносит урон всем врагам, которых он коснется. Когда шар достигнет точки назначения, то осколки высвободятся, создавая барьер на 4\/5\/6\/7 сек.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Осколки движутся со скоростью 1200 до достижения целевой точки.","Ледяные осколки всегда появляются в одном и том же порядке. Осколки располагаются полукругом радиусом в 200 единиц, центром которого является расстояние в 200 единиц до выбранной точки. Первый осколок всегда появляется в выбранной точке, поэтому он всегда будет на одной линии с позицией Tusk при использовании заклинания. Следующие осколки располагаются под углом в 40° друг к другу, в итоге их насчитывается 7 штук. 9 осколков могли бы создать полный круг. Поэтому незавершенная часть круга всегда расположена по направлению к месту применения заклинания Tusk. Радиус столкновения осколков равен 67, расстояние между ними - 6, поэтому между осколками пройти нельзя.","Юниты, которые не контролируются игроками, не пытаются обойти осколки, а просто упираются в них. То есть так можно останавливать юнитов, пока они не поменяют направление (например, их что-либо сагрит).","Осколки имеют летающий обзор радиусом в 100 единиц. Этот обзор длится 2 секунды на выбранной точке по достижению ею осколков."],"mana":"100\/105\/110\/115","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"23\/20\/17\/14 ( 15\/12\/9\/6)","name":"Ice Shards","description":["Анимация применения: 0,1+0","Дальность применения: 2000","Радиус урона: 200","Радиус появления осколков: 200","Урон: 60\/120\/180\/240","Длительность осколков: 4\/5\/6\/7"],"hot_key":"Q","legacy_key":"E"},{"spell":"Tusk начинает сворачиваться в снежный ком. Союзников в радиусе 350 также можно поместить в ком, нажав на них правой кнопкой мыши, даже если ком уже движется. После запуска все враги на пути кома будут оглушены и получат урон. Чем больше в коме союзных героев, тем больше урон от него.","effects":["Способность Направленная на юнита","Действует на Союзников \/ Врагов","Урон Магический"],"notes":["Снежный ком движется со скоростью в 600\/625\/650\/675 ( ) единиц.","Snowball достигает цель за 3 секунды, поэтому ком может преодалеть расстояние в 6.5641025641026E-6 единиц.","Правой кнопкой мыши можно добавлять других союзных героев в любой момент. Союзники таким же образом могут самостоятельно залезать в ком. Союзников, затронутых Black Hole, Chronosphere или Flaming Lasso, нельзя поместить в Snowball. При этом попытка поместить затронутого союзника все равно добавит Snowball урона. Может забирать призываемых существ, но не варды. Может забирать невидимых или неуязвимых союзников.","Юниты внутри Snowball неуязвимы, спрятаны и получают иммунитет к заклинаниям. Союзники в Snowball также обезвреживаются.","Сам Tusk лишь заглушается и обезоруживается, что позволяет ему использовать заклинания, но не атаковать или использовать предметы.","Радиус увеличивается на 40 в секунду сразу же после начала движения, составляя 240\/280\/320 каждую секунду.","Только союзные герои (включая клонов) увеличивают урон. Остальные существа урона не добавляют. Иллюзии не считаются за героев.","Сам Tusk не может покинуть Snowball, в то время как другие существа могут это сделать с помощью заклинаний телепортации без снижения урона кома. Dark Rift - единственная способность, способная забрать Tusk из Snowball. Как только это произойдет - Snowball отменяется.","Как только Snowball соприкасается с целью, Tusk получает приказ атаковать её. То есть Tusk все равно будет атаковать цель, даже если в настройках игрока опция авто-атаки отключена.","Отключение функции \"помощь\" предотвратит добавление героя в Snowball союзного Tusk.","Снежный ком разрушает деревья в пределах своего радиуса при движении.","Здесь указано, сколько урона нанесет Snowball (до учета сопротивления) с определенным количеством героев внутри (учитывая Tusk): 2 героя: 100\/150\/200\/250 ( 250\/300\/350\/400) 3 героя: 120\/180\/240\/300 ( 270\/330\/390\/450) 4 героя: 140\/210\/280\/350 ( 290\/360\/430\/500) 5 героев: 160\/240\/320\/400 ( 310\/390\/470\/550)","Snowball сначала применяет дебафф, затем наносит урон.","Дебафф \"Snowball Visible\" дает общий обзор на цель до остановки Snowball. Не дает эффект True Sight."],"mana":"75","elements":["Нельзя применять в оцепенении или будучи связанным.","Нельзя избежать.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"21\/20\/19\/18 ( 14\/13\/12\/11)","name":"Snowball","description":["Анимация применения: 0,1+0,5","Дальность применения: 1250","Радиус базового урона и оглушения: 200","Увеличение радиуса в секунду: 40","Радиус сбора: 350","Макс. время простоя: 3","Макс. длительность преследования: 3","Базовый урон: 80\/120\/160\/200 ( 230\/270\/310\/350)","Урона за собранного героя: 20\/30\/40\/50","Скорость кома: 600\/625\/650\/675","Длительность оглушения: 0.5\/0.75\/1\/1.25"],"hot_key":"W","legacy_key":"W"},{"spell":"Запускает снежный ком в сторону цели.","effects":["Способность Ненаправленная"],"notes":["Заменяет Snowball до достижения комом цели или завершения длительности.","Tusk может использовать Ice Shards, Tag Team, Walrus Kick и переключать автоприменение Walrus PUNCH! во время запуска, в то время как остальные существа не могут использовать заклинания."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Launch Snowball","description":["Анимация применения: 0+0"],"hot_key":"W","legacy_key":"W"},{"spell":"Временно даёт герою ауру, в которой атаки замедляют передвижение врагов и наносят им дополнительный физический урон. Действует секунд.","effects":["Способность Ненаправленная \/ Аура","Действует на Врагов"],"notes":["При применении прерывает произносимые заклинания Tusk.","Временно дает ауру Tusk. Её дебафф задерживается на 0.5 секунды.","Срабатывает только на атаки союзных героев (включая иллюзии и клонов, исключая крипов-героев) и любые атаки подконтрольных Tusk юнитов.","Урон непосредственно добавляется к урону от атаки юнита, поэтому он учитывается вампиризмом, критическим и прорубающим ударом. Но при этом урон добавляется в качестве дополнительного, поэтому иллюзии его не используют, а любые бонусы или снижения, использующие процентное значение, его не учитывают.","Замедление от нескольких атак складывается, накладывая каждый раз отдельный дебафф.","Сработавшая атака сначала применяет дебафф замедления, затем наносит урон."],"mana":"70","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"24\/21\/18\/15","name":"Tag Team","description":["Анимация применения: 0+0","Радиус: 350","Доп. урон: 25\/50\/75\/100","Замедление скорости передвижения: 75%","Длительность замедления: 0.4","Длительность ауры: 5","Длительность задержки ауры: 0.5"],"hot_key":"E","legacy_key":"T"},{"spell":"Герой совершает свой коронный удар — настолько мощный, что подбрасывает жертву в воздух, нанося ей критический урон. После приземления жертва будет замедлена.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов"],"notes":["Дальность применения Walrus PUNCH! всегда равна дальности атаки заклинателя.","Несмотря на то, что эта способность - активный модификатор атаки, на Walrus PUNCH! срабатывают все эффекты, реагирующие на применение, как на обычное заклинание.","Walrus PUNCH! не может промахнуться из-за уклонения или ослепления.","Жертва закручивается в воздухе на 650 единиц (1200, если удар был смертельным) во время длительности оглушения. Walrus PUNCH! не может быть перезаписан другими источниками принудительного движения, поднимающих цель вверх.","Когда юнит в воздухе, остальные существа могут под ним проходить.","Замедление накладывается при применении, поэтому длительность замедления равна 2\/3\/4 секундам после первой секунды оглушения цели.","Walrus PUNCH! сначала применяет дебаффы, затем наносит урон.","Может подкидывать всех, за исключением вардов, строений, союзников и существ под контролем Tusk. Tusk может атаковать их с включенным |автоприменением без ухода способности на перезарядку.","Поскольку этот урон - просто критический, он может быть прорубающим и Tusk может лечится вампиризмом от него.","Проигрывает звук при начале атаки. Звук завершится только после попадания удара.","Можно использовать на Рошана, но к нему применятся только оглушение и замедление.","При выборе таланта на 25-ом уровне Walrus PUNCH! текущего уровня сможет пассивно сработать при обычной атаке. Срабатывание не зависит от перезарядки, не активирует её и способность может сработать при активном таймере. Также срабатывание не расходует ману. В среднем увеличивает урон Tusk на 37.5% ( 52.5%). Пассивные срабатывания используют псевдо-случайное распределение."],"mana":"50\/75\/100","elements":["Не блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"36\/24\/12","name":"Walrus PUNCH!","description":["Шанс срабатывания при атаке: 0 ( 15%)","Критический урон: 350% ( 450%)","Замедление скорости передвижения: 40%","Длительность замедления: 3\/4\/5","Длительность оглушения: 1"],"hot_key":"R","legacy_key":"R"},{"spell":"Отпинывает цель от себя, нанося ей урон и замедляя на некоторое время.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Требует Aghanim's Scepter для разблокировки.","В отличии от Walrus PUNCH! Walrus Kick - не активный модификатор атаки.","Цель отлетает от Tusk по дуге длиной в 1400 единиц и высотой в 360. Walrus Kick не может быть перезаписан другими источниками принудительного движения.","Когда юнит в воздухе, остальные существа могут под ним проходить.","Замедление накладывается при применении, поэтому длительность замедления равна 4 секундам после первой секунды оглушения цели.","Walrus Kick сначала применяет дебафф, затем наносит урон.","Не действует на варды и строения.","Разрушает деревья в радиусе 100 единиц от выбранного юнита во время отбрасывания.","Можно использовать на Рошана, но к нему применятся только оглушение и замедление."],"mana":"100","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"8","name":"Walrus Kick","description":["Анимация применения: 0,2+1,3","Дальность применения: 150","Дистанция пинка: 1400","Урон: 350","Замедление скорости передвижения: 40%","Длительность замедления: 5","Длительность оглушения: 1"],"hot_key":"D","legacy_key":"D"}],"bio":"Славная была потасовка! После неё в таверне «Волчья дыра» на ногах остался стоять лишь Имир — он же Бивень, он же Ужас из Барьера, он же Снежный ком из Кобальта — единственный, кому удалось в честной драке одолеть одного небезызвестного шипастого вышибалу. Всё началось с безобидного спора «кто кого?»... В итоге у трактирщика не осталось ни одной целой бутылки, кувшина или стула, а в глубокий нокаут посреди осколков отправились четверо завсегдатаев, один кузнец и шестеро лучших вояк Морозной дружины. Созерцая эту картину, Имир провозгласил тост в свою честь и осушил кружку хмельного. Едва проигравшие пришли в себя, они тут же начали требовать реванша со ставками повыше. Имиру то было лишь в радость, вот только он сомневался, осталось ли у этих бедолаг хоть что-то за душой. Ужаснувшись погрому, трактирщик пошёл на хитрость, лишь бы предотвратить очередной дебош. Имир, несмотря на своё отменное мастерство, никогда не участвовал в настоящей битве, не ведал хаоса на поле брани и не знал, какой неразборчивой порой бывает смерть, и потому трактирщик предложил ему новое пари: поучаствовать в самом масштабном сражении, неважно за какую сторону, выжить, да ещё и разгромить врага. Ну а что на кону? Добротная порция выпивки за счёт заведения.","talentsTips":["Золото с таланта является ненадёжным.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Оригинальное имя героя - Tuskarr, что является отсылкой к существам из вселенной Warcraft.","Реплика при промахе Walrus Punch, \"Well there's your problem,\" скорее всего, ссылка на фразу Адама Сэвиджа, одного из ведущих телепередачи Mythbusters. Сэвидж часто шутит о своем соведущем, Джейми Хайнемане, что тот похож на моржа, намекая на его усы.","Реплика \"Falcon Punch!\" является отсылкой к персонажу - Captain Falcon из In Super Smash Bros. на Nintendo.","Интересная особенность - надпись, появляющаяся после удара по цели способностью Walrus Punch, зависит от цели: Если целью был крип с запасом здоровья более 50%, появится надпись \"Penguin Punch!\", маленькими голубыми буквами. Если целью был герой с запасом здоровья более 50%, надписью будет \"Polar Punch!\", голубыми буквами среднего размера. Если же целью был юнит с запасом здоровья менее 50%, под целью появится надпись \"Walrus Punch!\", большими красными буквами.","Если Walrus Punch будет украден Rubick, при активированной способности вместо обычного снаряда в противника полетит миниатюрная модель самого Rubick. Если целью украденной способности будет сам Tusk, после попадания снаряда под ним появится надпись \"Sucker Punch!\", ярко-зеленого цвета. При попадании в любые прочие цели надписью будет \"Stolen Punch!\".","Известным вышибалой с иглами на спине, о котором идет речь в биографии героя, является герой Bristleback."],"talents":["-7 сек. перезарядки Snowball:Walrus PUNCH! сработает при атаке с шансом в 15%","+100% к критическому урону от Walrus PUNCH!:-8 сек. перезарядки Ice Shards","+150 к урону от Snowball:+400 к здоровью","+90 золота в минуту:+10 здоровья в секунду"],"desc":"Tusk — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Ice Shards, сжимает осколки льда в шар холодной энергии, который наносит урон всем врагам, которых он коснется. Когда шар достигнет точки назначения, то осколки высвободятся, создавая барьер. Вторая способность, Snowball, начинает сворачивать Tusk в снежный ком. Союзников в радиусе 400 можно поместить в ком, нажав на них правой кнопкой мыши, даже если ком уже движется. После запуска все враги на пути кома будут оглушены и получат урон. Чем больше в коме союзных героев, тем больше урон от него. Ком можно запустить сразу, использовав Launch Snowball. Третья способность, Tag Team, создаёт вокруг героя ауру, позволяющую ему и союзным героям наносить дополнительный урон и замедлять противника. Ультимативная способность, Walrus PUNCH!, дает Tusk нанесет следующей атакой критический урон и подбросит жертву в воздух. После приземления жертва будет замедлена. Улучшение с Aghanim's Scepter добавляет способность Walrus Kick, которая пинает цель и замедляет на некоторое время."}