{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e8\/Helm_of_the_Dominator_Dominate.mp3\/revision\/latest?cb=20191227195434",
      "effects": [
        "Cast Range: 700",
        "Max Units: 1",
        "Min Base Health: 1800",
        "Set Move Speed: 400",
        "Set Gold Bounty: 250",
        "Base Attack Damage Bonus: 80",
        "Health Regen Bonus: 12",
        "Mana Regen Bonus: 4",
        "Armor Bonus: 8"
      ],
      "notes": [
        "Cannot dominate creep-heroes, Siege Creeps, Necronomicon Archers, Necronomicon Warriors, and Roshan.",
        "Applies a basic dispel on the creep upon cast.",
        "Dominating a creep while already having one dominated instantly kills the previously dominated creep.",
        "The number of max allowed units is bound to the player. Buying a new Helm of the Overlord does not allow dominating an additional unit. When owning both, Helm of the Dominator and Helm of the Overlord, Helm of the Overlord takes priority, allowing 1 units. This also goes for the Tempest Double's copied Helm of the Overlord. When the Dominated creep changes faction (i.e. when affected by Holy Persuasion or Enchant), it no longer counts towards the max limit. When the item gets sold or destroyed, the dominated creep dies. The death is not credited to anyone so that no one gets experience from it.",
        "When owning both, Helm of the Dominator and Helm of the Overlord, Helm of the Overlord takes priority, allowing 1 units.",
        "This also goes for the Tempest Double's copied Helm of the Overlord.",
        "When the Dominated creep changes faction (i.e. when affected by Holy Persuasion or Enchant), it no longer counts towards the max limit.",
        "When the item gets sold or destroyed, the dominated creep dies.",
        "The death is not credited to anyone so that no one gets experience from it.",
        "Sets the creep's movement speed to 400, regardless of its default movement speed.",
        "Sets the creep's gold bounty to 250 , regardless of its default bounty. The creep's default gold bounty is not granted upon killing it, only the set value is. Its experience bounty is unchanged.",
        "The creep's default gold bounty is not granted upon killing it, only the set value is. Its experience bounty is unchanged.",
        "When the creep's max health is below the min health threshold, its current and max health are increased by the difference. This counts as setting health.",
        "Attack damage bonus is added directly to the creep's base attack damage. Does not grant flat bonus attack damage.",
        "Does not grant flat bonus attack damage.",
        "Does not restore the creep's mana.",
        "Does not share cooldowns with Helm of the Dominator."
      ],
      "mana": "0",
      "abilityName": "Dominate",
      "cooldown": "45",
      "description": "Takes control of one neutral target unit and sets its movement speed to 400 and max health to a minimum of 1800. Also provides the unit with +80 base attack damage, +12 health regen, +4 mana regen and +8 armor. Dominated units with a max health of greater than 1800 retain their original max health. Dominated unit's bounty is set to 250 gold.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Radius: 1200",
        "Hero Lifesteal: 20%",
        "Creep Lifesteal: 10%",
        "Mana Regeneration Bonus: 2",
        "Attack Damage Bonus: 18%",
        "Armor Bonus: 3",
        "Aura Linger Duration: 0.5"
      ],
      "notes": [
        "Multiple instances of Vladmir's Aura do not stack. This includes the auras of Vladmir's Offering and Wraith Pact. Unlike other items, this aura is not provided by the item's own modifier, but instead it places the item modifier of Vladmir's Offering on the wielder, which provides the aura. Fully stacks with other sources of Buckler-based items' armor aura and Ring of Basilius-based items' mana regeneration aura.",
        "Unlike other items, this aura is not provided by the item's own modifier, but instead it places the item modifier of Vladmir's Offering on the wielder, which provides the aura.",
        "Fully stacks with other sources of Buckler-based items' armor aura and Ring of Basilius-based items' mana regeneration aura.",
        "Stacks additively with other sources of lifesteal.",
        "Cannot lifesteal off of wards, buildings and allied units.",
        "Grants flat bonus attack damage based on the affected unit's main attack damage. Does not further increase bonus attack damage.",
        "Can regenerate up to 120 mana in one minute.",
        "Affects invulnerable, but not hidden units.",
        "The aura's buff lingers for 3 seconds."
      ],
      "mana": null,
      "abilityName": "Vladmir's Aura",
      "cooldown": null,
      "description": "Grants 20% lifesteal, 18% bonus damage, 2 mana regeneration, and 3 armor to nearby allies. Lifesteal from creeps is reduced by 50%",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "140 health and 0.7 health regeneration.",
    "84 mana and 0.35 mana regeneration.",
    "7 attack speed and 1.17 main armor.",
    "7 main attack damage to all \/ \/ heroes."
  ],
  "cost": "6175",
  "lore": null,
  "consistFrom": [
    "Helm of the Dominator",
    "Vladmir's Offering",
    "Recipe"
  ],
  "name": "Helm of the Overlord",
  "description": "The powerful headpiece of a dead necromancer.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Dominated creeps can be used to remotely stack an ancient camp. Some creeps have abilities that are very useful, such as Dark Troll Summoner and Ogre Frostmage.",
    "You can dominate the Alpha Wolf for the helpful damage aura and have it follow your carry.",
    "A dominated creep can be used as a scout that can be placed inside Roshan's pit. Just be sure not to place it too close to Roshan, so he does not attack it.",
    "Dominate always sets the creep's base movement speed to 400. The only units which have more than 425 movement speed are Lycan Wolves at level 3 or higher. This means dominating one of them actually reduces their base speed down to 400. Besides these, all other dominatable creeps have lower movement speed than 400."
  ]
}