{
  "abilities": [
    {
      "notes": [
        "При использовании Searing Chains прерывает произносимые способности Ember Spirit",
        "Несмотря на визуальные эффекты, эффект от Searing Chains применяется мгновенно и его нельзя избежать",
        "Способность применяется на случайных существ рядом с героем, для неё нет приоритетных целей",
        "Применяет оцепенение к целям, предотвращая их передвижение и использование способностей для перемещения\n Дает эффект True Sight на цели",
        "Не действует на невидимых существ или существ в тумане войны",
        "Наносит урон с интервалом в 0,5 секунды спустя 0,5 секунды после применения, нанося урон 3\/4\/5\/6 ( 5\/6\/7\/8) раз",
        "Может нанести до 75\/140\/225\/330 ( 125\/210\/315\/440) единиц урона каждому существу (до уменьшений)"
      ],
      "item_behaviour": [],
      "description": "Герой выпускает горящие бола, которые удерживают врагов на месте и наносят ежесекундный урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,5",
        "Радиус: 400",
        "Максимум целей: 2 ( 3)",
        "Урон в секунду: 50\/70\/90\/110",
        "Длительность: 1,5\/2\/2,5\/3 ( 2,5\/3\/3,5\/4)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Ember_Spirit_Searing_Chains_1.mp3\/revision\/latest?cb=20191216013535",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "13\/12\/11\/10",
      "aghanim": null,
      "name": "Searing Chains",
      "cooldown": "80\/90\/100\/110",
      "legacy_key": "C",
      "story": "Самые суровые уроки Сина проходят с использованием раскалённых докрасна цепей."
    },
    {
      "notes": [
        "Ember Spirit неуязвим, пока действует Sleight of Fist\n Способность не позволяет избегать снаряды",
        "Пока действует Sleight of Fist, способность неактивна, поэтому её нельзя повторно использовать до завершения предущего применения\n Во время Sleight of Fist Ember Spirit лишь обезоруживается, поэтому он может совершать любые действия",
        "При использовании все цели в области помечаются\n Над ними появляется горящий меч в виде индикатора, который остается до того момента, пока они не получат удар\n Для Sleight of Fist нет лимита по дальности\n Получив отметку, цель не может избежать Sleight of Fist, увеличив дистанцию\n Не действует на невидимых существ или существ с иммунитетом к атакам\n Если отмеченное существо получает любой из этих эффектов состояния, способность его пропускает\n Действует на существ в тумане войны\n Они также получают отметку и урон",
        "Скачки происходят с интервалом в 0,2 секунды\n Они происходят в случайном порядке между всеми отмеченными существами без какого-либо приоритета",
        "С каждым скачком Ember Spirit находится в 50 единицах от его цели на линии между ней и местом применения Sleight of Fist",
        "С каждым прыжком Ember Spirit совершает мгновенную атаку по целям\n То есть на удары (как и на обычные атаки) может сработать любой модификатор атаки или эффект, срабатывающий при ударе\n Если Ember Spirit ослеплен, то удары могут промахнутся, кроме случая, когда у него есть эффект точности\n Также удары могут промахнутся из-за уклонения\n Если Ember Spirit обезоружен, при скачках мгновенные атаки совершаться не будут\n Мгновенные атаки не выводят из невидимости от  Smoke of Deceit",
        "Бонусный урон от Sleight of Fist считается бонусным условным уроном от атаки\n Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он всё ещё учитывается и напрямую добавляется к урону от атаки воина земли\n Его можно уменьшить только прямыми снижениями (например, блокировкой урона)\n Так как урон считается бонусным уроном от атаки, то на него не влияют процентные бонусы или снижения урона от атаки",
        "После совершения ударов по всем отмеченным целям, Ember Spirit возвращается к месту, где он использовал Sleight of Fist\n Это место отмечается духом на всё время действия",
        "Использование  Activate Fire Remnant отменяет Sleight of Fist\n Остальные источники принудительного движения этого не делают",
        "Выбор дающего заряды Sleight of Fist  таланта мгновенно дарует 1 дополнительный заряд"
      ],
      "item_behaviour": [],
      "description": "Герой стремительно атакует всех врагов в указанной области, а затем возвращается к своему исходному местонахождению. Наносит больше урона героям.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0,7",
        "Дальность применения: 650",
        "Радиус: 250\/350\/450\/550",
        "Интервал между прыжками: 0,2",
        "Доп\n урон по героям: 45\/80\/115\/150 ( 110\/145\/180\/215)",
        "Число зарядов:  2",
        "Время восстановления заряда:  15\/12\/9\/6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Ember_Spirit_Sleight_of_Fist.mp3\/revision\/latest?cb=20191216013536",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов \/ Себя",
        "Урон: Мгновенная атака"
      ],
      "mana": "15\/12\/9\/6 (TagTalent 0)",
      "aghanim": null,
      "name": "Sleight of Fist",
      "cooldown": "50",
      "legacy_key": "T",
      "story": "Опытный воин должен маневрировать и пробиваться сквозь врагов, сжигая всех на своём пути."
    },
    {
      "notes": [
        "При использовании Flame Guard прерывает произносимые способности Ember Spirit",
        "Наносит 5\/7\/9\/11 ( 15\/17\/19\/21) единиц урона с интервалом в 0,2 секунды спустя 0,2 секунды после применения",
        "Наносит 5\/7\/9\/11 ( 15\/17\/19\/21) урона с интервалом в 0,2 сек., начиная спустя 0,2 сек\n после применения\n Может нанести 275\/490\/765\/1100 ( 825\/1190\/1615\/2100) урона одному существу (до уменьшений), учитывая максимальную длительность Flame Guard",
        "Блокирует только 70% входящего магического урона от способностей и атак\n Не блокирует любой физический или чистый урон\n Блокирует урон (до учета любых уменьшений), кроме снижения от  Mana Shield\n Эффект действует, пока герой не получит 121\/271\/421\/571 ( 407\/557\/707\/857) магического урона\n Это значит, что сквозь щит пройдёт 36\/81\/126\/171 ( 122\/167\/212\/257) урона до его снятия",
        "Повторное использование Flame Guard обновляет бафф и сбрасывает впитанный барьером урон",
        "Не сочетается с другими источниками магического барьера\n Если на существо действует несколько источников барьера, они все впитывают одинаковое количество урона одновременно\n Однако если полученный от одного источника урон превосходит плотность каждого барьера по отдельности, то урон блокируется так, будто бы это был один барьер с [[Сопротивление магии}комбинированной плотностью]]"
      ],
      "item_behaviour": [],
      "description": "Окружает героя огненным щитом, который поглощает долю получаемого магического урона и наносит периодический урон всем противникам вокруг. Когда щит впитает максимум урона, то защита и урон по площади пропадут.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0,6",
        "Радиус: 400",
        "Урон в секунду: 25\/35\/45\/55 ( 75\/85\/95\/105)",
        "Поглощаемый урон: 70%",
        "Здоровье щита: 85\/190\/295\/400 ( 285\/390\/495\/600)",
        "Длительность: 11\/14\/17\/20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Ember_Spirit_Flame_Guard.mp3\/revision\/latest?cb=20191216013533",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "35",
      "aghanim": null,
      "name": "Flame Guard",
      "cooldown": "65\/80\/95\/110",
      "legacy_key": "E",
      "story": "Врагу нельзя давать легко приблизиться."
    },
    {
      "notes": [
        "Уровень этой способности повышается вместе с уровнем  Fire Remnant",
        "Ember Spirit перемещается к  Fire Remnant со скоростью в 1300 единиц, если может долететь до цели быстрее, чем за 1 секунду, или за 0,4 секунды\n В момент полета к Fire Remnant Ember Spirit неуязвим",
        "Fire Remnant не позволяет избегать снаряды, которые летят в героя, когда он использует способность",
        "Расход маны для активации способности всегда одинаков, независимо от того, на какое количество копий герой летит",
        "Во время применения способности Ember Spirit может атаковать, использовать способности и предметы (но герой все равно должен смотреть в сторону цели)",
        "Принудительное движение отменяет движение от Activate Fire Remnant и убирает неуязвимость\n При этом копии остаются использованными и Ember Spirit мгновенно перемещается к месту расположения последнего, когда он врывается",
        "Всегда сначала перемещается к самому дальнему Fire Remnant от выбранной точки",
        "Ember Spirit наносит урон врагам в радиусе 225 при движении и в радиусе 450 при достижении копии\n Враги получают урон только один раз за копию: либо в момент движения, либо при достижении копии Ember Spirit",
        "Уничтожает деревья в радиусе 200 единиц вокруг Ember Spirit при перемещении к копии\n Поскольку герой летит с высокой скоростью, часть деревьев может быть пропущена"
      ],
      "item_behaviour": [],
      "description": "Выбирает, к какой огненной копии переместиться",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,1+0,5",
        "Дальность применения: Глобальная",
        "Радиус урона копии: 450",
        "Урон: 100\/200\/300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Ember_Spirit_Activate_Fire_Remnant.mp3\/revision\/latest?cb=20191216013542",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Activate Fire Remnant",
      "cooldown": "100\/125\/150",
      "legacy_key": "R",
      "story": "Дух летит стремительно, словно голодное пламя пожара!"
    },
    {
      "notes": [
        "При изучении Fire Remnant Ember Spirit сразу получает все 3 заряда\n При первом приобретении <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter герой получит 2 заряда\n Повторное получение предмета зарядов не дает",
        "Копии движутся к выбранной области с увеличенной на 250% ( 500%) скоростью передвижения Ember Spirit\n Скорость фиксируется при использовании и не адаптируется",
        "Поскольку копия Fire Remnants существует 45 секунд, а время восстановления заряда составляет 38 ( 26) секунд, то одновременно можно установить 4 ( 4) ( 6,  6) копии",
        "Каждый раз, устанавливая копию Fire Remnant, Ember Spirit получает значок баффа, отображающий время жизни копии\n Значок баффа исчезает при истечении действия копии или при её использовании",
        "Fire Remnants видны всем\n Они не дают обзора и с их помощью нельзя разведать, что находится в тумане войны",
        "При истечении времени жизни Fire Remnants не наносят урона",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, копии Fire Remnants наносят 22,5 урона каждые 0,5 секунд, начиная спустя 0,5 после получения негативного эффекта\n Копии наносят урон с момента своего создания, то есть они начинают его наносить ещё только при полёте к точке, куда была применена способность\n Урон от нескольких копий не сочетается\n Может нанести до 2047,5 урона в радиусе 600 при всей длительности Источником урона считается Ember Spirit, а не копии\n Урон наносится аурой, её задержка составляет 0,5 секунд",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, убийство любого героя (включая клонов, исключая иллюзии и союзных героев) будет восстанавливать один заряд\n Это также случится если вражеский герой умрёт в радиусе 0,5 от Ember Spirit\n Добивание не считается\n Заряд восстановится даже в том случае, если вражеский герой имел воскрешение\n Если Ember Spirit умрёт, то он оставит на месте своей смерти Fire Remnant"
      ],
      "item_behaviour": [],
      "description": "Герой создаёт свою огненную копию, которая бежит к указанному месту со скоростью героя, умноженной на 250%. Использовав способность Activate Fire Remnant, герой быстро переместится по всем копиям в порядке близости, отчего они взорвутся и нанесут урон противникам. Выбранная копия будет конечной целью полёта.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,1+0,5",
        "Дальность применения: 1400 ( 3000)",
        "Скорость копии: 250% ( 500%)",
        "Длительность копии: 45",
        "Число зарядов: 3 ( 5)",
        "Время восстановления заряда: 38 ( 26)",
        "Радиус смерти врагов:  400",
        "Радиус урона:  600",
        "Урон в секунду:  45",
        "Задержка ауры урона:  0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9f\/Ember_Spirit_Fire_Remnant_1.mp3\/revision\/latest?cb=20191216013530",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: ",
        "Урон: "
      ],
      "mana": null,
      "aghanim": null,
      "name": "Fire Remnant",
      "cooldown": null,
      "legacy_key": "F",
      "story": "Сила духа не даёт учению Сина затухнуть."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 3.2,
    "attrAgility": 22.0
  },
  "description": "Ловкий и неуловимый Ember Spirit стремительно атакует всех врагов вокруг и связывает их горящими цепями. Он быстро перемещается по полю битвы с помощью своих взрывающихся копий, и немногие смогут избежать пламени или обуздать его.  Керри Побег Быстрый урон Контроль Инициация ★★☆",
  "history": "Крепость Непослушного пламени затеряна среди Скулящих гор, пусты её учебные залы, листвой и пылью застелены её дворы. На помосте в запечатанном храме стоит топазовый котёл, наполненный древним пеплом погребального костра воина-поэта Сина. Три поколения он обучал своих последователей технике Оков хранящего пламени — набору мантр для тренировки ума и тела, подготавливая их к суровой жизни за крепостной стеной. Преподавая путь воина, Син нажил себе воинов-врагов, и когда наступила осень его жизни, противники превзошли и убили его. Верные последователи разлетелись по миру, словно пепел. Года сменялись веками, последователи — потомками, но его учение передавалось тихим шёпотом из уст в уста. Тронутый многолетним наследием учителя, Горящий небожитель — пытливое проявление огня — бросился в крепость, и вновь воспламенил останки. Из раскалённых углей появился образ охваченного пламенем Сина. Он вновь готов невозмутимо обучать своей мудрости, и вновь готов дарить огонь познания всем, кто ищет наставления."
}