{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/48\/Maelstrom.mp3\/revision\/latest?cb=20141214010930",
      "effects": [
        "Шанс срабатывания: 30%",
        "Дистанция между отскоками: 650",
        "Количество отскоков: 4",
        "Интервал отскока: 0.25",
        "Урон: 140"
      ],
      "notes": [
        "Не сочетается с Chain Lightning от Mjollnir или других Maelstrom.",
        "При наличии нескольких предметов со способностью Chain Lightning, работать будет тот который был первым в инвентаре.",
        "Молнии отскакивают с интервалом в 0.25 секунды, так что поражение всех целей займёт 0.75 секунды.",
        "Не отскакивает на невидимых юнитов или юнитов в тумане войны.",
        "Никогда не может поразить одного юнита дважды за одно срабатывания.",
        "Может сработать только от успешных атак, не сработает на промахнувшихся атаках.",
        "Все отскоки в сумме нанесут до 560 урона (до уменьшений).",
        "Chain Lightning может сработать пока предыдущая еще отскакивает.",
        "Chain Lightning использует псевдо-случайное распределение.",
        "Бафф Maelstrom Chain спрятан и необходим для прыжков молний.",
        "Chain Lightning не использует обычную перезарядку. Она не отображается на иконке предмета при срабатывании, и не попадает под влияение эффектов манипулирующих перезарядкой."
      ],
      "mana": null,
      "abilityName": "Chain Lightning",
      "cooldown": null,
      "description": "Каждая атака с вероятностью в 30% может создать разряд цепной молнии, которая 4 раза перескочит между случайными врагами в радиусе 650, нанося каждому по 140 магического урона. От атаки с цепной молнией нельзя уклониться.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2700",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Javelin"
  ],
  "name": "Maelstrom",
  "description": "Молот Maelstrom, будучи кованным самими богами, позволяет своему владельцу подчинить силу молнии.",
  "trivia": null,
  "upgradeIn": [
    "Gleipnir",
    "Mjollnir"
  ],
  "tips": null
}