{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/58\/Clarity.mp3\/revision\/latest?cb=20141214192528",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "Двойное нажатие по предмету применит его на себя.",
        "Если цель находится на расстоянии дальше чем 500 единиц, заклинатель будет идти к цели до достижения расстояния в 250 единиц. При применении предмета на цель, которая уже находится в радиусе 500 единиц, заклинатель моментально использует Clarity.",
        "При применении предмета на цель, которая уже находится в радиусе 500 единиц, заклинатель моментально использует Clarity.",
        "Применяет только на героев (включая иллюзии) и крипов-героев.",
        "Владельцу не нужно поворачиваться к цели, чтобы использовать Clarity.",
        "Успешные применения на одну и ту же цель не складываются, но обновляют длительность.",
        "Восстанавливает до 180 маны за всю длительность.",
        "Урон свыше 0 от игрока (включая союзников, исключая себя) или Рошана развеет эффект. Эффект не будет развеян уроном, помеченным как отнимающий здоровье.",
        "Эффект не будет развеян уроном, помеченным как отнимающий здоровье."
      ],
      "mana": null,
      "abilityName": "Replenish",
      "cooldown": "0",
      "description": "Увеличивает восстановление маны выбранного существа на 6. Действует 30 сек. Восстановление прекращается, если получить урон от вражеского героя или Рошана.",
      "params": [
        "Базовая дальность применения: 250",
        "Дальность применения баффа: 500",
        "Доп. регенерация маны: 6",
        "Длительность: 30"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складывается с другими Clarity в инвентаре без ограничения. Стоимость за продажу варьируется от количества Clarity в ячейке.",
    "Clarity нельзя передавать, но можно применить на союзников."
  ],
  "cost": "50",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Clarity",
  "description": "Чистая вода, повышающая способность к медитации.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "При получении урона восстановление маны от Clarity прекращается, поэтому не используйте его во время боя. Однако в некоторых ситуациях стоит использовать его в бою. Даже одной секунды восстановления маны может быть достаточно, чтобы использовать ещё одну способность, которая поможет предотвратить смерть или закончить убийство.",
    "Однако в некоторых ситуациях стоит использовать его в бою. Даже одной секунды восстановления маны может быть достаточно, чтобы использовать ещё одну способность, которая поможет предотвратить смерть или закончить убийство."
  ]
}