{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "1,5 сек. невосприимчивости к магии от Sidekick",
          "talentRight": "1,5 сек. безмолвия от пульсации Unleash"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 к скорости передвижения",
          "talentRight": "+25% к вампиризму от Sidekick"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+200 к дальности применения и скачка у Rebound",
          "talentRight": "+0,5 сек. оглушения от Dispose"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+2 маны в секунду",
          "talentRight": "+5 к броне"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Marci_Dispose_1.mp3\/revision\/latest?cb=20211029201345",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Хоть способность и выглядит как действующая в ближнем бою, её дальность применения может быть увеличена другими бонусами к дальности применения. Однако она не подвержена действию бонусов к дальности атаки.",
        "Передвигает цель над головой Marci по дуге высотой в 150 единиц. Бросок всегда занимает 0,5 сек. Цель полностью обезврежена во время броска и всегда приземляется на расстоянии в 350 за спиной Marci, так что дистанция броска зависит от местонахождения цели. С учётом длительности броска и оглушения пораженный враг обезвреживается на 1,4\/1,8\/2,2\/2,6 (TagTalent 1,9\/2,3\/2,7\/3,1) сек.",
        "Цель полностью обезврежена во время броска и всегда приземляется на расстоянии в 350 за спиной Marci, так что дистанция броска зависит от местонахождения цели.",
        "С учётом длительности броска и оглушения пораженный враг обезвреживается на 1,4\/1,8\/2,2\/2,6 (TagTalent 1,9\/2,3\/2,7\/3,1) сек.",
        "Урон и оглушение применяются во время приземления на врагов и на цель, если она была враждебной. Бросаемые союзники не попадают под этот эффект. Dispose сперва применяет оглушение, а потом — урон.",
        "Dispose сперва применяет оглушение, а потом — урон.",
        "Можно применить на Рошана, но не передвинуть его. Область нанесения урона и оглушения мгновенно применяется вокруг Рошана.",
        "Бросок можно прервать лишь смертью или другими источниками принудительного движения. При прерывании область урона и оглушения преждевременно применяется на текущее местоположение существа.",
        "При прерывании область урона и оглушения преждевременно применяется на текущее местоположение существа.",
        "Нельзя применить на курьера, варды, постройки и неуязвимых существ."
      ],
      "mana": "90",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10",
      "description": "Герой хватает союзное или вражеское существо и легко перебрасывает его через себя, нанося урон врагам в области приземления и оглушая их. Если целью был враг, он тоже тоже получит урон и будет оглушён.",
      "spellName": "Dispose",
      "params": [
        "Анимация применения: 0,2+1,04",
        "Дальность применения: 175",
        "Радиус приземления: 275",
        "Дальность приземления: 350",
        "Урон от приземления: 70\/120\/170\/220",
        "Длительность броска: 0,5",
        "Длительность оглушения: 0,9\/1,3\/1,7\/2,1 (TagTalent 1,4\/1,8\/2,2\/2,6)",
        "Можно применить на союзников с иммунитетом к заклинаниям. Нельзя применить на врагов с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4a\/Marci_Rebound_1.mp3\/revision\/latest?cb=20211029201355",
      "effects": [
        "Способность Направленная на существо \/ Направленная по вектору",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Marci мчится к цели со скоростью в 2000. Может проходить сквозь непроходимый ландшафт и деревья.",
        "Запускает снаряд при применении и периодически перемещает Marci к нему. Визуальные эффекты вокруг Marci исходят от этого снаряда.",
        "Если расстояние между целью и Marci станет больше чем текущая дальность заклинания +700 единиц, то рывок остановится. Однако сам снаряд не останавливается. Если повторно применить способность до того, как снаряд достигнет цели, то скачок от нового применения сработает раньше.",
        "Однако сам снаряд не останавливается. Если повторно применить способность до того, как снаряд достигнет цели, то скачок от нового применения сработает раньше.",
        "При достижении цели Marci отскакивает в выбранном направлении, поворачиваясь лицом к этому направлению. Скачок имеет минимальную длительность в 0,1 и максимальную в 0,2 сек., а также минимальную высоту в 200 и максимальную в 250.",
        "Скачок имеет минимальную длительность в 0,1 и максимальную в 0,2 сек., а также минимальную высоту в 200 и максимальную в 250.",
        "Во время рывка и скачка Marci полностью обезврежена.",
        "Если выбранное существо является союзником, оно получит бонус в 35% к скорости передвижения. Выбранные враги не получают ни дебаффа, ни урона.",
        "Marci не приземляется в центре области эффекта. Вместо этого она приземляется на расстоянии в 64 от центра в сторону, откуда она прыгала. Вместе со смещением позиции и расстоянием скачка, фактические минимальное и максимальное расстояния равны соответственно 386 — 736 (TagTalent 936). Это значит, что радиус урона и замедления всегда расположен на расстоянии в 64 перед Marci при приземлении.",
        "Вместе со смещением позиции и расстоянием скачка, фактические минимальное и максимальное расстояния равны соответственно 386 — 736 (TagTalent 936).",
        "Это значит, что радиус урона и замедления всегда расположен на расстоянии в 64 перед Marci при приземлении.",
        "Рывок можно прервать лишь смертью или другими источниками принудительного движения. Скачок можно прервать лишь другими источниками принудительного движения. Если способность прерывается в любой момент, то она полностью отменяется.",
        "Скачок можно прервать лишь другими источниками принудительного движения.",
        "Если способность прерывается в любой момент, то она полностью отменяется.",
        "Rebound сперва применяет урон, а потом замедление по области.",
        "Нельзя применить на курьера, варды, постройки и неуязвимых существ."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "W",
      "cooldown": "17\/15\/13\/11",
      "description": "Герой сближается с выбранной целью и отскакивает от неё в указанном направлении на выбранное расстояние. Оттолкнувшись от цели способности, герой прыгает в выбранную область, нанося урон всем врагам в ней и замедляя их. Если оттолкнуться от союзника, он получит +35% к скорости передвижения на 5 сек.",
      "spellName": "Rebound",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 800 (TagTalent 1000)",
        "Мин. дальность скачка: 450",
        "Макс. дальность скачка: 800 (TagTalent 1000)",
        "Смещение позиции приземления: 64",
        "Радиус приземления: 325",
        "Урон от приземления: 90\/160\/230\/300",
        "Замедление скорости передвижения от приземления: 30%\/40%\/40%\/60%",
        "Бонус к скорости передвижения союзникам: 35%",
        "Длительность замедления: 3",
        "Длительность баффа: 5",
        "Можно применить на любое существо с иммунитетом к заклинаниям. Можно применить бафф на врагов с иммунитетом к заклинаниям. Не действует на врагов с иммунитетом к заклинаниям в области.",
        "Не провоцирует ни блокировку заклинаний, ни отражение заклинаний.",
        "Если способность избежали, Marci останавливается в последней точке цели до избегания.",
        "Нельзя применить в оцепенении. Получение эффекта оцепенения после применения не отменит способность."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a2\/Marci_Sidekick.mp3\/revision\/latest?cb=20211029201400",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя \/ Союзных героев"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически выбирает себя. При применении на себя, Sidekick ищет близлежащего союзника в радиусе 700 вокруг Marci. Если союзник не был найден, то Marci получит эффект как обычно. Остаточная анимация в 0,54 используется только в том случае, если в радиусе поиска есть союзник. Применение на себя не имеет остаточной анимации. Эффекты, увеличивающие дальность применения, также увеличивают и радиус поиска.",
        "При применении на себя, Sidekick ищет близлежащего союзника в радиусе 700 вокруг Marci. Если союзник не был найден, то Marci получит эффект как обычно.",
        "Остаточная анимация в 0,54 используется только в том случае, если в радиусе поиска есть союзник. Применение на себя не имеет остаточной анимации.",
        "Эффекты, увеличивающие дальность применения, также увеличивают и радиус поиска.",
        "Способность можно применять на союзных героев. Эффект может действовать только на союзных героев, включая иллюзии, клонов и крипов-героев.",
        "Даёт обычную прямую прибавку к дополнительному урону.",
        "Аддитивно сочетается с другими источниками вампиризма. Не излечивается от построек или союзных существ. Может излечивать от вардов, которые не требуют фиксированного количества атак для уничтожения.",
        "Не излечивается от построек или союзных существ.",
        "Может излечивать от вардов, которые не требуют фиксированного количества атак для уничтожения.",
        "С талантом 25-го уровня, Sidekick также применяет базовое развеивание и даёт иммунитет к заклинаниям Marci и союзнику. Дающийся иммунитет к заклинаниям не применяет развеивание от иммунитета к заклинаниям. Поэтому определённые дебаффы (например Pounce), которые можно развеять только иммунитетом к заклинаниям не убираются. Sidekick сперва применяет бафф способности, а после этого бафф иммунитета к заклинаниям.",
        "Дающийся иммунитет к заклинаниям не применяет развеивание от иммунитета к заклинаниям. Поэтому определённые дебаффы (например Pounce), которые можно развеять только иммунитетом к заклинаниям не убираются.",
        "Sidekick сперва применяет бафф способности, а после этого бафф иммунитета к заклинаниям."
      ],
      "mana": "45\/40\/35\/30",
      "hotKey": "E",
      "cooldown": "36\/28\/20\/12",
      "description": "Преданность владельца способности помогает ему и выбранному союзнику выживать в бою, наделяя их бонусным вампиризмом и уроном от атак.",
      "spellName": "Sidekick",
      "params": [
        "Анимация применения: 0+0,54",
        "Дальность применения: 700",
        "Радиус поиска союзника: 700",
        "Дополнительный урон: 20\/35\/50\/65",
        "Вампиризм: 35%\/40%\/45%\/50% (TagTalent 60%\/65%\/70%\/75%)",
        "Длительность баффа: 6",
        "Длительность невосприимчивости к магии: 1,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e6\/Marci_Unleash_1.mp3\/revision\/latest?cb=20211029201402",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При применении, применяет базовое развеивание на Marci.",
        "Когда активирована, Unleash разблокирует максимальную скорость атаки и убирает ограничение в 700 скорости атаки для Marci. Бонус в 700\/975\/1325 скорости атаки даётся только при наличии эффекта ярости. Заряд удара расходуется, когда атака была выполнена, промахнувшиеся атаки также тратят заряды. Количество оставшихся ударов отображается в иконке эффекта и над Marci. Бафф и визуальные эффекты способности видны всем.",
        "Бонус в 700\/975\/1325 скорости атаки даётся только при наличии эффекта ярости.",
        "Заряд удара расходуется, когда атака была выполнена, промахнувшиеся атаки также тратят заряды.",
        "Количество оставшихся ударов отображается в иконке эффекта и над Marci. Бафф и визуальные эффекты способности видны всем.",
        "При завершении комбинации ярости, Unleash выпускает пульсацию вокруг атакуемой цели в последнюю атаку и убирает бафф ярости. Эта пульсация наносит 60\/130\/200 урона в радиусе, замедляя и обезмолвливая врагов. Атака выпускающая пульсацию сперва применяет дебафф от пульсации, потом урон от пульсации, потом безмолвие, и только после этого урон от атаки.",
        "Эта пульсация наносит 60\/130\/200 урона в радиусе, замедляя и обезмолвливая врагов.",
        "Атака выпускающая пульсацию сперва применяет дебафф от пульсации, потом урон от пульсации, потом безмолвие, и только после этого урон от атаки.",
        "После начала комбинации ярости, все атаки должны быть выполнены в течении 1 секунды, иначе комбинация прекращается и бафф ярости теряется.",
        "После потери эффекта ярости любым способом, применяется дебафф перезарядки ярости. Если комбинация ярости была выполнена успешно, базовая частота атаки Marci устанавливается на фиксированные 2 секунды на оставшееся время дебаффа. Это предотвращает героя от выполнения атак на 2 секунды после последнего удара. Фиксированная частота атаки исчезает вместе с началом следующих ударов ярости, фактически запрещая атаковать на 1,75 сек. Если перезарядка ярости была применена прекращением комбинации, то базовая частота атаки героя не будет изменена и Marci сможет атаковать как обычно.",
        "Если комбинация ярости была выполнена успешно, базовая частота атаки Marci устанавливается на фиксированные 2 секунды на оставшееся время дебаффа. Это предотвращает героя от выполнения атак на 2 секунды после последнего удара.",
        "Фиксированная частота атаки исчезает вместе с началом следующих ударов ярости, фактически запрещая атаковать на 1,75 сек.",
        "Если перезарядка ярости была применена прекращением комбинации, то базовая частота атаки героя не будет изменена и Marci сможет атаковать как обычно.",
        "Как только дебафф перезарядки исчезает, она снова получает бафф ярости с установленными 3\/4\/5 зарядами. Это продолжается неопределённое количество времени, пока активна Unleash, нет никакого ограничения на получаемое количество баффов ярости.",
        "Это продолжается неопределённое количество времени, пока активна Unleash, нет никакого ограничения на получаемое количество баффов ярости."
      ],
      "mana": "100\/125\/150",
      "hotKey": "R",
      "cooldown": "110\/90\/70",
      "description": "Герой обращается к своей скрытой силе и получает заряды ярости, позволяющие стремительно наносить удары. Последний удар в каждой комбинации ярости создаёт вокруг цели пульсацию, которая наносит урон врагам и замедляет их передвижение и атаку на 2 сек. Совершив комбинацию ярости, герой не может атаковать в течение 1,75 сек. При применении этой способности герой применяет на себя простое развеивание и получает +15% к скорости передвижения.",
      "spellName": "Unleash",
      "params": [
        "Анимация применения: 0,2+0,34",
        "Бонус к собственной скорости передвижения: 15%",
        "Ударов за заряд ярости: 3\/4\/5",
        "Бонус к скорости атаки от ярости: 700\/975\/1325",
        "Окно между ударами ярости: 1",
        "Перезарядка ярости: 1,75",
        "Радиус пульсации: 800",
        "Урон от пульсации: 60\/130\/200",
        "Замедление скорости передвижения от пульсации: 30%",
        "Замедление скорости атаки от пульсации: 60\/80\/100",
        "Длительность дебаффа от пульсации: 2",
        "Длительность: 16",
        "Длительность безмолвия от пульсации: 1,5",
        "Можно применять в иммунитете к заклинаниям. Атаки против существ с иммунитетом к заклинаниям целиком учитываются. Пульсация не действует на врагов с иммунитетом к заклинаниям.",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 23.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.4,
    "attrAgility": 20.0
  },
  "description": "Marci — это герой с ближним типом атаки, основным атрибутом которой является сила. Доказывая, что неиссякаемая верность даёт несравненную силу, Марси всегда готова вступить в битву и не жалеет кулаков, чтобы защитить своих компаньонов. Легко перебрасывая друзей и врагов по полю боя, она с радостью врывается в любой поединок, предоставляет союзникам столь нужное преимущество и применяет скрытую силу, при виде которой даже боги предпочитают не вступать в конфликт с героиней.",
  "history": "У Марси много обожателей, но о её происхождении известно немногим. Обычно она сопровождает в пути принцессу Мирану, но корни их дружбы сплетены в таких секретах, которые ни одна из них не раскроет без надобности. Для союзников она — беспощадная и честная защитница. Для противников же — бесстрашное препятствие на пути к тем, кого она считает другом. Неразумные оппоненты могут счесть её телосложение невыдающимся, но внутренняя сила наделяет удары Марси невероятной мощью. Она истребит всех, кто решит встать у неё на пути, но до последнего вздоха будет хладнокровной сторонницей того, кто заслужит её доверие.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "1,5 сек. невосприимчивости к магии от Sidekick",
      "talentRight": "1,5 сек. безмолвия от пульсации Unleash"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 к скорости передвижения",
      "talentRight": "+25% к вампиризму от Sidekick"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+200 к дальности применения и скачка у Rebound",
      "talentRight": "+0,5 сек. оглушения от Dispose"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+2 маны в секунду",
      "talentRight": "+5 к броне"
    }
  ]
}