{
  "abilities": [
    {
      "notes": [
        "Во время рывка Faceless Void движется со скоростью 3000",
        "Во время действия этой способности Faceless Void неуязвим",
        "Не даёт возможность избежать снаряда",
        "Не перемещает на полную дистанцию при выборе точки, находящейся ближе, чем максимальная дистанция",
        "При использовании отменяет любой урон, полученный Faceless Void за последние 2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2,5) секунды, возвращая здоровье. Также учитывается урон, нанесенный союзниками. Так как это эффект лечения, то на него действует манипуляция лечением",
        "Отменяет только 3 типа урона. Лечение и отнимание здоровья не отменяются. То есть нельзя отменить  Sunder,  False Promise,  Soul Ring и  Armlet of Mordiggian",
        "Не влияет на баффы и дебаффы, перезарядки и ману",
        "С  Aghanim's Scepter применяет  Time Lock в радиусе 400 на всех врагов в конечной точке. Не совершает мгновенные атаки для активации Time Lock. Вместо этого на врагов накладывается модификатор, который активирует способность. Развеивание дебаффа не убирает оглушение от Time Lock, но предотвращает мгновенную атаку от способности"
      ],
      "item_behaviour": [],
      "description": "Совершает рывок к указанной точке и восстанавливает здоровье, потерянное за последние 2 секунды.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: Глобальная",
        "Дальность перемещения: 650\/700\/750\/800 ( 800\/850\/900\/950)",
        "Время отмены урона: 2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2,5)",
        "Радиус применения Time Lock:  400"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Faceless_Void_Time_Walk.mp3\/revision\/latest?cb=20191216013832",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя ",
        "Урон: "
      ],
      "mana": "24\/18\/12\/6 (TagTalent 23\/17\/11\/5)",
      "aghanim": null,
      "name": "Time Walk",
      "cooldown": "40",
      "legacy_key": "W",
      "story": "Дарктеррор разрывает ткань времени, проходя через Класзурем и мгновенно возвращаясь назад."
    },
    {
      "notes": [
        "Действует на невидимых существ и существ в тумане войны, но не на неуязвимых или спрятанных",
        "Под действием дебаффа заставляет перезаряжаться вражеские способности на 60% дольше. Не влияет на время перезарядки предметов. Влияет на перезарядку пассивных способностей",
        "Способности, имеющие заряды, также будут перезаряжаться на 60% дольше, однако владельцы этих способностей не будут подвержены никаким негативным эффектам Time Dilation за восстановление заряда",
        "Наносит урон с интервалами в 1,1 секунды, начиная спустя 1,1 секунду после наложения дебаффа, в результате срабатывая до 7\/8\/9\/10 раз",
        "Далее показано, как много урона будет нанесено жертве и как сильно она будет замедлена в зависимости от количества перезаряжающихся способностей: 1 перезаряжающаяся способность: 49\/72\/99\/130 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 91\/120\/153\/190) урона и 10% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 20%) замедления скорости передвижения. 2 перезаряжающихся способностей: 98\/144\/198\/260 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 182\/240\/306\/380) урона и 20% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 40%) замедления скорости передвижения. 3 перезаряжающихся способностей: 147\/216\/297\/390 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 273\/360\/459\/570) урона и 30% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 60%) замедления скорости передвижения. 4 перезаряжающихся способностей: 196\/288\/396\/520 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 364\/480\/612\/760) урона и 40% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 80%) замедления скорости передвижения. 5 перезаряжающихся способностей: 245\/360\/495\/650 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 455\/600\/765\/950) урона и 50% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 100%) замедления скорости передвижения. 6 перезаряжающихся способностей: 294\/432\/594\/780 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 546\/720\/918\/1140) урона и 60% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 120%) замедления скорости передвижения.",
        "Выбор <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантов на увеличение урона в секунду и усиление замедления не обновляют значение на уже подверженных способности врагах",
        "Замедление и урон не имеют лимита складывания. Каждая способность на перезарядке добавляет эффект. Также считает спрятанные способности (такие как использованные во время  Morph или  призванные способности Invoker). Способности, использованные при помощи  Spell Steal, уже находящиеся на перезарядке и потерянные, не будут увеличивать количество эффектов, так как они не спрятаны, а убраны",
        "Дебафф замедления непрерывно проверяет все перезарядки и мгновенно адаптирует под них свое значение замедления",
        "Перезарядка способностей может быть сброшена ( Refresher Orb) под эффектом от Time Dilation",
        "Несколько использований Time Dilation не складываются, но обновляют длительность"
      ],
      "item_behaviour": [],
      "description": "Накладывает на окружающих врагов временнóе поле, продлевая перезарядку их способностей на 8\/9\/10\/11 секунд. Каждая поражённая способность замедляет передвижение и атаку жертвы на 10% и наносит ежесекундный урон.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,1+0,4",
        "Радиус: 775",
        "Замедление перезарядки: 60%",
        "Замедление за способность: 10% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 20%)",
        "Урон в секунду за способность: 7\/9\/11\/13 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 13\/15\/17\/19)",
        "Длительность: 8\/9\/10\/11"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Faceless_Void_Time_Dilation_1.mp3\/revision\/latest?cb=20191216013829",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "28\/24\/20\/16",
      "aghanim": null,
      "name": "Time Dilation",
      "cooldown": "60\/70\/80\/90",
      "legacy_key": "R",
      "story": "Для тех, кто сражается с Дарктеррором, каждый миг тянется вечность."
    },
    {
      "notes": [
        "Не сочетается с остальными источниками оглушающего удара. Оглушение от  Skull Basher и  Abyssal Blade отключено для Faceless Void",
        "При срабатывании применяется оглушающий дебафф. Спустя 0,4 секунды наносится вторая атаки и урон. Урон наносится отдельным источником и считается уроном заклинания. Он не добавляется к основному урону. То есть на него действует вампиризм заклинаний и усиление урона заклинаний, но не вампиризм, критический или прорубающий удар. Вторая атака — мгновенная, также активирующая модификаторы атаки. То есть она также может активировать свою же способность. Сначала применяет мгновенную атаку, затем урон Time Lock",
        "Несмотря на визуальный эффект, угол второй атаки продолжает основываться на позиции Faceless Void, поэтому прорубание поражает те цели, что находится герой, а не возникает иллюзия",
        "Имеет шанс в 13,27%\/18,15%\/23,2%\/28,38% сработать один или два раза при одной атаке. В среднем добавляется 13%\/18%\/23%\/28% урона от атаки + 1,99\/3,63\/5,8\/8,51 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 11,28\/16,34\/22,04\/28,38) магического урона при каждой атаке. Хотя способность может сработать более, чем 2 раза за один удар, вероятность этого экспоненциально снижается, практически не влияя на средний урон",
        "Сработавшая атака сначала применяет дебафф, а затем наносит урон",
        "Time Lock действует на союзных существ, но не на варды и постройки",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Талант на повышение урона мгновенно обновляет значения на уже сработавшие Time Lock",
        "Time Lock использует псевдослучайное распределение"
      ],
      "item_behaviour": [],
      "description": "Атака может остановить время для вражеского существа, отчего оно получает ещё один удар.",
      "hot_key": "E",
      "params": [
        "Шанс срабатывания: 12%\/16%\/20%\/24%",
        "Доп. урон: 15\/20\/25\/30 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 85\/90\/95\/100)",
        "Задержка второй атаки: 0,4",
        "Длительность на героях: 0,65",
        "Длительность на крипах: 2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Faceless_Void_Time_Lock.mp3\/revision\/latest?cb=20191216013831",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Time Lock",
      "cooldown": null,
      "legacy_key": "E",
      "story": "Удары Дарктеррора способны выбить противника в другое измерение."
    },
    {
      "notes": [
        "Требуется  Aghanim's Shard для разблокировки. Подспособности автоматически получаются (при использовании  Spell Steal и  Morph) вместе с основной способностью. Если заклинатель не будет иметь  Aghanim's Shard, то использование подспособности не будет иметь никакого эффекта",
        "Подспособность остаётся неактивной, пока не была использована  Time Walk. Она снова становится неактивной спустя 1,5 после использования Time Walk. Всегда становится неактивной после использования. Подпособность становится активной только после успешного достижения конечной точки Time Walk. Если Time Walk был прерван (например, из-за применения  Recall, то способность не будет активной",
        "При применении перемещает Faceless Void в начальную точку использования Time Walk, используя ту же скорость перемещения",
        "Не возвращает ничего больше. Здоровье остаётся прежним,  Time Lock оглушение от улучшения не срабатывает",
        "Если было использовано несколько Time Walk в течение 1,5 секунд, то возврат произойдет к первому использованному"
      ],
      "item_behaviour": [],
      "description": "Эту способность можно применить в течение 1,5 сек. после Time Walk, чтобы вернуться на прежнюю позицию. Возвращение не влияет на здоровье героя и не применяет на врагов Time Lock от Aghanim's Scepter.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Время возможности отмены Time Walk: 1,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Faceless_Void_Time_Walk.mp3\/revision\/latest?cb=20191216013832",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "0,5",
      "aghanim": null,
      "name": "Reverse Time Walk",
      "cooldown": "0",
      "legacy_key": "D",
      "story": null
    },
    {
      "notes": [
        "Chronosphere действует на всех существ, которые не находятся под контролем Faceless Void, включая постройки, варды и союзников",
        "Не действует на курьеров, спрятанных существ и неуязвимых героев. На всех остальных неуязвимых существ способность действует. Мгновенно разрушает  Homing Missile и жуков от  The Swarm. Мгновенно возвращает уже зацепившихся  фантомов и замораживает запущенных фантомов",
        "В Chronosphere на Faceless Void и подконтрольных ему существ действует ускорение (и их нельзя замедлить ниже установленного значения) и сквозное передвижение. С <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом 20-ого уровня также повышает скорость атаки всех существ на 95. <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Талант на повышение скорости атаки мгновенно улучшает все существующие сферы, но не обновляет баффы на находящихся в них существах. Это значит, что уже находящимся в них существах необходимо перезайти в сферу, чтобы получить бонус к скорости атаки",
        "Иллюзии Faceless Void (подконтрольные ему, созданные союзниками или противниками) никогда не обезвреживаются любой Chronosphere. При этом скорость передвижения и сквозное передвижение дается только использовавшему способность и его подконтрольным существам",
        "Дает летающий обзор и эффект True Sight в области действия на всю длительность",
        "Затронутые существа оглушаются. Когда остальные существа входят в область, они также оглушаются на оставшуюся длительность",
        "Отменяет большинство источников принудительного движения при применении обезвреживающего дебаффа к существу",
        "Существ можно вытащить из Chronosphere некоторыми заклинаниями. Однако следующие предметы и способности этого сделать не могут:  Force Staff,  Hurricane Pike,  Psychic Headband,  Telekinesis,  Snowball,  Dispose и  Geomagnetic Grip этого сделать не могут",
        "Вопреки визуальным эффектам, область действия — цилиндр, а не сфера"
      ],
      "item_behaviour": [],
      "description": "Создаёт сферу, в которой застывают пространство и время. Она останавливает всё внутри себя, а её владелец и подконтрольные ему существа передвигаются в ней с увеличенной скоростью. Внутри сферы раскрывается невидимость врагов.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,35+0,35",
        "Дальность применения: 500",
        "Радиус: 500 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 640)",
        "Скорость передвижения в сфере: 1000",
        "Длительность: 4\/4,5\/5",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Бонус к скорости атаки:  95"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/03\/Faceless_Void_Chronosphere.mp3\/revision\/latest?cb=20191216013838",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов \/ Союзников"
      ],
      "mana": "160\/150\/140",
      "aghanim": null,
      "name": "Chronosphere",
      "cooldown": "150\/225\/300",
      "legacy_key": "C",
      "story": "Когда открывается проход в Класзурем, все оказавшиеся в нём бедняги вряд ли смогут вернуться назад."
    },
    {
      "notes": [
        "Дает Faceless Void шанс полностью избежать урона",
        "Backtrack относится к группе эффектов, отрицающих урон. Способность не относится к уклонению. То есть она лишь отрицает урон, а не уклоняется от любых побочных эффектов (например оглушений) от заклинаний или атак. При срабатывании Backtrack на атаки с эффектом сжигания маны избегается лишь урон, а мана все равно сжигается. Также это означает, что атаки с эффектом True Strike и точность не мешают Backtrack избегать урона. У уклонения приоритет выше, чем у Backtrack. При срабатывании уклонения Backtrack на эту атаку не срабатывает",
        "У Backtrack третий высочайший приоритет в группе эффектов, отрицающих урон. То есть в комбинации с <span image=\"images\/Aphotic_Shield.webp\">Aphotic_Shield<\/span> Aphotic Shield или  Living Armor Bactrack отрицает урон, в то время, как способности этого не делают",
        "Вместе с всеми эффектами, манипулирующими уроном, Bactrack может отрицать все 3 типа урона. В среднем усиливает эффективное здоровье Faceless Void на 25%",
        "Игнорирует урон, помеченный как отнимающий здоровье",
        "Backtrack использует псевдослучайное распределение"
      ],
      "item_behaviour": [],
      "description": "Позволяет полностью избежать урона с вероятностью в 20%. Отключается истощением.",
      "hot_key": "",
      "params": [
        "Шанс срабатывания: 20%"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Backtrack",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 20.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.0,
    "attrAgility": 19.0
  },
  "description": "Может остановить время для врагов Для Faceless Void важна каждая секунда. Он стремительно перемещается, ускорив ход времени, а затем, манипулируя им, уклоняется от ударов, останавливает его на большой территории и уничтожает замерших врагов. Имея в своём распоряжении достаточно времени, он становится невероятно могучим.  Керри Инициация Контроль Побег Стойкость ★★☆",
  "history": "Безликий ужас Faceless Void по имени Дарктеррор — гость из Класзурема — другой реальности, расположенной вне времени. До сих пор непонятно, зачем такое могущественное существо принимает участие в боях в нашем мире. Возможно, какие-то события, происходящие в этом плане, способны повлиять на великую войну за камни Немезиды. Время ничего не значит для Дарктеррора, поэтому он без проблем способен обратить его во вред врагам или на помощь себе и союзникам. Его уникальные способности не способны полностью раскрыться в нашем мире, однако Void черпает силы прямо из космоса, что делает его крайне опасным противником в бою."
}