{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на броню не дается иллюзиям.",
        "Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.",
        "Талант на силу в общем даёт Outworld Devourer: 400 здоровья и 2 регенерации здоровья.",
        "Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.",
        "Талант вампиризма заклинаний лечит на 0,32% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+20% к вампиризму заклинаниями",
          "talentRight": "+1,6% к урону от Arcane Orb"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0,1 к множителю разницы в мане у Sanity's Eclipse",
          "talentRight": "+20 к силе"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+6 к броне",
          "talentRight": "+250 к мане"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости атаки",
          "talentRight": "+200 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Outworld_Devourer_Arcane_Orb_1.mp3\/revision\/latest?cb=20191216021430",
      "effects": [
        "Способность Направленная на юнита \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Дополнительный урон наносится отдельным источником урона и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Наносит урон до урона атаки, но всё еще зависит от попадания атаки по цели.",
        "Проверяет запас маны Outworld Devourer до попадания снаряда, поэтому увеличение или уменьшение запаса маны в момент, пока снаряд летит, повлияет на его урон."
      ],
      "mana": "110\/140\/170\/200",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "Герой наполняет атаки дополнительным чистым уроном, зависящим от текущего запаса маны.",
      "spellName": "Arcane Orb",
      "params": [
        "Дальность применения: 450",
        "Текущей маны в урон: 7,5%\/9%\/10,5%\/12% (TagTalent 9,1%\/10,6%\/12,1%\/13,6%)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Знания Внемирья позволяют Предвестнику перехватывать потоки духовной энергии и перенаправлять их на себя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Outworld_Devourer_Astral_Imprisonment.mp3\/revision\/latest?cb=20191216021424",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "Astral Imprisonment обезвреживает цель и делает её неуязвимой и скрытой на всё время действия.",
        "Урон применяется в конце действия и также наносится заключенному существу, если оно — враг.",
        "Красное кольцо, расширяющееся в центре визуального эффекта, показывает стандартную длительность заточения. Его видят только союзники. Кольцо не адаптируется к изменению длительности, вызванному сопротивлением эффектам.",
        "Кольцо не адаптируется к изменению длительности, вызванному сопротивлением эффектам.",
        "Функция \"Без помощи\" не позволяет союзному Outworld Devourer использовать эту способность на вашего героя."
      ],
      "mana": "140\/160\/180\/200",
      "hotKey": "W",
      "cooldown": "24\/20\/16\/12 (TagTalent 0)",
      "description": "Помещает выбранное существо в астральное заточение, где оно неуязвимо и неактивно. По окончании эффекта происходит взрыв, наносящий урон цели и врагам в радиусе 400 вокруг цели. Даёт один заряд способности Sanity's Eclipse.",
      "spellName": "Astral Imprisonment",
      "params": [
        "Анимация применения: 0,25+0,4",
        "Дальность применения: 225\/300\/375\/450 (TagAghanim 525\/600\/675\/750)",
        "Радиус урона: 400",
        "Урон: 100\/175\/250\/325",
        "Длительность заточения: 4",
        "Максимально зарядов: 0 (TagAghanim 2)",
        "Время восстановления заряда: 0 (TagAghanim 12)"
      ],
      "itemBehaviour": [
        "(Aghanim%27s_Scepter_symbol)^Может быть улучшена с помощью Aghanim's Scepter\nПерезарядка этой способности заменяется зарядами\nУрон от неё складывается."
      ],
      "legacyKey": "T",
      "story": "Запертые в карманном измерении на границе с Внемирьем, жертвы осознают свою смертность и ничтожность своих знаний."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bd\/Outworld_Devourer_Essence_Flux_1.mp3\/revision\/latest?cb=20191216021426",
      "effects": [
        "Способность Ненаправленная \/ Пассивная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Outworld Devourer.",
        "Накладывает дебафф замедления после урона, активировавшего его.",
        "Пассивная часть восстанавливает ману после применения заклинания.",
        "Essence Flux не срабатывает от способностей предметов.",
        "Essence Flux использует псевдослучайное распределение.",
        "В среднем восстанавливает 5%\/7,5%\/10%\/12,5% от максимальной маны заклинателя за применение."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "25",
      "description": "Каждое применение способности может восстановить долю от максимального запаса маны. При применении способности будут замедлять задетых врагов.",
      "spellName": "Essence Flux",
      "params": [
        "Шанс восстановления маны: 25%",
        "Восстановление маны от максимального запаса маны: 20%\/30%\/40%\/50%",
        "Замедление передвижения при активации: 11%\/22%\/33%\/44%",
        "Длительность замедления: 1,75",
        "Длительность баффа: 6"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Внемирье тонет в магической энергии, которая иногда может просачиваться сквозь порталы Предвестника."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Outworld_Devourer_Sanity%27s_Eclipse.mp3\/revision\/latest?cb=20191216021429",
      "effects": [
        "Способность Направленная на область",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Дает 1 заряд за попадание Arcane Orb в вражеского героя или иллюзию.",
        "Дает 3 заряда за применение Astral Imprisonment на вражеского героя или иллюзию.",
        "Число зарядов видно в иконке баффа Outworld Devourer. Описание сообщает о количестве полученной маны.",
        "Получение нового заряда обновляет длительность существующих.",
        "Outworld Devourer сохраняет текущее соотношение маны при получении или потере зарядов.",
        "При применении урон рассчитывается от максимального запаса маны Outworld Devourer и пораженных врагов, а не от текущего.",
        "Урон наносится только вражеским героям и иллюзиям. Другие существа способностью игнорируются.",
        "Влияет на существ под действием Astral Imprisonment, но игнорирует неуязвимых или спрятанных существ."
      ],
      "mana": "200\/325\/450",
      "hotKey": "R",
      "cooldown": "160",
      "description": "Вызывает ментальный взрыв, который наносит урон, зависящий от разницы в мане между жертвами и самим героем. Действует на врагов под действием способности Astral Imprisonment. Счётчик зарядов Sanity's Eclipse пассивно увеличивает максимальную ману владельца за каждый заряд. За попадание способностью Arcane Orb даётся 1 заряд, за применение Astral Imprisonment на героя — 3 заряда. Каждый заряд обновляет время действия счётчика.",
      "spellName": "Sanity's Eclipse",
      "params": [
        "Анимация применения: 0,25+0,4",
        "Дальность применения: 700",
        "Радиус: 375\/475\/575",
        "Базовый урон: 150\/250\/350",
        "Множитель разницы в мане: 0,4 (TagTalent 0,5)",
        "Зарядов за попадание Arcane Orb: 1",
        "Зарядов за применение Astral Imprisonment: 3",
        "Маны за заряд: 40\/50\/60",
        "Длительность заряда: 35"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Кристалл из Внемирья разбивается, выпуская на волю разрушительную энергию, отголоски которой ощущаются и в других мирах."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 21.0,
    "attrIntelligence": 30.0,
    "attrIntelligenceInc": 4.2,
    "attrAgilityInc": 2.1,
    "attrAgility": 24.0
  },
  "description": "Outworld Devourer — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность Arcane Orb уникальный модификатор атаки добавляющий к атакам Outworld Devourer дополнительный чистый урон, пропорциональный текущему запасу маны. Наносит дополнительный урон призванным существам и иллюзиям. Второй способностью Astral Imprisonment помещает вражеского или союзного героя в астрал. Герой в астрале неуязвим и неактивен. Пассивная способность Essence Aura восстанавливает часть маны, когда находящиеся неподалеку союзники или сам Outworld Devourer используют заклинания. Также Outworld Devourer пассивно получает бонус к базовому запасу маны. Некоторые способности без перезарядки и переключаемые способности не вызывают срабатывание ауры. Ультимативная способность Sanity's Eclipse вызывает взрыв, который наносит вражеским героям урон, зависящий от разницы в интеллекте между жертвами и самим Outworld Devourer. Если эта разница больше определенного порога, жертва потеряет 40% своей маны. Если же уровень интеллекта больше или равен тому, что у Outworld Devourer, то способность не возымеет никакого действия. Срабатывает на целях, находящихся под действием Astral Imprisonment. Улучшение с Aghanim's Scepter увеличивает дальность применения способности и применяет способность Astral Imprisonment текущего уровня на задетых вражеских героев.",
  "history": "Представитель благородной и властной расы, Предвестник бороздит кромку Пустоши и в одиночку несёт дозор в последней оставшейся заставе мира у края бездны. Он провёл вечность в выщербленном кристаллическом Внемирье, ни на мгновение не покидая свой пост, вглядываясь в небеса и ожидая движения в бездонной ночи за звёздами. Глубоко в сияющих переплетениях его интеллекта лежит узор пророчества — тёмная музыка, предвещающая, что однажды за гранью мироздания проснётся некое зло, которое обратит свой взор к нашему миру. Полностью поглощённый наблюдением, страж оставлял без внимания события, происходящие у самого солнца. Но вот наконец конфликт Древних и чувство нарастающей угрозы изнутри и извне заставили его двинуться в сторону солнца, к просторам сражений. Наши пророчества недвусмысленно говорят о Предвестнике: он — знак грядущих катастроф. Однако и само по себе его прибытие сулит беду.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+20% к вампиризму заклинаниями",
      "talentRight": "+1,6% к урону от Arcane Orb"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0,1 к множителю разницы в мане у Sanity's Eclipse",
      "talentRight": "+20 к силе"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+6 к броне",
      "talentRight": "+250 к мане"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости атаки",
      "talentRight": "+200 к здоровью"
    }
  ]
}