{"abilities":[{"spell":"Summons two wolves to fight for Lycan. Level 3-4 wolves have Cripple, and level 4 wolves have permanent invisibility.","effects":["Ability No Target"],"notes":["Casting Summon Wolves replaces currently active wolves from a previous cast.","The wolves are summoned 200 range in front on Lycan, with 120 range distance between the wolves. Lycan is always at the center of the line.","The wolves gain Cripple on level 3 and Invisibility on level 4.","Already summoned wolves do not get new abilities when the spell is leveled. Only wolves summoned after leveling get them.","Has a cast backswing of 0.6 during Shapeshift.","Aghanim's Scepter requires Summon Wolves to be leveled at least once. The lane wolves are not the same wolves as spawned with a manual cast. The player has no control over the lane wolves, but is considered their owner, meaning last hits they make grant credits to the player. This also means they are affected by Howl, and Feral Impulse, and gain critical strike from Shapeshift, but not the haste speed. The lane for the wolves is selected at complete random each time. The lane wolves have Cripple, but not Invisibility."],"mana":"145","elements":[],"cooldown":"30 ( 26.4)","name":"Summon Wolves","description":["Cast Animation: 0.3+0.73","Number of Wolves: 2 ( 5)","Duration: 55"],"hot_key":"Q","legacy_key":"V"},{"spell":"Grants bonus attack speed, armor, and health regen to Lycan, all allied heroes and all units under their control.","effects":["Ability No Target","Affects Allies"],"notes":["Only affects units under player control. Lane creeps are not affected. Does not place the buff on invulnerable or hidden allies. Does not place the buff on wards and Undying Zombies.","Can regenerate up to 36\/72\/108\/144 health over its full duration.","The sound effect is global for allies only.","Upon cast, Lycan Wolves owned by him play a special animation. This has only visual purposes."],"mana":"25\/30\/35\/40","elements":["Can be used by illusions.","Pierces spell immunity."],"cooldown":"50\/45\/40\/35 ( 44\/39.6\/35.2\/30.8)","name":"Howl","description":["Cast Animation: 0.3+0","Radius: Global","Attack Speed bonus: 20\/30\/40\/50","Armor Bonus: 3\/4\/5\/6","Health Regen Bonus: 4\/8\/12\/16","Duration: 9"],"hot_key":"W","legacy_key":"W"},{"spell":"Increases the HP regeneration and damage of Lycan and all units under his control.","effects":["Ability Aura","Affects Self"],"notes":["Only increases base damage and that given by the primary attribute of affected units. Raw bonus damage is not increased.","Affects all units under Lycan's control, not just himself and his wolves.","Can regenerate up to 60\/180\/300\/420 ( 660\/780\/900\/1020) health in one minute.","The aura's buff lingers for 0.5 seconds.","Lycan illusions dominated by Enchant do not grant Enchantress' units the bonuses, only the illusion itself keeps them.","However, Lycan illusions created by other spells ( Disruption, Wall of Replica, Reflection) do provide their owner and its units the bonuses."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Feral Impulse","description":["Radius: 1200","Attack Damage Bonus: 12%\/24%\/36%\/48% ( 28%\/40%\/52%\/64%)","Health Regeneration Bonus: 1\/3\/5\/7 ( 11\/13\/15\/17)","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"I"},{"spell":"Lycan assumes his lupine form, granting him and his units critical strikes and added vision at night. During Shapeshift, Lycan and all units under his control move at increased speed, cannot be slowed and have a 40% chance to deal a critical strike doing 150%\/175%\/200% damage.","effects":["Ability No Target","Affects Self"],"notes":["During the transformation, Lycan cannot do anything. Cannot be interrupted.","Increases Lycan's night vision to a total of 1800.","The movement speed and critical strike are provided by a global aura which affects all units owned by Lycan. The aura's effects linger for 0.1 seconds.","The movement speed boost is a haste, meaning affected units cannot be slowed below the set value.","The critical strike increases the attack damage of Lycan and all his units by an average of 20%\/30%\/40% ( 40%\/60%\/80%).","The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority.","The critical strike uses pseudo-random distribution.","Shapeshift is fully canceled on death."],"mana":"100","elements":["Partially usable by illusions.","Pierces spell immunity."],"cooldown":"130\/105\/80 ( 114.4\/92.4\/70.4)","name":"Shapeshift","description":["Cast Animation: 0+0","Transformation Time: 1.5","Night Vision Bonus: 1000","Haste Speed: 650","Critical Chance: 40% ( 80%)","Critical Damage: 150%\/175%\/200%","Aura Linger Duration: 0.1","Duration: 18 ( 26)"],"hot_key":"R","legacy_key":"F"},{"spell":"Gives 20% chance to cripple the target, causing 8 damage per second and lose 60 attack speed for 4 seconds.","effects":["Ability Passive","Affects Enemies \/ Allies"],"notes":["Available for level 3-4 wolves.","Deals damage in 1 second intervals, starting 1 second after proccing, resulting in 4 instances.","Can deal up to 32 damage to the target (before reductions).","Multiple procs on the same target do not stack, but refresh the duration instead.","The proccing attack first applies the debuff, then its own damage.","Can proc on allied units as well. Does not proc on buildings and wards."],"mana":"0","elements":["Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Cripple","description":["Proc Chance: 20%","Damage per Second: 8","Attack Speed Slow: 60","Duration: 4"]},{"spell":"Permanently invisible when not attacking.","effects":["Ability Passive","Affects Self"],"notes":["Available for level 4 wolves.","The invisibility is broken upon landing an attack. Missed attacks or attacking items do break it.","Does not allow to pass through other units."],"mana":"0","elements":["Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Invisibility","description":["Fade Delay: 1.7"]}],"bio":"Banehallow was noble-born to the house of Ambry, the greatest of the landed castes in the old kingdom of Slom. Before the Fall, as the King's wants grew strange, and his court grew crowded with sorcerers and charlatans, the house of Ambry was the first to rise against the avarice of the throne. No longer willing to pay homage and fealty, they instead sent six-thousand swords into the capital, where they were wiped out in the Massacre of the Apostates. And then came the teeth behind the old truth: When you strike a king's neck, you had better take his head. Enraged by the betrayal, the king exterminated the vast Ambry bloodline, sparing only the lord of the house and his youngest son, Banehallow. Before all the royal court, with the disgraced lord chained to the ornate marble floor, the King bade his magicians transform the boy into a wolf so that he might tear out his own father's throat. \"Do this,\" the king said, \"so that Lord Ambry will understand the bite of betrayal.\" Powerful magic was invoked, and the child was transformed. But though his body was changed, his spirit remained intact, and instead of biting the exposed neck of his father, he attacked his handlers, tearing them to pieces. A dozen of the King's knights perished under the wolf's teeth before they managed to drive it off into the night. Lord Ambry laughed from his chains even as the King ran him through with a sword. Now the heir to the lost house of Ambry, Banehallow wanders the trail as the Lycan, part warrior, part wolf, in search of justice for all that he lost.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The armor talent does not benefit illusions.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."],"trivia":["Lycanthropy refers to the ability of a human to transform into a wolf, or gain wolf-like characteristics. The term derives from the Greek word lykànthropos, which translates to \"wolf man\", or \"werewolf\" in English.","The line \"Was I a wolf who dreamed he was a man?\" refers to a quote by Chinese philosopher Zhuangzi - \"Now I do not know whether I was then a man dreaming I was a butterfly, or whether I am now a butterfly, dreaming I am a man.\"","The line \"Are you an air wolf?\", refers to the American famous television series \"Airwolf\", counting this response is said to Gyrocopter.","The line \"Who fears the wolf should fear the forest.\" is a reference to Russian novelist Fyodor Mikhailovich Dostoyevsky quote from 'The Gambler' : 'Who fears the wolf should never enter the forest'","The line \"I thought you were Team Yakov!\" is a reference (and pun) to Jacob Black from the Twilight series, who is a werewolf. Fans divide themselves into \"teams\" by who their most preferred main character is, one of such teams is \"Team Jacob\".","The line \"One eye is better than none.\" indicates that Lycan was supposed to have only one functioning eye, with the other one probably covered by an eye patch, as seen in one of the concept arts below."],"talents":["+3 Wolves Summoned:+40% Chance Shapeshift Critical Strike","+16% Feral Impulse Damage:+8s Shapeshift Duration","12% Cooldown Reduction:+10 Feral HP Regen","+20 Damage:+5 Armor"],"desc":"Banehallow, the Lycan, is a melee strength hero who is capable of immense physical damage and considerable movement speed, who also excels at pushing buildings and bolstering his team's damage and health. He is capable of summoning Wolves who make excellent sources of damage and objective control. His Howl gives a large boost to the attack damage and health of his allies, while Feral Impulse turns Lycan and his pack into prime fighters on their own with bonus attack damage and health regeneration. When the time is right, Shapeshift allows the Lycan himself to join in the hunt, overwhelming foes with deadly critical strikes and incredible movement speed."}