{"abilities":[{"spell":"Призывает двух волков, которые будут сражаться на стороне героя. Волки 3-4 уровней обладают Cripple, а волки 4 уровня обладают постоянной невидимостью.","effects":["Способность Ненаправленная"],"notes":["Использование этого заклинания заменит уже существующих волков на новых.","Волки призываются в 200 единицах от Lycan, расстояние между ними составляет 120 единиц. Lycan считается за центр расположения.","Волки получают Cripple на 3-ем уровне и Invisibility - на 4-ом.","Уже призванные волки не усилятся после изучения нового уровня способности. Волки получат обновленные характеристики только после перепризыва.","В форме Shapeshift остаточная анимация равна 0,6."],"mana":"145","elements":[],"cooldown":"30 ( 26.4)","name":"Summon Wolves","description":["Анимация применения: 0,3+0,73","Число волков: 2 ( 5)","Длительность: 55"],"hot_key":"Q","legacy_key":"V"},{"spell":"Нагоняет ужас в радиусе 2000 от владельца способности и его волков, уменьшая врагам броню и урон от атак.","effects":["Способность Ненаправленная","Действует на Союзников"],"notes":["Дебафф не складывается сам с собой, поэтому враг, попавший под действие двух источников, получает только один дебафф.","Lycan и волки применяют эффект одновременно.","Снижение урона от атак распространяется только на базовый урон и урон, даваемый основным атрибутом существ. Дополнительный урон не снижается."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"24\/22\/20\/18 ( 21,12\/19,36\/17,6\/15,84)","name":"Howl","description":["Анимация применения: 0,3+0","Радиус: 2000","Снижение урона от атак: 25%\/30%\/35%\/40%","Снижение брони: 5\/6\/7\/8","Длительность: 5\/6\/7\/8"],"hot_key":"W","legacy_key":"W"},{"spell":"Увеличивает урон и восстановление здоровья у героя и всех подконтрольных ему существ.","effects":["Способность Аура","Действует на Себя"],"notes":["Увеличивает только основной урон и урон, даваемый основным атрибутом существ. Дополнительный урон не увеличивается.","Действует на всех подконтрольных существ, а не только на самого героя и его волков.","Восстанавливает до 60\/180\/300\/420 ( 840\/960\/1080\/1200) здоровья за минуту.","Бафф от ауры задерживается на 0,5 секунды.","Иллюзии Lycan, прирученные с помощью Enchant, не дают бонусов Enchantress и ее подконтрольным существам, сама же иллюзия бонус сохраняет.","Но в то же время иллюзии Lycan, созданные другими заклинаниями ( Disruption, Wall of Replica, Reflection) дают положительные эффекты своим создателям и их существам."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Feral Impulse","description":["Радиус: 900","Доп. урон: 14%\/26%\/38%\/50% ( 32%\/44%\/56%\/68%)","Доп. регенерация здоровья: 1\/3\/5\/7 ( 14\/16\/18\/20)","Длительность задержки ауры: 0,5"],"hot_key":"E","legacy_key":"I"},{"spell":"Герой принимает волчью форму. Во время действия этой способности её владелец и все существа под его контролем двигаются с увеличенной скоростью, не могут быть замедлены, получают увеличенный обзор ночью и шанс в 40% совершить критическую атаку, наносящую 150%\/175%\/200% урона.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Во время трансформации герой не может делать ничего. Прервать трансформацию нельзя.","Увеличивает ночной обзор Lycan до 1800.","Скорость передвижения и критический удар предоставляются глобальной аурой, которая действует на всех подконтрольных Lycan существ. Эффект от ауры задерживается на 0,1 секунды.","Улучшение скорости передвижения предоставляется в виде ускорения, поэтому затронутых существ нельзя замедлить ниже установленного способностью значения.","Критическая атака увеличивает в среднем урон героя и всех подконтрольных юнитов на 20%\/30%\/40% ( 40%\/60%\/80%).","Шанс срабатывания от нескольких источников критического удара складываются. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","Критическая атака использует псевдослучайное распределение.","Shapeshift отменяется при смерти."],"mana":"100","elements":["Частично используется иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"110\/95\/80 ( 96,8\/83,6\/70,4)","name":"Shapeshift","description":["Анимация применения: 0+0","Время трансформации: 1,25","Доп. обзор ночью: 1000","Скорость ускорения: 650","Шанс критического удара: 40% ( 80%)","Критический урон: 150%\/175%\/200%","Длительность задержки ауры: 0,1","Длительность: 18 ( 26)"],"hot_key":"R","legacy_key":"F"},{"spell":"Герой кусает союзника, наделяя его бонусами от способности Shapeshift. Они с целью получают 30% вампиризма и восстанавливают друг другу %lifesteal%%% от нанесённого урона в виде здоровья, если находятся на расстоянии не более 1200.","effects":["Способность Направленная на юнита","Действует на Союзных героев"],"notes":["Требует Aghanim's Scepter для разблокировки.","Применяет к союзнику все эффекты Shapeshift, включая время трансформации, ночной обзор, критический удар и скорость. Также дает ауру скорости, то есть все существа, принадлежащие укушенной цели, получают такие же бонусы, что и существа Lycan. Но при этом вампиризм делится только между заклинателем и укушенным. Существа его не получают.","Дает обычный и общий вампиризм заклинателю и укушенному союзнику. То есть кто бы из них не атаковал, лечение получают всегда оба. Усиление вампиризма так же влияет на общий вампиризм, но только если владелец усиления — излечиваемый юнит.","Вампиризм дается сразу при применении и для него не нужно завершение трансформации.","Для общего вампиризма заклинатель и цель должны находится на расстоянии 1200 друг от друга. Обычный вампиризм действует независимо от расстояния.","Если Shapeshift не изучена, то союзная цель потратит время на трансформацию, но не превратится. То есть способность просто оглушает союзника и дает как ему, так и заклинателю вампиризм на 1,25 секунды."],"mana":"150","elements":["Частично используется иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"80 ( 70.4)","name":"Wolf Bite","description":["Анимация применения: 0,3+0,73","Радиус вампиризма: 1200","Вампиризм: 30%","Общий вампиризм: 30%"],"hot_key":"D","legacy_key":"T"},{"spell":"Каждая атака имеет шанс покалечить цель в 20%, уменьшая ее скорость атаки на 60 и каждую секунду нанося 8 урона в течение 4 сек.","effects":["Способность Пассивная","Действует на Врагов \/ Союзников"],"notes":["Доступна для волков 3-4 уровней.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после срабатывания, срабатывая 4 раза.","Может нанести до 32 единиц урона цели (до учета сопротивления).","Несколько срабатываний на ту же цель не складываются, но их длительность обновляется.","Сработавшая атака сначала применяет дебафф, затем наносит урон.","Может сработать на союзных юнитов. Не работает на строения и варды."],"mana":"0","elements":["Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Cripple","description":["Шанс: 20%","Урон в секунду: 8","Замедление скорости атаки: 60","Длительность: 4"]},{"spell":"Пока волк не атакует, он невидим.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Доступна для волков 4-го уровня.","Невидимость исчезает при нанесении атаки. Промахнувшиеся атаки или атака по предметам не отменят её.","Нельзя проходить сквозь других юнитов."],"mana":"0","elements":["Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Invisibility","description":["Задержка невидимости: 1,7"]}],"bio":"Бейнхаллоу был одним из наследников благородного дома Эмбри, величайшего землевладельческого рода королевства Слом. До Падения дом Эмбри первым восстал против ненасытного короля, чьи желания становились всё страннее и страннее, в то время как двор заполоняли колдуны и шарлатаны. Не желая больше платить вассальскую дань, Эмбри послали в столицу шеститысячную армию, но её перерезали в сражении, названном позже «Бойней отступников». Тогда старое выражение показало свою настоящую шкуру: когда метишь в шею королю, лучше рубить сразу всю голову. Разъярённый предательством король истребил всякого живущего Эмбри, оставив жизнь лишь лорду и его младшему сыну, Бейнхаллоу. Опозоренный лорд был прикован к узорчатому мраморному полу королевской залы, и монарх приказал своим волшебникам превратить мальчика в волка, чтобы тот разодрал глотку своему же отцу. «Сделайте это, — сказал король, — чтобы Лорд Эмбри осознал, как остры зубы предательства». Были призваны сильнейшие магические силы, и тело ребенка исказилось. Однако, хоть тело Бейнхаллоу больше и не было человеческим, его душа никак не изменилась — и вместо того, чтобы разодрать шею беззащитного отца, он набросился на прислугу монарха. Прежде чем волка наконец-то смогли выгнать в тишь ночи, он разорвал на клочки дюжину королевских рыцарей. Лорд Эмбри, всё ещё в кандалах, смеялся, даже когда его тело пронзил королевский меч. Ныне Бейнхаллоу — наследник потерянного дома Эмбри, бродящий по миру под именем Lycan. Наполовину воин, наполовину волк, он ищет возмездия за всё то, что потерял.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на броню не дается иллюзиям.","Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."],"trivia":["Бывшее имя героя - Lycanthrope. Lycanthrope - Ликантро́пия (от др.-греч. λύκος — «волк» и ἄνθρωπος — «человек») — мифическая или волшебная болезнь, вызывающая метаморфозы в теле, в ходе которых больной превращается в волка.","Фраза \"Was I a wolf who dreamed he was a man?\" (Был ли Я волком, которому снилось, что он человек?) отсылается к цитате Китайского философа Чжуан-цзи - \"Теперь Я даже и не знаю был ли Я человеком, которому снилось, что он бабочка, или же Я теперь бабочка, которой снится, что она человек?.\"","Фраза \"Are you an air wolf?\", отсылка к известному Американскому телесериалу \"Воздушный Волк\".","Фраза \"Who fears the wolf should fear the forest.\" является отсылкой к цитате из книги Российского писателя Фёдора Михайловича Достоевского 'Игрок' : 'Волков бояться - в лес не ходить'","При атаке под способностью Shapeshift Ликан иногда произносит: \"The wolf is at your door\", что является отсылкой к песне \"Radiohead – A Wolf at the Door\"."],"talents":["+3 к числу вызываемых волков:+40% к шансу крита от Shapeshift","+18% к урону от Feral Impulse:+8 сек. действия Shapeshift","-12% перезарядки способностей:+13 здоровья в секунду от Feral Impulse","+20 к урону:+5 к броне"],"desc":"Lycan — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Summon Wolves, призывает двух волков, которые будут сражаться на стороне Lycan. Вторая способность, Howl, увеличивает урон Lycan, союзных героев и всех подконтрольных им юнитов. Пассивная способность, Feral Impulse, увеличивает урон и скорость атаки Lycan и также дает этот эффект всем подконтрольным ему юнитам. Ультимативной способностью, Shapeshift, Lycan принимает свою истинную форму, в которой он может наносить критические удары и обладает ночным зрением. Во время действия этой способности Lycan и все существа под его контролем двигаются с увеличенной скоростью и не могут быть замедлены."}