{"abilities":[{"spell":"Призывает двух волков, которые будут сражаться на стороне героя. Волки 3-4 уровней обладают Cripple, а волки 4 уровня обладают постоянной невидимостью.","effects":["Способность Ненаправленная","Урон Физический"],"notes":["Использование этого заклинания заменит уже существующих волков на новых.","Волки призываются в 200 единицах от Lycan, расстояние между ними составляет 120 единиц. Lycan считается за центр расположения.","Волки получают Cripple на 3-ем уровне и Invisibility - на 4-ом.","Уже призванные волки не усилятся после изучения нового уровня способности. Волки получат обновленные характеристики только после перепризыва.","В форме Shapeshift время после применения составляет 0,6."],"mana":"145","elements":[],"cooldown":"30 ( 26.4)","name":"Summon Wolves","description":["Анимация применения: 0,3+0,73","Количество волков: 2 ( 5)","Длительность: 55"],"hot_key":"Q","legacy_key":"V"},{"spell":"Увеличивает урон и запас здоровья героя, его союзников и всех подконтрольных существ. Ночью способность действует с удвоенной силой.","effects":["Способность Ненаправленная","Действует на Союзников"],"notes":["Действует только на юнитов, находящихся под контролем игрока. Не работает на линейных крипов. Не размещает бафф на неуязвимых или спрятанных союзников. Не размещает бафф на варды и Undying Zombie.","После использования все союзные юниты получают увеличение запаса максимального здоровья. Не меняет процентное соотношение к текущему здоровью.","Ночью значения удваиваются. Герои получают дополнительно 20\/30\/40\/50 к урону и 100\/200\/300\/400 ( 1300\/1400\/1500\/1600) единиц здоровья. Не-герои получают дополнительно 40\/60\/80\/100 к урону и 50\/100\/150\/200 единиц здоровья.","Бонус к здоровью не адаптируется к текущему времени суток. Он устанавливается в момент использования и не меняется.","Бонус к урону адаптируется к текущему времени суток и не устанавливается в момент использования в отличии от бонуса к здоровью.","Считает крипов-героев за крипов.","Глобально звуковой эффект от применения заклинания слышен только союзникам.","При применении заклинания подконтрольные волки проигрывают особую анимацию, имеющую лишь визуальное значение."],"mana":"40","elements":["Может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60\/55\/50\/45 ( 52.8\/48.4\/44\/39.6)","name":"Howl","description":["Анимация применения: 0,3+0","Радиус: Глобальный","Доп. урон героям: 10\/15\/20\/25","Доп. урон не-героям: 20\/30\/40\/50","Доп. здоровье героям: 50\/100\/150\/200 ( 650\/700\/750\/800)","Доп. здоровье не-героям: 25\/50\/75\/100","Множитель бонуса ночью: 2","Длительность: 13"],"hot_key":"W","legacy_key":"W"},{"spell":"Увеличивает урон и восстановление здоровья у героя и всех подконтрольных ему существ.","effects":["Способность Аура","Действует на Себя"],"notes":["Увеличивает только основной урон и урон, даваемый основным атрибутом юнитов. Дополнительный урон не увеличивается.","Работает на всех подконтрольных юнитов, а не только на самого героя и его волков.","Положительный эффект от ауры сохраняется в течение 0,5 секунд после выхода из радиуса действия.","Иллюзии Lycan, прирученные с помощью Enchant, не дают бонусов Enchantress и ее подконтрольным юнитам, сама же иллюзия бонус сохраняет.","Но в то же время иллюзии Lycan, созданные другими заклинаниями ( Disruption, Wall of Replica, Reflection) дают положительные эффекты своим создателям и их юнитам."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Feral Impulse","description":["Радиус: 900","Доп. урон: 12%\/24%\/36%\/48% ( 28%\/40%\/52%\/64%)","Доп. регенерация здоровья: 1\/3\/5\/7 ( 9\/11\/13\/15)","Длительность задержки ауры: 0,5"],"hot_key":"E","legacy_key":"I"},{"spell":"Lycan принимает свою истинную форму. Во время действия этой способности Lycan и все существа под его контролем двигаются с увеличенной скоростью, не могут быть замедлены, получают увеличенный обзор ночью и шанс в 40% совершить критическую атаку, наносящую 150%\/175%\/200% урона.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Во время трансформации герой не может делать ничего. Прервать трансформацию нельзя.","Увеличивает ночной обзор Lycan до 1800 единиц.","Скорость передвижения и критический удар являются глобальной аурой, которая работает на всех подконтрольных Lycan существ. Эффект от ауры не задерживается.","Улучшение скорости передвижения предоставляется в виде ускорения, поэтому затронутых юнитов нельзя замедлить ниже установленного способностью значения.","Критическая атака увеличивает в среднем урон героя и всех подконтрольных юнитов на 20%\/30%\/40%.","Шанс срабатывания от нескольких источников критического удара складываются. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","Критическая атака использует псевдо-случайное распределение.","Shapeshift полностью отменяется при смерти."],"mana":"100","elements":["Частично используется иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"130\/105\/80 ( 114.4\/92.4\/70.4)","name":"Shapeshift","description":["Анимация применения: 0+0","Время трансформации: 1,5","Доп. обзор ночью: 1000","Скорость ускорения: 650","Шанс критического удара: 40%","Критический урон: 150%\/175%\/200%","Длительность задержки ауры: 0,1","Длительность: 18 ( 26)"],"hot_key":"R","legacy_key":"F"},{"spell":"Каждая атака имеет шанс покалечить цель в 20%, уменьшая ее скорость атаки на 60 и каждую секунду нанося 8 урона в течение 4 сек.","effects":["Способность Пассивная","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Доступна для волков 3-4 уровней.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после срабатывания, срабатывая 4 раза.","Может нанести до 32 единиц урона цели (до учета сопротивления).","Несколько срабатываний на ту же цель не складываются, но их длительность обновляется.","Сработавшая атака сначала применяет дебафф, затем наносит урон.","Может сработать на союзных юнитов. Не работает на строения и варды."],"mana":"0","elements":["Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Cripple","description":["Шанс: 20%","Урон в секунду: 8","Замедление скорости атаки: 60","Длительность: 4"]},{"spell":"Пока волк не атакует, он невидим.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Доступна для волков 4-го уровня.","Невидимость исчезает при нанесению атаки. Промахнувшиеся атаки или атака по предметам не отменят её.","Нельзя проходить сквозь других юнитов."],"mana":"0","elements":["Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Invisibility","description":["Задержка невидимости: 1,7"]}],"bio":"Бейнхаллоу с рождения принадлежал благородному дому Амбри, могущественнейшему из всех землевладельческих родов королевства Слом. Еще до того, как свершилось Падение, дом Амбри первым восстал против ненасытного короля, чьи желания становились всё страннее и страннее, а двор его заполонили колдуны и шарлатаны. Не желая больше платить вассальские залоги, они послали в столицу шеститысячную армию, где та была перерезана в Бойне отступников. Тогда старое выражение показало свою настоящую шкуру: когда метишь в шею королю, лучше рубить сразу всю голову. Разъяренный свершившимся предательством, король истребил всякого живущего Амбри на земле, оставив жизнь лишь лорду и его младшему сыну, Бейнхаллоу. Опозоренный лорд был прикован к узорчатому мраморному полу королевской залы, и монарх приказал своим волшебникам превратить мальчика в волка, чтобы тот разодрал глотку своему же отцу. «Сделай это, — сказал король, — чтобы Лорд Амбри осознал, как остры зубы предательства». Были призваны сильнейшие магические силы, и тело ребенка исказилось. Однако в то время как тело Бейнхаллоу больше не было человеческим, его душа осталась на месте — и вместо того, чтобы разодрать шею беззащитного отца, он набросился на прислугу монарха. Дюжина рыцарей короля была разорвана им на клочки до того, как его наконец-то смогли выгнать из замка, далеко в ночь. Лорд Амбри, всё еще в кандалах, смеялся, даже когда его тело пронзил меч короля. Теперь же Бейнхаллоу — наследник потерянного дома Амбри, бродящий по миру под именем Ликантропа, наполовину воин, наполовину волк, ищущий возмездие и правосудие в отместку за всё то, что он потерял.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на броню не дается иллюзиям.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["Бывшее имя героя - Lycanthrope. Lycanthrope - Ликантро́пия (от др.-греч. λύκος — «волк» и ἄνθρωπος — «человек») — мифическая или волшебная болезнь, вызывающая метаморфозы в теле, в ходе которых больной превращается в волка.","Фраза Играть \"Was I a wolf who dreamed he was a man?\" (Был ли Я волком, которому снилось, что он человек?) отсылается к цитате Китайского философа Чжуан-цзи - \"Теперь Я даже и не знаю был ли Я человеком, которому снилось, что он бабочка, или же Я теперь бабочка, которой снится, что она человек?.\"","Фраза Играть \"Are you an air wolf?\", отсылка к известному Американскому телесериалу \"Воздушный Волк\".","Фраза Играть \"Who fears the wolf should fear the forest.\" является отсылкой к цитате из книги Российского писателя Фёдора Михайловича Достоевского 'Игрок' : 'Волков бояться - в лес не ходить'","При атаке под способностью Shapeshift Ликан иногда произносит: \"The wolf is at your door\", что является отсылкой к песне \"Radiohead – A Wolf at the Door\"."],"talents":["+3 призываемых волка:+600 к здоровью героев от Howl","+16% к урону от Feral Impulse:+8 сек. действия Shapeshift","-12% перезарядки способностей:+8 к регенерации здоровья от Feral Impulse","+20 к урону:+5 к броне"],"tips":["Волки могут использоваться для проверки рун в начале матча, после получения невидимости ими можно разведывать территорию, также, ими можно фармить линию, пока герой качается в лесу.","Всегда призывайте волков у фонтана в начале матча, в том случае, если вы собираетесь идти в лес с первого уровня, но делайте это только спустя некоторое время (приблизительно 10 секунд) после начала матча, поскольку лесные крипы появляются только спустя 30 секунд после начала - вы должны успеть восстановить ману и в таком случае вы можете зачистить хотя бы один лагерь крипов, имея полный запас маны.","Идя на Рошана стоит предварительно воспользоваться Smoke of Deceit чтобы исключить возможность быть замеченным вражескими Вардами. Если вы идёте на Рошана командой, то кому-нибудь стоит установить Вард возле его логова, так как противники могут догадаться, где вы находитесь и пойти за вами. Установленный Вард даст вам знать, если вас хотят убить.","Nature's Prophet отлично сочетается с Ликаном по нескольким причинам. Howl может серьёзно увеличивать эфеективность Treant'ов, давая бонус к урону каждому из них. Этим можно воспользоваться при нападении на Рошана. Nature's Prophet (как и Ликан) может качаться и на линии, и в лесу, и его отсутствие при атаке Рошана не будет большой проблемой для товарищей по команде.","На 9 уровне, с такими предметами как Vladmir's Offering, Power Treads, Ликан может в одиночку убить Рошана. Призовите волков и танкуйте ими вместе с героем, но не давайте им умирать до тех пор, пока способность не перезарядится. Ульт лучше не включать: приберегите его на случай, если за вами ввалятся противники, в таком случае, вы можете использовать ульт для побега.","Shapeshift это очень мощный и разносторонний Ultimate. При активации, Ликан движется с максимальной скоростью - вы можете добить убегающего противника, резко ворваться в замес, или же убежать в экстремальной ситуации. Превратившись в волка, вы невосприимчивы к любым Замедлениям, включая Hex, Purge и разные замедляющие ультимейты вроде Epicenter, Freezing Field, Primal Roar (тем не менее, вы восприимчивы к оглушению и сну)."],"desc":"Lycan — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Summon Wolves, призывает двух волков, которые будут сражаться на стороне Lycan. Вторая способность, Howl, увеличивает урон Lycan, союзных героев и всех подконтрольных им юнитов. Пассивная способность, Feral Impulse, увеличивает урон и скорость атаки Lycan и также дает этот эффект всем подконтрольным ему юнитам. Ультимативной способностью, Shapeshift, Lycan принимает свою истинную форму, в которой он может наносить критические удары и обладает ночным зрением. Во время действия этой способности Lycan и все существа под его контролем двигаются с увеличенной скоростью и не могут быть замедлены."}