{"abilities":[{"effects":["Proc Chance: 20%","Critical Damage: 175%"],"notes":["Increases attack damage by an average of 15%.","The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority.","Critical Strike uses pseudo-random distribution."],"elements":["Ability Passive","Affects Enemies"],"description":"Grants a 20% chance for attacks to inflict 175% damage."},{"effects":["Cast Range: 900","Damage Amplification: 30%","Critical Proc Chance: 100%","Critical Damage: 140%","Duration: 5"],"notes":["Does not directly amplify damage as it is dealt, but rather saves all damage values and deals 30% of it 5 seconds after cast. This means that the damage can be avoided by becoming spell immune or invulnerable\/hidden at the end of the duration.","The damage is applied as soon as the debuff expires. Dispelling the debuff, however, skips the damage entirely. Recasting Soul Rend on the same target refreshes the duration. Doing this delays the damage further, and gives more time to deal damage to the target. The damage is credited to the last caster of Soul Rend on the target.","Only considers magical, physical and pure damage (after all reductions). Other sources of health loss are ignored.","Applies Accuracy on the target, causing all attacks done against it to not miss to evasion or blind effects.","The critical strike is only applied to attacks launched on a debuffed enemy. Previously launched attack projectiles are unaffected. In reverse, this also means that projectiles launched during the debuff still crit even when landing after it already expired.","Together with the passive Critical Strike, increases attack damage against debuffed targets by an average of 47%.","Shares cooldown with Orchid Malevolence."],"elements":["Ability Target Unit","Affects Enemies","Damage Magical"],"description":"Silences a target for 5 seconds. At the end of the silence, an additional 30% of all damage taken during the silence will be dealt to the target as magical damage. All attacks on the silenced target will have True Strike and 100% chance to crit for 140% damage."}],"cost":"7205","description":"A reviled blade that bites deeper with each wriggle of its victim's final throes.","trivia":["Prior to the July 14, 2017 Patch, Bloodthorn's active ability, Soul Rend, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."],"further":["Orchid_Malevolence","Crystalys","Recipe"],"tips":["Build the orchid first, it will provide good damage, mana regen and a powerful silence that enemies wont be able to dispel early game.","Bloodthorn's active accuracy counters evasion from any source, such as Butterfly or Blur, as well as blind effects from any source, like Laser or Blinding Light.","Generally, Bloodthorn is a worthy upgrade for any hero that purchases an Orchid Malevolence or a Crystalys. It is arguably better than Daedalus because it guarantees crits of 140% damage with True Strike for your team, silences, chances to deal crits of 175% damage, and a 30% magical damage aftermath while Daedalus grants only chances to deal crits of 175% damage.","On average, attack damage is increased by 47% when the debuff is applied (due to both the debuff and the passive critical strike of the item). This will be further amplified by 30% as magic damage at the end of the debuff duration.","Remember that Bloodthorn's active gives guaranteed crits along with a silence. Targets may still be able to escape with Shadow Blade or Blink Dagger before you could damage them.","The ensured crits from Soul Rend work for all attacks done to the target. This includes attacks from wards, towers, fountains and even allies of the target. Casting it on a tower diving enemy makes them take much more damage from the tower. It is great when combined with Winter's Curse, because Soul Rend causes them to crit their cursed ally as mentioned. Instant attacks like Geminate Attack and Side Gunner can crit as long as they allow the carriage of attack modifiers. This prevents Split Shot and Flak Cannon from critting.","Soul Rend does not allow crits from secondary spell projectiles or spell dummy units. Death Ward crits on primary targets, but Aghanim's Scepter bounces don't. Moon Glaives crits on primary targets, but secondary bounces don't. Psi Blades do not crit on secondary targets. The Swarm does not crit.","You don't need to attack too much and chase, or dive. If dealt enough, the bonus 30% damage at the end of the effect should be enough to kill the target.","Combined with Nullifier and Silver Edge, one may completely shut down an enemy. Even if they have Linken's Sphere off cooldown, that means they're still cut off from their passive abilities, and either their active abilities or items, depending on which effect was applied."],"attrs":["Active Soul Rend","Passive Critical Strike","Bonus +25 Intelligence +30 Attack speed +5.5 Mana regeneration +68 Attack damage","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 30 attack speed, 300 mana, 6.75 mana regen and 1.75% spell damage.","For agility heroes, it grants 30 attack speed, 300 mana, 6.75 mana regen and 1.75% spell damage.","For intelligence heroes, it grants 30 attack speed, 300 mana, 6.75 mana regen, 1.75% spell damage and 93 attack damage."]}