{"abilities":[{"effects":["Дальность применения: 900","Усиление урона: 30%","Шанс крита: 100%","Критический урон: 145%","Длительность: 5"],"notes":["Does not directly amplify damage as it is dealt, but rather saves all damage values and deals 30% of it 5 seconds after cast. This means that the damage can be avoided by becoming spell immune or invulnerable\/hidden at the end of the duration.","Урон наносится сразу после окончания дебаффа. Recasting Soul Burn on the same target refreshes the duration. Doing this delays the damage further, and gives more time to deal damage to the target. The damage is credited to the last caster of Soul Burn on the target. Dispelling the debuff, however, skips the damage entirely.","Учитываются только магический, физический и чистый типы урона (после учета всех уменьшений). Другие виды потери здоровья не учитываются. Имеет общую перезарядку с Soul Burn у Orchid Malevolence."],"elements":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"name":"Soul Rend","description":"Запрещает выбранной цели колдовать на 5 секунд и увеличивает наносимый ей урон на 30%. Все атаки на цель под запретом колдовства будут иметь эффект True Strike и критический удар."},{"effects":["Шанс: 20%","Критический урон: 175%"],"notes":["Использует Псевдо-случайное распределение.","Увеличивает урон от атаки на 15%."],"elements":["Способность Пассивная","Действует на Врагов"],"name":"Critical Strike","description":"Добавляет шанс каждой атаке нанеси критический удар. Критический удар не работает на строения."}],"cost":"3130","description":"Этот ненавистный клинок топит врага в агонии, впиваясь в тело извивающейся жертвы всё сильнее и сильнее с каждым ее движением.","further":["Orchid_Malevolence","Crystalys","Рецепт"],"attrs":["Активируемая Soul Rend","Пассивная Critical Strike","Бонус +25 к интеллекту +30 к скорости атаки +2,25 к регенерации маны +68 к урону","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 30 скорости атаки, 300 маны, 3,5 регенерации маны и 1,75% урона от способностей.","Для героев ловкости, даёт 30 скорости атаки, 300 маны, 3,5 регенерации маны и 1,75% урона от способностей.","Для героев интеллекта, даёт 30 скорости атаки, 375 маны, 3,81 регенерации маны, 2,19% урона от способностей и 93 урона от атаки."]}