{"abilities":[{"effects":["Дальность применения: 900","Усиление урона: 30%","Шанс крита: 100%","Критический урон: 145%","Длительность: 5"],"notes":["Не увеличивает урон непосредственно в момент нанесения, а сохраняет все значения урона и наносит 30% от него через 5 секунд после применения. Это означает, что урона можно избежать получив Иммунитет к заклинаниям, став неуязвимым или исчезнув под конец действия дебаффа.","Урон наносится сразу после окончания дебаффа. Повторное наложение Soul Burn на цель обновить длительность дебаффа. Сделав это вы задержите получение урона, но это даст вам больше времени для нанесения урона, что в конечном итоге увеличит урон Soul Burn. Урон начисляется последнему герою наложившему Soul Burn на цель. Однако развеивание дебаффа полностью исключает урон.","Учитываются только магический, физический и чистый типы урона (после учета всех уменьшений). Другие виды потери здоровья не учитываются. Имеет общую перезарядку с Soul Burn у Orchid Malevolence."],"elements":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"description":"Запрещает выбранной цели колдовать на 5 секунд и увеличивает наносимый ей урон на 30%. Все атаки на цель под запретом колдовства будут иметь эффект True Strike и критический удар."},{"effects":["Шанс: 20%","Критический урон: 175%"],"notes":["Использует Псевдо-случайное распределение.","Увеличивает урон от атаки на 15%."],"elements":["Способность Пассивная","Действует на Врагов"],"description":"Добавляет шанс каждой атаке нанеси критический удар. Критический удар не работает на строения."}],"cost":"7205","description":"Этот ненавистный клинок топит врага в агонии, впиваясь в тело извивающейся жертвы всё сильнее и сильнее с каждым ее движением.","further":["Orchid_Malevolence","Crystalys","Рецепт"],"attrs":["Активируемая Soul Rend","Пассивная Critical Strike","Бонус +25 к интеллекту +30 к скорости атаки +5,5 к регенерации маны +68 к урону","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 30 скорости атаки, 300 маны, 6,75 регенерации маны, 1,75% урона от способностей и 68 урона от атаки.","Для героев ловкости, даёт 30 скорости атаки, 300 маны, 6,75 регенерации маны, 1,75% урона от способностей и 68 урона от атаки.","Для героев интеллекта, даёт 30 скорости атаки, 300 маны, 6,75 регенерации маны, 1,75% урона от способностей и 93 урона от атаки."]}