{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Press the Attack по области радиусом 400",
          "talentRight": "+30 к урону за победу в дуэли"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+8% к шансу срабатывания Moment of Courage",
          "talentRight": "+30 к скорости передвижения"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+75 к урону за героя от Overwhelming Odds",
          "talentRight": "+40 здоровья в секунду от Press the Attack"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+200 к дальности применения Duel",
          "talentRight": "+100 к радиусу Overwhelming Odds"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Legion_Commander_Overwhelming_Odds_1.mp3\/revision\/latest?cb=20191216014947",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Процентный урон наносится только существам, созданными способностями, до базового и дополнительного. К существам относятся иллюзии, но не крипы-герои и клоны.",
        "К существам относятся иллюзии, но не крипы-герои и клоны.",
        "Дополнительный урон считает крипов-героев и иллюзии за крипов.",
        "Ниже указано, сколько урона нанесет способность с определенным числом героев без других существ поблизости (до уменьшений): 1 герой: 70\/120\/170\/220 урона. 2 героя: 100\/180\/260\/340 урона каждому герою, 200\/360\/520\/680 урона всего. 3 героя: 130\/240\/350\/460 урона каждому герою, 390\/720\/1050\/1380 урона всего. 4 героя: 160\/300\/440\/580 урона каждому герою, 640\/1200\/1760\/2320 урона всего. 5 героев: 190\/360\/530\/700 урона каждому герою, 950\/1800\/2650\/3500 урона всего.",
        "1 герой: 70\/120\/170\/220 урона.",
        "2 героя: 100\/180\/260\/340 урона каждому герою, 200\/360\/520\/680 урона всего.",
        "3 героя: 130\/240\/350\/460 урона каждому герою, 390\/720\/1050\/1380 урона всего.",
        "4 героя: 160\/300\/440\/580 урона каждому герою, 640\/1200\/1760\/2320 урона всего.",
        "5 героев: 190\/360\/530\/700 урона каждому герою, 950\/1800\/2650\/3500 урона всего.",
        "Игнорирует курьеров, неуязвимых и спрятанных существ.",
        "Начальная часть звука заклинания проигрывается во время анимации применения и слышна всем.",
        "Бафф от нескольких применений Overwhelming Odds не складывается, но обновляется. Значение скорости обновляется при каждом применении, учитывая количество пораженных целей.",
        "Значение скорости обновляется при каждом применении, учитывая количество пораженных целей."
      ],
      "mana": "100\/110\/120\/130",
      "item_behaviour": [],
      "name": "Overwhelming Odds",
      "cooldown": "15 (TagTalent -60)",
      "description": "Оборачивает численное преимущество врага против него самого, нанося урон противникам в выбранной области. Каждое задетое существо увеличивает урон от способности и дарует её владельцу дополнительную скорость передвижения. Иллюзии и призванные существа получают дополнительный урон в виде доли от их текущего здоровья.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 1000",
        "Радиус: 330",
        "Базовый урон: 40\/60\/80\/100",
        "Урон за крипа: 14\/16\/18\/20",
        "Урон за героя: 30\/60\/90\/120",
        "Текущее здоровье в урон по призваным существам: 25%",
        "Бонус к скорости передвижения за крипа: 3%",
        "Бонус к скорости передвижения за героя: 9%",
        "Длительность ускорения: 7",
        "Учитывает при подсчете существ врагов с иммунитетом к заклинаниям. Не наносит урон врагам с иммунитетом."
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Legion_Commander_Press_the_Attack.mp3\/revision\/latest?cb=20191216014950",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на область)",
        "Действует на Союзников"
      ],
      "notes": [
        "При использовании применяет сильное развеивание к цели.",
        "Восстанавливает до 150\/200\/250\/300 здоровья за всю длительность.",
        "Талант превращает Press the Attack в заклинание, направленное на область, поэтому им больше нельзя напрямую выбрать существ. Применение на себя все равно выбирает целью Legion Commander, делая её центром радиуса. Талант не распространяется на автоматическое применение Press The Attack после победы в дуэли.",
        "Применение на себя все равно выбирает целью Legion Commander, делая её центром радиуса.",
        "Талант не распространяется на автоматическое применение Press The Attack после победы в дуэли."
      ],
      "mana": "110",
      "item_behaviour": [],
      "name": "Press the Attack",
      "cooldown": "16\/15\/14\/13",
      "description": "Снимает все отрицательные эффекты с союзной цели и ненадолго увеличивает её скорость атаки и восстановление здоровья.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,93",
        "Дальность применения: 700",
        "Радиус: 0 (TagTalent 400)",
        "Доп. регенерация здоровья: 30\/40\/50\/60",
        "Доп. скорость атаки: 65\/90\/115\/140",
        "Длительность: 5"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9e\/Legion_Commander_Moment_of_Courage.mp3\/revision\/latest?cb=20191216014945",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "Срабатывает только при начале атаке по Legion Commander независимо от расстояния. То есть отмененная или промахнувшаяся атака также может активировать способность.",
        "То есть отмененная или промахнувшаяся атака также может активировать способность.",
        "Срабатывает при атаках от любых существ, независимо от принадлежности к команде или типа существа (включая варды и постройки).",
        "При срабатывании Legion Commander получает бафф, дающий 1000 к скорости атаки и вампиризм. Бафф длится 1 секунду или до попадания атаки по врагу — в зависимости от того, что произойдет раньше. Промахнувшиеся атаки не учитываются.",
        "Бафф длится 1 секунду или до попадания атаки по врагу — в зависимости от того, что произойдет раньше. Промахнувшиеся атаки не учитываются.",
        "Если способность срабатывает при атаке героем кого-либо, то Тресдин совершит мгновенную атаку по текущей атакуемой цели. Эта мгновенная атака не мешает текущей и не использует анимацию. При мгновенной атаке могут сработать любые модификаторы атаки или эффекты, срабатывающие при атаке. То есть мгновенная атака также мгновенно использует 1000 к скорости атаки и вампиризм. Если Legion Commander ослеплена, то удар может промахнутся, кроме случая, когда у неё есть эффект True Strike. Также удар может промахнутся из-за уклонения.",
        "Эта мгновенная атака не мешает текущей и не использует анимацию.",
        "При мгновенной атаке могут сработать любые модификаторы атаки или эффекты, срабатывающие при атаке.",
        "То есть мгновенная атака также мгновенно использует 1000 к скорости атаки и вампиризм.",
        "Если Legion Commander ослеплена, то удар может промахнутся, кроме случая, когда у неё есть эффект True Strike. Также удар может промахнутся из-за уклонения.",
        "Складывается с другими источниками вампиризма.",
        "Вампиризм не действует при атаке вардов, строений и союзных существ.",
        "Moment of Courage использует псевдослучайное распределение."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Moment of Courage",
      "cooldown": null,
      "description": "Может мгновенно ответить на вражескую атаку контрударом с дополнительным вампиризмом.",
      "hot_key": "E",
      "params": [
        "Шанс контратаки: 25% (TagTalent 33%)",
        "Вампиризм: 55%\/65%\/75%\/85%"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c1\/Legion_Commander_Duel_1.mp3\/revision\/latest?cb=20191216014943",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев \/ Себя"
      ],
      "notes": [
        "Дуэль закончится, если участники разойдутся на расстояние в 2000 единиц.",
        "Дает эффект True Sight на заклинателя и выбранную им цель для обеих команд, поэтому невидимость не предотвращает удары друг по другу (не проходит сквозь иммунитет к True Sight).",
        "Применяет безмолвие, заглушение и провокацию как к Legion Commander, так и к цели.",
        "Приоритет провокации от Duel выше, чем у других источников эффекта; другие способности не могут изменить цель атаки дуэлянтов.",
        "Дуэлянтов можно выбрать, но их нельзя передвинуть с помощью Force Staff, Hurricane Pike или Geomagnetic Grip.",
        "Дает дуэлянтам беспрепятственное передвижения, позволяя им передвигаться через возвышенности, деревья и других существ.",
        "Дуэль мгновенно прервется без определения победителя, если расстояние между дуэлянтами в любой момент превысит 2000. Также она прервется, если существо попадет под эффекты Dismember () или Supernova ().",
        "Также она прервется, если существо попадет под эффекты Dismember () или Supernova ().",
        "Существо победит в дуэли, если его противник умрет до её завершения. Если дуэлянты выжили, то победителя не будет.",
        "Победителю необязательно быть тем, кто совершит смертельный удар. Его противник может умереть от врагов, нейтральных существ или быть добитым союзником или самим собой.",
        "Победитель получает дополнительный урон, если его противник — герой, а не иллюзия, и он умер (или стал призраком из-за Reincarnation). При этом есть исключения: Цель дуэли не получит дополнительный урон, если заклинатель умер от взрыва Ice Blast, но заклинатель бонус получит, если цель взорвется. Цель дуэли не получит урон, если дуэлянтов спрятали с помощью Phantasm или Enchant Remnant и заклинатель умер, но сам заклинатель урон от смерти цели получит. Проигравший Meepo дает бонус только если он умер непосредственно от полученного во время дуэли урона. Если другой Meepo умер во время дуэли, заклинатель урона не получит. Победа над Tempest Double не дает бонуса. Победа дает урон, даже если у цели было воскрешение.",
        "Цель дуэли не получит дополнительный урон, если заклинатель умер от взрыва Ice Blast, но заклинатель бонус получит, если цель взорвется.",
        "Цель дуэли не получит урон, если дуэлянтов спрятали с помощью Phantasm или Enchant Remnant и заклинатель умер, но сам заклинатель урон от смерти цели получит.",
        "Проигравший Meepo дает бонус только если он умер непосредственно от полученного во время дуэли урона. Если другой Meepo умер во время дуэли, заклинатель урона не получит.",
        "Победа над Tempest Double не дает бонуса.",
        "Победа дает урон, даже если у цели было воскрешение.",
        "Если победила Legion Commander, то она получает бафф от Press the Attack текущего уровня. В режиме Ability Draft для применения эффекта при победе на заклинателя должна быть выбрана Press the Attack.",
        "В режиме Ability Draft для применения эффекта при победе на заклинателя должна быть выбрана Press the Attack.",
        "Можно применять на иллюзии. Иллюзии получают дополнительный урон от победы, настоящие герои — нет. Клоны героев также получают индивидуальный бонус. При этом Tempest Double при перепризыве его теряет. Клоны Meepo урон сохраняют.",
        "Клоны героев также получают индивидуальный бонус. При этом Tempest Double при перепризыве его теряет. Клоны Meepo урон сохраняют.",
        "Если двое вражеских героев связаны Soulbind и на них применяется Duel, то Legion Commander получит урон за каждого героя, умершего во время дуэли. Порядок смерти неважен, поскольку на дуэль вызываются оба героя (при этом Legion Commander атакует только главную цель). Благодаря связи за одну дуэль в случае смерти героев можно получить двойной урон.",
        "Порядок смерти неважен, поскольку на дуэль вызываются оба героя (при этом Legion Commander атакует только главную цель). Благодаря связи за одну дуэль в случае смерти героев можно получить двойной урон.",
        "С улучшением от Aghanim's Scepter увеличивает время дуэли и уменьшает получаемый урон Legion Commander и цели дуэли на 50% от других источников. Уменьшает время востановления дуэли на 20 секунд."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Duel",
      "cooldown": "50",
      "description": "Вызывает выбранного вражеского героя на дуэль, в которой соперники вынуждены атаковать друг друга небольшой промежуток времени. Они не могут применять способности или использовать предметы. Если один из героев погибнет на дуэли, победитель получит постоянный бонус к урону.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 150",
        "Доп. урон за победу: 10\/20\/30 (TagTalent 40\/50\/60)",
        "Длительность: 4\/4.75\/5.5 (TagAghanim 6\/7\/8)",
        "Увеличивает длительность дуэли, дуэлянты получают на 50% меньше урона от других источников, уменьшает время востановления."
      ],
      "legacy_key": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 25.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 1.7,
    "attrAgility": 18.0
  },
  "description": "Legion Commander — это герой с ближним типом атаки, основным атрибутом которого является сила. Ее первая способность, Overwhelming Odds, оборачивает количественное преимущество врагов против них самих, нанося им урон и даруя вам дополнительную скорость передвижения за каждое существо или героя. Наносит дополнительный урон иллюзиям и призванным существам в виде процента от их текущего здоровья. Вторая способность героя, Press the Attack, снимает все отрицательные эффекты с дружественной цели и добавляет скорость атаки и регенерацию здоровья на короткое время. Пассивная способность, Moment of Courage, будучи атакованной, дает герою пассивный шанс нанести ответный удар и восстановить часть здоровья. Ультимативная способность, Duel, вызывает героя на дуэль на небольшой промежуток времени. Legion Commander и герой не могут использовать способности или предметы. Если один из дуэлянтов умрет во время действия способности, победитель дуэли получит постоянный бонус к урону. При покупке Aghanim's Scepter в дуэли вы невосприимчивы ко всему урону, кроме урона, наносимого врагом-дуэлянтом, а так же получаете магический иммунитет на время дуэли.",
  "history": "Они пришли без предупреждения. Внутри городских стен Стоунхолла вдруг раздался ужасный грохот, и из неизведанной тьмы явились бесчисленные твари, несущие пламя и разруху, убивающие и захватывающие матерей и сыновей во имя тёмных целей. Из бывшей когда-то могучей армии Стоунхолла лишь Бронзовый легион под руководством главнокомандующей Тресдин находился рядом и смог ответить на зов помощи. Въехав в город, они начали пробиваться через окровавленные переулки и пылающие рынки, прорубая свой путь к источнику внезапного вторжения — пространственному расколу на главной площади, на краю которого бушевал лидер Орды бездны. Охваченный губительным блеском, он взмахивал своим гигантским клинком, рассекая воинов напополам, и плоть его жертв тут же начинала разлагаться. Тресдин подняла свой окровавленный меч и взглянула на чудовище. Оно обернулось, обнажив в улыбке массу клыков. Забыв о битве, бушующей вокруг, они бросились навстречу друг другу. Отражая один выпад за другим, пара кружилась в смертельном танце, пока солдаты Бронзового легиона терпели сокрушительное поражение. Тресдин сделала выпад, а враг встретил её своим мечом. Сильнейший удар сбоку заставил Тресдин покачнуться, но она собрала свои силы для ответного взмаха. Клинок ударился о клинок, вошел по рукоять в кривую лапу, разорвав её надвое, разбрызгивая ужасающую смесь искр и крови. Подлые твари ошеломленно смотрели на битву, а Тресдин не прекращала бить, вонзая меч всё глубже, прямо к неистово бьющемуся сердцу чудовища. Раздался жуткий вой, донесшийся до самых облаков, и монстр разразился потоком крови и страдания. Адский портал содрогнулся. Сила, питающая его, исчезла так же внезапно, как и появилась. Оставшиеся враги пали под напором стали Стоунхолла. Победу не было смысла праздновать: город лежал в руинах, выживших осталось совсем немного. Пожар продолжал полыхать. Развернув свои знамена, Тресдин собрала уцелевших союзников. В гневе она дала клятву отомстить силам бездны, и обречён будет тот, кто встанет на её пути.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Press the Attack по области радиусом 400",
      "talentRight": "+30 к урону за победу в дуэли"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+8% к шансу срабатывания Moment of Courage",
      "talentRight": "+30 к скорости передвижения"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+75 к урону за героя от Overwhelming Odds",
      "talentRight": "+40 здоровья в секунду от Press the Attack"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+200 к дальности применения Duel",
      "talentRight": "+100 к радиусу Overwhelming Odds"
    }
  ]
}