{
  "abilities": [
    {
      "notes": [
        "Борозда появляется сразу после применения\n У неё нет времени появления",
        "Борозда создаётся из множества сегментов, которые расположены по прямой перед Earthshaker\n Количество сегментов определяет общий диапазон борозды\n Сегменты имеют радиус столкновения в 24 единицы и расстояние между друг другом в 8,25 единиц, первый сегмент появляется в 8,25 единицах перед Earthshaker\n Фактическая длина борозды зависит от фактора 56,25\n Это рассчитывается по формуле (2 * 24 + 8,25) просчитанного радиуса и расстояния между сегментами\n Стандартная борозда (или с улучшением от таланта ) состоит из 24 ( 30) сегментов, а блокировка пути бороздой составляет 1350 ( 1687,5)\n диапазона в длину\n Каждое существо (кроме вардов и построек), которое находилось на месте появления борозды, будет отодвинуто в сторону",
        "Оглушение и урон применяются вокруг каждого сегмента\n То есть общая область урона\/оглушения состоит из множества накладывающихся друг на друга кругов, а не из единой линии\n Существо получает урон\/оглушение только один раз за применение, даже если попало в пересечение радиусов сегментов\n Может поражать существ на расстоянии до 1575 ( 1912,5) единиц перед Earthshaker и в 216,75 позади героя",
        "Борозда сначала применяет оглушение, затем наносит урон",
        "Летающие существа и существа, которые могут проходить где угодно ( Spectral Dagger,  Charge of Darkness,  Spin Web), не блокируются бороздой\n Они по прежнему могут быть затронуты ударом\n Они также будут отодвинуты в сторону, получат урон и будут оглушены",
        "Неконтролируемые игроками существа не обходят борозду, а пытаются идти дальше, будто препятствия нет\n Существа застревают до тех пор, пока не сменят направление (например, с помощью провокации) или, пока не исчезнет борозда",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Earthshaker получает беспрепятственное передвижение, когда передвигается по борозде в пределах 150 единиц от каждого сегмента\n Это значит, что он сможет свободно двигаться по борозде, а также в течение 1 секунды после того, как уйдёт с неё\n Это происходит при помощи специального модификатора\n  Aftershock применяется возле каждого сегмента борозды, но урон от нескольких сегментов не сочетается\n Длительность оглушения от Aftershock составляет 0,45\/0,55\/0,65\/0,75 секунд"
      ],
      "item_behaviour": [],
      "description": "Герой разбивает землю могучим тотемом, оставляя перед собой непроходимую каменную борозду, при этом оглушая стоящих на её пути врагов и нанося им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,69+0",
        "Дальность применения: 1400 ( 1720)",
        "Длина борозды: 1400 ( 1720)",
        "Радиус блокирования пути: 24",
        "Радиус урона\/оглушения: 225",
        "Урон: 110\/160\/210\/260 ( 200\/250\/300\/350)",
        "Длительность оглушения: 1\/1,25\/1,5\/1,75",
        "Длительность борозды: 6,5\/7\/7,5\/8",
        "Радиус беспрепятственного прохождения:  150",
        "Продолжительность беспрепятственного прохождения:  1",
        "Длительность оглушения от Aftershock:  50%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Earthshaker_Fissure_1.mp3\/revision\/latest?cb=20191216013150",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "18\/17\/16\/15 (TagTalent 16\/15\/14\/13)",
      "aghanim": null,
      "name": "Fissure",
      "cooldown": "120\/130\/140\/150",
      "legacy_key": "F",
      "story": "Силою земли нишианский тотем раскалывает поверхность планеты до её ядра."
    },
    {
      "notes": [
        "Увеличивает дальность атаки Earthshaker до 225\n Дополнительный урон рассчитывается на основе базового урона и перка основного атрибута\n Дополнительный урон не увеличивается\n Усиление от Enchant Totem не даёт эффект True Strike и не расходуется после промахов\n Усиление от Enchant Totem не даёт прорубающий урон героям  дальнего боя",
        "С <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter способность становится направленной на область\n Её можно направить только на землю или себя\n Двойное нажатие на способность автоматически наводит её на себя\n При применении на себя способность использует базовое время применения в 1,1 секунд без прыжка\n При применении на землю способность использует время применения в 0 секунд (перед применением) и в 0 секунд (после применения)\n В это время Earthshaker обезврежен\n Длительность прыжка всегда одинакова, поэтому скорость зависит от его расстояния\n Высота прыжка всегда равна 950\n Во время прыжка Earthshaker обезврежен, не имея возможности двигаться, поворачиваться, атаковать или использовать способности и предметы\n Способность считается использованной в начале прыжка\n Однако,  Aftershock и усиление тотема применяются лишь при приземлении\n Aftershock и усиление тотема применяются, даже если Earthshaker был обезврежен или убит в прыжке\n Прыжок мгновенно прерывается, если на него срабатывают другие источники принудительного движения\n Однако, в данном случае Aftershock или усиление тотема не применяются при приземлении\n Применение способности полностью и незамедлительно отменяется только при принудительном движении вверх или телепортации героя другими способностями\n Пока Earthshaker находится в воздухе, другие существа могут пройти под ним\n Сетка с кругом, при направлении способности, показывает радиус Aftershock, даже если он не изучен"
      ],
      "item_behaviour": [],
      "description": "Заряжает тотем, увеличивая урон от следующей атаки и увеличивая её дальность на 75.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,6+0,5 ( 0+0)",
        "Дополнительная дальность атаки: 75",
        "Дополнительный урон: 100%\/200%\/300%\/400% ( 150%\/250%\/350%\/450%)",
        "Длительность: 14",
        "Дальность прыжка со скипетром:  950",
        "Длительность прыжка:  0,8",
        "Начальный радиус прорубающего урона:  150",
        "Дальность прорубающего урона:  650",
        "Конечный радиус прорубающего урона:  360",
        "Дополнительный прорубающий урон:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Earthshaker_Enchant_Totem_1.mp3\/revision\/latest?cb=20191216013148",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "5 (TagTalent 3,5)",
      "aghanim": null,
      "name": "Enchant Totem",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "E",
      "story": "Неукротимая мощь Рейгора способна крушить горы."
    },
    {
      "notes": [
        "Не срабатывает от использования предметов",
        "Сначала применяет оглушение, затем наносит урон",
        "Сначала применяется урон и оглушение от Aftershock, затем эффекты использованной способности",
        "Оглушение от Aftershock не сочетается с оглушением от  Fissure\n Однако, применяется то оглушение, которое дольше длится"
      ],
      "item_behaviour": [],
      "description": "Герой сотрясает землю при каждом применении способности, нанося урон врагам поблизости и оглушая их.",
      "hot_key": "E",
      "params": [
        "Радиус: 300 ( 500)",
        "Урон: 75\/100\/125\/150 ( 125\/150\/175\/200)",
        "Длительность оглушения: 0,9\/1,1\/1,3\/1,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Aftershock",
      "cooldown": null,
      "legacy_key": "T",
      "story": "Земля содрогается от могучих шагов Рейгора."
    },
    {
      "notes": [
        "Использование Echo Slam прерывает произносимые способности Earthshaker",
        "Каждое существо в радиусе способности распространяет волны эха на врагов в пределах радиуса ударной волны",
        "Волны эха распространяются со скоростью 600",
        "Радиус ударной волны сосредоточен вокруг каждого существа, получившего базовый урон\n Волны эха распространяются на каждое существо в радиусе 600 за исключением того существа, которое распространило эхо\n Волны эха могут распространяться в радиусе 1200 от Earthshaker\n Если в радиусе находится лишь один враг, то урон он не получит, так как не сможет распространить волну самому себе",
        "Поражённые способностью вражеские герои распространяют две волны эха к каждой цели в радиусе, а не только к героям",
        "Варды и постройки не испускают и не получают урон от ударных волн",
        "Действует на невидимых существ и существ в тумане войны",
        "Общее количество урона на определённое количество героев без других существ вблизи (до учёта сопротивлений): 1 герой: 100\/140\/180 ( 100\/140\/180) урона\n 2 героя: 240\/320\/400 ( 320\/400\/480) урона каждому герою, 480\/640\/800 ( 640\/800\/960) общего урона\n 3 героя: 380\/500\/620 ( 540\/660\/780) урона каждому герою, 1140\/1500\/1860 ( 1620\/1980\/2340) общего урона\n 4 героя: 520\/680\/840 ( 760\/920\/1080) урона каждому герою, 2080\/2720\/3360 ( 3040\/3680\/4320) общего урона\n 5 героев: 660\/860\/1060 ( 980\/1180\/1380) урона каждому герою, 3300\/4300\/5300 ( 4900\/5900\/6900) общего урона.",
        "Эффект от модификатора задержки применяется на каждого врага, задетого Echo Slam\n Он действует 10,5 секунды\n Если враг погиб с этим модификатором, то его смерть засчитывается счётчиком убийств Planetfall, который используется для разблокировки второго стиля\n Если враг убит Earthshaker, то он получает модификатор эффекта убийства, который создаёт визуальные эффекты смерти при наличии Arcana-предмета"
      ],
      "item_behaviour": [],
      "description": "По земле распространяются ударные волны, наносящие урон врагам. Каждое попадание по врагу создаёт волновое эхо, которое наносит урон ближайшим врагам. Попадание по герою создаёт двойное эхо.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+1,33",
        "Радиус: 600",
        "Радиус ударной волны: 600",
        "Базовый урон: 100\/140\/180",
        "Урон от эха: 70\/90\/110 ( 110\/130\/150)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Earthshaker_Echo_Slam_1.mp3\/revision\/latest?cb=20191216013146",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "150\/130\/110",
      "aghanim": null,
      "name": "Echo Slam",
      "cooldown": "145\/205\/265",
      "legacy_key": "C",
      "story": "Одним хлопком Рейгор разламывает тектонические плиты, скручивает горы и сминает недругов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 1.4,
    "attrAgility": 12.0
  },
  "description": "Мешает врагам, оглушая их раз за разом Внезапные атаки Earthshaker не дают врагам убежать, разделяют их силы и разрывают под ними землю, а всех, кому удалось выжить, он добивает взмахами своего могучего тотема.  Поддержка Инициация Контроль Быстрый урон ★★☆",
  "history": "Словно голем или гаргулья, Рейгор когда-то лежал в земле, но сейчас свободно ступает по ней. В отличие от других, он создал себя своей волей и никому не служит. В беспокойных снах, заключённый глубоко в камне, он узнал, что жизнь проходит над ним. Любопытство пытало его. В сезон землетрясений пик горы Ишай стряхивал с себя рыхлые лавины, меняя течение рек и превращая пологие низины в бездонные разломы. Когда земля наконец перестала содрогаться, из оседающей пыли вышел наш герой, сбрасывая с себя тяжёлые валуны, словно невесомую простыню. Он сделался похожим на смертную тварь и назвался Рейгором Каменное Копыто. В его венах течёт кровь, а в лёгких проходит воздух, и это значит, что теперь он смертен. Но дух его всё ещё един с землёй; он несёт её силу в волшебном тотеме и никогда не расстаётся с ним. И в день, когда Рейгор обратится в пыль, земля с радостью примет своего блудного сына."
}