{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Dust_of_Appearance_Reveal.mp3\/revision\/latest?cb=20191227195411",
      "effects": [
        "Cast Animation: 0+0",
        "Radius: 1050",
        "Damage: 25",
        "Move Speed Slow: 20%",
        "Duration: 12"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Places a debuff on all enemies, including visible ones, within the radius upon cast. Leaving or entering the radius afterward has no effect. Reveal's ability effects are applied within the entire radius instantly upon cast despite the visual effect. Units under the effect of Shadow Dance, Depth Shroud and Disguise are not revealed despite the debuff being applied on them.",
        "Reveal's ability effects are applied within the entire radius instantly upon cast despite the visual effect.",
        "Units under the effect of Shadow Dance, Depth Shroud and Disguise are not revealed despite the debuff being applied on them.",
        "The damage is only applied to enemy units that are invisible upon cast. Units that are not invisible, or already revealed units are not damaged. Reveal first applies the damage, and then places the debuff on the targets.",
        "Reveal first applies the damage, and then places the debuff on the targets.",
        "Multiple debuffs do not stack but refresh the duration instead.",
        "Can place the debuff on units in the Fog of War and invulnerable units, but not on hidden units or on wards.",
        "The movement speed slow is applied only when the enemy units actually are invisible. This means during the fade time or fade delay of invisibility, the unit is not slowed."
      ],
      "mana": "0",
      "abilityName": "Reveal",
      "cooldown": "30",
      "description": "Reveals and slows invisible heroes by 20% in a 1050 radius around the caster for 12 seconds. Invisible units revealed by dust take 25 damage.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "80",
  "lore": null,
  "consistFrom": null,
  "name": "Dust of Appearance",
  "description": "One may hide visage, but never volume.",
  "trivia": [
    "Prior to the July 14, 2017 Patch, Dust of Appearance's active ability, Reveal, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."
  ],
  "upgradeIn": null,
  "tips": [
    "The debuff can be easily dispelled by some heroes, such as Weaver.",
    "Items like Black King Bar, Lotus Orb, Eul's Scepter of Divinity and Manta Style can also remove the debuff, so plan accordingly and consider other detection items, like Sentry Wards or a Gem of True Sight."
  ]
}