{
  "abilities": [
    {
      "notes": [
        "The strength talent effectively grants Abaddon 160 health, 0.8 health regeneration, and 8 attack damage.",
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The armor talent does not benefit illusions.",
        "The cooldown reduction talent stacks multiplicatively with other sources cooldown reduction."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "500 AoE Mist Coil",
          "talentRight": "+180 Aphotic Shield Health"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+9 Armor",
          "talentRight": "15% Cooldown Reduction"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+55 Mist Coil Heal\/Damage",
          "talentRight": "+65 Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8 Strength",
          "talentRight": "+15 Movement Speed"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Abaddon_Mist_Coil_1.mp3\/revision\/latest?cb=20191216010529",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical \/ Pure"
      ],
      "notes": [
        "The projectile travels at a speed of 1300.",
        "Deals pure damage to self and magical to enemies.",
        "The self-inflicted damage is applied instantly upon cast and never lethal, so it cannot be used to deny oneself. Deals 55\/80\/105\/130 (TagTalent 82.5\/107.5\/132.5\/157.5) damage to self.",
        "Deals 55\/80\/105\/130 (TagTalent 82.5\/107.5\/132.5\/157.5) damage to self.",
        "If the target ally turns invulnerable or hidden before projectile impact, it still gets healed by it.",
        "The heal and damage increasing talent immediately upgrades all of Abaddon's currently flying Mist Coil projectiles.",
        "The level 25 talent adds a 500 radius to this ability. The ability must be centered over a unit still. Upon cast, Abaddon sends coils towards every ally and enemy within the radius, excluding himself. These behave just like a regular cast, and can be disjointed normally. Also targets units inside the Fog of War and invisible units. However, invisible targets instantly disjoint it. The self-damage stays the same, regardless of how many targets got coiled.",
        "Upon cast, Abaddon sends coils towards every ally and enemy within the radius, excluding himself.",
        "These behave just like a regular cast, and can be disjointed normally.",
        "Also targets units inside the Fog of War and invisible units. However, invisible targets instantly disjoint it.",
        "The self-damage stays the same, regardless of how many targets got coiled.",
        "With Aghanim's Shard, Mist Coil first applies its damage, then the Curse of Avernus stack based on its current level."
      ],
      "mana": "50",
      "hotKey": "Q",
      "cooldown": "5.5 (TagTalent 4.675) (TagTalent 4.5, 3.825)",
      "description": "Abaddon releases a coil of deathly mist that can damage an enemy unit or heal a friendly unit at the cost of some of Abaddon's health.",
      "spellName": "Mist Coil",
      "params": [
        "Cast Animation: 0.25+0.4",
        "Cast Range: 575",
        "Self Damage Percentage: 50%",
        "Enemy Target Damage: 110\/160\/210\/260 (TagTalent 165\/215\/265\/315)",
        "Ally Target Heal: 110\/160\/210\/260 (TagTalent 165\/215\/265\/315)",
        "Radius: 500",
        "Causes Mist Coil to apply a Curse of Avernus stack on enemies. Lowers Cooldown for Mist Coil by 1.",
        "Can be cast on Spell Immune allies. Cannot be cast on spell immune enemies. Self damage pierces spell immunity.",
        "Blocked upon impact, as primary and secondary target, therefore, Abaddon still loses health.",
        "Can be disjointed by enemies and allies."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "A mysterious vapor from the Font of Avernus now infuses the breath of Abaddon, who releases it at will."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Abaddon_Aphotic_Shield_1.mp3\/revision\/latest?cb=20191216010532",
      "effects": [
        "Ability Target Unit",
        "Affects Allies \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Applies a strong dispel on the target upon cast. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Aphotic Shield fully negates damage (after all reductions), causing several on-damage effects to not trigger.",
        "Aphotic Shield has the second lowest priority in the group of damage negating spells. This means when combined with e.g. Borrowed Time or Refraction, the shield does not absorb any damage until the other sources are gone.",
        "This means when combined with e.g. Borrowed Time or Refraction, the shield does not absorb any damage until the other sources are gone.",
        "Does not deal damage to invisible units or units in the Fog of War. Losing the Aphotic Shield buff always causes it to burst and deal area damage, no matter how the shield was lost.",
        "Losing the Aphotic Shield buff always causes it to burst and deal area damage, no matter how the shield was lost.",
        "The area damage is independent from the amount of absorbed damage. It always deals the full 110\/140\/170\/200 (TagTalent 290\/320\/350\/380) damage.",
        "The shield capacity and damage increasing talent does not affect any of the current active Aphotic Shields. Increases both shield capacity and burst area damage despite the talent description stating it increases the shield capacity only.",
        "Increases both shield capacity and burst area damage despite the talent description stating it increases the shield capacity only.",
        "Successive casts on the same unit do not stack. Upon recast, the previous shield gets destroyed (dealing area damage) and a new one gets applied.",
        "With Aghanim's Shard, Aphotic Shield first applies its damage, then the Curse of Avernus stack based on its current level."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "W",
      "cooldown": "12\/10\/8\/6 (TagTalent 10.2\/8.5\/6.8\/5.1) (TagTalent 11\/9\/7\/5, 9.35\/7.65\/5.95\/4.25)",
      "description": "Summons dark energies around an ally unit, creating a shield that absorbs a set amount of damage before expiring. When the shield is destroyed it will burst and deal damage equal to the amount it could absorb to an area around it. Removes certain types of negative buffs and stuns on cast.",
      "spellName": "Aphotic Shield",
      "params": [
        "Cast Animation: 0.3+0.33",
        "Cast Range: 500",
        "Damage Radius: 675",
        "Shield Capacity: 110\/140\/170\/200 (TagTalent 290\/320\/350\/380)",
        "Burst Area Damage: 110\/140\/170\/200 (TagTalent 290\/320\/350\/380)",
        "Duration: 15",
        "Causes Aphotic Shield to apply a Curse of Avernus stack on enemies. Lowers Cooldown for Aphotic Shield by 1.",
        "Shield persists if it was placed before spell immunity."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The powers of the black mist rise to absorb attacks like the black mist absorbs light."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Abaddon_Curse_of_Avernus.mp3\/revision\/latest?cb=20191216010528",
      "effects": [
        "Ability Passive",
        "Affects Allies \/ Enemies"
      ],
      "notes": [
        "Each successful attack done on an enemy unit without the curse debuff, places the initial debuff, or increases its counter if it already has the debuff.",
        "The initial debuff's duration gets refreshed on each hit. The 4 hits need not all happen within 5 seconds.",
        "When the initial debuff's counter reaches 4, it gets removed and replaced by the curse debuff.",
        "Any allied heroes attacking the cursed enemy gets the speed buff. The buff is granted upon successfully landing an attack on the cursed target. This means missed attacks do not grant the buff. For ranged heroes, this also means they gain the buff only on projectile impact. The speed buff only works when attacking cursed targets. When executing an attack against a unit that is not cursed, the buff gets removed.",
        "This means missed attacks do not grant the buff. For ranged heroes, this also means they gain the buff only on projectile impact.",
        "The speed buff only works when attacking cursed targets. When executing an attack against a unit that is not cursed, the buff gets removed.",
        "The speed buff is only granted to allied heroes, illusions and clones. Non-hero units do not get the buff. Treats creep-heroes as creeps.",
        "The debuffs can be placed on buildings, but cannot be placed on wards or allied units."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Abaddon strikes an enemy, slowing the target's movement speed. If the target gets hit 4 times, they become affected by a chilling curse causing them to be silenced and slowed, and all attacks against them gain an attack speed boost.",
      "spellName": "Curse of Avernus",
      "params": [
        "Required Hits: 4",
        "Initial Move Speed Slow: 10%\/15%\/20%\/25% (TagTalent 20%\/25%\/30%\/35%)",
        "Curse Move Speed Slow: 15%\/30%\/45%\/60%",
        "Curse Attack Speed Bonus: 40\/60\/80\/100",
        "Initial Debuff Duration: 5",
        "Curse Debuff Duration: 4.5",
        "Speed Buff Duration: 4",
        "Increases base slow by 10%.",
        "Disables placing the initial debuff, or increasing its counter. If already cursed, prevents allies from gaining the speed buff upon attacking the cursed enemy."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "While the baptized draw strength from the Font, the gifts of Avernus are debilitating to the uninitiated."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8e\/Abaddon_Borrowed_Time.mp3\/revision\/latest?cb=20191216010527",
      "effects": [
        "Ability No Target (TagAghanim Aura)",
        "Affects Self (TagAghanim Allied Heroes)"
      ],
      "notes": [
        "Interrupts Abaddon's channeling abilities upon cast. Does not interrupt channeling abilities when passively activated.",
        "Borrowed Time can be manually activated even while stunned, cycloned, slept, taunted, hidden, or during Forced Movement.",
        "It cannot be manually activated, but can passively activate while silenced, hexed or prevented from acting. Abaddon is unable to ⇧ Shift-queue this ability.",
        "Abaddon is unable to ⇧ Shift-queue this ability.",
        "Applies a strong dispel on Abaddon upon activating, be it manually or passively activated.",
        "Activates automatically when a damage instance (without the HP Removal flag) drops Abaddon's health below 400, or hits Abaddon while already below 400 health. The damage is dealt before Borrowed Time is activated, meaning if the damage instance exceeds Abaddon's current health, he dies without Borrowed Time activating. This also means that it does not save Abaddon from instantly killing effects like Culling Blade and Ice Blast",
        "The damage is dealt before Borrowed Time is activated, meaning if the damage instance exceeds Abaddon's current health, he dies without Borrowed Time activating.",
        "This also means that it does not save Abaddon from instantly killing effects like Culling Blade and Ice Blast",
        "Borrowed Time fully negates damage (after all reductions), causing several on-damage effects to not trigger.",
        "Borrowed Time converts damage into healing after reductions.",
        "Borrowed Time has the highest priority in the group of damage negating spells. This means when combined with other damage negating effects (e.g. Aphotic Shield or False Promise), Borrowed Time negates the damage while the others do not. For False Promise, this means that Borrowed Time first turns damage into heals, and then it is registered by False Promise as a heal and not as damage.",
        "This means when combined with other damage negating effects (e.g. Aphotic Shield or False Promise), Borrowed Time negates the damage while the others do not.",
        "For False Promise, this means that Borrowed Time first turns damage into heals, and then it is registered by False Promise as a heal and not as damage.",
        "As with all damage manipulating effects, Borrowed Time only negates and heals from the 3 damage types. It does not heal from HP Removal. The only exceptions are Heartstopper Aura and False Promise, which it does heal from. However, it does not passively activate from them.",
        "The only exceptions are Heartstopper Aura and False Promise, which it does heal from. However, it does not passively activate from them.",
        "With Aghanim's Scepter, Borrowed Time provides a 1600 radius aura, its buff lingers for 0.5 seconds. Places a damage counting buff on allies within the radius, counting any damage the ally takes after all reductions. The counted damage is checked on each damage instance. This means only one coil may be released per damage instance, no matter how big it was. If the counted damage is higher than the 525 health trigger threshold, the threshold value gets substracted from it, and a Mist Coil gets released. Since the threshold value gets substracted from the counted damage, excess damage of big damage instances are not lost, and directly count towards the next possible trigger. This means a single 1575 damage instance (3 times larger than the trigger threshold) triggers one Mist Coil, but the next two damage instances are guaranteed to trigger a Mist Coil each. The damage counter does not react on damage flagged as HP Removal. The damage counter has no reset timer. It only resets when the ally loses the buff in between damage instances. The released Mist Coils cost health as well, like a regular cast, but do not cost mana, and are independent from the cooldown. The coils are based on Mist Coil's current level, so when it is not learnt, no coils are released. The aura does not affect invulnerable or hidden units.",
        "Places a damage counting buff on allies within the radius, counting any damage the ally takes after all reductions.",
        "The counted damage is checked on each damage instance. This means only one coil may be released per damage instance, no matter how big it was.",
        "If the counted damage is higher than the 525 health trigger threshold, the threshold value gets substracted from it, and a Mist Coil gets released.",
        "Since the threshold value gets substracted from the counted damage, excess damage of big damage instances are not lost, and directly count towards the next possible trigger.",
        "This means a single 1575 damage instance (3 times larger than the trigger threshold) triggers one Mist Coil, but the next two damage instances are guaranteed to trigger a Mist Coil each.",
        "The damage counter does not react on damage flagged as HP Removal.",
        "The damage counter has no reset timer. It only resets when the ally loses the buff in between damage instances.",
        "The released Mist Coils cost health as well, like a regular cast, but do not cost mana, and are independent from the cooldown.",
        "The coils are based on Mist Coil's current level, so when it is not learnt, no coils are released.",
        "The aura does not affect invulnerable or hidden units."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "60\/50\/40 (TagTalent 51\/42.5\/34)",
      "description": "When activated, all damage dealt to you will heal instead of harm. Most negative buffs will also be removed. If the ability is not on cooldown, it will automatically activate if your health falls below 400.",
      "spellName": "Borrowed Time",
      "params": [
        "Cast Animation: 0+0",
        "Passive Health Threshold: 400",
        "Duration: 4\/5\/6 (TagAghanim 7\/8\/9)",
        "Radius: 1600",
        "Mist Coil Trigger Health Threshold: 525",
        "Aura Linger Duration: 0.5",
        "Increases duration. While Borrowed Time is active, anytime an ally takes more than 525 damage while within 1600 range of Abaddon, an individual Mist Coil will automatically fire towards that ally.",
        "The passive activating when below 400 health is disabled. The ability to fire Mist Coils at allies is not disabled."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "The most unnatural of all the gifts of the Font of Avernus, this power defies mortal understanding. What should hurt, instead heals; and what should kill gives strength anew."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 23.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 1.5,
    "attrAgility": 23.0
  },
  "description": "Abaddon, the Lord of Avernus, is a melee strength hero known as one of the most versatile characters in Dota due to his rather low mana dependence, short spell cooldowns and a large number of viable item choices. His ability to help sustain his allies and himself plus his strong tower diving capacity give him solid lane presence. Many of his abilities offer a large sum of utility, which makes him a strong support hero. Mist Coil serves as both a single target nuke and heal that helps shift the sustainability of both allied and enemy heroes in a lane at his will, though sacrificing a portion of his own health. Aphotic Shield holds as one of the most useful abilities in the game, able to shield a target from some damage while also able to reflect said damage to a huge area. The most important aspect is how it is able to dispel many status effects such as slows and stuns. His other abilities allow him to become a mix between a semi-carry and tank. Abaddon's passive, Curse of Avernus, allows his attacks to not only slow down his enemy, but also increase the attack speed of any ally attacking the same target while also silencing the target after a set of attacks. With his ultimate, Borrowed Time, Abaddon is able to shift all non-HP-removal damage he receives into health. When not on cooldown, Borrowed Time may activate passively when his health falls under a certain threshold, even under the most dire situations. Due to his powerful spells and versatility, Abaddon is an excellent addition to any team.",
  "history": "The Font of Avernus is the source of a family's strength, a crack in primal stones from which vapors of prophetic power have issued for generations. Each newborn of the cavernous House Avernus is bathed in the black mist, and by this baptism they are given an innate connection to the mystic energies of the land. They grow up believing themselves fierce protectors of their lineal traditions, the customs of the realm—but what they really are protecting is the Font itself. And the motives of the mist are unclear. When the infant Abaddon was bathed in the Font, they say something went awry. In the child's eyes there flared a light of comprehension that startled all present and set the sacerdotes to whispering. He was raised with every expectation of following the path all scions of Avernus took—to train in war, that in times of need he might lead the family's army in defense of the ancestral lands. But Abaddon was always one apart. Where others trained with weapons, he bent himself to meditation in the presence of the mist. He drank deep from the vapors that welled from the Font, learning to blend his spirit with the potency that flowed from far beneath the House; he became a creature of the black mist. There was bitterness within the House Avernus—elders and young alike accusing him of neglecting his responsibilities. But all such accusations stopped when Abaddon rode into battle, and they saw how the powers of the mist had given him mastery over life and death beyond those of any lord the House had ever known.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "500 AoE Mist Coil",
      "talentRight": "+180 Aphotic Shield Health"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+9 Armor",
      "talentRight": "15% Cooldown Reduction"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+55 Mist Coil Heal\/Damage",
      "talentRight": "+65 Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8 Strength",
      "talentRight": "+15 Movement Speed"
    }
  ]
}