{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The lifesteal talent stacks additively with other sources of lifesteal.",
        "Armor Corruption Strike from talents is not disabled by Break. The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes.",
        "The armor corruption lasts 10 seconds, and stacks with the Armor Corruption talents of other heroes."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Triple Strike Stifling Dagger",
          "talentRight": "+7% Coup de Grace chance"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+35% Blur Evasion",
          "talentRight": "-3 Armor Corruption"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+250 Phantom Strike Cast Range",
          "talentRight": "12% Lifesteal"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-2s Stifling Dagger Cooldown",
          "talentRight": "+175 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/30\/Phantom_Assassin_Stifling_Dagger_1.mp3\/revision\/latest?cb=20191216021615",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "The Stifling Dagger travels at a speed of 1200.",
        "Upon hitting the target, the dagger causes Phantom Assassin to perform an instant attack on the target. These instant attacks can proc any attack modifiers and on-hit effects normally, except for Tidebringer. They have True Strike, but completely ignore disarms. Cleave effects are based on the target's position, damaging a trapezoid area the opposite direction where the dagger came from. Although the dagger may make it look like a ranged attack, the attack still counts as a melee attack when coming from Phantom Assassin. This means all abilities which differentiate between ranged and melee, use their melee effects and values, not ranged.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally, except for Tidebringer. They have True Strike, but completely ignore disarms.",
        "Cleave effects are based on the target's position, damaging a trapezoid area the opposite direction where the dagger came from.",
        "Although the dagger may make it look like a ranged attack, the attack still counts as a melee attack when coming from Phantom Assassin.",
        "This means all abilities which differentiate between ranged and melee, use their melee effects and values, not ranged.",
        "Stifling Dagger first reduces Phantom Assassin's total attack damage by the percentage, and then adds its own bonus base damage on top of that. This can be defined as 65 + 25%\/40%\/55%\/70% × ΣAtk The total attack damage includes all already existing attack damage changes, including temporary ones (Bash) and conditional ones (Quell). The 65 damage is also an attack damage bonus, but is added after the main damage is calculated. Attack modifiers which are based on attack damage (critical strike, lifesteal, cleave) include the 65 extra damage as well. The damage is added to Phantom Assassin's attack damage through a status buff which lasts for 0.03 seconds. Since the damage comes from a regular attack, it does not count as spell damage, but counts as attack damage. This means it is affected by damage block, unaffected by spell damage amplification and cannot spell lifesteal.",
        "This can be defined as 65 + 25%\/40%\/55%\/70% × ΣAtk",
        "The total attack damage includes all already existing attack damage changes, including temporary ones (Bash) and conditional ones (Quell).",
        "The 65 damage is also an attack damage bonus, but is added after the main damage is calculated.",
        "Attack modifiers which are based on attack damage (critical strike, lifesteal, cleave) include the 65 extra damage as well.",
        "The damage is added to Phantom Assassin's attack damage through a status buff which lasts for 0.03 seconds.",
        "Since the damage comes from a regular attack, it does not count as spell damage, but counts as attack damage.",
        "This means it is affected by damage block, unaffected by spell damage amplification and cannot spell lifesteal.",
        "The dagger first applies the attack, then its own debuff.",
        "The projectile has 450 range flying vision. This vision lingers for 3.34 seconds at the target's location upon successfully hitting it.",
        "Cannot be cast on Couriers.",
        "With the triple strike talent, Stifling Dagger launches 2 additional projectiles towards random visible valid targets within the range. The search range is based on the cast range, plus the buffer, resulting in a search range of 850\/1050\/1250\/1450. Cannot target the primary target with the additional projectiles, so when no other targets are nearby, nothing happens. The secondary targets are chosen randomly within the area. There are no priorities. The projectiles cannot choose both the same target. Since the additional projectiles use the ability's cast range, cast range increasing effects increase their range as well.",
        "The search range is based on the cast range, plus the buffer, resulting in a search range of 850\/1050\/1250\/1450.",
        "Cannot target the primary target with the additional projectiles, so when no other targets are nearby, nothing happens.",
        "The secondary targets are chosen randomly within the area. There are no priorities. The projectiles cannot choose both the same target.",
        "Since the additional projectiles use the ability's cast range, cast range increasing effects increase their range as well."
      ],
      "mana": "30",
      "hotKey": "Q",
      "cooldown": "6 (TagTalent 4)",
      "description": "Throws a dagger slowing the enemy unit's movement speed, dealing 65+25%\/40%\/55%\/70% of Phantom Assassin's attack damage as physical damage and applying attack effects from items and abilities.",
      "spellName": "Stifling Dagger",
      "params": [
        "Cast Animation: 0.3+0.47",
        "Cast Range: 550\/750\/950\/1150",
        "Number of Targets: 1 (TagTalent 3)",
        "Base Damage: 65",
        "Attack Damage: 25%\/40%\/55%\/70%",
        "Move Speed Slow: 50%",
        "Slow Duration: 1.75\/2.5\/3.25\/4",
        "Secondary Target Range Buffer: 300",
        "Can be cast on spell immune units. The attack pierces spell immunity, the slow does not. Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "Blocked upon impact, as primary and secondary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "The first skill learned by the Sisters of the Veil often signals an incoming hit."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Phantom_Assassin_Phantom_Strike.mp3\/revision\/latest?cb=20191216021614",
      "effects": [
        "Ability Target Unit",
        "Affects Self"
      ],
      "notes": [
        "Phantom Strike can be cast on allied units, without gaining the attack speed bonus.",
        "Moves Phantom Assassin next to the target, towards the position she was upon spell cast.",
        "Does not disjoint projectiles upon teleporting.",
        "Phantom Assassin is ordered to attack the target if it is an enemy, automatically canceling the cast backswing.",
        "Cannot be cast on Couriers."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "W",
      "cooldown": "11\/9\/7\/5",
      "description": "Teleports to a unit, friendly or enemy, and grants bonus attack speed while attacking if it's an enemy unit.",
      "spellName": "Phantom Strike",
      "params": [
        "Cast Animation: 0.25+0.8",
        "Cast Range: 1000 (TagTalent 1250)",
        "Attack Speed Bonus: 75\/100\/125\/150",
        "Duration: 2"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Mortred's silken veil is the last thing her unfortunate target sees."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Phantom_Assassin_Blur_1.mp3\/revision\/latest?cb=20191216021620",
      "effects": [
        "Ability No Target \/ Passive",
        "Affects Self"
      ],
      "notes": [
        "Interrupts Phantom Assassin's channeling abilities on cast.",
        "Turns Phantom Assassin invisible, with True Sight immunity. Only Chronosphere can reveal her.",
        "Attacking or casting abilities does not break the invisibility.",
        "The effect is dispelled when getting within 600 range of an enemy hero (including clones, excluding illusions) or an enemy building. The effect is not dispelled instantly, but 0.5 (TagTalent 0.75) seconds after getting within range. Getting out of range during that delay does not prevent it from dispelling. The delay does not serve as a grace period. The effect is also dispelled when attacking Roshan, again, not instantly, but after the dispel delay.",
        "The effect is not dispelled instantly, but 0.5 (TagTalent 0.75) seconds after getting within range.",
        "Getting out of range during that delay does not prevent it from dispelling. The delay does not serve as a grace period.",
        "The effect is also dispelled when attacking Roshan, again, not instantly, but after the dispel delay.",
        "The passive evasion and the active component are independent from each other. Blur's evasion stacks diminishingly with other sources of evasion and uses pseudo-random distribution.",
        "Blur's evasion stacks diminishingly with other sources of evasion and uses pseudo-random distribution.",
        "On average, Blur increases Phantom Assassin's survivability against physical attacks by 18%\/33%\/54%\/82% (TagTalent 100%\/150%\/233%\/400%).",
        "With Aghanim's Scepter, Blur has an instant cast time and applies a basic dispel on Phantom Assassin upon cast. Resets the cooldowns of all her basic abilities regardless how the kill was made. The cooldown resetting is bound to Blur as well. If not learnt, kills do not reset her cooldowns. In Ability Draft, the cooldown resetting affects every ability except for ultimates.",
        "Resets the cooldowns of all her basic abilities regardless how the kill was made.",
        "The cooldown resetting is bound to Blur as well. If not learnt, kills do not reset her cooldowns.",
        "In Ability Draft, the cooldown resetting affects every ability except for ultimates."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "60\/55\/50\/45 (TagTalent 10)",
      "description": "Phantom Assassin focuses inward, increasing her ability to evade enemy attacks. Can be activated to blur her body, causing her to be impossible to see until near enemy heroes.",
      "spellName": "Blur",
      "params": [
        "Cast Animation: 0.4+0.57 (TagAghanim 0+0)",
        "Passive Evasion: 15%\/25%\/35%\/45% (TagTalent 50%\/60%\/70%\/80%)",
        "Vanish Dispel Radius: 600",
        "Vanish Fade Time: 0",
        "Vanish Dispel Delay: 0.5 (TagAghanim 0.75)",
        "Vanish Duration: 25",
        "Causes Blur to have instant cast time and applies a dispel. Anytime you get a hero kill, your abilities are refreshed. Reduces Blur cooldown and increases Fade Time to 0.75.",
        "The passive evasion is disabled by Break."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Meditation allows a Veiled Sister to carefully anticipate her opponents in combat."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Phantom_Assassin_Fan_of_Knives_1.mp3\/revision\/latest?cb=20210102190424",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Applies Break on hit enemies.",
        "Despite the visual effect, Fan of Knives releases a single pulse that expands outwards, hitting all enemies as it reaches them. The released daggers only have a visual purpose, the pulse affects all enemies it catches, regardless of the number of visible daggers.",
        "The released daggers only have a visual purpose, the pulse affects all enemies it catches, regardless of the number of visible daggers.",
        "The pulse spreads at a speed of 1000 and takes 0.55 seconds to reach maximum range. The area of effect is centered around the cast location, it does not move along with the caster.",
        "The area of effect is centered around the cast location, it does not move along with the caster.",
        "The pulse is not a ring. It affects every enemy within its expanding area of effect. This means it is not possible to avoid the effect by blinking over the daggers\/pulse towards the caster.",
        "This means it is not possible to avoid the effect by blinking over the daggers\/pulse towards the caster.",
        "Fan of Knives first applies the debuff, then the damage."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "20",
      "description": "Phantom Assassin releases sharp blades around her in a 550 AoE, dealing 16% of a victim's max health on impact and applying break for 3 seconds.",
      "spellName": "Fan of Knives",
      "params": [
        "Cast Animation: 0.15+0.9",
        "Radius: 550",
        "Max Health as Damage: 16%",
        "Debuff Duration: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/93\/Phantom_Assassin_Coup_de_Grace_1.mp3\/revision\/latest?cb=20191216021612",
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Increases attack damage by an average of 15%\/33.75%\/52.5% (TagTalent 22%\/49.5%\/77%).",
        "The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher crit multiplier has priority.",
        "If two sources of critical strike proc at the same time, the higher crit multiplier has priority.",
        "Coup de Grace uses pseudo-random distribution.",
        "A part of the visual effects (a white glow on her weapon) plays during the start of an attack, revealing that the attack is going to crit.",
        "Coup de Grace does not work against allied units, buildings or wards."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Phantom Assassin refines her combat abilities, gaining a chance of delivering a devastating critical strike to enemy units. Stifling Dagger shares the same critical strike chance.",
      "spellName": "Coup de Grace",
      "params": [
        "Proc Chance: 15% (TagTalent 22%)",
        "Critical Damage: 200%\/325%\/450%",
        "Grants a new ability: Fan of Knives.",
        "Red critical numbers are before illusion and armor reduction."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "A divine strike, Mortred honors her opponent by choosing them for death."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 21.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 3.4,
    "attrAgility": 23.0
  },
  "description": "Mortred, the Phantom Assassin, is a melee agility hero fitting the role of hard carry. Mortred is best-known, and infamous for, her ability to inflict staggering damage with single strikes. Her abilities synergize supremely well with each other, rendering her an extremely formidable foe once she has acquired the items she requires. She is a very farm-dependent melee Hero, but she farms creeps with much more ease than many of her fellow carries, using her Stifling Dagger for last hitting. Besides eliminating the weakness most melee Heroes have in their farming, her second ability, Phantom Strike, acts as both her escape and initiate, while Blur gives her an edge against other Heroes that depend on their physical attacks by evading them; giving her partial damage immunity to many carries. Her ultimate, the strongest critical strike in the game, is what connects Mortred with four-digit damage and what gives her a place amongst the very best support killers in the late game, since they usually fall instantly from the divine strike her ultimate provides. Mobile and able to fight back nearly every enemy that dares to face her, Mortred is a formidable foe that should never be underestimated, and with appropriate item choices and a few kills, she can snowball out of control and become next to impossible to stop.",
  "history": "Through a process of divination, children are selected for upbringing by the Sisters of the Veil, an order that considers assassination a sacred part of the natural order. The Veiled Sisters identify targets through meditation and oracular utterances. They accept no contracts, and never seem to pursue targets for political or mercenary reasons. Their killings bear no relation to any recognizable agenda, and can seem to be completely random: A figure of great power is no more likely to be eliminated than a peasant or a well digger. Whatever pattern the killings may contain, it is known only to them. They treat their victims as sacrifices, and death at their hand is considered an honor. Raised with no identity except that of their order, any Phantom Assassin can take the place of any other; their number is not known. Perhaps there are many, perhaps there are few. Nothing is known of what lies under the Phantom Veil. Except that this one, from time to time, when none are near enough to hear, is known to stir her veils with the forbidden whisper of her own name: Mortred.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Triple Strike Stifling Dagger",
      "talentRight": "+7% Coup de Grace chance"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+35% Blur Evasion",
      "talentRight": "-3 Armor Corruption"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+250 Phantom Strike Cast Range",
      "talentRight": "12% Lifesteal"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-2s Stifling Dagger Cooldown",
      "talentRight": "+175 Health"
    }
  ]
}