{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-0.25s Battery Assault Interval",
          "talentRight": "Spell Immunity Inside Power Cogs"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 Rocket Flare Damage",
          "talentRight": "Rocket Flare True Sight"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+24 Battery Assault Damage",
          "talentRight": "+2 Power Cogs Hit To Kill"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+60 Power Cogs Mana Burn",
          "talentRight": "-2s Rocket Flare Cooldown"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Clockwerk_Battery_Assault_1.mp3\/revision\/latest?cb=20191215184902",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Interrupts Clockwerk's channeling abilities upon cast.",
        "Remains active even if Clockwerk is disabled.",
        "Discharges a total of 16 (TagTalent 24) shrapnels, starting immediately upon cast.",
        "Can deal a total of 320\/720\/1120\/1520 damage without any talents (before reductions). With the level 15 damage increasing talent, it deals a total of 704\/1104\/1504\/1904 damage. With the level 25 interval reducing talent, it deals a total of 480\/1080\/1680\/2280 damage. With both talents, it deals a total of 1056\/1656\/2256\/2856 damage.",
        "With the level 15 damage increasing talent, it deals a total of 704\/1104\/1504\/1904 damage.",
        "With the level 25 interval reducing talent, it deals a total of 480\/1080\/1680\/2280 damage.",
        "With both talents, it deals a total of 1056\/1656\/2256\/2856 damage.",
        "The damage increasing talent immediately updates the currently running instance.",
        "However, the interval reducing talent does not affect the currently running instance. It does not update the interval upon refreshing the current instance either. The current instance must expire first.",
        "It does not update the interval upon refreshing the current instance either. The current instance must expire first.",
        "Each shrapnel first applies the damage, then the debuff.",
        "Hits units in the Fog of War, but not invisible, invulnerable and hidden units.",
        "The buff from multiple casts of Battery Assault do not stack but gets refreshed instead."
      ],
      "mana": "100",
      "hotKey": "Q",
      "cooldown": "24\/22\/20\/18",
      "description": "Discharges high-powered shrapnel at random nearby enemy units, dealing minor magical damage and ministun.",
      "spellName": "Battery Assault",
      "params": [
        "Cast Animation: 0+0",
        "Search Radius: 275",
        "Shrapnel Interval: 0.7 (TagTalent 0.45)",
        "Damage per Shrapnel: 20\/45\/70\/95 (TagTalent 44\/69\/94\/119)",
        "Stun Duration: 0.1",
        "Assault Duration: 10.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Clockwerk_Power_Cogs_1.mp3\/revision\/latest?cb=20191215184910",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The cogs are always placed in the same formation. 8 cogs are placed so that they form a circle around Clockwerk. The center of the circle is empty. Each cog is spawned 215 range away from Clockwerk, effectively blocking a 255 radius circle due to their collision size. All cogs are placed with a 164.5 range distance from each other. Together with their collision size, the gap between the cogs is 4.5. This means that any unit trapped within the center of the circle cannot move out unless it has unobstructed movement.",
        "8 cogs are placed so that they form a circle around Clockwerk. The center of the circle is empty.",
        "Each cog is spawned 215 range away from Clockwerk, effectively blocking a 255 radius circle due to their collision size.",
        "All cogs are placed with a 164.5 range distance from each other. Together with their collision size, the gap between the cogs is 4.5.",
        "This means that any unit trapped within the center of the circle cannot move out unless it has unobstructed movement.",
        "A cog shocks the first enemy unit which comes within 185 range of it from the outside. A cog can only shock a unit once.",
        "The cogs only shock units that have mana (e.g. Ranged Creep), units without mana are not shocked (e.g. Roshan).",
        "The shock requires no vision and can hit invisible enemies, or enemies in the Fog of War.",
        "The shock is a 300 distance knockback at a speed of 300, so it lasts exactly 1 second.",
        "Knocks units back into the direction they approach the cog from.",
        "During the knockback, the unit is fully disabled. The damage and mana loss are applied at the end of the knockback. Applies the damage first, and then the mana loss.",
        "The damage and mana loss are applied at the end of the knockback. Applies the damage first, and then the mana loss.",
        "Does not shock units who are already under the effect of other sources of Forced Movement, except for Force Staff and Hurricane Pike.",
        "Although the cogs deliver the shocks, the effects (damage, mana loss, knockback) are sourced to the caster, not the cog.",
        "Destroys trees enemies come in contact with during the knockback.",
        "Despite having 100 health, attacking the cogs deals 0 damage. The cogs' health bar does not visually decrease when attacking them either.",
        "Non-player-controlled units (i.e. lane creeps) do not try to path around the cogs, but simply walk against them as if they are not there. This effectively causes them to get stuck, until they change directions (e.g. when being aggro'd), or until the cogs dissipate.",
        "This effectively causes them to get stuck, until they change directions (e.g. when being aggro'd), or until the cogs dissipate.",
        "The cogs can also be attacked and destroyed or denied by allies, taking the same amount of attacks as enemies. Only Clockwerk can destroy them in one hit.",
        "Only Clockwerk can destroy them in one hit.",
        "With the level 25 talent, a 225 radius aura is created at the center of the cogs. The aura provides spell immunity to the caster. Other units under their control are not affected. The aura always lasts the full duration, even if all cogs get destroyed. The aura's buff lingers for 0.5 seconds.",
        "The aura provides spell immunity to the caster. Other units under their control are not affected.",
        "The aura always lasts the full duration, even if all cogs get destroyed.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": "80",
      "hotKey": "W",
      "cooldown": "15",
      "description": "Forms a barrier of energized cogs around Clockwerk, trapping any units that are near. Enemies outside the trap that touch a cog are knocked back, losing health and mana. Once a cog has delivered a shock, it will power down. Cogs can be destroyed by enemy attacks, but Clockwerk can destroy them with just one.",
      "spellName": "Power Cogs",
      "params": [
        "Cast Animation: 0.2+0.5",
        "Cogs Spawn Radius: 215",
        "Number of Cogs: 8",
        "Attacks to Destroy: 2 (TagTalent 4)",
        "Shock Search Radius: 185",
        "Shock Damage: 50\/125\/200\/275",
        "Shock Mana Loss: 50\/80\/110\/140 (TagTalent 110\/140\/170\/200)",
        "Shock Knockback Distance: 300",
        "Shock Knockback Duration: 1",
        "Cogs Duration: 5\/6\/7\/8",
        "Spell Immunity Radius: 225",
        "Spell Immunity Linger Duration: 0.5",
        "Burns mana and attempts to damage if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/da\/Clockwerk_Rocket_Flare_1.mp3\/revision\/latest?cb=20191215184914",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The Rocket Flare travels at a speed of 2250.",
        "Provides flying vision in a 600 radius for 1 second while traveling and for 6 seconds at the targeted area after reaching it. With the level 20 talent, Rocket Flare also provides 600 radius True Sight at the targeted area for 10 seconds. The True Sight is provided by an aura which affects enemies. Its debuff lingers for 0.5 seconds. The rocket can not reveal trees enchanted by Eyes In The Forest. However, it does not add True Sight to rockets which already reached their targeted point and exploded.",
        "With the level 20 talent, Rocket Flare also provides 600 radius True Sight at the targeted area for 10 seconds.",
        "The True Sight is provided by an aura which affects enemies. Its debuff lingers for 0.5 seconds.",
        "The rocket can not reveal trees enchanted by Eyes In The Forest.",
        "However, it does not add True Sight to rockets which already reached their targeted point and exploded.",
        "Both damage increasing and True Sight granting talents immediately upgrade all of Clockwerk's currently flying rockets.",
        "The rocket can be seen on the minimap. It appears green to allies and red to enemies (enemies require vision over it to see it)."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "E",
      "cooldown": "20\/18\/16\/14 (TagTalent 18\/16\/14\/12)",
      "description": "Fires a global range flare that explodes over a given area, damaging enemies and providing vision for 6 seconds.",
      "spellName": "Rocket Flare",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: Global",
        "Radius: 600",
        "Damage: 80\/120\/160\/200 (TagTalent 180\/220\/260\/300)",
        "Vision Duration: 6",
        "True Sight Duration: 10",
        "True Sight Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0f\/Clockwerk_Overclocking_1.mp3\/revision\/latest?cb=20191215184907",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Interrupts Clockwerk's channeling abilities upon cast.",
        "Reset all of the caster's ability cooldowns. Item cooldowns are not reset.",
        "The stun at the end of the duration cannot be avoided. It is applied even when invulnerable or hidden. The stun duration is unaffected by status resistance.",
        "The stun duration is unaffected by status resistance.",
        "Recasting Overclocking refreshes the debuff's duration, but does not reset cooldowns again."
      ],
      "mana": "150",
      "hotKey": "D",
      "cooldown": "60",
      "description": "Resets Clockwerk's ability cooldowns and grants him bonus movement and attack speed for a duration. Clockwerk becomes stunned after the duration runs out.",
      "spellName": "Overclocking",
      "params": [
        "Cast Animation: 0+0",
        "Move Speed Bonus: 30%",
        "Attack Speed Bonus: 200",
        "Duration: 8",
        "Stun Duration: 4"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Clockwerk_Jetpack_1.mp3\/revision\/latest?cb=20201224171015",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "While Jetpack is active, the caster does not need to turn to cast abilities or items.",
        "For better readability, the turn rate during the flight is given as degrees per second, instead of radians per 0.03 seconds. 75° per second equal a turn rate of 0.039.",
        "75° per second equal a turn rate of 0.039.",
        "Clockwerk turns for a maximum of 1 second per issued move order. This means a single move order does not cause him to fly in a circle around the targeted point. Clockwerk's final path and direction pre-move order depends on a vector from his position to the targeted point, which is always parallel with the path.",
        "Clockwerk's final path and direction pre-move order depends on a vector from his position to the targeted point, which is always parallel with the path.",
        "Clockwerk is not disabled while flying and can use any items and abilities normally. Casting Hookshot ends Jetpack if it latches on a target and starts pulling. Does not end it if it misses.",
        "Casting Hookshot ends Jetpack if it latches on a target and starts pulling. Does not end it if it misses.",
        "The flight speed equals Clockwerk's movement speed."
      ],
      "mana": "75",
      "hotKey": "F",
      "cooldown": "16",
      "description": "Rises up, granting Clockwerk flying vision, flying movement, and a 20% bonus movement speed. Clockwerk has a severely-limited turn rate during this time and cannot attack. Lasts up to 6 seconds or until he casts Hookshot.",
      "spellName": "Jetpack",
      "params": [
        "Cast Animation: 0+0.53",
        "Turn Rate in Degrees per Second: 75°",
        "Move Speed Bonus: 20%",
        "Duration: 6"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Clockwerk_Hookshot_1.mp3\/revision\/latest?cb=20191215184903",
      "effects": [
        "Ability Target Point",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The hook travels at a speed of 4000\/5000\/6000, taking a maximum of 0.5 seconds to reach max length.",
        "When the hook latches on a unit, Clockwerk gets pulled towards it at the same speed as the hook itself.",
        "Clockwerk is silenced and disarmed during the pull, preventing ability usage and attacking. Items can be used.",
        "The pull gets canceled when Clockwerk gets affected by other sources of Forced Movement.",
        "Clockwerk gets pulled towards the latched unit's current location, and not towards the original location where the hook latched on it. This means when the target moves or gets moved, Clockwerk's trajectory adapts immediately. The pulling lasts a maximum of 0.5 seconds, so if the target moves away, Clockwerk may not fully reach it.",
        "This means when the target moves or gets moved, Clockwerk's trajectory adapts immediately.",
        "The pulling lasts a maximum of 0.5 seconds, so if the target moves away, Clockwerk may not fully reach it.",
        "The area damage and stun around Clockwerk always happens, regardless of whether the hook latched on an ally or enemy.",
        "When latching on an ally, the ally is not disabled and can act freely. It is not interrupted either.",
        "When latching on an enemy, it gets stunned for 1.5\/1.75\/2 seconds, or until Clockwerk reaches it. This means if Clockwerk does not reach it, it is stunned for the full duration. This can happen when either the pull gets canceled, or when the target gets moved too far away during the pull.",
        "This means if Clockwerk does not reach it, it is stunned for the full duration.",
        "This can happen when either the pull gets canceled, or when the target gets moved too far away during the pull.",
        "The latched enemy is also hit by the stun and area damage. This means the latched target is stunned up to 0.5 seconds longer than secondary targets, due to the initial latch stun.",
        "This means the latched target is stunned up to 0.5 seconds longer than secondary targets, due to the initial latch stun.",
        "Hookshot first applies the debuff, then the damage.",
        "Fully ignores Couriers."
      ],
      "mana": "150",
      "hotKey": "R",
      "cooldown": "60\/45\/30",
      "description": "Fires a grappling device rapidly at the target location. If the hook hits a unit, Clockwerk launches himself into the target, stunning and dealing damage. Any enemies Clockwerk collides with along the way are damaged and stunned.",
      "spellName": "Hookshot",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 2000\/2500\/3000",
        "Max Travel Distance: 2000\/2500\/3000",
        "Hook Latch Radius: 125",
        "Stun & Damage Radius: 175",
        "Damage: 75\/175\/275",
        "Stun Duration: 1.5\/1.75\/2",
        "Grants a new ability: Overclocking.",
        "Grants a new ability: Jetpack."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 26.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 2.3,
    "attrAgility": 13.0
  },
  "description": "Rattletrap, the Clockwerk, is a melee strength hero known as being one of the most well-rounded initiator-gankers in the game. Rattletrap's wide array of disables and nukes allows him to cause chaos among the enemy team and break up their formation, giving his team a powerful advantage in any fight. Battery Assault allows Clockwerk to inflict repeated damage ticks and mini-stuns on nearby enemies, allowing him to constantly hinder any enemies he manages to get close to and single out. He can also disrupt enemy movement and pen in foes with his Power Cogs, which induces an electric shock to foes outside, stunning them while damaging them and burning their mana, and can render enemies caught inside helpless. His damage nuke, Rocket Flare, gives him global nuking power that also provides scouting vision for him and his team. Finally, his ultimate, Hookshot, allows Rattletrap to instantaneously latch onto and stun a foe from long range, making him a very strong ganker. Few can escape Clockwerk once he has his sights locked in, and his machinations make him a powerful ally to have on any team.",
  "history": "Rattletrap descends from the same far-flung kindred as Sniper and Tinker, and like many of the Keen Folk, has offset his diminutive stature through the application of gadgetry and wit. The son of the son of a clockmaker, Rattletrap was many years apprenticed to that trade before war rode down from the mountains and swept the plains villages free of such innocent vocations. \"Your new trade is battle,\" his dying father told him as the village of their ancestors lay in charred and smoking ruins. It is a poor tradesman who blames his tools, and Rattletrap was never one to make excuses. After burying his father among the ruins of their village, he set about to transform himself into the greatest tool of warfare that any world had ever seen. He vowed to never again be caught unprepared, instead using his talents to assemble a suit of powered Clockwerk armor to make the knights of other lands look like tin cans by comparison. Now Rattletrap is alive with devices, a small but deadly warrior whose skills at ambush and destruction have risen to near-automated levels of efficiency. An artisan of death, his mechanizations make short work of the unwary, heralding a new dawn in this age of warfare. What time is it? It's Clockwerk time!",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-0.25s Battery Assault Interval",
      "talentRight": "Spell Immunity Inside Power Cogs"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 Rocket Flare Damage",
      "talentRight": "Rocket Flare True Sight"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+24 Battery Assault Damage",
      "talentRight": "+2 Power Cogs Hit To Kill"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+60 Power Cogs Mana Burn",
      "talentRight": "-2s Rocket Flare Cooldown"
    }
  ]
}