{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Queen of Pain: 220 здоровья и 1,1 восстановления здоровья.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Поглощение направленного заклинания раз в 18 сек.",
          "talentRight": "−2 сек. перезарядки Blink"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Shadow Strike в радиусе 525 вокруг цели",
          "talentRight": "+120 к урону от от Scream of Pain"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к скорости атаки",
          "talentRight": "+2 срабатывания Shadow Strike"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+11 к силе",
          "talentRight": "+20 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a2\/Queen_of_Pain_Shadow_Strike.mp3\/revision\/latest?cb=20191216022210",
      "effects": [
        "Способность Направленная на существо \/ Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Кинжал летит со скоростью 900 единиц.",
        "Замедление уменьшается каждую секунду. Ниже указано, как Shadow Strike замедляет с каждой секундой на каждом уровне: Уровень 1: 20,0% \/ 16,3% \/ 13,1% \/ 10,3% \/ 8,1% \/ 6,2% \/ 4,7% \/ 3,5% \/ 2,5% \/ 1,8% \/ 1,3% \/ 0,9% \/ 0,6% \/ 0,4% \/ 0,3% Уровень 2: 35,0% \/ 28,5% \/ 22,9% \/ 18,1% \/ 14,1% \/ 10,8% \/ 8,2% \/ 6,1% \/ 4,5% \/ 3,2% \/ 2,3% \/ 1,6% \/ 1,1% \/ 0,8% \/ 0,5% Уровень 3: 50,0% \/ 40,8% \/ 32,7% \/ 25,9% \/ 20,1% \/ 15,5% \/ 11,7% \/ 8,7% \/ 6,4% \/ 4,6% \/ 3,3% \/ 2,3% \/ 1,6% \/ 1,1% \/ 0,7% Уровень 4: 65,0% \/ 53,0% \/ 42,5% \/ 33,6% \/ 26,2% \/ 20,1% \/ 15,2% \/ 11,3% \/ 8,3% \/ 6,0% \/ 4,3% \/ 3,0% \/ 2,1% \/ 1,4% \/ 0,9%",
        "Уровень 1: 20,0% \/ 16,3% \/ 13,1% \/ 10,3% \/ 8,1% \/ 6,2% \/ 4,7% \/ 3,5% \/ 2,5% \/ 1,8% \/ 1,3% \/ 0,9% \/ 0,6% \/ 0,4% \/ 0,3%",
        "Уровень 2: 35,0% \/ 28,5% \/ 22,9% \/ 18,1% \/ 14,1% \/ 10,8% \/ 8,2% \/ 6,1% \/ 4,5% \/ 3,2% \/ 2,3% \/ 1,6% \/ 1,1% \/ 0,8% \/ 0,5%",
        "Уровень 3: 50,0% \/ 40,8% \/ 32,7% \/ 25,9% \/ 20,1% \/ 15,5% \/ 11,7% \/ 8,7% \/ 6,4% \/ 4,6% \/ 3,3% \/ 2,3% \/ 1,6% \/ 1,1% \/ 0,7%",
        "Уровень 4: 65,0% \/ 53,0% \/ 42,5% \/ 33,6% \/ 26,2% \/ 20,1% \/ 15,2% \/ 11,3% \/ 8,3% \/ 6,0% \/ 4,3% \/ 3,0% \/ 2,1% \/ 1,4% \/ 0,9%",
        "Существо под действием дебаффа Shadow Strike могут добить союзники, если уровень его максимального здоровья опустится ниже 25%.",
        "Наносит периодический урон и лечит Queen of Pain в 3 (TagTalent 2,14)-секундных интервалах, начиная через 3 (TagTalent 2,14) сек. после применения. Начальный урон наносится при столкновении со снарядом, в итоге выходит 6 (TagTalent 8) срабатываний урона. Может нанести до 130\/260\/390\/520 (TagTalent 170\/340\/510\/680) урона по цели (до уменьшений). Не лечит от столкновения снаряда, в итоге выходит 5 (TagTalent 7) срабатываний лечения. Лечит на 5\/10\/15\/20 за срабатывание от целей не-героев. Считает крипов-героев крипами. Может излечить Queen of Pain на 50\/100\/150\/200 (TagTalent 70\/140\/210\/280) здоровья от героев. Может излечить Queen of Pain на 25\/50\/75\/100 (TagTalent 35\/70\/105\/140) здоровья от не-героев. Всегда лечит на полное значение за каждое срабатывание, независимо от того сколько урона получает цель на самом деле.",
        "Начальный урон наносится при столкновении со снарядом, в итоге выходит 6 (TagTalent 8) срабатываний урона.",
        "Может нанести до 130\/260\/390\/520 (TagTalent 170\/340\/510\/680) урона по цели (до уменьшений).",
        "Не лечит от столкновения снаряда, в итоге выходит 5 (TagTalent 7) срабатываний лечения.",
        "Лечит на 5\/10\/15\/20 за срабатывание от целей не-героев. Считает крипов-героев крипами.",
        "Может излечить Queen of Pain на 50\/100\/150\/200 (TagTalent 70\/140\/210\/280) здоровья от героев.",
        "Может излечить Queen of Pain на 25\/50\/75\/100 (TagTalent 35\/70\/105\/140) здоровья от не-героев.",
        "Всегда лечит на полное значение за каждое срабатывание, независимо от того сколько урона получает цель на самом деле.",
        "Повторное применение убирает дебафф от предыдущего и накладывает новый. То есть начальный урон наносится повторно, а значение замедления и интервал тиков сбрасываются.",
        "То есть начальный урон наносится повторно, а значение замедления и интервал тиков сбрасываются.",
        "Талант 20-го уровня добавляет способности применение по области в 525 единиц. Перекрестие применения способности всё ещё должно находится на вражеском существе. При применении Queen of Pain бросает кинжалы в каждого врага в радиусе. Действие идентично обычному применению, поэтому кинжалы можно избежать. Также выбирает невидимых существ и существ в тумане войны. При этом невидимые существа мгновенно избегают снарядов.",
        "При применении Queen of Pain бросает кинжалы в каждого врага в радиусе.",
        "Действие идентично обычному применению, поэтому кинжалы можно избежать.",
        "Также выбирает невидимых существ и существ в тумане войны. При этом невидимые существа мгновенно избегают снарядов."
      ],
      "mana": "110\/120\/130\/140",
      "item_behaviour": [],
      "name": "Shadow Strike",
      "cooldown": "16\/12\/8\/4",
      "description": "Бросает кинжал, который наносит урон при попадании и отравляет цель на 15 сек. Жертва передвигается медленнее и каждые 3 сек. получает урон от яда.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,67",
        "Дальность применения: 450\/500\/550\/600",
        "Начальный урон: 30\/60\/90\/120",
        "Количество срабатываний: 5 (TagTalent 7)",
        "Урон за срабатывание: 20\/40\/60\/80",
        "Самоисцеление за срабатывание: 10\/20\/30\/40",
        "Замедление скорости передвижения: 20%\/35%\/50%\/65%",
        "Длительность: 15",
        "Радиус: 525",
        "Замедление остается и пытается наносить урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется при попадании только основной целью. Никогда не блокируется вторичными целями."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/28\/Queen_of_Pain_Blink_1.mp3\/revision\/latest?cb=20191216022215",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя (TagAghanim Врагов)",
        "Урон Магический"
      ],
      "notes": [
        "При применении позволяет избежать снарядов.",
        "Не телепортирует на полное расстояние при выборе точки, находящейся на меньшем расстоянии, чем максимальное. При выборе точки, находящейся дальше, чем позволяет способность, дистанция перемещения будет максимальной.",
        "При выборе точки, находящейся дальше, чем позволяет способность, дистанция перемещения будет максимальной.",
        "С Aghanim's Shard Blink наносит урон, а затем применяет дебафф безмолвия. Урон складывается, поэтому враги в радиусе 300 начальной и конечной точек получат урон дважды. При этом безмолвие дважды не применяется и не продляется.",
        "Урон складывается, поэтому враги в радиусе 300 начальной и конечной точек получат урон дважды.",
        "При этом безмолвие дважды не применяется и не продляется."
      ],
      "mana": "60",
      "item_behaviour": [],
      "name": "Blink",
      "cooldown": "12\/10\/8\/6",
      "description": "Телепортация на короткую дистанцию, позволяющая ворваться в схватку или быстро из неё сбежать.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,33+0,07",
        "Дальность применения: Глобальная",
        "Макс. дальность телепортации: 1075\/1150\/1225\/1300",
        "Радиус: 300",
        "Урон: 150",
        "Длительность безмолвия: 1,75",
        "В начальной и конечной точке Blink происходит звуковой удар, который наносит 150 урона в радиусе 300 и накладывает безмолвие на 1,75 секунды."
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/be\/Queen_of_Pain_Scream_of_Pain.mp3\/revision\/latest?cb=20191216022209",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании Scream of Pain прерывает произносимые заклинания Queen of Pain.",
        "Снаряды летят со скоростью в 900 единиц.",
        "Поражает невидимых существ и существ в тумане войны.",
        "Не поражает неуязвимых или спрятанных существ."
      ],
      "mana": "85\/100\/115\/130",
      "item_behaviour": [],
      "name": "Scream of Pain",
      "cooldown": "7 (TagTalent 6,86)",
      "description": "Герой издаёт пронзительный вопль, нанося урон всем врагам поблизости.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0,63",
        "Радиус: 550",
        "Урон: 75\/150\/225\/300"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f6\/Queen_of_Pain_Sonic_Wave.mp3\/revision\/latest?cb=20191216022211",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Sonic Wave распространяется со скоростью 900; требуется 1 сек., чтобы преодолеть всё расстояние.",
        "Поражает существ на расстоянии до 1350 единиц (складывается из дальности прохождения и конечного радиуса). Действует на курьеров.",
        "Действует на курьеров.",
        "Полная площадь имеет форму конуса.",
        "Угол отталкивания зависит от угла между целью и точкой применения способности Queen of Pain. То есть направление отталкивания не равно направлению применения. Близко находящихся врагов может просто откинуть в стороны. Откидывает врагов на расстояние 350 за 1,4 секунды со скоростью 250. Во время отталкивания существа не обезвреживаются. Они могут поворачиваться, атаковать, использовать заклинания и предметы. Произносимые заклинания не прерываются.",
        "То есть направление отталкивания не равно направлению применения. Близко находящихся врагов может просто откинуть в стороны.",
        "Откидывает врагов на расстояние 350 за 1,4 секунды со скоростью 250.",
        "Во время отталкивания существа не обезвреживаются. Они могут поворачиваться, атаковать, использовать заклинания и предметы. Произносимые заклинания не прерываются.",
        "Отброшенные существа разрушают деревья при перемещении.",
        "Sonic Wave сначала наносит урон, затем применяет дебафф отталкивания."
      ],
      "mana": "250\/400\/550",
      "item_behaviour": [],
      "name": "Sonic Wave",
      "cooldown": "125 (TagTalent 122,5) (TagTalent 40, 39,2)",
      "description": "Создаёт перед героем гигантскую звуковую волну, отталкивающую врагов и наносящую им огромный урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,452+0,9",
        "Дальность применения: 700",
        "Начальный радиус: 100",
        "Дальность прохождения: 900",
        "Конечный радиус: 450",
        "Урон: 340\/450\/560 (TagAghanim 420\/560\/680)",
        "Дальность отталкивания: 350",
        "Длительность отталкивания: 1,4",
        "Увеличивает урон и уменьшает время перезарядки."
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Linken%27s_Sphere_Spellblock.mp3\/revision\/latest?cb=20191227195443",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Не блокирует способности, примененные союзниками. Не блокирует способности: Ion Shell, Toss и Snowball. Не блокирует предметы: Urn of Shadows, Spirit Vessel, Medallion of Courage и Solar Crest.",
        "Не блокирует способности: Ion Shell, Toss и Snowball.",
        "Не блокирует предметы: Urn of Shadows, Spirit Vessel, Medallion of Courage и Solar Crest.",
        "Список блокируемых способностей находится в статье «Блокировка заклинаний».",
        "Сочетается с способностью Spell Block у Linken's Sphere; сначала срабатывает первая приобретенная способность.",
        "Снижение времени перезарядки действует на перезарядку способности, но сброс перезарядки - нет.",
        "Не сочетается с эффектами от Mirror Shield; при срабатывании Mirror Shield отразит заклинание, но перезарядка начнется у обоих способностей."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Блокировка заклинания",
      "cooldown": null,
      "description": "Для этой способности нет описания.",
      "hot_key": null,
      "params": [
        "У иллюзий есть бафф в полосе состояния, но он ничего не блокирует.",
        ""
      ],
      "legacy_key": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 18.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.4,
    "attrAgilityInc": 2.5,
    "attrAgility": 22.0
  },
  "description": "Акаша, Queen of Pain — герой с дальним типом атаки и основным атрибутом интеллект. Она использует свои способности, чтобы приблизиться к врагам и нанести им огромный урон по области. Благодаря этой возможности, а также умению легко преследовать одиночные цели, обычно стоит на средней линии и играет роль ганкер и полу-фарм. Blink — это основа набора способностей героини. Именно он позволяет ей врываться в драки и избегать их. Заняв атакующую позицию, Акаша со Scream of Pain и Sonic Wave способна сразу сокрушить целую команду. Погоня за блуждающими врагами — ещё одна сильная сторона Queen of Pain: с Shadow Strike она никому не оставит шанса убежать. Акаша очень ловко совершает убийства в ранней игре, и при правильной сборке превращается в отличного героя полу-фарм.",
  "history": "Правитель и верховный жрец королевства Эльзе таил страсть к боли — запретной боли. У обычного сановника такие желания сочли бы неразумными, но прознай кто, что им предаётся монаршья особа, вся вера в праведность самого Божественного престола оказалась бы под угрозой. Потому король обратился к пленным демонологам, обещая свободу тому, кто сможет призвать суккуба мучений и подчинить её воле правителя. Так и явилась в наш мир сущность по имени Акаша, и доставляла она столь изысканные муки, что монарх прозвал её своей тайной королевой и стал проводить с ней каждую свободную минуту, отдаваясь изощрённым мукам. Со временем он оставил все свои королевские обязанности в погоне за сладострастными страданиями, что могла принести лишь его королева. Она доводила его до полусмерти, однако руны повиновения сдерживали её, сохраняя правителю жизнь. В конце концов народ восстал против нерадивого монарха: его вытащили из покоев и сбросили с башни заклинателей. Стоило ему умереть, как Акаша обрела свободу, сбросила свои оковы... и теперь несёт мучения каждому, кто ей приглянется.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Поглощение направленного заклинания раз в 18 сек.",
      "talentRight": "−2 сек. перезарядки Blink"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Shadow Strike в радиусе 525 вокруг цели",
      "talentRight": "+120 к урону от от Scream of Pain"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к скорости атаки",
      "talentRight": "+2 срабатывания Shadow Strike"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+11 к силе",
      "talentRight": "+20 к урону"
    }
  ]
}