{"abilities":[{"spell":"Sprouts a ring of trees around a unit, trapping it in place.","effects":["Ability Target Point \/ Target Unit"],"notes":["Can directly be cast on any unit which is not a building or a ward and not invulnerable or hidden.","Creates a tree on every 45th degree of a 150 radius circle, resulting in 8 trees forming a ring and trapping the targeted unit.","Destroying one tree is enough to allow units to walk in and out of the ring of trees.","Trees created with Sprout act exactly like the other trees on the map. They block vision, pathing and interact with spells the same way.","Sprout grants 500 range flying vision around the targeted point for its duration.","Cannot be directly cast on ancient creeps and creep-heroes.","Units not controlled by any player do not try to path around the Sprout trees, but simply walk against them as if they are not there. This effectively causes them to get stuck, until they change directions (e.g. when aggro-ing them).","Sprout trees have a different model and are smaller than other trees on the map and they do not have a dying animation.","Tango heals for twice as long when targeting a Sprout tree, using the ward duration instead of the tree duration."],"mana":"70\/90\/110\/130","elements":["Partially blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"11\/10\/9\/8 ( 8.25\/7.5\/6.75\/6)","name":"Sprout","description":["Cast Animation: 0.35+1.14","Cast Range: 625\/700\/775\/850","Trees Spawn Radius: 150","Duration: 3\/4\/5\/6"],"hot_key":"Q","legacy_key":"T"},{"spell":"Teleports to any point on the map.","effects":["Ability Target Point","Affects Self"],"notes":["Disjoints projectiles upon teleporting.","Double-tapping the ability automatically targets the team's Fountain.","Unlike the teleports from Town Portal Scroll and Boots of Travel, canceling this one does not consume the cooldown and mana.","During the cast time, a visual effect is created around Nature's Prophet and at the target location. These visual effects are visible to everyone.","Also plays a sound at the target location, however, this is only audible to enemies when Nature's Prophet is visible to them."],"mana":"50","elements":["Cannot be cast while rooted or leashed."],"cooldown":"50\/40\/30\/20 ( 37.5\/30\/22.5\/15)","name":"Teleportation","description":["Cast Animation: 3+0","Cast Range: Global"],"hot_key":"W","legacy_key":"R"},{"spell":"Converts an area of trees into Treants. Treants have 550 health and deal 27\/30\/33\/36 damage.","effects":["Ability Target Area","Affects Trees"],"notes":["Nature's Call can only create as many treants as there are trees in the targeted area.","Destroys all trees in the target area, regardless of how many treants are created.","Treants always spawn at the center of the area.","Must have at least 1 tree within its area to be castable. Targeting an area without trees gives an error message. However, if trees within the targeted area disappear during the cast time, the spell is not canceled, wasting mana and cooldown."],"mana":"130\/140\/150\/160","elements":[],"cooldown":"37 ( 27.75)","name":"Nature's Call","description":["Cast Animation: 0.5+1.23","Cast Range: 750","Radius: 150\/225\/300\/375 ( 275\/350\/425\/500)","Number of Treants: 2\/3\/4\/5 ( 6\/7\/8\/9)","Treant Duration: 60"],"hot_key":"E","legacy_key":"F"},{"spell":"Damaging energy bounces around the map, striking enemies close to the cast point that are in vision. Each enemy hit beyond the first adds damage.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["Wrath of Nature can be cast on the ground. It automatically jumps on the closest visible enemy.","Bounces in 0.25-second intervals, so hitting all targets takes 4.25 seconds. Each bounce increases the current damage by 11%.","Does not bounce on couriers, invisible units or units in the Fog of War.","Can never hit the same unit twice per cast.","This is how much damage each bounce deals on each level (before reductions):","This is how much damage each bounce deals on each level when upgraded (before reductions):","All bounces together can collectively deal up to 5543.6\/7055.4\/8567.3 ( 6803.5\/8567.3\/10331.2) damage (before reductions).","When having Aghanim's Scepter, places a debuff on all hit enemies. When an enemy dies with the debuff on, a Treant spawns at its location. When an enemy hero (or Meepo clone) dies with the debuff on, a Greater Treant spawns instead. Illusions and Tempest Doubles spawn a regular treant. If Nature's Call is not learnt, the spawned treants instantly die, granting no experience to enemies. Wrath of Nature first applies the debuff, then the damage."],"mana":"175\/225\/275","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"60 ( 45)","name":"Wrath of Nature","description":["Cast Animation: 0.5+0.97","Cast Range: Global","Bounce Distance: Global","Number of Bounces: 18","Damage Increment per Bounce: 11%","Base Damage: 110\/140\/170 ( 135\/170\/205)","Debuff Duration: 0 ( 4)"],"hot_key":"R","legacy_key":"W"}],"bio":"When Verodicia, Goddess of the Woods, had finished filling in the green places, having planted the coiled-up spirit in the seed, having lured the twining waters from deep within the rock, having sworn the sun its full attention to the growing things, she realized that her own time had reached its end, and like one of the leaves whose fate she had imprinted in the seed, she would fall without seeing the fruiting of her dream. It pained her to leave the world bereft, for the sprouts had not yet broken through the soil--and they would be tender and vulnerable to every sort of harm. She found in her seed pouch one last seed that she had missed in the sowing. She spoke a single word into the seed and swallowed it as she fell. Her vast body decomposed throughout the long winter, becoming the humus that would feed the seedlings in the spring. And on the morning of the vernal equinox, before the rest of the forest had begun to wake, that last seed ripened and burst in an instant. From it stepped Nature's Prophet, in full leaf, strong and wise, possessing Verodicia's power to foresee where he would be needed most in defense of the green places--and any who might be fortunate enough to call him an ally.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The armor talent does not benefit illusions.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."],"trivia":["Nature's Call was called Force of Nature in DotA.","In DotA, Nature's Prophet's name was Furion, a reference to Malfurion Stormrage from the Warcraft universe. His Dota 2 name had to be changed in order to avoid copyright issues with Blizzard. He is still called Furion by the majority of the player base and is referred to as \"Furion\" in the game files.","Nature's Prophet was originally named \"Tequoia\" in Dota 2, but this was changed for unspecified reasons.","\"Nature's Profit\" is a popular nickname for Nature's Prophet, due to his farming and splitpushing playstyle.","Nature's Prophet's early lore concept made him the father of Anti-Mage, and Terrorblade (similar to how he was in DotA), but this idea was later scrapped.","Nature's Prophet's spawning response, \"I speak for the trees.\" is a direct reference and homage to Dr. Seuss' The Lorax.","One of Nature's Prophet's last hitting responses, \"Green is good.\", is a reference to \"greed is good,\" a quote from the 1987 film Wall Street, as well as the Warcraft III cheat code of the same name."],"talents":["2x Treant HP\/Damage:Removed Teleportation Cooldown","25% Cooldown Reduction:+40 Attack Speed","+4 Treants Summoned:+10 Armor","+25 Movement Speed:+30 Damage"],"desc":"Nature's Prophet is a ranged intelligence hero, whose play style is different from most intelligence heroes, because he can be almost anywhere at any given time with his Teleportation. This ability allows him to participate in most ganks and pushes at a moment's notice. With Sprout, he creates a ring of trees, trapping anyone within them in place, serving to disable anyone caught within them. The trees around him serve as his objects of power; using them, he summons sentient tree beings known as Treants from trees on the map with his Nature's Call ability. Wrath of Nature is the main and only directly damaging spell in his arsenal, but it can potentially be very powerful, as it can inflict increased damage with each bounce off subsequent enemies and can clear out multiple creep waves with its moderate cooldown and mana cost. Commonly played as a ganker, offlaner and jungler and known as a strong pusher, Nature's Prophet has superb farming capabilities and global presence, giving him the power to be anywhere on the map. Late-game, Nature's Prophet makes himself useful by constantly distracting and annoying the enemy team by pushing. If attention is not given to him, he can single-handedly win the game by constantly taking several towers or even the Ancient."}