{"abilities":[{"spell":"Окружает существо кольцом деревьев, удерживая его на месте.","effects":["Способность Направленная на точку \/ Направленная на юнита"],"notes":["Можно применить на любого юнита, который не является строением или вардом, или не находится в неуязвимом или спрятанном состоянии.","Создает деревья каждые 45 градусов в радиусе 150 единиц круга, образуя 8 деревьев в виде кольца, которое закрывает выделенного юнита.","Для выхода из круга деревьев достаточно разрушить одно из них.","Деревья, созданные способностью Sprout, ничем не отличаются от остальных деревьев на карте. Эти деревья так же блокируют обзор, путь и взаимодействуют со способностями.","Sprout дают летающий обзор в радиусе 500 единиц в месте его применения все время действия.","Нельзя напрямую применить к древним крипам и крипам-героям.","Юниты, которые не находятся под контроллем какого-либо игрока, не обходят деревья от способности, а проходят их насквозь, будто их там нет. Фактически они могут застрять до тех пор, пока не поменяют направление (т.е. пока они не среагируют на кого-либо).","У деревьев от способности модели меньше по размеру и отличаются внешним видом от деревьев, которые есть на карте, к тому же они не имеют анимацию качания."],"mana":"70\/90\/110\/130","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"11\/10\/9\/8 ( 8.25\/7.5\/6.75\/6)","name":"Sprout","description":["Анимация применения: 0,35+1,14","Дальность применения: 625\/700\/775\/850","Радиус появления деревьев: 150","Длительность: 3\/4\/5\/6"],"hot_key":"Q","legacy_key":"T"},{"spell":"Телепортирует в любую точку карты.","effects":["Способность Направленная на точку","Действует на Себя"],"notes":["Двойное нажатие на Teleportation автоматически начнет телепортировать героя на союзный фонтан.","В отличии от телепортации от Town Portal Scroll и Boots of Travel, отмена не запускает перезарядку и не тратит ману.","Во время прочтения заклинания вокруг самого Nature's Prophet и в конечной точке появляется видимый всем эффект.","Также проигрывается звук в точке применения, но слышат его только враги в случае, если они видят Nature's Prophet."],"mana":"50","elements":["Нельзя применять в оцепенении."],"cooldown":"50\/40\/30\/20 ( 0)","name":"Teleportation","description":["Анимация применения: 3+0","Дальность применения: Глобальная"],"hot_key":"W","legacy_key":"R"},{"spell":"Преобразует участок леса в энтов. Каждый из них имеет 550 здоровья и наносит 25\/28\/31\/34-29\/32\/35\/38 урона.","effects":["Способность Направленная на область","Действует на Деревья","Урон Физический"],"notes":["С помощью Nature's Call можно создать лишь столько энтов, сколько деревьев находится в зоне действия способности.","Уничтожает все деревья в участке применения, независимо от количества призванных энтов.","Энты всегда появляются в центре радиуса применения.","Требуется хотя бы одно дерево для срабатывания способности. Попытка применить на площадь без деревьев будет выдавать сообщение об ошибке. Но если в момент применения в области действия способности исчезнут все деревья, заклинание не отменится, потратит ману и уйдет в перезарядку."],"mana":"160","elements":[],"cooldown":"37 ( 27.75)","name":"Nature's Call","description":["Анимация применения: 0,5+1,23","Дальность применения: 750","Радиус: 150\/225\/300\/375 ( 275\/350\/425\/500)","Количество энтов: 2\/3\/4\/5 ( 6\/7\/8\/9)","Время жизни энтов: 60"],"hot_key":"E","legacy_key":"F"},{"spell":"Вызывает сгусток энергии, отскакивающий от врагов в зоне видимости по всей карте и наносящий им урон. С каждой новой целью урон от сгустка увеличивается.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Способность может быть применена на землю; она автоматически прыгнет по ближайшему видимому врагу.","Прыжки происходят с интервалом в 0,25 секунды, для нанесения урона всем целям потребуется 3.75 секунды. Каждый отскок увеличивает текущий урон на 11% процентов.","Не нанесет урон курьеру, невидимым юнитам или юнитам в тумане войны.","Не может попасть в одну и ту же цель дважды за одно применение.","Здесь отображено, сколько урона может нанести каждый отскок на каждом уровне способности (без учета сопротивления): Уровень 1: 110 \/ 122.1 \/ 135.5 \/ 150.4 \/ 167 \/ 185.4 \/ 205.7 \/ 228.4 \/ 253.5 \/ 281.4 \/ 312.3 \/ 346.7 \/ 384.8 \/ 427.2 \/ 474.1 \/ 526.3 Уровень 2: 140 \/ 155.4 \/ 172.5 \/ 191.5 \/ 212.5 \/ 235.9 \/ 261.9 \/ 290.7 \/ 322.6 \/ 358.1 \/ 397.5 \/ 441.2 \/ 489.8 \/ 543.7 \/ 603.5 \/ 669.8 Уровень 3: 170 \/ 188.7 \/ 209.5 \/ 232.5 \/ 258.1 \/ 286.5 \/ 318 \/ 352.9 \/ 391.8 \/ 434.9 \/ 482.7 \/ 535.8 \/ 594.7 \/ 660.2 \/ 732.8 \/ 813.4","Здесь отображено, сколько урона может нанести каждый отскок на каждом уровне способности при улучшении Aghanim's Scepter (без учета сопротивления): Уровень 1: 135 \/ 149.9 \/ 166.3 \/ 184.6 \/ 204.9 \/ 227.5 \/ 252.5 \/ 280.3 \/ 311.1 \/ 345.3 \/ 383.3 \/ 425.5 \/ 472.3 \/ 524.2 \/ 581.9 \/ 645.9 Уровень 2: 170 \/ 188.7 \/ 209.5 \/ 232.5 \/ 258.1 \/ 286.5 \/ 318 \/ 352.9 \/ 391.8 \/ 434.9 \/ 482.7 \/ 535.8 \/ 594.7 \/ 660.2 \/ 732.8 \/ 813.4 Уровень 3: 205 \/ 227.6 \/ 252.6 \/ 280.4 \/ 311.2 \/ 345.4 \/ 383.4 \/ 425.6 \/ 472.4 \/ 524.4 \/ 582.1 \/ 646.1 \/ 717.2 \/ 796.1 \/ 883.6 \/ 980.8","Все отскоки вместе могут нанести до 4310.9\/5486.6\/6662.3 ( 5290.6\/6662.3\/8033.9) единиц урона (без учета сопротивления).","С Aghanim's Scepter помечает врагов негативным эффектом. При смерти врага в момент действия эффекта на его месте появляется Энт. Если под действием эффекта умирает герой (или клон Meepo), на его месте появляется Большой энт. Смерть иллюзий и Tempest Double вызывает обычного энта. Если Nature's Call не изучена, появившиеся энты сразу умирают, давая опыт врагам."],"mana":"175\/225\/275","elements":["Частично блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60 ( 45)","name":"Wrath of Nature","description":["Анимация применения: 0,5+0,97","Дальность применения: Глобальная","Дальность отскока: Глобальная","Максимум целей: 16","Доп. урон за каждый скачок: 11%","Урон: 110\/140\/170 ( 135\/170\/205)","Длительность дебаффа: 0 ( 4)"],"hot_key":"R","legacy_key":"W"}],"bio":"Когда богиня лесов Веродиция закончила заполнять мир зеленью, посадила исполненные духом семена, выманила из каменистых глубин вьющиеся ручейки и взяла с солнца обещание хранить всё растущее, то поняла, что время её пришло к концу и, как падают отжившие своё листья, она падёт оземь, так и не узрев своих плодов. Больно ей было покидать мир, ведь ростки ещё не прорвались сквозь землю и всё еще были нежны и беспомощны. В суме для семян Веродиция нашла последнее, забытое зерно. Прошептав в него единственное слово, она проглотила его и упала оземь. За долгую зиму её необъятное тело разложилось, вскормило почву, и по весне на ней поднялись ростки. И в утро весеннего равноденствия, когда весь лес ещё даже не начал просыпаться, то самое позабытое семя взошло, и из него выступил защитник природы, в полном расцвете сил, сильный и мудрый, и нёс он волю Веродиции в те места, что нуждались в защите… и тем, кому повезло звать его союзником.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на броню не дается иллюзиям.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["В оригинальной DotA одна из способностей героя, \"Nature's Call\", называлась \"Call of Nature\".","В оригинальной DotA, он являлся отцом двух братьев-близнецов: Anti-Mage и Terrorblade. В Dota 2 это не упоминается.","Nature's Prophet также известен как Фурион, что является отсылкой к Малфуриону Ярость Бури, герою мира Warcraft. В Dota 2 герой имел имя \"Теквоя\" (англ. \"Tequoia\"), однако позже оно было удалено по непонятным причинам.","Одна из реплик Nature's Prophet при появлении - Играть \"I speak for the trees\" - это прямая отсылка и дань уважения к персонажу книг Dr. Seuss The Lorax (англ.).","Одна из реплик Nature's Prophet при завершающем ударе Играть \"Green is good\" - это отсылка к цитате \"greed is good\" из фильма 1987 года Уолл-стрит. \"greedisgood\" также является чит-кодом в Warcraft III: Reign of Chaos(а так же следующих игр серии...), который даёт игроку дополнительные ресурсы."],"talents":["+100% к здоровью\/урону энтов:Teleportation без перезарядки","-25% перезарядки способностей:+40 к скорости атаки","+4 призываемых энтов:+10 к броне","+25 к скорости передвижения:+30 к урону"],"tips":["Sprout: Способность блокирует обзор противника. В сочетании с телепортом может использоваться для быстрого спасения. Дает беспрепятственный обзор в радиусе 900 на время действия заклинания.","Teleportation: Телепортация может быть отменена, что является хорошей уловкой. На раннем этапе игры, используя эту способность, Nature's Prophet может убить вражеского курьера. Обязательно имейте с собой свиток телепортации, так как хозяева убитого курьера попытаются вас поймать.","Nature's Call: Также можно создать из созданных деревьев способностью Sprout.","Хорошей комбинацией является использование Sprout вокруг вражеского героя, с последующим применением Nature's Call, пытаясь окружить противника."],"desc":"Nature's Prophet — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, каждая из которы - активная. Его первая способность, Sprout, окружает юнита кольцом деревьев, не давая ему сбежать. Данные деревья не отличаются от обычных, и из них можно освободиться например с помощью Quelling Blade. Вторая способность, Teleportation, позволяет герою телепортироваться в любую точку карты спустя небольшое время. Третьей способностью, Nature's Call, преобразует участок деревьев в Энт которыми можно управлять. Ультимативная способность, Wrath of Nature, вызывает сгусток энергии, отскакивающий от врагов в зоне видимости по всей карте и наносящий им урон. С каждой новой целью урон от сгустка увеличивается. Улучшение с Aghanim's Scepter увеличивает урон и число отскоков. На месте смерти каждого юнита, убитого этой способностью, появляется Энт, здоровье и урон которого зависят от уровня Nature's Call. При убийстве героя появляется большой Энт, здоровье и урон которого втрое больше обычного.."}