{"abilities":[{"spell":"Окружает существо кольцом деревьев, удерживая его на месте.","effects":["Способность Направленная на точку \/ Направленная на юнита"],"notes":["Можно применить на любое существо, не являющемся строением или вардом и не находящимся в неуязвимом или спрятанном состоянии.","Создает деревья каждые 45 градусов в радиусе 150 круга, образуя 8 деревьев в виде кольца, которое закрывает выделенное существо.","Для выхода из круга деревьев достаточно разрушить одно из них.","Деревья, созданные способностью Sprout, ничем не отличаются от остальных деревьев на карте. Эти деревья так же блокируют обзор, путь и взаимодействуют со способностями.","Sprout дает летающий обзор в радиусе 500 единиц в месте его применения все время действия.","Нельзя напрямую применить к древним крипам и крипам-героям.","Существа, которые не находятся под контролем какого-либо игрока, не обходят деревья от способности, а проходят их насквозь, будто их там нет. Фактически они могут застрять до тех пор, пока не поменяют направление (т.е. пока они не среагируют на кого-либо).","Модель созданных деревьев меньше по размеру и она отличается внешним видом от деревьев, существующих на карте; к тому же эти деревья не имеют анимации разрушения.","При выборе созданных Sprout деревьев Tango лечение длится вдвое дольше.","Применение способности на край хайграунда для установки вардов (помеченных \"белым глазом\") повозволяет вытолкнуть находящегося там юнита (вроде героя), на землю."],"mana":"70\/90\/110\/130","elements":["Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"11\/10\/9\/8 ( 8,25\/7,5\/6,75\/6)","name":"Sprout","description":["Анимация применения: 0,35+1,14","Дальность применения: 625\/700\/775\/850","Радиус появления деревьев: 150","Длительность: 3\/4\/5\/6"],"hot_key":"Q","legacy_key":"T"},{"spell":"Телепортирует в любую точку карты.","effects":["Способность Направленная на точку","Действует на Себя"],"notes":["При телепортации позволяет избежать снаряды.","Двойное нажатие на способность автоматически начнет телепортировать героя на союзный фонтан.","В отличии от телепортации от Town Portal Scroll и Boots of Travel, отмена не запускает перезарядку и не тратит ману.","Во время произнесения заклинания вокруг самого Nature's Prophet и в конечной точке появляется видимый всем эффект.","Также проигрывается звук в точке применения, но слышат его только враги в случае, если они видят Nature's Prophet."],"mana":"50","elements":["Нельзя применять в оцепенении или будучи связанным."],"cooldown":"50\/40\/30\/20 ( 37,5\/30\/22,5\/15)","name":"Teleportation","description":["Анимация применения: 3+0","Дальность применения: Глобальная"],"hot_key":"W","legacy_key":"R"},{"spell":"Преобразует деревья в выбранной области в подконтрольных энтов.","effects":["Способность Направленная на область","Действует на Деревья"],"notes":["Nature's Call создать столько энтов, сколько деревьев находится в выбранной области.","Уничтожает все деревья в области применения, независимо от количества призванных энтов.","Энты всегда появляются в центре радиуса применения.","Требуется хотя бы одно дерево для срабатывания способности. Попытка применить на площадь без деревьев будет выдавать сообщение об ошибке. Но если в момент применения в области действия способности исчезнут все деревья, заклинание не отменится, потратит ману и уйдет в перезарядку."],"mana":"160","elements":[],"cooldown":"37 ( 27.75)","name":"Nature's Call","description":["Анимация применения: 0,5+1,23","Дальность применения: 750","Радиус: 150\/225\/300\/375 ( 275\/350\/425\/500)","Количество энтов: 2\/3\/4\/5 ( 6\/7\/8\/9)","Время жизни энтов: 60"],"hot_key":"E","legacy_key":"F"},{"spell":"Вызывает сгусток энергии, отскакивающий от врагов в зоне видимости по всей карте и наносящий им урон. С каждой новой целью урон от сгустка увеличивается.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Способность может быть применена на землю; она автоматически прыгнет по ближайшему видимому врагу.","Прыжки происходят с интервалом в 0,25 секунды; для нанесения урона всем целям потребуется 4.25 секунды. Каждый отскок увеличивает текущий урон на 11% процентов.","Не нанесет урон курьеру, невидимым существам или существам в тумане войны.","Не может попасть в одну и ту же цель дважды за одно применение.","Здесь указано, сколько урона может нанести каждый отскок на каждом уровне способности (до уменьшений):","Здесь указано, сколько урона может нанести каждый отскок на каждом уровне способности при улучшении Aghanim's Scepter (до уменьшений):","Все отскоки вместе могут нанести до 5543,6\/7055,4\/8567,3 ( 6803,5\/8567,3\/10331,2) единиц урона (до уменьшений).","С Aghanim's Scepter отмечает задетых врагов дебаффом. Если враг умирает под его действием, то на месте врага появляется Энт. Если под действием эффекта умирает герой (или клон Meepo), на его месте появляется Большой энт. Смерть иллюзий и Tempest Double вызывает обычного энта. Если Nature's Call не изучена, появившиеся энты сразу умирают, не давая опыт врагам. Wrath of Nature сначала применяет дебафф, затем наносит урон."],"mana":"175\/225\/275","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"60 ( 45)","name":"Wrath of Nature","description":["Анимация применения: 0,5+0,97","Дальность применения: Глобальная","Дальность отскока: Глобальная","Максимум целей: 18","Доп. урон за каждый скачок: 11%","Урон: 110\/140\/170 ( 135\/170\/205)","Длительность дебаффа: 0 ( 4)"],"hot_key":"R","legacy_key":"W"}],"bio":"Когда богиня лесов Веродиция закончила заполнять мир зеленью, посадила исполненные духом семена, выманила из каменистых глубин вьющиеся ручейки и взяла с солнца обещание хранить всё растущее, то поняла, что время её пришло к концу и, как падают отжившие своё листья, она падёт оземь, так и не узрев своих плодов. Больно ей было покидать мир, ведь ростки ещё не прорвались сквозь землю и всё еще были нежны и беспомощны. В суме для семян Веродиция нашла последнее, забытое зерно. Прошептав в него единственное слово, она проглотила его и упала оземь. За долгую зиму её необъятное тело разложилось, вскормило почву, и по весне на ней поднялись ростки. И в утро весеннего равноденствия, когда весь лес ещё даже не начал просыпаться, то самое позабытое семя взошло, и из него выступил защитник природы, в полном расцвете сил, сильный и мудрый, и нёс он волю Веродиции в те места, что нуждались в защите… и тем, кому повезло звать его союзником.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на броню не дается иллюзиям.","Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."],"trivia":["В оригинальной DotA одна из способностей героя, \"Nature's Call\", называлась \"Call of Nature\".","В оригинальной DotA, он являлся отцом двух братьев-близнецов: Anti-Mage и Terrorblade. В Dota 2 это не упоминается.","Nature's Prophet также известен как Фурион, что является отсылкой к Малфуриону Ярость Бури, герою мира Warcraft. В Dota 2 герой имел имя \"Теквоя\" (англ. \"Tequoia\"), однако позже оно было удалено по непонятным причинам.","Одна из реплик Nature's Prophet при появлении - \"I speak for the trees\" - это прямая отсылка и дань уважения к персонажу книг Dr. Seuss The Lorax (англ.).","Одна из реплик Nature's Prophet при завершающем ударе \"Green is good\" - это отсылка к цитате \"greed is good\" из фильма 1987 года Уолл-стрит. \"greedisgood\" также является чит-кодом в Warcraft III: Reign of Chaos(а так же следующих игр серии...), который даёт игроку дополнительные ресурсы."],"talents":["+100% к здоровью\/урону энтов:Teleportation без перезарядки","-25% перезарядки способностей:+40 к скорости атаки","+4 призываемых энтов:+10 к броне","+25 к скорости передвижения:+30 к урону"],"desc":"Nature's Prophet — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, каждая из которы - активная. Его первая способность, Sprout, окружает существо кольцом деревьев, не давая ему сбежать. Данные деревья не отличаются от обычных, и из них можно освободиться например с помощью Quelling Blade. Вторая способность, Teleportation, позволяет герою телепортироваться в любую точку карты спустя небольшое время. Третьей способностью, Nature's Call, преобразует участок деревьев в Энт которыми можно управлять. Ультимативная способность, Wrath of Nature, вызывает сгусток энергии, отскакивающий от врагов в зоне видимости по всей карте и наносящий им урон. С каждой новой целью урон от сгустка увеличивается. Улучшение с Aghanim's Scepter увеличивает урон и число отскоков. На месте смерти каждого существа, убитого этой способностью, появляется Энт, здоровье и урон которого зависят от уровня Nature's Call. При убийстве героя появляется большой Энт, здоровье и урон которого втрое больше обычного.."}