{"abilities":[{"spell":"Ursa slams the earth, causing a powerful shock to damage and slow all enemy units in a nearby area for 4 seconds.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Earthshock first applies the debuff, then the damage."],"mana":"75","elements":["Does not pierce spell immunity."],"cooldown":"5","name":"Earthshock","description":["Cast Animation: 0.3+0","Radius: 385 ( 985)","Damage: 50\/100\/150\/200","Move Speed Slow: 25%\/35%\/45%\/55%","Slow Duration: 4"],"hot_key":"Q","legacy_key":"E"},{"spell":"Using his skill in combat, Ursa gains increased attack speed for a number of subsequent attacks.","effects":["Ability No Target","Affects Self"],"notes":["Does not guarantee full attack speed. The provided attack speed can be negated by strong attack speed slows.","An attack charge is lost whenever an attack is executed, regardless of outcome. This means missed attacks use up charges as well.","The number of charges left is visible on the buff icon.","Successive casts do not stack, but refresh the whole amount of charges instead."],"mana":"75","elements":["Pierces spell immunity."],"cooldown":"10","name":"Overpower","description":["Cast Animation: 0.3+0","Attack Speed Bonus: 400","Number of Attacks: 4\/5\/6\/7","Duration: 20"],"hot_key":"W","legacy_key":"V"},{"spell":"Ursa's claws dig deeper wounds in the enemy, causing consecutive attacks to the same enemy to deal more damage. If the same target is not attacked after 8\/12\/16\/20 seconds, the bonus damage is lost.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["On each attack Fury Swipes first adds 1 stack and then deals damage based on the stack count. This means that the bonus damage is applied even with the first attack.","The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.","Each successful attack refreshes the whole stack. Missed attacks neither place the buff, nor add a stack or refresh it.","The number of stacks is visible on the debuff icon placed on attacked units.","Does not work against buildings, wards and allied units when attacking them.","The stack duration increasing talent does not increase the duration against Roshan."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Fury Swipes","description":["Attack Damage Bonus per Stack: 10\/16\/22\/28 ( 26\/32\/38\/44)","Debuff Duration: 8\/12\/16\/20 ( 33\/37\/41\/45)","Debuff Duration on Roshan: 10"],"hot_key":"E","legacy_key":"W"},{"spell":"Ursa goes into a frenzy, multiplying his Fury Swipes damage and causing him to take 80% less damage. Removes any existing debuffs.","effects":["Ability No Target","Affects Self"],"notes":["Enrage interrupts Ursa's channeling spells upon cast.","Applies a strong dispel on Ursa upon cast.","The 80% damage reduction reduces all 3 damage types.","Does not reduce damage from abilities that do HP removal.","Attacks during Enrage still add only 1 stack. Enrage merely multiplies the damage values of Fury Swipes by 1.4\/1.7\/2.","When upgraded, Enrage can be cast while stunned, cycloned, slept, taunted, hidden or during forced movement. It still cannot be cast while silenced, hexed or prevented from acting. However, it cannot be shift-queued anymore.","Causes Ursa's model to glow red and increases its size by 20% (this has no impact on its collision size).","The status resistance talent on level 25 does not stack with that of Aeon Disk. Enrage takes full priority."],"mana":"0","elements":["Pierces spell immunity."],"cooldown":"50\/40\/30 ( 30\/24\/18)","name":"Enrage","description":["Cast Animation: 0+0","Incoming Damage Reduction: 80%","Fury Swipes Damage Multiplier: 1.4\/1.7\/2","Status Resistance Bonus: 0% ( 80%)","Duration: 4 ( 5.5)"],"hot_key":"R","legacy_key":"R"}],"bio":"Ulfsaar the warrior is the fiercest member of an ursine tribe, protective of his land and his people. During the long winters, while the mothers sleep and nurse their cubs, the males patrol the lands above—as tireless, vigilant defenders of their ancient ways. Hearing dim but growing rumors of a spreading evil, Ulfsaar headed out beyond the boundaries of his wild wooded homeland, intending to track down and destroy the threat at its source, before it could endanger his people. He is a proud creature with a bright strong spirit, utterly trustworthy, a staunch ally and defender.","talentsTips":["The strength talent effectively grants Ursa 144 health, 0.8 health regen and 0.64% magic resistance.","The agility talent effectively grants Ursa 2.8 armor, 17.5 attack speed, 0.88% movement speed and 14 attack damage."],"trivia":["In DotA, Ulfsaar's alternate name was Fuzzy Wuzzy. This is referenced in one of his spawning lines, where he calls himself \"Fuzzy Wuzzy\". He does not use his actual name, Ulfsaar, in any of his responses. Lone Druid is the only one who calls him Ulfsaar.","In Latin, the word \"ursa\" means bear. In Portuguese, however, it specifically refers to a female bear. Despite this, Ulfsaar is clearly depicted as male both in his bio (where it is referred to as a \"he\") and in his in-game dialogue.","Ursa's response to killing an enemy Batrider makes reference to the 1940's Anti forest fire mascot \"Smokey the Bear\".","Ursa's Fury Swipes may also be a reference to the Pokémon move of the same name. The move involves the target being hit multiple times, much like Ursa's skills allow him to."],"talents":["Enrage gains 80% Status Resistance:+600 AoE Earthshock","+16 Fury Swipes Damage:+1.5s Enrage Duration","+25s Fury Swipes Reset Time:+14 Agility","+8 Strength:+3 Mana Regen"],"desc":"Ulfsaar, the Ursa Warrior (or simply Ursa), is a melee agility hero whose abilities' main focus is the increase of attack damage, allowing for some of the most impressive sustained damage in the entire game."}