{"abilities":[{"spell":"Ursa бьет о землю, нанося урон всем вражеским юнитам неподалеку и замедляя их на 4 секунды.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Earthshock сначала применяет дебафф, затем наносит урон."],"mana":"75","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"5","name":"Earthshock","description":["Анимация применения: 0,3+0","Радиус: 385 ( 985)","Урон: 50\/100\/150\/200","Замедление скорости передвижения: 25%\/35%\/45%\/55%","Длительность замедления: 4"],"hot_key":"Q","legacy_key":"E"},{"spell":"Используя свой боевой опыт, Ursa увеличивает скорость атаки на несколько следующих атак.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Не дает максимальную скорость атаки. Даваемая скорость атаки может сведена на нет сильным замедлением.","Заряды тратятся при совершении атаки вне зависимости от результата. То есть промахнувшиеся атаки также расходуют заряды.","В списке бафов можно увидеть количество оставшихся атак.","Несколько применений не складываются, но обновляют количество зарядов."],"mana":"75","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"10","name":"Overpower","description":["Анимация применения: 0,3+0","Дополнительная скорость атаки: 400","Количество атак: 4\/5\/6\/7","Длительность: 20"],"hot_key":"W","legacy_key":"V"},{"spell":"Когти Ursa с каждой атакой все глубже впиваются в плоть врага, нанося увеличенный урон с каждой последующей атакой. Дополнительный урон будет потерян, если цель не будет атакована в течение 8\/12\/16\/20 секунд.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Каждая атака с Fury Swipes сначала добавляет один заряд, а затем наносит урон, основанный на количестве зарядов. То есть дополнительный урон применяется даже при первой атаке.","Урон наносится одним источником вместе с атакой Ursa.","На атаки Fury Swipes действует вампиризм, лечащий Ursa, при этом на способность не действует критический или прорубающий удар.","Урон может быть снижен Enfeeble или Static Link. При этом его нельзя увеличить с помощью Empower или Руна двойного урона.","Каждая успешная атака обновляет все заряды. Промахнувшиеся атаки не размещают бафф и не добавляют или обновляют заряды.","В списке баффов атакованных юнитов можно увидеть количество зарядов.","Не работает на строения, варды и союзных юнитов при атаке.","Талант на увеличение длительности зарядов не влияет на длительность зарядов на Рошане."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Fury Swipes","description":["Доп. урон за атаку: 7\/14\/21\/28 ( 23\/30\/37\/44)","Длительность: 8\/12\/16\/20 ( 33\/37\/41\/45)","Длительность на Рошане: 10"],"hot_key":"E","legacy_key":"W"},{"spell":"Приводит героя в бешенство, отчего он наносит больше урона способностью Fury Swipes и получает на 80% меньше урона. Снимает все негативные эффекты.","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["При использовании Enrage прерывает произносимые способности Ursa.","При использовании применяет к Ursa сильное развеивание.","80% снижение урона снижает все 3 типа урона.","Не снижает урон от способностей, отнимающих здоровье.","Атаки в момент действия Enrage добавляют только 1 заряд. Enrage лишь умножает значение урона от Fury Swipes на 1,4\/1,7\/2.","При улучшении Enrage можно применить при действии оглушения, урагана, сна, провокации, исчезновения или принудительного движения. Способность нельзя использовать при безмолвии, проклятии или предотвращении действий. При этом её нельзя нельзя поставить в очередь действий.","Перекрашивает модель Ursa в пылающий красный и увеличивает её размер на 20% (это не влияет на её размер столкновения).","Сопротивление эффектам от таланта 25-го уровня не сочетается с Aeon Disk. У Enrage выше приоритет, чем у предмета."],"mana":"0","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"50\/40\/30 ( 30\/24\/18)","name":"Enrage","description":["Анимация применения: 0+0","Снижение урона: 80%","Множитель Fury Swipes: 1,4\/1,7\/2","Доп. сопротивление эффектам: 0% ( 80%)","Длительность: 4 ( 5.5)"],"hot_key":"R","legacy_key":"R"}],"bio":"Воин Ульфсаар — сильнейший член медвежьего племени, стоящий горой за свои земли и свой народ. Долгими зимами, пока матери спали и нянчили своих детёнышей, на страже стояли самцы — ревнители древних обычаев. Едва заслышав о надвигающейся угрозе, Ульфсаар направился за границы родной чащи, дабы выследить и уничтожить источник зла, пока то не навредило его народу. Ульфсаар — гордый зверь с сильным духом, крайне надёжный товарищ и невероятно стойкий защитник.","talentsTips":["Талант на силу в общем даёт Ursa: 160 здоровья, 0,8 регенерации здоровья и 0,64% сопротивления магии.","Талант на ловкость в общем даёт Ursa: 2,24 брони, 14 скорости атаки, 0,7% скорости передвижения и 14 урона от атаки."],"trivia":["Ursa не использует свое настоящее имя, Ulfsaar, ни в одной из своих фраз. Lone Druid единственный кто называет его Ulfsaar.","С Латинского языка, \"Ursa\" означает медведь, а с португальского медведица.","Способность Fury Swipes может быть отсылкой к способности из Pokémon с таким же названием. Это действие представляет собой несколько атак по цели, способности Ursa позволяют делать тоже самое.","После покупки Vladmir's Offering Ursa посылает угрозы в адрес Рошана."],"talents":["Enrage дает 80% сопротивления эффектам:+600 к радиусу Earthshock","+16 к урону от Fury Swipes:+1,5 сек. действия Enrage","+25 сек. действия Fury Swipes:+14 к ловкости","+8 к силе:+3 маны в секунду"],"tips":["Fury Swipes позволяет Ursa в одиночку убить Рошана почти в самом начале игры. Связка Wraith King и Ursa может убить Рошана на первых уровнях героев.","Используйте Phase Boots, чтобы догонять убегающих от вас противников.","Предмет Vladmir's Offering один из основных предметов для героя. Хорошо сочетается со способностями героя, а также позволит легко в одиночку справиться с Рошаном."],"desc":"Ursa — это герой с ближним типом атаки, основной характеристикой которого является Ловкость. Первой способностью, Earthshock, Ursa бьет о землю, нанося урон всем вражеским юнитам неподалеку и замедляя их. Второй способностью, Overpower, Ursa увеличивает скорость атаки на несколько следующих атак. Пассивная способность, Fury Swipes, позволяет наносить Ursa увеличенный урон с каждой последующей атакой. Дополнительный урон будет потерян, если цель не будет атакована некоторое время. Ультимативная способность, Enrage, увеличивая урон от Fury Swipes и получая на 80% меньше урона. Снимает все негативные эффекты."}