{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Hurricane_Pike.mp3\/revision\/latest?cb=20160518072532",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Двойной щелчок по предмету применяет его на владельца.",
        "Толкает цель со скоростью в 1200, если цель — владелец или союзник. Отталкивает заклинателя и цель со скоростью 2250, если цель — враг.",
        "Направление толчка зависит от направления, куда смотрит союзник. Отталкивание врага зависит от направления, куда смотрит заклинатель. Заклинателя отталкивает в противоположном направлении, создавая расстояние в 900 между ним и выбранным врагом. Заклинатель отталкивается только в случае, если цель — враг.",
        "Заклинателя отталкивает в противоположном направлении, создавая расстояние в 900 между ним и выбранным врагом.",
        "Заклинатель отталкивается только в случае, если цель — враг.",
        "Неограниченная дальность атаки применяется только к выбранному врагу. При атаке других существ используется обычная дальность.",
        "То же правило распространяется на скорость атаки. При смене цели используется обычная скорость атаки. Скорость обновляется после завершения времени перед атакой.",
        "Дает заклинателю приказ атаковать выбранную цель, если она — враг. Эффект распространяется только на героев дальнего боя.",
        "Толчок не обезвреживает затронутых существ, поэтому они могут использовать заклинания или предметы, атаковать и разворачиваться. То есть толчок не отменяет произносимые целью заклинания. При этом способность прерывает произносимые заклинания владельца, поскольку является направленным на цель заклинанием.",
        "То есть толчок не отменяет произносимые целью заклинания.",
        "При этом способность прерывает произносимые заклинания владельца, поскольку является направленным на цель заклинанием.",
        "Не перемещает существ под действием Black Hole, Chronosphere, Duel или Flaming Lasso.",
        "Не может вытолкнуть существ сквозь Kinetic Field или Arena Of Blood.",
        "Если на цель действует Soulbind, то ее нельзя толкнуть дальше, чем позволяет максимальное расстояние связи.",
        "Если цель привязана Pounce, то при применении привязка мгновенно разрывается. Но если цель получила привязку после применения, то способность не сможет толкнуть существо дальше, чем позволяет максимальное расстояние Pounce.",
        "Но если цель получила привязку после применения, то способность не сможет толкнуть существо дальше, чем позволяет максимальное расстояние Pounce.",
        "Не применяется к вардам или строениям. Можно применить к Homing Missile.",
        "Может затолкать существ на непроходимую территорию. Во время толчка деревья в радиусе 100 единиц вокруг цели разрушаются.",
        "Можно использовать на Рошана, но без какого-либо эффекта, поскольку у него иммунитет к принудительному движению.",
        "Применение на владельца или союзника проигрывает стандартный звук Force Staff.",
        "Делит перезарядку с Force Staff. Не делит перезарядку с Force Boots."
      ],
      "mana": "100",
      "abilityName": "Hurricane Thrust",
      "cooldown": "23",
      "description": "Отталкивает вражескую цель и владельца друг от друга на расстояние в 450. Если владелец сражается в дальнем бою, то после этого он следующие 5 секунд может совершить до 4 атак по цели без ограничения на расстояние. Скорость таких атак увеличена на 100. При использовании на себя или союзников работает как Force Staff.",
      "params": [
        "Дальность применения (союзник\/владелец): 550",
        "Дальность применения (враг): 400",
        "Дальность толчка (союзник\/владелец): 600",
        "Дальность отталкивания (враг): 450",
        "Длительность толчка (союзник\/владелец): 0,5",
        "Длительность отталкивания (враг): 0,2",
        "Число атак: 4",
        "Доп. скорость атаки: 100",
        "Длительность баффа: 5",
        "Можно применять на себя, имея иммунитет к заклинаниям. Нельзя применять на любых других существ с иммунитетом."
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [],
      "mana": null,
      "abilityName": "Dragon's Reach",
      "cooldown": null,
      "description": "Увеличивает дальность атаки героев дальнего боя на 140.",
      "params": [
        "Дополнительная дальность атаки: 140"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 300 здоровья, 4 регенерации здоровья, 3,33 брони, 20 скорости атаки, 156 маны, 0,65 регенерации маны и 15 урона от атаки.",
    "Для героев ловкости, даёт 300 здоровья, 4 регенерации здоровья, 3,33 брони, 20 скорости атаки, 156 маны, 0,65 регенерации маны и 20 урона от атаки.",
    "Для героев интеллекта, даёт 300 здоровья, 4 регенерации здоровья, 3,33 брони, 20 скорости атаки, 156 маны, 0,65 регенерации маны и 13 урона от атаки. Дополнительная дальность атаки применяется только к героям дальнего боя. Допольнительная дальность атаки от нескольких предметов, содержащих Dragon Lance, не складывается. Складывается с другими бонусами к дальности атаки. Также влияет на дальность применения активных модификаторов атаки.",
    "Дополнительная дальность атаки применяется только к героям дальнего боя.",
    "Допольнительная дальность атаки от нескольких предметов, содержащих Dragon Lance, не складывается.",
    "Складывается с другими бонусами к дальности атаки.",
    "Также влияет на дальность применения активных модификаторов атаки."
  ],
  "cost": "4525",
  "lore": null,
  "consistFrom": [
    "Force Staff",
    "Dragon Lance",
    "Recipe"
  ],
  "boughtFrom": "Броня",
  "name": "Hurricane Pike",
  "description": "Легендарная пика, в далеком прошлом служившая монаршим символом наездников на вивернах.",
  "trivia": [
    "Иконка Hurricane Pike отображает что он сделан из половинок Force Staff и Dragon Lance."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+15 к силе",
    "+20 к ловкости",
    "+13 к интеллекту",
    "+2,5 к регенерации здоровья",
    "+140 к дальности атаки"
  ],
  "tips": null
}