{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на область \/ Произносимая",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Всего наносит 690 урона существам и 375 урона строениям (до учета сопротивления).",
        "Метеору нужно 0,5 секунд на приземление после окончания произнесения, что увеличивает общую задержку эффекта до 0,5 секунд."
      ],
      "mana": "125",
      "abilityName": "Meteor Hammer",
      "cooldown": null,
      "description": "При успешном окончании прочтения вызывает метеор, задевающий врагов в радиусе 315 и оглушающий их на 1,75 секунд. Наносит временный урон существам и строениям в течение 6 секунд.",
      "params": [
        "Дальность применения: 600",
        "Время произнесения: 2,5",
        "Радиус эффекта: 315",
        "Задержка эффекта: 0,5",
        "Базовый урон (существа): 150",
        "Базовый урон (строения): 75",
        "Урон в секунду (существа): 90",
        "Урон в секунду (строения): 50",
        "Длительность горения: 6",
        "Длительность оглушения: 1,75"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 160 здоровья, 7,3 регенерации здоровья, 1,33 брони, 8 скорости атаки, 96 маны, 2,9 регенерации маны и 8 урона от атаки.",
    "Для героев ловкости, даёт 160 здоровья, 7,3 регенерации здоровья, 1,33 брони, 8 скорости атаки, 96 маны, 2,9 регенерации маны и 8 урона от атаки.",
    "Для героев интеллекта, даёт 160 здоровья, 7,3 регенерации здоровья, 1,33 брони, 8 скорости атаки, 96 маны, 2,9 регенерации маны и 8 урона от атаки."
  ],
  "cost": "2350",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Crown",
    "Recipe"
  ],
  "boughtFrom": "Оружие",
  "name": "Meteor Hammer",
  "description": "Этот зачарованный молот сковали из металла, который обнаружили в руинах деревни, уничтоженной великим звездопадом.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+8 к силе",
    "+8 к ловкости",
    "+8 к интеллекту",
    "+6,5 к регенерации здоровья",
    "+2,5 к регенерации маны"
  ],
  "tips": [
    "Этот предмет подходит героям поддержки для осады строений, нанося 360 урона (1\/4 здоровья первой башни), и убивать стаки лесных крипов."
  ]
}