{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Abaddon: 160 здоровья, 0,8 регенерации здоровья и 8 урона от атаки.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на броню не дается иллюзиям.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Mist Coil применяется по области радиусом 425",
          "talentRight": "+180 к здоровью щита от Aphotic Shield"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+8 к броне",
          "talentRight": "-15% перезарядки заклинаний"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+50 к урону\/лечению от Mist Coil",
          "talentRight": "+65 к урону"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8 к силе",
          "talentRight": "+15 к скорости передвижения"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Mist_Coil.mp3\/revision\/latest?cb=20161218004327",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников",
        "Урон Магический \/ Чистый"
      ],
      "notes": [
        "Снаряд летит со скоростью 1300.",
        "Наносит чистый урон по себе и магический по врагам. Это значит, что урон по себе блокируется с помощью Aphotic Shield, превращается в лечение под действием Borrowed Time, и подвергается усилению урона заклинаний. Другие источники, манипулирующие уроном (например, Overcharge) также влияют на эту способность.",
        "Это значит, что урон по себе блокируется с помощью Aphotic Shield, превращается в лечение под действием Borrowed Time, и подвергается усилению урона заклинаний.",
        "Другие источники, манипулирующие уроном (например, Overcharge) также влияют на эту способность.",
        "Урон по себе наносится сразу в момент использования способности.",
        "Abaddon не может совершить самоубийство с помощью этой способности.",
        "Если союзник станет неуязвимым или исчезнет до того, как до него долетит снаряд, он все равно получит лечение.",
        "При улучшении с Aghanim's Shard, Mist Coil сначала наносит урон, а потом накладывает Curse of Avernus.",
        "Выбор таланта, увеличивающего урон\/лечение, мгновенно улучшит все летящие снаряды Mist Coil Abaddon.",
        "Выбор таланта 25-го уровня способность запускает снаряды в случайные видимые подходящие цели в радиусе 425. При применении Abaddon выпускает снаряды к каждому союзнику и врагу в радиусе, за исключением самого заклинателя. Эти снаряды считаются за обычное применение, поэтому их также можно избежать. Также способность выбирает невидимых существ и существ в тумане войны. При этом невидимые цели мгновенно избегают снарядов. Урон, наносимый себе, не зависит от количества целей.",
        "При применении Abaddon выпускает снаряды к каждому союзнику и врагу в радиусе, за исключением самого заклинателя.",
        "Эти снаряды считаются за обычное применение, поэтому их также можно избежать.",
        "Также способность выбирает невидимых существ и существ в тумане войны. При этом невидимые цели мгновенно избегают снарядов.",
        "Урон, наносимый себе, не зависит от количества целей."
      ],
      "mana": "50",
      "hotKey": "Q",
      "cooldown": "5,5 (TagTalent 4,675)",
      "description": "Ценой собственного здоровья выпускает смертельный туман, который наносит урон врагу или лечит союзника.",
      "spellName": "Mist Coil",
      "params": [
        "Анимация применения: 0,25+0,67",
        "Дальность применения: 575",
        "Радиус: 0 (TagTalent 425)",
        "Урон по себе: 75\/100\/125\/150 (TagTalent 125\/150\/175\/200)",
        "Урон: 120\/165\/210\/255 (TagTalent 170\/215\/260\/305)",
        "Лечение: 120\/165\/210\/255 (TagTalent 170\/215\/260\/305)",
        "Применяет Curse of Avernus на враждебную цель Mist Coil.",
        "Можно использовать на союзников с иммунитетом к заклинаниям. Нельзя использовать на врагов с иммунитетом. Урон по себе не блокируется иммунитетом.",
        "Блокируется при попадании как основной, так и вторичными целями, поэтому Abaddon все равно теряет здоровье.",
        "Могут избегать как враги, так и союзники."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Дыхание лорда Аверно преисполнено загадочными испарениями купели, подчиняющимися его воле."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/ca\/Aphotic_Shield.mp3\/revision\/latest?cb=20141130163932",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Применяет сильное развеивание на цель при использовании.",
        "Способность полностью отрицает урон (после всех сопротивлений), предотвращая срабатывание некоторых эффектов урона.",
        "Aphotic Shield имеет второй низший приоритет среди способностей, отрицающих урон. Это значит, что в сочетании с, например, Borrowed Time или Refraction, щит не поглощает урона, пока другие эффекты не пропадут. Имеет больший приоритет чем Living Armor, таким образом, в сочетании с этой способностью Aphotic Shield блокирует урон, в то время как Living Armor нет. Тем не менее, Living Armor теряет по заряду каждый раз, когда наносится урон.",
        "Это значит, что в сочетании с, например, Borrowed Time или Refraction, щит не поглощает урона, пока другие эффекты не пропадут.",
        "Имеет больший приоритет чем Living Armor, таким образом, в сочетании с этой способностью Aphotic Shield блокирует урон, в то время как Living Armor нет. Тем не менее, Living Armor теряет по заряду каждый раз, когда наносится урон.",
        "Щит всегда взрывается и наносит урон по области при потере баффа \"Aphotic Shield\", даже если не поглотил максимально возможный урон.",
        "Урон по области не связан с количеством поглощенного урона. Щит всегда наносит 110\/140\/170\/200 (TagTalent 290\/320\/350\/380) единиц урона.",
        "При улучшении с Aghanim's Shard, Mist Coil сначала наносит урон, а потом накладывает Curse of Avernus.",
        "Несколько применений на одного юнита не сладываются. При повторной активации предыдущий щит уничтожается (нанося урон по области) и накладывается новый.",
        "Выбор таланта на дополнительное здоровье и урон не влияет на уже примененные щиты Abaddon.",
        "При взрыве Aphotic Shield не наносит урона невидимым существам и существам в тумане войны."
      ],
      "mana": "100\/105\/110\/115",
      "hotKey": "W",
      "cooldown": "12\/10\/8\/6 (TagTalent 10,2\/8,5\/6,8\/5,1)",
      "description": "Окружает союзника щитом из темной энергии, который поглощает некоторое количество урона, прежде чем исчезнуть. При уничтожении щит взрывается и наносит весь поглощенный урон ближайшим врагам. Снимает некоторые негативные эффекты и оглушение при применении.",
      "spellName": "Aphotic Shield",
      "params": [
        "Анимация применения: 0,3+0,57",
        "Дальность применения: 500",
        "Радиус взрыва: 675",
        "Поглощение урона: 110\/140\/170\/200 (TagTalent 290\/320\/350\/380)",
        "Урон по области: 110\/140\/170\/200 (TagTalent 290\/320\/350\/380)",
        "Длительность: 15",
        "Применяет Curse of Avernus на враждебную цель, задетую взрывом Aphotic Shield.",
        "Щит остается, если был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Сила черного тумана поглощает удары так же, как он сам поглощает дневной свет."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Curse_of_Avernus.mp3\/revision\/latest?cb=20181201174907",
      "effects": [
        "Способность Пассивная",
        "Действует на Союзников \/ Врагов"
      ],
      "notes": [
        "Каждая успешная атака по вражескому существу не под действием дебаффа проклятья накладывает начальный дебафф или увеличивает его счётчик.",
        "Длительность начального дебаффа обновляется с каждым ударом. То есть все 4 удара не нужно совершать за 5 секунды.",
        "Когда счётчик начального дебаффа достигает 4, то дебафф исчезает и заменяется на дебафф проклятья.",
        "Любой союзный герой, атакующий проклятого юнита, получает бафф ускорения. Бафф дается при успешном попадании атаки по цели. То есть, промахнувшиеся атаки баффа не дают. Для героев дальнего боя это означает, что бафф они получат только при попадании снаряда. Бафф действует только при атаке проклятых целей. При смене цели бафф исчезает.",
        "То есть, промахнувшиеся атаки баффа не дают. Для героев дальнего боя это означает, что бафф они получат только при попадании снаряда.",
        "Бафф действует только при атаке проклятых целей. При смене цели бафф исчезает.",
        "Бафф дается только союзным героям, иллюзиям и клонам. Юниты не-герои баффа не получают. Считает крипов-героев за крипов.",
        "Замедляющий дебафф можно наложить на строения, но не на варды или союзных юнитов."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Атаки героя замедляют передвижение жертвы. Если атаковать врага 4 раза, на него сработает замораживающее проклятие: оно накладывает безмолвие и замедление, а все атакующие этого врага существа получают дополнительную скорость атаки.",
      "spellName": "Curse of Avernus",
      "params": [
        "Ударов нужно: 4",
        "Базовое замедление скорости передвижения: 10%\/15%\/20%\/25% (TagTalent 20%\/25%\/30%\/35%)",
        "Замедление скорости передвижения: 15%\/30%\/45%\/60%",
        "Доп. скорость атаки: 40\/60\/80\/100",
        "Базовая длительность: 5",
        "Длительность проклятья: 4,5",
        "Длительность баффа ускорения: 4,5",
        "Базовое замедление усиливается на 10%.",
        "Отключает наложение начального дебаффа и увеличение счётчика. При действующем проклятии предотвращает получение союзниками баффа ускорения при атаке врага."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Borrowed_Time.mp3\/revision\/latest?cb=20141130163939",
      "effects": [
        "Способность Ненаправленная (TagAghanim Аура)",
        "Действует на Себя (TagAghanim Союзных героев)"
      ],
      "notes": [
        "При использовании прерывает произносимые способности Abaddon. Не прерывает при пассивном срабатывании.",
        "Применяет сильное развеивание на Abaddon при использовании или пассивной активации.",
        "Способность можно применить, даже когда герой находится в оглушении, урагане, сне, провокации, исчезновении или принудительном движении.",
        "Нельзя применить, но может активироваться пассивно, когда герой обезмолвлен, проклят или не может получать приказы. Также способность нельзя поставить в очередь действий.",
        "Активируется автоматически, когда полученный урон (без отметки \"отнимающий здоровье\") опускает уровень здоровья Abaddon ниже 400 или наносится, когда он уже ниже 400. Урон наносится до активации Borrowed Time, то есть, если наносимый урон превышает текущее здоровье Abaddon, то герой умрет, не активировав способность. То есть, способность не спасает Abaddon от моментально убивающих эффектов, таких как Culling Blade и Ice Blast.",
        "Урон наносится до активации Borrowed Time, то есть, если наносимый урон превышает текущее здоровье Abaddon, то герой умрет, не активировав способность.",
        "То есть, способность не спасает Abaddon от моментально убивающих эффектов, таких как Culling Blade и Ice Blast.",
        "Borrowed Time полностью отрицает урон (после всех сопротивлений), предотвращая срабатывание некоторых эффектов урона.",
        "Borrowed Time превращает урон в лечение после учета всех сопротивлений.",
        "Borrowed Time имеет наивысший приоритет среди способностей, отрицающих урон. Таким образом, в сочетании с другими подобными способностями (например, Aphotic Shield или False Promise), Borrowed Time поглощает урон, в то время как другие - нет. В случае с False Promise, Borrowed Time сначала превращает урон в лечение, которое только после этого регистрируется способностью False Promise как лечение, а не урон.",
        "Таким образом, в сочетании с другими подобными способностями (например, Aphotic Shield или False Promise), Borrowed Time поглощает урон, в то время как другие - нет.",
        "В случае с False Promise, Borrowed Time сначала превращает урон в лечение, которое только после этого регистрируется способностью False Promise как лечение, а не урон.",
        "Как и другие эффекты, манипулирующие уроном, Borrowed Time отрицает и превращает в лечение только 3 типа урона, но не урон с отметкой \"отнимающий здоровье\". Единственные исключения: Heartstopper Aura и False Promise, урон от которых превращается в лечение. Тем не менее, Borrowed Time не активируется пассивно от урона этих способностей.",
        "Единственные исключения: Heartstopper Aura и False Promise, урон от которых превращается в лечение. Тем не менее, Borrowed Time не активируется пассивно от урона этих способностей.",
        "Эффект Aghanim's Scepter — аура, чей бафф задерживается на 0,5 секунды. Накладывает на союзников в радиусе действия бафф, учитывающий получаемый ими урон. Проверяет полученный урон с каждым источником. То есть на один источник урона выпускается только один снаряд независимо от того, насколько урон был большим. Если полученный урон превышает порог, то из счетчика это значение вычитается и выпускается Mist Coil. Поскольку значение порога вычитается из счетчика, то остатки урона не пропадают и учитываются для следующего срабатывания. То есть 1575 урона, нанесенного одним источником (в три раза больше порога), активируют только 1 Mist Coil, но следующие два источника урона гарантированно активируют срабатывание. Способность игнорирует отнимающий здоровье урон. У счетчика урона нет таймера сброса. Он сбрасывается только потерей баффа союзником между источниками урона. Выпущенные Mist Coil расходуют здоровье как и при обычном использовании, но не тратят ману и не связаны с перезарядкой. Снаряды связаны с текущим уровнем Mist Coil, поэтому без изученной способности выпускаться не будут.",
        "Накладывает на союзников в радиусе действия бафф, учитывающий получаемый ими урон.",
        "Проверяет полученный урон с каждым источником. То есть на один источник урона выпускается только один снаряд независимо от того, насколько урон был большим.",
        "Если полученный урон превышает порог, то из счетчика это значение вычитается и выпускается Mist Coil.",
        "Поскольку значение порога вычитается из счетчика, то остатки урона не пропадают и учитываются для следующего срабатывания.",
        "То есть 1575 урона, нанесенного одним источником (в три раза больше порога), активируют только 1 Mist Coil, но следующие два источника урона гарантированно активируют срабатывание.",
        "Способность игнорирует отнимающий здоровье урон.",
        "У счетчика урона нет таймера сброса. Он сбрасывается только потерей баффа союзником между источниками урона.",
        "Выпущенные Mist Coil расходуют здоровье как и при обычном использовании, но не тратят ману и не связаны с перезарядкой.",
        "Снаряды связаны с текущим уровнем Mist Coil, поэтому без изученной способности выпускаться не будут."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "60\/50\/40 (TagTalent 51\/42,5\/34)",
      "description": "Обращает весь получаемый урон в лечение. Применение снимает большинство отрицательных эффектов. Если способность готова, то она сработает автоматически, как только здоровье владельца упадёт ниже 400.",
      "spellName": "Borrowed Time",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 0 (TagAghanim 1600)",
        "Порог здоровья: 400",
        "Порог здоровья для срабатывания Mist Coil: 0 (TagAghanim 525)",
        "Длительность задержки ауры: 0 (TagAghanim 0,5)",
        "Длительность: 4\/5\/6 (TagAghanim 5\/6\/7)",
        "Увеличивает длительность. Во время действия автоматически применяет способность Mist Coil на союзников в радиусе 1600, когда они получают более 525 урона.",
        "Отключается пассивная активация, срабатывающая при снижении здоровья ниже 400. Аура перенаправления урона от Aghanim's Scepter не отключается."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Эта сила, самая противоестественная из всех даров купели Аверно, бросает вызов пониманию смертных. Что должно ранить — лечит, а что должно убить — дает свежие силы."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 23.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 1.5,
    "attrAgility": 23.0
  },
  "description": "Abaddon — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Mist Coil, Abaddon выпускает смертельный туман, который наносит урон врагу или лечит союзника. Вторая способность, Aphotic Shield, окружает союзника темной энергией, создавая щит, который поглощает некоторое количество урона перед тем как взорваться и нанести урон ближайшим врагам. Сбрасывает некоторые негативные эффекты и оглушение при применении. Пассивная способность, Curse of Avernus, после 4-х успешных атак накладывает замораживающее проклятье и безмолвие на атакуемую цель. У всех, кто атакует замедленного врага, на некоторое время повышается скорость атаки. Ультимативная способность, Borrowed Time, при активации позволяет Abaddon обратить любой получаемый им урон в лечение. Снимает большинство негативных эффектов. Если способность готова к применению, она будет активирована пассивно, как только здоровье Abaddon упадет ниже 400. Улучшение с Aghanim's Scepter увеличивает длительность ультимативной способности и позволяет Abaddon автоматически применять Mist Coil на союзных героев при получении ими урона.",
  "history": "Род Аверно питает купель — разлом в земной тверди, который испускает загадочную энергию на протяжении поколений. Каждого новорожденного семьи окунают в этот темный туман, даруя тем самым связь с их землей и ее загадочной силой. Дети растут с непреклонной верой в защиту семейных ценностей и традиций земли, но на самом деле они охраняют саму купель, истинные намерения которой неизвестны. Когда новорожденный Abaddon проходил обряд крещения, что-то пошло не так. В глазах малыша сверкнула искра разума, испугавшая всех присутствовавших и заставившая жрецов шептаться. Его растили, дабы он пошел по пути всех отпрысков рода: война и защита родины во главе армии. Но сам Abaddon уделял этому не так много внимания. Пока другие тренировались в обращении с оружием, он медитировал у купели. Он глубоко вдыхал темный туман, учась быть единым с той силой, что протекала глубоко под землей его дома. В конечном счете он стал порождением черного тумана. Род Аверно неодобрительно отнесся к такому решению, обвиняя его в пренебрежении обязанностями. Но все эти обвинения прекратились, когда Abaddon вступил в свою первую битву и показал ту обретенную власть над жизнью и смертью, о которой другие члены рода не могли и мечтать.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Mist Coil применяется по области радиусом 425",
      "talentRight": "+180 к здоровью щита от Aphotic Shield"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+8 к броне",
      "talentRight": "-15% перезарядки заклинаний"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+50 к урону\/лечению от Mist Coil",
      "talentRight": "+65 к урону"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8 к силе",
      "talentRight": "+15 к скорости передвижения"
    }
  ]
}