{
  "abilities": [
    {
      "notes": [
        "Талант на дальность атаки также влияет на дальность применения Focus Fire."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−20 сек. перезарядки при убийстве жертвы Focus Fire",
          "talentRight": "Windrun даёт невидимость"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−16% снижения урона у Focus Fire",
          "talentRight": "+0,8 сек. действия Shackleshot"
        },
        {
          "talentLvl": "15",
          "talentLeft": "Windrun нельзя развеять",
          "talentRight": "+100 урона от Powershot"
        },
        {
          "talentLvl": "10",
          "talentLeft": "−2 сек. перезарядки Shackleshot",
          "talentRight": "+1,5 маны в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Windranger_Shackleshot_1.mp3\/revision\/latest?cb=20191216030602",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд летит со скоростью 1650.",
        "Снаряд ищет врагов или деревья за спиной цели в пределах 46° от места, откуда он был запущен. То есть, если Windranger меняет местоположение после применения, то координаты Shackleshot учитывают не текущее местоположение, а то, откуда была запущена способность. Область поиска представляет собой треугольник с высотой 575. Две стороны треугольника равны 624,66, основание — 488,15 единицам.",
        "То есть, если Windranger меняет местоположение после применения, то координаты Shackleshot учитывают не текущее местоположение, а то, откуда была запущена способность.",
        "Область поиска представляет собой треугольник с высотой 575.",
        "Две стороны треугольника равны 624,66, основание — 488,15 единицам.",
        "Приоритет существ в качестве вторичной цели выше, чем приоритет деревьев.",
        "Если цель не связывается, то способноть её кратковременно оглушает (используя базовый дебафф «Оглушение»).",
        "Если цель привязана к существу, они оба будут оглушены на всю длительность способности (используя дебафф Shackle Shot).",
        "Оглушение сохраняется, даже если одно из существ преждевременно умерло или дерево разрушилось.",
        "Оглушение также сохраняется, если одно из существ освобождается от оглушения раньше.",
        "Если основная цель умирает раньше попадания снаряда, он все равно зацепит и оглушит второе существо.",
        "Может задеть невидимых существ, существ в тумане войны, а также может связать существо с деревьями от Sprout.",
        "Талант, увеличивающий длительность оглушения, влияет только на длительность максимального оглушения, но не на минимальное.",
        "Отображается уменьшение перезарядки только от таланта 10 уровня. Вместе с талантом 25 уровня перезарядка уменьшается до 11,2\/9,6\/8\/6,4. Сам талант 25 уровня уменьшает перезарядку до 12,8\/11,2\/9,6\/8.",
        "Сам талант 25 уровня уменьшает перезарядку до 12,8\/11,2\/9,6\/8."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10 (TagTalent 14\/12\/10\/8)",
      "description": "Связывает цель с находящимся позади неё врагом или деревом. Если цель не будет с чем-либо связана, длительность оглушения сократится до 0,75 сек.",
      "spellName": "Shackleshot",
      "params": [
        "Анимация применения: 0,15+0,45",
        "Дальность применения: 800",
        "Радиус связки: 575",
        "Угол поиска связки: 46",
        "Максимальное кол-во целей: 2",
        "Максимальное оглушение: 2\/2,6\/3,2\/3,8 (TagTalent 2,8\/3,4\/4\/4,6)",
        "Минимальное оглушение: 0,75",
        "Блокируется только главной целью. Блокируется при попадании."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b5\/Windranger_Powershot_1.mp3\/revision\/latest?cb=20191216030558",
      "effects": [
        "Способность Направленная на точку \/ Произносимая",
        "Действует на Врагов",
        "Урон Магический Мгновенное убийство"
      ],
      "notes": [
        "Стрела летит со скоростью 3000, достигая максимального расстояния за 0,87 сек.",
        "Стрела наносит урон существу на расстоянии до 2725 единиц (складывается из дальности прохождения и радиуса урона).",
        "Весь урон наносится после 1 сек. произнесения. Каждые 0,03 секунды произнесения урон увеличивается на 5\/8,33\/11,67\/15 (TagTalent 8,33\/11,67\/15\/18,33).",
        "За каждого задетого врага урон стрелы уменьшается на 20%.",
        "Столько урона нанесет стрела при полном произнесении (до уменьшений) после попадания по 10 существам:",
        "Столько урона нанесет стрела при выборе таланта на дополнительный урон Powershot:",
        "Чтобы урон стрелы достиг 1, ей нужно поразить 23\/25\/27\/28 (TagTalent 25\/27\/28\/29) существ.",
        "Стрела дает летающий обзор в радиусе 400 единиц во время полёта. Обзор задерживается в конечной точке на 3,34 секунды.",
        "Стрела уничтожает деревья в радиусе 75 во время полёта. Попадание в дерево не снижает урон.",
        "Звук натягивания тетивы лука слышен только союзникам.",
        "С Aghanim's Shard Powershot становится глобальной способностью. Снаряд перестает двигаться при поражении вражеского героя (включая иллюзии и клонов, исключая крипов-героев) за пределами базовой дальности в 2600 единиц. При попадании в героя способность сначала наносит урон, а затем проверяет текущее здоровье цели. Перестает задевать крипов после прохождения базового расстояния в 2600. Все равно разрушает деревья и дает обзор на оставшемся пути.",
        "Снаряд перестает двигаться при поражении вражеского героя (включая иллюзии и клонов, исключая крипов-героев) за пределами базовой дальности в 2600 единиц.",
        "При попадании в героя способность сначала наносит урон, а затем проверяет текущее здоровье цели.",
        "Перестает задевать крипов после прохождения базового расстояния в 2600.",
        "Все равно разрушает деревья и дает обзор на оставшемся пути."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "W",
      "cooldown": "12\/11\/10\/9 (TagTalent 9,6\/8,8\/8\/7,2) (TagTalent 10,5\/9,5\/8,5\/7,5, 8,4\/7,6\/6,8\/6)",
      "description": "Герой заряжает лук, чтобы совершить мощный выстрел. Стрела наносит урон врагам. Урон увеличивается по мере зарядки, которая длится не более 1 сек., и снижается на 20% с каждым задетым врагом.",
      "spellName": "Powershot",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 2600",
        "Дальность прохождения: 2600 (TagTalent Глобальная)",
        "Радиус урона: 125",
        "Макс. время произнесения: 1",
        "Макс. урон: 150\/250\/350\/450 (TagTalent 250\/350\/450\/550)",
        "Уменьшение урона за попадание по существу: 20%",
        "Порог здоровья для убийства: 13%",
        "Способность становится глобальной, но дальше стандартной дальности применения наносит урон только одному герою. Если у задетого героя останется меньше 13% здоровья, он погибнет. Уменьшает перезарядку на 1,5 секунды."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0a\/Windranger_Windrun.mp3\/revision\/latest?cb=20191216030607",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Windranger.",
        "Даёт Windranger 100% уклонения на всю длительность. Поэтому атаки с эффектом True Strike нельзя будет избежать.",
        "Замедление предоставляется аурой, исходящей от Windranger. Её дебафф задерживается на 2,5 сек.",
        "При выборе таланта 25-го уровня Windrun будет давать Windranger невидимость и сквозное передвижение на всю длительность. Во время ухода в невидимость Windranger может использовать способности и предметы и атаковать, не выходя из невидимости. Невидимость пропадает при завершении заклинаниями или предметами анимации применения или начале атаки по цели. Невидимость предоставляется вторым баффом, поэтому его развеивание предотвращает возврат Windranger в невидимое состояние. Windranger может подбирать и выбрасывать предметы не выходя из невидимости.",
        "Во время ухода в невидимость Windranger может использовать способности и предметы и атаковать, не выходя из невидимости.",
        "Невидимость пропадает при завершении заклинаниями или предметами анимации применения или начале атаки по цели.",
        "Невидимость предоставляется вторым баффом, поэтому его развеивание предотвращает возврат Windranger в невидимое состояние.",
        "Windranger может подбирать и выбрасывать предметы не выходя из невидимости."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "15\/14\/13\/12 (TagTalent 12\/11,2\/10,4\/9,6) (TagTalent 0,25, 0,2)",
      "description": "Увеличивает скорость передвижения героя и позволяет ему уворачиваться от всех физических атак, при этом замедляя передвижение врагов поблизости.",
      "spellName": "Windrun",
      "params": [
        "Анимация применения: 0+0",
        "Радиус замедления: 325",
        "Доп. скорость передвижения: 60% (TagAghanim 550)",
        "Уклонение: 100%",
        "Пассивное уклонение: 30%",
        "Замедление скорости передвижения врагов: 15%\/20%\/25%\/30%",
        "Длительность задержки ауры: 2,5",
        "Длительность: 3\/4\/5\/6",
        "",
        "Число зарядов: 2",
        "Время восстановления заряда: 15\/14\/13\/12 (TagAghanim 12\/11,2\/10,4\/9,6)",
        "Перезарядка заменяется зарядами. Способность даёт эффект руны ускорения. Герой навсегда получает 30% к уклонению.",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Windranger_Focus_Fire.mp3\/revision\/latest?cb=20191216030555",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Себя"
      ],
      "notes": [
        "Дальность применения Focus Fire всегда равна дальности атаки заклинателя. При этом не учитывается неограниченная дальность от активной способности Hurricane Pike.",
        "При этом не учитывается неограниченная дальность от активной способности Hurricane Pike.",
        "При применении отдает команду Windranger атаковать цель.",
        "Focus Fire позволяет Windranger двигаться при атаке выбранной цели.",
        "Windranger автоматически атакует цель Focus Fire, если существо будет в пределах дальности, если только герой не получил приказ, отличный от передвижения или атаки. Атаки можно приостановить приказом «стоп» или «удерживать позицию». Для продолжения нужно отдать новый приказ на атаку.",
        "Атаки можно приостановить приказом «стоп» или «удерживать позицию».",
        "Для продолжения нужно отдать новый приказ на атаку.",
        "При атаке цели уменьшает только основной и дополнительный урон Windranger. Урон от эффектов предметов (например, Monkey King Bar и Diffusal Blade) не изменяется.",
        "Windranger может переключаться между целями без потери баффа Focus Fire.",
        "При смене цели скорость атаки и урон адаптируются сразу после начала атаки.",
        "Использование на несколько существ дает скорость атаки и снижение урона только при атаке последней цели.",
        "Focus Fire преждевременно заканчивается, если Windranger умирает, но сохраняется, если умирает цель способности.",
        "Можно применить на любое вражеское существо, включая постройки, но исключая варды, неуязвимых и спрятанных существ."
      ],
      "mana": "75\/100\/125",
      "hotKey": "R",
      "cooldown": "70\/50\/30 (TagTalent 56\/40\/24)",
      "description": "Герой призывает вихрь, увеличивающий скорость его атаки по выбранному вражескому существу или строению на 475. Весь урон от этих атак будет уменьшен, за исключением урона от эффектов предметов.",
      "spellName": "Focus Fire",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость атаки: 475",
        "Снижение урона: 50%\/40%\/30% (TagTalent 34%\/24%\/14%)",
        "Длительность: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 1.4,
    "attrAgility": 17.0
  },
  "description": "Windranger — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Она имеет четыре способности, каждая из которых является активной. Первая способность, Shackleshot, связывает цель с вражеским существом или деревом, находящимся позади. Если сзади цели нет дерева или юнита, то время оглушения уменьшается. Второй способностью, Powershot, Windranger заряжает свой лук, выстреливая стрелу, наносящую большой урон, который увеличивается по мере зарядки. За каждого врага, в которого попадет стрела, ее урон будет снижен на 20%. Третья способность, Windrun, увеличивает скорость передвижения героя и позволяет увернуться от всех физических атак, замедляя скорость передвижения у врагов поблизости. Ультимативная способность, Focus Fire, повышает скорость атаки по одному вражескому существу или сооружению на 500 до максимума, но теряя при этом часть урона от своих атак. Дополнительный урон от эффектов предметов не уменьшается.",
  "history": "Западные леса крепко хранят свои секреты. Один из них — Лиралей, непревзойдённая лучница лесов, любимая крестница ветра. Это сейчас её прозвали ветрокрылой — но семья Лиралей поглибла во время ночного шторма: буря разрушила дом до основания, открыв его жителей всем ветрам. Лишь новорождённая выжила среди развалин, пронизанных смертью и разрушением. Когда шторм стих, ветер услышал плачущего в траве везучего младенца. Он пожалел ребёнка и перенёс его на порог дома в соседней деревне. Следующие годы ветер то и дело навещал девочку, наблюдая со стороны, как она оттачивает свои навыки. Теперь, после многих лет тренировок, стрелы Лиралей неизменно попадают точно в цель. Она двигается с ослепительной скоростью, будто бы подгоняемая ветром, а враги её гибнут в шквале стрел, словно их наказывает сама природа.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−20 сек. перезарядки при убийстве жертвы Focus Fire",
      "talentRight": "Windrun даёт невидимость"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−16% снижения урона у Focus Fire",
      "talentRight": "+0,8 сек. действия Shackleshot"
    },
    {
      "talentLvl": "15",
      "talentLeft": "Windrun нельзя развеять",
      "talentRight": "+100 урона от Powershot"
    },
    {
      "talentLvl": "10",
      "talentLeft": "−2 сек. перезарядки Shackleshot",
      "talentRight": "+1,5 маны в секунду"
    }
  ]
}