{
  "abilities": [
    {
      "notes": [
        "Снаряд летит со скоростью в 500 единиц\n Снаряд во время полета даёт летающий обзор в радиусе 325\n Этот обзор не задерживается\n Также даёт летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания",
        "Проверяет  интеллект Skywrath Mage при запуске снаряда\n То есть урон снаряда устанавливается при запуске и не меняется при потере или получении интеллекта",
        "Здесь указано, сколько урона наносит Arcane Bolt с определенным количеством интеллекта, (до уменьшений):  1-й уровень (25  интеллекта): 113\/133\/153\/173 урона  5-й уровень (41  интеллекта): 137\/157\/177\/197 урона  10-й уровень (61  интеллекта): 168\/188\/208\/228 урона  15-й уровень (82  интеллекта): 199\/219\/239\/259 урона  20-й уровень (102  интеллекта): 229\/249\/269\/289 урона  25-й уровень (123  интеллекта): 260\/280\/300\/320 урона  30-й уровень (143  интеллекта): 291\/311\/331\/351 урона",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER ПРИМЕЧАНИЯ К ТАЛАНТАМ При использовании способности выбирается другая случайная цель в радиусе поиска для второго снаряда Arcane Bolt\n Радиус поиска закреплен за основной целью, а не Skywrath Mage\n Второй снаряд считает иллюзии и крипов-героев за героев\n Второй снаряд всё ещё не выбирает в качестве цели варды и постройки\n Не может выбрать в качестве цели невидимых, неуязвимых, спрятанных и невосприимчивых к магии врагов или существ в тумане войны\n Если подходящих целей не найдено, второй снаряд не выпускается"
      ],
      "item_behaviour": [],
      "description": "Герой выпускает во врага медленный заряд магической энергии, который наносит урон, зависящий от интеллекта.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,1+0,9",
        "Дальность применения: 875",
        "Количество целей: 1 ( 2) ( 2,  3)",
        "Базовый урон: 75\/95\/115\/135",
        "Множитель интеллекта: 1,5",
        "Радиус поиска вторичных целей:  700 ( 700)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Skywrath_Mage_Arcane_Bolt_1.mp3\/revision\/latest?cb=20191216023606",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "5\/4\/3\/2",
      "aghanim": null,
      "name": "Arcane Bolt",
      "cooldown": "95",
      "legacy_key": "C",
      "story": "Среди бесконечных интриг Жуткого гнезда лишь умный и спокойный имеет шанс на выживание."
    },
    {
      "notes": [
        "При применении Concussive Shot прерывает произносимые заклинания Skywrath Mage",
        "Concussive Shot летит со скоростью в 800 единиц\n Снаряд во время полета даёт летающий обзор в радиусе 300 единиц\n Этот обзор не задерживается\n Также даёт летающий обзор в месте нахождения цели на 3,34 секунды после успешного попадания",
        "Concussive Shot выбирает в цель ближайшее вражеское существо не являющееся вардом, постройкой или крипом-героем\n Приоритизирует героев (включая клонов) выше других существ\n Считает иллюзии крипами\n Не считает целью невидимых, неуязвимых или спрятанных существ или существ в тумане войны",
        "Урон по области и замедление действуют на ближайших крипов и призванных существ, нанося им 90\/135\/180\/225 урона",
        "Снаряд сначала наносит урон, а затем применяет дебафф",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER При использовании способности выбирается другая случайная цель в радиусе поиска для второго снаряда Concussive Shot\n Радиус поиска закреплен за основной целью, а не Skywrath Mage\n Второй снаряд считает иллюзии и крипов-героев за героев\n Второй снаряд всё ещё не выбирает в качестве цели варды и постройки\n Не может выбрать в качестве цели невидимых, неуязвимых, спрятанных и невосприимчивых к магии врагов или существ в тумане войны\n Если подходящих целей не найдено, второй снаряд не выпускается"
      ],
      "item_behaviour": [],
      "description": "Делает выстрел по ближайшему вражескому герою в большой области. При попадании наносит урон врагам в области действия и замедляет их.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+1,03",
        "Радиус поиска: 1600 ( Глобальная)",
        "Радиус урона\/замедления: 250",
        "Число целей: 1 ( 2)",
        "Урон по героям: 120\/180\/240\/300",
        "Урон по крипам: 75%",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Skywrath_Mage_Concussive_Shot_1.mp3\/revision\/latest?cb=20191216023609",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "mana": "15\/14\/13\/12",
      "aghanim": null,
      "name": "Concussive Shot",
      "cooldown": "80\/85\/90\/95",
      "legacy_key": "T",
      "story": "Те, кто служат при дворе Жуткого гнезда, вечно участвуют в скрытой борьбе. Важно всегда знать, где скрывается опасность."
    },
    {
      "notes": [
        "Снижает общее сопротивление магии героев до 10%\/6%\/2%\/-1% ( 1%\/-3%\/-7%\/-10%)\n Уменьшение сопротивления магии не действует на существ не-героев",
        "Несколько применений на одну и ту же цель не складываются, но обновляют длительность",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER При использовании способности выбирается другая случайная цель в радиусе поиска для второго снаряда Ancient Seal\n Радиус поиска закреплен за основной целью, а не Skywrath Mage\n Второй снаряд считает иллюзии и крипов-героев за героев\n Второй снаряд всё ещё не выбирает в качестве цели варды и постройки\n Не может выбрать в качестве цели невидимых, неуязвимых, спрятанных и невосприимчивых к магии врагов или существ в тумане войны\n Если подходящих целей не найдено, второй снаряд не выпускается"
      ],
      "item_behaviour": [],
      "description": "Оставляет печать древней руны на выбранном существе, запрещая ему применять способности и увеличивая магический урон по нему.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,1+0,97",
        "Дальность применения: 700\/750\/800\/850",
        "Число целей: 1 ( 2)",
        "Уменьшение сопротивления магии: 20%\/25%\/30%\/35% ( 32%\/37%\/42%\/47%)",
        "Длительность: 3\/4\/5\/6",
        "Радиус поиска вторичной цели:  700"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e1\/Skywrath_Mage_Ancient_Seal.mp3\/revision\/latest?cb=20191216023604",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "14 (TagTalent 6)",
      "aghanim": null,
      "name": "Ancient Seal",
      "cooldown": "80\/90\/100\/110",
      "legacy_key": "R",
      "story": "Всякий, кого коснётся священная печать Авилливы, должен перенести тягостное молчание."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard для разблокировки",
        "Получает эффект каждый раз, когда одна из способностей Skywrath Mage наносит урон противникам (до учёта сопротивлений)\n Срабатывает на способности, получающие эффекты от урона\n Если способность наносит 0 урона или отрицательное число урона противника, то герой всё равно получит эффект\n Не срабатывает на способности предметов, способности с нулевой перезарядкой или на способности которые не провоцируют срабатывание от применения\n Не срабатывает на урон, отмеченный как отнимающий здоровье",
        "Shield of the Scion даёт бонусы после нанесения урона",
        "Модификатор счётчика виден в интерфейсе и отображает текущее количество стаков на иконке\n Каждый стак имеет собственную длительность, успешные применения способностей не обновляют длительность предыдущих стаков\n Хотя модификатор количества развеивается при смерти, стаки на самом деле не развеиваются, так что смерть убирает лишь информацию о текущем количестве стаков",
        "Каждый стак в итоге даёт 24 маны, 0,1 восстановления маны и 2 основного урона от атаки",
        "Для  Arcane Bolt и  Concussive Shot: способность даёт по 1 эффекту за каждого задетого героя",
        "Для  Mystic Flare: Даёт эффект за каждого задетого героя при каждом нанесении урона\n Может суммарно дать 44  интеллекта и 11 брони за каждого задетого героя"
      ],
      "item_behaviour": [],
      "description": "Каждый раз, когда герой наносит магический урон вражескому герою своей способностью, он получает бонус к интеллекту и броне. Эффекты складываются, но их время действия не зависит друг от друга.",
      "hot_key": "?",
      "params": [
        "Бонусный интеллект за стак: 2",
        "Бонусная броня за стак: 0,5",
        "Длительность: 35"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Shield of the Scion",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "При наличии в радиусе вражеских героев (включая иллюзии, клонов и крипов-героев) только они получат урон",
        "Игнорирует спрятанных, неуязвимых существ и существ с невосприимчивостью к магии, поэтому они не поглощают урон",
        "Наносит урон с интервалом в 0,1 секунды спустя 0,1 секунды после применения, срабатывая 22 раз",
        "Здесь указано, сколько урона нанесет Mystic Flare при поражении определенного числа героев за всю длительность (до уменьшений): 1 герой: 36,36\/54,55\/72,73 (} 56,82\/75\/93,18) за интервал и 800\/1200\/1600 ( 1250\/1650\/2050) итогового урона\n 2 героя: 18,18\/27,27\/36,36 (} 28,41\/37,5\/46,59) за интервал и 400\/600\/800 ( 625\/825\/1025) итогового урона\n 3 героя: 12,12\/18,18\/24,24 (} 18,94\/25\/31,06) за интервал и 266,67\/400\/533,33 ( 416,67\/550\/683,33) итогового урона\n 4 героя: 9,09\/13,64\/18,18 (} 14,2\/18,75\/23,3) за интервал и 200\/300\/400 ( 312,5\/412,5\/512,5) итогового урона\n 5 героев: 7,27\/10,91\/14,55 (} 11,36\/15\/18,64) за интервал и 160\/240\/320 ( 250\/330\/410) итогового урона.",
        "Дебафф скрытый дебафф отвечает за частицы эффектов на пораженных врагах\n Его назначение — лишь визуальное\n Дебафф размещается аурой и задерживается на 0,5 секунды",
        "Улучшение <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter для Skywrath Mage не требует изученного Mystic Flare, так как взаимодействует с каждой его способностью",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER При использовании способности выбирается другая случайная цель в радиусе поиска для второго снаряда Mystic Flare, но дальше, чем на расстоянии 170 от первичной цели\n Радиус поиска закреплен за основной целью, а не Skywrath Mage\n Второй снаряд считает иллюзии и крипов-героев за героев\n Второй снаряд всё ещё не выбирает в качестве цели варды и постройки\n Не может выбрать в качестве цели невидимых, неуязвимых, спрятанных и невосприимчивых к магии врагов или существ в тумане войны\n Если подходящих целей не найдено, второй снаряд не выпускается"
      ],
      "item_behaviour": [],
      "description": "Герой создаёт направленное поле сверхъестественной силы, сокрушая врагов. Поле наносит огромный урон, который равномерно распределяется между героями в области действия в течение 2,2 сек.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения: 1200",
        "Радиус поля: 170",
        "Количество полей: 1 ( 2)",
        "Интервал нанесения урона: 0,1",
        "Итоговый урон: 800\/1200\/1600 ( 1250\/1650\/2050)",
        "Длительность поля: 2,2",
        "Радиус поиска вторичной цели:  700"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Skywrath_Mage_Mystic_Flare_1.mp3\/revision\/latest?cb=20191216023602",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "mana": "60\/40\/20",
      "aghanim": null,
      "name": "Mystic Flare",
      "cooldown": "350\/575\/800",
      "legacy_key": "E",
      "story": "Только самые опытные маги скайрасов могут разверзнуть в небесах такую бурю."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 4.1,
    "attrAgilityInc": 0.8,
    "attrAgility": 13.0
  },
  "description": "Наносит много магического урона одной цели Смертоносный, но защищённый только щитом предков Skywrath Mage быстро уничтожает врагов залпами мощной магии. Выпуская одну за другой магические стрелы и замедляя противников сотрясающим ударом, он сотрёт в порошок кого угодно благодаря своей способности обезмолвить противника, сделав его уязвимым к заклинаниям.  Поддержка Быстрый урон Контроль ★☆☆",
  "history": "Драгонас занимает высокий пост мага при дворе Жуткого гнезда, но дни его полны печали. По праву рождения он обязан защищать любого, кто займёт Терновое гнездо, но действующую королеву скайрасов он ненавидит всем сердцем. Будучи юношей знатного происхождения, он общался и дружил со старшей принцессой скайрасов, Шенделезарой, следующей в очереди на престол. Нежно и непоколебимо он любил её, но когда пришла пора приступить к учёбе, Драгонас с головой погрузился в тайны скайрасской магии. Одержимый неземными материями, он проглядел знаки вполне приземлённых интриг — заговора против Шенделезары — и уже не смог предотвратить его. Когда двор потряс стремительный и жестокий переворот, Драгонас бросил обучение и обнаружил, что потерял своего самого старого и дорогого друга. Терновое Гнездо теперь принадлежало беспощадной младшей сестре Шенделезары, и Драгонас был бессилен что-либо сделать. Магия его служит лишь верным защитникам племени скайрасов, поэтому любые действия против Жуткого гнезда были бы тщетны. Он остался верен своему положению, надеясь, что однажды придёт день, когда его любовь вернёт свое принадлежащее по праву место. Но его тайные помыслы известны лишь богине Скриок, чья магия превратила искалеченное тело Шенделезары в воплощение чистой мести. Драгонас грезит мыслями о возвращении своей возлюбленной королевы в Жуткое гнездо, но ещё более отчаянно мечтает вернуть Шенделезаре полностью исцеленное тело. Будучи благородным и добросердечным существом, он страдает от своего же двуличия, но самая жуткая пытка — представлять ту ненависть к нему, которую хранит в своем сердце Vengeful Spirit."
}