{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Bottle_Regenerate.mp3\/revision\/latest?cb=20191227195401",
      "effects": [
        "Дальность применения: 350",
        "Всего восстанавливает здоровья: 110",
        "Всего восстанавливает маны: 60",
        "Длительность: 2,7",
        "Количество зарядов: 3"
      ],
      "notes": [
        "При использовании прерывает произносимые способности.",
        "Bottle мгновенно возобновляет все заряды в области фонтана команды.",
        "Если Bottle пуст, то применение Regenerate не даёт какого-либо эффекта, при этом активирует перезарядку.",
        "При нажатии всегда применяется на владельца. С зажатой клавишей Ctrl можно выбрать цель.",
        "С зажатой клавишей Ctrl можно выбрать цель.",
        "Несколько применений на одну и ту же цель не складываются, но обновляют длительность.",
        "Можно использовать только на героев (включая иллюзии) и крипов-героев.",
        "Заклинателю не нужно поворачиваться к цели, чтобы использовать Bottle.",
        "Один заряд восстанавливает до 40,74 здоровья и 22,22 маны за всю длительность. Все 2,7 заряда восстанавливают до 297 здоровья и 162 маны.",
        "Все 2,7 заряда восстанавливают до 297 здоровья и 162 маны.",
        "Урон свыше 0 от любого игрока (включая союзников, исключая себя) или Рошана развеет эффект. Эффект не будет развеян уроном с пометкой «отнимающий здоровье».",
        "Эффект не будет развеян уроном с пометкой «отнимающий здоровье»."
      ],
      "mana": "0",
      "abilityName": "Regenerate",
      "cooldown": "0,5",
      "description": "Тратит один заряд, чтобы постепенно восстановить цели 110 здоровья и 60 маны за 2,7 сек. Восстановление прекращается при получении урона от вражеских героев или Рошана. Заряды можно восполнить возле союзного фонтана. Зажмите Ctrl, чтобы применить на союзника.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Bottle_Store_Rune.mp3\/revision\/latest?cb=20191227195402",
      "effects": [
        "Дальность применения: 100",
        "Макс. длительность хранения руны: 90"
      ],
      "notes": [
        "При наличии Bottle, Нажатие ПКМ по руне поместит её в бутыль, вместо активации. Руны нельзя хранить, когда Bottle находится в ранце. Также Bottle, хранящий руну, нельзя переместить в ранец. Для хранения рун Bottle необязательно должен быть пустым. Полный Bottle также можно использовать для хранения рун. Только герои и дух-медведь могут хранить руны. Иллюзии и курьеры это делать не могут. В Bottle одновременно может храниться только одна руна. Попытка помещения новой руны, лишь активирует новую. При этом в инвентаре можно хранить несколько Bottle с разными рунами.",
        "Руны нельзя хранить, когда Bottle находится в ранце. Также Bottle, хранящий руну, нельзя переместить в ранец.",
        "Для хранения рун Bottle необязательно должен быть пустым. Полный Bottle также можно использовать для хранения рун.",
        "Только герои и дух-медведь могут хранить руны. Иллюзии и курьеры это делать не могут.",
        "В Bottle одновременно может храниться только одна руна. Попытка помещения новой руны, лишь активирует новую.",
        "При этом в инвентаре можно хранить несколько Bottle с разными рунами.",
        "При наличии хранимой руны в Bottle, способность Regenerate активирует руны, вместо восстановления использовавшего. Так как это та же активная способность, она также перывает произносимые способности при применении, и снимает невидимость. Если хранимая руна не была активирована вручную в течении 90 сек., то она активируется автоматически. В отличие от применения вручную, эта автоматическая активация никак не прерывает владельца и не снимает невидимость. Если при этом событии владелец мёртв, то хранимая руна исчезает без применения каких-либо её эффектов.",
        "Так как это та же активная способность, она также перывает произносимые способности при применении, и снимает невидимость.",
        "Если хранимая руна не была активирована вручную в течении 90 сек., то она активируется автоматически.",
        "В отличие от применения вручную, эта автоматическая активация никак не прерывает владельца и не снимает невидимость.",
        "Если при этом событии владелец мёртв, то хранимая руна исчезает без применения каких-либо её эффектов.",
        "Вопреки описанию, заряды Bottle восполняются когда руна помещается в бутыль, а не активируется.",
        "Вопреки описанию, только руны усиления восполняют все 3 заряда. Помещение в Bottle руны богатства или руны воды восполнит его только до 2\/3 зарядов (если он ещё не имел более 2 зарядов)."
      ],
      "mana": null,
      "abilityName": "Store Rune",
      "cooldown": null,
      "description": "В бутыль можно поместить одну руну, чтобы воспользоваться ей позже. Помещённая в бутыль руна задействуется сама спустя 90 сек. Руны полностью наполняют бутыль.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Items_rune_bounty.mp3\/revision\/latest?cb=20201219110206",
      "effects": [
        "Золота команде при первом появлении: 40",
        "Базового золота команде при последующих появлениях: 36",
        "Дополнительного золота команде при последующих появлениях за интервал: 9",
        "Интервал дополнительного золота команде: 300"
      ],
      "notes": [
        "Первые руны появляются в 0:00 по игровому времени и дают каждому игроку фиксированное количество золота в 40 единиц.",
        "Последующие руны богатства дают базовое количество в 36 единиц золота, плюс 9 дополнительного золота за каждые пройденные 5 мин. При взятии в бутыль руны богатства, даёт золото, основанное на времени при активации, а не при взятии.",
        "При взятии в бутыль руны богатства, даёт золото, основанное на времени при активации, а не при взятии.",
        "Взятие в бутыль руны богатства восполняет его только на 2 заряда (если он ещё не имел более 2 зарядов).",
        "Даёт надёжное золото каждому игроку подобравшей команды.",
        "Текст над головой показывает сколько получено золота. Число не видимо врагам.",
        "При получении золота от использования руны богатства у героя появляется маленький эффект золотых частиц, который виден всем игрокам.",
        "В режиме Turbo, получаемое золото с рун увеличено в два раза. (не смотря на уведомление со стандартным значением)"
      ],
      "mana": null,
      "abilityName": "Богатство",
      "cooldown": null,
      "description": "Дает дополнительные золото.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c1\/Items_rune_arcane.mp3\/revision\/latest?cb=20201219110203",
      "effects": [
        "Уменьшение перезарядки: 30%",
        "Уменьшение затрат маны: 30%",
        "Длительность: 50"
      ],
      "notes": [
        "Сочетается мультипликативно с остальными источниками уменьшения времени перезарядки.",
        "Эффект применяется к юнитам имеющим иммунитет к заклинаниям и неуязвимость.",
        "Эффект нескольких рун волшебства не сочетается, но обновляется длительность."
      ],
      "mana": null,
      "abilityName": "Волшебство",
      "cooldown": null,
      "description": "Уменьшает время перезарядки способностей на 30% и расход маны на них на 30%.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Items_rune_dd.mp3\/revision\/latest?cb=20201219110209",
      "effects": [
        "Доп. урон: 100%",
        "Длительность: 45"
      ],
      "notes": [
        "Увеличивает только начальный урон и который получен от основной характеристики героя. Непрямой бонусный урон не увеличивается.",
        "Текущий основной урон героя периодически проверяется и бонусы мгновенно адаптируются.",
        "Эффект может получить существо имеющее иммунитет к заклинаниям и неуязвимость.",
        "Эффект от нескольких рун двойного урона не сочетается, но обновляется длительность."
      ],
      "mana": null,
      "abilityName": "Двойной урон",
      "cooldown": null,
      "description": "Увеличивает базовый урон на 100%.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Items_rune_haste.mp3\/revision\/latest?cb=20201219110212",
      "effects": [
        "Скорость передвижения: 550",
        "Длительность: 22"
      ],
      "notes": [
        "Применяет ускорение на цель, что не дает замедлять цель ниже указанного значения.",
        "Эффект может получить юнит имеющий иммунитет к заклинаниям и неуязвимость.",
        "Эффект от нескольких рун ускорения не сочетается, но обновляется длительность."
      ],
      "mana": null,
      "abilityName": "Ускорение",
      "cooldown": null,
      "description": "Увеличивает скорость передвижения до максимума.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5d\/Items_rune_illusion.mp3\/revision\/latest?cb=20201219110213",
      "effects": [
        "Время разделения: 0,1",
        "Кол-во иллюзий: 2",
        "Наносимый иллюзиями урон: 35%",
        "Получаемый иллюзиями урон (TagAghanimБлижний бой): 200%",
        "Получаемый иллюзиями урон (TagAghanimДальний бой): 300%",
        "Длительность: 75"
      ],
      "notes": [
        "При применении на игрока действует неуязвимость, исчезновение и иммунитет к заклинаниям во время разделения.",
        "При применении позволяет избегать снаряды.",
        "При использовании применяет к владельцу базовое развеивание.",
        "Во время разделения сбрасывает все текущие приказы на атаку и применение направленных заклинаний.",
        "После разделения заклинатель появляется со своими иллюзиями. Место появления основано на позиции при применении: один из юнитов появляется на месте использования, а остальные — на севере, западе, юге или востоке от этой точки. Расстояние между существами составляет 108, если размер столкновения героя равен 24, и 24 — если размер столкновения равен 8. Поскольку порядок появления всегда одинаковый, то заклинатель и иллюзии занимают случайную позицию и смотрят в одну сторону.",
        "Место появления основано на позиции при применении: один из юнитов появляется на месте использования, а остальные — на севере, западе, юге или востоке от этой точки.",
        "Расстояние между существами составляет 108, если размер столкновения героя равен 24, и 24 — если размер столкновения равен 8.",
        "Поскольку порядок появления всегда одинаковый, то заклинатель и иллюзии занимают случайную позицию и смотрят в одну сторону.",
        "Активация руны иллюзий в момент, когда на карте уже есть ваши копии от другой руны иллюзий не повлияет на них. То есть на карте станут присутствовать 4 копии."
      ],
      "mana": null,
      "abilityName": "Иллюзии",
      "cooldown": null,
      "description": "Создает 2 иллюзии вашего героя, наносящие 35% урона. Иллюзии ближнего боя получают 200% урона, дальнего — 300%. Иллюзии пропадут через 75 секунд.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4c\/Items_rune_invis.mp3\/revision\/latest?cb=20201219110216",
      "effects": [
        "Время до невидимости: 2",
        "Длительность: 45"
      ],
      "notes": [
        "За две секунды до активации невидимости герой может применять заклинания, использовать предметы и атаковать без отмены невидимости.",
        "Невидимость исчезает при произнесении заклинаний после окончания времени применения, использовании предметов или нанесении атаки после окончания анимации атаки.",
        "Невидимый герой может поднимать или выкладывать предметы без потери невидимости. Атака предметов отменяет невидимость.",
        "Невидимость от руны невидимости не дает герою способность к прохождению сквозь существ, он всё еще может блокировать путь существу.",
        "Эффект может получить существо, имеющее иммунитет к заклинаниям и неуязвимость.",
        "Эффект от нескольких рун невидимости не сочетается, но обновляется длительность."
      ],
      "mana": null,
      "abilityName": "Невидимость",
      "cooldown": null,
      "description": "Вы станете невидимым на 45 секунд. Руна прекращает свое действие при атаке или при использовании умения или предмета.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Items_rune_regen.mp3\/revision\/latest?cb=20201219110218",
      "effects": [
        "Регенерация здоровья в секунду: 6%",
        "Регенерация маны в секунду: 6%",
        "Длительность: 30"
      ],
      "notes": [
        "Восстановление в форме регенерации, восстанавливает 0,6% от максимального запаса здоровья и 0,6% от максимального запаса маны в интервалах 0,1 секунды.",
        "За полную длительность может восстановить до 180% от максимального запаса здоровья и 180% от максимального запаса маны.",
        "Может полностью вылечить и пополнить ману за 16,67 сек.",
        "Эффект исчезает когда герой имеет полный запас маны и здоровья.",
        "Урон, превышающий 0 от любого игрока(включая союзных и себя) или Рошана прекращает действие эффекта. Но не развеевается от заклинаний, помечанных как отнимающие здоровье.",
        "Но не развеевается от заклинаний, помечанных как отнимающие здоровье.",
        "Эффект может быть у юнитов, имеющих иммунитет к заклинаниям и неуязвимость.",
        "Эффект от нескольких рун регенерации не сочетается, но обновляется длительность."
      ],
      "mana": null,
      "abilityName": "Регенерация",
      "cooldown": null,
      "description": "Восстанавливает здоровье и ману до максимума.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8d\/Items_rune_water.mp3\/revision\/latest?cb=20210410131702",
      "effects": [
        "Восстанавливается здоровья: 40",
        "Восстанавливается маны: 80"
      ],
      "notes": [
        "Взятие в бутыль руны воды восполняет его только на 2 заряда (если он ещё не имел более 2 зарядов)."
      ],
      "mana": null,
      "abilityName": "Вода",
      "cooldown": null,
      "description": "Мгновенно восстанавливает 40 здоровья и 80 маны.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Bottle с руной нельзя передать, выбросить или переместить в ранец.",
    "Bottle это постоянный предмет и не исчезает после использования всех зарядов. Значение продажи предмета не зависит от оставшихся зарядов или хранимой руны.",
    "Значение продажи предмета не зависит от оставшихся зарядов или хранимой руны."
  ],
  "cost": "675",
  "lore": null,
  "consistFrom": null,
  "name": "Bottle",
  "description": "",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}