{"abilities":[{"spell":"Использует заряд шрапнели, покрывая указанную область дождем из разрывной дроби. Противники под ним замедляются и получают урон. Раскрывает туман войны в области действия. Заряды способности восстанавливаются каждые 50 секунд.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["При изучении Shrapnel Sniper сразу получает все 50 заряда. Выбор таланта на дополнительные заряды также сразу дает 6 зарядов.","Shrapnel начинает наносить урон, замедлять и давать обзор после небольшой задержки.","Дает летающий обзор в радиусе 450 единиц в выбранной области.","Урон и замедление представляются в виде ауры. Дебафф задерживается на 0.5 секунды. Несколько применений ауры не складываются.","Наносит урон с интервалом в 1 секунду сразу после размещения дебаффа, нанося урон до 11 раз.","Может нанести до 165\/385\/605\/825 единиц урона одному юниту (до учета сопротивления).","Не наносит урон по строениям."],"mana":"50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Shrapnel","description":["Анимация применения: 0,3+0","Дальность применения: 1800","Радиус: 450","Задержка: 1,2","Урон в секунду: 15\/35\/55\/75","Замедление скорости передвижения: 15%\/20%\/25%\/30% ( 35%\/40%\/45%\/50%)","Длительность задержки ауры: 0.5","Длительность: 10","Число зарядов: 3 ( 9)","Время восстановления заряда: 50 ( 37.5)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Sniper стреляет точнее, получая шанс нанести дополнительный урон и ненадолго остановить противника.","effects":["Способность Пассивная","Действует на Врагов \/ Союзников","Урон Физический"],"notes":["Headshot может промахнутся.","Сработавшая атака сначала применяет дебафф, затем наносит урон.","Дополнительный урон наносится одним источником вместе с атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.","В среднем увеличивает урон Sniper на 12\/24\/36\/48.","Не может сработать на вардах и строениях, но срабатывает на союзников.","Headshot использует псевдо-случайное распределение.","При выборе таланта на отбрасывание, при срабатывании Headshot применяет принудительное движение к цели, отталкивая цель от Sniper. Отбрасывание не прерывает произносимые способности. Отбрасывание не применится на юнитов, которые уже находятся под действием других источников принудительного движения. Отбрасывает назад юнитов со скоростью в 100 (450) единиц."],"mana":"0","elements":["Не может использоваться иллюзиями.","Можно избежать.","Отключается истощением.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Headshot","description":["Шанс срабатывания: 40%","Урон: 30\/60\/90\/120","Замедление скорости передвижения: 100%","Замедление скорости атаки: 100","Дальность отбрасывания: 10 ( 45)","Длительность замедления: 0.5","Длительность отбрасывания: 0.1"],"hot_key":"W","legacy_key":"D"},{"spell":"Увеличивает дальность атак героя. При применении бонус к дальности следующей атаки увеличивается в два раза.","effects":["Способность Ненаправленная \/ Пассивная","Действует на Себя"],"notes":["При применении прерывает произносимые заклинания Sniper.","При применении Sniper получает бафф, удваивающий дальность атаки от Take Aim.","У баффа нет установленной длительности. Он активен до совершения атаки или смерти заклинателя.","Перезарядка начинается после потери баффа любым путем, а не после применения.","Пассивно увеличивает общую дальность атаки Sniper до 650\/750\/850\/950 ( 775\/875\/975\/1075). При активации дальность одной атаки Sniper равна 750\/950\/1150\/1350 ( 875\/1075\/1275\/1475)"],"mana":"30","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"15\/12\/9\/6","name":"Take Aim","description":["Анимация применения: 0+0","Пассивная доп. дальность атаки: 100\/200\/300\/400","Активная доп. дальность атаки: 100\/200\/300\/400","Число атак при активации: 1"],"hot_key":"E","legacy_key":"E"},{"spell":"Sniper целится во вражеского юнита и через 2 секунды совершает сокрушительный выстрел, который наносит урон с огромной дистанции. Способность кратковременно оглушает цель.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Врагов","Урон Магический ( Физический)"],"notes":["Снаряд летит со скоростью 2500.","Assassinate размещает дебафф на цель как только Sniper начинает прицеливаться. Дебафф длится 4 секунды или до момента, когда снаряд попадет, или до момента отмены. Дебафф дает общий обзор на выбранного юнита. Не дает никакого обзора при выборе нейтральных крипов. Дебафф дает эффект True Sight на цель. То есть, Assassinate нельзя отменить или избежать, уйдя в невидимость. Но при этом юниты под действием Shadow Dance и Smoke of Deceit получают иммунитет к True Sight и отменяют или избегают снаряд. Дебафф виден всем. При этом прицел над целью виден только союзникам.","Может напрямую выбрать в качестве цели неуязвимых юнитов и не отменяется, если цель стала неуязвимой во время применения. Дебафф, дающий обзор, не размещается при выборе неуязвимого юнита, но остается, если юнит сталл неуязвимым во время применения. Снаряд не сработает на цель, если она останется неуязвимой на момент попадания.","Не может выбрать целью скрытых юнитов и отменится, если цель стала скрытой.","Начальный звук подготовки оружия, звучащий в момент применения, слышен только Sniper.","При улучшении Assassinate выделяет каждого подконтрольного игрокам юнита в выбранной области, размещая дебафф, дающий обзор, и прицел на всех подконтрольных игрокам юнитов. Однако при достижении точки применения снаряды поражают только героев, иллюзий и крипов-героев. Остальные выделеные юниты не получают удара. В то время, как дебафф, дающий обзор, исчезает только в том случае, когда снаряд попадет или до момента отмены, для всех остальных выбранных юнитов дебафф длится полные 4 секунды. В отличии от версии, действующей на одну цель, улучшенный Assassinate полностью игнорирует неуязвимых юнитов. Он изначально никак не помечает их и также не выпускает в них снаряд. Все цели при применении помечаются. Вход или покидание области после истечения времени применения не даст никакого эффекта. В отличии от версии, действующей на одну цель, которая зависит от дальности, версия, действующая по области, от этого не зависит; не имеет значения, как далеко переместился отмеченный враг, он все равно получит удар. Это значит, если враг телепортируется после получения отметки, Sniper все равно запустит в него снаряд. Если в области применения нет подходящих целей, способность все равно применится, потратит ману и уйдет на перезарядку.","Aghanim's Scepter заставляет Sniper применять мгновенную атаку по всем целям. Запущенный снаряд продолжает считаться обычным снарядом от Assassinate, но устанавливает урон от него на 280% единиц. Мгновенная атака применяется при поражении снарядом цели. Эти мгновенные атаки не используют скорость полета снаряда Sniper, а поражают цели мгновенно. Эти атаки обладают эффектом точности и не могут промахнутся. Атаки также игнорируют обезоруживание. На способность могут сработать любые модификаторы атаки на все поражаемые цели. Также могут сработать любые эффекты, срабатывающие при ударе, включая блокировку урона. Атаки имеют гарантированный критический удар. На них также всегда срабатывает Headshot."],"mana":"175\/225\/275","elements":["Можно частично избежать.","Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/15\/10 ( 15\/11.25\/7.5)","name":"Assassinate","description":["Анимация применения: 2+1,37 ( 0,5+2,87)","Дальность применения: 3000","Радиус: 0 ( 400)","Урон: 320\/485\/650 ( 0)","Критический урон: 0% ( 280%)","Длительность оглушения: 0.01","Макс. длительность баффа обзора: 4"],"hot_key":"R","legacy_key":"T"}],"bio":"Кардел Остроглаз родился глубоко в горах Кноллена, где смышлёнцы с незапамятных времен жили охотой на странных существ-скалолазов, обитавших над деревней — отстреливая их издали и собирая упавшие с высоких утёсов туши. Наш герой был одним из лучших стрелков своего народа — ружьё словно было продолжением его руки, а выстрел — её прикосновением. В день инициации, когда Кардел должен был стать полноправным членом деревни, его ждало древнее испытание: убить животное на одном из утёсов одним выстрелом со дна долины. Промах лишил бы стрелка всякой чести. Под взглядами всей деревни Кардел выстрелил. Зверь был убит; толпа взревела. Но чуть только тушу нашли, ликования стихли: старейшины обнаружили, что пуля попала прямо в средний глаз зверя и застряла в жвалах. Этот зловещий знак был описан в тёмном пророчестве, предрекавшем стрелку славу, но обрекая его на изгнание. Один точный выстрел вынудил Кардела расстаться со своим народом — и никто не примет его обратно, пока он не выполнит пророчество, добившись легендарного величия на поле боя.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["Шуточное имя героя в DotA было \"Василий Зайцев\", имя легендарного русского снайпера, одного из лучших снайперов в истории войны. ","Фразы и реплики героя также используются классом Снайпер из игры Team Fortress 2, разработанной компанией Valve. Это такие фразы как: Играть Thanks for standing still, wanker! Играть Let's have a go at it! Играть Jarate! Играть Professionals have standards. Играть I'm polite and efficient. Играть As long as there are two heroes left on the battlefield, someone is gonna want someone dead.","One of Sniper's lines while bottling a rune is Играть \"Jarate!\", which is a reference to Team Fortress 2 in-game weapon for Sniper class, Jarate.","Incidentally, his voice actor, Gary Schwartz, also voices the Heavy Weapons Guy and Demoman in Team Fortress 2. Sniper's line, \"Играть Inconceivable!\" is likely a reference to Vizzini's catchphrase in the film The Princess Bride due to the similarities in both the appearance and voices of the two. Sniper's name, Kardel Sharpeye, is a reference to professional Counter-Strike player Kyle \"Ksharp\" Miller of team 3D, who is regarded for his skillful AWP (Sniper rifle) use.","Звук Играть выстрела у Assassinate взят от снайперской винтовки AWP из игры Counter-Strike. Sniper's model in Dota 2 is based loosely off of Gary Oldman's portrayal of the real life sniper Lee Harvey Oswald in the 1991 film JFK. Sniper's fun name in DotA was Vasily Zaitsev, a highly skilled Russian sniper who was active during World War 2. Sniper's line, \"Играть What a dum-dum!\" is a pun on the Expanding bullet, also known as a dum-dum. It is designed to expand on impact in order to limit penetration and create a wound larger in diameter. Sniper's line \"A few bullet's more\" is a reference to the spaghetti western by Sergio Leone named For a Few Dollars More starring Clint Eastwood."],"talents":["+6 зарядов Shrapnel:+125 к дальности атаки","-1,5 сек. подготовки Assassinate:Headshot отбрасывает цели на 35 единиц","+20% к замедлению от Shrapnel:+40 к скорости атаки","+20 к урону:-25% перезарядки способностей"],"tips":["Шуточное имя героя в DotA было \"Василий Зайцев\", имя легендарного русского снайпера, одного из лучших снайперов в истории войны. ","Фразы и реплики героя также используются классом Снайпер из игры Team Fortress 2, разработанной компанией Valve. Это такие фразы как: Играть Thanks for standing still, wanker! Играть Let's have a go at it! Играть Jarate! Играть Professionals have standards. Играть I'm polite and efficient. Играть As long as there are two heroes left on the battlefield, someone is gonna want someone dead.","One of Sniper's lines while bottling a rune is Играть \"Jarate!\", which is a reference to Team Fortress 2 in-game weapon for Sniper class, Jarate.","Incidentally, his voice actor, Gary Schwartz, also voices the Heavy Weapons Guy and Demoman in Team Fortress 2. Sniper's line, \"Играть Inconceivable!\" is likely a reference to Vizzini's catchphrase in the film The Princess Bride due to the similarities in both the appearance and voices of the two. Sniper's name, Kardel Sharpeye, is a reference to professional Counter-Strike player Kyle \"Ksharp\" Miller of team 3D, who is regarded for his skillful AWP (Sniper rifle) use.","Звук Играть выстрела у Assassinate взят от снайперской винтовки AWP из игры Counter-Strike. Sniper's model in Dota 2 is based loosely off of Gary Oldman's portrayal of the real life sniper Lee Harvey Oswald in the 1991 film JFK. Sniper's fun name in DotA was Vasily Zaitsev, a highly skilled Russian sniper who was active during World War 2. Sniper's line, \"Играть What a dum-dum!\" is a pun on the Expanding bullet, also known as a dum-dum. It is designed to expand on impact in order to limit penetration and create a wound larger in diameter. Sniper's line \"A few bullet's more\" is a reference to the spaghetti western by Sergio Leone named For a Few Dollars More starring Clint Eastwood."],"desc":"%"}