{"abilities":[{"spell":"Medusa magically splits her shot into several arrows. These arrows deal a lower percent of her normal damage. The extra targets will not receive other attack effects (such as critical strike).","effects":["Ability Passive","Affects Enemies"],"notes":["Causes Medusa to perform instant attacks on a certain number of enemies whenever she launches an attack projectile. This means all projectiles are released at the same time together with the main attack. Therefore, it does not matter whether the primary attack misses or not, the extra arrows are still released.","The primary attack target is not affected by Split Shot. It is only hit by the primary attack, which deals full attack damage to it.","The extra arrows travel at the same speed as the primary arrow.","The search radius is based on Medusa's attack range + 100, resulting in a search radius of 700, considering her default attack range.","The instant attacks of Split Shot may not proc any attack modifiers or on-hit effects, unless the talent which allows them to do so is chosen. However, they still count as regular attacks. Damage done by Split Shot does not count as spell damage. They are also affected by armor type, and blocked by damage block like regular attacks. If Medusa is blinded, Split Shots can miss, unless she has True Strike. They can also miss to evasion.","Does not target wards, buildings, invisible units, attack immune units, or units inside the Fog of War, but does target couriers. However, attacking wards or buildings still causes secondary arrows to hit valid targets within the radius. Secondary arrows are not released upon attacking allies."],"mana":"0","elements":["Can be used by illusions.","Can be disjointed.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Split Shot","description":["Secondary Arrows Range Bonus: 100","Bonus Attack Targets: 3","Secondary Arrows Outgoing Damage: 30%\/45%\/60%\/75%"],"hot_key":"Q","legacy_key":"T"},{"spell":"A mystic snake made of energy jumps from target to target dealing damage and stealing mana. After it reaches its last target, it returns to Medusa to replenish her with mana. The snake deals more damage per jump and steals 11%\/14%\/17%\/20% of the targets' total mana. Deals Pure damage to units petrified by Stone Gaze.","effects":["Ability Target Unit","Affects Enemies \/ Self","Damage Magical"],"notes":["Mystic Snake travels at a speed of 800.","Applies the mana loss first, and then the damage ( and then the Stone Gaze debuff).","The snake always bounces to the closest valid target around its current target. Cannot hit the same unit more than once per cast.","Upon returning to Medusa, she receives exactly the amount of mana all targets lost to Mystic Snake.","The snake does not steal any mana from illusions it jumps on.","Mystic Snake needs to hit units with a combined total mana pool of 1273\/1072\/942\/851 ( 389\/385\/381\/378) in order to fully reclaim its mana cost.","Each successful hit on an enemy increases the damage of the next bounce by 35% of the ability's base damage. This means its damage grows not exponentially but linearly, dealing 28\/42\/56\/70 damage more per bounce.","This is how much damage Mystic Snake deals ( and for how long it petrifies) per bounce when all bounces successfully hit (before reductions): Level 1: 80\/108\/136 damage, 324 total damage (1\/1.3\/1.6 seconds petrified) Level 2: 120\/162\/204\/246 damage, 732 total damage (1\/1.3\/1.6\/1.9 seconds petrified) Level 3: 160\/216\/272\/328\/384 damage, 1360 total damage (1\/1.3\/1.6\/1.9\/2.2 seconds petrified) Level 4: 200\/270\/340\/410\/480\/550 damage, 2250 total damage (1\/1.3\/1.6\/1.9\/2.2\/2.5 seconds petrified)","The snake can bounce on units in the Fog of War, but not on invisible, invulnerable or hidden units.","If the snake's current target dies or turns invulnerable, hidden or invisible, the bounce neither counts, nor increases the damage. The snake continues bouncing to nearby valid targets in these cases.","The snake provides 100 radius flying vision around itself. The vision does not last.","The Aghanim's Scepter upgrade requires Stone Gaze to be learned. It applies the same modifier as Stone Gaze does, so their effects do not stack. The debuff also always uses Stone Gaze's icon."],"mana":"140\/150\/160\/170","elements":["Cannot be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"11 ( 7)","name":"Mystic Snake","description":["Cast Animation: 0.4+0.57","Cast Range: 700","Bounce Radius: 475","Number of Bounces: 3\/4\/5\/6","Base Damage: 80\/120\/160\/200","Damage Increase per Bounce: 35%","Max Mana Stolen: 11%\/14%\/17%\/20% ( 36%\/39%\/42%\/45%)","Base Stone Duration: 0 ( 1)","Stone Duration Increase per Bounce: 0 ( 0.3)"],"hot_key":"W","legacy_key":"C"},{"spell":"Creates a shield that absorbs 60% of the incoming damage in exchange for Medusa's mana.","effects":["Ability Toggle","Affects Self"],"notes":["Mana Shield does not interrupt Medusa's channeling spells upon cast.","Absorbs damage before any damage reduction takes place, including damage block or reduction from spells (e.g. Aphotic Shield). This also affects everything which works directly with damage dealt after reductions (e.g. Orchid Malevolence).","Increases Medusa's effective health by 150% when toggled on, assuming she has enough mana.","Mana Shield persists through Medusa's death. If Mana Shield was active upon death, she respawns with it active."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Cannot be used by illusions.","Pierces spell immunity."],"cooldown":"0","name":"Mana Shield","description":["Cast Animation: 0+0","Damage Absorption: 60%","Damage Absorbed per Mana: 1.6\/1.9\/2.2\/2.5"],"hot_key":"E","legacy_key":"E"},{"spell":"Any enemy units looking at Medusa will have their movement and attack speed slowed. If 2 seconds of total time is accumulated looking at Medusa while Stone Gaze is active, that unit will turn to stone. Petrified units are stunned, and take bonus physical damage.","effects":["Ability No Target","Affects Enemies"],"notes":["The enemy team must gain vision over Medusa (while she is using Stone Gaze) for at least 1 server tick before it will begin to affect any enemies. Stone Gaze will affect no enemies at all until this is achieved. Once this is achieved, enemies that break vision of Medusa can still be affected by Stone Gaze, even through the fog of war.","Every enemy unit that faces Medusa within 85° in front of them within a 1000 radius around Medusa gets the facing and the slow debuff applied.","The facing debuff counts for how long the unit faces Medusa. If it accumulates 2 seconds of facing time, it petrifies the unit. The facing debuff lasts for either as long as Stone Gaze does (ending whenever Stone Gaze ends in any way), or until getting petrified. Looking away from Medusa does not reset the the 2 second facing counter. Facing Medusa while invulnerable or hidden still counts towards the 2 second counter. This means the petrifying can be avoided by being invulnerable as the spell attempts to petrify.","The slow debuff only slows affected enemies while facing Medusa. Units that turn away are not slowed, but keep the debuff. The slow debuff lasts for either as long as Stone Gaze does (ending whenever Stone Gaze ends in any way), or until getting petrified.","Once the petrify debuff expires, the unit can be affected by Stone Gaze again, repeating until Stone Gaze ends, so long the unit faces Medusa.","The petrification is a simple stun, which also freezes animations, and amplifies incoming physical attack damage. Does not amplify magical or pure attack damage, and does not amplify physical spell damage.","Stone Gaze does not affect neutral creeps.","Stone Gaze ends when Medusa dies, but already petrified enemies stay petrified for the duration."],"mana":"200","elements":["Pierces spell immunity."],"cooldown":"90","name":"Stone Gaze","description":["Cast Animation: 0.4+0.5","Radius: 1000","Facing Angle: 85°","Move Speed Slow: 35%","Attack Speed Slow: 35","Turn Rate Slow: 35%","Physical Attack Damage Amplification: 50%","Gaze Duration: 5\/6\/7 ( 7.5\/8.5\/9.5)","Stone Duration: 3"],"hot_key":"R","legacy_key":"G"}],"bio":"Beauty is power. This thought comforted Medusa--the youngest and loveliest of three beautiful Gorgon sisters, born to a sea goddess--because she alone of the sisters was mortal. It comforted her, that is, until the day masked assailants invaded the Gorgon realm and tore the two immortal sisters from their home, unmoved by their beauty or by their tears. One of the invaders seized Medusa as well, but then cast her aside with a disgusted look: 'This one has the mortal stink upon her. We have no use for that which dies.' Humiliated, enraged, Medusa fled to the temple of her mother and cast herself before the goddess, crying, 'You denied me eternal life--therefore I beg you, give me power! Power, so I can dedicate what life I have to rescuing my sisters and avenging this injustice!' After long thought, the goddess granted her daughter's request, allowing Medusa to trade her legendary beauty for a face and form of terrifying strength. Never for a moment has Medusa regretted her choice. She understands that power is the only beauty worth possessing--for only power can change the world.","talentsTips":["The evasion talent stacks multiplicatively with other sources of evasion.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The mana talent increases maximum mana capacity, and keeps the current mana percentage."],"trivia":["While the lore of Medusa is heavily inspired by its ancient Greek counterpart it should be noted that in the early versions of the myth, Medusa was born hideous to primordial sea deities Phorcys and Ceto who are described as cthonic monsters from an archaic world.","The mythology that describes Medusa as having incomprehensible beauty was introduced later by the Roman poet Ovid and in that version Medusa did not exchange her beauty for power. Rather after being attacked by Poseidon in the temple of Athena the enraged goddess twisted Medusa's beautiful visage to the point that merely looking at her would turn the onlookers to stone.","Medusa's response upon killing Gyrocopter \"Snakes on a plane\", refers to the movie of the same name."],"talents":["Split Shot Uses Modifiers:+1000 Mana","+2.5s Stone Gaze Duration:-4s Mystic Snake Cooldown","+25% Mystic Snake Mana Steal:+30 Attack Speed","15% Evasion:+15 Damage"],"desc":"Medusa the Gorgon is a ranged agility hero. Highly item-dependent, she acts as a carry who can potentially strike down entire teams at once while protected by tank-like survivability. Split Shot allows her attacks to hit multiple targets, greatly increasing the potency of damage-granting items. Mystic Snake grants Medusa some presence in the lane and skirmishes, and its mana stealing refunds part of the cost to boot, making it an excellent farming and harassing tool. Mana Shield protects her from the opening damage of teamfights, and if supplemented with items makes killing Medusa a fatally time-consuming process. Stone Gaze acts as a fantastic defensive mechanism against ganks and initiations alike, with crippling effects on all who dare face the Gorgon."}