{"abilities":[{"spell":"Герой магически расщепляет свои стрелы, атакуя несколько целей, но нанося при этом меньше урона. На дополнительные цели не действуют эффекты атаки (такие как критический урон) или уникальные модификаторы атаки.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Позволяет Medusa совершать мгновенные атаки по определенному количеству врагов, когда она запускает снаряд атаки. Это значит, что все снаряды выпускаются вместе одновременно с основной атакой. При этом не важно, промахнулась ли первоначальная атака или нет, дополнительные стрелы все равно будут выпущены.","На цель первоначальной атаки не действует Split Shot. Цель поражается только первоначальной атакой, которая наносит полный урон.","Дополнительные стрелы летят с той же скоростью, что и первоначальная стрела.","Радиус срабатывания основан на дальности атаки героя и дополнительной дальности стрел, в итоге радиус срабатывания равен 700 единиц, учитывая стандартную дальность атаки Medusa.","На мгновенные атаки от Split Shot не срабатывают модификаторы атаки или эффекты, срабатывающие при атаке, если только не был выбран талант, позволяющий модификаторам срабатывать. При этом они продолжают считаться за обычные атаки. Урон, наносимый Split Shot, не считается за урон заклинаний. На стрелы также влияет тип брони, и они блокируются с помощью блокировки урона как и обычные атаки. Если Medusa ослеплена, Split Shots могут промахнутся, кроме того случая, если у стрел есть эффект точности. Стрелы также могут промахнутся из-за уклонения.","Не считает целями варды, строения, невидимых существ или существ в тумане войны, но считает целью курьеров. При этом при атаке вардов или строений продолжает выпускать дополнительные стрелы для поражения подходящих целей в радиусе атаки. Дополнительные стрелы не выпускаются при атаке союзников."],"mana":"0","elements":["Может использоваться иллюзиями.","Можно избежать.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Split Shot","description":["Доп. дальность расщепленных стрел: 100","Дополнительные цели: 3","Урон от расщепленных стрел: 30%\/45%\/60%\/75%"],"hot_key":"Q","legacy_key":"T"},{"spell":"Выпускает энергетическую змею, которая прыгает от цели к цели, нанося урон и воруя ману. Достигнув последней цели, она вернётся к своей владелице, принеся ей всю украденную ману. С каждым прыжком змея наносит больше урона и ворует 11%\/14%\/17%\/20% от общего запаса маны жертвы.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Змея движется со скоростью 800.","Способность сначала крадет ману, а затем наносит урон ( и применяет дебафф Stone Gaze).","Змея всегда отскакивает по ближайшей подходящей цели около её текущей цели. Не может ударить по одной и той же цели более 1 раза за применение.","При возвращении к Medusa, герой получает ровно столько маны, сколько Mystic Snake украла у всех целей.","Mystic Snake не ворует ману у иллюзий.","Mystic Snake нужно поразить существ с общим запасом маны в 1273\/1072\/942\/851 ( 389\/385\/381\/378) единиц, чтобы полностью восполнить стоимость заклинания.","Каждое успешное попадание по врагу усиливает урон от следующего отскока на 35% от базового урона способности. То есть урон не растет в геометрической прогрессии, он статичен; при каждом следующем отскоке наносится на 28\/42\/56\/70 единиц больше урона.","Здесь указано, сколько урона нанесет Mystic Snake () и сколько будет длится окаменение) за отскок, когда все отскоки успешно попадают (до учета сопротивления): Уровень 1: 80\/108\/136 урона, 324 урона в общем (1\/1.3\/1.6 секунд окаменения) Уровень 2: 120\/162\/204\/246 урона, 732 урона в общем (1\/1.3\/1.6\/1.9 секунд окаменения) Уровень 3: 160\/216\/272\/328\/384 урона, 1360 урона в общем (1\/1.3\/1.6\/1.9\/2.2 секунд окаменения) Уровень 4: 200\/270\/340\/410\/480\/550 урона, 2250 урона в общем (1\/1.3\/1.6\/1.9\/2.2\/2.5 секунд окаменения)","Змея может отскочить на существ в тумане войны, но не на невидимых, неуязвимых или спрятанных юнитов.","Если текущая цель змеи умрет или станет неуязвимой, спрятанной или невидимой, то отскок не зачтется и не увеличит урон. В этом случае змея продолжит отскакивать по ближайшим подходящим целям.","Змея дает летающий обзор в радиусе 100 единиц в момент полета.","Улучшение от Aghanim's Scepter требует изученного Stone Gaze. Способность использует тот же модификатор, что и Stone Gaze, поэтому их эффекты не складываются. Дебафф способности также использует иконку Stone Gaze. Талант на увеличение длительности оглушения от Stone Gaze не влияет на длительность оглушения от Mystic Snake."],"mana":"140\/150\/160\/170","elements":["Нельзя избежать.","Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"11 ( 7)","name":"Mystic Snake","description":["Анимация применения: 0,4+0,57","Дальность применения: 700","Радиус скачков: 475","Количество скачков: 3\/4\/5\/6","Базовый урон: 80\/120\/160\/200","Усиление урона за скачок: 35%","Максимальная кража маны: 11%\/14%\/17%\/20% ( 36%\/39%\/42%\/45%)","Начальная длительность окаменения: 0 ( 1)","Увеличение длительности за скачок: 0 ( 0.3)"],"hot_key":"W","legacy_key":"C"},{"spell":"Создает щит, который поглощает 60% получаемого урона, используя ману Medusa.","effects":["Способность Переключаемая","Действует на Себя"],"notes":["При использовании Mana Shield не прерывает произносимые способности Medusa.","Поглощает урон до любого снижения урона, включая блокировку урона или сопротивление магии (к примеру, Aphotic Shield). Это также влияет на всё, что работает непосредственно с уроном, наносимым после сопротивлений (к примеру, Orchid Malevolence).","При включении усиливает эффективное здоровье Medusa на 150%, учитывая то, что у героя достаточно маны.","Mana Shield остается после смерти Medusa. Если щит был активирован в момент смерти, она возродится с ним."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Не может использоваться иллюзиями.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Mana Shield","description":["Анимация применения: 0+0","Поглощение урона: 60%","Урона на единицу маны: 1.6\/1.9\/2.2\/2.5"],"hot_key":"E","legacy_key":"E"},{"spell":"Снижает скорость передвижения и атаки любого врага, который посмотрит на владельца способности. Если жертва будет смотреть на него более 2 секунд, то она превратится в камень. Окаменевшие существа оглушаются и получают дополнительный физический урон.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Каждый вражеский юнит, обращенный лицом в сторону Medusa в пределах 85 градусов в радиусе 1000 единиц вокруг Medusa получит дебаффы: один отслеживает, сколько юнит смотрел в сторону Medusa, другой - дает замедление.","Дебафф, отслеживающий положение юнита, считает, сколько времени юнит смотрел на Medusa. Если в сумме получается 2 секунды, то он заставляет юнита окаменеть. Дебафф длится столько же, сколько и Stone Gaze(то есть он заканчивается в момент завершения ультимейта) или до конца окаменения. Двухсекундный счетчик не сбрасывается, если юнит отвернулся. Смотрение на Medusa в неуязвимом или спрятанном состоянии продолжает учитываться счетчиком. То есть окаменение можно избежать, становясь неуязвимым в момент попытки применения способностью окаменения.","Замедляющий дебафф замедляет только затронутых юнитов, которые смотрят на Medusa. Юниты, которые развернуты от Medusa, не замедляются, но сохраняют дебафф. Замедляющий дебафф длится столько же, сколько и Stone Gaze (то есть он заканчивается в момент завершения ультимейта) или до конца окаменения.","Только при истечении дебаффа, дающего окаменение, юнит сможет опять быть затронутым Stone Gaze, повторяя до тех пор, пока не закончится Stone Gaze все время, пока юнит смотрит на Medusa.","Окаменение - это базовое оглушение, которое еще замораживает анимации существ и усиливая урон от физических атак. Не усиливает атаки с магическим или чистым уроном и урон заклинаний с физическим уроном.","Stone Gaze не работает на нейтральных крипов.","Stone Gaze завершается при смерти Medusa, но уже окаменевшие враги остаются в таком состоянии всю длительность."],"mana":"200","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"90","name":"Stone Gaze","description":["Анимация применения: 0,4+0,5","Радиус: 1000","Замедление скорости передвижения: 35%","Замедление скорости атаки: 35","Замедление скорости поворота: 35%","Доп. физический урон: 50%","Длительность способности: 5\/6\/7 ( 7,5\/8,5\/9,5)","Длительность окаменения: 3"],"hot_key":"R","legacy_key":"G"}],"bio":"«Красота — страшная сила». Этой мыслью утешала себя самая юная и прелестная горгона с раннего детства, ибо ей единственной из трёх прекрасных дочерей морской богини не довелось родиться бессмертной. Всё изменилось в тот роковой день, когда неизвестные в масках ворвались в обитель горгон и похитили её сестер, бесстрастные к их красоте и слезам. Схвативший Медузу тут же отбросил её с отвращением: «От неё разит, как от смертной! Такие нам ни к чему». Медуза, сгорая от унижения и ярости, поспешила в храм матери, пала пред богиней и взмолилась: «Раз не удостоена я бессмертия, прошу, дай мне силу — дабы я вызволила своих сестёр и посвятила остаток жизни мщению за эту несправедливость». Долго размышляла богиня, и, наконец, даровала Медузе прошенное. Взамен на свою воспеваемую красоту Медуза получила устрашающий лик и ещё более ужасающую мощь. Ни на мгновение не пожалела она о своем выборе, ведь знала: единственная красота, которой стоит обладать, — это сила, ибо лишь сила изменит мир.","talentsTips":["Талант на уклонение мультипликативно сочетается с другими источниками уклонения.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны."],"trivia":["В ранней версии мифа, Медузу при рождении отвергли морские божества Форкий и Кето,которые являлись хтоническими монтрами из архаичного мира.","Миф,в котором Медуза описывалась как идеал красоты был создан позже Римским поэтом Овидием,и в этой версии она не жертвовала своей красотой ради безграничной силы.Вместо этого после нападения Посейдона в храме Афины богиня в ярости изуродовала облик Медузы до такой степени, что каждый, кто посмотрит в ее лицо, немедленно превратится в камень.","Реплика в сторону убитого Gyrocopter \"Snakes on a plane\" является отсылкой к фильму \"Змеиный полёт\"."],"talents":["Эффекты атаки действуют на все цели Split Shot:+1000 к мане","+2,5 сек. длительности Stone Gaze:-4 сек. перезарядки Mystic Snake","+25% к краже маны у Mystic Snake:+30 к скорости атаки","+15% к уклонению:+15 к урону"],"desc":"Medusa — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Первая способность, Split Shot, разделяет выстрел Medusa на несколько стрел. Эти стрелы наносят меньше урона по сравнению с ее базовой атакой. На дополнительные цели не воздействуют эффекты атаки (такие как критический урон) или уникальные модификаторы атаки. Второй способностью, Mystic Snake, Medusa бросает змею, которая прыгает от цели к цели нанося урон и воруя ману. После того как она достигнет последней цели, она вернется назад к Medusa, восполняя запас маны. Змея наносит больше урона и ворует больше маны с каждым прыжком. Третья способность, Mana Shield, создает щит, который поглощает получаемый урона, используя ману Medusa. Ультимативная способность, Stone Gaze, замедляет скорость атаки и передвижения любого вражеского юнита, который посмотрит на Medusa. Если враг будет смотреть на Medusa более 2 секунд, пока Stone Gaze включен, он превратится в камень. Окаменелые существа оглушются и получают дополнительный физический урон. При покупке Aghanim's Scepter Stone Gaze будет применяться ко всем юнитам, задетых Mystic Snake."}