{"abilities":[{"effects":["Дальность применения: 575","Урон: 50","Длительность: 2.5"],"notes":["Двойной щелчок по предмету применит его на владельца.","Применяет к цели эффект урагана, делая её неуязвимой и полностью обезвреживая.","При использовании применяет к цели базовое развеивание.","Cyclone сначала применяет неуязвимость, а потом развеивание.","Может выбрать только врагов, владельца или клонов Meepo и Tempest Double. Не может выбрать других союзников, варды или строения.","Когда юнит в воздухе, остальные юниты могут под ним проходить.","Урон наносится по окончанию действия. Если ураган развеяли, то он все равно нанесет урон при приземлении цели.","Урон наносится только вражеским целям.","Можно применить на Рошана, но без какого-либо эффекта, поскольку у Рошана иммунитет к принудительному движению. При этом урон все равно нанесётся."],"elements":["Способность Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"description":"Поднимает выбранную цель в воздух, делая её неуязвимой на 2.5 сек. Можно использовать только на себя или противника. Если применить на врага, то по приземлении он получит 50 магического урона."}],"cost":"2750","description":"Мистический скипетр, прошедший сквозь века, позволяет призывать на помощь силу ветра, которая может быть использована как с добрыми, так и плохими намерениями.","further":["Staff_of_Wizardry","Wind_Lace","Void_Stone","Рецепт"],"attrs":["Активируемая Cyclone","Бонус +10 к интеллекту +5 к регенерации маны +20 к скорости передвижения","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 120 маны, 5,5 регенерации маны и 0,7% урона от способностей.","Для героев ловкости, даёт 120 маны, 5,5 регенерации маны и 0,7% урона от способностей.","Для героев интеллекта, даёт 120 маны, 5,5 регенерации маны, 0,7% урона от способностей и 10 урона от атаки.","Скорость передвижения суммируется с бонусами от других Eul's Scepter of Divinity.","Складывается с другими источниками доп. скорости передвижения."]}