{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/97\/Sentry_Ward_Plant.mp3\/revision\/latest?cb=20191227195528",
      "effects": [
        "Cast Range: 500",
        "Hero Attacks to Destroy: 2",
        "Non-Hero Attacks to Destroy: 8",
        "Duration: 420"
      ],
      "notes": [
        "Provides 150 radius flying vision at its location for 12 seconds.",
        "Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit. Cannot be placed on impassable terrain, or spots obscured by trees.",
        "Cannot be placed on impassable terrain, or spots obscured by trees.",
        "Item is unshareable (Ctrl) with Couriers or with the Spirit Bear.",
        "Neutral creep spawn ranges are shown before placing a ward, allowing camps to be blocked.",
        "The radius of already placed Sentry Wards is shown as well, allowing its caster to see how they overlap.",
        "Treat illusions and creep-heroes as creeps."
      ],
      "mana": "0",
      "abilityName": "Plant",
      "cooldown": "1",
      "description": "Plants a Sentry Ward, an invisible watcher that grants True Sight, the ability to see invisible enemy units and wards, to any existing allied vision within a radius. Lasts 7 minutes. Does not grant ground vision. Hold Control to give one Sentry Ward to an allied hero.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Radius: 900",
        "Aura Linger Duration: 0.5"
      ],
      "notes": [
        "Grants True Sight within its radius by an aura which affects enemies, it is not obstructed by anything. The debuff lingers for 0.5 seconds. As True Sight implies, it doesn't affect enemies with True Sight Immunity.",
        "The debuff lingers for 0.5 seconds.",
        "As True Sight implies, it doesn't affect enemies with True Sight Immunity.",
        "Alt shows all allied Sentry Wards' True Sight radius with a green ring."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Adds the ability to see invisible units and wards to any allied vision within the Sentry Ward's range.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Attacking Accuracy: 100%",
        "Melee Attack Range Bonus: 150",
        "Ally Deny Health Threshold: 50"
      ],
      "notes": [
        "The ability and modifier are not displayed in-game.",
        "Attacks against the affected target have absolute accuracy, which prevents its attacks from being missed (i.e. evasion or blind effects). Geminate Attack does not work against Observer Wards.",
        "Geminate Attack does not work against Observer Wards.",
        "Melee units have an extra 150 attack range when attacking Observer Wards.",
        "Sentry Wards can always be attacked by their owner, and can only be attacked by other ally heroes if they are within the spawn areas of neutral creeps, regardless of the ward's current health. Sentry Wards receive 10 damage from ally heroes when it has over 50 health.",
        "Sentry Wards receive 10 damage from ally heroes when it has over 50 health."
      ],
      "mana": null,
      "abilityName": "Planted Ward",
      "cooldown": null,
      "description": "This unit is permanently invisible and phased.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks with itself and with Observer Wards in the inventory, there is no stack limit. The sell value adapts based on the number of instances in a stack. Wards from multiple players are combined when given by allies.",
    "Wards from multiple players are combined when given by allies.",
    "Killing a Sentry Ward prints out a chat notification to allies."
  ],
  "cost": "50",
  "lore": [
    "Knowing how to craft a ward is an important skill for artificers of magical goods. Rylai showed great talent at crafting wards, and once considered becoming an artificer.",
    "Despite this, the flavor text for this item refers to Sentry Wards as plants and states that they were \"originally grown in  garden.\" This implies that they are grown as opposed to crafted, directly contradicting the White Sentry's description."
  ],
  "consistFrom": null,
  "name": "Sentry Ward",
  "description": "A form of plant originally grown in the garden of a fearful king.",
  "trivia": null,
  "upgradeIn": [
    "Observer and Sentry Wards"
  ],
  "tips": [
    "The Sentry Ward is recommended when facing heroes who mostly relies on invisibility (Or using invisibility as an escape mechanism), especially Riki, Bounty Hunter and Weaver. It is great to be placed near towers, so it can help heroes gank over them.",
    "It is great to be placed near towers, so it can help heroes gank over them.",
    "Sentry Wards' detection radius is quite large, making them useful for keeping an eye out on invisible heroes in key areas, given one has vision over that area.",
    "Sentry Wards are commonly used to de-ward enemy wards, as they are able to detect their wards. When dewarding, the ward is best placed so that its true sight reaches multiple common ward spots, so that it is more likely to spot enemy wards. If an enemy ward location is known, the sentry ward is best placed so that the enemy won't find it when they try to deward the sentry wards, like between some trees, but still so that their ward is within true sight range.",
    "When dewarding, the ward is best placed so that its true sight reaches multiple common ward spots, so that it is more likely to spot enemy wards.",
    "If an enemy ward location is known, the sentry ward is best placed so that the enemy won't find it when they try to deward the sentry wards, like between some trees, but still so that their ward is within true sight range.",
    "Similar to Observer Wards, Sentry Wards can also be used to block neutral creep camps."
  ]
}