{"abilities":[{"spell":"Blasts the target enemy unit with damaging frost, dealing area damage and slowing movement and attack rates for 4 seconds. The primary target takes the most damage.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The targeting reticule must be centered over an enemy unit.","The area damage is dealt before the primary damage.","The primary target takes the primary damage and the area damage, resulting in 125\/200\/275\/350 damage (before reductions).","Frost Blast first applies the damage, then the debuff."],"mana":"105\/130\/155\/180","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"7 ( 3)","name":"Frost Blast","description":["Cast Animation: 0.4+0.93","Cast Range: 600 ( 750)","Effect Radius: 200","Primary Damage: 50\/100\/150\/200","Area Damage: 75\/100\/125\/150","Move Speed Slow: 30%","Attack Speed Slow: 30","Slow Duration: 4"],"hot_key":"Q","legacy_key":"V"},{"spell":"Applies a magical frost shield around you, reducing damage from attacks against you. While the shield is active, ice magic will be affect nearby enemy units every 1 seconds, doing minor damage and slowing.","effects":["Ability Target Unit","Affects Allies \/ Enemies"],"notes":["Can be cast on any allied unit, including buildings, and invulnerable ones, but excluding wards.","The buffed ally gains resistance against attack damage. It does not gain physical damage resistance. This means it reduces incoming attack damage of any damage type, but does not affect physical spell damage.","Despite the description, the damage pulses hit every enemy within the area, not only the closest enemy.","Pulses in 1-second interval, starting 1 second after cast, resulting in 6 pulses.","All pulses together deal up to 120\/180\/240\/300 per enemy (before reductions).","The pulses first apply their damage, then the slow debuff.","Recasting Frost Shield on the same target does not stack, but refreshes the duration, and resets the pulse interval.","The level 25 talent adds health regeneration to Frost Shield. The regen works for targeted buildings as well. Can regenerate up to 360 ( 480) health over its full duration."],"mana":"100\/110\/120\/130","elements":["Partially pierces spell immunity."],"cooldown":"30\/25\/20\/15","name":"Frost Shield","description":["Cast Animation: 0.2+0.93","Cast Range: 1000 ( 1150)","Pulses Radius: 600","Attack Damage Resistance: 30%\/40%\/50%\/60%","Health Regeneration Bonus: 0 ( 60)","Pulse Interval: 1","Pulse Damage: 20\/30\/40\/50","Pulse Movement Speed Slow: 20%\/25%\/30%\/35%","Pulse Slow Duration: 0.5","Shield Duration: 6 ( 8)"],"hot_key":"W","legacy_key":"F"},{"spell":"Hypnotizes an enemy unit, causing it to move towards a point between the two of you.","effects":["Ability Target Unit \/ Channeled","Affects Enemies"],"notes":["Hypnotizes the target, forcing it to move towards the Lich, and preventing it from acting.","Sets the target's movement speed to 32%\/38%\/44%\/50% of the distance between Lich and the target. When cast at max cast range, this results in a speed of 100\/105\/110\/115 ( 130\/135\/140\/145).","The speed is set once upon cast. If the target gets moved or teleported, the speed does not adapt.","Provides True Sight over the target for the full duration. Does not provide any other form of vision.","The targeted unit will move directly towards Lich regardless of impassable terrain."],"mana":"120\/130\/140\/150","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"30","name":"Sinister Gaze","description":["Cast Animation: 0+0","Cast Range: 500\/525\/550\/575 ( 650\/675\/700\/725)","Distance Moved: 32%\/38%\/44%\/50%","Duration: 1.6\/1.9\/2.2\/2.5"],"hot_key":"E","legacy_key":"R"},{"spell":"Releases an orb of frost that bounces between nearby enemy units up to 10 times, slowing and damaging each time it hits.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Chain Frost travels at a speed of 850.","The projectile bounces with a 0.2 second delay.","Can bounce on the same unit multiple times, but only when another target was hit between the bounces.","Cannot bounce on Undying Zombies and units which are out of vision (e.g. invisible), invulnerable or hidden.","Can bounce on, but cannot damage or slow Roshan. Only the initial hit can damage and slow him.","Chain Frost first applies the debuff, then the damage.","Can deal up to 1500\/2250\/3000 ( infinite) damage to a single unit (before reductions), since it can hit one unit up to 6 times.","All bounces together can deal up to 2750\/4125\/5500 ( infinite) damage (before reductions).","The projectile has 800 range flying vision. The vision is not provided during the 0.2 second bounce delay.","Chain Frost stops providing vision and stops playing a sound upon hitting non-hero units when bouncing more than 60 times."],"mana":"200\/325\/500","elements":["Cannot be disjointed.","Partially blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"100\/80\/60","name":"Chain Frost","description":["Cast Animation: 0.3+1.03","Cast Range: 750 ( 900) ( 850, 1000)","Bounce Distance: 600","Number of Bounces: 10 ( Infinite)","Bounce Delay: 0.2","Damage: 250\/375\/500 ( 400\/500\/600)","Move Speed Slow: 65%","Attack Speed Slow: 65","Slow Duration: 2.5"],"hot_key":"R","legacy_key":"C"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies"],"notes":["The ability is unlocked by choosing the left level 25 talent.","The debuff from successive attacks does not stack, only the duration gets refreshed.","The attacks first apply their damage, then the debuff.","Fully stacks with other slows, including all of Lich's abilities.","Works against wards, but not against buildings.","Changes the visual appearance of Lich's attack projectiles (same effect as Eye of Skadi). Uses default attack projectiles against enemies which cannot be affected. Desolator's red projectiles take priority."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Freezing Slow","description":["Movement Speed Slow: 50%","Attack Speed Slow: 50","Duration: 3"]}],"bio":"In life, the frost-mage Ethreain (not yet a Lich) had used the threat of destructive ice to enslave entire kingdoms. His subjects, aided by a few desperate magicians, eventually grew bold enough to ambush him. Armed with enough charmed rope to bind him forever, they tied the frost mage to adamant weights and dropped him in a pool known chiefly for being bottomless. It wasn't. He only fell for a year or so before an outcrop snagged him. There he rested, dead but undecaying, until the geomancer Anhil thought to verify the legend of the supposedly bottomless Black Pool. Anhil's plumbline snarled with the ropes that bound the drowned magician, and up he hauled an unexpected prize. Thinking that by rendering the dead undead, he could question the Lich about the properties of the pool, he removed the bindings and commenced a simple rite of resurrection. Even the descendants of Ethreain's enemies were long forgotten by time, so there were none to warn Anhil against imprudence. But he learned the error of his judgment almost immediately, as Lich threw off the shackles and consumed him.","talentsTips":["The cast range talent does not affect the jump distance of Chain Frost.","The health talent increases maximum health capacity, and keeps the current health percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Lich's voice actor, Gary Schwartz, also voiced the Heavy and Demoman classes in Team Fortress 2, another title by Valve. Lich's line upon casting Sacrifice, Om nom nom! refers to a line spoken by the Heavy which he uses upon consuming the Sandvich Edible Device.","In the first iteration of Invoker's abilities, when the order of his three orbs determined the spell that was invoked, Frost Nova was one of his abilities and functioned almost identically to the current spell, and was mapped to Quas Quas Exort. Crystal Maiden also had the same Frost Nova ability with small differences in numbers.","Lich is almost entirely based on a Warcraft 3 hero. His title (Lich), DotA name (Kel'Thuzad) and all his spells except the ultimate are same as the original Warcraft 3 hero, although entirely rebalanced around Dota. In his transition to Dota 2, he kept his title (Lich), but his name got changed due to copyright reasons, since Kel'Thuzad is a notable character from the Warcraft universe. Lich's response \"Dead man drifting.\" is a reference to the line \"Dead man walking.\" spoken by the Warcraft 3 hero.","Anatomically, Lich's cranium has no visible sutures, another proof of his age.","Lich's response :Play \"Frost bitten, twice shy\" is a referense to Great White albums: Once Bitten... and ...Twice Shy","Lich's response \"And so the dead will bury the dead\" is a reference from Bible (Luke 9:59-60), where Jesus said, “Let the dead bury the dead,” in response to a disciple who wanted to bury his father before committing himself to the Lord."],"talents":["Attacks Apply 50% MS and AS Slow:Frost Shield Provides +60 HP Regen","+2s Frost Shield Duration:+150 Cast Range","-4s Frost Blast Cooldown:+120 Damage","+20 Movement Speed:+200 Health"],"desc":"Ethreain, the Lich, is a ranged intelligence hero that uses his abilities to slow his enemies down with his ice-based attacks, as well as giving a boost to ally defenses, and serves as a great teamfight ganker with his powerful ultimate. His Frost Shield bolsters his team's defenses with a damage-absorbing shield while releasing slowing pulses of ice to either deter enemies or catch up to them in a chase. Lone enemies he can disable and pull closer to himself with his Sinister Gaze, potentially pulling the target to their own demise. But his foes will find no safety in strength in numbers, as Lich's ultimate, Chain Frost deals massive damage to enemy heroes who dare stick together. While a relatively frail hero and mostly known as a support, Lich is a powerful crowd controller and can easily turn any teamfight or dominate in a lane."}