{"abilities":[{"spell":"Создаёт вокруг указанного врага ледяной взрыв, который наносит урон и замедляет всех противников в области действия на 4 секунды. Основная цель получает наибольший урон.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Перекрестие указателя должно выделять вражеского юнита.","Урон по области наносится до урона по цели.","Первоначальная цель получает урон по цели и урон по области, получая в общем 125\/200\/275\/350 единиц урона (до учета сопротивления)."],"mana":"105\/130\/155\/180","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"7 ( 3)","name":"Frost Blast","description":["Анимация применения: 0,4+0,93","Дальность применения: 600 ( 750)","Радиус: 200","Урон по первоначальной цели: 50\/100\/150\/200","Урон по области: 75\/100\/125\/150","Замедление скорости передвижения: 30%","Замедление скорости атаки: 30","Длительность замедления: 4"],"hot_key":"Q","legacy_key":"V"},{"spell":"Накладывает на цель магический ледяной щит, уменьшая урон от нескольких атак по ней. Пока щит действует, он каждые 1 сек. наносит немного магического урона ближайшему вражескому существу и замедляет его.","effects":["Способность Направленная на юнита","Действует на Союзников \/ Врагов"],"notes":["Можно применить на любого союзного юнита, включая строения и неуязвимых юнитов, но исключая варды.","Юниты под баффом получают сопротивление к урону от атак. Способность не дает сопротивление к физическому урону. То есть щит снижает получаемый урон от атаки любого типа урона, но не взаимодействует с физическим уроном заклинаний.","Вопреки описанию импульсы урона поражают всех врагов в области, а не только ближайшего.","Срабатывает с интервалом в 1 секунды спустя Frost Shield после применения, испуская 6 импульсов.","Все импульсы могут нанести до 120\/180\/240\/300 урона врагу (до учета снижений).","Импульс сначала наносит урон, затем применяет дебафф замедления.","Повторное применение на ту же цель не складывается, но обновляет длительность и сбрасывает интервал импульсов.","При выборе таланта способность восстанавливает здоровье в виде регенерации, восстанавливая 6 здоровья с интервалом в 0,1 секунды. Регенерирует до 360 здоровья. Регенерация также действует на строения."],"mana":"100\/110\/120\/130","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"30\/25\/20\/15","name":"Frost Shield","description":["Анимация применения: 0,2+0,93","Дальность применения: 1000 ( 1150)","Радиус: 600","Уменьшение урона от атак: 30%\/40%\/50%\/60%","Доп. регенерация здоровья: 0 ( 60)","Интервал: 1","Урон: 20\/30\/40\/50","Замедление скорости передвижения: 35%","Длительность замедления: 0.5","Длительность щита: 6"],"hot_key":"W","legacy_key":"F"},{"spell":"Гипнотизирует вражеское существо, отчего оно идёт к определённой точке между вами двумя.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов"],"notes":["Гипнотизирует цель, заставляя двигаться к Lich и запрещая действия.","Приравнивает скорость передвижения цели к 32%\/38%\/44%\/50% от расстояния между ней и Lich. При использовании на максимальной дистанции применения скорость передвижения равна 100\/105\/115.24\/119.79 ( 130\/135\/146.67\/151.04).","Скорость устанавливается при применении. Если цель передвинули или телепортировали, то скорость не адаптируется.","Дает эффект True Sight на цель всю длительность способности. Не дает никакого вида обзора."],"mana":"120\/130\/140\/150","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"30","name":"Sinister Gaze","description":["Анимация применения: 0+0","Дальность применения: 500\/525\/550\/575 ( 650\/675\/700\/725)","Дальность передвижения: 32%\/38%\/44%\/50%","Длительность: 1.6\/1.9\/2.1\/2.4"],"hot_key":"E","legacy_key":"R"},{"spell":"Создаёт ледяной шар, который отскакивает от противников до 10 раз, замедляя их и нанося им урон.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Скорость полета Chain Frost - 850 единиц.","Снаряд отскакивает с задержкой в 0,2 секунды.","Может отскочить от одного и того же юнита несколько раз, но только в случае, если между отскоками была поражена другая цель.","Не может отскакивать от Undying Zombie и юнитов, находящихся вне зоны обзора (т.е. невидимых, неуязвимых или исчезнувших).","Может отскакивать, но не наносит урон или замедление Рошану. Только начальное попадение по нему может нанести урон и замедлить.","Может нанести до 1800\/2400\/3000 ( неограниченный урон) единиц урона в одного юнита (до учета сопротивления), учитывая то, что способность может поразить одного юнита до 6 раз.","Все отскоки вместе могут нанести до 3300\/4400\/5500 ( неограниченный урон) единиц урона (до учета сопротивления).","Снаряд дает летающий обзор в радиусе 800 единиц. Обзор не распространяется в момент задержки отскока в 0,2 секунды.","Chain Frost перестает давать обзор и проигрывать звук при попадании по юнитам не-героям при отпрыгивании между ними более 60 раз."],"mana":"200\/325\/500","elements":["Нельзя избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"100\/80\/60","name":"Chain Frost","description":["Анимация применения: 0,3+0,93","Дальность применения: 750 ( 900) ( 850, 1000)","Радиус прыжков: 600","Количество прыжков: 10 ( Бесконечно)","Задержка отскока: 0,2","Урон: 300\/400\/500 ( 400\/500\/600)","Замедление скорости передвижения: 65%","Замедление скорости атаки: 65","Длительность замедления: 2,5"],"hot_key":"R","legacy_key":"C"},{"spell":"Атаки применяют замедление скорости передвижения и скорости атаки.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Способность разблокируется при выборе левого таланта 25-го уровня.","Дебафф от успешных атак не складывается, но обновляется длительность.","Полностью сочетается с другими замедлениями, включая все способности Lich.","Работает против вардов, но не строений.","Изменяет визуальное отображение снаряда атаки Lich (как у Eye of Skadi). Использует разные снаряды атаки против врагов которые не могут попасть под влияние. Красные снаряды от Desolator имеют приоритет."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Замедление морозом","description":["Замедление скорости передвижения: 40%","Замедление скорости атаки: 40","Длительность: 3"]}],"bio":"При жизни Этриан (еще не Lich) был могущественным колдуном — его легендарные заклинания обращали в лед города и могли погрести под снежными бурями целые королевства. А у кого есть сила, у того есть и завистники. Несколько магов тщательно проработали покушение на Этриана и, ко всеобщему удивлению, дилетанты достигли успеха, поймав колдуна врасплох, обезоружив его и заковав в волшебные цепи. Этриана доставили к бездонному озеру и торжественно сбросили в темные воды, выбраться из которых было невозможно. Этриан опускался глубже и глубже в течение года, пока, наконец, не зацепился за скалистый выступ в стене бездонного колодца. Там он и остался висеть, мертвый, но не разлагающийся. Спустя многие годы некромант Анхил решил проверить, действительно ли бездонно это озера и отправился в экспедицию. Отвес, который Анхил опускал в воду, нашел связанного Этриана. Анхил, обрадовавшись неведомой добыче, поспешил извлечь труп из воды. К сожалению, слишком много времени прошло с момента погребения Этриана и не нашлось никого, кто предупредил бы Анхила об опасности. Наивный волшебник расковал Этриана и провел ритуал воскрешения. Некромант понял, что просчитался, только в тот момент, когда Lich открыл глаза и щелчком пальца разорвал волшебника на куски.","talentsTips":["Талант на дальность применения не влияет на дальность отскоков Chain Frost.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Голос Lich принадлежит Гэри Шварцу, также озвучившего классы \"Пулеметчик\" и \"Подрывник\" в Team Fortress 2, другой игры от Valve.","Реплики Lich Играть Om numb numb! и Играть I'll put this soul to use! ссылаются к репликам Пулеметчика из игры Team Fortress 2: первая реплика ссылается на реплику \"OM NOM NOM\", когда Пулеметчик использует Бутерброд; вторая реплика ссылается на произношение к реплике \"Put dispenser here\" (постройте здесь раздатчик). Благодаря акценту Пулеметчика, эту фразу можно расслышать как \"Pootis penser here\". Выражение Pootis стало популярным среди американских игроков, и часто игроки стали применять этой фразу в игре.","Переходя на Dota 2, 3 способности Lich были переименованы. Frost Blast назывался Frost Nova, Ice Armor назывался Frost Armor и Sacrifice назывался Dark Ritual.","Первоначальное имя Lich было Кел'Тузед, что является отсылкой к герою из вселенной Warcraft.","Один из героев, чьи способности полностью перешли из оригинальной Warcraft III. 3 первые способности полностью идентичны, а ульт в Warcraft III - \"Порча\", наносился массовый урон в выбранной площади (юнитам и зданиям), однако во время применения, сам Lich должен стоять неподвижно. В DotA данная способность была заменена.","Фраза Lich Играть \"Frost bitten, twice shy\" является отсылкой к альбомам группы Great White: Once Bitten... и ...Twice Shy"],"talents":["Атаки замедляют цель на 40% и её скорость атаки на 40 единиц:Frost Shield дает +60 к регенерации здоровья","+2 сек. к длительности Frost Shield:+150 к дальности способностей","-4 сек. к перезарядке Frost Blast:+120 к урону","+20 к скорости передвижения:+200 к здоровью"],"tips":["Имея Aghanim's Scepter, шар, созданный Chain Frost, будет бесконечно отскакивать по целям, пока имеются цели для отскока в радиусе 575. Как только у последней цели не окажется другой цели, действие способности прекратится. Поэтому, стоит учитывать местоположение противников и как близко они находятся к друг другу. Данная способность отлично будет сочетаться с героями, чьи способности позволяют удержать несколько противников или стянуть их в одну точку, тем самым позволив шару от этой способности задеть всех противников. Например, такими героями могут быть Faceless Void, Dark Seer, Magnus, Enigma и т.п."],"desc":"Lich — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Frost Blast, вызывает вокруг указанного врага ледяной взрыв, который наносит урон и замедляет всех врагов в области. Первичная цель получает наибольший урон. Вторая способность, Ice Armor, создает щит вокруг дружественного юнита или здания, который увеличивает броню и замедляет атакующих его воинов. Третья способность, Sacrifice, приносит в жертву дружественного крипа и получает ману пропорционально текущему здоровью убитого. Опыт за крипа получают только союзники. Ультимативная способность, Chain Frost, бросает ледяной шар в противника, который отскакивает от противников до 10 раз, замедляя их и нанося им урон. Первая цель кратковременно оглушается. Улучшение с Aghanim's Scepter увеличивает урон и расстояние применения заклинания, а также снимает ограничение на количество отскоков."}