{"abilities":[{"spell":"Создаёт вокруг указанного врага ледяной взрыв, который наносит урон и замедляет всех противников в области действия на 4 секунды. Основная цель получает наибольший урон.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Перекрестие указателя должно выделять вражеское существо.","Урон по области наносится до урона по цели.","Основная цель получает урон по цели и урон по области, получая в общем 125\/200\/275\/350 единиц урона (до уменьшений).","Frost Blast сначала наносит урон, затем применяет дебафф."],"mana":"105\/130\/155\/180","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"7 ( 3)","name":"Frost Blast","description":["Анимация применения: 0,4+0,93","Дальность применения: 600 ( 800)","Радиус: 200","Урон по основной цели: 50\/100\/150\/200","Урон по области: 75\/100\/125\/150","Замедление скорости передвижения: 30%","Замедление скорости атаки: 30","Длительность замедления: 4"],"hot_key":"Q","legacy_key":"V"},{"spell":"Накладывает на цель магический ледяной щит, уменьшая урон от нескольких атак по ней. Пока щит действует, он каждые 1 сек. наносит немного магического урона ближайшему вражескому существу и замедляет его.","effects":["Способность Направленная на юнита","Действует на Союзников \/ Врагов"],"notes":["Можно применить на любое союзное существо, включая строения и неуязвимых юнитов, но исключая варды.","Существа под баффом получают сопротивление к урону от атак. Способность не дает сопротивление к физическому урону. То есть щит снижает получаемый урон от атаки любого типа урона, но не взаимодействует с физическим уроном заклинаний.","Вопреки описанию импульсы урона поражают всех врагов в области, а не только ближайшего.","Срабатывает с интервалом в 1 секунды спустя Frost Shield после применения, испуская 6 ( 9) импульсов.","Все импульсы могут нанести до 120\/180\/240\/300 ( 180\/270\/360\/450) урона врагу (до уменьшений).","Импульс сначала наносит урон, затем применяет дебафф замедления.","Повторное применение на ту же цель не складывается, но обновляет длительность и сбрасывает интервал импульсов.","При выборе таланта 25-го уровня добавляет регенерацию здоровья к Frost Shield. Восстановление также действует на строения. Восстанавливает до 360 ( 540) здоровья за всю длительность."],"mana":"100\/110\/120\/130","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"30\/25\/20\/15","name":"Frost Shield","description":["Анимация применения: 0,2+0,93","Дальность применения: 1000 ( 1200)","Радиус: 600","Уменьшение урона от атак: 30%\/40%\/50%\/60%","Доп. регенерация здоровья: 0 ( 60)","Интервал: 1","Урон: 20\/30\/40\/50","Замедление скорости передвижения: 20%\/25%\/30%\/35%","Длительность замедления: 0.5","Длительность щита: 6 ( 9)"],"hot_key":"W","legacy_key":"F"},{"spell":"Гипнотизирует вражеское существо, отчего оно идёт к определённой точке в направлении владельца способности и отдаёт ему долю от текущей маны.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов"],"notes":["Гипнотизирует цель, заставляя двигаться к Lich и запрещая действия.","Приравнивает скорость передвижения цели к 32%\/38%\/44%\/50% от расстояния между ней и Lich. При использовании на максимальной дальности применения скорость передвижения равна 100\/105\/110\/115 ( 140\/145\/150\/155).","Скорость устанавливается при применении. Если цель передвинули или телепортировали, то скорость не адаптируется.","Вытягивает 0,625%\/0,789%\/0,909%\/1% от текущей маны с интервалом в 0,1 секунды сразу после начала произнесения, срабатывая 17\/20\/23\/26 раз. Может вытянуть до 10,11%\/14,66%\/18,95%\/23% от текущей маны цели, если больше ничего с маной не происходило.","Не дает никакого вида обзора. При этом уход в невидимость или туман войны не отменяет Sinister Gaze.","Дает цели возможность перемещаться по непроходимой территории, поэтому она может двигаться через возвышенности, деревья и других существ.","Aghanim's Scepter превращает Sinister Gaze в заклинание, направленное на область, поэтому существ больше нельзя выбрать напрямую. Не захватывает невидимых существ или существ в тумане войны."],"mana":"120\/130\/140\/150","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"24\/22\/20\/18","name":"Sinister Gaze","description":["Анимация применения: 0+0","Дальность применения: 500\/525\/550\/575 ( 700\/725\/750\/775)","Радиус: 0 ( 400)","Дальность передвижения: 32%\/38%\/44%\/50%","Кража текущей маны: 10%\/15%\/20%\/25%","Длительность: 1.6\/1.9\/2.2\/2.5"],"hot_key":"E","legacy_key":"R"},{"spell":"Создаёт ледяной шар, который отскакивает от противников до 10раз, замедляя их и нанося им урон, увеличивающийся с каждым скачком.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Скорость полета Chain Frost - 850.","Снаряд отскакивает с задержкой в 0,2 секунды.","Может отскочить от одного и того же существа несколько раз, но только в случае, если между отскоками была поражена другая цель.","Не может отскакивать от Undying Zombie и существами, находящихся вне зоны обзора (т.е. невидимых, неуязвимых или исчезнувших).","Может отскакивать, но не наносит урон или замедление Рошану. Только начальное попадение по нему может нанести урон и замедлить.","Chain Frost сначала применяет дебафф, затем наносит урон.","Ниже указано, сколько урона наносит каждый отскок на каждом уровне (до уменьшений). Уровень 1: 250 \/ 265 \/ 280 \/ 295 \/ 310 \/ 325 \/ 340 \/ 355 \/ 370 \/ 385 \/ 400 Уровень 2: 400 \/ 420 \/ 440 \/ 460 \/ 480 \/ 500 \/ 520 \/ 540 \/ 560 \/ 580 \/ 600 Уровень 3: 550 \/ 575 \/ 600 \/ 625 \/ 650 \/ 675 \/ 700 \/ 725 \/ 750 \/ 775 \/ 800","Снаряд дает летающий обзор в радиусе 800 единиц. Обзор не распространяется в момент задержки отскока в 0,2 секунды.","Chain Frost перестает давать обзор и проигрывать звук при попадании по существам не-героям при отпрыгивании между ними более 60 раз."],"mana":"200\/325\/500","elements":["Нельзя избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"100\/80\/60","name":"Chain Frost","description":["Анимация применения: 0,3+0,93","Дальность применения: 750 ( 950)","Радиус отскока: 600","Количество отскоков: 10 ( Бесконечно)","Задержка отскока: 0,2","Начальный урон: 250\/400\/550","Увеличение урона за отскок: 15\/20\/25","Замедление скорости передвижения: 65%","Замедление скорости атаки: 65","Длительность замедления: 2,5"],"hot_key":"R","legacy_key":"C"}],"bio":"Маг льда Этриан, тогда ещё живой, порабощал целые королевства, угрожая им разрушительной мощью льда. Однажды его подданные, заручившись помощью нескольких отчаявшихся магов, нашли в себе смелость устроить на него покушение. Они намертво связали колдуна зачарованными цепями, прикрепили к ним адамантовые гири и сбросили его в озеро, которое считали бездонным. Они ошибались. Целый год Этриан опускался глубже и глубже, пока не зацепился за скалистый выступ. Там он и остался висеть, мёртвый, но не разлагающийся. Спустя многие годы геомант Анхил решил проверить, действительно ли бездонно легендарное Чёрное озеро. Отвес, что Анхил опускал в воду, зацепил связанного Этриана, и геомант вытащил из озера нежданную добычу. Думая, что у воскрешённого мертвяка можно будет выведать что-нибудь об озере, Анхил снял с трупа оковы и провёл простой ритуал возрождения. Даже потомки врагов Этриана остались в веках, поэтому никто не мог предупредить Анхила о неблагоразумии такого поступка. Впрочем, он осознал свою ошибку в мгновение ока, когда воскрешённый маг отбросил цепи и поглотил его.","talentsTips":["Талант на дальность применения не влияет на дальность отскоков Chain Frost.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Голос Lich принадлежит Гэри Шварцу, также озвучившего классы \"Пулеметчик\" и \"Подрывник\" в Team Fortress 2, другой игры от Valve.","Реплики Lich Om numb numb! и I'll put this soul to use! ссылаются к репликам Пулеметчика из игры Team Fortress 2: первая реплика ссылается на реплику \"OM NOM NOM\", когда Пулеметчик использует Бутерброд; вторая реплика ссылается на произношение к реплике \"Put dispenser here\" (постройте здесь раздатчик). Благодаря акценту Пулеметчика, эту фразу можно расслышать как \"Pootis penser here\". Выражение Pootis стало популярным среди американских игроков, и часто игроки стали применять этой фразу в игре.","Переходя на Dota 2, 3 способности Lich были переименованы. Frost Blast назывался Frost Nova, Ice Armor назывался Frost Armor и Sacrifice назывался Dark Ritual.","Первоначальное имя Lich было Кел'Тузед, что является отсылкой к герою из вселенной Warcraft.","Один из героев, чьи способности полностью перешли из оригинальной Warcraft III. 3 первые способности полностью идентичны, а ульт в Warcraft III - \"Порча\", наносился массовый урон в выбранной площади (существам и зданиям), однако во время применения, сам Lich должен стоять неподвижно. В DotA данная способность была заменена.","Фраза Lich \"Frost bitten, twice shy\" является отсылкой к альбомам группы Great White: Once Bitten... и ...Twice Shy"],"talents":["Атаки замедляют цель на 60% и её скорость атаки на 60 единиц:Frost Shield дает +60 к регенерации здоровья","+3 сек. к длительности Frost Shield:+200 к дальности способностей","-4 сек. к перезарядке Frost Blast:+120 к урону","+20 к скорости передвижения:+200 к здоровью"],"desc":"Lich — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Frost Blast, вызывает вокруг указанного врага ледяной взрыв, который наносит урон и замедляет всех врагов в области. Первичная цель получает наибольший урон. Вторая способность, Ice Armor, создает щит вокруг дружественного юнита или здания, который увеличивает броню и замедляет атакующих его воинов. Третья способность, Sinister Gaze, заставляет вражеского героя двигаться к Lich в течении короткого промежутка времени. Ультимативная способность, Chain Frost, бросает ледяной шар в противника, который отскакивает от противников до 10 раз, замедляя их и нанося им урон. Первая цель кратковременно оглушается. Улучшение с Aghanim's Scepter увеличивает урон и расстояние применения заклинания, а также снимает ограничение на количество отскоков."}