{
  "abilities": [
    {
      "notes": [
        "Spectral Dagger летит со скоростью 800 единиц",
        "Может напрямую выбирать героев и крипов-героев\n При выборе героя кинжал будет следовать за целью, пока её не достигнет",
        "При выборе точки на земле или крипа-героя кинжал летит по прямой на расстояние 1800 единиц\n Он не следует за крипом-героем",
        "Каждое вражеское существо, попавшее в радиус 125 от летящего кинжала, получает урон",
        "Поражает вражеских героев и иллюзии, также накладывая дебафф «Dagger Path Creator», создающий за ними след из тени как и обычный кинжал\n Этот дебафф также дает общий обзор на вражеских героев, подсвечивая их силуэт, пока они невидимы",
        "Spectre и враги при нахождении на следе получают модификатор «След от Spectral Dagger», увеличивая её и снижая их скорость передвижения\n Модификатор задерживается на 4 сек\n после ухода с тени\n Модификатор обновляется только от изначального источника\n То есть Spectre не замедлится от Spectral Dagger, примененной врагом, при наличии модификатора баффа",
        "Также Spectre получает скрытый бафф, позволяющий ей перемещаться по непроходимой территории\n Бафф задерживается на 1 сек\n после ухода со следа",
        "Части теневого следа длятся 12 сек., начиная с момента, когда они были созданы, а не когда была использована способность",
        "След дает летающий обзор в радиусе 200 единиц вокруг себя"
      ],
      "item_behaviour": [],
      "description": "Герой бросает кинжал, наносящий урон и оставляющий теневой след, который замедляет всех врагов. Враги, поражённые кинжалом, также будут оставлять за собой след. Двигаясь по нему, владелец способности преодолевает любые препятствия.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,37",
        "Дальность применения: 1800",
        "Радиус: 125",
        "Урон: 75\/130\/185\/240 ( 175\/230\/285\/340)",
        "Замедление\/доп\n скорость передвижения: 10%\/14%\/18%\/22% ( 22%\/26%\/30%\/34%)",
        "Длительность следа: 12",
        "Длительность источника следа: 7",
        "Задержка замедления\/ускорения скорости передвижения: 4",
        "Задержка беспрепятственного движения: 1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Spectre_Spectral_Dagger_1.mp3\/revision\/latest?cb=20191216024330",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "22\/20\/18\/16 (TagTalent 18\/16\/14\/12)",
      "aghanim": null,
      "name": "Spectral Dagger",
      "cooldown": "130\/140\/150\/160",
      "legacy_key": "D",
      "story": "Кинжал Меркуриал затмевает физическую плоскость тенью — структурой, которая пугает смертных, но благоволит призракам."
    },
    {
      "notes": [
        "Эффекты Desolate применяются после завершения атаки независимо от её попадания\n То есть Desolate применяется, даже если изначальная атака промахнулась\n При использовании героями дальнего боя эффект применяется при запуске снаряда, а не при его попадании",
        "Дополнительный урон наносится отдельным источником урона и считается за урон от заклинаний\n То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки\n Также на него действует усиление урона заклинаний и вампиризм заклинаний",
        "Действует на любых вражеских существ, исключая варды и постройки",
        "Desolate игнорирует наличие рядом вардов, строений, неуязвимых или спрятанных существ\n То есть Desolate продолжит наносить урон, пока рядом с целью находятся только вышеперечисленные союзные существа",
        "Проверяет наличие только союзных для цели существ, поэтому ближайшие нейтральные крипы не предотвращают нанесение урона существам вражеской команды и наоборот"
      ],
      "item_behaviour": [],
      "description": "Каждая атака наносит дополнительный урон, если в радиусе 425 от жертвы нет её союзников.",
      "hot_key": "W",
      "params": [
        "Радиус: 425",
        "Доп\n урон: 15\/30\/45\/60 ( 27\/42\/57\/72)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Spectre_Desolate.mp3\/revision\/latest?cb=20210103161358",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Desolate",
      "cooldown": null,
      "legacy_key": "L",
      "story": "Часто воины оказываются наедине с образом Меркуриал. Но настоящий ли он — вот вопрос, что предрешит их судьбу."
    },
    {
      "notes": [
        "Дает Spectre снижение получаемого урона, увеличивая её выживаемость против любого урона на 9%\/14%\/19%\/25% ( 15%\/20%\/27%\/33%)",
        "Отраженный урон наносится всем целям в радиусе, а не только источнику",
        "Отражённый урон имеет тот же тип, что и нанесённый",
        "Dispersion отражает урон до любого вида манипуляции уроном\n При этом манипуляция уроном на враге всё еще влияет на урон",
        "На отраженный физический урон действует блокировка урона",
        "Урон от Dispersion отмечен как отнимающий здоровье, поэтому он не активирует любые эффекты, реагирующие на урон",
        "Всегда отражает процент от полного значения урона, при этом не важно, достаточно ли осталось здоровья у Spectre до его получения\n То есть способность отражает излишний урон, убивший Spectre, поэтому, если источник урона превышает текущее здоровье Spectre и убивает её, то отраженный урон расчитывается от полного значения",
        "Dispersion отражает урон до нанесения его Spectre, поэтому, если Spectre и её противник одновременно умирают от урона, то враг всегда умирает первым",
        "Отраженный урон не распределяется между противниками\n Каждое существо получает полный урон",
        "Отражает все 8%\/12%\/16%\/20% урона в радиусе 400 от Spectre\n Этот урон линейно уменьшается до достижения расстояния в 800 от владельца",
        "Здесь указано, сколько урона Dispersion нанесет врагам на определенном расстоянии: 400 единиц: 8%\/12%\/16%\/20% ( 13%\/17%\/21%\/25%) от нанесенного урона\n 500 единиц: 6%\/9%\/12%\/15% ( 9,75%\/12,75%\/15,75%\/18,75%) от нанесенного урона\n 600 единиц: 4%\/6%\/8%\/10% ( 6,5%\/8,5%\/10,5%\/12,5%) от нанесенного урона\n 700 единиц: 2%\/3%\/4%\/5% ( 3,25%\/4,25%\/5,25%\/6,25%) от нанесенного урона.",
        "С <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Dispersion пассивно использует кинжал Spectral Dagger на атаковавшего Spectre врага\n Dispersion с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard срабатывает, когда враг наносит Spectre урон переполняющий порог впитанного урона, равный 300 единиц, пассивной способностью Dispersion \n Враг, последним нанёсший урон, впитанный пассивной способностью Dispersion до необходимого порога, становится целью кинжала\n Кинжал применяется не на врага (т.е\n не преследует его), а на место, где враг был в момент нанесения герою Spectre урона\n Урон, впитанный Dispersion, нужный для срабатывания кинжала Spectral Dagger учитывается и суммируется, даже когда способность Dispersion находится на перезарядке\n В случае, если впитанный урон достиг порога во время перезарядки способности Dispersion, то после перезарядки, способность сработает на врага, первым нанесшего любое количество урона герою Spectre и находящегося в радиусе 700 от него\n Целью пассивного кинжала Spectral Dagger может быть только подконтрольное игрокам вражеское существо, находящееся в радиусе 700 от Spectre\n Учитывает урон от союзников, строений, вардов, неуязвимых, спрятанных или мертвых существ\n Пассивный кинжал Spectral Dagger, вызванный с помощью Dispersion с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, может также сработать от урона союзников, вардов, неуязвимых, спрятанных или мертвых существ, и, следовательно, броситься на них, проходя насквозь и не нанося урон"
      ],
      "item_behaviour": [],
      "description": "Урон, нанесённый владельцу способности, отражается на его врагов, не нанося ему повреждений. Эффект ослабевает с расстоянием.",
      "hot_key": "E",
      "params": [
        "Минимальный радиус: 400",
        "Максимальный радиус: 800",
        "Отражаемый урон: 8%\/12%\/16%\/20% ( 13%\/17%\/21%\/25%)",
        "Порог впитанного урона:  300",
        "Радиус:  700"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя \/ Врагов",
        "Урон: Отнимающий здоровье"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Dispersion",
      "cooldown": null,
      "legacy_key": "I",
      "story": "Сложная задача стоит перед противниками Меркуриал — убить тень мечом и магией."
    },
    {
      "notes": [
        "Требует <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter для разблокировки\n В режиме Ability Draft может быть разблокирована при выборе игроком  Haunt",
        "Значения Shadow Step равны значениям Haunt",
        "Мгновенно применяет  Spectral Dagger текущего уровня к цели без использования снаряда",
        "На Shadow Step действуют те же примечания, что и для иллюзии от Haunt",
        "Нельзя применять на крипов-героев"
      ],
      "item_behaviour": [],
      "description": "Позволяет призвать спектральную копию от способности Haunt к одному выбранному герою.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: Глобальная",
        "Урон иллюзии: 40%\/60%\/80% ( 72%\/92%\/112%)",
        "Урон по иллюзии: 200%",
        "Длительность Haunt: 5\/6\/7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1a\/Spectre_Shadow_Step_1.mp3\/revision\/latest?cb=20210103160705",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев"
      ],
      "mana": "40",
      "aghanim": null,
      "name": "Shadow Step",
      "cooldown": "180",
      "legacy_key": "E",
      "story": "Иногда, сосредоточив всю свою волю, Меркуриал может контролировать своё расщепление."
    },
    {
      "notes": [
        "Reality разблокируется при изучении  Haunt и всегда остается активной",
        "Использование не позволяет избегать снаряды",
        "При выборе точки на земле Spectre меняется местами с ближайшей от выбранной точки иллюзией от Haunt",
        "По иллюзиям можно перемещаться, пока действует способность или пока все иллюзии не умрут",
        "После обмена иллюзия все равно движется к цели и атакует ее"
      ],
      "item_behaviour": [],
      "description": "Герой меняется местами с выбранной иллюзией от способности Haunt.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0,7",
        "Дальность применения: Глобальная"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Spectre_Reality.mp3\/revision\/latest?cb=20191216024328",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Reality",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Разрозненные тени соединяются в одну настоящую Spectre."
    },
    {
      "notes": [
        "Иллюзии от Haunt выделяемы, но они неподконтрольны герою",
        "Иллюзии могут перемещаться по непроходимой территории",
        "Иллюзии появляются в 58 единицах в случайной точке от целей",
        "Иллюзии преследуют невидимых противников, но не атакуют\n Также они появляются и следуют за неуязвимыми и спрятанными существами",
        "Иллюзии появляются возле  клонов Meepo, но не перед другими клонами или иллюзиями",
        "Иллюзии исчезают, если их цель умирает"
      ],
      "item_behaviour": [],
      "description": "Создаёт рядом с каждым вражеским героем спектральную копию, которая атакует его. Во время действия можно применить способность Reality, чтобы поменяться местами с выбранной иллюзией. Иллюзии не находятся под контролем игрока, игнорируют препятствия, получают больше урона и наносят меньше урона, чем сам герой.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Радиус: Глобальный",
        "Урон иллюзии: 40%\/60%\/80% ( 72%\/92%\/112%)",
        "Урон по иллюзии: 200%",
        "Длительность Haunt: 5\/6\/7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Spectre_Haunt_1.mp3\/revision\/latest?cb=20191216024324",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Вражеских героев"
      ],
      "mana": "180\/160\/140",
      "aghanim": null,
      "name": "Haunt",
      "cooldown": "150\/200\/250",
      "legacy_key": "T",
      "story": "В разгар сражения Меркуриал расщепляет свою физическую сущность, и отголоски ее теней преследуют тех, кто всё еще цепляется за жизнь."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "+5% к отражающему урону у Dispersion +32% к урону иллюзий от Haunt +12% к замедлению и ускорению от Spectral Dagger +350 к здоровью +100 урона от Spectral Dagger +12 к урону от Desolate +5 ко всем атрибутам −4 сек. перезарядки Spectral Dagger",
  "history": "Равно как самая непостижимая энергия всегда стремится к состоянию покоя, так и Меркуриал, воплощающую неудержимые и жестокие силы, непреодолимо притягивает к сценам раздора, что возникают в материальном мире. Её обычное спектральное состояние превосходит пределы восприятия, и каждый раз, обретая физическую форму, она теряет воспоминания о себе... но не о своей цели. В пылу схватки её личность разбивается и преображается, и вновь начинается процесс самоосознания. Она быстро вспоминает, что имя ей — Меркуриал, а заполонившие поле боя призраки — не более чем тени её самой, единственной и настоящей. В борьбе за выживание приходит концентрация, истинный разум вновь заявляет о себе, и Меркуриал превосходит материю, вновь и вновь возрождаясь в своей вечной форме вплоть до последних моментов победы или поражения."
}