{"abilities":[{"spell":"Ценой собственного здоровья выпускает смертельный туман, который наносит урон врагу или лечит союзника.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический \/ Чистый"],"notes":["Снаряд летит со скоростью 1300.","Наносит чистый урон по себе и магический по врагам. Это значит, что урон по себе блокируется с помощью Aphotic Shield, превращается в лечение под действием Borrowed Time, и подвергается усилению урона заклинаний. Другие источники, манипулирующие уроном (например, Soul Catcher и Overcharge) также влияют на эту способность.","Урон по себе наносится сразу в момент использования способности.","Abaddon может совершить самоубийство с помощью этой способности.","Если союзник станет неуязвимым или исчезнет до того, как до него долетит снаряд, он все равно получит лечение.","Выбор таланта, увеличивающего урон\/лечение, мгновенно улучшит все летящие снаряды Mist Coil Abaddon.","Выбор таланта 25-го уровня способность запускает снаряды в случайные видимые подходящие цели в радиусе 375. При применении Abaddon выпускает снаряды к каждому союзнику и врагу в радиусе, за исключением самого заклинателя. Эти снаряды считаются за обычное применение, поэтому их также можно избежать. Также способность выбирает невидимых юнитов и юнитов в тумане войны. При этом невидимые цели мгновенно избегают снарядов. Урон, наносимый себе, не зависит от количества целей."],"mana":"50","elements":["Можно избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"4.5 ( 3.6)","name":"Mist Coil","description":["Анимация применения: 0,25+0,67","Дальность применения: 800","Радиус: 0 ( 375)","Урон по себе: 75\/100\/125\/150 ( 150\/175\/200\/225)","Урон: 100\/150\/200\/250 ( 175\/225\/275\/325)","Лечение: 100\/150\/200\/250 ( 175\/225\/275\/325)"],"hot_key":"Q","legacy_key":"D"},{"spell":"Окружает союзника щитом из тёмной энергии, который поглощает некоторое количество урона. Если щит пропадёт или его уничтожат, он взорвётся и нанесёт врагам вокруг урон, равный здоровью щита. Применение снимает с цели оглушение и большинство отрицательных эффектов.","effects":["Способность Направленная на юнита","Действует на Союзников \/ Врагов","Урон Магический"],"notes":["Применяет сильное развеивание на цель при использовании.","Способность полностью отрицает урон (после всех сопротивлений), предотвращая срабатывание некоторых эффектов урона.","Aphotic Shield имеет второй низший приоритет среди способностей, отрицающих урон. Это значит, что в сочетании с, например, Borrowed Time или Refraction, щит не поглощает урона, пока другие эффекты не пропадут. Имеет больший приоритет чем Living Armor, таким образом, в сочетании с этой способностью Aphotic Shield блокирует урон, в то время как Living Armor нет. Тем не менее, Living Armor теряет по заряду каждый раз, когда наносится урон.","Щит всегда взрывается и наносит урон по области при потере баффа \"Aphotic Shield\", даже если не поглотил максимально возможный урон.","Урон по области не связан с количеством поглощенного урона. Щит всегда наносит 110\/140\/170\/200 ( 335\/365\/395\/425) единиц урона.","Несколько применений на одного юнита не сладываются. При повторной активации предыдущий щит уничтожается (нанося урон по области) и накладывается новый.","Выбор таланта на дополнительное здоровье и урон не влияет на уже примененные щиты Abaddon.","Не наносит урона невидимым юнитам и юнитам в тумане войны."],"mana":"115","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"12\/10\/8\/6 ( 9.6\/8\/6.4\/4.8)","name":"Aphotic Shield","description":["Анимация применения: 0,4+0,57","Дальность применения: 500","Радиус взрыва: 675","Поглощение урона: 110\/140\/170\/200 ( 335\/365\/395\/425)","Урон по области: 110\/140\/170\/200 ( 335\/365\/395\/425)","Длительность: 15"],"hot_key":"W","legacy_key":"T"},{"spell":"Атаки героя замедляют передвижение жертвы. Если атаковать врага 4 раза, на него сработает замораживающее проклятие: оно накладывает безмолвие и замедление, а все атакующие этого врага существа получают дополнительную скорость атаки.","effects":["Способность Пассивная","Действует на Союзников \/ Врагов"],"notes":["Каждая успешная атака по вражескому юниту не под действием дебаффа проклятья накладывает начальный дебафф или увеличивает его счётчик.","Длительность начального дебаффа обновляется с каждым ударом. То есть все 4 удара не нужно совершать за 4 секунды.","Когда счётчик начального дебаффа достигает 4, то дебафф исчезает и заменяется на дебафф проклятья.","Любой союзный герой, атакующий проклятого юнита, получает дебафф ускорения. Бафф дается при успешном попадании атаки по цели. То есть, промахнувшиеся атаки баффа не дают. Для героев дальнего боя это означает, что бафф они получат только при попадании снаряда. Бафф действует только при атаке проклятых целей. При смене цели бафф исчезает.","Бафф дается только союзным героям, иллюзиям и клонам. Юниты не-герои баффа не получают. Считает крипов-героев за крипов.","Замедляющий дебафф можно наложить на строения, но не на варды или союзных юнитов."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Curse of Avernus","description":["Ударов нужно: 4","Базовое замедление скорости передвижения: 10%\/15%\/20%\/25%","Замедление скорости передвижения: 30%\/40%\/50%\/60%","Доп. скорость атаки: 40\/60\/80\/100","Базовая длительность: 4","Длительность проклятья и баффа ускорения: 4"],"hot_key":"E","legacy_key":"F"},{"spell":"Обращает весь получаемый урон в лечение. Применение снимает большинство отрицательных эффектов. Если способность готова, то она сработает автоматически, как только здоровье владельца упадёт ниже 400.","effects":["Способность Ненаправленная ( Аура)","Действует на Себя ( Союзных героев)"],"notes":["При использовании прерывает произносимые способности Abaddon. Не прерывает при пассивном срабатывании.","Применяет сильное развеивание на Abaddon при использовании или пассивной активации.","Способность можно применить, даже когда герой находится в оглушении, урагане, сне, провокации, исчезновении или принудительном движении.","Нельзя применить, но может активироваться пассивно, когда герой обезмолвлен, проклят или не может получать приказы. Также способность нельзя поставить в очередь действий.","Активируется автоматически, когда полученный урон (без отметки \"отнимающий здоровье\") опускает уровень здоровья Abaddon ниже 400 или наносится, когда он уже ниже 400. Урон наносится до активации Borrowed Time, то есть, если наносимый урон превышает текущее здоровье Abaddon, то герой умрет, не активировав способность. Это также означает, что способность не спасает Abaddon от моментально убивающих эффектов, таких как Culling Blade и Ice Blast.","Borrowed Time полностью отрицает урон (после всех сопротивлений), предотвращая срабатывание некоторых эффектов урона.","Borrowed Time превращает урон в лечение после учета всех сопротивлений.","Borrowed Time имеет наивысший приоритет среди способностей, отрицающих урон. Таким образом, в сочетании с другими подобными способностями (например, Aphotic Shield или False Promise), Borrowed Time поглощает урон, в то время как другие - нет. В случае с False Promise, Borrowed Time сначала превращает урон в лечение, которое только после этого регистрируется способностью False Promise как лечение, а не урон.","Как и другие эффекты, манипулирующие уроном, Borrowed Time отрицает и превращает в лечение только 3 типа урона, но не урон с отметкой \"отнимающий здоровье\". Единственные исключения: Heartstopper Aura и False Promise, урон от которых превращается в лечение. Тем не менее, Borrowed Time не активируется пассивно от урона этих способностей.","Перенаправление урона от Aghanim's Scepter основано на ауре, несмотря на это, эффекты способности не задерживаются и не появляются в интерфейсе. Уменьшение урона для союзников сочетается мультипликативно с другими источниками уменьшения урона. Уменьшение урона не уменьшает урон для юнитов, находящихся под эффектами отрицания урона. Использованный Blade Mail будет наносить урон атаковавшему Abaddon герою."],"mana":"0","elements":["Не может использоваться иллюзиями.","Частично отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60\/50\/40 ( 48\/40\/32)","name":"Borrowed Time","description":["Анимация применения: 0+0","Радиус: 0 ( 900)","Порог здоровья: 400","Перенаправление урона: 0 ( 50%)","Длительность задержки ауры: 0","Длительность: 4\/5\/6 ( 5\/6\/7)"],"hot_key":"R","legacy_key":"B"}],"bio":"Род Аверно питает купель — разлом в земной тверди, который испускает загадочную энергию на протяжении поколений. Каждого новорожденного семьи окунают в этот темный туман, даруя тем самым связь с их землей и ее загадочной силой. Дети растут с непреклонной верой в защиту семейных ценностей и традиций земли, но на самом деле они охраняют саму купель, истинные намерения которой неизвестны. Когда новорожденный Abaddon проходил обряд крещения, что-то пошло не так. В глазах малыша сверкнула искра разума, испугавшая всех присутствовавших и заставившая жрецов шептаться. Его растили, дабы он пошел по пути всех отпрысков рода: война и защита родины во главе армии. Но сам Abaddon уделял этому не так много внимания. Пока другие тренировались в обращении с оружием, он медитировал у купели. Он глубоко вдыхал темный туман, учась быть единым с той силой, что протекала глубоко под землей его дома. В конечном счете он стал порождением черного тумана. Род Аверно неодобрительно отнесся к такому решению, обвиняя его в пренебрежении обязанностями. Но все эти обвинения прекратились, когда Abaddon вступил в свою первую битву и показал ту обретенную власть над жизнью и смертью, о которой другие члены рода не могли и мечтать.","talentsTips":["Талант на броню не дается иллюзиям.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки."],"trivia":["В Библии, Abaddon — имя ангела, который поднимается из бездны и командует армией саранчи. Его имя означает «разрушитель» на иврите.","Также Abaddon - полководец Хаоса во вселенной Warhammer 40000.","Имя \"Lord of Avernus\" является отсылкой на известный кратер в Италии, который считается входом в подземный мир.","В оригинальной DotA, третья способность героя называлась \"Frostmourne\", название которой отсылалась на название меча из сюжета вселенной Warcraft. Во время перехода в Dota 2 название способности изменилась на Curse of Avernus. Также, первая способность под названием Death Coil была переименована в Mist Coil."],"talents":["Mist Coil применяется в радиусе 375:+225 к здоровью Aphotic Shield","+90 к урону:-20% перезарядки способностей","+75 к урону\/лечению Mist Coil:+8 к броне","+25% к получаемому опыту:+25 к скорости передвижения"],"tips":["Играя как саппорт будет разумно прокачивать Mist Coil и Aphotic Shield и не тратить уровень на Curse of Avernus, потому что эти способности намного полезнее на ранней стадии игры и позволят вам эффективно лечить, защищать и даже не отдать себя врагам (заденаиться) в крайнем случае.","Учтите, что Aphotic Shield может снять оглушение и замедление. Используйте это во всех опасных для союзников ситуациях.","Abaddon очень крепкий герой, особенно благодаря своему ультимейту Borrowed Time, однако не стоит переоценивать эту способность и помните, что лучше вовремя отступить, чем зря отдаться.","Использование Aphotic Shield на цель с эффектом этой способности вызовет взрыв без ожидания. Учитывая большой радиус действия способности вы можете увеличить урон наносимый противникам в командных боях.","На ранней стадии игры вы можете использовать Aphotic Shield на крипов которые скоро погибнут заставляя противников желающих добить их получать урон. Используя предметы регенерирующие ману вы можете бить своих противников на линии совсем не получая урона. Даже если ваши противники поняли вашу тактику и отступают - вы можете самостоятельно добивать своего крипа для взрывания щита.","Благодаря своему ультимейту Borrowed Time Abaddon один из немногих героев, которые могут спокойно заходить под вышки. Также полезно будет использовать Mask of Madness, так-как дополнительный урон от ее активации будем вам только на пользу во время действия Borrowed Time.","Опытные противники обратят внимание на включение вашего ультимейта и перестанут атаковать вас, пока его действие не истечет. Не забывайте, что время действия ультимейта относительно короткое.","Ваш ультимейт отлично контрит Rupture, потому что вы можете использовать это состояние для того, чтобы излечиться, несмотря на то, что оно длиться дольше чем ваш ультимейт. Просто контролируйте момент, когда вам пора вручную включить ультимейт и начать лечение на ходу. Так же вы можете купить Blade Mail и активировав его под Rupture просто убить незадачливого противника побежав с места.","Помните, что Culling Blade героя Axe убьет Abaddon даже при включенном Borrowed Time. Поэтому не стоит лезть с ним драться при малом количестве здоровья.","Если вы планируете играть как керри, вам стоит качать Curse of Avernus, что даст вам дополнительный урон и контроль над противником, а так же поддержит всех ваших союзников. В таком случае будет разумно качать Aphotic Shield прежде Mist Coil , потому что вы будете гоняться за противником под его вышкой и в крипах и должны иметь возможность быстро использовать новый щит.","Важно, что Curse of Avernus срабатывает на любой цели, включая союзных крипов. Это может быть использовано для приобретения дополнительной скорости перед вступлением в бой.","Также помните, что эффект от Curse of Avernus складывается с орб эффектами. Это значит, что вы можете позволить себе купить Orb of Venom и Eye of Skadi и в результате получить замедление противника на 22% для Orb of Venom на первом уровне Curse of Avernus и до 75% при покупке Eye of Skadi с 4 уровнем Curse of Avernus. Играя за керри это позволит вам легко догонять противников. Также полезными артефактами будут Sange и Yasha дающий вам здоровье и скорость, а также дополнительно могут покалечить противника.","Против менее опытных противников можно инициировать командный бой принимая на себя все способности и ультимейты. Это может позволить вашим союзникам вступать в бой. Однако более опытные противники не попадутся на эту уловку.","Если необходимо снять негативные эффекты с союзника с помощью Aphotic Shield, можно купить Blink Dagger для компенсации малой дальности применения. Blink Dagger будет работать при получении урона под действием Borrowed Time, и вы сможете спастись от врагов."],"desc":"Abaddon — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Mist Coil, Abaddon выпускает смертельный туман, который наносит урон врагу или лечит союзника. Вторая способность, Aphotic Shield, окружает союзника темной энергией, создавая щит, который поглощает некоторое количество урона перед тем как взорваться и нанести урон ближайшим врагам. Сбрасывает некоторые негативные эффекты и оглушение при применении. Пассивная способность, Curse of Avernus, накладывает замораживающее проклятье на атакуемую цель. У всех, кто атакует замедленного врага, на некоторое время повышается скорость атаки и передвижения. Ультимативная способность, Borrowed Time, при активации позволяет Abaddon обратить любой получаемый им урон в лечение. Снимает большинство негативных эффектов. Если способность готова к применению, она будет активирована пассивно, как только здоровье Abaddon упадет ниже 400. Улучшение с Aghanim's Scepter увеличивает длительность ультимативной способности и позволяет Abaddon поглощать 50% урона, получаемого союзными героями в радиусе 900, во время ее действия."}