{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Blade_Mail_Damage_Return_1.mp3\/revision\/latest?cb=20191227195353",
      "effects": [
        "Возвращает урона: 85%",
        "Длительность: 5,5"
      ],
      "notes": [
        "При применении не прерывает произносимые заклинания владельца.",
        "При применении, Blade Mail отражает 105% получаемого урона от атаки, плюс прямое значение. Также, при этом, Blade Mail реагирует на другие нанесения урона помимо урона от атаки, возвращая 85% от полученного урона. Возвращает 3 типа урона, но не собственный нанесённый урон и эффекты отнимающие здоровье (например, Sunder, Soul Ring и т.п.).",
        "Также, при этом, Blade Mail реагирует на другие нанесения урона помимо урона от атаки, возвращая 85% от полученного урона.",
        "Возвращает 3 типа урона, но не собственный нанесённый урон и эффекты отнимающие здоровье (например, Sunder, Soul Ring и т.п.).",
        "Возвращает тот же тип урона, что был получен."
      ],
      "mana": "25",
      "abilityName": "Damage Return",
      "cooldown": "25",
      "description": "Увеличивает возвращение урона от всех источников на 85%. Длится 5,5 сек.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Базовое возвращение урона: 20",
        "Полученного урона в возвращённый урон: 20%"
      ],
      "notes": [
        "Реагирует только на урон от атаки. Другие источники урона игнорируются.",
        "Возвращает получаемый урон до учета любых манипуляций. При этом манипуляция уроном над врагом действует как обычно.",
        "На отраженный физический урон также действует блокировка урона.",
        "Возвращённый урон всегда наносится сразу после входящего.",
        "Возвращённый урон имеет метку «не отражаемый», что не даёт ему взаимодействовать с другими источниками урона с такой же меткой.",
        "Возвращённый урон имеет пометку «без вампиризма заклинаниями», что не позволяет лечиться от него с помощью вампиризма заклинаниями.",
        "Возвращённый урон имеет пометку «не усиливающееся заклинание», что не позволяет его увеличить усилением урона от заклинаний.",
        "Возвращает урон его источнику. То есть урон, наносимый призванными существами, возвращается к ним, а не к владельцу.",
        "У Damage Return глобальная дальность действия; способность влияет на существ в тумане войны или с действующей невидимостью.",
        "Не действует на варды, постройки и союзных существ."
      ],
      "mana": null,
      "abilityName": "Damage Return (пассивная)",
      "cooldown": null,
      "description": "Возвращает 20 + 20% урона от каждой атаки атакующим вас существам.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2100",
  "lore": null,
  "consistFrom": [
    "Broadsword",
    "Chainmail",
    "Recipe"
  ],
  "name": "Blade Mail",
  "description": "Острый, как лезвие бритвы, панцирь — выбор самоотверженных мучеников.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}