{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The evasion talent stacks multiplicatively with other sources of evasion."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1.5s Rage Duration",
          "talentRight": "+1.2% Feast Lifesteal"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+10% Ghoul Frenzy Slow",
          "talentRight": "16% Evasion"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+325 Health",
          "talentRight": "+25 Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10% Rage Move Speed Bonus",
          "talentRight": "+30 Attack Speed"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Lifestealer_Rage.mp3\/revision\/latest?cb=20191216015435",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Interrupts Lifestealer's channeling abilities upon cast.",
        "Applies spell immunity for the duration and a basic dispel upon cast.",
        "During Rage, Lifestealer cannot be affected by Ghost Scepter. The buff gets removed immediately."
      ],
      "mana": "75\/100\/125\/150",
      "hotKey": "Q",
      "cooldown": "18",
      "description": "Launch into a maddened rage, becoming Spell Immune, and gaining increased movement speed.",
      "spellName": "Rage",
      "params": [
        "Cast Animation: 0+0",
        "Move Speed Bonus: 15%\/16%\/17%\/18% (TagTalent 25%\/26%\/27%\/28%)",
        "Duration: 3\/4\/5\/6 (TagTalent 4.5\/5.5\/6.5\/7.5)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "The madness and brutality of N'aix makes him a vicious and unrelenting foe in combat."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies \/ Self",
        "Damage Physical"
      ],
      "notes": [
        "Stacks additively with other sources of lifesteal.",
        "Cannot lifesteal off of wards, buildings and allied units.",
        "Feast's lifesteal is affected by lifesteal amplification.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, and is considered by crit and cleave. It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, and is considered by crit and cleave.",
        "It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Does not work against Roshan."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Lifestealer's attacks deal damage and provide heal for a percentage of his target's max health.",
      "spellName": "Feast",
      "params": [
        "Enemy Max Health as Lifesteal: 1.6%\/2.2%\/2.8%\/3.4% (TagTalent 2.8%\/3.4%\/4%\/4.6%)",
        "Enemy Max Health as Damage: 0.6%\/0.8%\/1%\/1.2%"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "After escaping from his cell in Devarque, N'aix subsisted on flesh and bones of those unfortunate to cross his path."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "The debuff from successive attacks does not stack, only the duration is refreshed."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Passively causes Lifestealer's attacks to significantly slow enemy movement speed for 1.5 seconds. Grants you Attack Speed.",
      "spellName": "Ghoul Frenzy",
      "params": [
        "Attack Speed Bonus: 20\/30\/40\/50",
        "Move Speed Slow: 10%\/15%\/20%\/25% (TagTalent 20%\/25%\/30%\/35%)",
        "Slow Duration: 1.5",
        "Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "Slow on attack is disabled. Attack speed is not disabled."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Lifestealer_Open_Wounds.mp3\/revision\/latest?cb=20191216015434",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Physical"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Slows for 50%\/50%\/40%\/30%\/20%\/10%\/10%\/10%, decreasing one step per second.",
        "Casting an instantly killing ability on a unit affected by Open Wounds heals the caster based on the target's remaining health.",
        "Does not heal enemies damaging their affected ally, or the affected unit through self-inflicted damage.",
        "Stacks additively with other sources of lifesteal.",
        "Does not heal from damage flagged as HP Removal.",
        "The bonus damage is only applied to regular attacks done by heroes, including clones, excluding creep-heroes. The damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifesteal ed off of, and is considered by crit and cleave. It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions. The bonus damage is not applied when attacking Roshan.",
        "The damage is dealt in one instance together with the attack damage, and counts as attack damage as well.",
        "It can be lifesteal ed off of, and is considered by crit and cleave.",
        "It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "The bonus damage is not applied when attacking Roshan."
      ],
      "mana": "75",
      "hotKey": "D",
      "cooldown": "15",
      "description": "Lifestealer rends an enemy unit, slowing the victim's movement speed and allowing all allies to regain health for a percentage of the damage they deal to that unit. All damage dealt will steal life, including damage from spells. The victim recovers movement speed over the duration. Deals 2% of the target's max health per attack on the target from real heroes.",
      "spellName": "Open Wounds",
      "params": [
        "Cast Animation: 0.2+0.4",
        "Cast Range: 800",
        "Lifesteal: 50%",
        "Enemy Max Health as Damage: 2%",
        "Max Move Speed Slow: 50%",
        "Slow Duration: 8",
        "Slow persists and heal works if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Fresh wounds and the scent of blood often draw out the scavengers to finish the job."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0e\/Lifestealer_Infest.mp3\/revision\/latest?cb=20191216015431",
      "effects": [
        "Ability Target Unit",
        "Affects Self (TagAghanim Enemy Heroes)",
        "Damage Instant Attack"
      ],
      "notes": [
        "Applies a basic dispel on Lifestealer and disjoints projectiles upon cast.",
        "Lifestealer is invulnerable and hidden during Infest. Lifestealer still gains experience and gold during Infest.",
        "Lifestealer still gains experience and gold during Infest.",
        "During Infest, all of Lifestealer's abilities are hidden, while Infest is replaced by Consume.",
        "During Infest, Lifestealer is periodically moved to the host's current position. This affects multiple things such as: When Infest ends in any way, Lifestealer appears at the host's location. Every aura Lifestealer has (e.g. Gem of True Sight and Radiance) affects units around the host. Effects which react on heroes' presence, such as Smoke of Deceit, Marksmanship or Blur, react on the host's presence. Relocate forces Lifestealer out of the infested unit, dealing area damage. Divine Favor and Recall get dispelled as soon as Lifestealer casts Infest.",
        "When Infest ends in any way, Lifestealer appears at the host's location.",
        "Every aura Lifestealer has (e.g. Gem of True Sight and Radiance) affects units around the host.",
        "Effects which react on heroes' presence, such as Smoke of Deceit, Marksmanship or Blur, react on the host's presence.",
        "Relocate forces Lifestealer out of the infested unit, dealing area damage.",
        "Divine Favor and Recall get dispelled as soon as Lifestealer casts Infest.",
        "Can fully regenerate Lifestealer's health within 33.33\/25\/20 (TagTalent 16.67\/12.5\/10) seconds. Can regenerate up to 180%\/240%\/300% (TagTalent 360%\/480%\/600%) of Lifestealer's max health in one minute.",
        "Can regenerate up to 180%\/240%\/300% (TagTalent 360%\/480%\/600%) of Lifestealer's max health in one minute.",
        "The infested unit gets its maximum and current health increased by the given value. The current health increase does not count as a heal and bypasses everything.",
        "The current health increase does not count as a heal and bypasses everything.",
        "The infested unit also gets its movement speed increased by the given value. If the target is not a hero or creep-hero, its base movement speed also gets set equal to Lifestealer's current movement speed.",
        "If the target is not a hero or creep-hero, its base movement speed also gets set equal to Lifestealer's current movement speed.",
        "If the target is not a hero or a creep-hero, Lifestealer automatically takes control over it, turning it into his unit. If the target was an enemy, it retains its health bar colors, making it harder for enemies to tell that it got taken over.",
        "If the target was an enemy, it retains its health bar colors, making it harder for enemies to tell that it got taken over.",
        "Can be cast on, but cannot take control over allied heroes and allied creep-heroes. When on level 2 or higher, can be cast on and take control over ancient creeps. Cannot be cast on Roshan, Courier, Undying Zombie, wards, buildings, enemy heroes and enemy creep-heroes.",
        "When on level 2 or higher, can be cast on and take control over ancient creeps.",
        "Cannot be cast on Roshan, Courier, Undying Zombie, wards, buildings, enemy heroes and enemy creep-heroes.",
        "The infested unit receives a hidden modifier, which creates the visual effect above it, visible to allies only.",
        "Infest's cooldown starts upon leaving the infested unit, not upon cast.",
        "With Aghanim's Scepter, Infest can be cast on enemy heroes and creep-heroes. Does not increase health or movement speed of such targets. Although having a limited duration on these targets, Lifestealer still may use Consume to leave the host earlier. Causes Lifestealer to perform instant attacks on an Infested enemy target in 1.25-second intervals, starting immediately after cast, resulting in up to 5 attacks. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms.",
        "Does not increase health or movement speed of such targets.",
        "Although having a limited duration on these targets, Lifestealer still may use Consume to leave the host earlier.",
        "Causes Lifestealer to perform instant attacks on an Infested enemy target in 1.25-second intervals, starting immediately after cast, resulting in up to 5 attacks.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike, but completely ignore disarms."
      ],
      "mana": "100\/125\/150",
      "hotKey": "R",
      "cooldown": "100\/75\/50 (TagTalent 20)",
      "description": "Lifestealer infests the body of a target unit, becoming undetectable, and healing for a portion of his max hitpoints every second while inside. He can then explode from the host body, dealing damage to nearby enemies. If the infested unit is an enemy creep or a neutral creep, he can take control of the unit's ability to move and attack. Does not work on enemy heroes.",
      "spellName": "Infest",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: 150 (TagAghanim 500)",
        "Target Max Health Bonus: 400\/800\/1200",
        "Target Move Speed Bonus: 15%\/20%\/25%",
        "Self Max Health as Health Regen Bonus: 3%\/4%\/5% (TagAghanim 6%\/8%\/10%)",
        "Enemy Hero Attack Interval: 1.25",
        "Enemy Hero Duration: 5",
        "Disarm Duration: 5",
        "Allows Infesting enemy heroes for 5 seconds, disarming them, attacking their inside once every 1.25 seconds and doubling Lifestealer's regen rate. Increases cast range to 500 and reduces cooldown to 20 seconds.",
        "Grants a new ability: Open Wounds."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "With this infestation, N'aix consumes the life blood of the host, restoring him back to full unholy power."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Lifestealer_Consume.mp3\/revision\/latest?cb=20191216015429",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self",
        "Damage Magical \/ Instant Kill"
      ],
      "notes": [
        "Replaces Infest until the sub-ability is used, or until Lifestealer gets out of the host. If the infested target is a non-hero unit, and Lifestealer takes control over it, it also appears in the infested unit's HUD, in the next available ability slot.",
        "If the infested target is a non-hero unit, and Lifestealer takes control over it, it also appears in the infested unit's HUD, in the next available ability slot.",
        "If the infested unit dies before Lifestealer consumes it, the area damage is still applied.",
        "Does not kill or harm an infested allied heroes or creep-heroes.",
        "The damage is applied instantly in the area, it does not have a travel time.",
        "If the infested target gets taken over, Consume's Hotkey may vary based on what unit got taken over."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Lifestealer eats the host body from the inside out, exploding from within.",
      "spellName": "Consume",
      "params": [
        "Cast Animation: 0+0",
        "Damage Radius: 700",
        "Damage: 150\/275\/400"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 25.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.4,
    "attrAgility": 18.0
  },
  "description": "N'aix, the Lifestealer, is a vicious melee strength hero whose abilities give him the power to bring down durable heroes quickly, while sustaining his health by leeching the very life of his enemies.",
  "history": "In the dungeons of Devarque, a vengeful wizard lay in shackles, plotting his escape. He shared his cell with a gibbering creature known as N'aix, a thief cursed by the Vile Council with longevity, so that its life-sentence for theft and cozening might be as punishing as possible. Over the years, its chains had corroded, along with its sanity; N'aix retained no memory of its former life and no longer dreamt of escape. Seeing a perfect vessel for his plans, the wizard wove a spell of Infestation and cast his life-force into N'aix's body, intending to compel N'aix to sacrifice itself in a frenzy of violence while the mage returned to his body and crept away unnoticed. Instead, the wizard found his mind caught in a vortex of madness so powerful that it swept away his plans and shattered his will. Jarred to consciousness by the sudden infusion of fresh life, N'aix woke from its nightmare of madness and obeyed the disembodied voice that filled its skull, which had only the one thought: To escape. In that moment Lifestealer was born. The creature cast its mind into dungeon guards and soldiers, compelling them to open locks and cut down their companions, opening an unobstructed path to freedom while feeding on their lives. Lifestealer still wears the broken shackles as a warning that none may hold him, but on the inside remains a prisoner. Two minds inhabit the single form--a nameless creature of malevolent cunning, and the Master whose voice he pretends to obey.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1.5s Rage Duration",
      "talentRight": "+1.2% Feast Lifesteal"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+10% Ghoul Frenzy Slow",
      "talentRight": "16% Evasion"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+325 Health",
      "talentRight": "+25 Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10% Rage Move Speed Bonus",
      "talentRight": "+30 Attack Speed"
    }
  ]
}