{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Bane до 36,25%.",
        "Талант на броню не дается иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+5,5 сек. действия Fiend's Grip",
          "talentRight": "+150 к урону\/лечению от Brain Sap"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 к скорости передвижения",
          "talentRight": "-3 cек. перезарядки Nightmare"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 к дальности заклинаний",
          "talentRight": "+12% к урону от заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15% к сопротивлению магии",
          "talentRight": "+6 к броне"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Bane_Enfeeble.mp3\/revision\/latest?cb=20191216011114",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Уменьшает весь урон от атаки жертвы, в том числе дополнительный урон.",
        "Применяет уменьшение лечения, уменьшение восстановления, уменьшение вампиризма и уменьшение магическог вампиризма на цель.",
        "Увеличивает анимацию применения жертвы. Длительность прерываемых способностей остаётся неизменной.",
        "Несколько применений на одну цель не усилят эффект, но обновят длительность."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "Q",
      "cooldown": "20\/16\/12\/8",
      "description": "Снижает урон от атак, восстановление здоровья и скорость произнесения заклинаний",
      "spellName": "Enfeeble",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 1100",
        "Снижение урона от атак: 45%\/50%\/55%\/60%",
        "Уменьшение лечения и восстановления: 25%\/35%\/45%\/55%",
        "Замедление применений заклинаний: 30%",
        "Длительность: 8"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Каждый отголосок страха, сотканного Атропосом, делает жертв уязвимыми пред магией и неизведанными силами."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Brain_Sap.mp3\/revision\/latest?cb=20141210160410",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Чистый"
      ],
      "notes": [
        "Наносит урон до лечения.",
        "Лечение зависит от фактически полученного врагом урона.",
        "Несмотря на визуальный эффект, лечение и урон проходят одновременно."
      ],
      "mana": "120\/140\/160\/180",
      "hotKey": "W",
      "cooldown": "14\/13\/12\/11 (TagTalent 1,5)",
      "description": "Высасывает жизненную энергию врага, нанося ему урон и восстанавливая здоровье героя.",
      "spellName": "Brain Sap",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 600 (TagTalent 700)",
        "Урон: 75\/150\/225\/300 (TagTalent 225\/300\/375\/450)",
        "Уменьшает перезарядку и позволяет применять способность сквозь невосприимчивость к магии.",
        "Нельзя применить на врагов с иммунитетом к заклинаниям. При улучшении можно применить на врагов с иммунитет к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Атропос не знает большего счастья, чем пожинать плоды устрашения."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/41\/Nightmare.mp3\/revision\/latest?cb=20141210160517",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Применяет сон на затронутых существ, не давая им действовать.",
        "Nightmare дает цели эффект неуязвимости на 1 секунду, предотвращая пробуждение затронутого юнита.",
        "Nightmare снижает обзор вражеских существ до 200.",
        "Цель пробудится при атаке существ по ней (включая ручное использование активных модификаторов атаки) или при получении урона.",
        "Цель не проснется при получении урона от определенных источников и в нескольких редких состояниях: Урон нанесён Sleight of Fist, Автоматическая турель или Stifling Dagger. Любая атака от активного модификатора атаки, который действует как дебафф (например, Burning Spear) или атака по области (например, Tidebringer). Любой урон, нанесенный уже запущенной дальней атакой, если снаряд ударил после момента неуязвимости.",
        "Урон нанесён Sleight of Fist, Автоматическая турель или Stifling Dagger.",
        "Любая атака от активного модификатора атаки, который действует как дебафф (например, Burning Spear) или атака по области (например, Tidebringer).",
        "Любой урон, нанесенный уже запущенной дальней атакой, если снаряд ударил после момента неуязвимости.",
        "При пробуждении от атаки Nightmare переходит на атакующего юнита при начале атаки, а не при её попадании.",
        "Переход Nightmare на новую цель обновляет длительность способности, включая неуязвимость на 1 секунду.",
        "Nightmare не может перейти на неуязвимого к магии юнита, варды и строения; их атаки лишь пробудят цель.",
        "Bane и его иллюзии могут атаковать существ под действием Nightmare как обычно — без перенесения Nightmare на себя или пробуждения цели.",
        "Юниты под Nightmare никогда не считаются целью авто-атаки, независимо от настроек. Для атаки по ним требуется дать команду на принудительную атаку. Это предотвращает случайный переход Nightmare на себя же при авто-атаке вражеского юнита под действием Nightmare. Также существа под действием Nightmare не считаются целью для крипов на линии, нейтральных крипов, башен и фонтана. Существа могут применить атаку на союзное существо под Nightmare, чтобы перенести способность на себя.",
        "Это предотвращает случайный переход Nightmare на себя же при авто-атаке вражеского юнита под действием Nightmare.",
        "Также существа под действием Nightmare не считаются целью для крипов на линии, нейтральных крипов, башен и фонтана.",
        "Существа могут применить атаку на союзное существо под Nightmare, чтобы перенести способность на себя.",
        "Пока на существ действует Nightmare, эта способность у Bane заменяется на вспомогательную, которая может их пробудить.",
        "Статус неуязвимость от Nightmare отображается стандартной иконкой неуязвимости, а не иконкой способности."
      ],
      "mana": "165",
      "hotKey": "Q",
      "cooldown": "22\/19\/16\/13 (TagTalent 19\/16\/13\/10)",
      "description": "Погружает вражеского или союзного героя в сон. Атака пробуждает спящее существо, но эффект передаётся атакующему. Владелец способности может беспрепятственно атаковать спящие цели.",
      "spellName": "Nightmare",
      "params": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: 425\/500\/575\/650 (TagTalent 440\/515\/590\/665)",
        "Длительность сна: 4\/5\/6\/7",
        "Длительность неуязвимости: 1",
        "Сон и эффект неуязвимость сохранятся, если были применены до неуязвимости к магии и не были ранее развеяны.",
        "Блокируется первичной целью. Блокируется при атаке юнита под действием вражеского Nightmare."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Умение, украденное у богини Никташи, погружает жертву в бренный сон."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Nightmare_End.mp3\/revision\/latest?cb=20141210160502",
      "effects": [
        "Способность Переключаемая"
      ],
      "notes": [
        "Заменяет Nightmare, пока не закончится дебафф от способности Bane.",
        "Может пробудить в любой момент действия Nightmare, даже в 1 секунду неуязвимости.",
        "Пробуждает всех юнитов под действием Nightmare.",
        "Можно использовать при оглушении, урагане, провокации, исчезновении или при принудительном движении.",
        "Нельзя использовать при безмолвии, проклятии или в обезвреженном состоянии . Нельзя поставить в очередь действий."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Заканчивает действие всех Nightmare.",
      "spellName": "Nightmare End",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/79\/Fiend%27s_Grip.mp3\/revision\/latest?cb=20141210160450",
      "effects": [
        "Способность Направленная на существо \/ Произносимая",
        "Действует на Врагов \/ Себя",
        "Урон Чистый"
      ],
      "notes": [
        "Fiend's Grip обезвреживает цель на всё время произнесения способности.",
        "Дает эффект True Sight на цель, пока применяется способность.",
        "Если цель получила неуязвимость или её спрятали, то произнесение мгновенно прервется.",
        "Наносит 40\/60\/80 единиц урона и вытягивает 2.5% маны с интервалом в 0,5 секунды сразу после начала применения способности, срабатывая 12 (TagTalent 23) раза.",
        "Может нанести до 480\/720\/960 (TagTalent 920\/1380\/1840)) единиц урона (до уменьшений).",
        "Может вытянуть до 30% (TagTalent 57,5%) максимального запаса маны.",
        "С каждым тиком сначала наносит урон, а затем вытягивает ману.",
        "Выбор таланта на длительность Fiend's Grip не увеличивает длительность уже применяемой способности.",
        "В отличии от других направленных способностей, обзор заклинателя от Fiend's Grip действует до завершения произнесения (даже если его прервали), а не лишь 2 секунды.",
        "При улучшении с помощью Aghanim's Shard иллюзия появляется всякий раз при применении Fiend's Grip. Иллюзия всегда появляется справа от Bane на расстоянии 400 и смотрит в направлении цели. Иллюзия может применять способности, она мгновенно использует Fiend's Grip на ту же цель, что и Bane, без анимации применения. Технически иллюзия является контролируемой, ей можно отдать любой приказ, кроме использования предметов. Однако это прервёт Fiends Grip, поэтому иллюзия мгновенно умрёт. Fiend's Grip иллюзии накладывает модификатор, отличный от эффекта настоящего героя. Этот модификатор только оглушает цель, если на ней находится эффект настоящего героя. Однако если эффект героя спадёт, то модификатор иллюзии будет наносить урон и высасывать ману. По этой причине урон и высасывание маны зависит от характеристик иллюзии, а не Bane. Предметы и таланты на увеличение урона заклинаний не будут работать на иллюзии. Иллюзия появляется при каждом использовании способности. Если Bane прервёт заклинание и еще раз применит, то создастся новая иллюзия. Урон от нескольких иллюзий по одной цели не сочетаются. Иллюзия живёт не более 20 секунд. Иллюзия будет мгновенно умирать, если её будет использовать герой, у которого по умолчанию нет Fiends Grip, например у Rubick или при отражении. Иллюзия не будет появляться, если цель отразит заклинание. Rubick может применить Spell Steal на иллюзию. Он потратит ману, способность уйдёт на перезарядку, но герой не получит Fiend Grip.",
        "Иллюзия всегда появляется справа от Bane на расстоянии 400 и смотрит в направлении цели.",
        "Иллюзия может применять способности, она мгновенно использует Fiend's Grip на ту же цель, что и Bane, без анимации применения.",
        "Технически иллюзия является контролируемой, ей можно отдать любой приказ, кроме использования предметов. Однако это прервёт Fiends Grip, поэтому иллюзия мгновенно умрёт.",
        "Fiend's Grip иллюзии накладывает модификатор, отличный от эффекта настоящего героя. Этот модификатор только оглушает цель, если на ней находится эффект настоящего героя.",
        "Однако если эффект героя спадёт, то модификатор иллюзии будет наносить урон и высасывать ману.",
        "По этой причине урон и высасывание маны зависит от характеристик иллюзии, а не Bane. Предметы и таланты на увеличение урона заклинаний не будут работать на иллюзии.",
        "Иллюзия появляется при каждом использовании способности. Если Bane прервёт заклинание и еще раз применит, то создастся новая иллюзия. Урон от нескольких иллюзий по одной цели не сочетаются.",
        "Иллюзия живёт не более 20 секунд.",
        "Иллюзия будет мгновенно умирать, если её будет использовать герой, у которого по умолчанию нет Fiends Grip, например у Rubick или при отражении.",
        "Иллюзия не будет появляться, если цель отразит заклинание.",
        "Rubick может применить Spell Steal на иллюзию. Он потратит ману, способность уйдёт на перезарядку, но герой не получит Fiend Grip."
      ],
      "mana": "200\/300\/400",
      "hotKey": "R",
      "cooldown": "120\/110\/100",
      "description": "захватывает врага, оглушая его и нанося большой периодический урон. Также жертва каждые 0,5 сек. теряет долю от максимального запаса маны, передавая её владельцу способности.",
      "spellName": "Fiend's Grip",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 625 (TagTalent 725)",
        "Макс. длительность: 6 (TagTalent 11,5)",
        "Урон в секунду: 80\/120\/160",
        "Маны в секунду: 5%",
        "Урон по иллюзии: 0% (TagTalent 750%)",
        "Длительность иллюзии: 0 (TagTalent 20)",
        "Fiend's Grip создаёт неконтролируемую иллюзию, которая применяет Fiend's Grip на того же врага и мгновенно умирает, если её прервать. Иллюзия получает 750% урона. Эффекты Fiend's Grip на одной цели не складываются."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Жертвы Атропоса растерзываются на куски созданиями из собственных кошмаров."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.6,
    "attrAgilityInc": 2.6,
    "attrAgility": 22.0
  },
  "description": "Bane — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первая способность, Nightmare, погружает врага или союзника в сон, прерываемый уроном. Если спящего героя кто-то попытается атаковать, то он проснётся, а эффект способности передастся атаковавшему. Сам Bane может атаковать спящие цели беспрепятственно. Сон можно снять подспособностью Nightmare End. Вторая способность, Brain Sap, высасывает жизненную энергию врага, нанося ему урон и восстанавливая здоровье Bane. Третья способность, Enfeeble, уменьшает сопротивление магии и эффектам у врагов каждый раз, когда Bane применяет способность. Ультимативная способность, Fiend's Grip, захватывает врага, в результате чего он оглушается и получает большой периодический урон. Также из жертвы высасывается и передаётся Bane мана (количество зависит от ее максимального числа).",
  "history": "Когда сами боги видят кошмарные сны, их приносит элементаль ужасов. Имя ему — Атропос, порождение ночных кошмаров богини Никташи. Сны не смогли сдержать страшную силу, и, вырвавшись из дрём матери, Атропос выкормился на её бессмертии и соткал себе туманную форму из её чернильной крови. Он — средоточие страха, и смертным, что слышат его голос, он нашёптывает их самые мрачные тайны. Атропос взывает к глубочайшим страхам в сердцах героев. Не спасёт жертву и бдение: неиссякаемая чёрная кровь элементаля обволакивает врагов кошмарной дрёмой, словно смола. Завидев на поле боя Атропоса, любой герой помнит: темноты нужно бояться.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+5,5 сек. действия Fiend's Grip",
      "talentRight": "+150 к урону\/лечению от Brain Sap"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 к скорости передвижения",
      "talentRight": "-3 cек. перезарядки Nightmare"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 к дальности заклинаний",
      "talentRight": "+12% к урону от заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15% к сопротивлению магии",
      "talentRight": "+6 к броне"
    }
  ]
}