{
  "abilities": [
    {
      "notes": [
        "The projectile has ≈100 radius flying vision, and travels at a speed of 1200 until reaching the targeted point\n This vision last for 2 seconds at the targeted point upon reaching it",
        "Ice Shards are always created in the same formation\n The open side of the shards circle is always facing towards Tusk's position upon cast\n The shards' formation is a 200 radius circle with one open side\n The center of the circle is 200 range before the targeted point\n The first shard is always created at the targeted point, in one line with Tusk's position upon cast\n The next shards are placed 40° further to the left and the right respectively, up to 6 shards (9 shards would form a full circle)\n Each shard's collision radius is approximately 67, and the distance between them is about 6, which is too small for most units to move through, except  Wraith King Skeletons\n SHARD NOTES 4 additional shards are placed to the left and right side of the last shards at the semi-circle's opening, forming a U-shape\n The shape has a width of 200, and has a length of 480\n This effectively increases the length of Ice Shards' formation by 280 from the tails of the open circle",
        "Non-player-controlled units (i.e\n lane creeps) do not try to path around Ice Shards, but simply walk against them as if they are not there\n This effectively causes them to get stuck, until they change directions (e.g\n when being aggroed), or until the shards dissipate",
        "Units with flying movement (e.g\n  Arctic Burn) or unobstructed movement (e.g\n  Spectral Dagger) are not blocked by Ice Shards\n They still are fully affected by it otherwise when hit\n They will be either pushed aside or inside and damaged",
        "SHARD NOTES Two 200 radius auras are now created at the centerline of the formation\n The first source is placed at the center of the default shards formation, 200 range before the targeted point\n The second source is placed 200 range behind the first source, between the additional 4 shards\n Since both sources overlap, the auras cover a total length of 600\n The damage per second and movement speed slow effects are provided by the auras and its debuff lingers for 0.5 seconds\n Deals damage in 1-second intervals, starting 1 second after the debuff is placed, resulting in up to 4\/5\/6\/7 instances\n Can deal up to 240\/300\/360\/420 damage (before reductions) to a single unit within the area for the entire duration"
      ],
      "item_behaviour": [],
      "description": "Tusk compresses shards of ice into a ball of frozen energy that damages all enemies it comes in contact with. When the ball reaches its target destination the shards are released, creating a barrier that lasts for 4\/5\/6\/7 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range:  1800",
        "Damage Radius: 200",
        "Shards Spawn Radius: 200",
        "Shards Spawn Angle: 40°",
        "Number of Shards: 7 ( 11)",
        "Damage: 75\/150\/225\/300",
        "Shards Duration: 4\/5\/6\/7",
        "Damage per Second:  60",
        "Move Speed Slow:  40%",
        "Aura Linger Duration:  0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Tusk_Ice_Shards_1.mp3\/revision\/latest?cb=20191216025612",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "23\/20\/17\/14 (TagTalent 17\/14\/11\/8)",
      "aghanim": null,
      "name": "Ice Shards",
      "cooldown": "100",
      "legacy_key": "E",
      "story": "In the frozen tundra near the Barrier, after the last sun of autumn has set, ice can form with alarming speed."
    },
    {
      "notes": [
        "The Snowball chases the target for up to 3 seconds and travels at a speed of 625\/650\/675\/700\n It can travel for up to 1875\/1950\/2025\/2100 range",
        "Upon cast, a Snowball target indicator appears only visible for allies, and exposes the affected target, but does not provide True Sight over it\n Reveal units affected by  Shadow Dance despite not providing True Sight\n The target indicator lasts for 6 seconds until Tusk's death, the Snowball disappears or when the Snowball misses its target\n Only heroes, illusions, and clones will display hero icons, other units gathered display a black-circled question mark",
        "Snowball destroys trees, and increases its radius by 40 per second up to 240\/280\/320 as it rolls forward",
        "Tusk can  Right Click on allied heroes and clones to gather them into the Snowball at any point, even if they are invisible or invulnerable\n Vice versa, allies can also  Right Click the Snowball, within ≈100 range, to jump inside as well\n Can gather invulnerable allies but not hidden ones\n Cannot gather allies who have ☐ Disabled Help from Tusk\n Allies affected by  Flaming Lasso,  Black Hole or  Chronosphere cannot be gathered\n However, attempting to gather in any ally affected by the aforementioned abilities still adds the gathered damage to Snowball",
        "Only gathered allied heroes and clones increase its damage\n Can gather summoned units, Tusk's  Courier, illusions and creep-heroes, but it does not increase its damage\n Cannot gather wards\n Does not disjoint projectiles for gathered targets",
        "Units inside Snowball are invulnerable, hidden and spell immune\n Allies inside the Snowball are fully disabled and are prevented from acting\n Tusk is muted and disarmed during Snowball\n He can cast his abilities, but cannot use items or attack",
        "Tusk cannot be forced out of the Snowball, while other units within can still be forced out by teleporting abilities, without reducing the gathered damage\n If he is teleported by  Dark Rift while Snowball is rolling, Tusk is forced out and Snowball is fully canceled",
        "When Snowball connects with its target, Tusk is given an attack order on the target, regardless of auto-attack settings",
        "Snowball first applies the debuff, then the damage",
        "This is how much damage Snowball deals (before reductions) with a certain amount of heroes including Tusk: 1 Hero: 105\/190\/275\/360 ( 225\/310\/395\/480) damage\n 2 Heroes: 130\/240\/350\/460 ( 250\/360\/470\/580) damage\n 3 Heroes: 155\/290\/425\/560 ( 275\/410\/545\/680) damage\n 4 Heroes: 180\/340\/500\/660 ( 300\/460\/620\/780) damage\n  Tusk is not counted, so if no allied heroes are gathered, only the base damage is applied",
        "A hidden debuff provides shared vision over the target until the Snowball stops\n Does not provide True Sight\n SPELL STEAL \/ MORPH NOTES Snowball disappears upon losing ability\n SOULBIND Only affects the primary target"
      ],
      "item_behaviour": [],
      "description": "Tusk begins rolling into a snowball. Allies within a 350 radius can also be added to the snowball by right-clicking on them, even while the snowball is moving. Once launched, any enemies caught in the snowball's path will be stunned and take damage. Each allied Hero in the snowball will add to its damage.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0.5",
        "Cast Range:  1150",
        "Damage\/Stun Radius: 200",
        "Radius Increase per Second: 40",
        "Gather Radius: 350",
        "Max Stationary Time: 3",
        "Max Chase Duration: 3",
        "Base Damage: 80\/140\/200\/260 ( 200\/260\/320\/380)",
        "Damage Bonus per Gathered Hero: 25\/50\/75\/100",
        "Snowball Speed: 625\/650\/675\/700",
        "Stun Duration: 0.8\/1\/1.2\/1.4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Snowball_1.mp3\/revision\/latest?cb=20191216025616",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "21\/19\/17\/15 (TagTalent 13\/11\/9\/7)",
      "aghanim": null,
      "name": "Snowball",
      "cooldown": "75",
      "legacy_key": "W",
      "story": "Tales are still told of the wild feat that ended the grand brawl at White Fields."
    },
    {
      "notes": [
        "Replaces  Snowball until the sub-ability is used, or Snowball reaches its target or expires\n Tusk is unable to ⇧ Shift-queue this ability",
        "Tusk is unable to level Snowball up while this sub-ability is active"
      ],
      "item_behaviour": [],
      "description": "Launch the snowball toward the target.",
      "hot_key": "W",
      "params": [
        "Cast Animation:  0+0"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Allies"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Launch Snowball",
      "cooldown": "0",
      "legacy_key": "W",
      "story": "Into the great wide white!"
    },
    {
      "notes": [
        "Interrupts Tusk's channeling abilities upon cast",
        "The debuff placed on enemies is provided by an aura and lingers for 0.5 seconds",
        "Tag Team only triggers on attacks of allied heroes, including illusions and clones, but excluding creep-heroes\n Also triggers on attacks of any non-hero unit controlled by Tusk\n Although illusions trigger it, they cannot make use of the attack damage bonus, effectively only applying the slow",
        "Attacks triggering Tag Team first place the slow debuff, then the attack damage",
        "Tag Team's damage is considered as a conditional attack damage bonus\n Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to the attacking unit's attack damage\n The attack damage bonus values are considered by critical strike, lifesteal and cleave\n They are affected by percentage-based total attack damage bonuses or reductions and can be reduced by flat reductions (e.g\n damage block)",
        "The movement speed slow from multiple attacks and\/or attack sources fully stacks, with each attack placing a separate debuff"
      ],
      "item_behaviour": [],
      "description": "Temporarily applies a negative debuff aura around you, causing enemies that are attacked under it to take bonus physical damage and reduced movement speed. Lasts 5 seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation:  0+0",
        "Radius: 350",
        "Attack Damage Bonus: 20\/45\/70\/95 ( 45\/70\/95\/120)",
        "Move Speed Slow: 75%",
        "Slow Duration: 0.5",
        "Aura Duration: 5",
        "Aura Linger Duration: 0.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Tusk_Tag_Team_1.mp3\/revision\/latest?cb=20191216025619",
      "effects": [
        "Ability: No Target",
        "Affects: Allies \/ Enemies"
      ],
      "mana": "24\/21\/18\/15",
      "aghanim": null,
      "name": "Tag Team",
      "cooldown": "70",
      "legacy_key": "T",
      "story": "Even far from Cobalt, Tusk carries the 'Barrier Chill' in his very bones."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter to be unlocked",
        "Can be cast on any enemy unit, including enemy  Couriers, excluding buildings and wards\n However, when cast on  Roshan, he does not get moved, but all other effects still apply, including the area damage\n Walrus Kick has a 6-second cooldown when cast on creeps",
        "The target is kicked away from Tusk in an arc 1400 range far and 360 range high, while rotating 180° on the x-axis\n Walrus Kick cannot be overridden by any other forced movement\n While in the air, other units may pass below the kicked unit",
        "The slow has a total duration of 5, but it is applied at the same time as the stun, therefore effectively lasting 4 seconds",
        "Walrus Kick first applies the slow debuff, then the knockback debuff, then the damage",
        "Destroys trees within a 100 radius around the affected unit during the knockback\n SOULBIND The secondary target is kicked in the opposite direction of the primary target"
      ],
      "item_behaviour": [],
      "description": "Kicks the closest enemy unit in a targeted direction, stunning, damaging, and slowing them. Also deals damage to all heroes within 250 radius of its landing area. Cooldown is reduced by 6 if kicking a creep.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+1.3",
        "Cast Range:  250",
        "Damage Radius: 250",
        "Knockback Distance: 1400",
        "Damage: 350",
        "Move Speed Slow: 40%",
        "Slow Duration: 4",
        "Stun Duration: 1",
        "Non-Hero Cooldown: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Walrus_Kick.mp3\/revision\/latest?cb=20191216025621",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "12",
      "aghanim": null,
      "name": "Walrus Kick",
      "cooldown": "100",
      "legacy_key": "D",
      "story": "Tusk may have made his name with his fists, but the wise enemy is wary of any and all limbs."
    },
    {
      "notes": [
        "Walrus PUNCH!'s cast range only be further increased by attack range bonuses of the same range type as the caster\n However, it is not affected by cast range bonuses\n Both Autocast and manually casting it uses Tusk's current attack range",
        "The attack from Walrus PUNCH! cannot miss\n Despite being an active attack modifier, manually casting Walrus PUNCH! procs all on-cast effects like a regular ability\n Can be cast  on every enemy unit, including enemy  Couriers, except wards, buildings, and allied units\n However, when cast on  Roshan, only the stun and movement speed slow are applied",
        "The affected target is hurled 650 range (or 1200 range if lethal) into the air during the stun duration, while rotating 180° on the x-axis\n The speed adapts to changed stun duration\n Can be cast while the enemy target(s) are affected by  Flaming Lasso, but not  Pulverize\n Walrus PUNCH! cannot be overridden by any other upward movement sources",
        "While in the air, other units may pass below the hurled unit",
        "The slow has a total duration of 3\/4\/5 ( 3.5\/4.5\/5.5), but it is applied at the same time as the stun, therefore effectively lasting 2\/3\/4 seconds",
        "The punch first applies the knockback debuff, then the slow debuff, then the damage, then the self attack animation bonus\n Plays a sound as soon as the attack starts\n The sound only stops playing upon landing the punch\n This reduces Tusk's attack animation to 0.216+0.384 for the next attack\n The attack animation bonus only applies to manual casts",
        "TALENT NOTES Walrus Punch now gains a 12% chance to passively proc on regular attacks\n These procs do not trigger the cooldown and work while on cooldown, and do not cost mana\n They do not proc on-cast effects either\n The procs use pseudo-random distribution\n When Walrus PUNCH! procs during a manual cast or Autocast order, the proc takes priority, and it does not go on cooldown or consume mana\n Adds an average of 24%\/30%\/36% ( 33%\/39%\/45%) damage to every attack"
      ],
      "item_behaviour": [],
      "description": "Tusk connects with his mighty Walrus Punch, a critical strike so powerful it launches its victim into the air. The victim is slowed upon landing.",
      "hot_key": "R",
      "params": [
        "Cast Range:  150",
        "Self Attack Animation Speed Bonus: 40%",
        "Critical Damage: 300%\/350%\/400% ( 375%\/425%\/475%)",
        "Enemy Move Speed Slow: 40%",
        "Slow Duration: 2\/3\/4",
        "Stun Duration: 1 ( 1.5)",
        "Proc Chance:  12%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Tusk_Walrus_PUNCH%21.mp3\/revision\/latest?cb=20191216025622",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Self \/ Enemies"
      ],
      "mana": "20\/15\/10",
      "aghanim": null,
      "name": "Walrus PUNCH!",
      "cooldown": "75",
      "legacy_key": "R",
      "story": "It never matters who throws the first punch, only who throws the last."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.9,
    "attrStrength": 23.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Snowballs into his enemies to stun. Amidst broken stools and shattered bottles, the bewildered barkeep issued Ymir his greatest challenge. Find a proper battle, and win it for whichever side he chose. With that, the champion brawler strode forth, bringing with him the northern elements in the form of a frozen sigil. Able to instantly corner an enemy with a wall of Ice Shards, cutting off all retreat. He understands a Tag Team is only as strong as its weakest member. Gathering both snow and allies, he rolls into battle as an unstoppable Snowball at will, stunning foes in its path. For a finale, the Tusk winds up his drinking arm, and launches his opponent into orbit with a mighty uppercut — his solid signature Walrus PUNCH!.. though his Kicks are also to be feared.  Initiator Disabler Nuker ★☆☆",
  "trivia": [
    "In DotA, Tusk's title is Tuskarr. The Tuskarr are a race of humanoid walruses in the Warcraft universe.",
    "His response Link▶️ \"Falcon Punch!\" is a reference to Captain Falcon's signature move in the Super Smash Bros. franchise, which has also become a popular internet meme.",
    "His response Link▶️ \"Bang! Zoom! To the Mad Moon!\" is likely a reference to The Honeymooners character Ralph Kramden, who would frequently say \"Bang! Zoom! Straight to the moon!\".",
    "His response Link▶️ \"Coulda been a contender.\" is likely a reference to the quote from the movie On the Waterfront.",
    "His response Link▶️ \"My fight money.\" is likely a reference to Balrog from Street Fighter who says the same thing whenever he loses a round.",
    "His response to missing a Walrus Punch, Link▶️ \"Well there's your problem.\" is likely a reference to Adam Savage from Mythbusters, who has made it a show catchphrase. Savage often jokes that the mustache of his co-host Jamie Hyneman makes him look like a walrus.",
    "His response Link▶️ \"Double Dragon Punch Punch!\" is a reference to the game, \"Double Dragon\".",
    "In Tusk's lore, the Bristled Bruiser is Bristleback, who was ported to Dota 2 roughly a month after Tusk; Bristleback's lore makes mention of Tusk as well, and the two heroes share rival and ally lines with regards to this relationship.",
    "Before 6.80, where Walrus PUNCH! dealt higher crit damage to targets below 50% health, the floating text above the target would change: When landed on an enemy creep whose health was above 50%, the caption read \"Penguin Punch!\" in small blue letters. When landed on an enemy hero whose health was above 50%, the caption read \"Polar Punch!\" in medium blue letters. When landed on any enemy whose health was below 50%, it read \"Walrus Punch!\" in large letters. In the current version, it always displays \"Walrus Punch\", no matter what is targeted.",
    "When landed on an enemy creep whose health was above 50%, the caption read \"Penguin Punch!\" in small blue letters.",
    "When landed on an enemy hero whose health was above 50%, the caption read \"Polar Punch!\" in medium blue letters.",
    "When landed on any enemy whose health was below 50%, it read \"Walrus Punch!\" in large letters.",
    "In the current version, it always displays \"Walrus Punch\", no matter what is targeted.",
    "Rubick's version of Walrus Punch would throw a projectile which uses Rubick's model and spins towards the target. When used on Tusk, it would read \"Sucker Punch!\" in green. On other targets, it read \"Stolen Punch\".",
    "Tusk's name \"Ymir\" might possibly be based from the Nordic Folklore."
  ],
  "history": "It had been a brawl to remember. There stood Ymir, the Tusk, the Terror from the Barrier, the Snowball from Cobalt, the only fighter to have bested the Bristled Bruiser in a fair fight, and now the last man standing in Wolfsden Tavern. What started as a simple bar bet of supremacy ended with four regulars, a blacksmith, and six of the Frost Brigade's best soldiers writhing against the shards and splinters of almost every bottle, mug, and chair in the building. The Tusk boasted and toasted his victory as he emptied his brew. No sooner had the defeated regained consciousness than the cries for double-or-nothing rang out. The Tusk was pleased at the prospect, but none could think of a bet bigger than the one he just conquered. Horrified at the damage to his tavern and desperate to avoid another brawl, the barkeep had an idea. As skilled as he was, Ymir had never taken part in a real battle, never tested himself against the indiscriminate death and chaos of war. He proposed a wager to the fighter: seek out the biggest battle he could find, survive, and win it for whichever side he chose. The stakes? The next round of drinks.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "12% Chance Walrus Punch",
        "talent_left": "-8s Snowball Cooldown"
      },
      {
        "talent_lvl": "20",
        "talent_right": "-6s Ice Shards Cooldown",
        "talent_left": "+75% Walrus Punch Crit"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+325 Health",
        "talent_left": "+120 Snowball Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+25 Tag Team Damage",
        "talent_left": "+0.5s Walrus Punch Stun Duration"
      }
    ],
    "notes": [
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}