{"abilities":[{"spell":"Channels light energy, building power the longer it's channeled. Once released, a wave is sent forth that deals damage and gives vision in its path. The longer it is channeled, the more damage is dealt.","effects":["Ability Target Point \/ Channeled","Affects Enemies ( Allies)","Damage Magical"],"notes":["The wave travels at a speed of 1050, taking 1.48 ( 1.71) seconds to travel the full distance.","Can hit units up to 1925 ( 2175) range away (travel distance + radius).","The Damage and heal increase by 1 for every 0.01 seconds, starting as the 0.3 second cast time begins. The damage\/heal increasing talent does not alter this. The talent's bonus is added after the scaling damage is calculated. This means it can deal a minimum of 30 ( 230) damage and heal for a minimum of 30 ( 230) health. This also means that the maximum damage and heal are reached after 1.7\/2.7\/3.7\/4.7 seconds of channeling.","Checks the current daytime upon releasing the wave. Cannot heal during the nights caused by Dark Ascension and Eclipse.","Cannot heal invulnerable allies or couriers.","During the channeling, the spell spawns vision fields in a line in front of Ezalor. The vision fields provide 375 range flying vision and last for 10.34 seconds each. The first vision field spawns 150 range in front of Ezalor. The following ones spawn 150 range away from the previous vision fields. The vision fields are spawned in 0.5 second intervals, starting 0.5 seconds after channeling start, resulting in up to 3\/5\/7\/9 fields. When the channeling gets canceled, it stops spawning vision fields. This does not affect the travel distance of the wave. When fully channeled, all vision fields together reach up to 825\/1125\/1425\/1725 range away with their vision.","The horses only spawn when the spell is channeled for the full 2\/3\/4\/5 seconds and only have a visual purpose.","The Spirit Form buff is granted by Aghanim's Scepter. It has only visual purposes and does nothing."],"mana":"150\/160\/170\/180","elements":["Partially pierces spell immunity."],"cooldown":"11","name":"Illuminate","description":["Cast Animation: 0.3+0","Cast Range: 1800 ( 2050)","Travel Distance: 1550 ( 1800)","Wave Radius: 375","Max Channel Time: 2\/3\/4\/5","Damage\/Heal Increase per Second: 100","Max Damage: 200\/300\/400\/500 ( 400\/500\/600\/700)","Max Heal: 0 ( 200\/300\/400\/500, 400\/500\/600\/700)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Release the channel early.","effects":["Ability No Target"],"notes":["Replaces Illuminate until the channeling ends.","Interrupts Keeper of the Light's channeling spells upon cast."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Release Illuminate","description":["Cast Animation: 0+0"],"hot_key":"Q","legacy_key":"T"},{"spell":"Channels light energy, building power the longer it's channeled. Once released, a wave is sent forth that deals damage and gives vision in its path. The longer it is channeled, the more damage is dealt.","effects":["Ability Target Point","Affects Enemies ( Allies)","Damage Magical"],"notes":["This ability replaces Illuminate while having Aghanim's Scepter equipped.","Upon cast, an image of Ezalor is spawned at his location, which channels the Illuminate for him. Ezalor can act freely during this.","Aside from that, same notes as for Illuminate apply."],"mana":"150\/160\/170\/180","elements":["Partially pierces spell immunity."],"cooldown":"11","name":"Illuminate (Aghanim's Scepter)","description":["Cast Animation: 0.3+5.53","Cast Range: 1800 ( 2050)","Travel Distance: 1550 ( 1800)","Wave Radius: 375","Max Charge Time: 2\/3\/4\/5","Damage\/Heal Increase per Second: 100","Max Damage: 200\/300\/400\/500 ( 400\/500\/600\/700)","Max Heal: 0 ( 200\/300\/400\/500, 400\/500\/600\/700)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Release the channel early.","effects":["Ability No Target"],"notes":["Replaces Illuminate (Aghanim's Scepter) while it is being channeled by the spirit.","Same notes as for Release Illuminate apply."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Release Illuminate (Aghanim's Scepter)","description":["Cast Animation: 0+5.53"],"hot_key":"Q","legacy_key":"T"},{"spell":"A blinding light flashes over the targeted area, knocking back and blinding the units in the area, causing them to miss some attacks. Knockback is 350 range over 0.4 seconds,","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Knocks units back at a speed of 875. Knockback distance is always 350, no matter how far the unit is from the center.","Units are not disabled during the knockback. They can still turn, attack, cast spells and use items. Channeling spells are not interrupted.","Can knock units over impassable terrain. Destroys trees within 150 radius of affected units upon landing.","Blinding Light's blind uses pseudo-random distribution."],"mana":"130\/145\/160\/175","elements":["Does not pierce spell immunity."],"cooldown":"14","name":"Blinding Light","description":["Cast Animation: 0.3+1.07","Cast Range: 475\/550\/625\/700 ( 725\/800\/875\/950)","Radius: 600","Knockback Distance: 350","Damage: 50\/100\/150\/200","Miss Chance: 70%","Knockback Duration: 0.4","Miss Duration: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"B"},{"spell":"Restores mana to the target unit and reduces cooldowns of all abilities currently on cooldown by a fixed amount. Can be cast on enemy, placing a debuff that drains 4.5%\/5%\/5.5%\/6% of current mana per 100 units moved.","effects":["Ability Target Unit","Affects Allies \/ Enemies"],"notes":["Only reduces cooldowns of every non-ultimate ability, including passive abilities.","Checks the enemy target's current position once upon cast and then in 0.1 second intervals, resulting in 51 checks.","On each check, it compares the target's current position with its position on the last check and reduces its mana based on the distance between the positions.","Does not reduce mana when the distance between two positions is greater than 300. So a unit needs to move at more than 3000 speed, or blink a distance greater than 300 to not lose mana.","Does not reduce mana on invulnerable units.","The sound effect upon losing mana is only audible to the target."],"mana":"0","elements":["Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"20\/18\/16\/14","name":"Chakra Magic","description":["Cast Animation: 0.3+1","Cast Range: 900 ( 1150)","Ally Mana Restored: 80\/160\/240\/320 ( 380\/460\/540\/620)","Ally Current Cooldowns Reduction: 4\/5\/6\/7","Enemy Current Mana Lost per 100 Moved Distance: 4.5%\/5%\/5.5%\/6%","Enemy Duration: 5"],"hot_key":"E","legacy_key":"C"},{"spell":"Summons Ignis Fatuus at the targeted area. Alternates on and off every second. When active, it causes all enemies near it to stare hypnotized at it. Can be attacked by units in or outside of the radius, dies after a certain number of attacks.","effects":["Ability Target Area","Affects Enemies"],"notes":["The wisp starts flickering 1 second after cast, and then every 3.15 seconds, up to 3\/4\/5 ( 6\/7\/8) times.","While flickering, hypnotizes all enemies within the area, setting their movement speed to 35, forcing them to move towards the wisp, and preventing them from acting.","Only attacks from heroes (including clones, excluding illusions) can damage the wisp.","Destroys trees within the radius upon cast.","When casting Will-O-Wisp a second time while a previous cast is still active, the second wisp pulses synchronised with the first one. This is not limited to a second wisp. All wisps placed while previous ones exist pulse simultaneously. This also includes wisps placed by allies, but does not include enemy wisps."],"mana":"250\/350\/450","elements":["Does not pierce spell immunity."],"cooldown":"120","name":"Will-O-Wisp","description":["Cast Animation: 0.1+1.27","Cast Range: 800 ( 1050)","Radius: 725","Attacks to Destroy: 4\/5\/6 ( 5\/6\/7)","Hypnotize Movement Speed: 35","Number of Flickers: 3\/4\/5 ( 6\/7\/8)","Initial Delay: 1","Off Duration: 1.85","On Duration: 1.3","Wisp Duration: 9.35\/12.5\/15.65 ( 18.8\/21.95\/25.1)"],"hot_key":"R","legacy_key":"R"}],"bio":"Upon a pale horse he rides, this spark of endless suns, this Keeper of the Light. Ezalor long ago escaped the Fundamental plane, separating from the other ancient forces to which he was bound within the great Primordial harmony. He is a power grown sentient in the dawn of the universe, and now rides forth in all planes at once, one step ahead of pursuing chaos, bearing his gift with him at the end of a radiant staff. His majestic truth lies hidden beneath the outward appearance of a slightly doddering old man who barely stays in the saddle. However, when faced with the challenge of chaos, or the forces of darkness, his primordial light bursts forth, and his full power is revealed, transforming him once again into a force to be reckoned with.","talentsTips":["The cast range talent also affects the max distance of Illuminate.","The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Keeper of the Light's magic resistance to 55%."],"trivia":["Ezalor's design in Dota 2 makes several references to Gandalf, an iconic character from The Lord of the Rings book series. His clothing is almost purely white, similar to Gandalf's attire. Illuminate's wave animation are a group of stampeding white horses. This is similar to the spell Gandalf cast on the torrent of water, at the ford of Bruinen, in the first book, The Fellowship of the Ring. Additionally, it has similarities to his reinforcements at Helm's Deep during the second book, The Two Towers. This is also depicted in the splash art, with Ezalor taking Gandalf's place at the head of the charge. The Mana Leak cast line \"You shall not cast!\" is a reference to one of Gandalf's most famous quotes: \"You shall not pass!\" The unused Mana Leak cast line \"Run! Run, I say!\" is a reference to another one of Gandalf's famous quotes: \"Fly, you fools!\" The respawn lines \"Ezalor... I think that's my name\" is likely a reference to Gandalf \"respawning\" as The White: \"Gandalf? ... Yes ... That was my name ... Gandalf the Grey.\" One of Ezalor's cosmetic items, the Wise Cap of the First Light makes him look even more like Gandalf.","The lines \"Kundalini!\" and \"The serpent of illumination stirs!\" come, as well as the term \"Chakra\" are derived from Hinduism. Kundalini is described as a dormant inner strength, or \"sleeping serpent waiting to be awakened\".","Enigma, Chaos Knight, Keeper of the Light, and Io together represent the four fundamental forces of the universe with Keeper of the Light representing the electromagnetic force, the force responsible for light. Io's lore mentions \"the great twin riders Dark and Light,\" referring to Chaos Knight (weak interaction) and Keeper of the Light (electromagnetism) uniting under the electroweak interaction.","The rivalry line \"And chaos fled!\" may be a reference to an official bug that can occur when fighting the final boss of Final Fantasy, Chaos, as you can win the fight without damaging him (he simply just fled).","His rare line \"I'll tell thee everything I can, there's little to relate.\" and \"Very gladly will I drink your honor's noble health.\" are quotes of the poem by \"Haddock's Eyes\" by Lewis Carroll, a poem about a very odd old man.","His rare line \"I'll forego green girdles and questing beasts, for all such knightly trifles pale before the light.\" is a reference to the book The Sword in the Stone."],"talents":["+200 Illuminate Damage\/Heal:+3 Will-O-Wisp Flicker","+300 Chakra Magic Mana:+40% Magic Resistance","+250 Cast Range:+1 Will-O-Wisp Health Count","+25 Movement Speed:+30% XP Gain"],"desc":"Ezalor the Keeper of the Light is a ranged intelligence hero famous for his reputation as a one-man support team. Supporting his allies in need, and pushing unguarded lanes with ease, Ezalor is a very valuable ally for any team. Having a variety of useful abilities, he can channel a powerful globe of intense light that can heavily damage an army of enemy creeps in the lane, allowing for an easy push. He can also restore mana and reduce cooldown for himself and his allies as well as blind his enemies with an intense light that also damages and displaces them. His Ultimate hypnotizes enemies in an AoE periodically, allowing his allies to follow over with their attacks around this immensely powerful crowd control. Keeper of the Light requires patience, confidence, and selfless behavior to play him well, as he is played as a support instead of a killer caster like most Intelligence gankers. His set of abilities also requires good timing, reflexes, and knowledge to use well."}