{"abilities":[{"spell":"Создает перед собой волну светлой энергии, постепенно набирающую силу. Выпущенная волна наносит урон и временно раскрывает туман войны. Чем дольше волна создается, тем больше урона она нанесет.","effects":["Способность Направленная на точку \/ Произносимая","Действует на Врагов ( Союзников)","Урон Магический"],"notes":["Волна летит со скоростью в 1050 единиц; требуется 1.48 ( 1.81) секунд, чтобы волна преодолела все расстояние.","Может поражать юнитов на расстоянии до 1925 ( 2275) единиц (складывается из дистанции прохождения и радиуса волны).","Урон и лечение усиливается на 1 единицу за каждую 0,01 секунду, спустя 0,3 секунды после начала применения. Талант, усиливающий урон\/лечение, на расчеты не влияет. Бонус от таланта добавляется после подсчета накопляемого урона. То есть способность может минимально нанести 30 ( 230) единиц урона и излечить минимум 30 ( 230) единиц здоровья. Также это значит, что максимальный урон и лечение наносятся после 1.7\/2.7\/3.7\/4.7 секунд подготовки.","Проверяет текущее время суток после выпускания волны. Волна не может лечить, пока действует ночь от Dark Ascension и Eclipse.","Не может лечить неуязвимых союзников или курьеров.","Во время произнесения волна создает поле обзора по прямой от Эзалора. Поле дает летающий обзор в радиусе 375 единиц и длится 10,34 секунды. Первое поле появляется в 150 единицах перед Эзалором. Следующие появляются в 150 единицах от предущих полей. Поля обзора создаются с интервалом в 0,5 секунды спустя 0,5 секунды после начала прочтения, создавая 3\/5\/7\/9 полей. При отмене произнесения поля перестаются появляться. Это не влияет на дальность прохождения волны. При полном произнесении все поля обзора вместе достигают длины до 825\/1125\/1425\/1725 единиц.","Лошади появляются только в случае, если способность произносилась всю длительность в 2\/3\/4\/5 секунд, и имеют только визуальное значение.","Бафф Spirit Form дается Aghanim's Scepter. Он имеет лишь визуальное значение и ни за что не отвечает."],"mana":"150\/160\/170\/180","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"10","name":"Illuminate","description":["Анимация применения: 0,3+0","Дальность применения: 1800 ( 2150)","Дистанция прохождения: 1550 ( 1900)","Радиус волны: 375","Время подготовки: 2\/3\/4\/5","Урон\/лечение за секунду: 100","Максимальный урон: 200\/300\/400\/500 ( 400\/500\/600\/700)","Макс. лечение: 0 ( 200\/300\/400\/500, 400\/500\/600\/700)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Высвободить энергию преждевременно.","effects":["Способность Ненаправленная"],"notes":["Заменяет Illuminate до завершения произнесения.","При использовании прерывает произносимые способности Keeper of the Light."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Release Illuminate","description":["Анимация применения: 0+0"],"hot_key":"Q","legacy_key":"T"},{"spell":"Создает вспышку ослепительного света в указанной области, отталкивая и ослепляя всех врагов, заставляя их промахиваться при атаках.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Отталкивает юнитов назад со скоростью в 875 единиц. Дистанция отталкивания всегда равна 350 единицам, не важно, как далеко находился юнит от центра применения.","Юниты не обезвреживаются в момент отталкивания. Они могут поворачиваться, атаковать, использовать способности и предметы. Произнесение способностей не прерывается.","Может отталкивать юнитов на непроходимую территорию. Цели ломают деревья в радиусе 150 единиц от места приземления."],"mana":"100\/125\/150\/175","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"30\/25\/20\/15","name":"Blinding Light","description":["Анимация применения: 0,3+1,07","Дальность применения: 550\/600\/650\/700 ( 900\/950\/1000\/1050)","Радиус: 600","Дистанция отталкивания: 350","Урон: 50\/100\/150\/200","Шанс промаха: 70%","Длительность отталкивания: 0.4","Длительность промахов: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"B"},{"spell":"Восполняет ману и уменьшает перезарядку всех способностей, находящихся на перезарядке.","effects":["Способность Направленная на юнита","Действует на Союзников"],"notes":["Уменьшает перезарядку любой способности, включая пассивные, но исключая ультимативную."],"mana":"0","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Chakra Magic","description":["Анимация применения: 0,3+1","Дальность применения: 900 ( 1250)","Восстановление маны: 80\/160\/240\/320 ( 380\/460\/540\/620)","Уменьшение текущей перезарядки: 3\/4\/5\/6"],"hot_key":"E","legacy_key":"C"},{"spell":"Призывает в указанную область блуждающий огонёк, который мерцает каждую секунду. В активном состоянии он гипнотизирует всех врагов поблизости и заставляет их смотреть на него. Дух умирает от нескольких атак, и его могут атаковать существа вне радиуса действия.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Огонёк начинает мерцать спустя 1 секунду после применения, а затем каждые 3.15 секунды, срабатывая до 3\/4\/5 ( 5\/6\/7) раз.","При мерцании гипнотизирует всех врагов в области, приравнивая их скорость передвижения к 25, заставляя двигаться к огоньку и запрещая действия.","Учитывает атаки только героев (включая клонов, но исключая иллюзии).","При применении разрушает деревья в радиусе действия."],"mana":"200\/300\/400","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"120","name":"Will-O-Wisp","description":["Анимация применения: 0,1+1,27","Дальность применения: 900 ( 1250)","Радиус: 675","Атак для разрушения: 4\/5\/6 ( 5\/6\/7)","Скорость передвижения в гипнозе: 25","Число вспышек: 3\/4\/5 ( 5\/6\/7)","Базовая задержка: 1","Длительность бездействия: 1.85","Длительность активности: 1.3","Длительность огонька: 9.35\/12.5\/15.65 ( 15.65\/18.8\/21.95)"],"hot_key":"R","legacy_key":"R"}],"bio":"На бледном жеребце скачет, мчит на защиту света искра бессчётных солнц, Эзалор. Давным-давно он покинул предвечный мир, отделившись от других древних сил, с которыми был связан великой Первородной гармонией. Он — энергия, что обрела сознание на заре времён. Ныне он скачет по всем мирам, на шаг опережая преследующий его хаос, и несёт свой дар на конце лучезарного посоха. Истинно величавые черты его сокрыты за обличьем ветхого старца, что еле держится в седле. Однако стоит ему столкнуться с хаосом или силами тьмы, взрывается он первородным светом, являя полную свою мощь и вновь преображаясь в силу, с которой стоит считаться.","talentsTips":["Талант на дальность применения также действует на максимальную дальность применения Illuminate.","Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.","Талант на сопротивление магии увеличивает сопротивление магии Keeper of the Light до 55%."],"trivia":["Дизайн героя имеет несколько отсылок к персонажу Гэндальф, из кинотрилогии Властелин Колец. Его одежда, а также лошадь практически идентичны Гэндальфу и его коню Серогриву. Наблюдается схожесть в анимации заклинания Illuminate (такой-же эффект лошадей был в воде в фильме \"Властелин Колец: Братство Кольца\") Реплика *Играть You shall not cast!* имеет отсылку на фразу Гэндальфа \"You shall not pass!\" (рус. Ты не пройдешь!), в фильме \"Властелин Колец: Братство кольца\" Реплика *Играть Ezalor...I think that's my name* также ссылается на реплику Гэндальфа: \"Gandalf? ... Yes ... That was my name ... Gandalf the Grey.\" (рус. Гэндальф?...Да...Так меня звали. Гэндальф Серый.)"],"talents":["+200 к урону\/лечению от Illuminate:+2 срабатывания Will-O-Wisp","+300 к мане от Chakra Magic:+40% к сопротивлению магии","+350 к дальности способностей:+1 атака для уничтожения Will-O-Wisp","+25 к скорости передвижения:+30% к получаемому опыту"],"tips":["Во время применения Illuminate - она убирает туман войны, что может быть часто использован на опасной территории во избежание внезапного нападения врагов. Помните, что чем дольше заклинание будет произноситься, тем больше области оно покажет; мгновенное наложение заклинания может не сильно помочь для этих целей.","Общеизвестная эффективность Illuminate для убийства крипов делает героя исключительно хорошим золотодобытчиком для героя поддержки. Как следствие, у него всегда хватает денег на варды, и он должен интенсивно их проставлять; что, в свою очередь, даст обзор для успешного применения Illuminate против вражеских героев.","Хотя Illuminate чрезвычайно хорош для добычи золота и нанесения урона противникам в начальной игре, оно может нарушить нормальную добычу золота для вашего партнера на линии; так что старайтесь использовать его только для нанесения урона вражеским героям. Благодаря способности восстанавливать свою ману, Illuminate может использоваться постоянно; но восстановление маны очень часто может пригодиться для партнера на линии.","Использование Mana Leak, а после Illuminate на противнике заставит их выбирать между потерей маны и получением урона, в зависимости от того, выберут ли они движение или останутся на месте.","Помните что вы являетесь героем поддержки. Отдавая очки в Illuminate может послужить хорошим выбором в пользу урона, а также в качестве потенциала для пуша. Однако, эта способность сделает вас легкой добычей в случае нападения противника. Если в ваши планы не входит основательный пуш на ранней стадии игры - сделайте выбор на вложении очков в Chakra Magic, поскольку способность также принесет много пользы в начале. Если вы стоите на линии одни, то можно часто использовать Illuminate: таким образом герой будет убивать крипов зарабатывая золото, и отпугивать противников.","Keeper of the Light очень эффективен в качестве поддержки тем героям, у которых очень мало маны в начальной стадии игры. В этом случае, Keeper of the Light должен прокачивать Chakra Magic, чтобы постоянно поддерживать количество маны у союзника, пока тот в свою очередь - использует ману для нанесения урона противникам на линии.","При наличии героя Night Stalker постарайтесь обойтись без Aghanim's Scepter. Благодаря ультимейту Darkness, вы не сможете лечить союзников способностью Illuminate и иметь беспрепятственный обзор, так как будет ночь."],"desc":"Keeper of the Light — это герой с дальним типом атаки, основной характеристикой которого является Интеллект. Данный герой больше всего относится к роли Поддержки - благодаря своим способностям у героя будет всегда в наличии достаточно золота. Так, способностью Illuminate герой создает шар, которая накапливает силу. Как только шар прервется - маг выпускает бело-призрачную волну лошадей, которые наносят урон всем противникам на пути. Данной способностью можно отлично отпугивать вражеских героев, а также получать золото, убивая крипов. Chakra Magic - очень полезная способность, как вам, так и вашим союзникам. Данная способность мгновенно восстанавливает часть маны цели. Способность Blinding Light отталкивает противников, попавших в радиус действия, и вынуждает промахиваться. Идеальная способность, чтобы оттолкнуть противника от вас или от вашего союзника. Ультимативная способность Will-O-Wisp призывает мерцающий блуждающий огонек, завораживающий противников."}