{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Tusk_Ice_Shards_1.mp3\/revision\/latest?cb=20191216025612",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Осколки дают летающий обзор в радиусе 100 и движутся со скоростью 1200 до достижения выбранной точки. Обзор длится 2 секунды после достижения выбранной точки.",
        "Обзор длится 2 секунды после достижения выбранной точки.",
        "Ледяные осколки всегда появляются в одном и том же порядке. Осколки размещены по полукругу с радиусом в 200 единиц, центром которого является расстояние в 200 единиц до выбранной точки. Первый осколок всегда появляется в выбранной точке, поэтому он всегда будет на одной линии с позицией Tusk при использовании заклинания. Следующие осколки располагаются под углом в 40° друг к другу, появляясь в количестве 6 штук. 9 осколков создали бы полный круг. Поэтому незавершенная часть круга всегда расположена по направлению к месту применения заклинания Tusk. Радиус столкновения осколков равен 67, расстояние между ними - 6, поэтому между осколками пройти нельзя. При улучшении от Aghanim's Shard появляется 4 дополнительных осколка, которые располагаются слева и справа от открытой части полукруга, образуя букву U. Образовавшаяся фигура имеет ширину в 200 и длину в 480. Увеличивает длину барьера Ice Shards на 280 от конца обычного полукруга.",
        "Осколки размещены по полукругу с радиусом в 200 единиц, центром которого является расстояние в 200 единиц до выбранной точки.",
        "Первый осколок всегда появляется в выбранной точке, поэтому он всегда будет на одной линии с позицией Tusk при использовании заклинания.",
        "Следующие осколки располагаются под углом в 40° друг к другу, появляясь в количестве 6 штук. 9 осколков создали бы полный круг.",
        "Поэтому незавершенная часть круга всегда расположена по направлению к месту применения заклинания Tusk.",
        "Радиус столкновения осколков равен 67, расстояние между ними - 6, поэтому между осколками пройти нельзя.",
        "При улучшении от Aghanim's Shard появляется 4 дополнительных осколка, которые располагаются слева и справа от открытой части полукруга, образуя букву U. Образовавшаяся фигура имеет ширину в 200 и длину в 480. Увеличивает длину барьера Ice Shards на 280 от конца обычного полукруга.",
        "Образовавшаяся фигура имеет ширину в 200 и длину в 480.",
        "Увеличивает длину барьера Ice Shards на 280 от конца обычного полукруга.",
        "Существа, которые не контролируются игроками, не пытаются обойти осколки, а просто упираются в них. То есть так можно останавливать существ, пока они не поменяют направление (например, их что-либо спровоцирует).",
        "То есть так можно останавливать существ, пока они не поменяют направление (например, их что-либо спровоцирует).",
        "При улучшении от Aghanim's Shard создаются две ауры с радиусом 200 на большой полуоси фигуры. Первый источник находится в центре обычного построения осколков, на расстоянии в 200 от точки применения. Второй источник находится на расстоянии в 200 позади первого источника между 4 дополнительными осколками. Так как источники перекрывают друг друга, ауры покрывают длину в 600. Урон в секунду и замедление скорости передвижения накладываются аурами. Задержка эффекта составляет 0,5 секунды. Наносит урон с интервалом в 1 секунду, начиная спустя 1 секунду после наложения эффекта, срабатывая до 4\/5\/6\/7 раз. Может нанести до 240\/300\/360\/420 (до уменьшений) одному существу, если он находился под действием ауры всю её длительность.",
        "Первый источник находится в центре обычного построения осколков, на расстоянии в 200 от точки применения.",
        "Второй источник находится на расстоянии в 200 позади первого источника между 4 дополнительными осколками.",
        "Так как источники перекрывают друг друга, ауры покрывают длину в 600.",
        "Урон в секунду и замедление скорости передвижения накладываются аурами. Задержка эффекта составляет 0,5 секунды.",
        "Наносит урон с интервалом в 1 секунду, начиная спустя 1 секунду после наложения эффекта, срабатывая до 4\/5\/6\/7 раз.",
        "Может нанести до 240\/300\/360\/420 (до уменьшений) одному существу, если он находился под действием ауры всю её длительность."
      ],
      "mana": "23\/20\/17\/14 (TagTalent 17\/14\/11\/8)",
      "item_behaviour": [],
      "name": "Ice Shards",
      "cooldown": "100",
      "description": "Герой сжимает осколки льда в шар холодной энергии, который наносит урон всем задетым врагам. Когда шар достигнет точки назначения, осколки высвободятся, создавая барьер на 4\/5\/6\/7 сек.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,1+0",
        "Дальность применения:  1800",
        "Радиус урона: 200",
        "Радиус появления осколков: 200",
        "Угол появления осколков: 40°",
        "Число осколков: 7 ( 11)",
        "Урон: 75\/150\/225\/300",
        "Длительность осколков: 4\/5\/6\/7",
        "Урон в секунду: 60",
        "Замедление скорости передвижения: 40%",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "E",
      "story": "Когда заходит последнее осеннее солнце, морозная тундра у Барьера леденеет с тревожной быстротой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Snowball_1.mp3\/revision\/latest?cb=20191216025616",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Снежный ком движется со скоростью в 625\/650\/675\/700 и может двигаться в течение 3 секунд. Расстояние, которое может преодолеть снежный ком, может достигать до 1875\/1950\/2025\/2100 единиц.",
        "Расстояние, которое может преодолеть снежный ком, может достигать до 1875\/1950\/2025\/2100 единиц.",
        "Снежный ком разрушает деревья в пределах своего радиуса при движении. Радиус увеличивается на 40 в секунду сразу же после начала движения, составляя 240\/280\/320 каждую секунду.",
        "Радиус увеличивается на 40 в секунду сразу же после начала движения, составляя 240\/280\/320 каждую секунду.",
        "Нажатие ПКМ по союзнику или клону добавляет его в снежный шар. Союзники таким же образом могут самостоятельно залезать в ком. Может забирать невидимых или неуязвимых союзников. Не захватывает союзников с опцией ☐ Помощь выключена от Tusk. Союзников, затронутых Black Hole, Chronosphere или Flaming Lasso, нельзя поместить в ком. При этом попытка поместить затронутого союзника все равно добавит Snowball урона.",
        "Может забирать невидимых или неуязвимых союзников.",
        "Не захватывает союзников с опцией ☐ Помощь выключена от Tusk.",
        "Союзников, затронутых Black Hole, Chronosphere или Flaming Lasso, нельзя поместить в ком.",
        "При этом попытка поместить затронутого союзника все равно добавит Snowball урона.",
        "Только союзные герои (включая клонов) увеличивают урон. Остальные существа урона не добавляют. Иллюзии не считаются за героев. Может забирать призываемых существ, иллюзии и крипов-героев, но не варды.",
        "Может забирать призываемых существ, иллюзии и крипов-героев, но не варды.",
        "Существа внутри кома неуязвимы, спрятаны и имеют иммунитет к заклинаниям. Союзники в коме также обезвреживаются. Сам Tusk лишь заглушается и обезоруживается, что позволяет ему использовать заклинания, но не атаковать или использовать предметы.",
        "Сам Tusk лишь заглушается и обезоруживается, что позволяет ему использовать заклинания, но не атаковать или использовать предметы.",
        "Сам Tusk не может покинуть Snowball, в то время как другие существа могут это сделать с помощью заклинаний телепортации без снижения урона кома.",
        "Как только Snowball соприкасается с целью, Tusk получает приказ атаковать её. То есть Tusk все равно будет атаковать цель, даже если в настройках игрока опция автоатаки отключена.",
        "То есть Tusk все равно будет атаковать цель, даже если в настройках игрока опция автоатаки отключена.",
        "Snowball сначала применяет дебафф, затем наносит урон.",
        "Здесь указано, сколько урона нанесет Snowball (до уменьшений) с определенным количеством героев внутри (учитывая Tusk): 1 герой: 105\/190\/275\/360 (TagTalent 225\/310\/395\/480) урона. 2 героя: 130\/240\/350\/460 (TagTalent 250\/360\/470\/580) урона. 3 героя: 155\/290\/425\/560 (TagTalent 275\/410\/545\/680) урона. 4 героя: 180\/340\/500\/660 (TagTalent 300\/460\/620\/780) урона. Tusk не считается при подсчёте, поэтому если союзники не были добавлены в снежный ком, то способность нанесёт только базовый урон.",
        "1 герой: 105\/190\/275\/360 (TagTalent 225\/310\/395\/480) урона.",
        "2 героя: 130\/240\/350\/460 (TagTalent 250\/360\/470\/580) урона.",
        "3 героя: 155\/290\/425\/560 (TagTalent 275\/410\/545\/680) урона.",
        "4 героя: 180\/340\/500\/660 (TagTalent 300\/460\/620\/780) урона.",
        "",
        "Tusk не считается при подсчёте, поэтому если союзники не были добавлены в снежный ком, то способность нанесёт только базовый урон.",
        "Дебафф modifier_tusk_snowball_visible дает общий обзор на цель до остановки Snowball. Не дает эффект True Sight."
      ],
      "mana": "21\/19\/17\/15 (TagTalent 13\/11\/9\/7)",
      "item_behaviour": [],
      "name": "Snowball",
      "cooldown": "75",
      "description": "Герой заворачивается в снежный ком. Союзников в радиусе 350 также можно поместить в ком, нажав на них правой кнопкой мыши, даже если ком уже движется. После запуска все враги на пути кома будут оглушены и получат урон. Чем больше в коме союзных героев, тем больше урон от него.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,1+0,5",
        "Дальность применения:  1150",
        "Радиус урона и оглушения: 200",
        "Увеличение радиуса в секунду: 40",
        "Радиус сбора: 350",
        "Макс. время простоя: 3",
        "Макс. длительность преследования: 3",
        "Базовый урон: 80\/140\/200\/260 ( 200\/260\/320\/380)",
        "Урона за героя: 25\/50\/75\/100",
        "Скорость кома: 625\/650\/675\/700",
        "Длительность оглушения: 0,8\/1\/1,2\/1,4"
      ],
      "legacy_key": "W",
      "story": "О приёме, завершившем великую потасовку на Белоснежных полях, до сих пор ходят легенды."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "notes": [
        "Заменяет Snowball до достижения комом цели или завершения длительности.",
        "Tusk может использовать Ice Shards, Tag Team, Walrus Kick и переключать Автоприменение Walrus PUNCH! во время запуска, в то время как остальные существа не могут использовать заклинания."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Launch Snowball",
      "cooldown": null,
      "description": "Запускает снежный ком в сторону цели.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0"
      ],
      "legacy_key": "W",
      "story": "Вперед, в белые пустоши!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Tusk_Tag_Team_1.mp3\/revision\/latest?cb=20191216025619",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Tusk.",
        "Дает Tusk временную ауру. Её дебафф задерживается на 0,5 секунды.",
        "Атаки под эффектом Tag Team сначала накладывают замедление, затем добавляют урон к атаке.",
        "Дополнительный урон срабатывает только на атаки союзных героев (включая иллюзии и клонов, исключая крипов-героев) и любые атаки подконтрольных Tusk существ. Дополнительный урон добавляется напрямую существу, которое спровоцировало действие ауры, и наносится одним нанесением урона вместе с уроном от атаки, а также считается уроном от атаки. Урон непосредственно добавляется к урону от атаки существа, поэтому он учитывается вампиризмом, критическим и прорубающим ударом. Но при этом урон добавляется в качестве дополнительного, поэтому иллюзии его не используют, а любые бонусы или снижения, использующие процентное значение, его не учитывают.",
        "Дополнительный урон добавляется напрямую существу, которое спровоцировало действие ауры, и наносится одним нанесением урона вместе с уроном от атаки, а также считается уроном от атаки.",
        "Урон непосредственно добавляется к урону от атаки существа, поэтому он учитывается вампиризмом, критическим и прорубающим ударом.",
        "Но при этом урон добавляется в качестве дополнительного, поэтому иллюзии его не используют, а любые бонусы или снижения, использующие процентное значение, его не учитывают.",
        "Замедление от нескольких атак складывается, каждый раз накладывая отдельный дебафф."
      ],
      "mana": "24\/21\/18\/15",
      "item_behaviour": [],
      "name": "Tag Team",
      "cooldown": "70",
      "description": "Временно даёт герою ауру, в которой атаки замедляют передвижение врагов и наносят им дополнительный физический урон. Действует секунд.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 350",
        "Доп. урон: 20\/45\/70\/95",
        "Замедление скорости передвижения: 75%",
        "Длительность замедления: 0,5",
        "Время действия ауры: 5",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "T",
      "story": "Даже вдали от Кобальта кости Бивня полны прохлады Барьера."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3b\/Tusk_Walrus_Kick.mp3\/revision\/latest?cb=20191216025621",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "В отличии от Walrus PUNCH! способность Walrus Kick не активный модификатор атаки.",
        "Может выбрать в качестве цели любое вражеское существо, включая курьеров, исключая постройки и варды. Однако при применении на Рошана не отпинывает цель, хотя все остальные эффекты, включая урон по области при приземлении, применяются нормально. Walrusk Kick имеет перезарядку в 6 сек., если была применена на крипа. Сочетается мультипликативно с другими источниками уменьшения перезарядки.",
        "Однако при применении на Рошана не отпинывает цель, хотя все остальные эффекты, включая урон по области при приземлении, применяются нормально.",
        "Walrusk Kick имеет перезарядку в 6 сек., если была применена на крипа. Сочетается мультипликативно с другими источниками уменьшения перезарядки.",
        "Сочетается мультипликативно с другими источниками уменьшения перезарядки.",
        "Цель отлетает от Tusk по дуге длиной в 1400 единиц и высотой в 360. Walrus Kick не может быть перезаписана другими источниками принудительного движения. Пока цель в воздухе, остальные существа могут под ним проходить.",
        "Walrus Kick не может быть перезаписана другими источниками принудительного движения.",
        "Пока цель в воздухе, остальные существа могут под ним проходить.",
        "По приземлению в конечную точку также наносится 350 урона существам в радиусе 250 от места приземления. Этот урон не наносится самой цели заклинания.",
        "Этот урон не наносится самой цели заклинания.",
        "Замедление длится 5 сек., но так как оно накладывается при применении, то эффективная длительность замедления равна 4 секундам.",
        "Walrus Kick сначала применяет замедление, затем откидывает противника, затем наносит урон.",
        "Во время отбрасывания разрушает деревья в радиусе 100 единиц от выбранного существа."
      ],
      "mana": "12",
      "item_behaviour": [],
      "name": "Walrus Kick",
      "cooldown": "100",
      "description": "Герой пинает ближайшего врага в указанном направлении, нанося ему урон и оглушая его. Также урон получают все герои в радиусе вокруг точки приземления. Перезарядка вдвое меньше, если пнуть крипа.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+1,3",
        "Дальность применения:  250",
        "Урона при приземлении: 250",
        "Дальность пинка: 1400",
        "Урон: 350",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 4",
        "Длительность оглушения: 1",
        "Снижение перезарядки при применении на крипа: 50%"
      ],
      "legacy_key": "D",
      "story": "Может, Имир и прославился своими кулаками, но мудрый противник опасается любых его конечностей."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Tusk_Walrus_PUNCH%21.mp3\/revision\/latest?cb=20191216025622",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов"
      ],
      "notes": [
        "Дальность применения Walrus PUNCH! всегда равна дальности атаки заклинателя. Дальность применения можно увеличить другими бонусами к дальности атаки, но не бонусами к дальности применения. И Автоприменение, и ручное применение используют текущую дальность атаки Tusk.",
        "Дальность применения можно увеличить другими бонусами к дальности атаки, но не бонусами к дальности применения.",
        "И Автоприменение, и ручное применение используют текущую дальность атаки Tusk.",
        "Walrus PUNCH! не может промахнуться из-за уклонения или ослепления. Несмотря на то, что эта способность - активный модификатор атаки, на Walrus PUNCH! срабатывают все эффекты, реагирующие на применение, как на обычное заклинание. Можно применить на всех, за исключением вардов, строений, союзников и существ под контролем Tusk. Можно использовать на Рошана, но к нему применятся только оглушение и замедление.",
        "Несмотря на то, что эта способность - активный модификатор атаки, на Walrus PUNCH! срабатывают все эффекты, реагирующие на применение, как на обычное заклинание.",
        "Можно применить на всех, за исключением вардов, строений, союзников и существ под контролем Tusk.",
        "Можно использовать на Рошана, но к нему применятся только оглушение и замедление.",
        "Жертва закручивается в воздухе на 650 единиц (1200, если удар был смертельным) на длительность оглушения. Скорость адаптируется к измененной длительности оглушения. Walrus PUNCH! не может быть прервана другими источниками принудительного движения, поднимающих цель вверх.",
        "Walrus PUNCH! не может быть прервана другими источниками принудительного движения, поднимающих цель вверх.",
        "Пока цель в воздухе, остальные существа могут под ним проходить.",
        "Замедление длится 3\/4\/5 (TagTalent 3,5\/4,5\/5,5) сек., но так как оно накладывается при применении, то эффективная длительность замедления равна 2\/3\/4 сек. после первой секунды оглушения цели.",
        "Walrus PUNCH! сначала применяет подбрасывание жертвы, затем замедление, затем наносит урон.",
        "Поскольку этот урон просто критический, он может быть прорубающим и Tusk получает лечение от вампиризма.",
        "Проигрывает звук при начале атаки. Звук завершится только после попадания удара.",
        "При выборе таланта на 25-ом уровне Walrus PUNCH! текущего уровня сможет пассивно сработать при обычной атаке с шансом 12%. Срабатывание не зависит от перезарядки, не активирует её и может сработать при активном таймере. Также срабатывание не расходует ману и не провоцирует срабатывание эффектов, реагирующих на применение. Пассивные срабатывания используют псевдослучайное распределение. Если способность пассивно срабатывает, когда Автоприменение было включено, или применении вручную, то перезарядка не начинается и мана не расходуется. В среднем увеличивает урон Tusk на 24%\/30%\/36% (TagTalent 33%\/39%\/45%) от каждой атаки.",
        "Срабатывание не зависит от перезарядки, не активирует её и может сработать при активном таймере.",
        "Также срабатывание не расходует ману и не провоцирует срабатывание эффектов, реагирующих на применение.",
        "Пассивные срабатывания используют псевдослучайное распределение.",
        "Если способность пассивно срабатывает, когда Автоприменение было включено, или применении вручную, то перезарядка не начинается и мана не расходуется.",
        "В среднем увеличивает урон Tusk на 24%\/30%\/36% (TagTalent 33%\/39%\/45%) от каждой атаки."
      ],
      "mana": "20\/15\/10",
      "item_behaviour": [],
      "name": "Walrus PUNCH!",
      "cooldown": "75",
      "description": "Герой совершает свой коронный удар — настолько мощный, что подбрасывает жертву в воздух, нанося ей критический урон. После приземления жертва будет замедлена.",
      "hot_key": "R",
      "params": [
        "Дальность применения:  150",
        "Ускорение анимации атаки: 40%",
        "Критический урон: 300%\/350%\/400% ( 375%\/425%\/475%)",
        "Замедление скорости передвижения: 40%",
        "Длительность замедления: 2\/3\/4",
        "Длительность оглушения: 1 ( 1,5)",
        "Шанс срабатывания: 12%"
      ],
      "legacy_key": "R",
      "story": "Неважно, кто ударил первым. Важно, кто ударил последним."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.9,
    "attrStrength": 23.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Снежным комом врывается во врагов, оглушая их Tusk никогда не против затеять драку. Он отрезает врагам путь к отступлению стеной ледяных осколков, собирает союзников в гигантский снежный ком и влетает в нём в противников, завершая комбинацию фирменным сногсшибательным ударом.  Инициация Контроль Быстрый урон ★☆☆",
  "history": "Славная была потасовка! После нее в таверне «Волчья дыра» на ногах остался стоять лишь Имир — он же Бивень, он же Ужас из Барьера, он же Снежный ком из Кобальта и единственный, кому удалось одолеть одного небезызвестного вышибалу с иглами на спине. Все началось с безобидного спора «кто кого?», что не редкость среди завсегдатаев заведений подобного рода. В итоге у трактирщика не осталось ни одной целой бутылки, кувшина или стула, а в глубокий нокаут отправились четверо здешних постояльцев, один кузнец и шестеро лучших вояк Морозной дружины. Созерцая эту картину, Имир провозгласил громкий тост в свою честь и осушил кружку хмельного. Как только проигравшие пришли в себя, тут же начали требовать реванша и ставок повыше. Имиру это было лишь в радость, вот только он сомневался, что у этих бедолаг еще что-то осталось из наличности. Видя весь этот погром и пытаясь любым способом предотвратить очередной дебош, трактирщик пошел на хитрость. Поскольку Имир, несмотря на свои отменные боевые качества, никогда не участвовал в реальной битве, не ведал хаоса, творящегося на поле брани, и не знал, какой неразборчивой порой бывает смерть, трактирщик предложил ему новое пари: принять участие в самом масштабном сражении, неважно за какую сторону, при этом выжить и разгромить врага. Ну а что на кону? Конечно же, добротная порция выпивки за счет заведения."
}