{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/89\/Force_Staff_Force.mp3\/revision\/latest?cb=20191227195419",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "Pushes the target at a speed of 1200.",
        "The target is not disabled during the push, so they still can cast spells or items, attack and turn during the push. This means it does not cancel channeling spells of the target. However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "This means it does not cancel channeling spells of the target.",
        "However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "Does not push the target if they are affected by Black Hole, Chronosphere, Duel, or Flaming Lasso.",
        "Cannot push the target through Kinetic Fields or Arenas of Blood.",
        "If the target is affected by Soulbind, it cannot push them further than its max stretch distance allows.",
        "If the target is leashed by Pounce, the leash gets instantly broken upon cast. However, if the target gets leashed after cast, it cannot push them further than the max stretch distance of Pounce allows.",
        "However, if the target gets leashed after cast, it cannot push them further than the max stretch distance of Pounce allows.",
        "Cannot be cast on wards or buildings. Can be cast on Homing Missiles.",
        "Can move the target over impassable terrain. Trees within 100 radius around them get destroyed during the push.",
        "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement.",
        "Shares cooldown with Hurricane Pike. Does not share cooldown with Force Boots."
      ],
      "mana": "100",
      "abilityName": "Force",
      "cooldown": "23",
      "description": "Pushes any target unit 600 units in the direction it is facing.",
      "params": [
        "Cast Range (Ally\/Self): 550",
        "Cast Range (Enemy): 850",
        "Push Distance: 600",
        "Push Duration: 0.5",
        "Can be cast on self while spell immune. Cannot be cast on other spell immune units."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 2.5 health regen, 120 mana and 0.5 mana regen.",
    "For agility heroes, it grants 2.5 health regen, 120 mana and 0.5 mana regen.",
    "For intelligence heroes, it grants 2.5 health regen, 120 mana, 0.5 mana regen and 10 attack damage."
  ],
  "cost": "2175",
  "lore": null,
  "consistFrom": [
    "Staff of Wizardry",
    "Ring of Regen",
    "Recipe"
  ],
  "boughtFrom": "Magical",
  "name": "Force Staff",
  "description": "Allows you to manipulate others, for good or evil.",
  "trivia": [
    "Crystal Maiden's cosmetic item, Force Staff, is based on Force Staff and shares its name."
  ],
  "upgradeIn": [
    "Hurricane Pike"
  ],
  "bonuses": [
    "+10 Intelligence",
    "+2.5 Health Regeneration"
  ],
  "tips": [
    "This is an overall good and cheap utility item for saving allies and messing up enemy positioning.",
    "Force can push units over cliffs and through trees, making it a great chasing or escaping item.",
    "It is also good for countering Heroes that can make impassable barriers, such as Earthshaker, Clockwerk or Nature's Prophet.",
    "Unlike Blink Dagger, the item is not disabled when receiving damage, allowing for both initiation and escape (but the distance is shorter). And it can be upgraded into an hurricane pike even for melee heroes late game to get extra stats compared to the blink dagger.",
    "Force Staff is the cheapest item to disable a Linken's Sphere allowing you to use more powerful spells like Hex from a Scythe of Vyse and\/or Soul Rend from Bloodthorn.",
    "When chasing enemies, the Force Staff can be used to chase down enemies easily and disable them although one should use it with extreme caution."
  ]
}