{
  "abilities": [
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Inner Fire сначала наносит урон, затем применяет дебафф.",
        "Обезоруживание применяется одновременно с отталкиванием, а не после него. Враги во время отталкивания не обезвреживаются, поэтому могут свободно действовать, но не атаковать или передвигаться. Может оттолкнуть существ на непроходимую территорию. Любые деревья, с которым сталкиваются существа, разрушаются. Не может оттолкнуть Рошана, но наносит ему урон и обезоруживает.",
        "Враги во время отталкивания не обезвреживаются, поэтому могут свободно действовать, но не атаковать или передвигаться.",
        "Может оттолкнуть существ на непроходимую территорию. Любые деревья, с которым сталкиваются существа, разрушаются.",
        "Не может оттолкнуть Рошана, но наносит ему урон и обезоруживает.",
        "У отталкивания нет фиксированной дистанции. Оно толкает каждого врага в радиусе 400, пока они не достигнут расстояния в 400 от точки применения. Длительность отталкивания всегда равна 1, поэтому скорость варьируется между 0 и 400 в зависимости от расстояния.",
        "Длительность отталкивания всегда равна 1, поэтому скорость варьируется между 0 и 400 в зависимости от расстояния.",
        "Если враг находится дальше, чем в 400, но меньше, чем 500, то дальность и скорость отталкивания будут равняться [Нужна информация].",
        "C Aghanim's Shard Inner Fire замедляет врагов, восстанавливает Huskar здоровье в зависимости от нанесённого способностью урона и убирает анимацию применения. По-прежнему прерывает использование прерываемых способностей Huskar при применении. Можно использовать под действием оглушения, урагана, сна, провокации, исчезновения или во время принудительного движения. Способность также нельзя использовать под действием безмолвия, проклятия или обезвреживания. После получения Aghanim's Shard эту способность нельзя добавить в ⇧ Shift-очередь. Обезоруживание также отвечает за замедление скорости передвижения. Урон и исцеление работают независимо друг от друга, то есть Huskar восстанавливает полные 50% здоровья независимо от того, сколько урона получают враги. Лечит на следующее количество здоровья за каждого пораженного героя (включая иллюзии и клонов, исключая крипов-героев) и 12\/18\/24\/30 здоровья за каждое пораженное существо, не являющегося героем. 1 Герой: 60\/90\/120\/150 здоровья. 2 героя: 120\/180\/240\/300 здоровья. 3 героя: 180\/270\/360\/450 здоровья. 4 героя: 240\/360\/480\/600 здоровья. 5 героев: 300\/450\/600\/750 здоровья.",
        "По-прежнему прерывает использование прерываемых способностей Huskar при применении.",
        "Можно использовать под действием оглушения, урагана, сна, провокации, исчезновения или во время принудительного движения.",
        "Способность также нельзя использовать под действием безмолвия, проклятия или обезвреживания.",
        "После получения Aghanim's Shard эту способность нельзя добавить в ⇧ Shift-очередь.",
        "Обезоруживание также отвечает за замедление скорости передвижения.",
        "Урон и исцеление работают независимо друг от друга, то есть Huskar восстанавливает полные 50% здоровья независимо от того, сколько урона получают враги.",
        "Лечит на следующее количество здоровья за каждого пораженного героя (включая иллюзии и клонов, исключая крипов-героев) и 12\/18\/24\/30 здоровья за каждое пораженное существо, не являющегося героем. 1 Герой: 60\/90\/120\/150 здоровья. 2 героя: 120\/180\/240\/300 здоровья. 3 героя: 180\/270\/360\/450 здоровья. 4 героя: 240\/360\/480\/600 здоровья. 5 героев: 300\/450\/600\/750 здоровья.",
        "1 Герой: 60\/90\/120\/150 здоровья.",
        "2 героя: 120\/180\/240\/300 здоровья.",
        "3 героя: 180\/270\/360\/450 здоровья.",
        "4 героя: 240\/360\/480\/600 здоровья.",
        "5 героев: 300\/450\/600\/750 здоровья.",
        ""
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "item_behaviour": [],
      "name": "Inner Fire",
      "cooldown": "75\/100\/125\/150",
      "description": "Огненная ярость героя отталкивает всех врагов неподалёку на определённое расстояние, наносит им урон и накладывает на них бессилие.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,64 ( 0+0)",
        "Радиус: 500",
        "Урон: 120\/180\/240\/300",
        "Макс. дистанция отталкивания: 400",
        "Длительность отталкивания: 1",
        "Длительность обезоруживания: 1,75\/2,5\/3,25\/4 ( 2,5\/3,25\/4\/4,75)",
        "Здоровья за урон герою: 50%",
        "Здоровья за урон не-герою: 10%",
        "Замедление скорости передвижения: 40%"
      ],
      "legacy_key": "V",
      "story": "Даже плоть самого Хускара не способна сдержать переполняющую его жизненную силу."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f9\/Huskar_Burning_Spear_1.mp3\/revision\/latest?cb=20191216014116",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Расход здоровья напрямую отнимает здоровье и не может убить заклинателя.",
        "Если активировано Автоприменение, то использует дальность атаки Huskar в 400 единиц. Ручное применение использует дальность применения в 450 единиц.",
        "Эффекты от этой способности складываются при нескольких использований на цель. Каждая атака размещает на цель дебафф Burning Spear Debuff. Число атак отображается и складывается в одной иконке в полосе состояния атакуемого врага. Число в иконке отображает количество зарядов. Оно видно всем. Длительность каждой атаки не зависит от других зарядов. Они не продляются и не обновляются от новых зарядов. Модификатор дебаффа размещается один раз и обновляется при успешных применениях. Дебафф наносит урон равный 5\/10\/15\/20 (TagTalent 9\/14\/19\/24) единиц урона за каждый заряд спустя 1 секунду после размещения дебаффа. Урон определяется уровнем заклинаниям при размещении Burning Spear Counter. Поэтому применение новых зарядов с большим значением урона при действии на цель старых зарядов будет использовать старое значение.",
        "Каждая атака размещает на цель дебафф Burning Spear Debuff.",
        "Число атак отображается и складывается в одной иконке в полосе состояния атакуемого врага.",
        "Число в иконке отображает количество зарядов. Оно видно всем.",
        "Длительность каждой атаки не зависит от других зарядов. Они не продляются и не обновляются от новых зарядов.",
        "Модификатор дебаффа размещается один раз и обновляется при успешных применениях.",
        "Дебафф наносит урон равный 5\/10\/15\/20 (TagTalent 9\/14\/19\/24) единиц урона за каждый заряд спустя 1 секунду после размещения дебаффа.",
        "Урон определяется уровнем заклинаниям при размещении Burning Spear Counter. Поэтому применение новых зарядов с большим значением урона при действии на цель старых зарядов будет использовать старое значение.",
        "Выбор увеличивающего урон или изменяющего тип урона на чистый талантов мгновенно обновит уже действующие эффекты.",
        "Может нанести до 40\/80\/120\/160 (TagTalent 72\/112\/152\/192) единиц урона за заряд Burning Spear (до уменьшений).",
        "Нельзя применять к постройкам, вардам и союзным существам."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Burning Spear",
      "cooldown": "0",
      "description": "Герой жертвует частью здоровья, чтобы поджечь своё копьё и добавить к обычной атаке складывающийся периодический урон, действующий 8 сек.",
      "hot_key": "W",
      "params": [
        "Дальность применения: 450",
        "Текущее здоровье за атаку: 3%",
        "Периодический урон: 5\/10\/15\/20 ( 9\/14\/19\/24)",
        "Длительность: 8"
      ],
      "legacy_key": "R",
      "story": "Священный воин поджигает свое оружие, орошив его собственной кровью, вызывая у врагов гораздо большую боль, чем испытывает он сам."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "notes": [
        "Размер модели Huskar увеличивается на 35%, чем ближе он к максимальному бонусу от Berserker's Blood.",
        "Несмотря на то, что интерфейс не отображает десятичные значения, каждая потерянная единица здоровья дает бонусы.",
        "Бонус увеличивается экспоненциально, достигая максимума тем быстрее, чем ниже здоровье владельца. Бонусы увеличиваются примерно до 50% при 40% здоровья и 75% при 25% здоровья.",
        "Бонусы увеличиваются примерно до 50% при 40% здоровья и 75% при 25% здоровья.",
        "Увеличивает сопротивление магии Huskar до 32,5%\/36,25%\/40%\/43,75%. Сопротивление магии мультипликативно суммируется с другими источниками сопротивления магии.",
        "Сопротивление магии мультипликативно суммируется с другими источниками сопротивления магии.",
        "Бонусы не применяются при 100% здоровья, но максимальное их значение применяется при уровне здоровья ниже 10%.",
        "Процент здоровья периодически проверяется и эффекты мгновенно к нему адаптируются."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Berserker's Blood",
      "cooldown": null,
      "description": "Раны делают героя сильнее, увеличивая его сопротивление магии, скорость атаки и восстановление здоровья в зависимости от доли недостающего здоровья. Восстановление зависит от силы героя.",
      "hot_key": "E",
      "params": [
        "Макс. доп. скорость атаки: 160\/210\/260\/310",
        "Макс. бонус сопротивления магии: 10%\/15%\/20%\/25%",
        "Макс. регенерация от силы: 25%\/40%\/55%\/70% ( 55%\/70%\/85%\/100%)",
        "Здоровья для макс. эффекта: 10%"
      ],
      "legacy_key": "B",
      "story": "Лишившись своего божественного предназначения, священный воин приобрел смертоносность в приземлённом бою — тем более значительную, чем больше пролито его собственной крови."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2d\/Huskar_Life_Break_1.mp3\/revision\/latest?cb=20191216014112",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "Прыгает со скоростью в 1200 единиц.",
        "При использовании применяет к герою базовое развеивание.",
        "При использовании герой получает скрытый бафф, который длится 5 секунд или до достижения Huskar цели в зависимости от того, что произойдет раньше. Этот модификатор даёт невосприимчивость к магии, обезоруживание, заставляет развернуться лицом к цели и отвечает за анимацию прыжка. Поскольку у модификатора есть установленная максимальная длительность, то она может истечь в момент прыжка, продолжая оставшуюся часть прыжка без эффектов. Если во время прыжка Huskar будет обезврежен или цель передвинется на расстояние более 2440 единиц, то прыжок остановится. Однако запускаемый снаряд не останавливается. Если повторно применить способность до того, как снаряд достиг цели, эффекты способности все равно применятся на Huskar и цель.",
        "Этот модификатор даёт невосприимчивость к магии, обезоруживание, заставляет развернуться лицом к цели и отвечает за анимацию прыжка.",
        "Поскольку у модификатора есть установленная максимальная длительность, то она может истечь в момент прыжка, продолжая оставшуюся часть прыжка без эффектов.",
        "Если во время прыжка Huskar будет обезврежен или цель передвинется на расстояние более 2440 единиц, то прыжок остановится.",
        "Однако запускаемый снаряд не останавливается. Если повторно применить способность до того, как снаряд достиг цели, эффекты способности все равно применятся на Huskar и цель.",
        "Huskar может использовать предметы и заклинаниям в момент прыжка. При этом эффекты, меняющие позицию (например, Blink Dagger), отменят прыжок.",
        "Способность не наносит урон Рошану, на накладывает на него дебаффы. Не может выбрать в качестве цели курьера.",
        "Не может выбрать в качестве цели курьера.",
        "Урон, наносимый себе — магический. Поэтому его можно снизить с помощью сопротивления магии. Урон, наносимый себе, не летальный, без разницы, насколько он был усилен. Huskar не может совершить самоубийство с помощью Life Break. Урон, наносимый себе, наносится при попадании и не наносится при преждевременном прерывании прыжка.",
        "Урон, наносимый себе, не летальный, без разницы, насколько он был усилен. Huskar не может совершить самоубийство с помощью Life Break.",
        "Урон, наносимый себе, наносится при попадании и не наносится при преждевременном прерывании прыжка.",
        "Life Break сначала наносит урон, а затем применяет дебафф замедления и затем провокацию.",
        "При улучшении с Aghanim's Scepter Life Break применяет провокацию к цели, заставляя её атаковать Huskar. У провокации одинаковый приоритет с Winter's Curse и Berserker's Call, но меньший чем Duel. Не применяет безмолвие к цели, поэтому она может активировать активные модификаторы атаки при помощи активации Автоприменение.",
        "У провокации одинаковый приоритет с Winter's Curse и Berserker's Call, но меньший чем Duel.",
        "Не применяет безмолвие к цели, поэтому она может активировать активные модификаторы атаки при помощи активации Автоприменение."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Life Break",
      "cooldown": null,
      "description": "Герой наносит огромный урон ценой собственного здоровья. Он прыгает к цели в радиусе своей атаки, отнимая часть текущего здоровья жертвы и замедляя её. Во время прыжка герой невосприимчив к магии.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 550 ( 800)",
        "Текущего здоровья в урон по себе: 32%\/38%\/44%",
        "Текущего здоровья цели в урон: 32%\/38%\/44% ( 52%\/58%\/64%)",
        "Замедление скорости передвижения: 60%",
        "Длительность замедления: 3\/4\/5 ( 5\/6\/7)",
        "Макс. длительность иммунитета к заклинаниям: 5",
        "Длительность провокации: 3"
      ],
      "legacy_key": "F",
      "story": "Какой бы ни была опасность, когда Huskar бросается в битву, пережить которую сможет только он."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 20.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 1.5,
    "attrAgility": 10.0
  },
  "description": "Жертвует своим здоровьем, чтобы наносить больше урона Чем меньше у Huskar здоровья, тем опаснее он становится. Своим ультом он мгновенно лишает себя и противника части здоровья, а на грани смерти может обрушить на своих врагов шквал горящих копий.  Керри Стойкость Инициация ★☆☆",
  "history": "Очнувшись от агонии священного мира Нотл, воин открыл глаза и узрел, как одарённый жрец теней накладывает на него глубокое заклятие. Вопреки древним обрядам ордена Дезун душа воина была спасена от вечности, но, как и все побывавшие в мире Нотл, он необратимо изменился. Более неподвластная смертной плоти, его кровь обратилась источником невообразимой силы; каждая пролитая капля с лихвой возвращалась лютой, горящей мощью. Однако новообретённый дар разъярил спасённого, ведь жрец теней лишил его места среди богов, отказал в собственном священном жертвоприношении. Со временем старайшины ордена собрались расширить своё влияние и согласились между собой, что такой внушительный боец пригодится в грядущих кампаниях. Однако воин не желал быть жалким оружием ордена, что отказал ему в родовых правах. Когда на горизонте воспылали первые огни восходящей войны, он покинул отчий дом, чтобы найти новых союзников и достойный повод выпустить силу, что придёт с его безраздельным самопожертвованием."
}