{
  "abilities": [
    {
      "spell": "Elder Titan and his Astral Spirit both stomp the ground, damaging and knocking nearby enemy units unconscious around their locations. The Elder Titan stomp deals physical damage, while the Spirit stomp deals magical damage.",
      "effects": [
        "Ability No Target \/ Channeled",
        "Affects Enemies",
        "Damage Physical \/ Magical"
      ],
      "notes": [
        "Applies a sleep on affected units, preventing them from acting, until woken up.",
        "If a unit is hit by both damage components of the stomp, it takes 140\/200\/260\/320 ( 340\/400\/460\/520) damage (before reductions).",
        "The stomp first applies the damage, then the debuff.",
        "When the Astral Spirit is summoned, it performs the stomp perfectly synchronized with Elder Titan. The sleep is applied in the radius around Elder Titan and the spirit. If the radii overlap, the duration does not stack up. If the spirit is not summoned or Astral Spirit is not learned, both magical and physical damage are centered around Elder Titan.",
        "The Astral Spirit has this ability as well (with a different icon). Ordering the spirit to cast it forces Elder Titan to cast his part. When being cast on the spirit while Elder Titan is disabled, it goes on cooldown for the spirit and does nothing. However, Elder Titan can still use it afterwards and the spirit still mimics, despite its own being on cooldown. When Elder Titan casts Echo Stomp while the Astral Spirit is disabled (e.g. inside Chronosphere), it still casts its part. Echo Stomp cannot be cancelled by ordering the spirit to stop. During the Echo Stomp animation, the spirit cannot act.",
        "Affected units cannot be woken up for the initial 0.2 seconds of the sleep. After the initial part, units wake up only after cumulatively taking 50\/100\/150\/200 ( 650\/700\/750\/800) damage. Starts counting damage during the initial stun part already. Counts damage after all reductions. This means if the unit took enough damage during the 0.2, it may instantly wake up on the next damage instance afterwards. Does not count Astral Spirit's damage, but does count Earth Splitter.",
        "Knocked out units are never automatically attacked, regardless of settings. A forced attack order is required to attack them. This means that knocked out units are never attacked by lane creeps, neutral creeps, towers and fountains. Players can normally force an attack on a knocked out unit still."
      ],
      "mana": "100",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "14\/13\/12\/11",
      "name": "Echo Stomp",
      "description": [
        "Cast Animation: 0.4+0",
        "Channel Time: 1.3",
        "Radius: 500",
        "Physical Damage: 70\/100\/130\/160 ( 170\/200\/230\/260)",
        "Magical Damage: 70\/100\/130\/160 ( 170\/200\/230\/260)",
        "Wake Up Damage Threshold: 50\/100\/150\/200 ( 650\/700\/750\/800)",
        "Initial Stun Duration: 0.2",
        "Sleep Duration: 2\/3\/4\/5"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Elder Titan sends forth his Astral Spirit, damaging any units it passes through. When the spirit rejoins the Titan, it grants bonus damage and movement speed for each unit it passed through. The Astral Spirit possesses the Echo Stomp, Return Spirit, and Natural Order abilities.",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The spirit is controllable by Elder Titan until the end of its duration.",
        "Other players cannot select the spirit, so it cannot be used to prevent selecting other units behind it.",
        "The spirit cannot intercept any spell (e.g. Meat Hook, Sacred Arrow, Hookshot).",
        "The spirit's movement speed is set equal to Elder Titan's movement speed once upon cast and does not adapt to it afterwards.",
        "If Natural Order is learnt, the aura's debuff is always applied before the Astral Spirit's damage, effectively increasing it.",
        "The Astral Spirit unites with Elder Titan when it comes within 100 range of him, meaning just walking through it returns it as well.",
        "Casting Echo Stomp while the spirit returns forces the spirit to stop and cast his part. It continues returning once the cast finishes.",
        "Upon having returned, Elder Titan receives the Ancestral Spirit Buff, which grants damage, movement speed, and armor based on hit enemies. Does not count illusions and couriers. Treats creep-heroes as creeps. If the buff is still present on a recast, it gets refreshed, but not updated, upon returning the spirit again. If no enemies were hit, the buff is not placed, nor is an already existing buff getting refreshed.",
        "The Astral Spirit does not block neutral creep camps.",
        "This is how much attack damage, movement speed, and armor Astral Spirit grants after hitting a certain amount of heroes: 1 hero: 15\/30\/60\/80 ( 45\/60\/90\/110) damage, 1.5\/3\/4.5\/6 armor, and 7% movement speed 2 heroes: 30\/60\/120\/160 ( 90\/120\/180\/220) damage, 3\/6\/9\/12 armor, and 14% movement speed 3 heroes: 45\/90\/180\/240 ( 135\/180\/270\/330) damage, 4.5\/9\/13.5\/18 armor, and 21% movement speed 4 heroes: 60\/120\/240\/320 ( 180\/240\/360\/440) damage, 6\/12\/18\/24 armor, and 28% movement speed 5 heroes: 75\/150\/300\/400 ( 225\/300\/450\/550) damage, 7.5\/15\/22.5\/30 armor, and 35% movement speed"
      ],
      "mana": "80\/90\/100\/110",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "17",
      "name": "Astral Spirit",
      "description": [
        "Cast Animation: 0.4+0",
        "Cast Range: 1200",
        "Damage Radius: 275",
        "Damage: 50",
        "Move Speed Bonus per Creep: 1%",
        "Move Speed Bonus per Hero: 7%",
        "Movement Speed Cap: 40%",
        "Attack Damage Bonus per Creep: 6\/9\/12\/15",
        "Attack Damage Bonus per Hero: 15\/30\/60\/80 ( 45\/60\/90\/110)",
        "Armor Bonus per Creep: 0.5",
        "Armor Bonus per Hero: 1.5\/3\/4.5\/6",
        "Spirit Duration: 8",
        "Buff Duration: 10"
      ],
      "hot_key": "W",
      "legacy_key": "C"
    },
    {
      "spell": "Returns the Astral Spirit to Elder Titan.",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Replaces Astral Spirit until the spirit unites with Elder Titan again, or until Elder Titan dies.",
        "Return Astral Spirit does not interrupt Elder Titan's channeling spells upon cast.",
        "The Astral Spirit possesses this ability as well.",
        "Elder Titan cannot cast this while disabled, however, the Astral Spirit can while Elder Titan is disabled.",
        "The Astral Spirit moves back with a speed of 800."
      ],
      "mana": "0",
      "elements": [
        "Does not proc any on-cast effects when cast."
      ],
      "cooldown": "0",
      "name": "Return Astral Spirit",
      "description": [
        "Cast Animation: 0+0"
      ],
      "hot_key": "W",
      "legacy_key": "C"
    },
    {
      "spell": "Reduces all elements to their basic levels, removing base armor and magic damage resistance from nearby enemy units. The armor reduction is centered around the hero, while the magic armor reduction is centered around Astral Spirit.",
      "effects": [
        "Ability Aura",
        "Affects Enemies"
      ],
      "notes": [
        "Armor reduction is based on the affected units' base armor and armor granted by agility. Direct armor bonuses are ignored.",
        "Magic resistance reduction is based on the affected units' base magic resistance. Magic resistance bonuses are ignored. This means, for heroes with 25% base magic resistance, it reduces magic resistance by 10%\/15%\/20%\/25%, down to 15%\/10%\/5%\/0%. For Visage, who has 10% base magic resistance, it reduces magic resistance by 4%\/6%\/8%\/10%, down to 6%\/4%\/2%\/0%.",
        "Adapts the armor reduction based on how the affected units' armor changes due to agility loss or gain in 0.5 second intervals.",
        "When the Astral Spirit is summoned, the magic resistance reduction is centered around it, while the armor reduction around Elder Titan. If the spirit is not summoned or Astral Spirit is not learned, both armor and magic resistance reduction are centered around Elder Titan.",
        "The aura's debuff lingers for 1 second. However, if Astral Spirit gets cast, enemies around Elder Titan who are not within range of the spirit's aura immediately lose the magic resistance reducing debuff."
      ],
      "mana": "0",
      "elements": [
        "Can be used by illusions.",
        "Partially disabled by Break.",
        "Does not pierce spell immunity."
      ],
      "cooldown": "0",
      "name": "Natural Order",
      "description": [
        "Radius: 350",
        "Base Armor Reduction: 40%\/60%\/80%\/100%",
        "Base Magic Resistance Reduction: 40%\/60%\/80%\/100%",
        "Aura Linger Duration: 1"
      ],
      "hot_key": "E",
      "legacy_key": "N"
    },
    {
      "spell": "Sends forth a jagged crack in front of Elder Titan. After 3 seconds, the crack implodes, slowing movement while dealing damage to each enemy based on their maximum life. Half of the damage dealt is Magical damage, while the other half is Physical damage.",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Physical \/ Magical"
      ],
      "notes": [
        "Deals 15%\/20%\/25% of the affected units' max health as magical damage first, and then 15%\/20%\/25% as physical damage.",
        "The crack extends at a speed of 910.",
        "Can hit units up to 2415 range away (crack distance + crack radius).",
        "Also affects units up to 315 range behind Elder Titan's cast position.",
        "The crack visually extends up to 2600 distance, but the actual effects stop at 2100.",
        "Earth Splitter first applies the debuff, then the damage.",
        "Affected units are instantly pulled towards the crack once it implodes.",
        "The pull interrupts channeling spells.",
        "Forces a stop command onto the target upon pull, so that its current move, attack and spell cast orders get canceled.",
        "Does not affect ancient creeps.",
        "When having Aghanim's Scepter, the ability places the Earth Splitter Scepter debuff, instead of the Earth Splitter debuff. This debuff disarms enemies, on top of slowing them. The default and the scepter debuff stack with each other."
      ],
      "mana": "125\/175\/225",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "100 ( 25)",
      "name": "Earth Splitter",
      "description": [
        "Cast Animation: 0.4+0.73",
        "Cast Range: 2400",
        "Effect Delay: 3.14",
        "Crack Width: 315",
        "Crack Distance: 2100",
        "Max Health as Damage: 30%\/40%\/50%",
        "Move Speed Slow: 30%\/40%\/50%",
        "Slow Duration: 3\/4\/5 ( 4\/5\/6)",
        "Disarm Duration: 0 ( 4\/5\/6)"
      ],
      "hot_key": "R",
      "legacy_key": "E"
    }
  ],
  "bio": "Well may you ask, \"How did this world take its form?\" Why of all the worlds in creation, has this one its strange properties, its diverse and motley collection of creatures, cultures and lore? \"The answer,\" One whispers, \"lies with the Titans.\" These original progenitors were there near the Beginning--if not actual witnesses to the creation, then born with it still echoing in their ears. Stamped with the earliest energies of the universe, they wished nothing more than to continue as creators themselves. Thus they bent to the task of shaping matter to their will: hammering and heating, bending and blasting. And when matter proved less challenging than they liked, they turned their tools upon themselves, reshaping their minds and reforging their spirits until they had become beings of great endurance. Reality itself became the ultimate object of their smithing. Yet, along the way, they sometimes erred. In cases of great ambition, mistakes are unavoidable. The one we know as the Elder Titan was a great innovator, one who studied at the forge of creation. In honing his skills, he shattered something that could never be repaired, only thrown aside. He fell into his own broken world, a shattered soul himself. There he dwelt among the jagged shards and fissured planes, along with other lost fragments that had sifted down through the cracks in the early universe. And this is why the world we know resembles an isle of castaways, survivors of a wreck now long forgotten. Forgotten, that is, by all but the One who blames himself. He spends his time forever seeking a way to accomplish the repairs, that he might rejoin the parts of his broken soul, that we and the world alike might all be mended. This is the One we know as Elder Titan.",
  "talentsTips": [
    "The health talent increases maximum health capacity, and keeps the current health percentage.",
    "The magic resistance talent stacks multiplicatively with other sources of magic resistance.",
    "The magic resistance talent increases Elder Titan's magic resistance to 36.25%."
  ],
  "trivia": [
    "Elder Titan was known as the Tauren Chieftain in DotA. The name change was likely done to avoid copyright issues with Blizzard Entertainment, since the Tauren is an existing race in the Warcraft universe.",
    "Elder Titan is voiced by Jim French, a prominent voice actor and radio personality; he is best known for voice-acting Bill in the Left 4 Dead series and Father Grigori in Half Life 2, two titles also made by Valve.",
    "In the splash artwork, a faint image of what looks to be Legion Commander can be seen.",
    "The delay time on Earth Splitter is 3.14 seconds, which is most likely a reference to pi. Pi is the ratio between a circle's circumference and its diameter, making it a fundamental constant in geometry and other more complex areas of mathematics.",
    "In DotA, Astral Spirit is named Ancestral Spirit. It was changed to Astral Spirit in Dota 2 for thematic reasons."
  ],
  "talents": [
    "+600 Echo Stomp Wake Damage:-75s Earth Splitter Cooldown",
    "+100 Echo Stomp Damage:+70 Attack Speed",
    "+30 Astral Spirit Hero Attack:+15% Magic Resistance",
    "+200 Health:+25 Movement Speed"
  ],
  "desc": "The Elder Titan is a melee strength hero who is renowned as a powerful area nuker and disabler."
}