{
  "abilities": [
    {
      "spell": "Герой и его дух сотрясают землю, нанося окружающим противникам урон и вводя их в состояние сна. Герой наносит этой способностью физический урон, а его дух — магический. Сон прервётся, если противники получат какой-либо урон.",
      "effects": [
        "Способность Ненаправленная \/ Произносимая",
        "Действует на Врагов",
        "Урон Физический \/ Магический"
      ],
      "notes": [
        "Применяет сон ко всем затронутым юнитам, предотвращая их действия до пробуждения.",
        "Если юнит попадет под два типа урона от способности, то получит 140\/200\/260\/320 ( 340\/400\/460\/520) единиц урона (до учета сопротивления).",
        "Способность сначала наносит урон, затем применяет дебафф.",
        "Когда Astral Spirit призван, способность используется духом и героем абсолютно синхронно. Сон срабатывает на всех юнитов как вокруг героя, так и вокруг духа. Даже если юнит попал под действие способности героя и духа одновременно, длительность сна не увеличится. Если дух не призван, оба типа урона - магический и физический - будут нанесены вокруг Elder Titan.",
        "Astral Spirit обладает идентичной способностью (с отличающейся иконкой). Приказав духу использовать ее, Elder Titan так же использует Echo Stomp. Если указать духу использовать способность пока Elder Titan оглушен, способность начнет перезарядку, однако ничего не произойдет. Тем не менее, использовав Echo Stomp после оглушения, дух выполнит свою часть заклинания, даже если она все еще перезаряжается. Если Elder Titan применяет Echo Stomp, пока Astral Spirit остановлен (например, Chronosphere), дух все равно выполнит свою часть заклинания. Echo Stomp нельзя отменить приказом \"стоп\" духу. Во время анимации способности дух не может действовать.",
        "Затронутые юниты не могут проснутся в первые 0.2 секунды сна. После базового оглушения юниты смогут проснутся только после получения 50\/100\/150\/200 суммарного урона. Начинает сразу учитывать урон во время базового оглушения. Учитывает урон после всех сопротивлений. То есть если юнит получит достаточно урона во время 0.2, то мгновенно пробудится во время получения следующего урона. Не учитывает урон от Astral Spirit, но учитывает урон от Earth Splitter.",
        "Усыпленных юнитов никогда не будут целью для автоатаки вне зависимости от настроек. Для их атаки необходимо напрямую отдать команду. То есть этих юнитов никогда не будут атаковать линейные и нейтральные крипы, башни и фонтан. Игроки все равно могут атаковать усыпленных юнитов."
      ],
      "mana": "100",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "14\/13\/12\/11",
      "name": "Echo Stomp",
      "description": [
        "Анимация применения: 0,4+0",
        "Время произнесения: 1.3",
        "Радиус: 500",
        "Физический урон: 70\/100\/130\/160 ( 170\/200\/230\/260)",
        "Магический урон: 70\/100\/130\/160 ( 170\/200\/230\/260)",
        "Порог урона для пробуждения: 50\/100\/150\/200",
        "Длительность базового оглушения: 0.2",
        "Длительность сна: 2\/3\/4\/5"
      ],
      "hot_key": "Q",
      "legacy_key": "T"
    },
    {
      "spell": "Герой призывает астрального духа, который наносит урон каждому врагу, сквозь которого проходит. При воссоединении с владельцем дух дарует ему дополнительные урон и скорость передвижения за каждого задетого им врага. Дух обладает способностями Echo Stomp, Return Spirit и Natural Order.",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Дух находится под контролем Elder Titan до конца действия способности.",
        "Остальные игроки не могут выбрать духа, поэтому его нельзя использовать для блокировки выбора юнитов за ним.",
        "Духа нельзя задержать никаким заклинанием (в том числе Meat Hook, Sacred Arrow, Hookshot).",
        "Скорость передвижения духа приравнивается к скорости Elder Titan на момент призыва и не адаптируется при её изменении.",
        "С изученным Natural Order вокруг духа всегда распространяется дебафф ауры, усиливая наносимый духом урон.",
        "Astral Spirit сливается с Elder Titan как только оказывается в 100 единицах от него, позволяя возвращать духа, просто пройдя сквозь него.",
        "Использование Echo Stomp при возвращении духа заставит его остановится и начать произнесение его части заклинания. Дух продолжит возвращение при завершении применения.",
        "При возврате духа Elder Titan получает бафф Ancestral Spirit Buff, которые дает герою урон, скорость передвижении и броню на основе числа задетых врагов. Не учитывает иллюзии и курьеров. Считает крипов-героев за крипов. Если при повторном применении бафф еще действует, то при возвращении духа он обновит длительность, но не значение. Если дух не задел врагов, то бафф не применяется, а уже действующий - не обновляет длительность. Талант 25-го уровня также дает баффу эффект иммунитета к заклинаниям. Не применяет к герою развеивание.",
        "Astral Spirit не блокирует лагери нейтральных крипов.",
        "Здесь указано, сколько урона, скорости передвижения и брони даст Astral Spirit после поражения определенного числа героев: 1 герой: 15\/30\/60\/80 ( 45\/60\/90\/110) урона, 1.5\/3\/4.5\/6 брони и 7% скорости передвижения 2 героя: 30\/60\/120\/160 ( 90\/120\/180\/220) урона, 3\/6\/9\/12 брони и 14% скорости передвижения 3 героя: 45\/90\/180\/240 ( 135\/180\/270\/330) урона, 4.5\/9\/13.5\/18 брони и 21% скорости передвижения 4 героя: 60\/120\/240\/320 ( 180\/240\/360\/440) урона, 6\/12\/18\/24 брони и 28% скорости передвижения 5 героев: 75\/150\/300\/400 ( 225\/300\/450\/550) урона, 7.5\/15\/22.5\/30 брони и 35% скорости передвижения"
      ],
      "mana": "80\/90\/100\/110",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "17",
      "name": "Astral Spirit",
      "description": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 1200",
        "Радиус урона: 275",
        "Урон: 50",
        "Доп. скорость передвижения за крипа: 1%",
        "Доп. скорость передвижения за героя: 7%",
        "Граница доп. скорости передвижения: 40%",
        "Доп. урон за крипа: 6\/9\/12\/15",
        "Доп. урон за героя: 15\/30\/60\/80 ( 45\/60\/90\/110)",
        "Доп. броня за крипа: 0.5",
        "Доп. броня за героя: 1.5\/3\/4.5\/6",
        "Длительность духа: 8",
        "Длительность эффекта: 10"
      ],
      "hot_key": "W",
      "legacy_key": "C"
    },
    {
      "spell": "Возвращает духа обратно к герою.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Заменяет Astral Spirit до объединения духа с Elder Titan или до смерти героя.",
        "* При использовании Return Astral Spirit не прерывает произносимые способности Elder Titan.",
        "У Astral Spirit также есть эта способность.",
        "Сам Elder Titan не может использовать способность при обезвреживании, но Astral Spirit при обезвреженном герое - может",
        "Дух возвращается со скоростью 800."
      ],
      "mana": "0",
      "elements": [
        "Не провоцирует эффекты своим применением."
      ],
      "cooldown": "0",
      "name": "Return Astral Spirit",
      "description": [
        "Анимация применения: 0+0"
      ],
      "hot_key": "W",
      "legacy_key": "C"
    },
    {
      "spell": "Приводит сущность врагов к начальному небытию, снижая их базовый показатель брони и сопротивление магическому урону. Броню уменьшает сам герой, а сопротивление магии — дух от способности Astral Spirit.",
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Снижение брони действует только на базовую броню и броню, даваемую ловкостью. Дополнительная броня игнорируется.",
        "Снижение сопротивления магии действует только на базовое сопротивление. Дополнительное сопротивление магии игнорируется. То есть для героев с базовым сопротивлением магии в 25% способность снижает его на 10%\/15%\/20%\/25% - до 15%\/10%\/5%\/0%. Для Visage с базовым сопротивлением магии в 10% способность снижает его на 4%\/6%\/8%\/10% - до 6%\/4%\/2%\/0%.",
        "Адаптирует снижение брони с интервалом в 0,5 секунды, базируясь на том, как меняется броня затронутых юнитов от потери или получения ловкости.",
        "С призванным Astral Spirit уменьшение сопротивления магии распространяется вокруг духа, а снижение брони - вокруг Elder Titan. Если дух не призван или Astral Spirit не изучена, то оба дебаффа распространяются вокруг Elder Titan.",
        "Дебафф от ауры задерживается на 1 секунду. При этом, если Astral Spirit была использована, то враги вокруг Elder Titan, не попавшие в радиус действия ауры духа, мгновенно потеряют дебафф уменьшения сопротивления магии."
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Частично отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Natural Order",
      "description": [
        "Радиус: 325",
        "Снижение базовой брони: 40%\/60%\/80%\/100%",
        "Снижение базового сопротивления магии: 40%\/60%\/80%\/100%",
        "Длительность задержки ауры: 1"
      ],
      "hot_key": "E",
      "legacy_key": "N"
    },
    {
      "spell": "Герой раскалывает землю, посылая трещину в выбранном направлении. Через 3 секунды разлом схлопывается, замедляя всех попавшихся врагов и нанося им урон, зависящий от их максимального показателя здоровья. Половина урона будет физической, половина — магической.",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Физический \/ Магический"
      ],
      "notes": [
        "Наносит 15%\/20%\/25% от максимального здоровья задетых юнитов в виде магического урона, а затем 15%\/20%\/25% - в виде физического.",
        "Трещина распространяется со скоростью 910.",
        "Может поражать юнитов на расстоянии до 2415 единиц (складывается из длины трещины и радиуса).",
        "Также задевает юнитов на расстоянии 315 единиц позади места применения заклинания Elder Titan.",
        "Визуально трещина достигает длины до 2600 единиц, но эффекты заканчивают действие на 2100 единицах.",
        "Earth Splitter сначала применяет дебафф, затем наносит урон.",
        "Затронутые юниты мгновенно притягиваются к трещине в момент взрыва.",
        "Притягивание прерывает произносимые заклинания.",
        "При притягивании отдается команда \"стоп\", поэтому текущие приказы на движение, атаки и использование заклинаний отменяются.",
        "Не действует на древних крипов.",
        "С Aghanim's Scepter способность помимо дебаффа Earth Splitter применяет к юнитам дебафф Earth Splitter Scepter. Этот дебафф, вдобавок к замедлению, обезоруживает врагов. Базовый дебафф и дебафф от Aghanim's Scepter сочетаются друг с другом."
      ],
      "mana": "125\/175\/225",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "100 ( 25)",
      "name": "Earth Splitter",
      "description": [
        "Анимация применения: 0,4+0,73",
        "Дальность применения: 2400",
        "Задержка: 3.14",
        "Ширина трещины: 315",
        "Длина трещины: 2100",
        "Урон от макс. здоровья: 30%\/40%\/50%",
        "Замедление скорости передвижения: 30%\/40%\/50%",
        "Длительность замедления: 3\/4\/5 ( 4\/5\/6)",
        "Длительность обезоруживания: 0 ( 4\/5\/6)"
      ],
      "hot_key": "R",
      "legacy_key": "E"
    }
  ],
  "bio": "Вы наверняка задавались вопросом: как этот мир стал таким, какой он есть? Почему среди всех миров именно этот такой странной формы, населен такими разношерстными пестрыми существами со столь богатой культурой и историей? «Ответ, — раздается шепот, — знают Титаны». Они существовали с начала времен, и если даже не созерцали создание сущего, то с рождения помнят его эхо. Клейменные самыми ранними силами вселенной, они не желали ничего иного, кроме как продолжать созидание самостоятельно. Они решили изменять материю по своему разумению: ударяя, нагревая, изгибая и разрывая ее. И когда материя стала для них слишком простой, они стали изменять сами себя и друг друга. Обостряя ум и перековывая дух, они достигли небывалого могущества. Новой целью стала переделка самой реальности. Но тут они иногда совершали ошибки — большие амбиции давали знать свое. Тот, кого зовут Elder Titan, был большим выдумщиком, постигшим искусство творения. Оттачивая мастерство, он случайно поколебал то, что уже было нельзя восстановить. Он провалился в изломанный мир — осколок собственной души. Там, среди зубчатых разломов, треснутых равнин, и других осколков, провалившихся через трещины раннего мира, он и пребывал. Именно поэтому мир, каким мы его знаем, напоминает горстку выживших в кораблекрушении, про которое все давно забыли. Забыли все, кроме одного, который винит себя. Целую вечность он безустанно ищет способ всё исправить, собрать воедино свою расколотую душу, часть которой может быть в каждом из нас. Именно его мы зовем Elder Titan.",
  "talentsTips": [
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
    "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
    "Талант на сопротивление магии увеличивает сопротивление магии Elder Titan до 36.25%."
  ],
  "trivia": [
    "В DotA, имя героя было Tauren Chieftain. Его имя было изменено, чтобы избежать возможного нарушения авторских прав Blizzard Entertainment, так как Tauren - это существующая раса во вселенной Warcraft.",
    "Elder Titan озвучен Джимом Френчем, который также озвучивал Билла из серии игр Left 4 Dead и Отца Григория из игры Half-Life 2. Данные игры также разработаны компанией Valve.",
    "На изображении сплэш арт-ворка, можно увидеть тусклые очертания Legion Commander.",
    "Задержка способности Earth Splitter равна 3.14 секундам, что скорее всего является отсылкой к числу Пи. Число Пи это математическая константа равная отношению длины окружности к длине её диаметра, это фундаментальная величина в физике, геометрии и других более сложных разделах математики, что опять же отсылается на биографию героя.",
    "В DotA, способность Astral Spirit называлась Ancestral Spirit. Название поменяли на Astral Spirit, по тематическим причинам."
  ],
  "talents": [
    "Эффект Astral Spirit даёт невосприимчивость к магии:-75 сек. перезарядки Earth Splitter",
    "+100 к урону от Echo Stomp:+70 к скорости атаки",
    "+30 к урону за героя от Astral Spirit:+15% к сопротивлению магии",
    "+200 к здоровью:+25 к скорости передвижения"
  ],
  "desc": "Elder Titan — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Echo Stomp, сотрясают землю, нанося урон и оглушая врага до бессознательного состояния. Этой способностью Elder Titan наносит физический урон, в то время как его дух наносит магический урон. Вторая способность, Astral Spirit, призывает астрального духа, который наносит урон каждому врагу, сквозь которого он проходит. При воссоединении с Титаном дух дарует ему дополнительный урон и скорость передвижения за каждого раненного им врага. Дух также обладает способностями Echo Stomp, Return Spirit и Natural Order. Духа можно вернуть к Elder Titan, использовав Return Astral Spirit. Пассивная способность, Natural Order, понижает все показатели до их начального уровня, снижая базовый показатель брони и сопротивление магическому урону ближайших врагов. Ультимативная способность, Earth Splitter, раскалывает землю впереди Elder Titan. После трех секунд трещина взрывается, замедляя всех врагов, которые попали в область действия способности, и нанося им урон в зависимости от их максимального показателя здоровья. Улучшение с Aghanim's Scepter увеличивает длительность замедления, а также юниты, притянутые этой способностью, будут обезоружены."
}