{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fe\/Book_of_Shadows_Shadows.mp3\/revision\/latest?cb=20210120232104",
      "effects": [
        "Cast Range: 700",
        "Duration: 4"
      ],
      "notes": [
        "Applies a basic dispel on the target upon cast. ↓↓ Double-tapping automatically target self.",
        "↓↓ Double-tapping automatically target self.",
        "Silences, mutes, and disarms the target for the duration.",
        "During Shadows, the target is phased and attack immune. The target is still selectable, however, targeted orders get canceled immediately once coming within range. If already within range, however, the target can be successfully targeted by abilities that do not require facing the target to cast (e.g Glimmer). Does not prevent Spell Reflection from reflecting abilities back at them. Does not disjoint projectiles.",
        "The target is still selectable, however, targeted orders get canceled immediately once coming within range.",
        "If already within range, however, the target can be successfully targeted by abilities that do not require facing the target to cast (e.g Glimmer).",
        "Does not prevent Spell Reflection from reflecting abilities back at them.",
        "Does not disjoint projectiles.",
        "Almost every ability treats the target as if they were invisible, except for the following abilities: Heat-Seeking Missile, Cinder Brew, Eternal Chains, Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism, and Thundergod's Wrath. Unlike with invisibility, Beetles, Phantoms and Undying Zombies do not instantly die when Shadows is cast.",
        "Heat-Seeking Missile, Cinder Brew, Eternal Chains, Concussive Shot, Wrath of Nature, Omnislash, Mana Drain, Exorcism, and Thundergod's Wrath.",
        "Unlike with invisibility, Beetles, Phantoms and Undying Zombies do not instantly die when Shadows is cast."
      ],
      "mana": "0",
      "abilityName": "Shadows",
      "cooldown": "8",
      "description": "Target an enemy, ally or self. Causes the target to become untargetable but also silenced, muted and disarmed for 4 seconds. Applies a basic dispel.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "260 health and 1.3 health regeneration.",
    "156 mana and 0.65 mana regeneration.",
    "13 attack speed and 2.17 main armor.",
    "13 main attack damage to all \/ \/ heroes."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Book of Shadows",
  "description": "An impossible tome filled with unreadable prose of unknowable thoughts.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}