{
  "abilities": [
    {
      "spell": "Сотрясает землю, нанося урон всем врагам в области действия, а также замедляя их атаки и передвижение.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Считает крипов-героев за крипов.",
        "Thunder Clap сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "90\/100\/110\/120",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "13",
      "name": "Thunder Clap",
      "description": [
        "Анимация применения: 0,4+0,4",
        "Радиус: 400",
        "Урон: 100\/175\/250\/300",
        "Замедление скорости передвижения: 25%\/35%\/45%\/55%",
        "Замедление скорости атаки: 25\/35\/45\/55",
        "Длительность замедления героев: 4 ( 7)",
        "Длительность замедления крипов: 8 ( 11)"
      ],
      "hot_key": "Q",
      "legacy_key": "C"
    },
    {
      "spell": "Обливает указанную область алкоголем, отчего вражеские существа могут атаковать самих себя или загореться, если нанести им 80 магического урона или больше.",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Снаряд Cinder Brew летит со скоростью 1600.",
        "Применяет дебафф к вражеским юнитам в пределах области. Покидание или возвращение в область после применения никакого эффекта не даст.",
        "Срабатывание атаки по себе определяется в начале атаки. Атака обозначается падением кружки пива на голову юнита. Эта атака заставляет выбрать целью самого юнита, а не изначальную цель. К атаке также применяются модификаторы, если они действуют на союзников. Атака по себе не может быть смертельной. Также действует на мгновенные атаки.",
        "Когда враги под действием дебаффа Cinder Brew получают не менее 80 урона заклинания от одного источника (до учета снижений), то активирует дебафф горения. У дебаффа нет ограничения на количество поджогов. Каждое превысившее границу урона заклинание активирует дебафф. Несколько применений дебаффа горения не складываются, но обновляют длительность.",
        "Горение наносит 5\/12.5\/20\/27.5 урона с интервалом в 0,5 секунды спустя 0,5 секунды после применения дебаффа, нанося урон до 6 раз.",
        "Может нанести до 30\/75\/120\/165 единиц урона юниту (до учета уменьшений).",
        "Повторное применение на те же цели обновит длительность, но не улучшит дебафф до текущего уровня способности. Обновление для уже горящих целей не прервет нанесение урона."
      ],
      "mana": "50",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "20\/18\/16\/14",
      "name": "Cinder Brew",
      "description": [
        "Анимация применения: 0,2+0,6",
        "Дальность применения: 850",
        "Радиус: 400",
        "Шанс атаковать себя: 20%\/25%\/30%\/35%",
        "Замедление скорости передвижения: 25%",
        "Мин. урон заклинания для поджога: 80",
        "Урон в секунду от поджога: 10\/25\/40\/55",
        "Длительность: 7",
        "Длительность горения: 3"
      ],
      "hot_key": "W",
      "legacy_key": "D"
    },
    {
      "spell": "Используя технику пьяного боя, герой получает шанс уклоняться от атак и наносить критический урон. Под действием скорость передвижения варьируется от -20% до +40%. Действует 5 сек.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Brewmaster.",
        "При активации увеличивает урон от атаки в среднем на 56%\/80%\/104%\/128% ( 196%\/220%\/244%\/268%), а выживаемость против физических атак — на 100%\/150%\/233%\/400%.",
        "Шанс срабатывания сочетается с другими источниками критического урона. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.",
        "Уклонение Drunken Brawle Складывается по закону убывающей полезности с другими источниками уклонения.",
        "Уклонение и критический удар Drunken Brawle используют Псевдослучайное распределение.",
        "Звук и частицы крита проигрываются при начале атаки, а не её попадании.",
        "Изменение скорости передвижения происходит каждую секунду и начинается с положительного бонуса. В итоге скорость передвижения увеличивается на 40% в первую, третью и пятую секунду и замедляется на 20% на вторую и четвертую."
      ],
      "mana": "35\/40\/45\/50",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "20\/19\/18\/17",
      "name": "Drunken Brawler",
      "description": [
        "Анимация применения: 0+0",
        "Уклонение: 50%\/60%\/70%\/80%",
        "Шанс критического удара: 80%",
        "Критический урон: 170%\/200%\/230%\/260% ( 345%\/375%\/405%\/435%)",
        "Замедление скорости передвижения: 20%",
        "Доп. скорость передвижения: 40%",
        "Длительность: 5"
      ],
      "hot_key": "E",
      "legacy_key": "B"
    },
    {
      "spell": "Разделяет героя на трёх выносливых воинов-элементалей. Если хотя бы один из них доживёт до окончания действия способности, герой вернётся в свою прежнюю форму.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя",
        "Урон Физический"
      ],
      "notes": [
        "Brewmaster становится неуязвимым и исчезает во время применения заклинания и его длительности. Не накладывает никакой формы развеивания.",
        "Пока способность активна, Brewmaster периодически перемещается туда, где находится воин земли. Если воин земли умрет, то герой будет перемещаться к воину шторма и если умрет воин шторма, то к воину огня. Из этого следует еще несколько моментов: Когда Primal Split заканчивается, Brewmaster появляется на месте воина земли. Если воин земли мертв, то на месте воина шторма и если воин шторма мертв, то на месте воина огня. Каждая аура, которая имеется у героя (включая Gem of True Sight и Radiance), работает в радиусе вокруг воина земли, если тот мертв, то вокруг воина шторма и если воин шторма мертв, то вокруг воина огня. Эффекты, реагирующие на присутствие героя ( Smoke of Deceit, Marksmanship, Blur) реагируют только на присутствие воина земли, если воин земли мертв, то на воина шторма и если воин шторма мертв, то на воина огня. Эффекты телепортации ( Holy Persuasion или Relocate) заставляют периодическое перемещение Brewmaster прерваться, и в таком случае вышенаписанные примечания больше неприменимы.",
        "Воины всегда появляются в одном и том же построении, образуя правильный треугольник, помещающийся в окружности с радиусом в 100 единиц. Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster. Воин шторма всегда появляется на расстоянии в 50 позади и 86.603 левее Brewmaster, Воин огня всегда появляется на расстоянии в 50 позади и 86.603 правее Brewmaster. Все воины будут смотреть в ту же сторону, куда смотрел Brewmaster перед применением способности.",
        "Призванные воины - это древние крипы-герои, поэтому определенный заклинания взаимодействуют с ними иначе. Для подробностей взаимодействия перейдите к соответствующим статьям."
      ],
      "mana": "125\/150\/175",
      "elements": [],
      "cooldown": "140\/130\/120 ( 75\/65\/55)",
      "name": "Primal Split",
      "description": [
        "Анимация применения: 0,65+0",
        "Время разделения: 0.6",
        "Длительность: 16\/18\/20"
      ],
      "hot_key": "R",
      "legacy_key": "R"
    },
    {
      "spell": "Бросает булыжник, который наносит урон врагу и обездвиживает его.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Булыжник летит со скоростью 800.",
        "Булыжник сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "0",
      "elements": [
        "Можно избежать.",
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "5",
      "name": "Hurl Boulder",
      "description": [
        "Анимация применения: 0,25+0,8",
        "Дальность применения: 800",
        "Урон: 50\/100\/150",
        "Длительность оглушения: 2"
      ],
      "hot_key": "Q",
      "legacy_key": "D"
    },
    {
      "spell": "Невосприимчив к заклинаниям.",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [],
      "mana": "0",
      "elements": [
        "Не отключается истощением."
      ],
      "cooldown": "0",
      "name": "Spell Immunity",
      "description": [
        "Доп. сопротивление магии: 100%"
      ]
    },
    {
      "spell": "Существо наносит дополнительный урон постройкам.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Урон от способности непосредственно добавляется к урону воина земли. Но, поскольку он наносится только постройкам, то не отображается в интерфейсе."
      ],
      "mana": "0",
      "elements": [
        "Отключается истощением."
      ],
      "cooldown": "0",
      "name": "Demolish",
      "description": [
        "Доп. урон по строениям: 90\/180\/270"
      ]
    },
    {
      "spell": "Сотрясает землю, нанося урон всем врагам в области действия, а также замедляя их атаки и передвижение.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Дается воину земли при наличии Aghanim's Scepter у героя, уровень способности тот же, что и у Brewmaster.",
        "Применимы те же примечания, что и к Thunder Clap Brewmaster."
      ],
      "mana": "90\/100\/110\/120",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "13",
      "name": "Thunder Clap",
      "description": [
        "Анимация применения: 0,4+0,53",
        "Радиус: 400",
        "Урон: 100\/175\/250\/300",
        "Замедление скорости передвижения: 25%\/35%\/45%\/55%",
        "Замедление скорости атаки: 25\/35\/45\/55",
        "Длительность замедления героев: 4 ( 7)",
        "Длительность замедления крипов: 8 ( 11)"
      ],
      "hot_key": "R",
      "legacy_key": "C"
    },
    {
      "spell": "Наносит урон призванным существам и рассеивает большинство положительных и отрицательных эффектов в небольшой области.",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "Накладывает базовое развеивание на всех юнитов в радиусе действия.",
        "Всегда развеивает Cyclone независимо от того, на врага или союзника действует способность. Кроме того, способность следует стандартным правилам развеивания, снимая дебаффы с союзников и баффы с врагов.",
        "Урон наносится юнитам, созданным способностями, включая иллюзии. Крипы-герои получают урон только если также относятся к древним.",
        "Действует на неуязвимых, но не на спрятанных юнитов."
      ],
      "mana": "75",
      "elements": [
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "4",
      "name": "Dispel Magic",
      "description": [
        "Анимация применения: 0,4+0,93",
        "Дальность применения: 500",
        "Радиус: 600",
        "Урон призванным существам: 1000"
      ],
      "hot_key": "Q",
      "legacy_key": "D"
    },
    {
      "spell": "Закручивает врага в торнадо, временно обездвиживающее его на поле битвы.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов"
      ],
      "notes": [
        "Накладывает эффект урагана на цель при применении, то есть цель становится неуязвимой и полностью обезвреживаются.",
        "В отличии от других торнадо, это не развеивает эффекты цели.",
        "Поднятые юниты теряют свой размер столкновения на длительность, позволяя другим юнитам пройти под ними.",
        "Можно применить на Рошана, но это только прервет его на часть секунды и не повлияет на него."
      ],
      "mana": "150",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "8",
      "name": "Cyclone",
      "description": [
        "Анимация применения: 0,4+0,67",
        "Дальность применения: 600",
        "Длительность героям: 6",
        "Длительность крипам: 20"
      ],
      "hot_key": "W",
      "legacy_key": "C"
    },
    {
      "spell": "Дает временную невидимость. Пока воин невидим, он передвигается значительно быстрее; атака, снимающая невидимость, нанесет дополнительный урон.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Не останавливает прерываемые способности при применении.",
        "Дополнительный урон добавляется напрямую к урону юнита, а потому может быть снижен такими способностями, как Enfeeble or Static Link. Тем не менее, не может быть увеличена, например, Empower. Урон учитывается вампиризмом, уроном соседним целям и критическим ударом.",
        "Во время задержки невидимости, Storm может использовать способности и атаковать не выходя из невидимости. Такие атаки так же наносят урон способности.",
        "Дополнительный урон не действует, если ударить из невидимости строение, но действует на варды.",
        "Невидимость теряется, как только используется заклинание или выпущен снаряд атаки. Таким образом, даже если атака промахнется, невидимость все равно будет утеряна.",
        "Позволяет Storm проходить сквозь другие юниты, включая варды, но не строения."
      ],
      "mana": "75",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "5",
      "name": "Wind Walk",
      "description": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0.6",
        "Доп. скорость передвижения: 50%",
        "Урон: 100\/160\/220",
        "Длительность: 20"
      ],
      "hot_key": "E",
      "legacy_key": "W"
    },
    {
      "spell": "Обливает указанную область алкоголем, отчего вражеские существа могут атаковать самих себя или загореться, если нанести им 80 магического урона или больше.",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Дается воину шторма при наличии Aghanim's Scepter у героя, уровень способности тот же, что и у Brewmaster.",
        "Применимы те же примечания, что и к Cinder Brew у Brewmaster."
      ],
      "mana": "50",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "20\/18\/16\/14",
      "name": "Cinder Brew",
      "description": [
        "Анимация применения: 0,2+0,67",
        "Дальность применения: 850",
        "Радиус: 400",
        "Шанс атаковать себя: 20%\/25%\/30%\/35%",
        "Замедление скорости передвижения: 25%",
        "Мин. урон заклинания для поджога: 80",
        "Урон в секунду от поджога: 10\/25\/40\/55",
        "Длительность: 7",
        "Длительность горения: 3"
      ],
      "hot_key": "R",
      "legacy_key": "T"
    },
    {
      "spell": "Обжигает врагов неподалёку.",
      "effects": [
        "Способность Аура",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Permanent Immolation это аура. Эффект задерживается на 0.5 секунды.",
        "Наносит урон каждую секунду, начиная с первой секунды с момента получения негативного эффекта.",
        "Может нанести до 330\/740\/1230 урона одному юниту (до учета сопротивлений), если он оставался в пределах действия всю длительность."
      ],
      "mana": "0",
      "elements": [
        "Не отключается истощением.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Permanent Immolation",
      "description": [
        "Радиус: 220",
        "Урон в секунду: 20\/40\/60",
        "Длительность задержки ауры: 0.5"
      ]
    },
    {
      "spell": "Используя технику пьяного боя, герой получает шанс уклоняться от атак и наносить критический урон. Под действием скорость передвижения варьируется от -20% до +40%. Действует 5 сек.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов"
      ],
      "notes": [
        "Дается воину огня при наличии Aghanim's Scepter у героя, уровень способности тот же, что и у Brewmaster.",
        "Применимы те же примечания, что и к Drunken Brawler у Brewmaster."
      ],
      "mana": "35\/40\/45\/50",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "20\/19\/18\/17",
      "name": "Drunken Brawler",
      "description": [
        "Анимация применения: 0+0",
        "Уклонение: 50%\/60%\/70%\/80%",
        "Шанс критического удара: 80%",
        "Критический урон: 170%\/200%\/230%\/260% ( 345%\/375%\/405%\/435%)",
        "Замедление скорости передвижения: 20%",
        "Доп. скорость передвижения: 40%",
        "Длительность: 5"
      ]
    }
  ],
  "bio": "Глубоко в Скулящих горах, в долине, что под Разрушенным городом, древний орден Ойо веками практиковал свои ритуалы священного помутнения, соединяясь с миром духов посредством грандиозных хмельных праздников. Рожденный плотской матерью от отца-небожителя, молодой Мангикс стал первым, кто совместил в себе таланты обеих линий. Он занимался с величайшими эстетами Ордена, со временем заполучив с прилежной верностью к напиткам право соревноваться за титул Хмелевара — высшего звания во всей спиртотворческой касте. Девять дней Мангикс сражался и пил до последнего, — оба аспекта были одинаково важны — стараясь одолеть и перепить старшего мастера. Девять ночей они шатались и крутились, спотыкались и наносили удар за ударом — и так до тех пор, пока воин постарше наконец не свалился на землю в пьяном ступоре, и его соперник был наречен новым Хмелеваром. Теперь новый, молодой Хмелевар взывает к силе предков Ойо, дабы те дали ему скорость в обращении с посохом. К своим предкам-небожителям он взывает, когда пользуется магией. И, подобно всем предыдущим Хмелеварам его родины, его послали путешествовать по миру с единственной целью. В бродяжничестве он постигает просвещение сквозь принятие алкоголя, пребывая в постоянных поисках ответа на древнюю духовную загадку; пытаясь надумать ту самую мысль, которая вновь воссоединит духовный и материальный миры.",
  "talentsTips": [
    "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
    "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
    "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
    "Талант на сопротивление магии увеличивает сопротивление магии Brewmaster до 27.25%."
  ],
  "trivia": [
    "Brewmaster, как и Storm Spirit, Ember Spirit и Earth Spirit, был Пандареном в DotA. Во избежание проблем с авторским правом, модель Brewmaster была переделана. Теперь он больше похож на Малую панду, нежели на Большую панду, на которой основывался внешний вид Пандаренов во вселенной WoW."
  ],
  "talents": [
    "+175% к критическому урону от Drunken Brawler:-65 сек. перезарядки Primal Split",
    "+100 к скорости атаки:+1500 к здоровью воинов от Primal Split",
    "+20% к сопротивлению магии:+3 сек. к замедлению от Thunder Clap",
    "+200 к здоровью:+20 к урону"
  ],
  "tips": [
    "Спириты от ульта Brewmaster, в котором не находится герой (герой сначала находится в земляном, при его смерти в штормовом, а при его смерти в огненном) не раскрывают невидимость от Smoke of Deceit.",
    "Если против вас играют герои с возможностью сильного и постоянного хараса (такие как Sniper или Weaver) – есть смысл изучать первоначально Drunken Haze и Drunken Brawler, поскольку они дадут вам шанс уклониться от атак врага.",
    "Используйте Primal Split с умом. Это основная способность Brewmaster’a в массовых драках, а поскольку она имеет большое время до повторного использования вы будете менее полезны."
  ],
  "desc": "Brewmaster — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Thunder Clap, раскалывает землю под ногами, нанося урон всем врагам в области действия, а также снижая их скорость атаки и передвижения. Вторая способность, Cinder Brew, опьяняет врагов в небольшом радиусе, из-за чего те передвигаются медленнее и могут себя атаковать. Третья способность, Drunken Brawler, дает шанс уклониться от атаки или нанести критический урон, меняя скорость передвижения после активации. Крит или уклонение всегда будут срабатывать, если героя не атаковали или он не были атакован соответственно в течение нескольких последних секунд. Ультимативная способность, Primal Split, разделяет Brewmaster на трех воинов-элементалей. Если хотя бы один из них выживет до окончания действия способности, Brewmaster переродится с тем же самым здоровьем и маной. Улучшение с Aghanim's Scepter дает воинам Brewmaster его способности."
}