{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e6\/Nullifier_Nullify_1.mp3\/revision\/latest?cb=20191227195511",
      "effects": [
        "Cast Range: 900",
        "Duration: 5"
      ],
      "notes": [
        "The projectile travels at a speed of 1100.",
        "Applies a basic dispel in 0.2-second intervals, starting immediately as the debuff is applied, resulting in 25 dispel instances.",
        "Nullifier first applies the dispel, then the debuff.",
        "Can be cast on invulnerable units, applying the dispel and the debuff if the invulnerability can be dispelled. However, if the invulnerability cannot be dispelled, the debuff cannot be applied, but can be refreshed, if already debuffed.",
        "However, if the invulnerability cannot be dispelled, the debuff cannot be applied, but can be refreshed, if already debuffed.",
        "Despite the internal modification's name. Nullifier does not mute the target."
      ],
      "mana": "0",
      "abilityName": "Nullify",
      "cooldown": "10",
      "description": "Dispels the target and applies a debuff for 5 seconds. Continuously dispels the target.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4725",
  "lore": null,
  "consistFrom": [
    "Sacred Relic",
    "Helm of Iron Will"
  ],
  "name": "Nullifier",
  "description": "A dangerous weapon pilfered from an inverse dimension.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Because this item has a short range and slow projectile speed, it is easier to land from a melee hero with a Blink Dagger, Shadow Blade or ability to close the distance.",
    "A ranged hero may opt for a Scythe of Vyse especially if they are an Intelligence hero. Note that Hex is dispellable with strong dispels.",
    "Use Nullifier on heroes with defensive items like Glimmer Cape, Eul's Scepter of Divinity, Ghost Scepter and Aeon Disk.",
    "Since Force Staff is dispellable, Nullifier will stop enemy heroes after they have been pushed a very short distance.",
    "Use it on heroes that use dispellable Buffs on themselves to escape or deal\/prevent damage like Windrun and Flame Guard.",
    "Use it on heroes with illusions to keep track of the real hero.",
    "Nullify is one of the very few debuffs that cannot be dispelled at all, making it useful against abilities with strong dispels, such as Dark Pact, Press the Attack, and Aphotic Shield.",
    "Nullifier may be useful on illusion heroes such as Phantom Lancer in order to visually differentiate the original from the illusions."
  ]
}