{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d8\/Night_Stalker_Void.mp3\/revision\/latest?cb=20191216021028",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Также использует ночные значения во время ночи от Eclipse.",
        "Void сначала применяет замедление, затем наносит урон, потом - оглушает.",
        "Во время действия Hunter in the Night остаточная анимация равна 0,57.",
        "При улучшении Aghanim's Scepter Void становится ненаправленным заклинанием и действует на всех противников в радиусе 900. Не выбирает невидимых существ и существ в тумане войны.",
        "Не выбирает невидимых существ и существ в тумане войны."
      ],
      "mana": "11\/10\/9\/8",
      "item_behaviour": [],
      "name": "Void",
      "cooldown": "90\/100\/110\/120",
      "description": "Создаёт губительную пустоту, которая замедляет врага и наносит ему урон. Ночью ненадолго оглушает жертву, останавливая прерываемые способности, а замедление длится дольше.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,33",
        "Дальность применения: 525 ( 0)",
        "Урон: 80\/160\/240\/320 ( 130\/210\/290\/370)",
        "Замедление скорости передвижения: 50%",
        "Замедление скорости атаки: 50",
        "Длительность замедления днём: 1,25",
        "Длительность замедления ночью: 2,5\/3\/3,5\/4",
        "Длительность оглушения днём: 0",
        "Длительность оглушения ночью: 0,1 ( 0,8)",
        "Радиус: 900"
      ],
      "legacy_key": "V",
      "story": "Баланар яростно погружает врагов в воронку когда-то вечной тьмы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ee\/Night_Stalker_Crippling_Fear_1.mp3\/revision\/latest?cb=20191216021032",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов"
      ],
      "notes": [
        "Также использует ночные значения во время ночи от Eclipse.",
        "Безмолвие предоставлено аурой, чей дебафф задерживается на 0,5 сек.",
        "Длительность активированной ауры не обновляется при смене времени суток.",
        "Во время действия Hunter in the Night остаточная анимация равна 0,67."
      ],
      "mana": "30\/25\/20\/15 (TagTalent 25\/20\/15\/10)",
      "item_behaviour": [],
      "name": "Crippling Fear",
      "cooldown": "50",
      "description": "Герой вселяет ужас во врагов рядом с собой, отчего на них действует безмолвие. Ночью эффект длится дольше.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0,43",
        "Радиус: 375",
        "Длительность днём: 3",
        "Длительность ночью: 4\/5\/6\/7",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "F",
      "story": "Искажённая пасть Баланара навсегда останется в памяти тех несчастных, кто попался ему на пути."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Night_Stalker_Hunter_in_the_Night_move.mp3\/revision\/latest?cb=20191216021026",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя ",
        "Урон: "
      ],
      "notes": [
        "Также действует во время ночи от Eclipse.",
        "При улучшении с Aghanim's Shard Hunter in the Night становится активной способностью. Пассивные эффекты также сохраняются. Может быть применена на любое существо, кроме героев, иллюзий, клонов, крипов-геров, вардов, построек и Рошана. Не может быть использована на древних крипов днём, но может быть использована на них ночью. Выбранный крип мгновенно убивается, давая золото и опыт в виде награды, если это был противник, или добиваясь, если это был союзник. Несмотря на визуальные эффекты, восстановление здоровья и маны происходит мгновенно при применении.",
        "Может быть применена на любое существо, кроме героев, иллюзий, клонов, крипов-геров, вардов, построек и Рошана.",
        "Не может быть использована на древних крипов днём, но может быть использована на них ночью.",
        "Выбранный крип мгновенно убивается, давая золото и опыт в виде награды, если это был противник, или добиваясь, если это был союзник.",
        "Несмотря на визуальные эффекты, восстановление здоровья и маны происходит мгновенно при применении."
      ],
      "mana": "20",
      "item_behaviour": [],
      "name": "Hunter in the Night",
      "cooldown": "0",
      "description": "Ночью герой оказывается в своей стихии: он атакует и передвигается увеличенной скоростью.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+1,07",
        "Доп. скорость передвижения: 22%\/28%\/34%\/40% ( 37%\/43%\/49%\/55%)",
        "Доп. скорость атаки: 20\/40\/60\/80 ( 120\/140\/160\/180)",
        "Дальность применения: 150",
        "Восстановление от макс. здоровья: 35%",
        "Восстановление от макс. маны: 35%"
      ],
      "legacy_key": "G",
      "story": "Охотничье мастерство Баланара возрастает с наступлением ночи."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Night_Stalker_Dark_Ascension.mp3\/revision\/latest?cb=20191216021025",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "У ночи от Dark Ascension ниже приоритет, чем у дня, вызванного Supernova. Пока на карте светло от Supernova, Night Stalker всё также летает, обладает дополнительным уроном и беспрепятственным обзором, но обзор ограничивается его базовым дневным значением.",
        "Пока на карте светло от Supernova, Night Stalker всё также летает, обладает дополнительным уроном и беспрепятственным обзором, но обзор ограничивается его базовым дневным значением.",
        "При использовании ночью остаточная анимация равна 0,5.",
        "Даёт обычный прямой бонусный урон от атаки. Выбор таланта на увеличение урона значение обновляется мгновенно, даже во время действия способности.",
        "Выбор таланта на увеличение урона значение обновляется мгновенно, даже во время действия способности."
      ],
      "mana": "150\/140\/130 (TagTalent 100\/90\/80)",
      "item_behaviour": [],
      "name": "Dark Ascension",
      "cooldown": "125\/175\/225",
      "description": "Подавляет солнечный свет, создавая непроглядную тьму и раскрывая силы героя в полной мере. Он получает беспрепятственный обзор, свободное передвижение и дополнительный урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дополнительный урон: 50\/100\/150 ( 85\/135\/185)",
        "Длительность: 30 ( 38)"
      ],
      "legacy_key": "R",
      "story": "Жалкое зрелище: даже сильнейшие из воинов начинают бояться темноты."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.2,
    "attrAgility": 18.0
  },
  "description": "−50 сек. перезарядки Dark Ascension +100 к скорости атаки от Hunter in the Night +20 к силе −5 сек. перезарядки Crippling Fear Hunter in the Night дает +15% к сопр. эффектам +35 к урону от Dark Ascension +8 сек. действия Dark Ascension +50 к урону от Void",
  "history": "О том, откуда появился Баланар, никто не знает доподлинно; ходят лишь слухи. Древние сказания каждой расы и культуры повествуют о невообразимом времени, когда не было ещё дня и солнца, когда миром правила одна только ночь — и населяли её создания тьмы, подобные Баланару. Говорят, что на рассвете Первого дня все ночные твари сгинули. Все, кроме одной. Баланар — воплощение зла, и он упивается своей жестокостью. Именно он стал прообразом разнообразных бабаек и кощеев, и с незапамятных времён именно его тенью пугали непослушных детей. Баланар наслаждается такой ролью и играет её в самой полной мере. Под покровом ночи он ищет опрометчивых и беспомощных — тех, кто отбился от света и позабыл древние истории. Баланар — живое доказательство того, что самый кошмарный сон ребёнка... это совсем не сон."
}