{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Skull_Basher.mp3\/revision\/latest?cb=20141214201224",
      "effects": [
        "Шанс для героев ближнего боя: 25%",
        "Шанс для героев дальнего боя: 10%",
        "Урон: 100",
        "Длительность оглушения: 1,5"
      ],
      "notes": [
        "Не сочетается с другими Abyssal Blade и Skull Basher. Не может сработать у Slardar, Spirit Breaker и Faceless Void. Если Morphling при помощи Morph превратится в Slardar или Spirit Breaker, то Bash будет срабатывать. Bash не будет срабатывать, если Morphling превратится в Faceless Void с изученным Time Lock.",
        "Не может сработать у Slardar, Spirit Breaker и Faceless Void.",
        "Если Morphling при помощи Morph превратится в Slardar или Spirit Breaker, то Bash будет срабатывать. Bash не будет срабатывать, если Morphling превратится в Faceless Void с изученным Time Lock.",
        "При наличии нескольких предметов со способностью Bash, работать будет та, которая дольше находится в инвентаре.",
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Бонусный урон от Bash может использоваться вампиризмом. Однако, не может быть критическим или прорубающим.",
        "Урон можно уменьшить с Static Link. Однако его нельзя усилить с помощью Empower или Руна двойного урона.",
        "Однако его нельзя усилить с помощью Empower или Руна двойного урона.",
        "В среднем добавляет 25 урона каждой атаке для героев ближнего боя, и 10 урона для героев дальнего боя.",
        "Не работает против вардов и строений, но работает против союзных юнитов.",
        "Bash использует псевдослучайное распределение."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": null,
      "description": "Каждая атака может оглушить цель на 1,5 сек. и нанести 100 физического урона. Вероятность зависит от типа атаки владельца: 25% в ближнем бою, 10% — в дальнем.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "200 здоровья и 1 восстановления здоровья.",
    "10 основного урона от атаки героям силы."
  ],
  "cost": "2875",
  "lore": null,
  "consistFrom": [
    "Mithril Hammer",
    "Belt of Strength",
    "Recipe"
  ],
  "name": "Skull Basher",
  "description": "Устрашающее оружие в умелых руках, этот молот способен уничтожить любую защиту. Не стоит его недооценивать.",
  "trivia": null,
  "upgradeIn": [
    "Abyssal Blade"
  ],
  "tips": null
}