{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/00\/Eul%27s_Scepter_of_Divinity.mp3\/revision\/latest?cb=20141214200300",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Двойной щелчок по предмету применит его на владельца.",
        "Применяет к цели эффект урагана, делая её неуязвимой и полностью обезвреживая.",
        "При использовании применяет к цели базовое развеивание.",
        "Cyclone сначала применяет неуязвимость, а потом развеивание.",
        "Может выбрать только врагов, владельца или клонов Meepo и Tempest Double. Не может выбрать других союзников, варды или строения.",
        "Когда существо в воздухе, остальные существа не могут под ним проходить.",
        "Урон наносится по окончанию действия. Если ураган развеяли, то он все равно нанесет урон при приземлении цели.",
        "Урон наносится только вражеским целям.",
        "Можно применить на Рошана, но без какого-либо эффекта, поскольку у Рошана иммунитет к принудительному движению. При этом урон все равно нанесётся."
      ],
      "mana": "175",
      "abilityName": "Cyclone",
      "cooldown": null,
      "description": "Поднимает выбранную цель в воздух, делая её неуязвимой на 2.5 сек. Можно использовать только на себя или противника. Если применить на врага, то по приземлении он получит 50 магического урона.",
      "params": [
        "Дальность применения: 575",
        "Урон: 50",
        "Длительность: 2.5"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_partial_symbol)^Частично проходит сквозь иммунитет к заклинаниям\nМожно использовать на себя через иммунитет к заклинаниям\nНельзя применить на врага с иммунитетом."
      ],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 120 маны и 4 регенерации маны.",
    "Для героев ловкости, даёт 120 маны и 4 регенерации маны.",
    "Для героев интеллекта, даёт 120 маны, 4 регенерации маны и 10 урона от атаки.",
    "Скорость передвижения суммируется с бонусами от других Eul's Scepter of Divinity.",
    "Складывается с другими источниками доп. скорости передвижения."
  ],
  "cost": "2725",
  "lore": null,
  "consistFrom": [
    "Staff of Wizardry",
    "Wind Lace",
    "Void Stone",
    "Recipe"
  ],
  "boughtFrom": "Магия",
  "name": "Eul's Scepter of Divinity",
  "description": "Мистический скипетр, прошедший сквозь века, позволяет призывать на помощь силу ветра, которая может быть использована как с добрыми, так и плохими намерениями.",
  "trivia": [
    "Название скипетра — отсылка к Eul, создавшему самую первую карту Defense of the Ancients в 2003 году.",
    "Способность скипетра так же может быть отсылкой к Эолу, древнегреческому богу ветров.",
    "Косметический предмет для Crystal Maiden - Eul's Scepter of Divinity - основан на предмете Eul's Scepter of Divinity и использует его название."
  ],
  "upgradeIn": [
    "Wind Waker"
  ],
  "bonuses": [
    "+10 к интеллекту",
    "+3,5 к регенерации маны",
    "+20 к скорости передвижения"
  ],
  "tips": null
}