{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Срабатывание Reincarnation применяет Wraithfire Blast",
          "talentRight": "–2 сек. перезарядки Mortal Strike"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+6 к минимальному числу скелетов",
          "talentRight": "+25% к прорубанию"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+24 к урону скелетов",
          "talentRight": "+0,7 сек. оглушения от Wraithfire Blast"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости атаки",
          "talentRight": "+20 к скорости передвижения"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/87\/Wraith_King_Wraithfire_Blast_1.mp3\/revision\/latest?cb=20191216030829",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета снаряда - 1000 единиц.",
        "Оглушение и замедление применяются одновременно, поэтому замедление будет длится 3,1\/3,4\/3,7\/4 (TagTalent 3,8\/4,1\/4,4\/4,7 сек.",
        "Наносит базовый урон сразу при попадании, а периодический - с интервалом в 1 секунду сразу после оглушения.",
        "Наносит до 100\/160\/220\/280 единиц урона (до уменьшений).",
        "Способность сначала наносит урон, затем применяет дебаффы.",
        "Применение Wraithfire Blast отдает приказ атаковать цель всем скелетам Wraith King.",
        "С изученным талантом 25-го уровня способность будет автоматически применяться на вражеских существ в радиусе от Wraith King при срабатывании Reincarnation. Снаряды наносят полный урон и применяют оглушения как при обычном применении; но в этом случае скорость полёта снаряда меньше - 500. Если при выбранном таланте Wraithfire Blast не изучена, то Reincarnation все еще будет замедлять противников после срабатывания. После изучения способность заменяет замедление. Снаряды будут задевать невидимых существ и существ в тумане войны. При этом невидимые цели мгновенно избегают снарядов.",
        "Снаряды наносят полный урон и применяют оглушения как при обычном применении; но в этом случае скорость полёта снаряда меньше - 500.",
        "Если при выбранном таланте Wraithfire Blast не изучена, то Reincarnation все еще будет замедлять противников после срабатывания. После изучения способность заменяет замедление.",
        "Снаряды будут задевать невидимых существ и существ в тумане войны. При этом невидимые цели мгновенно избегают снарядов."
      ],
      "mana": "95\/110\/125\/140",
      "hotKey": "Q",
      "cooldown": "14\/12\/10\/8",
      "description": "Герой опаляет цель призрачным огнём, оглушая её и нанося ей урон. После оглушения цель будет получать периодический урон и замедлится.",
      "spellName": "Wraithfire Blast",
      "params": [
        "Анимация применения: 0,35+0,5",
        "Дальность применения: 525",
        "Урон: 60\/80\/100\/120",
        "Периодический урон: 20\/40\/60\/80",
        "Замедление скорости передвижения: 20%",
        "Длительность дебаффа: 2",
        "Длительность оглушения: 1,1\/1,4\/1,7\/2 (TagTalent 1,8\/2,1\/2,4\/2,7)",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян. Wraithfire Blast, появляющиеся от Reincarnation с выбранным талантом, не выбирают существ с иммунитетом.",
        "Блокируется попадание снаряда. Снаряды от Reincarnation также блокируются.",
        "Взрывы от Reincarnation также можно избежать."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Wraith_King_Mortal_Strike_2.mp3\/revision\/latest?cb=20191216030817",
      "effects": [
        "Способность Ненаправленная \/ Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Складывается с другими источниками вампиризма.",
        "Вампиризм не работает при атаке вардов, строений и союзных существ.",
        "Заряд дается за каждые 2 существа, убитых Wraith King любым способом. За каждый заряд призывается 1 скелет, достигая 0\/1\/2\/3\/4\/5\/6\/7\/8 (TagTalent 6\/7\/8\/9\/10\/11\/12\/13\/14) скелетов за 0\/1\/2\/3\/4\/5\/6\/7\/8 зарядов. Скелеты появляются с интервалом в 0,25 секунды сразу после применения. В этом случае длительность призыва составляет 0 \/ 0,25 \/ 0,5 \/ 0,75 \/ 1 \/ 1,25 \/ 1,5 \/ 1,75 (TagTalent 2 \/ 2,25 \/ 2,5 \/ 2,75 \/ 3 \/ 3,25) сек.",
        "За каждый заряд призывается 1 скелет, достигая 0\/1\/2\/3\/4\/5\/6\/7\/8 (TagTalent 6\/7\/8\/9\/10\/11\/12\/13\/14) скелетов за 0\/1\/2\/3\/4\/5\/6\/7\/8 зарядов.",
        "Скелеты появляются с интервалом в 0,25 секунды сразу после применения.",
        "В этом случае длительность призыва составляет 0 \/ 0,25 \/ 0,5 \/ 0,75 \/ 1 \/ 1,25 \/ 1,5 \/ 1,75 (TagTalent 2 \/ 2,25 \/ 2,5 \/ 2,75 \/ 3 \/ 3,25) сек.",
        "Скелеты появляются в случайном месте в радиусе 300 от Wraith King.",
        "Скелеты неподконтрольны. Они автоматически выбирают цель для атаки в радиусе 6500 единиц. Если существ поблизости нет, они движутся к ближайшей линии и идут по маршруту линейных крипов. Если цель атаки стала невидимой, то скелеты могут остановится и ничего не делать. Спустя некоторое время они выберут новую цель или вернутся на линии. Все скелеты в радиусе 2000 единиц вокруг Wraith King переключаются на цель Wraithfire Blast. Скелеты не блокируют лагери нейтральных крипов.",
        "Если существ поблизости нет, они движутся к ближайшей линии и идут по маршруту линейных крипов.",
        "Если цель атаки стала невидимой, то скелеты могут остановится и ничего не делать. Спустя некоторое время они выберут новую цель или вернутся на линии.",
        "Все скелеты в радиусе 2000 единиц вокруг Wraith King переключаются на цель Wraithfire Blast.",
        "Скелеты не блокируют лагери нейтральных крипов.",
        "После смерти скелеты возрождаются. Возрождение нельзя предотвратить. Как и в случае с воскреснувшими героями, за возродившихся скелетов не дают золота и опыта. Возрождение не сбрасывает длительность жизни скелетов, поэтому после истечения времени они умирают.",
        "Как и в случае с воскреснувшими героями, за возродившихся скелетов не дают золота и опыта.",
        "Возрождение не сбрасывает длительность жизни скелетов, поэтому после истечения времени они умирают."
      ],
      "mana": "65\/70\/75\/80",
      "hotKey": "W",
      "cooldown": "50",
      "description": "Wraith King каждой атакой восстанавливает себе здоровье в зависимости от нанесённого урона. Каждые два убитых существа дают один заряд, за который можно призвать скелета. Скелеты имеют ауру от Vampiric Spirit. Погибшие скелеты возрождаются один раз.",
      "spellName": "Vampiric Spirit",
      "params": [
        "Анимация применения: 0,1+0,5",
        "Вампиризм: 10%\/18%\/26%\/34%",
        "Радиус появления скелетов: 300",
        "Убийств крипов для заряда: 2",
        "Максимум зарядов: 2\/4\/6\/8",
        "Доп. скелетов за заряд: 1",
        "Задержка возрождения скелета: 3",
        "Время жизни скелета: 60",
        "Базовое число скелетов: 6",
        "Вампиризм отключается истощением, получение зарядов — нет. Вампиризм у скелетов отключается только в случае действия истощения на Wraith King."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1c\/Wraith_King_Mortal_Strike_1.mp3\/revision\/latest?cb=20191216030821",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Не срабатывает при атаке вардов, строений и союзников.",
        "Атаки, от которых уклонились или которые промахнулись, не запускают перезарядку."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Позволяет нанести атакой дополнительный урон.",
      "spellName": "Mortal Strike",
      "params": [
        "Критический урон: 150%\/190%\/230%\/270%",
        "Красные цифры критического урона отображаются до учета уменьшения урона от иллюзий и брони."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Wraith_King_Reincarnation_1.mp3\/revision\/latest?cb=20191216030825",
      "effects": [
        "Способность Пассивная (TagAghanim Аура)",
        "Действует на Себя (TagAghanim Союзных героев)"
      ],
      "notes": [
        "Reincarnation нельзя ничем предотвратить, если у Wraith King достаточно маны, а сама способность не на перезарядке.",
        "Возвращает к жизни с полным запасом здоровья и маны. Заклинания и предметы не обновляются.",
        "Дает наземный обзор в радиусе 1800\/800 в месте смерти во время задержки.",
        "Если у Wraith King есть Aegis of the Immortal, Reincarnation сработает первой при условии готовности и наличия маны у владельца.",
        "Замедление применяется к вражеским героям (включая клонов, но исключая иллюзии и крипов-героев) при срабатывании Reincarnation.",
        "С талантом 25 уровня при срабатывании Reincarnation применяется Wraithfire Blast к врагами в радиусе 900. Смотрите примечания к Wraithfire Blast.",
        "Смотрите примечания к Wraithfire Blast.",
        "С Aghanim's Scepter Reincarnation распространяет ауру. Бафф ауры задерживается на 0,5 сек. Аура действует только на союзных героев (включая клонов и иллюзии, но исключая крипов-героев), включая самого Wraith King. Не действует на неуязвимых или спрятанных героев. Аура действует на ближайших союзников, даже если Wraith King мертв.",
        "Аура действует только на союзных героев (включая клонов и иллюзии, но исключая крипов-героев), включая самого Wraith King.",
        "Не действует на неуязвимых или спрятанных героев.",
        "Аура действует на ближайших союзников, даже если Wraith King мертв.",
        "Союзник становится призраком, когда его здоровье достигает 1, если только на него не действует Shallow Grave, Battle Trance или у него есть воскрешение.",
        "Призраки остаются живыми, поскольку их минимальное здоровье приравнено к 1. Урон, получаемый ими, технически не уменьшается. Действует и на клонов.",
        "Действует и на клонов.",
        "Задержка смерти не срабатывает в следующих случаях: Герой — иллюзия (хотя аура накладывается на иллюзии, она не работает). Герой умер из-за особенности способности: завершилось время жизни (TagTalent Tempest Double) или принудительная смерть (TagTalent Divided We Stand). Герой умер от глобального мгновенного урона Powershot, улучшенной Aghanim's Shard.",
        "Герой — иллюзия (хотя аура накладывается на иллюзии, она не работает).",
        "Герой умер из-за особенности способности: завершилось время жизни (TagTalent Tempest Double) или принудительная смерть (TagTalent Divided We Stand).",
        "Герой умер от глобального мгновенного урона Powershot, улучшенной Aghanim's Shard.",
        "Задержка смерти дает героям беспрепятственное движение, позволяя проходить сквозь существ, деревья и через возвышенности. Форма призрака увеличивает модель героя на 25% на всю длительность. Не влияет на размер столкновения. Также увеличивает скорость атаки и передвижения героя на всю длительность. Союзники-призраки действуют как обычные герои, и на них можно воздействовать чем угодно. То есть призраков можно атаковать и выбирать целью заклинаний и на них продолжают действовать все баффы и дебаффы.",
        "Форма призрака увеличивает модель героя на 25% на всю длительность. Не влияет на размер столкновения.",
        "Также увеличивает скорость атаки и передвижения героя на всю длительность.",
        "Союзники-призраки действуют как обычные герои, и на них можно воздействовать чем угодно.",
        "То есть призраков можно атаковать и выбирать целью заклинаний и на них продолжают действовать все баффы и дебаффы.",
        "По окончании действия способности герой умирает. Награду за убийство получает тот, кто нанес смертельный удар перед воскрешением. Эту смерть нельзя ничем предотвратить: она игнорирует неуязвимость и любые эффекты, обычно предотвращающие смерть. Если у героя есть воскрешение, оно сработает после смерти героя.",
        "Эту смерть нельзя ничем предотвратить: она игнорирует неуязвимость и любые эффекты, обычно предотвращающие смерть.",
        "Если у героя есть воскрешение, оно сработает после смерти героя.",
        "Если герой превратился в призрака, то его уже никак нельзя спасти. Он обязательно умрет, как только",
        "С Aghanim's Shard при срабатывании Reincarnation за каждого вражеского героя в радиусе 900 призывается 3 королевских скелета. Учитывает только вражеских героев (включая клонов, но исключая иллюзии и крипов-героев). Если Vampiric Spirit не изучена, то скелеты не призываются. Скелеты призываются за невидимых существ и существ в тумане войны.",
        "Учитывает только вражеских героев (включая клонов, но исключая иллюзии и крипов-героев).",
        "Если Vampiric Spirit не изучена, то скелеты не призываются.",
        "Скелеты призываются за невидимых существ и существ в тумане войны."
      ],
      "mana": "180 (TagTalent 0)",
      "hotKey": "R",
      "cooldown": "200\/130\/60",
      "description": "После смерти тело героя вновь собирается воедино, и он воскрешается на поле боя. Замедляет всех врагов в радиусе 900.",
      "spellName": "Reincarnation",
      "params": [
        "Радиус действия на врагов: 900",
        "Задержка эффекта: 3",
        "Замедление скорости передвижения: 75% (TagTalent 0%)",
        "Замедление скорости атаки: 75 (TagTalent 0)",
        "Длительность замедления: 5 (TagTalent 0)",
        "Радиус появления призраков: 1200",
        "Доп. скорость передвижения призраков: 25%",
        "Доп. скорость атаки призраков: 75",
        "Длительность задержки ауры: 0,5",
        "Время жизни призраков: 7",
        "Число скелетов за героя: 3",
        "Если вблизи умрёт союзный герой, то он превратится в призрака, отложив свою смерть на 7 сек. Герой-призрак получает +75 к скорости атаки и +25% к скорости передвижения.",
        "Способность не расходует ману. Её срабатывание призывает по три скелета рядом с каждым вражеским героем неподалёку.",
        "Замедление не действует на врагов с иммунитетом к заклинаниям. Замедление остается, если дебафф был применен до иммунитета и не был развеян. Аура задержки смерти действует на союзников с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.7,
    "attrAgility": 18.0
  },
  "description": "Wraith King — это герой с ближним типом атаки, основным атрибутом которого является Сила. Его первая способность, Wraithfire Blast, поджигает врага спектральным огнем, оглушая его и нанося урон. После окончания оглушения жертва продолжает получать урон в течение некоторого времени, а скорость ее передвижения снижается. Первая пассивная способность, Vampiric Aura, дает эффект вампиризма. Вторая пассивная способность, Mortal Strike, дает шанс нанести критический удар по герою, а также призывать скелетов в зависимости от количества убитых ранее крипов. Пассивная ультимативная способность, Reincarnation, воскрешает его после смерти подобно Aegis of the Immortal, делая его трудно убиваемым, и замедляет всех врагов в радиусе вокруг него. Улучшение с Aghanim's Scepter превращает в призраков, умерших вблизи союзных героев, отложив их и свою смерть на 7 секунд.",
  "history": "Бессчётные годы Остарион строил королевство на останках своих врагов. То была навязчивая привычка, в которой монарх коротал вечное, будто бы нескончаемое правление. Он считал, что будет жить вечно, покуда башни его дворца продолжают стремиться ввысь. Но со временем он осознал, что заблуждался... Что даже кости однажды обратятся в прах. Не веря плоти, он искал надёжный способ продлить своё правление, и в конце концов заключил: ему нужна была энергия призраков, форма чистого духа, которую некоторые тёмные души выделяют в миг смерти. Остарион надеялся вселить в себя призрачное естество и этим обрести лик столь же ясный и вечный, как его самолюбие. В Ночь призраков, солнцестояние на границе веков, он погрузился в обряд превращения и приказал подданным собрать достаточно душ, дабы он обрёл желанное бессмертие. Никто не знает, сколько его слуг пало в ту ночь, ведь единственным достойным внимания выжившим был сам король, перерождённый со следующим восходом солнца. Отныне он не восседает на престоле, но идёт по полю боя с мечом наголо, требуя верности не только до самой смерти, но и за её пределами.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Срабатывание Reincarnation применяет Wraithfire Blast",
      "talentRight": "–2 сек. перезарядки Mortal Strike"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+6 к минимальному числу скелетов",
      "talentRight": "+25% к прорубанию"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+24 к урону скелетов",
      "talentRight": "+0,7 сек. оглушения от Wraithfire Blast"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости атаки",
      "talentRight": "+20 к скорости передвижения"
    }
  ]
}