{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Wraith King: 240 здоровья, 1,2 регенерации здоровья и 12 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Срабатывание Reincarnation применяет Wraithfire Blast",
          "talentRight": "-2s перезарядки Mortal Strike"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+6 скелетов",
          "talentRight": "+30 к скорости передвижения"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+24 к урону скелетов",
          "talentRight": "+12 к силе"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости атаки",
          "talentRight": "–1 сек. перезарядки Wraithfire Blast"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/87\/Wraith_King_Wraithfire_Blast_1.mp3\/revision\/latest?cb=20191216030829",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета снаряда - 1000 единиц.",
        "Оглушение и замедление применяются одновременно, поэтому замедление будет длится 3,1\/3,4\/3,7\/4 секунд.",
        "Наносит базовый урон сразу при попадании, а периодический - с интервалом в 1 секунду сразу после оглушения.",
        "Наносит до 90\/140\/190\/240 единиц урона (до уменьшений).",
        "Способность сначала наносит урон, затем применяет дебаффы.",
        "Применение Wraithfire Blast отдает приказ атаковать цель всем скелетам Wraith King.",
        "С изученным талантом 25-го уровня способность будет автоматически применяться на вражеских существ в радиусе от Wraith King при срабатывании Reincarnation. Снаряды наносят полный урон и применяют оглушения как при обычном применении; но в этом случае скорость полёта снаряда меньше - 500. Если при выбранном таланте Wraithfire Blast не изучена, то Reincarnation все еще будет замедлять противников после срабатывания. После изучения способность заменяет замедление. Снаряды будут задевать невидимых существ и существ в тумане войны. При этом невидимые цели мгновенно избегают снарядов.",
        "Снаряды наносят полный урон и применяют оглушения как при обычном применении; но в этом случае скорость полёта снаряда меньше - 500.",
        "Если при выбранном таланте Wraithfire Blast не изучена, то Reincarnation все еще будет замедлять противников после срабатывания. После изучения способность заменяет замедление.",
        "Снаряды будут задевать невидимых существ и существ в тумане войны. При этом невидимые цели мгновенно избегают снарядов."
      ],
      "mana": "95\/110\/125\/140",
      "hotKey": "Q",
      "cooldown": "14\/12\/10\/8 (TagTalent 13\/11\/9\/7)",
      "description": "Герой опаляет цель призрачным огнём, оглушая её и нанося ей урон. После оглушения цель будет получать периодический урон и замедлится.",
      "spellName": "Wraithfire Blast",
      "params": [
        "Анимация применения: 0,35+0,5",
        "Дальность применения: 525",
        "Урон: 70\/80\/90\/100",
        "Периодический урон: 10\/30\/50\/70",
        "Замедление скорости передвижения: 20%",
        "Длительность оглушения: 1.1\/1.4\/1.7\/2",
        "Длительность замедления и периодического урона: 2",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян. Wraithfire Blast, появляющиеся от Reincarnation с выбранным талантом, не выбирают существ с иммунитетом.",
        "Блокируется попадание снаряда. Снаряды от Reincarnation также блокируются.",
        "Взрывы от Reincarnation также можно избежать."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Остарион призывает своих проклятых предков, уничтожая противников."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзных героев"
      ],
      "notes": [
        "За каждый заряд призывается скелет, достигая 0\/1\/2\/3\/4\/5\/6\/7\/8 (TagTalent 6\/7\/8\/9\/10\/11\/12\/13\/14) скелетов за 0\/1\/2\/3\/4\/5\/6\/7\/8 зарядов.",
        "Заряд дается после убийства Wraith King любых двух существ любым способом.",
        "Скелеты появляются с интервалом в 0,25 секунды сразу после применения.",
        "Скелеты неподконтрольны. Они автоматически выбирают цель для атаки в радиусе 6500 единиц. Если существ поблизости нет, они движутся к ближайшей линии и идут по маршруту обычных линейных крипов. Если цель атаки стала невидимой, то скелеты могут остановится и ничего не делать. Спустя некоторое время они выберут новую цель или вернутся на линии. Все скелеты в радиусе 2000 единиц вокруг Wraith King переключаются на цель Wraithfire Blast. Скелеты не блокируют лагери нейтральных крипов.",
        "Если существ поблизости нет, они движутся к ближайшей линии и идут по маршруту обычных линейных крипов.",
        "Если цель атаки стала невидимой, то скелеты могут остановится и ничего не делать. Спустя некоторое время они выберут новую цель или вернутся на линии.",
        "Все скелеты в радиусе 2000 единиц вокруг Wraith King переключаются на цель Wraithfire Blast.",
        "Скелеты не блокируют лагери нейтральных крипов.",
        "После смерти скелеты возрождаются. Возрождение нельзя предотвратить. Как и в случае с воскреснувшими героями, за возродившихся скелетов не дают золота и опыта. Возрождение не сбрасывает длительность жизни скелетов, поэтому после истечения времени они умирают.",
        "Как и в случае с воскреснувшими героями, за возродившихся скелетов не дают золота и опыта.",
        "Возрождение не сбрасывает длительность жизни скелетов, поэтому после истечения времени они умирают.",
        "Складывается с другими источниками вампиризма.",
        "Вампиризм не работает при атаке вардов, строений и союзных существ.",
        "Эффект от ауры задерживается на секунды.",
        "Действует на неуязвимых, но не спрятанных союзников.",
        "Эффекты частиц вампиризма не появляются, если Wraith King не виден врагам."
      ],
      "mana": "50\/60\/70\/80.",
      "hotKey": "W",
      "cooldown": "50",
      "description": "Wraith King каждой атакой восстанавливает себе здоровье в зависимости от нанесённого урона. Каждые два убитых существа дают один заряд, за который можно призвать скелета. Скелеты имеют ауру от Vampiric Spirit. Погибшие скелеты возрождаются один раз.",
      "spellName": "Vampiric Spirit",
      "params": [
        "Анимация применения: 0.1+0.5",
        "Вампиризм: 10%\/18%\/26%\/34%.",
        "Радиус появления скелетов: 300",
        "Убийств крипов для заряда: 2",
        "Максимум зарядов: 2\/4\/6\/8.",
        "Доп. скелетов за заряд: 1",
        "Длительность жизни скелета: 60.",
        "Задержка возрождения скелета: 3",
        "Базовое число скелетов: 6"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Королевский клинок питает ауру хозяина, вытягивая из врагов жизненные силы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1c\/Wraith_King_Mortal_Strike_1.mp3\/revision\/latest?cb=20191216030821",
      "effects": [
        "Способность Ненаправленная \/ Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "В среднем увеличивает урон на -150%\/-190%\/-230%\/-270%.",
        "В отличие от всех остальных критических ударов действует на варды.",
        "Звук и частицы появляются при начале атаки, а не при попадании."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Позволяет нанести атакой дополнительный урон.",
      "spellName": "Mortal Strike",
      "params": [
        "Критический урон: 150%\/190%\/230%\/270%",
        "Красные цифры критического урона отображаются до учета уменьшения урона от иллюзий и брони."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Один удар, дабы сокрушить врага."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Wraith_King_Reincarnation_1.mp3\/revision\/latest?cb=20191216030825",
      "effects": [
        "Способность Пассивная (TagAghanim Аура)",
        "Действует на Себя (TagAghanim Союзных героев)"
      ],
      "notes": [
        "Reincarnation нельзя ничем предотвратить, если у Wraith King достаточно маны, а сама способность не на перезарядке.",
        "Возвращает к жизни с полным запасом здоровья и маны. Перезарядка заклинаний и предметов не обновляется.",
        "Дает наземный обзор в радиусе 1800\/800 в месте смерти в момент задержки.",
        "Если Wraith King имеет одновременно Aegis of the Immortal, готовую способность и достаточно маны, то способность сработает первой.",
        "Замедление применяется один раз при начале перерождения, но не в конце.",
        "Улучшение от Aghanim's Scepter добавляет способности ауру. Бафф ауры задерживается на 0,5 секунды.",
        "Аура действует на союзных героев, включая самого Wraith King. Она не действует на иллюзии или крипов-героев.",
        "Задержка смерти не действует на неуязвимых или спрятанных героев, поэтому они умрут до превращения в призрака.",
        "Союзник становится призраком, когда его здоровье достигает 1, если только на него не действует Shallow Grave, Battle Trance или у него есть воскрешение.",
        "Призраки остаются живыми, поскольку их минимальное здоровье приравнено к 1. Урон, получаемый ими, технически не уменьшается. Когда Meepo или один из его клонов умирает вне радиуса ауры, в то время как любой из клонов остается внутри, то умерший не становится призраком. При этом если клон Meepo умирает в пределах ауры, Meepo становится призраком, откладывая смерть. Несколько Meepo могут одновременно быть призраками. Когда у одного из них завершится форма или другой умрет вне радиуса ауры, то Meepo умирает. Cоюзный Tempest Double может стать призраком, если его здоровье достигнет 1 до завершения длительности жизни. Tempest Double не становится призраком, если таймер длительности достигает 0. Он просто исчезает вне зависимости от того, действовала на него аура или нет. Tempest Double, ставшие призраками, исчезнут, как только таймер длительности достигнет 0. Их длительность не увеличивается.",
        "Когда Meepo или один из его клонов умирает вне радиуса ауры, в то время как любой из клонов остается внутри, то умерший не становится призраком.",
        "При этом если клон Meepo умирает в пределах ауры, Meepo становится призраком, откладывая смерть.",
        "Несколько Meepo могут одновременно быть призраками. Когда у одного из них завершится форма или другой умрет вне радиуса ауры, то Meepo умирает.",
        "Cоюзный Tempest Double может стать призраком, если его здоровье достигнет 1 до завершения длительности жизни.",
        "Tempest Double не становится призраком, если таймер длительности достигает 0. Он просто исчезает вне зависимости от того, действовала на него аура или нет.",
        "Tempest Double, ставшие призраками, исчезнут, как только таймер длительности достигнет 0. Их длительность не увеличивается.",
        "Задержка смерти дает героям беспрепятственное движение, позволяя проходить сквозь существ, деревья и через возвышенности.",
        "Союзники-призраки могут действовать как обычные герои, но на них все так же можно воздействовать чем угодно - просто это не убьет их. То есть призраков можно атаковать и выбирать целью заклинаний, обезвреживая их. Также при превращении на героев продолжают действовать все баффы и дебаффы. Эффекты не развеиваются.",
        "То есть призраков можно атаковать и выбирать целью заклинаний, обезвреживая их.",
        "Также при превращении на героев продолжают действовать все баффы и дебаффы. Эффекты не развеиваются.",
        "По окончании действия способности призрак исчезает, а награду за убийство получает тот, кто нанес смертельный удар перед воскрешением.",
        "Если герой превратился в призрака, то его уже никак нельзя спасти. Он обязательно умрет, как только эффект завершится, даже если герой успел получить неуязвимость или эффект Shallow Grave. Если герой получит воскрешение в форме призрака, то способность сработает.",
        "Если герой получит воскрешение в форме призрака, то способность сработает.",
        "Форма призрака увеличивает модель героя на 25% на всю длительность. Не влияет на размер столкновения.",
        "Аура задержки смерти дается ближайшим союзникам даже если Wraith King мертв."
      ],
      "mana": "160 (TagTalent 0)",
      "hotKey": "R",
      "cooldown": "200\/120\/40",
      "description": "После смерти тело героя вновь собирается воедино, и он воскрешается на поле боя. Замедляет всех врагов в радиусе 900.",
      "spellName": "Reincarnation",
      "params": [
        "Радиус замедления\/применения Wraithfire Blast: 900",
        "Задержка эффекта: 3",
        "Замедление скорости передвижения: 75% (TagTalent 0%)",
        "Замедление скорости атаки: 75 (TagTalent 0)",
        "Длительность замедления: 5 (TagTalent 0)",
        "Радиус появления призраков: 0 (TagAghanim 1200)",
        "Длительность задержки ауры: 0 (TagAghanim 0,5)",
        "Длительность жизни призраков: 0 (TagAghanim 7)",
        "Число скелетов за героя: 3",
        "Если вблизи умрет союзный герой, то он превратится в призрака, отложив свою смерть на 0,5 секунд.",
        "На Reincarnation больше не требуется мана. Срабатывание способности призывает по 3 скелета рядом с каждым вражеским героем неподалеку.",
        "Замедление не действует на врагов с иммунитетом к заклинаниям. Замедление остается, если дебафф был применен до иммунитета и не был развеян. Аура задержки смерти действует на союзников с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Заговорщики не перестают удивляться тому, что король всё никак не умрёт."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.7,
    "attrAgility": 18.0
  },
  "description": "Wraith King — это герой с ближним типом атаки, основной характеристикой которого является Сила. Его первая способность, Wraithfire Blast, поджигает врага спектральным огнем, оглушая его и нанося урон. После окончания оглушения жертва продолжает получать урон в течение некоторого времени, а скорость ее передвижения снижается. Первая пассивная способность, Vampiric Aura, дает эффект вампиризма. Вторая пассивная способность, Mortal Strike, дает шанс нанести критический удар по герою, а также призывать скелетов в зависимости от количества убитых ранее крипов. Пассивная ультимативная способность, Reincarnation, воскрешает его после смерти подобно Aegis of the Immortal, делая его трудно убиваемым, и замедляет всех врагов в радиусе вокруг него. Улучшение с Aghanim's Scepter превращает в призраков, умерших вблизи союзных героев, отложив их и свою смерть на 7 секунд.",
  "history": "Бессчётные годы Остарион строил королевство на останках своих врагов. То была навязчивая привычка, в которой монарх коротал вечное, будто бы нескончаемое правление. Он считал, что будет жить вечно, покуда башни его дворца продолжают стремиться ввысь. Но со временем он осознал, что заблуждался... Что даже кости однажды обратятся в прах. Не веря плоти, он искал надёжный способ продлить своё правление, и в конце концов заключил: ему нужна была энергия призраков, форма чистого духа, которую некоторые тёмные души выделяют в миг смерти. Остарион надеялся вселить в себя призрачное естество и этим обрести лик столь же ясный и вечный, как его самолюбие. В Ночь призраков, солнцестояние на границе веков, он погрузился в обряд превращения и приказал подданным собрать достаточно душ, дабы он обрёл желанное бессмертие. Никто не знает, сколько его слуг пало в ту ночь, ведь единственным достойным внимания выжившим был сам король, перерождённый со следующим восходом солнца. Отныне он не восседает на престоле, но идёт по полю боя с мечом наголо, требуя верности не только до самой смерти, но и за её пределами.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Срабатывание Reincarnation применяет Wraithfire Blast",
      "talentRight": "-2s перезарядки Mortal Strike"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+6 скелетов",
      "talentRight": "+30 к скорости передвижения"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+24 к урону скелетов",
      "talentRight": "+12 к силе"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости атаки",
      "talentRight": "–1 сек. перезарядки Wraithfire Blast"
    }
  ]
}