{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "50% урона от Atrophy Aura для союзных героев",
          "talentRight": "+0,65 сек. оцепенения от Pit of Malice"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+15% к снижению урона от Atrophy Aura",
          "talentRight": "+1% к периодическому урону от Firestorm"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−4 сек. перезарядки Firestorm",
          "talentRight": "+75 к радиусу Pit of Malice"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+100 к радиусу Firestorm",
          "talentRight": "+5 к броне"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/86\/Underlord_Firestorm_1.mp3\/revision\/latest?cb=20191216025834",
      "effects": [
        "Способность Направленная на область (TagAghanim Направленная на существо)",
        "Действует на Врагов (TagAghanim Себя)",
        "Урон Магический"
      ],
      "notes": [
        "Визуальные и звуковые эффекты в области применения во время анимации применения видны и слышны только союзникам.",
        "Создает волны с интервалом в 1 секунду сразу после применения, вызывая 5 (TagTalent 8) волн.",
        "Вопреки визуальным эффектам урон волн наносится мгновенно, а не при приземлении.",
        "Дебафф горения наносит урон с интервалом в 1 секунду сразу после применения дебаффа, срабатывая 3 раза.",
        "Эффект горения от нескольких применений не складывается. Каждый интервал обновляет длительность, в результате получается 8 возможных интервалов горения.",
        "С каждой волной Firestorm сначала наносит урон, затем применяет дебафф.",
        "Не применяет дебафф горения к Рошану, но наносит урон от волн.",
        "Наносит до 150\/240\/330\/420 + 8%\/16%\/24%\/32% (TagTalent 225\/360\/495\/630 + 11%\/22%\/33%\/44%) урона от максимального здоровья (до уменьшений), если существо попало под все волны, а дебафф не был развеян.",
        "С Aghanim's Shard Firestorm можно применять на Underlord, но не на других существ. После применения волны появляются не в месте применения, а в текущем местоположении Underlord. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "После применения волны появляются не в месте применения, а в текущем местоположении Underlord.",
        "↓↓ Двойное нажатие автоматически выбирает себя."
      ],
      "mana": "100\/110\/120\/130",
      "item_behaviour": [],
      "name": "Firestorm",
      "cooldown": "12 (TagTalent 8)",
      "description": "Обрушивает на указанную область волны пламени, наносящие урон врагам. Жертвы также получают периодический урон, зависящий от их максимального запаса здоровья.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,5+0,6 (TagTalent 0,25+0,85)",
        "Дальность применения: 600\/625\/650\/675",
        "Радиус: 425",
        "Число волн: 6 (TagTalent 9)",
        "Интервал волн: 1",
        "Урон от волны: 25\/40\/55\/70",
        "Макс. здоровья в периодический урон: 1%\/2%\/3%\/4%",
        "Длительность горения: 2",
        "Позволяет применить эту способность на себя, чтобы она действовала вокруг владельца. Увеличивает число волн на 3 и вдвое уменьшает задержку перед применением.",
        "Пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Underlord_Pit_of_Malice_1.mp3\/revision\/latest?cb=20191216025837",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Визуальные эффекты и звуки в выбранной области во время анимации применения видны и слышны только союзникам.",
        "Применяет к целям оцепенение, предотвращая их передвижение, атаки и использование определенных заклинаний для передвижения. Дает эффект True Sight на цели.",
        "Дает эффект True Sight на цели.",
        "Периодически применяет оцепенение на каждого врага в области. При этом модификатор Buff Placer предотвращает преждевременное оцепенение. Этот модификатор применяется к любому существу в области, на которого он еще не действовал. Модификатор длится 3,6 секунды. При завершении действия к врагам мгновенно применяется оцепенение и скрытый модификатор. То есть Pit of Malice не применяет оцепенение к каждому существу с установленным интервалом. Оцепенение действует на существо каждые 3,6 секунды с момента попадания в область. Скрытый модификатор не пропадает при покидании области. То есть быстрое покидание, а затем возвращение в область не применит оцепенение мгновенно. Все применения способности делят один и тот же модификатор, поэтому, попав под оцепенение от одного разлома, существо получает иммунитет к другим до завершения модификатора.",
        "При этом модификатор Buff Placer предотвращает преждевременное оцепенение.",
        "Этот модификатор применяется к любому существу в области, на которого он еще не действовал. Модификатор длится 3,6 секунды.",
        "При завершении действия к врагам мгновенно применяется оцепенение и скрытый модификатор.",
        "То есть Pit of Malice не применяет оцепенение к каждому существу с установленным интервалом. Оцепенение действует на существо каждые 3,6 секунды с момента попадания в область.",
        "Скрытый модификатор не пропадает при покидании области. То есть быстрое покидание, а затем возвращение в область не применит оцепенение мгновенно.",
        "Все применения способности делят один и тот же модификатор, поэтому, попав под оцепенение от одного разлома, существо получает иммунитет к другим до завершения модификатора.",
        "Действует на невидимых существ и существ в тумане войны.",
        "Опутывает существо до 4 раз, если оно оставалось в области всю длительность, достигая длительность оцепенения до 4,8\/5,6\/6,4\/7,2 (TagTalent 7,4\/8,2\/9\/9,8) секунд.",
        "Создает опутывающий визуальный эффект вокруг затронутых героев и иллюзий, но не вокруг других затронутых существ."
      ],
      "mana": "80\/100\/120\/140",
      "item_behaviour": [],
      "name": "Pit of Malice",
      "cooldown": "21\/19\/17\/15",
      "description": "Создаёт разлом в выбранной области. Любое попавшее в него существо цепенеет. Срабатывает на каждое вражеское существо лишь раз в 3,6 сек.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,45+0,6",
        "Дальность применения: 675",
        "Радиус эффекта: 400 (TagTalent 475)",
        "Интервал оцепенения: 3,6",
        "Длительность оцепенения: 1,2\/1,4\/1,6\/1,8 (TagTalent 1,85\/2,05\/2,25\/2,45)",
        "Длительность разлома: 12"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Уменьшает только базовый урон и урон, даваемый основным атрибутом затронутого юнита. Фиксированный дополнительный урон не уменьшается.",
        "Эффект ауры задерживается на 0,5 сек.",
        "Не важно как умрет враг, Underlord всегда получает урон, пока на цель действует дебафф.",
        "Каждое увеличение урона за умершее существо длится определенное время. Получение дополнительного урона не обновляет длительность предыдущих накоплений.",
        "Дополнительный урон не исчезает при смерти Underlord.",
        "Иконка статуса эффекта появляется, когда Underlord получает урон от ауры. Эффект показывает сколько урона дает аура. Оружие Underlord также начинает светиться и испускать зеленые частицы тем сильнее, чем больше накоплений получает герой.",
        "Оружие Underlord также начинает светиться и испускать зеленые частицы тем сильнее, чем больше накоплений получает герой.",
        "Не получает дополнительный урон от смерти иллюзий, курьеров, строений, вардов, Tempest Double и Undying Zombie.",
        "Если в радиусе несколько Meepo, то Underlord получает урон только от одного из умерших клонов.",
        "Считает крипов-героев за крипов.",
        "Аура не влияет на неуязвимых и спрятанных существ.",
        "Снижение урона не действует на врагов, если у них нет обзора на Underlord. При этом Underlord продолжает получать дополнительный урон от смертей в радиусе ауры, даже если дебафф не отображается.",
        "При этом Underlord продолжает получать дополнительный урон от смертей в радиусе ауры, даже если дебафф не отображается."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Atrophy Aura",
      "cooldown": null,
      "description": "Уменьшает базовый урон всех вражеских существ неподалёку. Если жертва способности погибнет, герой временно получит дополнительный урон.",
      "hot_key": "E",
      "params": [
        "Радиус: 900",
        "Снижение урона: 5%\/15%\/25%\/35%",
        "Доп. урон за смерть героя: 30\/35\/40\/45",
        "Доп. урон за смерть не-героя: 2\/4\/6\/8",
        "Длительность: 30\/45\/60\/75",
        "Длительность задержки ауры: 0,5",
        "Доп. урон для союзных героев: 40%",
        "Отключает ауру и предотвращает получение новых накоплений. Уже существующие накопления всё еще дают урон. Положительная аура от Aghanim's Scepter не отключается истощением.",
        "Иллюзии распространяют отрицательную ауру (TagTalentи положительную при улучшении). Если вражеское существо умирает возле иллюзии, находящейся или находившейся под контролем Underlord, то урон дается герою. Если иллюзия создана врагом или союзной способностью, то урон дается иллюзии, хоть использовать его иллюзия не сможет."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/73\/Underlord_Dark_Rift_1.mp3\/revision\/latest?cb=20191216025830",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Союзных героев"
      ],
      "notes": [
        "При применении Dark Rift заменяется на Cancel Dark Rift на длительность задержки.",
        "↓↓ Двойное нажатие автоматически выбирает союзный фонтан.",
        "Можно применить на любое союзное существо, не являющееся героем (иллюзией или вардом). Можно применить на крипов-героев. С Aghanim's Scepter можно применять на любое союзное существо, не являющееся вардом.",
        "С Aghanim's Scepter можно применять на любое союзное существо, не являющееся вардом.",
        "Можно выбрать целью и телепортироваться к неуязвимым существам. Нельзя выбрать целью спрятанных существ, но телепортация всё равно произойдет, если цель исчезнет после выбора.",
        "При выборе точки на земле способность найдет ближайшую подходящую цель на карте и телепортирует к ней.",
        "Визуальные эффекты вокруг Underlord и на цели телепортации видны всем.",
        "Цель, на которую применяется Dark Rift, имеет низкий приоритет, поэтому другие существа будут выбирать ее целью автоатаки в последнюю очередь.",
        "Каждый, кто телепортируется с помощью способности, может избежать снарядов.",
        "Телепортирует только героев (включая иллюзии и клонов) и крипов-героев. Может телепортировать их, даже если существа неуязвимы или спрятаны.",
        "Если Underlord или цель телепортации умирают во время задержки, заклинание отменяется. Заклинание не отменяется, если выбранный крип сменит владельца."
      ],
      "mana": "100\/200\/300",
      "item_behaviour": [],
      "name": "Dark Rift",
      "cooldown": "130\/115\/100 (TagTalent 0)",
      "description": "Открывает тёмную брешь возле выбранного союзного существа или постройки. После небольшой задержки владелец способности и все союзные герои вокруг него телепортируются к этой бреши. Способность начнёт перезаряжаться, даже если отменить её или если цель телепортации умрёт.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,6+0,47",
        "Дальность применения: Глобальная",
        "Радиус: 600 (TagAghanim 900)",
        "Задержка до телепортации: 6\/5\/4 (TagAghanim 5\/4\/3)",
        "Число зарядов: 2",
        "Время восстановления заряда: 130\/115\/100",
        "Заменяет перезарядку способности двумя зарядами и позволяет применять её на союзных героев. Уменьшает задержку до телепортации на -1 секунду."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Underlord_Cancel_Dark_Rift.mp3\/revision\/latest?cb=20191216025832",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Dark Rift до завершения телепортации или применения этого заклинания.",
        "При применении прерывает произносимые заклинания Underlord."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Cancel Dark Rift",
      "cooldown": null,
      "description": "Отменяет телепортацию.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+1,07",
        ""
      ],
      "legacy_key": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 25.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.3,
    "attrAgilityInc": 1.6,
    "attrAgility": 12.0
  },
  "description": "Underlord – это герой с ближним типом атаки, основным атрибутом которого является сила. Его первая способность, Firestorm, создает огненный град, поджигая врагов. Горящие враги получают периодический урон. Вторая способность, Pit of Malice, создает под врагом дыру, которая удерживает врага на месте и наносит ему урон. Пассивная способность, Atrophy Aura, снижает врагам урон. Если враги погибнут под действием этой ауры, Underlord получит временную прибавку к урону. Ультимативная способность, Dark Rift, создает портал возле союзного юнита или постройки, после чего Underlord и все находящиеся рядом союзники телепортируются к порталу.",
  "history": "Сей рок не предрекала ни одна песнь, ни одна легенда. Глубоко под поверхностью внешнего мира лежат неведомые чудеса и ужасы. Закованный в земной тверди, далеко под беспокойными лавовыми полями и подножиями спящих вулканов раскинулся обсидиановый город Азийог, бесподобная каменная кладка которого простирается по безграничной пещере. В ячеистых стенах, построенных на костях бесчисленных рабов, лежат территории Орды бездны и её жестокого владыки, Врогроша. Вооружённый лучшими кузнецами своего вида и обученный управлять самим пространством, в непрерывной жажде власти он несет пламя и отчаяние в каждый мир, уничтожая или порабощая всё встреченное. Тем не менее, подземный мир невелик, и потому Врогрош обратил свой взор ко внешним просторам. Одним своим словом он обрек на погибель легионы своих разведчиков, отправив тех на растерзание обитателям поверхности, дабы оценить их мощь. Теперь же, готовый продолжить завоевание, Врогрош лично ступит на освещённую солнцем землю и провозгласит своё грядущее правление. Те же, кто встретятся ему, падут ниц и выплатят дань — или умрут на месте.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "50% урона от Atrophy Aura для союзных героев",
      "talentRight": "+0,65 сек. оцепенения от Pit of Malice"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+15% к снижению урона от Atrophy Aura",
      "talentRight": "+1% к периодическому урону от Firestorm"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−4 сек. перезарядки Firestorm",
      "talentRight": "+75 к радиусу Pit of Malice"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+100 к радиусу Firestorm",
      "talentRight": "+5 к броне"
    }
  ]
}