{
  "abilities": [
    {
      "notes": [
        "Снаряд Avalanche летит со скоростью 1200",
        "Наносит 15\/30\/45\/60 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 31\/46\/61\/76) урона с интервалом в 0,3 сек\n после достижения снарядом выбранной точки, срабатывая 5 раз\n В итоге общая длительность после падения снаряда составляет 1,2 сек\n Внутриигровое описание также включает длительность оглушения, показывая общую длительность в 1,4 сек",
        "Если существо находится под действием <span image=\"images\/toss.webp\">[picture:toss]<\/span> Toss, оно получает в раза больше урона от Avalanche; в этом случае наносится 37,5\/75\/112,5\/150 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 77,5\/115\/152,5\/190) урона за срабатывание\n Наносит до 187,5\/375\/562,5\/750 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 387,5\/575\/762,5\/950) урона при идеально исполненной комбинации с Toss",
        "С каждым срабатыванием Avalanche сначала наносит урон, затем применяет дебафф"
      ],
      "item_behaviour": [],
      "description": "Заваливает указанную область камнями, с небольшим интервалом оглушая противников и нанося урон, который увеличивается в 2,5 раза для жертв способности Toss.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 600",
        "Радиус: 325\/350\/375\/400",
        "Число срабатываний: 5",
        "Интервал: 0,3",
        "Общий урон: 75\/150\/225\/300 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 155\/230\/305\/380)",
        "Длительность оглушения: 0,2",
        "Длительность: 1,4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Tiny_Avalanche.mp3\/revision\/latest?cb=20191216025433",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "26\/22\/18\/14 (TagTalent 18\/14\/10\/6)",
      "aghanim": null,
      "name": "Avalanche",
      "cooldown": "120",
      "legacy_key": "V",
      "story": "Безжизненные камни оживают по зову каменного гиганта."
    },
    {
      "notes": [
        "Брошенное существо летит со скоростью, зависящей от расстояния между ним и целью, но ограниченной 2308\n Если расстояние меняется, то скорость адаптируется постепенно - ускоряясь или замедляясь",
        "Можно увернуться от брошенного существа с помощью телепортации или мгновенного передвижения, но технически его нельзя избежать\n То есть брошенное существо может пролететь до 3000 единиц, если цель телепортировалась достаточно далеко",
        "Если существо умрет в воздухе, то при его приземлении урон по области все равно нанесётся",
        "Принудительно передвигает существо, обезвреживая его и отменяя произносимые заклинания и эффекты, меняющие расположение",
        "Постройки не могут быть целью заклинания, но они получают 33,33% урона (30\/53\/77\/100) от приземлившегося рядом существа",
        "Дополнительные 30% урона наносятся только брошенному вражескому существу; урон увеличивается до 117\/208\/299\/390\n Другие вражеские существа (включая строения) в радиусе получат только базовый урон",
        "Может бросить любое существо за исключением древних крипов и вардов",
        "Не может подкинуть невидимых вражеских существ, но они получают урон от приземления рядом с ними подкинутого",
        "Может подкинуть врага в тумане войны, если он находится в радиусе 275 единиц от Tiny, но сам враг конечной целью быть не может",
        "Пока цель находится в воздухе, остальные существа могут проходить под ним",
        "Может выбрать точкой броска руны, но не подкидывает их",
        "Бафф и дебафф Toss - скрытые, поэтому они не отображаются в интерфейсе",
        "При выборе <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> таланта 20-го уровня целью Toss может быть точка на земле\n Руны больше нельзя выбрать напрямую с изученным талантом, но других существ все еще можно выбирать"
      ],
      "item_behaviour": [],
      "description": "Герой хватает ближайшее существо в радиусе 275, а затем бросает его в указанную цель или руну. В месте приземления наносится урон. Если брошен враг, он получит на 30% больше урона.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: 800\/900\/1000\/1100",
        "Радиус захвата: 275",
        "Радиус урона: 275",
        "Урон: 90\/160\/230\/300",
        "Доп\n урон для брошенного существа: 30%",
        "Урон по строениям: 33,33%",
        "Множитель урона Avalanche: 2,5",
        "Длительность броска: 1,4",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Число зарядов:  2",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Время восстановления заряда:  17\/15\/13\/11"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/76\/Tiny_Toss_1.mp3\/revision\/latest?cb=20191216025438",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "mana": "17\/15\/13\/11 (TagTalent 0)",
      "aghanim": null,
      "name": "Toss",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "T",
      "story": "Колоссальная сила позволяет каменному гиганту подкидывать в воздух даже самых крепких воинов."
    },
    {
      "notes": [
        "У способности нет фиксированной длительности\n Бафф действует до разрушения дерева, использования <span image=\"images\/tree_throw.webp\">[picture:tree_throw]<\/span> Tree Throw или смерти",
        "Перезарядка Tree Grab начинается только посли потери дерева\n Не начинает перезарядку при применении\n Мана расходуется при применении",
        "Приравнивает дальность атаки заклинателя к 350, поэтому при использовании способности другими героями их дальность атаки может быть уменьшена\n Бонусы к дальности атаки не обнуляются и действуют как обычно",
        "Увеличивает только базовый урон и урон, даваемый основным атрибутом Tiny\n Дополнительный урон не увеличивается",
        "Дополнительный урон не применяется при атаке союзных существ",
        "Периодически проверяет основной урон Tiny и мгновенно адаптирует бонус",
        "Прорубающий урон не может быть увеличен с помощью усиления урона заклинаний и от него не идет лечение от вампиризма заклинаний",
        "Прорубающий урон снижается блокировкой урона",
        "Область выглядит как прямоугольник, заканчивающийся полукругом и исходящий от Tiny\n Как и при прорубающем ударе, область всегда начинается перед атакующим существом\n Длина прямоугольника — 400 единиц, а ширина - 400\n Радиус полукруга равен 200 единицам\n То есть урон наносится на расстоянии до 600 от Tiny",
        "Сочетается с другими источниками прорубающего удара\n Каждый источник действует независимо от другого",
        "Наносит урон по области при атаке вардов или строений, но не союзных существ и предметов\n На варды и строения не действует урон по области",
        "Вопреки визуальному эффекту, прорубающий урон наносится мгновенно по всей области"
      ],
      "item_behaviour": [],
      "description": "Герой вырывает из земли выбранное дерево, чтобы отметелить им врагов. Дерево ломается после определённого числа атак, но увеличивает их дальность и урон. Атаки наносят прорубающий урон, задевая соседних существ. Дерево можно швырнуть во врага, чтобы нанести ему урон от атаки на расстоянии.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,2+1,24",
        "Дальность применения: 165",
        "Длина урона по области: 400",
        "Радиус урона по области: 200",
        "Число атак: 5 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Неограничено)",
        "Дальность атаки: 350",
        "Доп\n урон существам: 25% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 35%)",
        "Доп\n урон строениям: 90%\/120%\/150%\/180%",
        "Прорубающий урон: 40%\/60%\/80%\/100%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/00\/Tiny_Tree_Grab.mp3\/revision\/latest?cb=20191216025446",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Деревья",
        "Урон: Физический"
      ],
      "mana": "16\/14\/12\/10",
      "aghanim": null,
      "name": "Tree Grab",
      "cooldown": "50",
      "legacy_key": "C",
      "story": "Камень бьёт дерево... А камень с деревом бьёт что угодно."
    },
    {
      "notes": [
        "Заменяет <span image=\"images\/tree_grab.webp\">[picture:tree_grab]<\/span> Tree Grab до потери Tiny дерева",
        "Дерево летит со скоростью в 900 единиц",
        "При выборе существа снаряд летит напрямую в него\n Поэтому дерево наносит урон существу при попадании",
        "При выборе точки на земле дерево пролетит по прямой 1200 единиц до исчезновения\n Также дерево использует радиус столкновения в 300 единиц\n Поэтому оно может достигнуть выбранной точки раньше\n Поражает существ на расстоянии до 1500 единиц (складывается из дальности применения и радиуса столкновения)\n Урон по площади наносится в радиусе вокруг первого пораженного существа, а не вокруг дерева",
        "Применяет мгновенную атаку к выбранному существу или первому врагу на пути\n Эта атака дополнительно наносит 25% урона - как и атака с Tree Grab\n Также она применяет урон соседним целям вокруг цели\n На мгновенную атаку может сработать любой модификатор атаки и эффекты, срабатывающие при ударе\n Поскольку область поражения представлена уроном соседним целям, то модификаторы не применяются\n Прорубающий урон нельзя увеличить усилением исходящего урона заклинаний и от него не идет вампиризм заклинаний\n Можно усилить усилением получаемого урона заклинаний Эффекты прорубания зависят от расположения цели и наносят урон в пределах трапеции, направленной в противоположную сторону от запущенного дерева\n Хоть дерево выглядит как дальняя атака, атака им считается за ближнюю\n Поэтому все способности, учитывающие разницу между ближним и дальним боем, используют для дерева значения и эффекты для ближнего боя\n У совершенной мгновенной атаки эффект True Strike, поэтому она не может промахнутся\n Но атака не произойдет, если от дерева увернулись",
        "При выборе точки на земле дерево во время полета дает летающий обзор в радиусе 200 Не дает обзор, если целью было выбрано существо\n Если дерево поразило существо (при выборе целью его или точки на земле), то снаряд также дает летающий обзор в месте падения на 2 секунды"
      ],
      "item_behaviour": [],
      "description": "Швыряет дерево в указанную цель, нанося ей и всем врагам вокруг неё урон от атаки.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,2+1,13",
        "Дальность применения: 1200",
        "Радиус столкновения: 300",
        "Радиус действия: 275",
        "Урон по площади: 150%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Tiny_Tree_Throw_1.mp3\/revision\/latest?cb=20200521124741",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Мгновенная атака"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Tree Throw",
      "cooldown": "0",
      "legacy_key": "C",
      "story": "Лес рубят — щепки летят. А тут летят целые деревья."
    },
    {
      "notes": [
        "Требует <span image=\"items\/aghanim's_scepter\/full.webp\">[picture:aghanim's_scepter]<\/span> Aghanim's Scepter для разблокировки\n Эта способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний",
        "Бросает деревья с интервалом в 0,4 сек\n сразу после применения, вырывая до 6 деревьев\n Проверяет наличие деревьев с тем же интервалом\n Если поблизости деревьев нет, то произнесение прерывается",
        "Деревья в радиусе захвата выбираются случайно",
        "Совершает мгновенные атаки по всем врагам в радиусе урона\n Вопреки описанию, мгновенные атаки не наносят дополнительного урона, а лишь используют урон от атаки Tiny\n Атаки могут активировать модификаторы и эффекты, срабатывающие при атаке\n Эффекты прорубания зависят от расположения цели и наносят урон в пределах трапеции, направленной в противоположную сторону от запущенного дерева\n Хоть дерево выглядит как дальняя атака, атака им считается за ближнюю\n Поэтому все способности, учитывающие разницу между ближним и дальним боем, используют для дерева значения и эффекты для ближнего боя\n У совершенной мгновенной атаки эффект True Strike, поэтому она не может промахнутся"
      ],
      "item_behaviour": [],
      "description": "Герой вырывает из земли рядом случайные деревья и швыряет их в указанную область. Брошенное дерево наносит противникам увеличенный урон от атаки героя.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+2,4",
        "Дальность применения: 1200",
        "Радиус захвата деревьев: 525",
        "Радиус урона: 400",
        "Макс\n длительность: 2,4",
        "Интервал бросков: 0,4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Tiny_Tree_Volley_1.mp3\/revision\/latest?cb=20191216025449",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Мгновенная атака"
      ],
      "mana": "15",
      "aghanim": null,
      "name": "Tree Volley",
      "cooldown": "200",
      "legacy_key": "R",
      "story": "Кости все переломал каменный лесоповал."
    },
    {
      "notes": [
        "Каждый уровень меняет облик Tiny, увеличивая его и делая его голос ниже",
        "Дополнительный урон от способности добавляется к значению основного и не складывается с дополнительным\n То есть этот урон также увеличивается от бонусов, дающих процентное увеличение урона от атаки\n Иллюзии Tiny так же используют этот урон"
      ],
      "item_behaviour": [],
      "description": "Герой обрастает камнями, увеличивая свой урон от атак и броню, но теряя скорость атаки.",
      "hot_key": "R",
      "params": [
        "Дополнительный урон: 50\/100\/150",
        "Уменьшение скорости атаки: 30%",
        "Дополнительная броня: 12\/18\/24"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b2\/Tiny_Grow.mp3\/revision\/latest?cb=20200521124743",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Grow",
      "cooldown": null,
      "legacy_key": "W",
      "story": "Наблюдать превращение холма в гору становится вдвойне интереснее, когда эта гора начинает сокрушать противников."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.8,
    "attrStrength": 28.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 0.0,
    "attrAgility": 0.0
  },
  "description": "2 заряда Toss −8 сек. перезарядки Avalanche Для Toss не нужна цель +40% к увеличению доп. урона с деревом у Grow +80 к урону от Avalanche +10% сопротивлению эффектам +10 к силе +20 к скорости передвижения",
  "history": "Он явился на свет куском камня. Происхождение его — загадка, ответ на которую он непрестанно пытается найти. Теперь он — каменный гигант, но кем же он был раньше? Обломком пятки голема? Осколком, сбитым с гаргульи в мастерской скульптора? Частью Пророческого лика Гартоса? Им движет глубокое любопытство, и он без устали путешествует по миру, пытаясь найти свои истоки, свою родословную, свой народ. В скитаниях он прибавляет в массе и размере; силы, что дробят маленькие камни, его делают лишь мощнее и мощнее."
}