{
  "abilities": [
    {
      "notes": [
        "Targeting a unit causes the breaths to be released towards the unit's position",
        "Both the icy and fiery wave travel at a speed of 1050, taking 0.71 ( 1.43) seconds to travel the full distance",
        "The icy breath deals 0 damage to affected units and fully procs on-damage effects (e.g\n  Corrosive Skin), and then applies its movement speed and attack speed slow\n The icy breath first applies its damage, then the debuff\n Successive casts reapplies the icy breath and update the slow values based on its current values",
        "The fiery breath is released 0.2 seconds after the icy breath is released\n This means it is possible for enemies to be hit by only one of the breaths, by getting in or out of range of the second breath\n Jakiro cannot move until both waves are released, but can use items and abilities, and turn a little bit between the first and the second breath",
        "With the travel distance and end radius, Dual Breath can hit units up to 1025 ( 1775) range away\n The complete area of both breaths is shaped like a cone",
        "Deals 10\/20\/30\/40 ( 20\/40\/60\/80) damage in 0.5-second intervals, starting immediately after the fire debuff is placed, the second interval is 0.1 seconds, the rest are 0.5 seconds, resulting in 11 instances\n The first damage instance deals 0 damage and fully procs on-damage effects\n Can deal up to 100\/200\/300\/400 ( 200\/400\/600\/800) damage (before reductions) to a single unit\n Successive casts neither stack nor update the damage values of the current instance but refreshes its duration\n It also continues ticking with the same intervals as the first cast"
      ],
      "item_behaviour": [],
      "description": "An icy blast followed by a wave of fire launches out in a path in front of Jakiro. The ice slows enemies, while the fire delivers damage over time.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.35+1.4",
        "Cast Range:  750 ( 1500)",
        "Starting Radius: 225",
        "Travel Distance:  750 ( 1500)",
        "End Radius: 275",
        "Move Speed Slow: 28%\/32%\/36%\/40% ( 38%\/42%\/46%\/50%)",
        "Attack Speed Slow: 28\/32\/36\/40 ( 38\/42\/46\/50)",
        "Damage per Second: 20\/40\/60\/80 ( 40\/80\/120\/160)",
        "Duration: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f6\/Jakiro_Dual_Breath.mp3\/revision\/latest?cb=20210424154928",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "10",
      "aghanim": null,
      "name": "Dual Breath",
      "cooldown": "140\/150\/160\/170",
      "legacy_key": "D",
      "story": "Pyrexae dragons have tremendously dangerous breath for each branch of the species; combining them is unimaginable."
    },
    {
      "notes": [
        "Despite the visual effects, Ice Path's effects do not have to travel, and are instantly applied after the 0.5-second delay",
        "The Ice Path starts 12 range in front of Jakiro and has a length of 1200\n With the starting distance, path length and path radius, Ice Patch can hit units up to 1362 range away\n It can also hit units 138 range behind Jakiro, due to its radius and starting position",
        "Enemy units that come within 150 radius of the path while it is up get stunned and damaged by it\n The stun duration is independent of the path duration\n However, the stun duration expires as soon as the path disappears\n The path grants 150 range flying vision along the path based on the path duration\n Enemies may only be stunned once per cast, so if dispeled, they cannot get stunned by it again\n Ice Path first applies the debuff, then the damage"
      ],
      "item_behaviour": [],
      "description": "Creates a path of ice that stuns and damages enemies that touch it.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.65+0.8",
        "Cast Range:  1200",
        "Path Distance:  1200",
        "Path Radius: 150",
        "Effect Delay: 0.5",
        "Damage: 50",
        "Stun Duration: 1.6\/1.9\/2.2\/2.5 ( 2.1\/2.4\/2.7\/3)",
        "Path Duration: 2.6\/2.9\/3.2\/3.5 ( 3.1\/3.4\/3.7\/4)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/96\/Jakiro_Ice_Path.mp3\/revision\/latest?cb=20191216014425",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "18\/15\/12\/9 (TagTalent 15.5\/12.5\/9.5\/6.5)",
      "aghanim": null,
      "name": "Ice Path",
      "cooldown": "100",
      "legacy_key": "T",
      "story": "Jakiro's cunning right head calls upon its frozen heritage, glazing the earth with blistering cold."
    },
    {
      "notes": [
        "Liquid Fire's cast range can only be further increased by attack range bonuses of the same range as the caster\n However, it is not affected by cast range bonus\n Uses Jakiro's 400 ( 675) attack range when Autocast is active\n Manually casting it uses the 600 ( 875) cast range",
        "Applies Liquid Fire around and on the target regardless of whether the attack missed or is disjointed\n However, when the target turns invisible, invulnerable or hidden before impact, Liquid Fire is not applied at all",
        "Successive casts do not stack but refreshes its debuff duration\n It also continues ticking with the same intervals as the first cast\n However, the attack speed slow values are updated upon successive casts, but not the damage values",
        "The attack first applies the debuff, then its own attack damage",
        "Fully affects buildings\n Does not affect allied units or wards",
        "Deals 7.5\/10\/12.5\/15 damage in 0.5-second intervals, starting 0.5 seconds after the debuff is applied, resulting in 10 damage instances\n Can deal up to 75\/100\/125\/150 damage (before reductions) to a single target",
        "When off cooldown, the fire head's mouth drools fire, visible to everyone",
        "SHARD NOTES Liquid Frost has a higher priority than Liquid Fire in the group of active attack modifiers\n In most situations, Liquid Frost will be cast instead while having either abilities with Autocast on\n The only way to launch both Liquid Fire and Liquid Frost is by manual casting  Liquid Frost with  Liquid Fire Autocast on\n However, if Jakiro has more than 5 items equipped, including neutral items, <span image=\"items\/town_portal_scroll\/full.webp\">[Town Portal Scroll]<\/span> Town Portal Scroll and the consumed <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, he will only apply Liquid Frost on to the target"
      ],
      "item_behaviour": [],
      "description": "Jakiro burns his enemies in an area of effect with fire added to his attack, while slowing their attacks.",
      "hot_key": "E",
      "params": [
        "Cast Range:  600 ( 875)",
        "Radius: 300",
        "Attack Speed Slow: 30\/40\/50\/60 ( 80\/90\/100\/110)",
        "Damage per Second: 15\/20\/25\/30",
        "Duration: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3e\/Jakiro_Liquid_Fire_1.mp3\/revision\/latest?cb=20191216014427",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "16\/12\/8\/4",
      "aghanim": null,
      "name": "Liquid Fire",
      "cooldown": "0",
      "legacy_key": "Q",
      "story": "The left maw of Jakiro opens, laying waste to any in its path."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Liquid Frost's cast range can only be further increased by attack range bonuses of the same range as the caster\n However, it is not affected by cast range bonus\n Uses Jakiro's 400 ( 675) attack range when Autocast is active\n Manually casting it uses the 600 ( 875) cast range",
        "Applies Liquid Frost around and on the target regardless of whether the attack misses or is disjointed or not\n However, when the target turns spell immune or invulnerable before impact, Liquid Frost is not applied at all",
        "Successive casts do not stack but refresh the debuff",
        "The attack first applies the debuff, then the stun, then its own attack damage",
        "Fully affects buildings\n Does not affect allied units or wards",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 4 damage instances",
        "Can deal up to 80 + 8% of max health as damage to a single target (before reductions)",
        "When off cooldown, the ice head's mouth glows and releases light blue smoke, visible to everyone",
        "SHARD NOTES  Liquid Fire's Autocast notes fully apply"
      ],
      "item_behaviour": [],
      "description": "Jakiro adds a frost effect to his attack, stunning enemies. Enemies hit are slowed and receive a percent their max health per second plus a base amount as damage every 1 second for 4 seconds.",
      "hot_key": "D",
      "params": [
        "Cast Range: 600 ( 875)",
        "Radius: 300",
        "Move Speed Slow: 20%",
        "Base Damage per Second: 20",
        "Max Health as Damage per Second: 2%",
        "Debuff Duration: 4",
        "Stun Duration: 0.4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/94\/Jakiro_Liquid_Frost_1.mp3\/revision\/latest?cb=20201228224140",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "12",
      "aghanim": null,
      "name": "Liquid Frost",
      "cooldown": "0",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "Macropyre instantly applies its effects over the whole distance, it does not have any travel time",
        "Macropyre starts 234 range in front of Jakiro and has a length of 1166 ( 1566)\n With the starting distance, path length and path radius, Macropyre can hit units up to 1660 ( 2060) range away\n It can also hit units 26 range behind Jakiro, due to its radius and starting position",
        "Places a debuff on enemies within the area in 0.5-second intervals, starting 0.5 seconds after cast",
        "The debuff does not stack\n When standing inside the fire, its duration gets refreshed\n The debuff deals 55\/77.5\/100 ( 70\/92.5\/115) damage in 0.5-second intervals, starting 0.5 seconds after being placed, resulting in 4 damage instances\n This results in a maximum of 23 ( 53) damage instances when standing within the area the full duration\n One instance of the debuff can deal up to 220\/310\/400 ( 280\/370\/460) damage (before reductions)",
        "Successive casts do not stack but refreshes its debuff duration\n It also continues ticking with the same intervals and damage values as the first cast",
        "Can deal up to 1265\/1782.5\/2300 ( 1610\/2127.5\/2645) damage to a single unit (before reductions)",
        "SCEPTER NOTES The piercing spell immunity upgrade is determined if Jakiro has <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter equipped, and not upon cast\n Therefore, it instantly updates the current damage instances\n It also changes Macropyre's sound effect and it is now audible through the Fog of War\n It can now deal up to 2915\/4107.5\/5300 ( 3710\/4902.5\/6095) damage to a single unit"
      ],
      "item_behaviour": [],
      "description": "Jakiro exhales a wide line of lasting flames, which deals damage per second to any enemy units caught in the fire.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.4+0.76",
        "Cast Range:  1400 ( 1800)",
        "Path Distance:  1400 ( 1800)",
        "Path Radius: 260",
        "Damage per Second: 110\/155\/200 ( 140\/185\/230)",
        "Damage Linger Duration: 2",
        "Path Duration: 10 ( 25)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Jakiro_Macropyre_1.mp3\/revision\/latest?cb=20191216014429",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "80\/70\/60",
      "aghanim": null,
      "name": "Macropyre",
      "cooldown": "220\/330\/440",
      "legacy_key": "R",
      "story": "Ice and fire combine to rip the battlefield to shreds with extreme temperatures."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 25.0,
    "attrIntelligence": 26.0,
    "attrIntelligenceInc": 3.0,
    "attrAgilityInc": 1.2,
    "attrAgility": 15.0
  },
  "description": "Freezes and burns enemies with magic. Most Pyrexae Dragons are hatched with one head, attuned to either ice or fire. Then there was Jakiro, an accident of nature. Possessing the might of both elements, the twin-headed dragon's Dual Breath freezes and burns simultaneously. Gobs of Liquid Frost or Liquid Fire adhere to armor and walls, melting down steel and stone alike. Retreating foes are blocked off with Ice Path, giving Jakiro ample time to roast them on his Macropyre.  Support Nuker Pusher Disabler ★☆☆",
  "trivia": [
    "Jakiro's fun\/alternate name was Double Dragon, referring to the video game franchise developed by Technos Japan.",
    "This line Link▶️ \"Burninated.\" is a reference to Trogdor the Burninator, a character that first appeared in episode 58 of the \"Strong Bad e-mail\" show on the website HomestarRunner.com.",
    "The line \"With fire and ice\" is possibly a reference to a famous poem by Robert Frost, titled \"Fire and Ice\"."
  ],
  "history": "Even among magical beasts, a twin-headed dragon is a freak. Equal parts ice and fire, cunning and rage, the creature known as Jakiro glides over charred and ice-bound battlefields, laying waste to any who would bear arms against it. Pyrexae dragon clutches always contain two fledglings. Famous for their viciousness even from the first moments of life, newly hatched dragons of this species will try to kill their sibling while still in the nest. Only the strongest survive. In this way is the strength of the Pyrexae line ensured. By some accident of nature, the freak Jakiro hatches from a single egg, combining in a single individual the full range of abilities found within the diverse Pyrexae species. Trapped within the armature of its monstrous body, the powers of ice and fire combine, and now no enemy is safe.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "2x Dual Breath Damage and Range",
        "talent_left": "-2.5s Ice Path Cooldown"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+0.5s Ice Path Duration",
        "talent_left": "+30 Macropyre Damage"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-50 Liquid Fire Attack Speed",
        "talent_left": "+325 Health"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+275 Attack Range",
        "talent_left": "+10%\/+10 Dual Breath Attack\/Movement Speed Slow"
      }
    ],
    "notes": [
      "The attack range talent also affects the cast range of Liquid Fire and Liquid Frost.",
      "The health talent increases maximum health capacity, and keeps the current health percentage."
    ]
  }
}