{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Шансы срабатывания Pierce от нескольких Monkey King Bar не складываются. При этом Pierce Monkey King Bar и Javelin не связаны и сочетаются друг с другом.",
        "При этом Pierce Monkey King Bar и Javelin не связаны и сочетаются друг с другом.",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона не идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона не идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "Не действует на строения, но действует на варды и союзных существ.",
        "В среднем добавляет 52.5 магического урона к каждой атаке.",
        "Pierce использует псевдослучайное распределение.",
        "Атаки со срабатавшей Pierce не могут промахнуться."
      ],
      "mana": null,
      "abilityName": "Pierce",
      "cooldown": null,
      "description": "Каждая атака может с вероятностью в 75% пройти сквозь уклонение и нанести 70 дополнительного магического урона.",
      "params": [
        "Шанс срабатывания: 75%",
        "Урон: 70",
        "Может сработать на иллюзиях, позволяя им игнорировать уклонения, но не нанося дополнительный урон."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4975",
  "lore": null,
  "consistFrom": [
    "Demon Edge",
    "Javelin",
    "Blitz Knuckles",
    "Recipe"
  ],
  "boughtFrom": "Оружие",
  "name": "Monkey King Bar",
  "description": "Могущественный посох, которым пользовался искусный воин.",
  "trivia": [
    "Monkey King, Сунь Укун - герой Китайского народного произведения Путешествие на Запад. Его оружие, Ruyi Jingu Bang (如意金箍棒) - это магический железный посох с золотыми наконечниками. Несмотря на вес посоха в несколько тонн, Monkey King может изменять его размер по своему желанию, уменьшая и пряча его за ухом или увеличивая его размер и размножая его в бесконечное количество отдельных посохов.",
    "Однако, источником способности True Strike является не волшебный посох, а его глаза, Jin Jing Huoyan (金睛火眼). После нахождения Sun Wukong в духовном заточении Bagua Lu (八卦爐) 49 дней, его глаза превратились в Jin Jing Huoyan, дающие ему способность отличать демонов от людей, известную как True Sight.",
    "Модель Monkey King Bar является стандартным оружием Monkey King."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+40 к урону",
    "+35 к скорости атаки"
  ],
  "tips": [
    "Pierce работает против любых источников шанса промаха, не только уклонения. Это значит, что предмет так же ценен против источников ослепления у врагов."
  ]
}