{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/be\/Arcanist%27s_Armor_Mega_Shield_1.mp3\/revision\/latest?cb=20210829215121",
      "effects": [
        "Damage Returned: 40%",
        "Duration: 5"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Adds a second temporary aura, that affects allies within the same radius as the main aura, and lingers for the same duration. This aura only affects heroes, including illusions, clones, and creep-heroes. Does not affect invulnerable units. Does not return damage from illusions despite the buff being placed and the visual effect appearing.",
        "This aura only affects heroes, including illusions, clones, and creep-heroes. Does not affect invulnerable units.",
        "Does not return damage from illusions despite the buff being placed and the visual effect appearing.",
        "Despite the item description, damage is only returned, not reflected. Does not reduce incoming damage for the affected allies.",
        "Returns the 3 damage types, but not HP Removal effects (e.g. Sunder, Soul Ring etc.). Damage is returned as the same type as it was received. Returns incoming damage before all manipulations. However, damage manipulation on the enemy still affects the damage normally. The returned damage is always dealt right after the incoming damage.",
        "Damage is returned as the same type as it was received.",
        "Returns incoming damage before all manipulations. However, damage manipulation on the enemy still affects the damage normally.",
        "The returned damage is always dealt right after the incoming damage.",
        "Returned physical damage is affected by damage block.",
        "The damage from Mega Shield is flagged as HP Removal, so it does not trigger any on-damage effects.",
        "Returned damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.",
        "Returned damage has the no-spell-lifesteal flag, preventing its damage from utilising spell lifesteal.",
        "Returned damage has the no-spell-amplification flag, preventing its damage from being amplified with spell damage amplification.",
        "Returns damage back to the source. This means damage done by summons is returned back to the summons, not to their owner.",
        "Mega Shield's damage return has a global range and affects units through the Fog of War or invisibility.",
        "Does not work against wards, buildings and allied units."
      ],
      "mana": "0",
      "abilityName": "Mega Shield",
      "cooldown": "20",
      "description": "Force Field Aura Grants 40% Damage Reflection for 5 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Radius: 1200",
        "Armor Bonus: 5",
        "Magic Resistance Bonus: 20%",
        "Aura Linger Duration: 0.5"
      ],
      "notes": [
        "Stacks multiplicatively with other sources of magic resistance. Increases most heroes' total magic resistance to 40%.",
        "Increases most heroes' total magic resistance to 40%.",
        "Does not affect wards, buildings and invulnerable units.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "abilityName": "Shield",
      "cooldown": null,
      "description": "Grants +5 armor and +20% Magic Resistance to all allies within 1200 radius.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's own bonuses are bound to the aura, and not the item itself. This means the passive armor and magic resistance work for the wielder only when they are affected by the aura. This also leads to the self bonus to stack additively with the aura's bonus, rather than multiplicatively.",
    "This also leads to the self bonus to stack additively with the aura's bonus, rather than multiplicatively.",
    "Stacks multiplicatively with other sources of magic resistance. Increases the wielder's total magic resistance to 55%.",
    "Increases the wielder's total magic resistance to 55%."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Arcanist's Armor",
  "description": "An exquisite piece commissioned by a paranoid monarch who choked on a piece of fruit long before the item saw its intended use.",
  "trivia": [
    "This item's internal name is \"Force Field\"."
  ],
  "upgradeIn": null,
  "tips": null
}