{"abilities":[{"effects":["Radius: 1200","Charges per Cast Spell: 1","Max Charges: 10","Health and Mana Restored per Charge: 15 cooldown = 13"],"notes":["Interrupts the user's channeling spells upon cast.","Gains 1 charge whenever a visible enemy unit, including neutral creeps, uses an ability within the radius.","Does not gain charges from toggle abilities, active attack modifiers and the abilities listed here.","Passively triggered spells (e.g. Quill Spray, Borrowed Time, Multicast, Reincarnation) do not add charges.","When an enemy casts a spell out of the invisibility from the Invisibility Rune, Shadow Walk, Sand Storm, Moonlight Shadow or Nature's Guise, it does not give a charge.","Can restore up to Expression error: Unrecognized word \"cooldown\". health and mana when having the maximum amount of charges.","Shares cooldown with Magic Wand.","When having multiple Magic Sticks or Magic Wands in the inventory, the oldest one gains charges first. If it is full, the second oldest one starts to gain charges.","Upon upgrading a Magic Stick into a Magic Wand, all its current charges are carried over."],"elements":["Ability No Target","Affects Self"],"name":"Energy Charge","description":"Instantly restores 15 cooldown = 13 health and mana per charge stored. Max 10 charges. Gains a charge whenever a visible enemy within 1200 range uses an ability."}],"cost":"200","description":"A simple wand used to channel magic energies, it is favored by apprentice wizards and great warlocks alike.","further":["Magic_Wand"],"tips":["Magic Sticks allows the user to get a quick burst of healing, or to use one last ability in a fight. Even during the midgame, when the boost is less noticeable, a Magic Stick can still save lives or ensure kills.","The Magic Stick makes an excellent item against heroes that spam abilities while in the lane, as the charges can help to mitigate taken damage, or to cast more of own abilities. It is very versatile, and most of the time a good item to have."],"attrs":["Active Energy Charge","Charges 0","Disassemble? No","Alert allies? No"]}