{
  "abilities": [
    {
      "notes": [
        "Даёт наземный обзор в радиусе 900 единиц в выбранной области на 6 секунд",
        "Способность сначала наносит урон, а затем применяет дебафф",
        "При использовании проигрывается звуковой эффект, который слышен всем"
      ],
      "item_behaviour": [],
      "description": "Обдаёт выбранную область морозным ветром, который наносит врагам урон и замедляет их передвижение и атаку.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,6",
        "Дальность применения: 700",
        "Радиус эффекта: 425 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 550)",
        "Урон: 130\/170\/210\/260 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 370\/410\/450\/500)",
        "Замедление скорости передвижения: 20%\/30%\/40%\/50%",
        "Замедление скорости атаки: 30\/45\/60\/75",
        "Длительность замедления: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Crystal_Maiden_Crystal_Nova.mp3\/revision\/latest?cb=20191216012225",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "11\/10\/9\/8 (TagTalent 8\/7\/6\/5)",
      "aghanim": null,
      "name": "Crystal Nova",
      "cooldown": "115\/135\/155\/175",
      "legacy_key": "V",
      "story": "Температура воздуха вокруг Рилай резко падает, насквозь промораживая всё вокруг нее."
    },
    {
      "notes": [
        "Несмотря на визуальные эффекты, Frostbite применяется мгновенно и его нельзя избежать",
        "Оцепенение и обезоруживание не позволяет цели двигаться, атаковать и применять некоторые заклинания передвижения. Раскрывает невидимость цели",
        "Наносит 25 урона с интервалом в 0,25, начиная спустя 0,25 после применения. В результате срабатывает 6\/8\/10\/12 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 11\/13\/15\/17) на героях и 40 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 45) на крипах. Может нанести 150\/200\/250\/300 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 275\/325\/375\/425) урона по героям и 1000 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1125) урона по крипам (до учёта сопротивлений)",
        "Считает иллюзии, крипов-героев, древних крипов и  Рошана за героев",
        "Многократное применение Frostbite на цель не будет наносить дополнительный урон, но будет обновлять длительность"
      ],
      "item_behaviour": [],
      "description": "Заковывает противника в лёд, нанося ему периодический урон и запрещая двигаться и атаковать. Действует 10 секунд на крипов 6-го уровня или ниже.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,6",
        "Дальность применения: 600 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 725)",
        "Интервал урона: 0,25",
        "Урон в секунду: 100",
        "Длительность на героях: 1,5\/2\/2,5\/3 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2,75\/3,25\/3,75\/4,25)",
        "Длительность на крипах: 10 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 11,25)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Crystal_Maiden_Frostbite.mp3\/revision\/latest?cb=20191216012227",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "9\/8\/7\/6",
      "aghanim": null,
      "name": "Frostbite",
      "cooldown": "125\/135\/145\/155",
      "legacy_key": "E",
      "story": "Рилай призывает холодный ветер с айсберга Голубого Сердца, который заточает противника в ледяную глыбу."
    },
    {
      "notes": [
        "Бафф от ауры задерживается на 0,5 секунды",
        "Arcane Aura предоставляет две ауры. Первая аура имеет глобальный радиус. Вторая аура имеет радиус 1200 и увеличивает общее восстановление маны от аур до 3,8333333333333",
        "Первая аура может восстановить до 24\/36\/48\/60 маны в минуту для союзников. Обе ауры могут восстановить до 72\/108\/144\/180 маны в минуту союзникам. Может восстановить до 144\/216\/288\/360 маны в минуту для Crystal Maiden",
        "Не действует неуязвимых существ"
      ],
      "item_behaviour": [],
      "description": "Увеличивает восстановление маны у всех союзников на карте. Действует в 3 раза сильнее на союзников в радиусе 1200 и в 6 раза сильнее — на владельца способности.",
      "hot_key": "E",
      "params": [
        "Радиус дальней ауры: Глобальный",
        "Радиус близкой ауры: 1200",
        "Доп. восстановление маны от дальней ауры: 0,4\/0,6\/0,8\/1",
        "Множитель эффекта в ближней ауре: 3",
        "Множитель эффекта на себя: 6",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Союзников"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Arcane Aura",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Холод — сущность магии, поэтому присутствие ледяной волшебницы Рилай позволяет союзникам использовать магию в избытке."
    },
    {
      "notes": [
        "Замедление действует на всех врагов в радиусе с интервалом в 0,1 сек. независимо от ледяных взрывов",
        "Взрывы происходит каждые 0,1 ( 0,083) сек., начиная с 0,1 ( 0,083) секунды после начала произнесения, всего 99 ( 121) взрывов",
        "Каждый ледяной взрыв появляется на случайном расстоянии от самой Crystal Maiden: от 195 до 785. Радиус появления взрыва делится на четыре части по 90° (0°–90°, 90°–180°, 180°–270°, 270°–360°). Первый взрыв появляется в северо-восточной части круга, далее появление происходит против часовой стрелки",
        "Максимальная дальность нанесения урона — 1105 (считается из максимального радиуса появления взрывов + радиус взрывов)",
        "Усредненный урон проходит в радиусе 485, далее урон снижается. Чуть меньше 50% урона наносится в радиусе 785. В центре применения способности урон чуть побольше (на 5%). Наносит примерно 2000\/3300\/4800 ( 2400\/3960\/5760) урона в радиусе 485 на протяжении всего действия способности, ±1,9 ( ±2,28) взрывов",
        "Радиус всегда центрирован на Crystal Maiden и следует за ней даже когда её передвигают",
        "Несмотря на визуальные эффекты, урон наносится в тот момент, как только ледяные осколки создаются, а не в момент их падения на землю",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Добавляет способности ауру, которая отмечает врагов в радиусе действия. Если вражеское существо находится под эффектом ауры сек., то на него сработает Frostbite текущего уровня. Существо может быть заморожено Freezing Field только один раз за действие ультимейта. Даже если враги вернутся в ауру, на них способность повторно не сработает. Если существо уже заморожено непосредственно способностью Frostbite, оно может повторно попасть под заморозку в течении действия Freezing Field. Отметка ауры сбрасывается, если не действует на существо. Это значит, что аура должна повторно действовать на существо в течении сек., чтобы оно получило заморозку. Отметка ауры применяется к врагам, даже если способность не улучшена, отслеживая их нахождение в области. То есть при улучшении во время применения к врагам, находившимся в области более сек., мгновенно применяется Frostbite. Отметка ауры не работает на неуязвимых или спрятанных существ. Отметка ауры задерживается на 0,1 секунды",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Freezing Field больше не прерывается, поэтому Crystal Maiden может использовать предметы и другие способности во время произнесения. Однако, её скорость передвижения сильно уменьшена. Эта замедленная скорость передвижения может быть увеличена, например с помощью  или при получении любого другого бонуса к скорости. Центр применения заклинания всегда находится под Crystal Maiden и следует за ней, даже если она сдвинется (к примеру, использование  Force Staff). Но Freezing Field всё ещё можно прервать при помощи оглушения, безмолвия, урагана, страха, проклятия или сна. Также прерывается при смерти Crystal Maiden, или когда она использует  Stop Freezing Field"
      ],
      "item_behaviour": [],
      "description": "На 10 сек. окружает героя случайными ледяными взрывами, замедляющими врагов и наносящими большой урон. На время действия способности герой получает дополнительную броню.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Максимальное время произнесения: 10 ( 0)",
        "Радиус замедления: 810",
        "Мин. радиус появления взрывов: 195",
        "Макс. радиус появления взрывов: 785",
        "Радиус урона взрывов: 320",
        "Доп. броня себе: 20",
        "Интервал появления взрывов: 0,1 ( 0,083)",
        "Урон за взрыв: 105\/170\/250 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 155\/220\/300)",
        "Замедление скорости передвижения: 40%",
        "Замедление скорости атаки: 60",
        "Длительность замедления: 1",
        "Задержка действия Frostbite: 0 ( 1,75)",
        "Собственная скорость передвижения:  75%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e2\/Crystal_Maiden_Freezing_Field.mp3\/revision\/latest?cb=20191216012226",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "100",
      "aghanim": null,
      "name": "Freezing Field",
      "cooldown": "200\/400\/600",
      "legacy_key": "F",
      "story": "Когда-то изгнанная в морозную пустошь, Рилай сделала ледяные бури тех краёв вершиной своей жестокой магии."
    },
    {
      "notes": [
        "Требуется  Aghanim's Shard для разблокировки",
        "Заменяет ячейку способности  Freezing Field до тех пор, пока действие ульта не будет завершено, или пока способность не будет использована",
        "Stop Freezing Field прерывает произносимые способности Crystal Maiden при применении",
        "Уходит на перезарядку в 1 сек. сразу после применения Freezing Field, это помогает предотвратить прерывание способности из-за случайного двойного нажатия"
      ],
      "item_behaviour": [],
      "description": "Немедленно прекращает действие ульты.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "mana": "1",
      "aghanim": null,
      "name": "Stop Freezing Field",
      "cooldown": "0",
      "legacy_key": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 17.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Обрушивает на врагов жестокую метель Crystal Maiden пригодится любой команде, ведь она даёт союзникам ману и не позволяет врагам сбежать. А когда представляется случай, она может уничтожить врагов своим сокрушительным ультом.  Поддержка Контроль Быстрый урон Лес ★☆☆",
  "history": "Рождённая в тихих местах и взращённая вместе со своей огненно-рыжей сестрой, ещё в молодости Рилай поняла, что её внутреннее единство со стихией льда вредит всем вокруг. Источники и горные реки замерзали, стоило ей прикорнуть неподалеку; зреющие плоды сковывал кусачий мороз, а цветущие висячие сады осыпались на землю безжизненной ледяной мозаикой. Когда отчаявшиеся родители решили отселить пламенную Лину на экватор, они изгнали и Рилай, чьим новым домом стали холодные земли Айсрека. Там, в пещере на вершине ледника Голубого сердца, её и стал наставлять маг льда. Спустя многие дни тренировок волшебник признал, что она готова творить магию в одиночку и оставил ей свой пост — а сам спустился вглубь ледника на тысячелетнюю спячку. С тех пор Рилай серьёзно отточила свое мастерство, и с ней не сравнится уже никто."
}