{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/16\/Fallen_Sky_Fallen_Sky_1.mp3\/revision\/latest?cb=20211002124631",
      "effects": [
        "Дальность применения: 1200",
        "Радиус удара: 315",
        "Задержка эффекта: 1",
        "Урон от удара (TagAghanimсущества): 150",
        "Урон от удара (TagAghanimпостройки): 75",
        "Урон в секунду: 60",
        "Длительность горения: 6",
        "Длительность оглушения: 2",
        "Перезарядка при получении урона: 3"
      ],
      "notes": [
        "При использовании телепортирует заклинателя и позволяет ему избежать снаряды.",
        "Для приземлению метеору нужно 1 секунды. Во время задержки заклинатель неуязвим и спрятан.",
        "При приземлении все враги в области, включая постройки, но исключая варды, получают урон, оглушаются и получают дебафф горения.",
        "Метеор сначала применяет дебаффы, а затем наносит урон от удара.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 7 раз, включая урон от удара. Может нанести до 510 (TagTalent 435) урона (до уменьшений).",
        "Может нанести до 510 (TagTalent 435) урона (до уменьшений).",
        "Повторное применение не складывается, но обновляет длительность. Складывается с дебаффом от Meteor Hammer.",
        "Складывается с дебаффом от Meteor Hammer.",
        "При ударе разрушает деревья в радиусе попадания.",
        "Урон свыше 0 от игрока (включая союзников, исключая себя), фонтана или Рошана увеличивает перезарядку Fallen Sky на 3 секунд. Во время перезарядки и вне её, Fallen Sky можно перезарядить при помощи Refresher Orb, Refresher Shard и Rearm. Однако, на перезарядку не влияет Octarine Core или руна волшебства. Не уходит на перезарядку от урона с пометкой «отнимающий здоровье».",
        "Во время перезарядки и вне её, Fallen Sky можно перезарядить при помощи Refresher Orb, Refresher Shard и Rearm.",
        "Однако, на перезарядку не влияет Octarine Core или руна волшебства.",
        "Не уходит на перезарядку от урона с пометкой «отнимающий здоровье».",
        "Не делит перезарядку с Blink Dagger или Meteor Hammer."
      ],
      "mana": "0",
      "abilityName": "Fallen Sky",
      "cooldown": "15",
      "description": "Превращает владельца в метеор, который после задержки в 1 сек. бьёт по области радиусом 315. Удар оглушает вражеских существ на 3 сек., а также наносит урон врагам и постройкам и поджигает их на 2 сек., отчего они получают урон каждые 1 сек.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "300 здоровья и 1,5 восстановления здоровья.",
    "180 маны и 0,75 восстановления маны.",
    "15 основного урона от атаки \/ героям."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Fallen Sky",
  "description": "Одно из немногих сохранившихся творений служителей Кузницы драконов.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}