{"abilities":[{"spell":"Calls a beam of lunar energy down upon an enemy, damaging and briefly stunning them.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Lucent Beam first applies the damage, then the debuff.","Luna's glaive emits some particles during the cast time, visible to everyone."],"mana":"90\/100\/110\/120","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"6 ( 2)","name":"Lucent Beam","description":["Cast Animation: 0.4+0.47","Cast Range: 800 ( 1000)","Damage: 75\/150\/225\/300 ( 175\/250\/325\/400)","Stun Duration: 0.8"],"hot_key":"Q","legacy_key":"C"},{"spell":"Empowers Luna's glaives, causing her attacks to bounce between enemy units. Deals less damage with each bounce.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["The bouncing glaives travel at a speed of 900 (the same speed as her attack projectile).","Moon Glaives only procs if an attack successfully hits a target. This means a missed or disjointed attack does not proc it.","Despite the ability's appearance, its effects fully count as a passive spell, and not as attacks. This means, besides the damage being based on Luna's attack damage, and it proccing on attacks, the ability has nothing to do with attacks. The bouncing glaives' damage count as spell damage, however, they ignore spell damage amplification and cannot spell lifesteal. They do not proc any attack modifier, and are not treated as an attack by any on-hit effect, like Return. This also means they completely ignore evasion. However, damage block does reduce their damage.","A bouncing glaive can be disjointed. When disjointed, the disjointing unit is not registered as hit, meaning the glaive can immediately bounce on it again if within range.","A disjointed bounce still counts as a bounce, so it reduces the amount of bounces left and the damage of the next bounce.","It does not matter how much damage the initial target from the attack takes, the bounces always deal damage based on Luna's average main damage + bonus damage. This means that the armor of or other damage manipulating effects on the initial attack target do not influence the bounces' damage at all. It also means that damage from attack modifiers like crits or Quell's bonus damage against creeps do not affect it either.","Can bounce back to the same units if it already hit all other nearby units. If no other units are nearby, the ability does nothing. Cannot bounce on enemies in the Fog of War.","Does not bounce towards wards and allies, but it does bounce off of them when attacking them. Fully works against buildings.","The bounces deal 65%\/42.25%\/27.46%\/17.85%\/11.6%\/7.54% of Luna's original attack damage.","Moon Glaives can deal up to 100%\/142.25%\/142.25%\/167.64% damage to the primary attack target.","Deals a total of 165%\/207.25%\/234.71%\/271.71% physical damage, assuming max bounces per level.","Upon learning, Luna's glaive permanently emits blue particles, visible to everyone."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Moon Glaives","description":["Bounce Search Radius: 500","Number of Bounces: 1\/2\/3\/6","Damage Reduction per Bounce: 35%"],"hot_key":"W","legacy_key":"G"},{"spell":"Increases the primary attribute for Luna and nearby allied heroes. Luna is also blessed with increased vision range at night.","effects":["Ability Aura","Affects Allied Heroes"],"notes":["Upon learning, Luna emits very faint pulsing particles around her.","Increases Luna's night vision to a total of 1000\/1200\/1400\/1600.","Effective stats gain by primary attribute of buffed allies: Strength: 135\/270\/405\/540 health, 0.75\/1.5\/2.25\/3 health regeneration, 0.6%\/1.2%\/1.8%\/2.4% magic resistance, and 7.5\/15\/22.5\/30 attack damage. Agility: 0.38%\/0.75%\/1.13%\/1.5% movement speed, 7.5\/15\/22.5\/30 attack speed, 1.2\/2.4\/3.6\/4.8 armor, and 7.5\/15\/22.5\/30 attack damage. Intelligence: 90\/180\/270\/360 mana, 0.38\/0.75\/1.13\/1.5 mana regeneration, 0.53%\/1.05%\/1.58%\/2.1% spell damage, and 7.5\/15\/22.5\/30 attack damage.","The aura's buff lingers for 0.5 seconds.","Affects invulnerable and hidden units."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Lunar Blessing","description":["Radius: 1200","Primary Attribute Bonus: 6\/12\/18\/24","Night Vision Bonus: 200\/400\/600\/800","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"L"},{"spell":"Showers random nearby enemies with strikes from Luna's current level of Lucent Beam. These beams do not stun their targets, and there is a maximum number of times that a single target can be struck. Also turns day into night for 10 seconds.","effects":["Ability No Target ( Target Unit \/ Target Area)","Affects Enemies","Damage Magical"],"notes":["Beams deal damage based on Luna's current level of Lucent Beam, so if not learned, Eclipse deals no damage.","Eclipse turns day into night for 10 seconds. This is independent from the Eclipse duration. Does not interfere with the night caused by Lua error in Module:Ability_ID at line 44: Could not find Cargo data for \"Darkness\". in any way, meaning Night Stalker's night is not paused. Has a lower priority than the daytime caused by Supernova.","Does not hit invisible units and units in the Fog of War.","When Luna dies, Eclipse stops. However, the 10 second night still continues. When upgraded and cast on the ground, it still ends when Luna dies. When upgraded and cast on an ally, it stops when the ally dies.","Luna's glaive emits some particles during the cast time, visible to everyone.","Multiple casts (both with and without Aghanim's Scepter) work fully independently from each other.","Maximum possible damage to a single target (before reductions): Lucent Beam Level 1: 375 ( 875) ( 450\/900\/1350, 1050\/2100\/3150) Lucent Beam Level 2: 750 ( 1250) ( 900\/1800\/2700, 1500\/3000\/4500) Lucent Beam Level 3: 1125 ( 1625) ( 1350\/2700\/4050, 1950\/3900\/5850) Lucent Beam Level 4: 1500 ( 2000) ( 1800\/3600\/5400, 2400\/4800\/7200)","When upgraded, double-clicking the ability targets self. Can target any allied units, except for wards and buildings. Provides 675 radius ground vision for its duration when not targeting a unit.","When choosing the level 25 talent, each beam also stuns hit enemies for 0.25 seconds. Unlike the damage, the stun is applied regardless of Lucent Beam's level, since it is not based on Lucent Beam's stun. The talent immediately takes effect, causing the already active casts to stun as well. The beams first apply their damage, then the debuff."],"mana":"150\/200\/250","elements":["Does not pierce spell immunity."],"cooldown":"140","name":"Eclipse","description":["Cast Animation: 0.6+0.2","Cast Range: 0 ( 2500, 2700)","Search Radius: 675","Number of Beams: 5\/8\/11 ( 6\/12\/18)","Max Beams per Unit: 5 ( 6\/12\/18)","Beam Interval: 0.6 ( 0.3)","Eclipse Duration: 2.4\/4.2\/6 ( 1.5\/3.3\/5.1)","Stun Duration per Beam: 0 ( 0.25)"],"hot_key":"R","legacy_key":"E"}],"bio":"How had she been reduced to this? She was once the Scourge of the Plains, a merciless leader of men and beasts, and able to sow terror wherever she dared. Now she was far from her homeland, driven half mad from starvation and months of wandering, her army long dead or worse. As she stood at the edge of an ancient forest, a pair of glowing eyes spied on from an elder branch. Something beautiful and deadly sought a meal in the wilting dusk. Without a sound, it turned and left. Fury overtook her. Clutching a rust-eaten dagger, she charged after the beast determined to reclaim even a shred of her past glory, but her quarry would not be caught. Three times she cornered the creature among the rocks and trees, and three times she pounced only to witness its fading shadow darting further into the woods. Yet the full moon shone brightly, and the creature's trail was easy to follow. Arriving in a clearing atop a high hill, the beast's massive feline form sat in the open, attentive and waiting. When the woman brandished her dagger, the creature reared and roared and charged. Death, it seemed, had come for her at long last in this strange place. She stood, calm and ready. A flash of movement, and the beast snatched the dagger from her hand before vanishing into the forest. Stillness. Hooded figures approached. In reverent tones they revealed that Selemene, Goddess of the Moon, had chosen her, had guided her, had tested her. Unwittingly she had endured the sacred rites of the Dark Moon, warriors of the Nightsilver Woods. She was offered a choice: join the Dark Moon and pledge herself to the service of Selemene, or leave and never return. She did not hesitate. Embracing her absolution, she renounced her bloody past, and took up a new mantle as Luna of the Dark Moon, the dreaded Moon Rider, ruthless and ever-loyal guardian of the Nightsilver Woods.","talentsTips":["The all stats talent effectively grants Luna 144 health, 0.8 health regen, 0.64% magic resistance, 1.6 armor, 10 attack speed, 0.5% movement speed, 96 mana, 0.4 mana regen, 0.56% spell damage and 8 attack damage.","The lifesteal talent stacks additively with other sources of lifesteal."],"trivia":["In DotA, Luna was a Night Elf. Night elves are a prominent race in the Warcraft universe, so this change was likely made to avoid copyright issues with Blizzard.","Luna's lore, quotes, accent, and reverence for Selemene derive largely from the Celts. Celtic lore heavily features warrior queens, who were often associated mystically with the moon.","The name Luna means moon in Latin, Spanish, Italian, Russian, Romanian and Bulgarian.","Her mount's name is Nova."],"talents":["+0.25s Eclipse Lucent Ministun:25% Lifesteal","+100 Lucent Beam Damage:+8 All Stats","+30 Movement Speed:-4s Lucent Beam Cooldown","+200 Cast Range:+15 Attack Speed"],"desc":"Luna the Moon Rider is a ranged agility carry hero. Even though she can be seen as a tempting target for enemy heroes, Luna possesses solid early game laning presence due to her Lucent Beams, a cheap, low-cooldown nuke, and her Lunar Blessing aura, which grants all nearby allied heroes increased damage. Mid-game, she becomes far more formidable with Moon Glaives, allowing her to kill entire creep waves with two to three attacks, and Eclipse, which can very quickly kill a hero if that hero is unfortunate enough to catch its full blast. Her Achilles' Heel is her fragility; she has no escape abilities and cannot handle a lot of punishment, relying on her movement speed to keep her out of harm's way. Luna begins and ends a match dangerously, and if played carefully and skillfully, she will destroy anybody who stands against her."}