{"abilities":[{"spell":"Направляет во врага луч лунной энергии, нанося урон и ненадолго оглушая его.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Lucent Beam сначала наносит урон, затем применяет дебафф.","Оружие героя выпускает немного частиц в момент применения, которые видны всем."],"mana":"90\/100\/110\/120","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"6 ( 2)","name":"Lucent Beam","description":["Анимация применения: 0,4+0,47","Дальность применения: 800 ( 1200)","Урон: 75\/150\/225\/300 ( 200\/275\/350\/425)","Длительность оглушения: 0,8"],"hot_key":"Q","legacy_key":"C"},{"spell":"Заклинает глефы героя, позволяя им отскакивать по нескольким врагам. Каждый следующий отскок наносит меньше урона.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Отскочившие глефы летят со скоростью 900 единиц (с той же скоростью, что и снаряды от её атак).","Moon Glaives срабатывают только тогда, когда атака успешно поражает цель. То есть в случае промаха или избегания атаки отскоки не сработают","Вопреки тому, как выглядит способности, воздействие от неё считается за пассивную способность, а не в качестве обычной атаки. То есть кроме того, что урон способности основывается на уроне Luna и срабатывает от её атак, способность ничего не делает с атаками. Урон от отскочивших глеф считается как урон от способности, при этом игнорируя усиление урона заклинаний и не используя вампиризм заклинаний. На глефы не срабатывают никакие модификаторы атаки и они не учитываются в качестве атаки для эффектов, срабатывающих от атаки (к примеру, Retaliate). Это также означает, что глефы игнорируют уклонение. При этом блокировка урона уменьшает урон от них.","Можно избежать отскочившие глефы. Существо, избежавшее глефу, не отмечается как получившее удар, поэтому глефа может немедленно отскочить от него снова, если оно окажется в радиусе отскоков.","Отскок, которого избежали, продолжает считаться за случившийся, поэтому он уменьшает количество оставшихся отскоков и урон следующего.","Урон глефов расчитывается от урона запустившей их атаки и рассчитывается в момент атаки. То есть они взаимодействуют с критическим ударом и Quell, поскольку эффекты учитываются при расчете начального урона. Также неважно, сколько урона фактически получила цель, поскольку расчет происходит до попадания снаряда. При этом остальные бонусы к урону не учитываются (например, срабатывание Javelin), поскольку их урон наносится после урона атаки.","Может отскочить обратно в тех же существ, если способность поразит любых ближайших существ. Если поблизости нет существ, способность ничего не сделает. Не может отскочить на врага, находящегося в тумане войны.","Не может перескочить на варды и союзников, но может от них отскочить при атаке. Полностью работает на строения.","Отскоки наносят до 65%\/42.25%\/27.46%\/17.85%\/11.6%\/7.54% от урона запущенной атаки Luna.","Moon Glaives могут нанести до 100%\/142.25%\/142.25%\/167.64% урона основной цели атаки.","Всего наносит 165%\/207.25%\/234.71%\/271.71% физического урона, учитывая максимальное количество отскоков за уровень.","При изучении оружие героя начинает выделять голубые частицы, видимые всем."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Moon Glaives","description":["Радиус отскоков: 500","Отскоков: 1\/2\/3\/6","Снижение урона за отскок: 35%"],"hot_key":"W","legacy_key":"G"},{"spell":"Увеличивает урон от атаки и броню у владельца способности и принадлежащих игрокам существ дальнего боя неподалёку. Также наделяет улучшенным ночным зрением.","effects":["Способность Аура","Действует на Союзников"],"notes":["При изучении Luna испускает очень слабые пульсирующие частицы вокруг неё.","Увеличивает ночной обзор героя до 1000\/1200\/1400\/1600.","Бонус к урону от атаки увеличивает только базовый урон и тот урон, который приобретён от базового атрибута.","Бонус к броне увеличивает всю броню, включая базовую броню, броню, приобретённую от ловкости и прямые бонусы к броне.","Бафф от ауры задерживается на 200\/400\/600\/800 секунды.","Действует на неуязвимых и спрятанных существ."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Lunar Blessing","description":["Радиус: 1200","Дополнительный урон от атаки: 10%\/15%\/20%\/25%","Дополнительная общая броня: 10%\/15%\/20%\/25%","Дополнительный обзор ночью: 200\/400\/600\/800","Длительность задержки ауры: 0,5"],"hot_key":"E","legacy_key":"L"},{"spell":"Бьёт случайных врагов неподалёку лучами от способности Lucent Beam текущего уровня. Лучи не оглушают и могут ударить по одному существу ограниченное число раз. Также способность на 10 сек. превращает день в ночь.","effects":["Способность Ненаправленная ( Направленная на юнита \/ Направленная на область)","Действует на Врагов","Урон Магический"],"notes":["Лучи наносят урон, учитывая текущий уровень Lucent Beam; если способность не изучена, Eclipse не будет наносить урона.","Eclipse превращает день в ночь на 10 секунд. Превращение не зависит от длительности Eclipse. Не мешает ночи, вызванной Dark Ascension, поэтому ночь, вызванная Night Stalker, не приостанавливается. Имеет меньший приоритет, чем день, вызванный Supernova.","Не поражает невидимых существ и существ в тумане войны.","При смерти героя Eclipse прерывается. При этом 10-секундная ночь продолжается. При улучшении и применении на землю способность прервется при смерти Luna. При улучшении и применении на союзника способность прервется при смерти союзника.","Оружие героя испускает немного частиц при применении, видимые для всех.","Несколько применений (с и без Aghanim's Scepter) действуют независимо друг от друга.","Максимальный возможный урон в одну цель (до учета сопротивления): Уровень Lucent Beam 1: 375 ( 1000) ( 450\/900\/1350, 1200\/2400\/3600) Уровень Lucent Beam 2: 750 ( 1375) ( 900\/1800\/2700, 1650\/3300\/4950) Уровень Lucent Beam 3: 1125 ( 1750) ( 1350\/2700\/4050, 2100\/4200\/6300) Уровень Lucent Beam 4: 1500 ( 2125) ( 1800\/3600\/5400, 2550\/5100\/7650)","При улучшении Aghanim's Scepter двойной щелчок в качестве цели применяет способность на себя. Может выбрать в качестве цели любое союзное существо, исключая варды и строения. Даёт наземный обзор в радиусе 675 единиц на всю длительность в случае, если существо не было выбрано.","При выборе таланта на 25 уровне каждый луч также будет оглушать пораженных врагов на 0,25 секунды. В отличии от урона оглушение применяется независимо от текущего уровня Lucent Beam, так как основывается не на оглушении самой способности. Талант мгновенно применяет эффект, поэтому лучи уже активированной способности будут оглушать. Лучи сначала наносят урон, затем применяют дебафф."],"mana":"150\/200\/250","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"140","name":"Eclipse","description":["Анимация применения: 0,6+0,2","Дальность применения: 0 ( 2500, 2900)","Радиус: 675","Всего лучей: 6\/9\/12 ( 6\/12\/18)","Макс. лучей на существо: 5 ( 6\/12\/18)","Интервал лучей: 0,6 ( 0,3)","Длительность: 2,4\/4,2\/6 ( 1,5\/3,3\/5,1)","Длительность оглушения за луч: 0 ( 0,25)"],"hot_key":"R","legacy_key":"E"}],"bio":"Как она опустилась до такого? Бич равнин, беспощадный повелитель людей и зверей, она могла сеять страх там, где ей вздумается. Теперь же она далеко от своей родины, на грани безумия от голода и месяцев скитаний, а её армия либо была давно мертва, либо их настигла участь хуже смерти. Едва она преступила границу древнего леса, в темноте деревьев блеснул пылающий взор. Что-то красивое и смертельное искало себе добычу в увядающих сумерках. Бесшумно оно развернулось и ушло. Ей завладела ярость. Со ржавым кинжалом в руке она ринулась вслед за зверем в надежде вернуть хотя бы частичку былой славы, но добыча всё ускользала от нее. Три раза она загоняла зверя в угол, и три раза она набрасывалась на него, но видела лишь ускользающую в леса тень. Но вот взошла полная луна, и отследить зверя в её ярком свете стало легче. Достигнув светлой вершины холма, огромная кошка, более не скрываясь, села в ожидании. Когда женщина стала размахивать кинжалом, зверь поднялся, взревел и кинулся на неё. Казалось, в этом странном месте к ней наконец пришла смерть. Но она спокойно остановилась. Через мгновение зверь выбил кинжал из её рук и исчез в лесу. Тишина. Фигуры в капюшонах приблизились к ней. Они почтительно поведали, что Селемине, Богиня Луны выбрала её, вела её и испытала её. Невольно она выполнила священный ритуал Тёмной Луны, воинов Серебряных лесов. Ей предложили выбор: присоединиться к Темной Луне и поклясться служить Селемине или уйти и никогда не возвращаться. Она не колебалась. Приняв своё освобождение, она отказалась от кровавого прошлого, и с тех пор её имя — Luna, устрашающий лунный наездник, беспощадный и непоколебимый защитник Серебряных лесов.","talentsTips":["Талант на все атрибуты в общем даёт Luna: 200 здоровья, 1 регенерации здоровья, 0,8% сопротивления магии, 1,6 брони, 10 скорости атаки, 0,5% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона заклинаний и 10 урона от атаки.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"trivia":["В DotA Allstars Luna была ночным эльфом. Этот факт был проигнорирован в DotA 2 из-за авторских прав, так как ночные эльфы - раса Warcraft.","История, акцент, фразы и поклонение Селемен были позаимствованы из культуры Кельтов. В их истории часто упоминались воительницы, которые были мистическим образом связаны с Луной.","Имя Селемен, скорее всего, является отсылкой к греческой богине Луны и ночи Селене, а в римской мифологии была богиня Луна, покровительница ночи.","Luna означает \"Луна\" на русском, латинском и испанском.","Её ездовое животное зовут Nova.","Возможно, что у Luna и Mirana есть связь, так как обе пришли из Серебряных лесов. Однако, Luna - Лунная всадница, а Mirana - Принцесса Луны."],"talents":["Лучи от Eclipse оглушают на 0,25 сек.:+35% к вампиризму","+125 к урону от Lucent Beam:+10 ко всем атрибутам","+30 к скорости передвижения:-4 сек. перезарядки Lucent Beam","+400 к дальности способностей:+20 к скорости атаки"],"desc":"Luna – это герой с дальним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Lucent Beam, направляет сконцентрированный луч лунной энергии во врага, нанося урон и оглушая его. Первая пассивная способность, Moon Glaives, позволяет атакам Luna отскакивать на врагов рядом с основной целью. Каждый следующий отскок наносит меньше урона. Вторая пассивная способность, Lunar Blessing, повышает основный атрибут Luna и окружающих её союзников, а также наделяет героя улучшенным ночным зрением. Ультимативная способность, Eclipse, призывает несколько Lucent Beams, которые бьют врагов рядом с Luna, основываясь на уровне первой способности. Любая цель не может получить больше определенного количества ударов. Также способность на 10 секунд превращает день в ночь. Улучшение с Aghanim's Scepter позволяет использовать способность на любом союзном юните или точке, чтобы способность действовала вокруг них, или на области. Также увеличивает количество лучей, максимальное число ударов по юниту, их частоту и длительность способности."}