{
  "abilities": [
    {
      "spell": "Направляет во врага луч лунной энергии, нанося урон и ненадолго оглушая его.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Оружие героя выпускает немного частиц в момент применения, которые видны всем."
      ],
      "mana": "90\/100\/110\/120",
      "elements": [
        "Блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "6 ( 2)",
      "name": "Lucent Beam",
      "description": [
        "Анимация применения: 0,4+0,47",
        "Дальность применения: 800 ( 1000)",
        "Урон: 75\/150\/225\/300 ( 175\/250\/325\/400)",
        "Длительность оглушения: 0,8"
      ],
      "hot_key": "Q",
      "legacy_key": "C"
    },
    {
      "spell": "Заклинает глефы героя, позволяя им отскакивать по нескольким врагам. Каждый следующий отскок наносит меньше урона.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Отскочившие глефы летят со скоростью 900 единиц (с той же скоростью, что и снаряды от её атак).",
        "Moon Glaives срабатывают только тогда, когда атака успешно поражает цель. То есть в случае промаха или избегания атаки отскоки не сработают",
        "Вопреки тому, как выглядит способности, воздействие от неё считается за пассивную способность, а не в качестве обычной атаки. То есть кроме того, что урон способности основывается на уроне Luna и срабатывает от её атак, способность ничего не делает с атаками. Урон от отскочивших глефов считается как урон от способности, при этом игнорируя усиление урона заклинаний и не может использовать вампиризм заклинаний. На глефы не срабатывают никакие модификаторы атаки и они не учитываются в качестве атаки для эффектов, срабатывающих от атаки (к примеру, Return). Это также означает, что глефы полностью игнорируют уклонение. При этом блокировка урона уменьшает урон от них.",
        "Можно избежать отскочившие глефы. Юнит, избежавший глефа, не отмечается как получивший удар, поэтому глефа может немедленно отскочить от него снова, если он окажется в радиусе отскоков.",
        "Отскок, которого избежали, продолжает считаться за случившийся, поэтому он уменьшает количество оставшихся отскоков и урон следующего.",
        "Не имеет значения, как много урона получила начальная цель от атаки, отскоки всегда наносят урон, опираясь на среднее значение основного урона Luna и дополнительного урона. То есть броня или остальные эффекты, манипулирующие уроном, которые действуют на начальную цель, совсем не влияют на урон отскоков. Также урон от модификаторов атаки (к примеру критический удар или дополнительный урон от Quell по крипам) на отскоки не работает.",
        "Может отскочить обратно в тех же юнитов, если способность поразит любых ближайших юнитов. Если поблизости нет юнитов, способность ничего не сделает. Не может отскочить на врага, находящегося в тумане войны.",
        "Не может перескочить на варды и союзников, но может от них отскочить при атаке. Полностью работает на строения.",
        "Отскоки наносят 65%\/42.25%\/27.46%\/17.85%\/11.6%\/7.54% от базового урона Luna.",
        "Moon Glaives могут нанести до 100%\/142.25%\/142.25%\/167.64% урона первичной цели атаки.",
        "Всего наносит 165%\/207.25%\/234.71%\/271.71% физического урона, принимая в учет максимальное количество отскоков за уровень.",
        "При изучении оружие героя начинает выделять голубые частицы, видимые всем."
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Moon Glaives",
      "description": [
        "Радиус отскоков: 500",
        "Отскоков: 1\/2\/3\/6",
        "Снижение урона за отскок: 35%"
      ],
      "hot_key": "W",
      "legacy_key": "G"
    },
    {
      "spell": "Повышает основной атрибут у владельца способности и союзных героев неподалёку. Также наделяет улучшенным ночным зрением.",
      "effects": [
        "Способность Аура",
        "Действует на Союзных героев"
      ],
      "notes": [
        "При изучении Luna испускает очень слабые пульсирующие частицы вокруг неё.",
        "Увеличивает ночной обзор героя до 1000\/1200\/1400\/1600.",
        "Бонусы, получаемые от основного атрибута союзниками: Сила: 135\/270\/405\/540 к здоровью, 0.75\/1.5\/2.25\/3 к регенерации здоровья, 0.6%\/1.2%\/1.8%\/2.4% к сопротивлению магии и 7.5\/15\/22.5\/30 к урону от атаки. Ловкость: 0.38%\/0.75%\/1.13%\/1.5% к скорости передвижения, 7.5\/15\/22.5\/30 к скорости атаки, 1.2\/2.4\/3.6\/4.8 к броне и 7.5\/15\/22.5\/30 к урону от атаки. Интеллект: 90\/180\/270\/360 к мане, 0.38\/0.75\/1.13\/1.5 к регенерации маны, 0.53%\/1.05%\/1.58%\/2.1% к урону заклинаний и 7.5\/15\/22.5\/30 к урону от атаки.",
        "Бафф от ауры задерживается на 0.5 секунды.",
        "Действует на неуязвимых и спрятанных юнитов."
      ],
      "mana": "0",
      "elements": [
        "Может использоваться иллюзиями.",
        "Отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Lunar Blessing",
      "description": [
        "Радиус: 1200",
        "Бонус к основному атрибуту: 6\/12\/18\/24",
        "Дополнительный обзор ночью: 200\/400\/600\/800",
        "Длительность задержки ауры: 0.5"
      ],
      "hot_key": "E",
      "legacy_key": "L"
    },
    {
      "spell": "Бьет случайных врагов рядом с Luna способностью Lucent Beam текущего уровня. Способность не оглушает цель и может ударить по ней лишь ограниченное число раз. Также способность на 10 секунд превращает день в ночь.",
      "effects": [
        "Способность Ненаправленная ( Направленная на юнита \/ Направленная на область)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Лучи наносят урон, основываясь на текущем уровне Lucent Beam; если способность не изучена, Eclipse не будет наносить урона.",
        "Eclipse превращает день в ночь на 10 секунд. Превращение не зависит от длительности Eclipse.",
        "Не мешает ночи, вызванной Darkness, поэтому ночь, вызванная Night Stalker, не приостанавливается.",
        "Не поражает невидимых юнитов и юнитов в тумане войны.",
        "При смерти героя Eclipse прерывается. При этом 10-тисекундная ночь продолжается. При улучшении и применении на землю способность прервется при смерти Luna. При улучшении и применении на союзника способность прервется при смерти союзника.",
        "Оружие героя испускает немного частиц при применении, видимые для всех.",
        "Максимальный возможный урон в одну цель (до учета сопротивления): Уровень Lucent Beam 1: 375 ( 875) ( 450\/900\/1350, 1050\/2100\/3150) Уровень Lucent Beam 2: 750 ( 1250) ( 900\/1800\/2700, 1500\/3000\/4500) Уровень Lucent Beam 3: 1125 ( 1625) ( 1350\/2700\/4050, 1950\/3900\/5850) Уровень Lucent Beam 4: 1500 ( 2000) ( 1800\/3600\/5400, 2400\/4800\/7200)",
        "При улучшении Aghanim's Scepter двойной клик в качестве цели применяет способность на себя. Может выбрать в качестве цели любого союзного юнита, исключая варды и строения. Дает наземный обзор в радиусе 675 единиц на всю длительность в случае, если юнит не был выбран. Несколько применений работают отдельно друг от друга.",
        "При выборе таланта на 25 уровне каждый луч также будет оглушать пораженных врагов на 0.25 секунды. В отличии от урона оглушение применяется независимо от текущего уровня Lucent Beam, так как основывается не на оглушении самой способности. Талант мгновенно применяет эффект, поэтому лучи уже активированной способности будут оглушать. Лучи сначала наносят урон, затем применяют дебафф."
      ],
      "mana": "150\/200\/250",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "140",
      "name": "Eclipse",
      "description": [
        "Анимация применения: 0,6+0,2",
        "Дальность применения: 0 ( 2500, 2700)",
        "Радиус: 675",
        "Лучей: 5\/8\/11 ( 6\/12\/18)",
        "Макс. ударов луча на юнита: 5 ( 6\/12\/18)",
        "Интервал ударов: 0,6 ( 0,3)",
        "Длительность: 2,4\/4,2\/6 ( 1,5\/3,3\/5,1)",
        "Длительность оглушения за луч: 0 ( 0.25)"
      ],
      "hot_key": "R",
      "legacy_key": "E"
    }
  ],
  "bio": "Как она опустилась до такого? Бич равнин, беспощадный повелитель людей и зверей, она могла сеять страх там, где ей вздумается. Теперь она была далеко от своей родины, на грани безумия от голода и месяцев скитаний, а ее армия либо была давно мертва, либо их настигла участь хуже смерти. Едва она преступила границу древнего леса, в темноте блеснул пылающий взор. Что-то красивое и смертельное искало себе добычу в увядающих сумерках. Бесшумно оно развернулось и ушло. Ей завладела ярость. Схватив ржавый кинжал, она ринулась вслед за зверем, в надежде вернуть хотя бы частичку былой славы, но добыча все ускользала от нее. Три раза она загоняла зверя в угол, и три раза она нападала, но видела лишь ускользающую в леса тень. Освещая все вокруг, взошла полная луна, и отследить зверя стало легче. Достигнув светлой вершины холма, огромная кошка, более не скрываясь, сидела в ожидании. Когда женщина стала размахивать кинжалом, зверь поднялся, взревел и кинулся на нее. Казалось, смерть наконец настигла ее. Но она спокойно остановилась. Через мгновение зверь выбил кинжал из ее рук и исчез в лесу. Тишина. Фигуры в капюшонах приблизились к ней. В почтительных тонах они поведали, что Селемине, Богиня Луны выбрала ее, вела ее и испытала ее. Невольно она выполнила священный ритуал Темной Луны, воинов Серебряных лесов. Ей предложили выбор: присоединиться к Темной Луне и поклясться служить Селемине или уйти и никогда не возвращаться. Она не колебалась. Принимая свое освобождение, она отказалась от кровавого прошлого, и с тех пор ее имя — Luna, устрашающий лунный наездник, беспощадный и непоколебимый защитник Серебряных лесов.",
  "talentsTips": [
    "Талант на все атрибуты в общем даёт Luna: 144 здоровья, 0,8 регенерации здоровья, 0,64% сопротивления магии, 1,6 брони, 10 скорости атаки, 0,5% скорости передвижения, 96 маны, 0,4 регенерации маны, 0,56% урона заклинаний и 8 урона от атаки.",
    "Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."
  ],
  "trivia": [
    "В DotA Allstars Luna была ночным эльфом. Этот факт был проигнорирован в DotA 2 из-за авторских прав, так как ночные эльфы - раса Warcraft.",
    "История, акцент, фразы и поклонение Селемен были позаимствованы из культуры Кельтов. В их истории часто упоминались воительницы, которые были мистическим образом связаны с Луной.",
    "Имя Селемен, скорее всего, является отсылкой к греческой богине Луны и ночи Селене, а в римской мифологии была богиня Луна, покровительница ночи.",
    "Luna означает \"Луна\" на русском, латинском и испанском.",
    "Её ездовое животное зовут Nova.",
    "Возможно, что у Luna и Mirana есть связь, так как обе пришли из Серебряных лесов. Однако, Luna - Лунная всадница, а Mirana - Принцесса Луны."
  ],
  "talents": [
    "Лучи от Eclipse оглушают на 0,25 сек.:25% вампиризма",
    "+100 к урону от Lucent Beam:+8 ко всем атрибутам",
    "+30 к скорости передвижения:-4 сек. перезарядки Lucent Beam",
    "+200 к дальности способностей:+15 к скорости атаки"
  ],
  "tips": [
    "Luna и Night Stalker могут отлично сработаться. Когда Luna применяет Eclipse, она также вызывает искусственную ночь, что дает все бонусы для Night Stalker."
  ],
  "desc": "Luna – это герой с дальним типом атаки, основной характеристикой которого является ловкость. Ее первая способность, Lucent Beam, направляет сконцентрированный луч лунной энергии во врага, нанося урон и оглушая его. Первая пассивная способность, Moon Glaives, позволяет атакам Luna отскакивать на врагов рядом с основной целью. Каждый следующий отскок наносит меньше урона. Вторая пассивная способность, Lunar Blessing, повышает основный атрибут Luna и окружающих её союзников, а также наделяет героя улучшенным ночным зрением. Ультимативная способность, Eclipse, призывает несколько Lucent Beams, которые бьют врагов рядом с Luna, основываясь на уровне первой способности. Любая цель не может получить больше определенного количества ударов. Также способность на 10 секунд превращает день в ночь. Улучшение с Aghanim's Scepter позволяет использовать способность на любом союзном юните или точке, чтобы способность действовала вокруг них, или на области. Также увеличивает количество лучей, максимальное число ударов по юниту, их частоту и длительность способности."
}