{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Shadow_Blade_Shadow_Walk.mp3\/revision\/latest?cb=20191227195532",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Does not interrupt the user's channeling spells upon cast.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, and is considered by cleave, but not by crit. It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, and is considered by cleave, but not by crit.",
        "It is not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "During the fade time, the user can cast spells, use items and perform attacks without breaking the invisibility. Those attacks do apply the 175 damage to the target.",
        "Those attacks do apply the 175 damage to the target.",
        "The bonus damage is not applied when attacking wards and buildings out of the invisibility.",
        "The invisibility is lost upon reaching the cast point of spells, or upon finishing an attack (for ranged heroes upon projectile launch). This means when the attack misses, the invisibility is still lost.",
        "This means when the attack misses, the invisibility is still lost.",
        "Allows the user to pass through other units, including wards, but not through buildings.",
        "The user can pick up and drop items without breaking the invisibility.",
        "Shares cooldown with Silver Edge."
      ],
      "mana": "75",
      "abilityName": "Shadow Walk",
      "cooldown": "28",
      "description": "Makes you invisible for 14 seconds, or until you attack or cast a spell. While Shadow Walk is active, you move 20% faster and can move through units. If attacking to end the invisibility, you gain 175 bonus physical damage on that attack.",
      "params": [
        "Fade Time: 0.3",
        "Damage: 175",
        "Move Speed Bonus: 20%",
        "Duration: 14"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3000",
  "lore": null,
  "consistFrom": [
    "Shadow Amulet",
    "Blitz Knuckles",
    "Broadsword"
  ],
  "boughtFrom": "Weapons",
  "name": "Shadow Blade",
  "description": "The blade of a fallen king, it allows you to move unseen and strike from the shadows.",
  "trivia": [
    "In the original DotA, this item was called Lothar's Edge, a reference to Sir Anduin Lothar from the Warcraft universe. It is still commonly referred to as \"Lothar\" or \"Lothar's\" by those who have played the original DotA.",
    "Kunkka's cosmetic item, Kunkka's Shadow Blade, is based on Shadow Blade."
  ],
  "upgradeIn": [
    "Silver Edge"
  ],
  "bonuses": [
    "+25 Attack Damage",
    "+35 Attack Speed"
  ],
  "tips": null
}