{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/07\/Blink_Dagger_Blink_1.mp3\/revision\/latest?cb=20191227195354",
      "effects": [
        "Ability Target Point",
        "Affects Self"
      ],
      "notes": [
        "Double clicking the item automatically casts it on your team's fountain, blinking towards its direction, using the penalty distance.",
        "Disjoints projectiles upon cast.",
        "Does not blink for the full distance when targeting closer than the max distance.",
        "When targeting beyond the max blink distance, it blinks for range towards the targeted direction, instead of .",
        "The second sound only plays when the blinked distance is greater than . It is audible to everyone.",
        "Damage greater than 0 from any player (including allies, excluding self) or Roshan puts Blink on a 3 second cooldown. Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm. However, this cooldown is not affected by Octarine Core or Arcane Rune. Does not get disabled by damage flagged as HP Removal.",
        "Since it is a cooldown and not actually disabled, it can be refreshed with Refresher Orb, Refresher Shard and Rearm.",
        "However, this cooldown is not affected by Octarine Core or Arcane Rune.",
        "Does not get disabled by damage flagged as HP Removal.",
        "Does not share cooldown with Fallen Sky."
      ],
      "mana": null,
      "abilityName": "Overwhelming Blink",
      "cooldown": "15",
      "description": "Teleport to a target point up to 1200 units away. After teleporting, all enemies in an 800 AoE have 50% movement slow and 50 attack speed slow for 6 seconds and take damage equal to Hero strength + 200. Blink Dagger cannot be used for 3 seconds after taking damage from an enemy hero or Roshan.",
      "params": [
        "Cast Range: Global",
        "Max Blink Distance: 1200",
        "Penalty Blink Distance: 960",
        "Damage Cooldown: 3",
        "AOE: 800",
        "Movement slow: 50%",
        "Attack speed slow: 50",
        "Debuff duration: 6",
        "Damage: Hero strength + 200"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [],
  "cost": "6800",
  "lore": null,
  "consistFrom": [
    "Blink Dagger",
    "Reaver",
    "Recipe"
  ],
  "boughtFrom": "Artifacts",
  "name": "Overwhelming Blink",
  "description": "A horrifying dagger forged in the chaos maw and nigh untouchable by mortal hands.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+25 Strength"
  ],
  "tips": null
}