{
  "abilities": [
    {
      "notes": [
        "Талант на уклонение мультипликативно складывается с другими источниками уклонения.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Эффекты атаки действуют на все цели Split Shot",
          "talentRight": "+800 к мане"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+2 сек. длительности Stone Gaze",
          "talentRight": "-3 сек. перезарядки Mystic Snake"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+32% к получению маны от Mystic Snake",
          "talentRight": "+30 к скорости атаки"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15% к уклонению",
          "talentRight": "+15 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Medusa_Split_Shot_attack.mp3\/revision\/latest?cb=20191216020120",
      "effects": [
        "Способность Переключаемая",
        "Действует на Врагов",
        "Урон Мгновенная атака"
      ],
      "notes": [
        "При переключении не прерывает произносимые заклинания Medusa.",
        "Позволяет Medusa совершать мгновенные атаки по ближайшим 4 врагам при запуске снаряда атаки. То есть все снаряды выпускаются вместе одновременно с основной атакой. При этом не важно, промахнулась ли первоначальная атака или нет, дополнительные стрелы все равно будут выпущены.",
        "То есть все снаряды выпускаются вместе одновременно с основной атакой.",
        "При этом не важно, промахнулась ли первоначальная атака или нет, дополнительные стрелы все равно будут выпущены.",
        "Дополнительные стрелы летят с той же скоростью, что и первоначальная.",
        "Радиус поиска зависит от дальности атаки Medusa + 150; в итоге радиус равен 750 единиц, учитывая стандартную дальность атаки героя.",
        "На мгновенные атаки от Split Shot не срабатывают модификаторы атаки или эффекты, срабатывающие при атаке, если только не был выбран талант, позволяющий модификаторам срабатывать. При этом они продолжают считаться за обычные атаки. Урон, наносимый Split Shot, не считается за урон заклинаний. На стрелы также влияет тип брони и они блокируются с помощью блокировки урона как и обычные атаки. Если Medusa ослеплена, то стрелы могут промахнутся, за исключением наличия у героя эффекта True Strike. Они так же могут промахнутся из-за уклонения.",
        "При этом они продолжают считаться за обычные атаки. Урон, наносимый Split Shot, не считается за урон заклинаний.",
        "На стрелы также влияет тип брони и они блокируются с помощью блокировки урона как и обычные атаки.",
        "Если Medusa ослеплена, то стрелы могут промахнутся, за исключением наличия у героя эффекта True Strike. Они так же могут промахнутся из-за уклонения.",
        "Не считает целями варды, постройки, невидимых существ или существ с иммунитетом к атакам или в тумане войны, но считает целью курьеров. При этом при атаке вардов или строений продолжает выпускать дополнительные стрелы для поражения подходящих целей в радиусе атаки. Дополнительные стрелы не выпускаются при атаке союзников.",
        "При этом при атаке вардов или строений продолжает выпускать дополнительные стрелы для поражения подходящих целей в радиусе атаки.",
        "Дополнительные стрелы не выпускаются при атаке союзников.",
        "При активации основной и дополнительный урон Medusa уменьшается. Иные источники урона, добавляемые к основной атаке, не уменьшаются (например, оглушающий удар от предметов). Уменьшение, отображаемое в интерфейсе, некорректно, поскольку учитывает только основной урон, а не основной и дополнительный.",
        "Иные источники урона, добавляемые к основной атаке, не уменьшаются (например, оглушающий удар от предметов).",
        "Уменьшение, отображаемое в интерфейсе, некорректно, поскольку учитывает только основной урон, а не основной и дополнительный.",
        "Split Shot остается после смерти Medusa. Если Split Shot была активна на момент смерти, то герой возродится с активной способностью."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Герой магически расщепляет свои стрелы, атакуя несколько целей, но нанося при этом меньше урона. На дополнительные цели не действуют эффекты атаки (такие как критический урон) или уникальные модификаторы атаки.",
      "spellName": "Split Shot",
      "params": [
        "Анимация применения: 0+0",
        "Доп. дальность расщепленных стрел: 150",
        "Дополнительные цели: 4",
        "Наносимый урон: 50%\/60%\/70%\/80%",
        "Иллюзии, созданные с активной Split Shot, сохраняют статус способности."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Каждый, кто столкнется с проклятой горгоной, испытает на себе ее гнев."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a0\/Medusa_Mystic_Snake_1.mp3\/revision\/latest?cb=20191216020134",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Змея движется со скоростью 800.",
        "Способность сначала наносит урон, затем применяет замедление (TagTalent и дебафф Stone Gaze).",
        "Змея всегда отскакивает от текущей цели в ближайшую подходящую. Не может поразить одну и ту же цель более 1 раза за применение.",
        "Medusa получает ману при возвращении змеи. Восстановление зависит от максимальной маны всех пораженных врагов.",
        "Mystic Snake не ворует ману у иллюзий.",
        "Mystic Snake нужно поразить существ с общим запасом маны в 1273\/1072\/942\/851 (TagTalent 326\/327\/327\/327), чтобы восполнить расход маны на заклинание.",
        "Каждое успешное попадание по врагу усиливает урон от следующего отскока на 35% от базового урона способности. То есть урон не растет в геометрической прогрессии, а статичен; при каждом следующем отскоке наносится на 28\/42\/56\/70 больше урона.",
        "То есть урон не растет в геометрической прогрессии, а статичен; при каждом следующем отскоке наносится на 28\/42\/56\/70 больше урона.",
        "Здесь указано, сколько урона нанесет Mystic Snake () и сколько будет длится окаменение) за отскок, если все отскоки успешно попали (до уменьшений): Уровень 1: 80\/108\/136 урона, 324 урона в общем (1\/1,3\/1,6 секунд окаменения) Уровень 2: 120\/162\/204\/246 урона, 732 урона в общем (1\/1,3\/1,6\/1,9 секунд окаменения) Уровень 3: 160\/216\/272\/328\/384 урона, 1360 урона в общем (1\/1,3\/1,6\/1,9\/2,2 секунд окаменения) Уровень 4: 200\/270\/340\/410\/480\/550 урона, 2250 урона в общем (1\/1,3\/1,6\/1,9\/2,2\/2,5 секунд окаменения)",
        "Уровень 1: 80\/108\/136 урона, 324 урона в общем (1\/1,3\/1,6 секунд окаменения)",
        "Уровень 2: 120\/162\/204\/246 урона, 732 урона в общем (1\/1,3\/1,6\/1,9 секунд окаменения)",
        "Уровень 3: 160\/216\/272\/328\/384 урона, 1360 урона в общем (1\/1,3\/1,6\/1,9\/2,2 секунд окаменения)",
        "Уровень 4: 200\/270\/340\/410\/480\/550 урона, 2250 урона в общем (1\/1,3\/1,6\/1,9\/2,2\/2,5 секунд окаменения)",
        "Змея может отскочить на существ в тумане войны, но не на невидимых, неуязвимых или спрятанных существ.",
        "Если текущая цель змеи умерла или стала неуязвимой, спрятанной или невидимой, то отскок не зачтется и не увеличит урон. В этом случае змея продолжит отскакивать по ближайшим подходящим целям.",
        "В этом случае змея продолжит отскакивать по ближайшим подходящим целям.",
        "Змея дает летающий обзор в радиусе 100 единиц в момент полета.",
        "Улучшение от Aghanim's Scepter требует изученной Stone Gaze. Способность использует тот же модификатор, что и Stone Gaze, поэтому их эффекты не складываются. Дебафф так же использует иконку Stone Gaze. В режиме Ability Draft для действия улучшения должна быть выбрана Stone Gaze.",
        "Способность использует тот же модификатор, что и Stone Gaze, поэтому их эффекты не складываются. Дебафф так же использует иконку Stone Gaze.",
        "В режиме Ability Draft для действия улучшения должна быть выбрана Stone Gaze."
      ],
      "mana": "140\/150\/160\/170",
      "hotKey": "W",
      "cooldown": "10 (TagTalent 7)",
      "description": "Выпускает энергетическую змею, которая скачет от цели к цели и наносит урон. Достигнув последней цели, змея вернётся к владельцу и восстановит ему ману. С каждым скачком змея наносит больше урона. Восстанавливает 11%\/14%\/17%\/20% от общего запаса маны жертв.",
      "spellName": "Mystic Snake",
      "params": [
        "Анимация применения: 0,2+0,67",
        "Дальность применения: 700",
        "Радиус скачка: 475",
        "Число скачков: 3\/4\/5\/6",
        "Базовый урон: 80\/120\/160\/200",
        "Усиление урона за скачок: 35%",
        "Восстановление от макс. маны: 11%\/14%\/17%\/20% (TagTalent 43%\/46%\/49%\/52%)",
        "Замедление скорости передвижения: 30%",
        "Замедление скорости поворота: 50%",
        "Длительность замедления: 3",
        "Начальная длительность окаменения: 0 (TagAghanim 1)",
        "Увеличение длительности за скачок: 0 (TagAghanim 0,3)",
        "Способность обращает врагов в камень. Длительность увеличивается с каждым скачком змеи.",
        "Если цель получила иммунитет к заклинаниям, то она не учитывается в числе отскоков.",
        "Блокируется как основной, так и вторичной целью. Блокируется при попадании. При блокировке перестает отскакивать и возвращается к герою, чтобы восстановить ману."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Величайшая сила горгоны — в её проклятии."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5c\/Medusa_Mana_Shield_1.mp3\/revision\/latest?cb=20191216020131",
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Mana Shield не прерывает произносимые заклинания Medusa.",
        "Поглощает урон до любого уменьшения урона, включая блокировку урона или уменьшение от заклинания (например, Aphotic Shield). Также это влияет на всё, что взаимодействует непосредственно с уроном, наносимым после уменьшений (например, Orchid Malevolence).",
        "Также это влияет на всё, что взаимодействует непосредственно с уроном, наносимым после уменьшений (например, Orchid Malevolence).",
        "При активации увеличивает эффективное здоровье Medusa на 233,33%, учитывая то, что у героя достаточно маны.",
        "Mana Shield остается после смерти Medusa. Если щит был активен в момент смерти, то герой возродится с активной способностью."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Создаёт щит, который поглощает 70% получаемого урона, используя ману героя.",
      "spellName": "Mana Shield",
      "params": [
        "Анимация применения: 0+0",
        "Поглощение урона: 70%",
        "Урона на единицу маны: 1,6\/1,9\/2,2\/2,5",
        "Пока действует иммунитет к заклинаниям, Mana Shield не будет реагировать на магический урон."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Несмотря на то что горгона не удостоилась бессмертия при рождении, проклятье наделило её великолепными защитными способностями."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9d\/Medusa_Stone_Gaze_1.mp3\/revision\/latest?cb=20191216020122",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "У вражеской команды должен быть обзор на Medusa (при использовании ей Stone Gaze) хотя бы на 1 тик сервера до начала воздействия на любых врагов. Stone Gaze не подействует, пока условие не выполнится. После осуществления враги, потерявшие обзор на Medusa, все еще могут попасть под действие Stone Gaze даже в тумане войны.",
        "Stone Gaze не подействует, пока условие не выполнится.",
        "После осуществления враги, потерявшие обзор на Medusa, все еще могут попасть под действие Stone Gaze даже в тумане войны.",
        "Каждое вражеское существо, обращенное лицом в сторону Medusa в пределах 85° градусов в радиусе 1200 вокруг заклинателя получит дебаффы: один отслеживает, как долго существо смотрело в сторону Medusa, другой - дает замедление.",
        "Дебафф, отслеживающий положение существа, считает, сколько времени оно смотрело на Medusa. Если в сумме получается 2 секунды, то он заставляет существо окаменеть. Дебафф длится столько же, сколько и Stone Gaze (то есть он заканчивается вместе с ультимейтом) или до конца окаменения. Двухсекундный счетчик не сбрасывается, если существо отвернулось. Взгляд на Medusa в неуязвимом или спрятанном состоянии продолжает учитываться счетчиком. То есть окаменение можно избежать, становясь неуязвимым в момент попытки применения способностью окаменения.",
        "Дебафф длится столько же, сколько и Stone Gaze (то есть он заканчивается вместе с ультимейтом) или до конца окаменения.",
        "Двухсекундный счетчик не сбрасывается, если существо отвернулось.",
        "Взгляд на Medusa в неуязвимом или спрятанном состоянии продолжает учитываться счетчиком.",
        "То есть окаменение можно избежать, становясь неуязвимым в момент попытки применения способностью окаменения.",
        "Дебафф замедления действует только на затронутых врагов, смотрящих на Medusa. Существа, которые не смотрят на заклинателя, не замедляются, но сохраняют дебафф. Дебафф замедления длится столько же, сколько и Stone Gaze (то есть он заканчивается вместе с ультимейтом) или до конца окаменения.",
        "Дебафф замедления длится столько же, сколько и Stone Gaze (то есть он заканчивается вместе с ультимейтом) или до конца окаменения.",
        "Только при завершении дебаффа, дающего окаменение, существо вновь сможет окаменеть из-за Stone Gaze, попадая под действие способности до тех пор, пока не закончится её длительность и пока существо смотрит на Medusa.",
        "Окаменение - это обычное оглушение, которое вдобавок замораживает анимации и увеличивает урон от физических атак. Не усиливает атаки с магическим или чистым уроном и урон заклинаний с физическим уроном.",
        "Не усиливает атаки с магическим или чистым уроном и урон заклинаний с физическим уроном.",
        "Stone Gaze не действует на нейтральных крипов.",
        "Stone Gaze завершается при смерти Medusa, но уже окаменевшие враги остаются в таком состоянии всю длительность."
      ],
      "mana": "100",
      "hotKey": "R",
      "cooldown": "90",
      "description": "Снижает скорость передвижения и атаки любого врага, который посмотрит на владельца способности. Если жертва будет смотреть на него более 2 секунд, то она превратится в камень. Оглушает окаменевших существ и увеличивает физический урон по ним.",
      "spellName": "Stone Gaze",
      "params": [
        "Анимация применения: 0,4+0,5",
        "Радиус: 1200",
        "Угол обзора для окаменения: 85°",
        "Доп. скорость передвижения заклинателя: 50%",
        "Замедление скорости передвижения: 35%",
        "Замедление скорости атаки: 35",
        "Замедление скорости поворота: 35%",
        "Доп. физический урон: 40%\/45%\/50%",
        "Длительность способности: 5\/6\/7 (TagTalent 7\/8\/9)",
        "Длительность окаменения: 3"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Такая красота поистине легендарна."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.5,
    "attrStrength": 17.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 4.0,
    "attrAgilityInc": 3.6,
    "attrAgility": 22.0
  },
  "description": "Medusa — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Первая способность, Split Shot, разделяет выстрел Medusa на несколько стрел. Эти стрелы наносят меньше урона по сравнению с ее базовой атакой. На дополнительные цели не воздействуют эффекты атаки (такие как критический урон) или уникальные модификаторы атаки. Второй способностью, Mystic Snake, Medusa бросает змею, которая прыгает от цели к цели нанося урон и воруя ману. После того как она достигнет последней цели, она вернется назад к Medusa, восполняя запас маны. Змея наносит больше урона и ворует больше маны с каждым прыжком. Третья способность, Mana Shield, создает щит, который поглощает получаемый урона, используя ману Medusa. Ультимативная способность, Stone Gaze, замедляет скорость атаки и передвижения любого вражеского юнита, который посмотрит на Medusa. Если враг будет смотреть на Medusa более 2 секунд, пока Stone Gaze включен, он превратится в камень. Окаменелые существа оглушются и получают дополнительный физический урон. При покупке Aghanim's Scepter Stone Gaze будет применяться ко всем юнитам, задетых Mystic Snake.",
  "history": "«Красота — страшная сила». Этой мыслью утешала себя самая юная и прелестная горгона с раннего детства, ибо ей единственной из трёх прекрасных дочерей морской богини не довелось родиться бессмертной. Всё изменилось в тот роковой день, когда неизвестные в масках ворвались в обитель горгон и похитили её сестер, бесстрастные к их красоте и слезам. Схвативший Медузу тут же отбросил её с отвращением: «От неё разит, как от смертной! Такие нам ни к чему». Медуза, сгорая от унижения и ярости, поспешила в храм матери, пала пред богиней и взмолилась: «Раз не удостоена я бессмертия, прошу, дай мне силу — дабы я вызволила своих сестёр и посвятила остаток жизни мщению за эту несправедливость». Долго размышляла богиня, и, наконец, даровала Медузе прошенное. Взамен на свою воспеваемую красоту Медуза получила устрашающий лик и ещё более ужасающую мощь. Ни на мгновение не пожалела она о своем выборе, ведь знала: единственная красота, которой стоит обладать, — это сила, ибо лишь сила изменит мир.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Эффекты атаки действуют на все цели Split Shot",
      "talentRight": "+800 к мане"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+2 сек. длительности Stone Gaze",
      "talentRight": "-3 сек. перезарядки Mystic Snake"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+32% к получению маны от Mystic Snake",
      "talentRight": "+30 к скорости атаки"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15% к уклонению",
      "talentRight": "+15 к урону"
    }
  ]
}