{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical (TagAghanimHP Removal)"
      ],
      "notes": [
        "Successive attacks with Orb of Corrosion do not stack the debuff, but refresh the duration instead.",
        "The attacks first apply the debuff, then their own damage.",
        "When a melee and a ranged hero with Orb of Corrosion attack one target, the slow of the first applied debuff is used and refreshed.",
        "Deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 3 instances.",
        "Can deal up to 9 damage (before reductions).",
        "The damage from Corrosion is flagged as HP Removal, so it does not trigger any on-damage effects.",
        "Works against buildings and allied units. Does not work against wards.",
        "Does not stack with the slow and damage over time of Orb of Venom. If both debuffs are present, Orb of Venom's debuff does not slow or deal damage.",
        "Does not stack with the armor reduction of Blight Stone. If both debuffs are present, Blight Stone's debuff does not reduce armor.",
        "Fully stacks with any other item."
      ],
      "mana": null,
      "abilityName": "Corrosion",
      "cooldown": null,
      "description": "Dealing 3 damage per second, reducing armor by 3, and slowing movement speed by 13% if the equipped hero is melee, or by 4% if they are ranged. Lasts 3 seconds.",
      "params": [
        "Armor Reduction: 3",
        "Movement Speed Slow (Melee): 13%",
        "Movement Speed Slow (Ranged): 4%",
        "Damage per Second: 3",
        "Duration: 3"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "925",
  "lore": null,
  "consistFrom": [
    "Orb of Venom",
    "Blight Stone",
    "Fluffy Hat",
    "Recipe"
  ],
  "boughtFrom": "Accessories",
  "name": "Orb of Corrosion",
  "description": "Seepage from the wounds of a warrior deity, sealed in an arcanist's orb following a campaign of vicious slaughter.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+150 Health"
  ],
  "tips": null
}