{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical (TagAghanimHP Removal)"
      ],
      "notes": [
        "The damage from Poison Attack is flagged as HP Removal, so it does not trigger any on-damage effects.",
        "Successive attacks with Orb of Corrosion do not stack, but refresh the duration instead.",
        "The attacks first apply the debuff, then their own damage.",
        "When a melee and a ranged hero with Orb of Corrosion attack one target, the slow of the first applied debuff is used and refreshed.",
        "Deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 3 instances.",
        "Can deal up to 9 damage (before reductions).",
        "Does not work against wards. Works against buildings and couriers.",
        "The damage over time is lethal.",
        "Attacks apply the debuff before dealing damage.",
        "Corruption fully stacks with Desolator, Orb of Destruction and Stygian Desolator. Does not stack with Blight Stone.",
        "Slow stacks with Orb of Destruction. Does not stack with Orb of Venom."
      ],
      "mana": null,
      "abilityName": "Corrosion",
      "cooldown": null,
      "description": "Poisons the target, dealing 3 magical damage per second, reducing armor by 3, and slowing movement by 13% if the equipped hero is melee, or by 4% if they are ranged. Lasts for 3 seconds.",
      "params": [
        "Move Speed Slow (Melee): 13%",
        "Move Speed Slow (Ranged): 4%",
        "Damage per Second: 3",
        "Duration: 3",
        "Armor Reduction: 3"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "825",
  "lore": null,
  "consistFrom": [
    "Orb of Venom",
    "Blight Stone",
    "Fluffy Hat"
  ],
  "boughtFrom": "Accessories",
  "name": "Orb of Corrosion",
  "description": "Seepage from the wounds of a warrior deity, sealed in an arcanist's orb following a campaginof vicious slaughter.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+150 Health"
  ],
  "tips": null
}