{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7f\/Psychic_Headband_Psychic_Push.mp3\/revision\/latest?cb=20210120232119",
      "effects": [
        "Cast Range: 600",
        "Push Distance: 400",
        "Push Duration: 0.3"
      ],
      "notes": [
        "Pushes the target at a speed of 1333.33.",
        "The target is not disabled during the push, so they still can cast abilities, attack, and turn during the push. Does not interrupt channeling abilities upon cast.",
        "Does not interrupt channeling abilities upon cast.",
        "Does not push units affected by Black Hole, Chronosphere, Duel or Flaming Lasso.",
        "Cannot push units through Kinetic Field or Arena Of Blood.",
        "If the target is affected by Soulbind, it cannot push the unit further than its max stretch distance allows.",
        "If the target is leashed by Pounce, the leash gets instantly broken upon cast. However, if the target gets leashed after cast, it cannot push the unit further than the max stretch distance of Pounce allows.",
        "However, if the target gets leashed after cast, it cannot push the unit further than the max stretch distance of Pounce allows.",
        "Cannot be cast on wards or buildings. Can be cast on Homing Missile.",
        "Can move units over impassable terrain. Trees within 100 radius around the pushed target gets destroyed during the push.",
        "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement.",
        "Does not share cooldown with Force Staff-based items."
      ],
      "mana": "0",
      "abilityName": "Psychic Push",
      "cooldown": "20",
      "description": "Pushes the target enemy unit away from you 400 distance.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "With the item's cast range bonus, Psychic Push has a total cast range of 700."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Psychic Headband",
  "description": "A failed experiment in finer telekinetic control, still fit for other ends.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}