{
  "abilities": [
    {
      "effects": [
        "Дальность применения: 700",
        "Максимальное количество приручаемых существ: 1",
        "Минимальный порог здоровья: 1500",
        "Скорость передвижения: 425",
        "Награда за убийство: 200"
      ],
      "notes": [
        "Применяет к цели базовое развеивание, которое убирает баффы и дебаффы.",
        "Приручение нового крипа убьет уже прирученного.",
        "Количество максимально доступных юнитов для приручения связано с игроком. Покупка нового Helm of the Dominator не позволит приручить дополнительного юнита. Это также распространяется на Helm of the Dominator клона, созданного Tempest Double. Если противник переманивает прирученного крипа (например, с помощью Enchant), то приручение нового не убьет переманенного. При продаже или разбитии предмета прирученный крип умирает. Эта смерть никому не засчитывается, поэтому она никому не даст опыта.",
        "Приравнивает скорость передвижения цели к 425.",
        "Устанавливает награду за цель в 200 золота. Базовая награда не дается за убийство цели, только установленная. Получаемый за убийство опыт не меняется.",
        "Если максимальное здоровье юнита ниже порога минимального здоровья, то максимальное и текущее здоровье юнита увеличивается на эту разницу. Это увеличение не считается за лечение. Здоровье юнита устанавливается равным значению способности.",
        "Не восстанавливает ману крипа.",
        "Нельзя приручить древних крипов, призываемых существ Necronomicon и крипов-героев."
      ],
      "elements": [
        "Способность Направленная на юнита",
        "Действует на Вражеских существ"
      ],
      "name": "Dominate",
      "description": "Даёт контроль над нейтральным крипом, не являющимся древним, и увеличивает его скорость передвижения до 425, а запас здоровья — до 1500. Если максимальное здоровье существа больше 1500, оно не изменится. За убийство существа даётся 200 золота."
    },
    {
      "effects": [
        "Радиус: 900",
        "Доп. скорость атаки: 20",
        "Доп. регенерация здоровья: 7",
        "Длительность задержки ауры: 0.5"
      ],
      "notes": [
        "Бафф от ауры задерживается на 0.5 секунды.",
        "Не сочетается с несколькими источниками Dominator Aura.",
        "Сочетается с другими источниками, дающими дополнительную скорость атаки и регенерацию здоровья.",
        "Регенерирует до 420 единиц здоровья в минуту.",
        "Не действует на варды, строения и неуязвимых юнитов."
      ],
      "elements": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "name": "Dominator Aura",
      "description": "Восстановление здоровья увеличено на 7, скорость атаки увеличена на 20."
    }
  ],
  "cost": "1350",
  "description": "Могущественный шлем мертвого некроманта.",
  "further": [
    "Gloves_of_Haste",
    "Headdress",
    "Ring_of_Health"
  ],
  "attrs": [
    "Активируемая Dominate",
    "Пассивная Dominator Aura",
    "Бонус +2 к силе +2 к ловкости +2 к интеллекту",
    "Можно разобрать? Нет",
    "Можно сообщать? Нет"
  ],
  "info": [
    "Для героев силы, даёт 45 здоровья, 0,25 регенерации здоровья, 0,2% сопротивления магии, 0,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.",
    "Для героев ловкости, даёт 36 здоровья, 0,2 регенерации здоровья, 0,16% сопротивления магии, 0,4 брони, 2,5 скорости атаки, 0,13% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.",
    "Для героев интеллекта, даёт 36 здоровья, 0,2 регенерации здоровья, 0,16% сопротивления магии, 0,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 30 маны, 0,13 регенерации маны, 0,18% урона от способностей и 2 урона от атаки."
  ]
}