{
  "abilities": [
    {
      "notes": [
        "The level 15 health talent is provided by an aura.",
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+4% Wild Axes Damage Amp Per Stack",
          "talentRight": "+30 Inner Beast Attack Speed"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-30s Primal Roar Cooldown",
          "talentRight": "+35 Boar Damage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+250 Health Beastmaster Controlled",
          "talentRight": "+3 Mana Regen"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Movement Speed",
          "talentRight": "+30 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Beastmaster_Wild_Axes_1.mp3\/revision\/latest?cb=20191216011217",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The axes either travel at a speed of 1200 or reach the target point in one second, whichever is faster. The same applies upon returning. Upon returning, their speed periodically adapts based on their distance to Beastmaster and the remaining travel time. This means the axes fly a maximum of up to two seconds, up to one second towards the point and up to one second back.",
        "Upon returning, their speed periodically adapts based on their distance to Beastmaster and the remaining travel time.",
        "This means the axes fly a maximum of up to two seconds, up to one second towards the point and up to one second back.",
        "Both axes spread up to 450 distance away from each other, before moving back together while traveling towards the targeted point. Their minimum travel distance is 450 as well, so when targeting a point closer than 450 range, they still intersect 450 range away. The axes fly in arcs, so that the axe coming from Beastmaster's left hand travels back towards his right hand, and vice versa. They destroy every tree they come in contact with, while providing 350 radius flying vision as they travel. This vision does not last.",
        "Their minimum travel distance is 450 as well, so when targeting a point closer than 450 range, they still intersect 450 range away.",
        "The axes fly in arcs, so that the axe coming from Beastmaster's left hand travels back towards his right hand, and vice versa.",
        "They destroy every tree they come in contact with, while providing 350 radius flying vision as they travel. This vision does not last.",
        "The axes first apply the debuff, then the damage. This means they effectively amplify their own damage as well. Uses one debuff on hit targets for all stacks. The debuff has a number on it, showing the amount of stacks. Since the axes work separate, one of the axes always benefits from 2 stacks of the debuff, if both hit. Successive hits on the same unit fully refresh the whole stack's duration.",
        "Uses one debuff on hit targets for all stacks. The debuff has a number on it, showing the amount of stacks.",
        "Since the axes work separate, one of the axes always benefits from 2 stacks of the debuff, if both hit.",
        "Successive hits on the same unit fully refresh the whole stack's duration.",
        "Applies generic incoming damage amplification on the targets. Stacks additively with other sources of generic incoming damage manipulation. The amplification affects all damage that is not flagged as HP removal the targets take from Beastmaster and all his units. Allies do not benefit from it.",
        "The amplification affects all damage that is not flagged as HP removal the targets take from Beastmaster and all his units. Allies do not benefit from it.",
        "A unit can only get hit once by each axe, so the maximum possible damage per axe is 42.4\/75.6\/110\/145.6 (TagTalent 44\/78.4\/114\/150.8) before reductions. Does not affect Couriers.",
        "Does not affect Couriers."
      ],
      "mana": "65",
      "hotKey": "Q",
      "cooldown": "8 (TagTalent 0)",
      "description": "Beastmaster sends his axes flying and calls them home again, slicing through enemy units and trees along their path. Each axe can hit an enemy once, and amplifies subsequent damage from Beastmaster and his units.",
      "spellName": "Wild Axes",
      "params": [
        "Cast Animation: 0.4+0.47",
        "Cast Range: 1500",
        "Axes Radius: 175",
        "Axes Travel Distance: 1500",
        "Axes Spread Distance: 450",
        "Damage per Axe: 40\/70\/100\/130",
        "Damage Amplification per Stack: 6%\/8%\/10%\/12% (TagTalent 10%\/12%\/14%\/16%)",
        "Stack Duration: 12",
        "Causes Wild Axes to have no cooldown, and can be used again once they come back."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "While learning to maneuver in nature alone, the Beastmaster also mastered the use of a pair of tomahawks, adept at cutting down trees as well as adversaries."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/40\/Beastmaster_Call_of_the_Wild_Boar.mp3\/revision\/latest?cb=20191216011213",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Leveling this ability automatically levels Call of the Wild Hawk as well. In Ability Draft, Call of the Wild Boar is a stand-alone ability, and does not come with Call of the Wild Hawk.",
        "In Ability Draft, Call of the Wild Boar is a stand-alone ability, and does not come with Call of the Wild Hawk.",
        "Does not destroy a previous summon if this ability is used again before the previous Boar expires.",
        "The boar spawns at a random location within a 100 radius around to Beastmaster."
      ],
      "mana": "60\/65\/70\/75",
      "hotKey": "W",
      "cooldown": "42\/38\/34\/30",
      "description": "Beastmaster calls forth a Boar to aid in the battlefield.",
      "spellName": "Call of the Wild Boar",
      "params": [
        "Cast Animation: 0.3+0.67",
        "Number of Boars: 1",
        "Boar Duration: 60"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "After befriending the strange beast of his childhood, Beastmaster has learned to call to animals in times of need."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Beastmaster_Call_of_the_Wild_Hawk.mp3\/revision\/latest?cb=20191216011215",
      "effects": [
        "Ability Target Area (TagAghanim Target Unit)"
      ],
      "notes": [
        "Leveling this ability automatically levels Call of the Wild Boar as well. In Ability Draft, Call of the Wild Hawk is unavailable. Call of the Wild Boar is a stand-alone ability.",
        "In Ability Draft, Call of the Wild Hawk is unavailable. Call of the Wild Boar is a stand-alone ability.",
        "Does not destroy a previous summon if this ability is used again before the previous Hawk expires.",
        "The hawk spawns at a random location within a 300 radius around to Beastmaster. It spawns invisible, without any fade time.",
        "The hawk cannot be controlled at all. Once cast, it automatically flies towards the targeted area and stays there. Its flight towards the target area cannot be interrupted by anything. If the hawk gets its movement disabled (e.g. stunned, rooted, etc), it resumes moving to the location as soon as it can move again. Taunts and hypnotize cause the hawk to stop for their duration, but it resumes as soon as the taunt expires. The hawk completely ignores fear.",
        "Its flight towards the target area cannot be interrupted by anything.",
        "If the hawk gets its movement disabled (e.g. stunned, rooted, etc), it resumes moving to the location as soon as it can move again.",
        "Taunts and hypnotize cause the hawk to stop for their duration, but it resumes as soon as the taunt expires. The hawk completely ignores fear.",
        "Hawks do not block neutral creep camps.",
        "Acquiring Aghanim's Shard does not retroactively grant the Dive Bomb ability to already summoned Hawks.",
        "With Aghanim's Shard, this ability can be directly targeted on an enemy unit. When done, the hawk flies towards that unit's location upon cast, as if ground-targeted. It does not alter its path if the target moves. If at any time while traveling the target comes within cast range of Dive Bomb, the Hawk casts it on them. If the target gets out of cast range before the cast finishes, it gets canceled and the hawk resumes traveling to the cast location. However, the hawk may attempt to cast Dive Bomb again if the target comes within range again. Once the hawk reaches the cast location and becomes stationary, it no longer attempts to cast Dive Bomb on the original target.",
        "When done, the hawk flies towards that unit's location upon cast, as if ground-targeted. It does not alter its path if the target moves.",
        "If at any time while traveling the target comes within cast range of Dive Bomb, the Hawk casts it on them.",
        "If the target gets out of cast range before the cast finishes, it gets canceled and the hawk resumes traveling to the cast location.",
        "However, the hawk may attempt to cast Dive Bomb again if the target comes within range again.",
        "Once the hawk reaches the cast location and becomes stationary, it no longer attempts to cast Dive Bomb on the original target."
      ],
      "mana": "30",
      "hotKey": "E",
      "cooldown": "60\/50\/40\/30 (TagTalent 45\/35\/25\/15)",
      "description": "Beastmaster sends an invisible Hawk to scout an area.",
      "spellName": "Call of the Wild Hawk",
      "params": [
        "Cast Animation: 0.3+0.67",
        "Cast Range: Global",
        "Number of Hawks: 1",
        "Hawk Duration: 60",
        "Reduces Hawk cooldown by 15. Hawks gain Dive Bomb."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "After befriending the strange beast of his childhood, Beastmaster has learned to call to animals in times of need."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies"
      ],
      "notes": [
        "Affects invulnerable, but not hidden units.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Untaps the inner fury of nearby allies, passively increasing their attack speed.",
      "spellName": "Inner Beast",
      "params": [
        "Radius: 1200",
        "Attack Speed Bonus: 15\/25\/35\/45 (TagTalent 45\/55\/65\/75)",
        "Aura Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Beastmaster's ability to incite the innate strength of animals was seen in the mauling of the king of Slom."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cd\/Beastmaster_Primal_Roar.mp3\/revision\/latest?cb=20191216011216",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Only enemy units are shoved aside from the path of the roar. Roshan is not affected by the knockback. Affected units are fully disabled during the knockback. Can be cast on Couriers to stun them, but it cannot damage them. Couriers are also affected by the knockback as secondary targets.",
        "Affected units are fully disabled during the knockback.",
        "Can be cast on Couriers to stun them, but it cannot damage them. Couriers are also affected by the knockback as secondary targets.",
        "Knocks units aside at a speed of 450, up to 450 range away, resulting in a knockback duration of 1 second. Units hit by the knockback destroy trees within 100 radius and are made to face towards the direction they are getting pushed.",
        "Units hit by the knockback destroy trees within 100 radius and are made to face towards the direction they are getting pushed.",
        "The knockback and slow have a dynamic range, based on the distance between Beastmaster and the primary target. For every 2 distance between Beastmaster and the target upon cast, the knockback range increases by 1. For example, when the target is 600 range away, the knockback hits units up to 300 range behind the target and behind Beastmaster. The width of the knockback area is fixed at 300, so the affected area is always stadium-shaped.",
        "For every 2 distance between Beastmaster and the target upon cast, the knockback range increases by 1.",
        "For example, when the target is 600 range away, the knockback hits units up to 300 range behind the target and behind Beastmaster.",
        "The width of the knockback area is fixed at 300, so the affected area is always stadium-shaped.",
        "Considering the dynamic range, the slow\/knockback can hit units up to 900 range away.",
        "When an enemy is perfectly aligned with Beastmaster and his Primal Roar target, it does not get knocked aside. However, the slow and damage are still applied, and the target is still disabled for the knockback duration.",
        "However, the slow and damage are still applied, and the target is still disabled for the knockback duration.",
        "On the primary target, the roar first applies the debuff, then the damage. On secondary targets, the roar first applies the damage, then the debuff.",
        "On secondary targets, the roar first applies the damage, then the debuff.",
        "The movement speed bonus only affects Beastmaster and his units. Other nearby allies are not buffed."
      ],
      "mana": "150\/175\/200",
      "hotKey": "R",
      "cooldown": "90\/80\/70 (TagTalent 60\/50\/40)",
      "description": "Beastmaster lets loose a deafening roar that stuns, and shoves open a path to its target. All units in the path of the roar are damaged, while units shoved aside by the roar have their movement and attack speed slowed. Additionally, Beastmaster and his units gain 60% movement speed for 3\/3.5\/4 seconds.",
      "spellName": "Primal Roar",
      "params": [
        "Cast Animation: 0.5+0.63",
        "Cast Range: 600",
        "Move Speed Bonus Radius: 900",
        "Knockback Width: 300",
        "Knockback Distance: 450",
        "Knockback Duration: 1",
        "Damage: 150\/225\/300",
        "Enemy Move Speed Slow: 60%",
        "Enemy Attack Speed Slow: 60",
        "Slow Duration: 3\/3.5\/4",
        "Ally Move Speed Bonus: 40%",
        "Move Speed Buff Duration: 3\/3.5\/4",
        "Stun Duration: 3\/3.5\/4",
        "Fully pierces spell immunity on the primary target. Does not affect secondary spell immune enemies. Slow and knockback persist if debuff was placed before spell immunity and when not dispelled.",
        "Blocked fully only when primary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "The Beastmaster has learned to channel his primal instincts into an animalistic roar, causing devastation in the ranks of enemies."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Self"
      ],
      "notes": [
        "Affects all units under Beastmaster's control, including himself.",
        "The aura increases maximum health capacity, and keeps the current health percentage.",
        "The aura affects invulnerable or hidden units.",
        "The aura is bestowed even while Beastmaster is dead."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "There is no description for this ability.",
      "spellName": "Health Aura",
      "params": [
        "Radius: Global",
        "Health Bonus: 250",
        "Aura Linger Duration: 0.5",
        "Illusions bestow and benifit from the aura. Multiple instances of the aura do not stack."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "This ability level scales together with Call of the Wild Boar's level. However, the level of already summoned boars does not adapt.",
        "However, the level of already summoned boars does not adapt.",
        "The attacks first apply their damage, then the debuff.",
        "Successive attacks do not stack the slow, they refresh the duration."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Inflicts a poison that slows attack and movement speeds.",
      "spellName": "Poison",
      "params": [
        "Move Speed Slow: 10%\/20%\/30%\/40%",
        "Attack Speed Slow: 10\/20\/30\/40",
        "Slow Duration: 3",
        "Slow persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d3\/Hawk_Dive_Bomb_1.mp3\/revision\/latest?cb=20210626132907",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Despite the description, Dive Bomb uses a cast time, and not channel time. The reveal modifier is placed on the Hawk as soon as it begins casting, and lasts until the dive ends.",
        "The reveal modifier is placed on the Hawk as soon as it begins casting, and lasts until the dive ends.",
        "Once the cast begins, the player cannot manually cancel it anymore, since casting Dive Bomb is the only order that can be given to the Hawk.",
        "The hawk dives in an arc for to 0.4 seconds, so the speed varies based on the distance. The speed does not instantly adapt if the distance changes, but rather accelerates or decelerates at a very slow rate.",
        "The speed does not instantly adapt if the distance changes, but rather accelerates or decelerates at a very slow rate.",
        "Uses forced movement to move the Hawk. This means, it can be interrupted by applying other sources of forced movement on it. The dive cannot be interrupted by anything else. It fully ignores all disables.",
        "The dive cannot be interrupted by anything else. It fully ignores all disables.",
        "The Hawk first applies the damage, then the stun, and then dies. The Hawk's death cannot be prevented in any way.",
        "The Hawk's death cannot be prevented in any way.",
        "Can be cast on Couriers."
      ],
      "mana": "0",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "Channels for 1 second, revealing itself, and then flying towards the target enemy, dealing 250 damage and stunning them for 2 second, killing the hawk.",
      "spellName": "Dive Bomb",
      "params": [
        "Cast Animation: 1+0",
        "Cast Range: 1200",
        "Damage: 250",
        "Stun Duration: 2",
        "Dive Duration: 0.4",
        "Pierces spell immunity on couriers only."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 1.6,
    "attrAgility": 18.0
  },
  "description": "Karroch, the Beastmaster, is a versatile melee strength hero most commonly played as an offlaner and ganker who brings a good amount of utility to his team in any situation. His Wild Axes allows him to lane and farm quite effectively throughout the game, even when pressured. He is able to summon a hawk and boar to aid him, each providing a good amount of utility to his team. Hawks provide free flying vision around the map, scouting his enemies while his Boars can harass and slow his enemies to a crawl while aiding him in combat. His Inner Beast aura makes his team a force to be reckoned with, providing a hefty boost to attack speed to himself, his summons, and all nearby allies. Finally, his ultimate, Primal Roar, is the longest lasting single-target reliable stun in the game and also penetrates spell immunity (being only counterable by Linken's Sphere), providing a strong initiation for his team to claim a kill. With these skills, he can push enemy towers quickly and safely, take down undefended targets with the help of Necronomicon summons, lock down a single target, and also kite enemies in teamfights. With careful observation of the battlefield, Beastmaster takes down enemies one by one and paves the way to victory.",
  "history": "Karroch was born a child of the stocks. His mother died in childbirth; his father, a farrier for the Last King of Slom, was trampled to death when he was five. Afterward Karroch was indentured to the king's menagerie, where he grew up among all the beasts of the royal court: lions, apes, fell-deer, and things less known, things barely believed in. When the lad was seven, an explorer brought in a beast like none before seen. Dragged before the King in chains, the beast spoke, though its mouth moved not. Its words: a plea for freedom. The King only laughed and ordered the beast perform for his amusement; and when it refused, struck it with the Mad Scepter and ordered it dragged to the stocks. Over the coming months, the boy Karroch sneaked food and medicinal draughts to the wounded creature, but only managed to slow its deterioration. Wordlessly, the beast spoke to the boy, and over time their bond strengthened until the boy found he could hold up his end of a conversation. He could, in fact, speak now to all the creatures of the King's menagerie. On the night the beast died, a rage came over the boy. He incited the animals of the court to rebel and threw open their cages to set them amok on the palace grounds. The Last King was mauled in the mayhem. In the chaos, one regal stag bowed to the boy who had freed him; and with Beastmaster astride him, leapt the high walls of the estate, and escaped. Now a man, Karroch the Beastmaster has not lost his ability to converse with wild creatures. He has grown into a warrior at one with nature's savagery.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+4% Wild Axes Damage Amp Per Stack",
      "talentRight": "+30 Inner Beast Attack Speed"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-30s Primal Roar Cooldown",
      "talentRight": "+35 Boar Damage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+250 Health Beastmaster Controlled",
      "talentRight": "+3 Mana Regen"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Movement Speed",
      "talentRight": "+30 Damage"
    }
  ]
}