{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/15\/Chaos_Knight_Chaos_Bolt_1.mp3\/revision\/latest?cb=20191216012025",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Chaos Bolt travels at a speed of 700.",
        "Stun duration and raw damage values are shown above the target's head upon hit, visible to allies and enemies, with the duration being shown as a rounded integer up to two decimal places. However, the actual stun duration is not by exact seconds — it ranges between the min and max values (e.g. at level 1, it could stun for 1.74 seconds).",
        "However, the actual stun duration is not by exact seconds — it ranges between the min and max values (e.g. at level 1, it could stun for 1.74 seconds).",
        "Damage and stun values are inversely related, the longer the stun is, the less damage it deals and vice versa. This means the damage decreases by 6.32\/6.92\/7.27\/7.5 per each additional 0.1 seconds of stun. Has the following values for the damage and stun duration on each level: Level 1: 1.25s – 120, 1.4875s – 105, 1.725s – 90, 1.9625s – 75, 2.2s – 60 Level 2: 1.5s – 180, 1.825s – 157.5, 2.15s – 135, 2.475s – 112.5, 2.8s – 90 Level 3: 1.75s – 240, 2.1625s – 210, 2.575s – 180, 2.9875s – 150, 3.4s – 120 Level 4: 2s – 300, 2.5s – 262.5, 3s – 225, 3.5s – 187.5, 4s – 150 TALENT NOTES Since both the minimum and maximum value of the stun duration are increased evenly by 0.75, the above damage values remain the same.",
        "This means the damage decreases by 6.32\/6.92\/7.27\/7.5 per each additional 0.1 seconds of stun. Has the following values for the damage and stun duration on each level: Level 1: 1.25s – 120, 1.4875s – 105, 1.725s – 90, 1.9625s – 75, 2.2s – 60 Level 2: 1.5s – 180, 1.825s – 157.5, 2.15s – 135, 2.475s – 112.5, 2.8s – 90 Level 3: 1.75s – 240, 2.1625s – 210, 2.575s – 180, 2.9875s – 150, 3.4s – 120 Level 4: 2s – 300, 2.5s – 262.5, 3s – 225, 3.5s – 187.5, 4s – 150",
        "Level 1: 1.25s – 120, 1.4875s – 105, 1.725s – 90, 1.9625s – 75, 2.2s – 60",
        "Level 2: 1.5s – 180, 1.825s – 157.5, 2.15s – 135, 2.475s – 112.5, 2.8s – 90",
        "Level 3: 1.75s – 240, 2.1625s – 210, 2.575s – 180, 2.9875s – 150, 3.4s – 120",
        "Level 4: 2s – 300, 2.5s – 262.5, 3s – 225, 3.5s – 187.5, 4s – 150",
        "",
        "TALENT NOTES Since both the minimum and maximum value of the stun duration are increased evenly by 0.75, the above damage values remain the same.",
        "The bolt first applies the debuff, then the damage.",
        "All illusions owned by Chaos Knight within 675 range of the target also cast a fake Chaos Bolt. They play the whole cast animation and release their fake bolt at the same time the real bolt is released. When illusions currently are not having any order and are standing still, they turn to face the target and cast the fake bolt. When illusions are moving or attacking, they continue to do so and do not turn to face the target. They still play the cast animation, overriding their move or attack animations. When canceling the cast, the illusions still play the full cast animation, but do not release the fake bolt. The fake bolts do not interact with anything and do not damage or stun the target.",
        "They play the whole cast animation and release their fake bolt at the same time the real bolt is released.",
        "When illusions currently are not having any order and are standing still, they turn to face the target and cast the fake bolt.",
        "When illusions are moving or attacking, they continue to do so and do not turn to face the target. They still play the cast animation, overriding their move or attack animations.",
        "When canceling the cast, the illusions still play the full cast animation, but do not release the fake bolt.",
        "The fake bolts do not interact with anything and do not damage or stun the target.",
        "SHARD NOTES Chaos Bolt now creates 1 controllable Phantasm illusion upon projectile impact, based on its current level. Does not spawn an illusion, if the projectile gets disjointed, or the target is invulnerable, hidden or spell immune upon impact. Phantasm notes fully apply. If Phantasm is not learned, the illusion does not spawn. The illusion spawned spawns automatically starts attacking the affected enemy. Dispelling the stun or dying does not remove already spawned illusions.",
        "Does not spawn an illusion, if the projectile gets disjointed, or the target is invulnerable, hidden or spell immune upon impact.",
        "Phantasm notes fully apply. If Phantasm is not learned, the illusion does not spawn.",
        "The illusion spawned spawns automatically starts attacking the affected enemy.",
        "Dispelling the stun or dying does not remove already spawned illusions.",
        "SHARD NOTES The illusion spawns at different distances depending on the caster and target's collision size as follows: The illusion spawns 58 range away from the target if both the caster and target have a collision size of 8. The illusion spawns 87 range away from the target if either the caster or the target has a collision size of 24.",
        "The illusion spawns 58 range away from the target if both the caster and target have a collision size of 8.",
        "The illusion spawns 87 range away from the target if either the caster or the target has a collision size of 24."
      ],
      "mana": "13\/12\/11\/10 (TagTalent 10\/9\/8\/7)",
      "item_behaviour": [],
      "name": "Chaos Bolt",
      "cooldown": "110\/120\/130\/140",
      "description": "Throws a mysterious bolt of energy at the target unit. It stuns for a random duration and deals random damage.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.4+0.4",
        "Cast Range:  500 ( 650)",
        "Min Damage: 60\/90\/120\/150",
        "Max Damage: 120\/180\/240\/300",
        "Min Stun Duration: 1.25\/1.5\/1.75\/2 ( 2\/2.25\/2.5\/2.75)",
        "Max Stun Duration: 2.2\/2.8\/3.4\/4 ( 2.95\/3.55\/4.15\/4.75)",
        "Number of Phantasm Illusions: 1",
        "Illusion Damage Dealt: 100%",
        "Illusion Damage Taken: 325% ( 250%)",
        "Illusion Duration: 6"
      ],
      "legacy_key": "C",
      "story": "Even Chaos Knight cannot predict this manifest of unholy energy."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Chaos_Knight_Reality_Rift.mp3\/revision\/latest?cb=20191216012022",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Self"
      ],
      "notes": [
        "Does not disjoint projectiles for enemies and self.",
        "Teleports Chaos Knight to a point 250\/300\/350\/400 (TagTalent 475\/525\/575\/625) range away from the target's original position, towards Chaos Knight's original cast location, but not beyond it. The target is then teleported 62 range in front of that location, so they effectively get pulled by 188\/238\/288\/338 (TagTalent 413\/463\/513\/563) range. Chaos Knight's illusions are located around the target from random angles, with the same distance to it as Chaos Knight. The location is determined at the beginning of the cast. A visual effect while casting denotes the point at which Chaos Knight and his target will land. Also plays a visual effect at the location of any nearby allied illusions while casting, even illusions not actually owned by Chaos Knight. If the enemy has vision of Chaos Knight or the target, these visual effects can be seen through the Fog of War. Chaos Knight and his illusions are made to face his target and are issued an attack order against the target.",
        "The target is then teleported 62 range in front of that location, so they effectively get pulled by 188\/238\/288\/338 (TagTalent 413\/463\/513\/563) range.",
        "Chaos Knight's illusions are located around the target from random angles, with the same distance to it as Chaos Knight.",
        "The location is determined at the beginning of the cast.",
        "A visual effect while casting denotes the point at which Chaos Knight and his target will land. Also plays a visual effect at the location of any nearby allied illusions while casting, even illusions not actually owned by Chaos Knight. If the enemy has vision of Chaos Knight or the target, these visual effects can be seen through the Fog of War.",
        "Also plays a visual effect at the location of any nearby allied illusions while casting, even illusions not actually owned by Chaos Knight.",
        "If the enemy has vision of Chaos Knight or the target, these visual effects can be seen through the Fog of War.",
        "Chaos Knight and his illusions are made to face his target and are issued an attack order against the target.",
        "When cast on Roshan, Chaos Knight and his illusions still get moved, but Roshan does not.",
        "The armor debuff is applied to the target upon cast. Chaos Knight does not need to attack it in order to place the debuff.",
        "The debuff from successive casts does not stack but refreshes the duration.",
        "Does not interrupt the target's channeling abilities.",
        "TALENT NOTES Fully affects Couriers upon learning the Reality Rift pierces spell immunity talent."
      ],
      "mana": "18\/14\/10\/6",
      "item_behaviour": [],
      "name": "Reality Rift",
      "cooldown": "50",
      "description": "Teleports you, any images you have and the target unit to a point along the line between the two of you. Reduces armor of the enemy unit for 6 seconds.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  550\/600\/650\/750",
        "Illusion Search Radius: 1375",
        "Target Pull Distance: 250\/300\/350\/400 ( 475\/525\/575\/625)",
        "Armor Reduction: 4\/5\/6\/7",
        "Duration: 6"
      ],
      "legacy_key": "E",
      "story": "Armageddon rides between the planes, bringing Chaos Knight to his victim wherever he may hide."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/82\/Chaos_Knight_Chaos_Strike.mp3\/revision\/latest?cb=20191216012015",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies \/ Self"
      ],
      "notes": [
        "Increases attack damage by an average of 10.83%\/16.67%\/22.5%\/28.33% (TagTalent 14.08%\/21.67%\/29.25%\/36.83%) against heroes clones, and illusions. Increases attack damage by an average of 32.91%\/41.66%\/50.41%\/59.16% (TagTalent 42.79%\/54.16%\/65.54%\/76.91%) against non-hero units. Treats creep-heroes and Roshan as heroes.",
        "Increases attack damage by an average of 32.91%\/41.66%\/50.41%\/59.16% (TagTalent 42.79%\/54.16%\/65.54%\/76.91%) against non-hero units.",
        "Treats creep-heroes and Roshan as heroes.",
        "A critical strike proc is decided upon attack begin, not upon landing an attack. When a critical strike procs, Chaos Knight uses a specific crit attack animation, and particle effects appear on his weapon.",
        "When a critical strike procs, Chaos Knight uses a specific crit attack animation, and particle effects appear on his weapon.",
        "The proc chances of multiple critical strike sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority.",
        "If two sources of critical strike proc at the same time, the higher multiplier has priority.",
        "Stacks additively with other sources of lifesteal.",
        "Does not proc against wards, buildings and allies.",
        "Chaos Strike uses pseudo-random distribution."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Chaos Strike",
      "cooldown": null,
      "description": "Chaos Knight and his illusions' attacks have a chance to deal a critical strike of varying strength, in addition to a lifesteal for percentage of the damage. Deals 1.5x damage to creeps.",
      "hot_key": "E",
      "params": [
        "Proc Chance: 33.33% ( 43.33%)",
        "Min Critical Damage: 125%",
        "Max Critical Damage: 140%\/175%\/210%\/245%",
        "Lifesteal: 20%\/30%\/40%\/50% ( 42%\/52%\/62%\/72%)",
        "Non-Hero Damage Percentage: 150%"
      ],
      "legacy_key": "R",
      "story": "Chaos Knight's unwieldy power bludgeons those who stand before him, crushing the thickest of armors."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d7\/Chaos_Knight_Phantasm.mp3\/revision\/latest?cb=20191216012020",
      "effects": [
        "Ability: No Target",
        "Affects: Self "
      ],
      "notes": [
        "Applies a basic dispel on Chaos Knight and disjoints projectiles upon cast.",
        "Chaos Knight is invulnerable, hidden and spell immune during the 0.5-second split time. Also provides 400 radius flying vision around Chaos Knight upon cast during the split time.",
        "Also provides 400 radius flying vision around Chaos Knight upon cast during the split time.",
        "After the 0.5 seconds split time, Chaos Knight reappears with his illusions. The reappear locations are based on Chaos Knight's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point. This means when spawning 3 illusions, the formation is T-shaped and when spawning 4 illusions, it is shaped like a plus. Though the formation is always the same, Chaos Knight and his illusions take a random position in the formation and have all the same facing angle. All Phantasm-based illusions have a EXPR 2 * IllusionLVL bounty. The illusions spawn at different distances depending on the caster's collision size as follows: The illusions spawn 135 range away if the caster has a collsion size of 24. The illusions spawn 90 range away if the caster has a collision size of 8.",
        "The reappear locations are based on Chaos Knight's position upon cast, with one appearing at the cast location, and the others north, east, south or west from that point.",
        "This means when spawning 3 illusions, the formation is T-shaped and when spawning 4 illusions, it is shaped like a plus.",
        "Though the formation is always the same, Chaos Knight and his illusions take a random position in the formation and have all the same facing angle.",
        "All Phantasm-based illusions have a EXPR 2 * IllusionLVL bounty.",
        "The illusions spawn at different distances depending on the caster's collision size as follows: The illusions spawn 135 range away if the caster has a collsion size of 24. The illusions spawn 90 range away if the caster has a collision size of 8.",
        "The illusions spawn 135 range away if the caster has a collsion size of 24.",
        "The illusions spawn 90 range away if the caster has a collision size of 8.",
        "Orders the caster to stop after the split time, canceling all queued orders, and orders given during the split time. Also stops all ongoing targeted orders of other units that have been issued before Phantasm was cast.",
        "Also stops all ongoing targeted orders of other units that have been issued before Phantasm was cast.",
        "Recasting Phantasm replaces the illusions from the previous cast, no matter under whose control they are.",
        "Phantasm illusions are strong illusions, meaning they cannot be instantly killed by abilities that normally kill illusions instantly.",
        "SCEPTER NOTES Phantasm now creates Global illusion of every ally hero and clones, Globally, under Chaos Knight's control. Does not affect invulnerable or hidden allies. Applies a basic dispel on affected allied heroes, but does not disjoint projectiles. Does not turn the ally invulnerable or hidden either, and it does not interrupt their current orders. The same illusion formation notes apply to these illusions as well.",
        "Does not affect invulnerable or hidden allies.",
        "Applies a basic dispel on affected allied heroes, but does not disjoint projectiles.",
        "Does not turn the ally invulnerable or hidden either, and it does not interrupt their current orders.",
        "The same illusion formation notes apply to these illusions as well.",
        "SCEPTER NOTES The illusions spawn at different distances depending on the ally's collision size as follows: The illusions spawn 81 range away if the ally has a collision size of 24. The illusions spawn 54 range away if the ally has a collision size of 8.",
        "The illusions spawn 81 range away if the ally has a collision size of 24.",
        "The illusions spawn 54 range away if the ally has a collision size of 8."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Phantasm",
      "cooldown": "75\/125\/175",
      "description": "Summons several phantasmal copies of the Chaos Knight from alternate dimensions. The phantasms are strong illusions that deal 100% damage, but take 325% damage.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.4+0",
        "Split Time: 0.5",
        "Number of Illusions: 1\/2\/3 ( 2\/3\/4)",
        "Illusion Damage Dealt: 100%",
        "Illusion Damage Taken: 325% ( 250%)",
        "Duration: 30 ( 40)",
        "Effect Radius: Global",
        "Number of Illusions From Each Ally: 1"
      ],
      "legacy_key": "T",
      "story": "Drawing on his battles fought across many worlds and many times, phantasms of the Chaos Knight rise up to quell all who oppose him."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.2,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.2,
    "attrAgilityInc": 1.4,
    "attrAgility": 18.0
  },
  "description": "Has strong but random damage output. Upon the black steed Armageddon, the Chaos Knight rode into countless battles with a single purpose in mind: To extinguish that which he knows as \"The Light\". Like a roll of unseen dice, the oldest Fundamental stuns his targets with a Chaotic Bolt, and then Strikes with life-stealing attacks that deal highly irregular amounts of damage. Those who escape the initial onslaught find themselves in a Reality Rift, reappearing inexplicably at Armageddon's side, exposed for its rider's wrath. Flanked by several images of himself, the Chaos Knight and his apocalyptic Phantasms hack their opponents apart with the strength of multiple heroes.  Carry Disabler Durable Pusher Initiator ★☆☆",
  "trivia": [
    "Chaos Strike's ability icon bears a similar appearance to a D20 dice, commonly used in table-top RPG games, where a full 20 usually results in a critical.",
    "Chaos Knight's lore and responses draw many references to the Four Horsemen of the Apocalypse, and his ultimate is a literalisation of it.",
    "The line Link▶️ \"Ah, Tidehunter, can I offer you a seabiscuit?\" is a reference to Seabiscuit, a famous American racehorse.",
    "Fitting his theme of randomness, Chaos Knight has the most varying attack damage in the game. His actual damage on attack can be up to 15 more or 15 less than his displayed damage.",
    "Chaos Knight's actual name in DotA was \"Nessaj\". This was removed in his transition to Dota 2, likely due to the change in his background story.",
    "Enigma, Chaos Knight, Keeper of the Light, and Io together represent the four fundamental forces of the universe with Chaos Knight representing the strong interaction, the force that binds quarks to make protons and neutrons. It is also one of the forces present in the detonation of a nuclear bomb, a weapon commonly seen as a tool of widespread death and destruction. Fitting to his theme, the strong force is the most powerful among the four fundamental forces, but its strength is very limited in far distances. Hence his status as a melee strength hero whose role is that of a hard carry. Furthermore, his Reality Rift spell brings an enemy hero into Chaos Knight's effective melee range, just like how the strong force binds quarks together with its strength. The uncertainty principle determines the range of the strong nuclear force. This is the reason why Chaos Knight's abilities and damage are so random. Furthermore, Enigma references the uncertainty principle when killing Chaos Knight: Link▶️ \"Chaos Knight: so limited by uncertainty.\"",
    "Fitting to his theme, the strong force is the most powerful among the four fundamental forces, but its strength is very limited in far distances. Hence his status as a melee strength hero whose role is that of a hard carry. Furthermore, his Reality Rift spell brings an enemy hero into Chaos Knight's effective melee range, just like how the strong force binds quarks together with its strength.",
    "The uncertainty principle determines the range of the strong nuclear force. This is the reason why Chaos Knight's abilities and damage are so random. Furthermore, Enigma references the uncertainty principle when killing Chaos Knight: Link▶️ \"Chaos Knight: so limited by uncertainty.\"",
    "Furthermore, Enigma references the uncertainty principle when killing Chaos Knight: Link▶️ \"Chaos Knight: so limited by uncertainty.\"",
    "Chaos Knight's default mount's name is Armageddon.",
    "One of Chaos Knight's death responses, Link▶️ \"Armageddon…out of here.\" may be a reference drawn from the film \"Bruce Almighty\" where, towards the end of the film the doomsayer (homeless man with handwritten signboard, often with typos) holds a sign \"ARMAGEDON OUTA HERE\". It works as a cheeky wordplay on \"I'mma gettin' out of here\"; reflecting on something that doesn't quite cease to be amazing, even while calling for a closure.",
    "Chaos Knight's response upon killing Dragon Knight, Link▶️ \"You did need a steed, didn't you?\", answers to one of his lines when he moves: Link▶️ \"I need no steed\"."
  ],
  "history": "The veteran of countless battles on a thousand worlds, Chaos Knight hails from a far upstream plane where the fundamental laws of the universe have found sentient expression. Of all the ancient Fundamentals, he is the oldest and most tireless, endlessly searching out a being he knows only as \"The Light.\" Long ago the Light ventured out from the progenitor realm, in defiance of the first covenant. Now Chaos Knight shifts from plane to plane, always on the hunt to extinguish the Light wherever he finds it. A thousand times he has snuffed out the source, and always he slides into another plane to continue his search anew. Upon his steed Armageddon he rides, wading into battle with maniacal frenzy, drawing strength from the disorder of the universe. A physical manifestation of chaos itself, in times of need he calls upon other versions of himself from other planes, and together these dark horsemen ride into battle, as unstoppable as any force of nature. Only when the last Light of the world is scoured from existence will the search be ended. Where rides the Chaos Knight, death soon follows.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+10% Chaos Strike Chance",
        "talent_left": "+10s Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Phantasm\". Duration"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+0.75 Min\/Max Chaos Bolt Duration",
        "talent_left": "Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Reality Rift\". Pierces Spell Immune"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-3s Chaos Bolt Cooldown",
        "talent_left": "-75% Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Phantasm\". Illusion Damage Taken"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+22% Chaos Strike Lifesteal",
        "talent_left": "+225 Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Reality Rift\". Pull Distance"
      }
    ]
  }
}