{"abilities":[{"effects":["Minimum Damage Threshold: 50","Magical Damage Blocked: 120","Number of Charges: 5"],"notes":["Only triggers on magical damage equal to or greater than 50 (before reductions), not including self-inflicted damage and damage dealt by allies. When triggered, blocks up to 120 magical damage (before reductions). Also ignores every form of damage amplification, including spell damage amplification. Has the highest priority in the group of damage negating spells, blocking damage before any of them do. Has a higher priority than Dispersion and Blade Mail, meaning it first blocks damage before they spread it. Has a lower priority than Mana Shield, meaning Mana Shield first reduces damage before Raindrop blocks it.","When having multiple Infused Raindrops, all of them lose charges simultaneously, but only one of them blocks the damage.","Neither consumes charges nor blocks any damage while on cooldown."],"elements":["Ability Passive","Affects Self"],"description":"Consumes a charge to block 120 magic damage from damage instances over 50 damage. Comes with 5 charges. When the charges are gone, the item disappears."}],"cost":"225","description":"Elemental protection from magical assaults.","further":["Urn_of_Shadows"],"tips":["The item gives the most mana regeneration per gold.","Leaving the item in backpack will not consume a charge, useful for saving it to build Urn of Shadows.","Infused Raindrop absorbs the damage of Eul's Scepter of Divinity's Cyclone, so that the Cyclone cannot disable Blink Dagger, allowing the holder to blink away after Cyclone ends.","Works well against heroes who harass early lanes with magical damage, especially against those with stronger nukes and a high mana cost, like Queen of Pain, Leshrac, Lich, Visage and Lina.","It is also good against lower nukes, like Storm Spirit's spells, Arc Lightning and Arcane Bolt, although these spells are in return able to burn through raindrops faster than the heavy nukes. This also applies to Maelstrom's and its upgrade's Chain Lightning.","Since it ignores damage instances below 50, it is not effective against most damage over time abilities, like the ones from Viper, Warlock, Jakiro and Huskar. Infused Raindrop is also not very effective against damage over time which deals just high enough damage to proc it, as one such spell can proc Raindrop multiple times throughout its duration, wasting charges on rather low damage ticks, as compared to burst damage. Spells like Venomous Gale and Shadow Strike are long lasting damage over time spells which can easily use up 2 charges per cast, with just minimal damage getting blocked.","Shorter effects like Frostbite, or enough stacks of Burning Spear (with just a few stacks) are also able to waste charges, as they deal the minimum required damage to proc it, allowing enemies to throw higher damage nukes while the item is on cooldown.","In the later game, Radiance burns Raindrops' charges away without any effort and with the minimum amount of damage getting blocked, making it very ineffective against Radiance.","The item should not be used in combination with any other form of damage negation, like Aphotic Shield or Refraction, because it stills lose a charge and block the damage before the spell blocks them, basically wasting a charge for damage which would have already been blocked by the spells."],"attrs":["Charges 5","Passive Magical Damage Block","Bonus +0.75 Mana regeneration","Disassemble? No","Alert allies? No"],"info":["Becomes available for purchase at the 3 minute mark. After that, it has a 1 second restock time.","Infused Raindrops do not stack in the inventory. Each bought instance requires its own slot. The mana regeneration from multiple instances fully stacks.","The sell value of the item is based on the number of charges remaining. A single instance has a sell value of 22.5 gold."]}