{"abilities":[{"effects":["Дальность применения: 600","Замедление скорости передвижения: 100%","Длительность оцепенения на не-героях: 3","Длительность замедления: 4"],"notes":["Замедление уменьшается с интервалом в 0,8 секунды, замедляя на 100%\/80%\/60%\/40%\/20% и меняясь каждые 0,8 секунды.","При использовании на юнитов не-героев применяет к ним оцепенение на 3 секунды, предотвращая их передвижение и использование способностей для перемещения. Замедление также применяется к цели, поэтому она остается замедленной на оставшееся после спадения оцепенения время. Не прерывает произносимые способности цели. Не дает эффект True Sight на цель.","Считает древних крипов и крипов-героев за героев."],"elements":["Способность Направленная на юнита","Действует на Врагов"],"description":"Замедляет противника на 4 секунды."},{"effects":["Маны выжигается за удар (Герой): 50","Маны выжигается за удар (Иллюзия ближнего боя): 16","Маны выжигается за удар (Иллюзия дальнего боя): 8","Выжженой маны в урон: 80%"],"notes":["Урон напрямую добавляется к урону от атак по цели.","Владелец предмет может получать лечение от вампиризма, получаемого от урона, наносимого Manabreak, но на него не действует критический или прорубающий удар.","Урон может быть снижен с помощью Enfeeble или Static Link. При этом его нельзя увеличить с помощью Empower или Руна двойного урона.","В среднем усиливает атаки владельца предмета на 40 единиц, если у юнитов достаточно маны для сжигания. В среднем усиливает атаки иллюзий на 12.8\/6.4 (ближний\/дальний бой), если у юнитов достаточно маны для сжигания.","Сначала сжигает ману, затем наносит урон.","Не работает при атаке союзных юнитов.","Сожжение маны от нескольких Diffusal Blades не складывается. Не складывается с Mana Break Anti-Mage, но складывается с другими источниками."],"elements":["Способность Пассивная","Действует на Врагов","Урон Физический"],"description":"Каждая атака сжигает 50 маны врага и наносит ему 0.8 физического урона за единицу сожжённой маны. Иллюзии героев ближнего боя сжигают по 16 маны за атаку, а дальнего боя — 8."}],"cost":"3150","description":"Зачарованный меч, позволяющий разрубить врага и добраться прямо до его души.","further":["Blade_of_Alacrity","Blade_of_Alacrity","Robe_of_the_Magi","Рецепт"],"attrs":["Активируемая Inhibit","Пассивная Manabreak","Бонус +20 к ловкости +10 к интеллекту","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Для героев силы, даёт 3,2 брони, 20 скорости атаки, 1% скорости передвижения, 120 маны, 0,5 регенерации маны и 0,7% урона от способностей.","Для героев ловкости, даёт 3,2 брони, 20 скорости атаки, 1% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона от способностей и 20 урона от атаки.","Для героев интеллекта, даёт 3,2 брони, 20 скорости атаки, 1% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона от способностей и 10 урона от атаки."]}