{"abilities":[{"spell":"Grimstroke paints a path of ink with his brush, damaging and slowing enemies. The damage is increased with each enemy the ink hits.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The ink travels at a speed of 2400.","The ink takes 0.58 seconds to reach max distance and can hit units up to 1560 range away (travel distance + end radius). It takes up to 0.66 seconds and can hit units up to 1735 range away when the general cast range increasing talent is chosen. It takes up to 0.83 seconds and can hit units up to 2160 range away when Stroke of Fate's own range increasing talent is chosen. It takes up to 0.91 seconds and can hit units up to 2335 range away when both talents are chosen.","Only the cast range and distance increase from the level 25 talent is displayed. The level 15 talent can further increase the cast range and distance to 2175. The level 15 talent alone increases the cast range and distance to 1575.","The ink trail starts 120 range towards Grimstroke's left side and travels towards the targeted point. This means the ink's travel direction is not based on the caster's facing direction, but instead on the angle between the aforementioned points.","The increasing damage has no cap and counts any unit hit by the ink.","Plays an initial sound and particles upon start casting, visible and audible to everyone.","The projectile provides ground vision within its effect radius around it as it travels. This vision does not last. Provides 160 radius ground vision at every hit enemy's location and at the end location of the projectile, which lasts for 2 seconds.","Stroke of Fate first applies the damage, then the debuff."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"11\/9\/7\/5","name":"Stroke of Fate","description":["Cast Animation: 0.8+0.53","Cast Range: 1400 ( 2000)","Wave Distance: 1400 ( 2000)","Start Radius: 120","End Radius: 160","Base Damage: 120\/180\/240\/300 ( 180\/270\/360\/450)","Damage Increment per Hit: 16\/24\/32\/40 ( 24\/36\/48\/60)","Movement Speed Slow: 50%\/60%\/70%\/80%","Slow Duration: 1.5"],"hot_key":"Q","legacy_key":"F"},{"spell":"Summons a phantom that moves quickly towards the target, latching to it when she arrives. Once latched, the phantom damages and silences. If she survives the full latch duration she rends her victim for heavy damage and refreshes Phantom's Embrace's cooldown. Hero attacks against the phantom count as 3 attacks each.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The phantom travels at a speed of 750.","The phantom is attackable as soon as it is launched, so it can be killed before it reaches its target.","Phantoms have the highest priority for auto-attack behaviors, together with The Swarm beetles.","The phantom latches onto the target when it comes within 130 range of it. Once latched, it always stays 130 range in front of the target.","The phantom instantly dies when its target turns invisible or spell immune, including while the phantom is still traveling towards it. A latched phantom also instantly dies when its target turns invulnerable or hidden, but not while traveling.","When the phantom enters a Chronosphere while traveling, it freezes and continues traveling once the Chronosphere ends. When the phantom enters a Chronosphere while already latched on the target, it immediately starts returning to the caster as if it expired.","The phantom returns to Grimstroke upon expiring, or when its target dies. It does not return when it gets killed.","While attached, the phantom silences its target and deals damage to it. Deals 3\/7\/11\/15 damage in 0.5-second intervals starting immediately upon reaching the target, resulting in 10 instances. Can deal up to 110\/240\/370\/500 damage to each latched enemy, including the final rend damage (before reductions).","The phantom provides shared vision over the target while flying towards it, and while latched. The vision instantly stops once letting go of the target. The phantom itself has a small vision range as well, which it provides while traveling to the target and while latched. However, this vision is not applied while the phantom travels back to the caster.","The phantom cannot be interacted with while it returns to the caster.","Successive casts on the target fully stack, although all casts share one debuff. The damage per second is increased for each stack. All casts share the same damage interval and are summed up into one instance per interval.","When used in combination with Soulbind, only the phantom launched on the primary target can refresh Phantom's Embrace's cooldown."],"mana":"110\/120\/130\/140","elements":["Cannot be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"32\/28\/24\/20","name":"Phantom's Embrace","description":["Cast Animation: 0+0","Cast Range: 900 ( 1075)","Hero Attacks to Destroy: 2\/2\/3\/3 ( 3\/3\/4\/4)","Non-Hero Attacks to Destroy: 6\/6\/9\/9 ( 9\/9\/12\/12)","Damage per Second: 6\/14\/22\/30","Rend Damage: 80\/170\/260\/350","Latch Duration: 5"],"hot_key":"W","legacy_key":"E"},{"spell":"Grimstroke shrouds an allied unit in ink, increasing its movement speed. Enemies in range of the allied unit are damaged with inky tendrils over time. After 3 seconds it triggers, applying damage and stun in an area around the unit in proportion to how long ink tendril was near any hero.","effects":["Ability Target Unit","Affects Allies \/ Enemies","Damage Magical"],"notes":["Deals 5\/7\/9\/11 damage in 0.2 second intervals, starting immediately as the buff is placed, resulting in up to 15 instances.","The tendrils can deal up to 75\/105\/135\/165 damage to a single unit (before reductions).","The damage and stun upon losing the buff is based on the amount of damage instances the tendrils applied to a single enemy hero. This means to reach the maximum damage and stun, at least one enemy hero must be damaged throughout the whole duration of Ink Swell. Only counts damage dealt to real heroes, which excludes illusions and creep-heroes, but includes clones. The actual amount of damage dealt does not matter, only the amount of damage instances applied. The stun duration increases by 0.07\/0.13\/0.19\/0.25 seconds, and the damage by 6.67\/13.33\/20\/26.67 for each instance applied, reaching the maximum after 15 instances.","When the debuff is lost prematurely, it still applies the area expire damage and stun, based on the damage instances it dealt up to that point. However, if the ink swelled unit dies, the area expire damage and stun will not apply.","The expire damage and stun only apply when there is at least one enemy hero within the area.","Recasting Ink Swell on the same target refreshes the duration, without resetting the damage instance counter.","Has a longer cast backswing when cast on self, due to a different animation.","Ink Swell first applies the damage, then the debuff."],"mana":"120\/130\/140\/150","elements":["Partially pierces spell immunity."],"cooldown":"30\/25\/20\/15","name":"Ink Swell","description":["Cast Animation: 0.15+0.73\/0.86","Cast Range: 400\/525\/650\/775 ( 575\/700\/825\/950)","Radius: 400 ( 600)","Movement Speed Bonus: 12%\/14%\/16%\/18%","Tendrils Damage per Second: 25\/35\/45\/55","Expire Max Damage: 100\/200\/300\/400 ( 200\/300\/400\/500)","Max Stun Duration: 1\/1.9\/2.8\/3.7","Buff Duration: 3"],"hot_key":"E","legacy_key":"W"},{"spell":"Binds a targeted enemy hero to its nearest allied hero within the bind radius, preventing both from moving away from each other. Any unit-targeted ability that either bound hero receives also gets cast on the other hero. If the bind is broken before the duration expires, the initial target will be bound to its nearest allied hero in the radius.","effects":["Ability Target Unit","Affects Enemy Heroes"],"notes":["The targeting reticule must be centered over an enemy unit.","Only binds the primary target to heroes (excluding illusions, including clones) or creep-heroes. The primary target can be an illusion though.","Does not bind to nearby invisible or invulnerable heroes.","The more the chain gets stretched, the slower the affected heroes can walk away from the each other, eventually coming to a full stop. It directly affects their movement speed. The chain is considered fully stretched at 550 range, but can be stretched up to 700 range before it breaks. In order to stretch it further than 550, forced movement or teleportation must be used. The following spells are not able to break the chain: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, Force Staff and Hurricane Pike. However, Force Staff and Hurricane Pike (targeting an ally) can break the chain if the target hasn't moved after being bound. Every other source of forced movement, including spells like Primal Roar and Blinding Light, can break the leash.","Leashes the target and the ally it is bound to, preventing them from casting certain mobility spells. Does not leash the target if it is not bound to an ally.","If the enemies manage to break the link, the debuff stays active on the primary target still, and immediately links the next enemy hero within the radius to them.","While linked, every single-target spell cast on one of the hero is also cast on the linked hero, following the same rules as Spell Block, with some exceptions. Spells that do not work: Omnislash, Static Link, Charge of Darkness, Nether Strike, Focus Fire, Soul Assumption, Snowball. The spell cast on the linked hero is sourced to the original spell caster, so that its stats and items are applied to the spell as well.","Provides shared vision over both targets, revealing their silhouette when invisible, and seeing what they see.","A hero may be affected by only one bond at a time. Recasting Soulbind on the same target, or on the secondary target refreshes the duration on both of them. Casting Soulbind on a third target within range of the already linked two does not link the third hero to any of the other two, until their link expires.","For a list of unique interactions with other abilities, see Grimstroke's guide page."],"mana":"150\/200\/250","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"100\/75\/50","name":"Soulbind","description":["Cast Animation: 0.15+0.5","Cast Range: 700\/800\/900 ( 875\/975\/1075)","Latch Radius: 550","Break Distance: 700","Duration: 6\/7\/8"],"hot_key":"R","legacy_key":"B"},{"spell":"Creates an ink illusion of a target enemy hero. Illusion is spell immune, and has bonus movement speed and attack damage.","effects":["Ability Target Unit","Affects Enemy Heroes"],"notes":["Requires Aghanim's Scepter to be unlocked.","The created illusions are visually distinguishable from the real hero for allies and enemies.","The illusion spawns 108 range away from the target. It appears either north, east, south or west from them."],"mana":"200","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"35","name":"Dark Portrait","description":["Cast Animation: 0+0.54","Cast Range: 1200","Number of Illusions: 1","Illusion Damage Dealt: 150%","Illusion Damage Taken: 350%","Illusion Movement Speed Bonus: 30%","Illusion Duration: 15"],"hot_key":"D","legacy_key":"D"}],"bio":"Graceful, sophisticated, cunning and cruel, Grimstroke channels vile forces through the profane ink of his runebinding brush. Groomed from a young age to become a guardian of his people, Grimstroke's path to power was instead built upon a sacrifice he was all too willing to make: the lives of his entire race. Consumed by the very magic that was meant to protect them, Grimstroke's kindred now exist only as inky revenants, bound forever to his brush—their anguished screams and viscous forms apparent in the strokes of each dark mural he creates. The people of Ashkavor crowded around the temple square, eager to witness the ascension of their new guardian -- to stand near the man as he bound their souls to his own. But as his final brush strikes fell against the runestone, and the bond of a new Ascended One was forged, everyone -- even those who'd stayed in their homes -- could sense that something had gone terribly wrong. He knew the cause instantly. The droplets of ichor he'd procured to amplify the potency of his inkpots had instead contaminated them, and the power of the binding spell he'd cast now threatened to consume him. An inky corruption snaked upward from the runestone, along the handle of his brush, soon overtaking his hands. From there it spread quickly. Once it overcame his face and his mouth, he couldn't have screamed even if he'd wanted to. All of his life he'd calculated on how to attain ever greater powers than the limits presented by his teachers would allow--going on far as to break the sacred prohibition against augmenting the inks. Indeed, with the wellspring of the Ascended bond open to him, he felt a measure of power coursing into his soul like he'd never imagined. His greatest triumph was upon him, if he could only survive it. He drew deep from the power of the bond, pushing back against the corrupted ink flow. A great moan filled the air -- the collective cry of his people. Some swayed on their feet. The weakest collapsed. Many tried to run. And still deeper he pulled from their bloodline reservoir. But it wasn't enough to stop the ink tide. It was only when the breath trapped in his lungs began to fail him, and the inkpool darkness fully encased him, that he saw his way out. The bond he'd made with the Ashkavoran people -- his people -- meant to be drawn upon only in service of their protection... it flowed two ways. With the final surge of strength -- this time directed by more than just blind repulsion -- he pushed the ink torrent into the bond itself. Slowly, he felt the tide retreat.. and heard the awful wails of his people as the corruption in turn rolled over them. When at last the ink relented, his eyes opened upon a world changed. The Ashkavoran people as he knew them were gone. Every last soul was transformed into terrifying shades of their former selves -- comprised no longer of blood and bone, only viscid, tainted ink.","trivia":["Grimstroke's abilities have different names in the game files: Stroke of Fate: Dark Artistry Phantom's Embrace: Ink Creature Ink Swell: Spirit Walk Soulbind: Soul Chain","The line \"More art than science.\" is a reference to the cartoon Rick and Morty.","The line \"At least you died with a smile on your face.\" is a reference to album of the label \"Bella Union\".","The line \"Welcome to the real void.\" perhaps a reference to the film \"Matrix\" - \"Welcome to the real world\".","Grimstroke after killing Lich he says \"Another self-styled king meets his end.\" perhaps a reference to the Lich-King in fantasy world \"Warcraft\".","The line \"Brush beats scythe.\" is a reference to game \"Rock, paper, scissors\"."],"talents":["+50% Stroke of Fate Damage:+200 Ink Swell Radius","+3 Hits to Kill Phantom:+600 Stroke of Fate Cast Range","+175 Cast Range:+15% Spell Amplification","+100 Ink Swell Max Damage:+30 Movement Speed"],"desc":"Grimstroke is a ranged intelligence hero specializing as a nuker and offensive support. With an arsenal of punitive and disabling spells, he forces enemies to rethink their actions, or retreat from his overbearing attacks. His long cast range also allows him to harass and zone out opponents while delivering substantial damage from the back line."}