{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Templar_Assassin_Refraction_1.mp3\/revision\/latest?cb=20191216025003",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "notes": [
        "При использовании Refraction прерывает произносимые способности Templar Assassin.",
        "Применяет 2 баффа к Templar Assassin: один бафф дает заряды для дополнительного урона, другой - заряды для блокировки урона.",
        "Число оставшихся зарядов видно в иконке баффа. Баффы и визуальные эффекты от способности видны всем.",
        "Дополнительный урон добавляется как обычный дополнительный урон и виден в интерфейсе. Потеря заряда дополнительного урона происходит при успешном попадании снаряда атаки в цель. Атака, которая промахнулась или которую избежали, не учитывается. Не теряет заряды и не применяет дополнительный урон при атаке союзников. При использовании Refraction во время полета снаряда атаки дополнительный урон к нему не применяется, но при этом один заряд при попадании будет потрачен.",
        "Потеря заряда дополнительного урона происходит при успешном попадании снаряда атаки в цель. Атака, которая промахнулась или которую избежали, не учитывается.",
        "Не теряет заряды и не применяет дополнительный урон при атаке союзников.",
        "При использовании Refraction во время полета снаряда атаки дополнительный урон к нему не применяется, но при этом один заряд при попадании будет потрачен.",
        "Поглощение урона отрицает урон, то есть отдельные эффекты, реагирующие на урон, не будут срабатывать. У способности приоритет выше, чем у Aphotic Shield и Living Armor, но ниже, чем у False Promise. При этом способность продолжит терять заряды при использовании с False Promise. Урон ниже 5 (после уменьшений) игнорируется способностью. Он не блокируется, но и не тратит заряды для блокировки. Refraction отрицает все 3 типа урона. Способность не отрицает урон, отмеченный как отнимающий здоровье.",
        "У способности приоритет выше, чем у Aphotic Shield и Living Armor, но ниже, чем у False Promise. При этом способность продолжит терять заряды при использовании с False Promise.",
        "Урон ниже 5 (после уменьшений) игнорируется способностью. Он не блокируется, но и не тратит заряды для блокировки.",
        "Refraction отрицает все 3 типа урона. Способность не отрицает урон, отмеченный как отнимающий здоровье.",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Выбор дающего возможность применить Refraction в оглушении таланта позволяет применять эту способность в оглушении, урагане, сне, провокации, исчезновении или во время принудительного движения. Нельзя применять во время безмолвия, проклятия или отключении приказов. Templar Assassin не может поставить эту способность в ⇧ Shift-очередь при получении таланта.",
        "Нельзя применять во время безмолвия, проклятия или отключении приказов.",
        "Templar Assassin не может поставить эту способность в ⇧ Shift-очередь при получении таланта."
      ],
      "mana": "17",
      "item_behaviour": [],
      "name": "Refraction",
      "cooldown": "85\/90\/95\/100",
      "description": "Герой становятся неуловимым, избегая любого урона и нанося больше урона атаками. Эти эффекты действуют ограниченное число раз и считаются раздельно.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Число эффектов: 3\/4\/5\/6 ( 10\/11\/12\/13)",
        "Дополнительный урон: 25\/45\/65\/85 ( 50\/70\/90\/110)",
        "Длительность: 17"
      ],
      "legacy_key": "R",
      "story": "Используя свою псионическую вуаль, Ланайя подчиняет законы природы своей воле."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Templar_Assassin_Meld_1.mp3\/revision\/latest?cb=20191216025015",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Физический"
      ],
      "notes": [
        "При использовании Meld прерывает произносимые способности Templar Assassin.",
        "Мгновенно применяет к Templar Assassin невидимость, сквозное передвижение и отдает герою приказ \"стоп\".",
        "Templar Assassin может поворачиваться, поднимать, выкидывать или атаковать предметы без выхода из невидимости, учитывая то, что она не может двигаться во время действий. Невидимость теряется при завершении анимации применения заклинаний или предметов, при попадании атаки или при перемещении. Принудительное движение также учитывается и отменяет Meld при горизонтальном перемещении. Вертикальное перемещение и эффекты телепортации не отменяют способность. После запуска снаряда атаки Templar Assassin может выполнить любое действие без потери невидимости. Но если снаряд промахнулся (уклонение, ослепление или избегание), невидимость теряется в момент промаха.",
        "Невидимость теряется при завершении анимации применения заклинаний или предметов, при попадании атаки или при перемещении.",
        "Принудительное движение также учитывается и отменяет Meld при горизонтальном перемещении. Вертикальное перемещение и эффекты телепортации не отменяют способность.",
        "После запуска снаряда атаки Templar Assassin может выполнить любое действие без потери невидимости.",
        "Но если снаряд промахнулся (уклонение, ослепление или избегание), невидимость теряется в момент промаха.",
        "Следующая атака Templar Assassin, направленная на существо, нанесет дополнительный урон, применит дебаффы от Meld. Meld сначала применяет дебафф снижения брони, затем урон от атаки героя, затем урон от способности, затем оглушающий удар. Талант, дающий оглушающий удар при выходе из Meld, сочетается с другими источниками оглушающего удара.",
        "Meld сначала применяет дебафф снижения брони, затем урон от атаки героя, затем урон от способности, затем оглушающий удар.",
        "Талант, дающий оглушающий удар при выходе из Meld, сочетается с другими источниками оглушающего удара.",
        "Дополнительный урон наносится отдельным источником и считается за урон от атаки. Поскольку он наносится отдельно, то не активирует критический удар, вампиризм или Psi Blades.",
        "Поскольку он наносится отдельно, то не активирует критический удар, вампиризм или Psi Blades.",
        "Ни дополнительный урон, ни снижение брони от Meld не действуют на постройки.",
        "Дебафф снижения брони от нескольких применений складывается.",
        "При выборе таланта «Meld развеивает отрицательные эффекты» способность при использовании применяет к Templar Assassin базовое развеивание."
      ],
      "mana": "11\/19\/7\/5",
      "item_behaviour": [],
      "name": "Meld",
      "cooldown": "35\/40\/45\/50",
      "description": "Герой становится невидимым до тех пор, пока не сдвинется с места. Если прервать невидимость атакой по врагу, она нанесёт дополнительный урон и на 12 сек. уменьшит броню жертвы.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0,53",
        "Время до невидимости: 0",
        "Урон: 80\/120\/160\/200",
        "Снижение брони: 5\/6\/7\/8 ( 8\/9\/10\/11)",
        "Длительность дебаффа: 12",
        "Длительность невидимости: Бесконечная",
        "Длительность оглушения: 1"
      ],
      "legacy_key": "D",
      "story": "Ланайя так же уклончива, как и её договор с Сокрытым храмом."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Templar_Assassin_Psi_Blades.mp3\/revision\/latest?cb=20191216025000",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "notes": [
        "Psi Blades увеличивают общую дальность атаки Templar Assassin до 240\/290\/340\/390 (TagTalent 350\/400\/450\/500) единиц.",
        "Область поражения представляет собой прямоугольник шириной в 90 и длиной 550\/600\/650\/700 (TagTalent 670\/720\/770\/820) С базовой дальностью атаки и дополнительной от Psi Blade длина области составляет 790\/890\/990\/1090 (TagTalent 1020\/1120\/1220\/1320). Длина пробития больше не увеличивается от бонусами к дальности атаки.",
        "С базовой дальностью атаки и дополнительной от Psi Blade длина области составляет 790\/890\/990\/1090 (TagTalent 1020\/1120\/1220\/1320).",
        "Длина пробития больше не увеличивается от бонусами к дальности атаки.",
        "Пробивающий урон считается уроном от заклинаний, но он игнорирует усиление урона заклинаний и не может лечить владельца при помощи вампиризма заклинаний. Урон по вторичной цели может быть увеличен манипуляцией входящим уроном. Пробивающий урон равен урону, которая получила первичная цель. То есть пробивающий урон может быть увеличен с помощью снижения брони основной цели. Также пробивающий урон увеличивается с увеличением урона Templar Assassin от модификаторов атаки (например, критического или оглушающего удара). Однако это не работает вместо с уроном от срабатывания Javelin и Monkey King Bar. Модификаторы атаки применяются только к основной цели.",
        "Урон по вторичной цели может быть увеличен манипуляцией входящим уроном.",
        "Пробивающий урон равен урону, которая получила первичная цель.",
        "То есть пробивающий урон может быть увеличен с помощью снижения брони основной цели.",
        "Также пробивающий урон увеличивается с увеличением урона Templar Assassin от модификаторов атаки (например, критического или оглушающего удара). Однако это не работает вместо с уроном от срабатывания Javelin и Monkey King Bar.",
        "Модификаторы атаки применяются только к основной цели.",
        "Теряет 5% урона от изначального значения, а не от урона, нанесённого предыдущей цели. Это значит, что Psi Blades будет наносить 0% после 20 цели. Однако атака всё равно будет действовать на все цели в радиусе действия, нанося им по 0 урона.",
        "Это значит, что Psi Blades будет наносить 0% после 20 цели.",
        "Однако атака всё равно будет действовать на все цели в радиусе действия, нанося им по 0 урона.",
        "Позиция Templar Assassin проверяется при попадании снаряда в цель, а не при запуске.",
        "Psi Blades применяет пробивающий урон при атаке союзников или вардов, использующих здоровье (например Чумной тотем). Пробивающий урон может задеть курьера и невидимых существ. Не срабатывает при атаке вардов, убиваемых за определенное число ударов. Вопреки визуальным эффектам, Psi Blades не наносит пробивающий урон при атаке строений.",
        "Пробивающий урон может задеть курьера и невидимых существ.",
        "Не срабатывает при атаке вардов, убиваемых за определенное число ударов.",
        "Вопреки визуальным эффектам, Psi Blades не наносит пробивающий урон при атаке строений."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Psi Blades",
      "cooldown": null,
      "description": "Псионические клинки героя насквозь пробивают цель атаки, нанося полный урон тем, кто стоит позади неё. Также способность увеличивает дальность атаки героя.",
      "hot_key": "E",
      "params": [
        "Доп. дальность атаки: 80\/130\/180\/230 ( 190\/240\/290\/340)",
        "Ширина пробивающего урона: 90",
        "Бонус дальности пробития: 550\/600\/650\/700 ( 670\/720\/770\/820)",
        "Урон от пробития: 100%",
        "Уменьш. урона за цель: 5%"
      ],
      "legacy_key": "B",
      "story": "Ее кинжалы пронзают как плоть, так и разум, расширяя ее понимание таинства реальности."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Templar_Assassin_Trap.mp3\/revision\/latest?cb=20191216025009",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Trap разблокируется при изучении Psionic Trap.",
        "При использовании не прерывает произносимые способности Templar Assassin.",
        "Нельзя использовать без установленных ловушек (выдает ошибку \"Вы не установили ловушки\").",
        "Замедление начинается со значения в 30% и увеличивается на 0,29% с интервалом в тик сервера, достигая максимального значения за 3,5 сек. С Aghanim's Shard длительность безмолвия начинается со значения в 1,5 и увеличивается на 0,01 с тем же интервалом.",
        "С Aghanim's Shard длительность безмолвия начинается со значения в 1,5 и увеличивается на 0,01 с тем же интервалом.",
        "С каждой секундой после размещения значение замедления и длительности безмолвия составляют: 0 сек.: 30% замедления, 1,5 сек. безмолвия. 1 сек.: 38,571428571429% замедления, 2,0714285714286 сек. безмолвия. 2 сек.: 47,142857142857% замедления, 2,6428571428571 сек. безмолвия. 3 сек.: 55,714285714286% замедления, 3,2142857142857 сек. безмолвия.",
        "0 сек.: 30% замедления, 1,5 сек. безмолвия.",
        "1 сек.: 38,571428571429% замедления, 2,0714285714286 сек. безмолвия.",
        "2 сек.: 47,142857142857% замедления, 2,6428571428571 сек. безмолвия.",
        "3 сек.: 55,714285714286% замедления, 3,2142857142857 сек. безмолвия.",
        "",
        "Урон наносится только при полностью заряженной ловушке При полном заряде ловушка визуально меняется. При установке внешнее кольцо черное и при накоплении заряда становится белым. Значение урона всегда учитывает текущий уровня способности и выбор талантов при срабатывании, а не фиксируется при её создании. Источником урона является заклинатель, а не ловушка.",
        "При полном заряде ловушка визуально меняется. При установке внешнее кольцо черное и при накоплении заряда становится белым.",
        "Значение урона всегда учитывает текущий уровня способности и выбор талантов при срабатывании, а не фиксируется при её создании.",
        "Источником урона является заклинатель, а не ловушка.",
        "Наносит до 50\/60\/70 (TagTalent 72\/82\/92) урона с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 5 раз.",
        "Несколько дебаффов не складываются, но обновляют длительность. При обновлении значения замедление и урон учитывают длительность заряда ловушки.",
        "При обновлении значения замедление и урон учитывают длительность заряда ловушки."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Trap",
      "cooldown": null,
      "description": "Приводит в действие ближайшую ловушку, замедляя врагов в зоне ее действия.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Радиус поиска ловушки: Глобальный",
        "Радиус замедления: 400",
        "Общий урон: 250\/300\/350 ( 360\/410\/460)",
        "Мин. замедление скорости передвижения: 30%",
        "Макс. замедление скорости передвижения: 60%",
        "Время накопление заряда: 3,5",
        "Длительность замедления: 5",
        "Мин. длительность безмолвия: 1,5",
        "Макс. длительность безмолвия: 3,5"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a5\/Templar_Assassin_Psionic_Projection.mp3\/revision\/latest?cb=20191216025000",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "Телепортирует к ближайшей от выбранной точки ловушке. После телепортации ловушка взрывается. Действуют те же примечания, что и для Trap.",
        "Действуют те же примечания, что и для Trap.",
        "Применение без установленных ловушек ничего не активирует, лишь расходует ману и запускает перезарядку."
      ],
      "mana": "10",
      "item_behaviour": [],
      "name": "Psionic Projection",
      "cooldown": "50",
      "description": "После небольшой подготовки телепортирует героя к любой ловушке от Psionic Trap, приводя её в действие по прибытии. Не раскрывает невидимость от способности Meld.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: Глобальная",
        "Радиус замедления: 400",
        "Время применения: 1",
        "Урон в секунду: 250\/300\/350 ( 360\/410\/460)",
        "Мин. замедление скорости передвижения: 30%",
        "Мин. замедление скорости передвижения: 60%",
        "Время накопление заряда: 3,5",
        "Длительность замедления: 5",
        "Мин. длительность безмолвия: 1,5",
        "Макс. длительность безмолвия: 3,5"
      ],
      "legacy_key": "N",
      "story": "В награду за свои услуги Ланайя получила доступ к секретам, которые открывают новые грани её псионического таланта."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Templar_Assassin_Psionic_Trap.mp3\/revision\/latest?cb=20191216025002",
      "effects": [
        "Способность: Направленная на точку"
      ],
      "notes": [
        "Ловушки замедляют врагов только при активации способностями Trap, Psionic Projection или использования способности самой Пси-ловушки, а не из-за разрушения с помощью атак или превышения максимального числа ловушек.",
        "Пси-ловушка не блокирует лагеря нейтральных крипов."
      ],
      "mana": "11\/8\/5",
      "item_behaviour": [],
      "name": "Psionic Trap",
      "cooldown": "15",
      "description": "Герой ставит невидимую ловушку, которая отслеживает передвижение врагов и постепенно накапливает энергию. По команде ловушка срабатывает, замедляя противников в зоне действия как минимум на 30%. Через 3,5 сек. ловушка наберёт максимальную мощь, и её активация замедлит жертв на 60% и нанесёт им урон.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 1800",
        "Максимально ловушек: 5\/8\/11 ( 9\/12\/15)",
        "Время до невидимости ловушек: 2",
        "Длительность ловушек: Бесконечно"
      ],
      "legacy_key": "C",
      "story": "Сокрытый храм не даст никому скрыться от ока его стража."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/eb\/Templar_Assassin_Self_Trap.mp3\/revision\/latest?cb=20191216025007",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Это способность самой ловушки, позволяющая Templar Assassin взрывать ближайшие ловушки без активации первой установленной.",
        "На способность распространяются те же примечания, что и для Trap."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Trap",
      "cooldown": null,
      "description": "Приводит в действие ближайшую ловушку, замедляя врагов в зоне ее действия.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус замедления: 400",
        "Всего урона: 250\/300\/350 ( 360\/410\/460)",
        "Мин. замедление скорости передвижения: 30%",
        "Макс. замедление скорости передвижения: 60%",
        "Время накопление заряда: 3,5",
        "Длительность замедления: 5",
        "Мин. длительность безмолвия: 1,5",
        "Макс. длительность безмолвия: 3,5"
      ],
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 21.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.2,
    "attrAgility": 23.0
  },
  "description": "Замедляет врагов своими ловушками Templar Assassin заполняет поле боя замедляющими ловушками и прячется в невидимости, готовясь в любой момент наброситься на жертву. Напав, она пробивает врагов насквозь своими псионическими клинками и отражает ответные удары преломляющим щитом.  Керри Побег ★★☆",
  "history": "Ланайя нашла своё призвание на пути любопытства и познания. Эта обладательница проницательного ума потратила юные годы на тщательное изучение законов природы. Она зачитывалась гримуарами по магии и алхимии, проводила эксперименты, описанные на обугленных страницах Фиолетовых архивов, запоминала наблюдения учёных смышленого народца. Тихая и скрытная от природы, она всё больше развивала эти свои навыки, ведь новые знания находились всё труднее. Будь она чуть менее скромной, и гильдии знали бы её как вора-ученого. Но исследования заводили её во всё более дальние и тёмные места. Надеясь разгадать тайны вселенной, она смогла открыть скрытую дверь самого мироздания: вход в самый тайный из храмов. Сущности по ту сторону портала, казалось, ждали её. Тайны, что они открыли Ланайе, были просто ничем по сравнению с ответами, которые они дали ей в обмен на служение. Ланайя поклялась охранять секреты, но, что важнее, теперь она могла утолять свою нестерпимую жажду знаний. И тухнущие взгляды повергнутых врагов тоже понемногу открывают ей тайны мироздания."
}