{"abilities":[{"spell":"Ненадолго изгоняет цель из этого мира. После возвращения создаются две иллюзии изгнанного героя, переходящие под ваш контроль.","effects":["Способность Направленная на юнита","Действует на Вражеских героев \/ Союзных героев"],"notes":["Disruption полностью обезвреживает цель и делает её неуязвимой и прячет на всю длительность изгнания.","Когда цель становится невидимой в момент изгнания Disruption, визуальные эффекты также становятся невидимыми.","Всегда создает иллюзии, даже если применяется на владельца способности или его союзников.","Позиция выбранного юнита не перемешивается с позициями иллюзий. Юнит всегда размещается между 2 иллюзиями. Иллюзии появляются в 108 единицах от героя, если его размер столкновения равен 24, и в 72, если размер столкновения равен 8. Каждая иллюзия появляется с одной из четырех сторон от героя и она смотрит в ту же сторону, что и он сам.","Иллюзии носят имя использовавшего способность, а не имя игрока, под чьи контролем находится выбранный юнит, что расскрывает то, что они - иллюзии (если только способность не была применена на себя).","Текущее здоровье иллюзий определяется при применении Disruption. То есть любое снижение здоровья от заклинаний Shadow Demon, произошедшее во время изгнания, не отразится на здоровье появившихся иллюзий.","Можно применять к иллюзиям, создавая новые иллюзии того же героя.","Если выбранный юнит умирает во время Disruption, иллюзии не создаются.","Вы можете отключить помощь, чтобы союзный Shadow Demon не мог использовать эту способность на вас."],"mana":"120","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"27\/24\/21\/18 ( 0)","name":"Disruption","description":["Анимация применения: 0,3+0,6","Дальность применения: 600","Количество иллюзий: 2","Иллюзии наносят урона: 30%\/45%\/60%\/75%","Иллюзии получают урона: 300%","Длительность иллюзии: 8\/10\/12\/14","Длительность изгнания: 2,75","Количество зарядов: 0 ( 2)","Время восстановления заряда: 0 ( 27\/24\/21\/18)"],"hot_key":"Q","legacy_key":"D"},{"spell":"Захватывает души врагов в выбранной области, нанося им урон в размере доли от текущего здоровья. Когда эффект заканчивается, жертвы получают обратно половину потерянного здоровья. Действует и на существ, находящихся под эффектом способности Disruption.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Непосредственно манипулирует здоровьем врагов. Способность не наносит урон. То есть способность не учитывается никаким эффектом, манипулирующим уроном.","Количество возвращаемого здоровья зависит от того, сколько здоровья было отнято изначально, а не на текущем количестве.","Не действует на неуязвимых врагов и древних крипов.","При выборе таланта на 10-ом уровне способность создает иллюзию вражеских героев, если они умирают под действием дебаффа. У иллюзий нет установленной длительности. Они исчезают при возрождении героев или когда их убивают. Иллюзии не создаются, если у врагов есть возможность перерождения."],"mana":"80\/100\/120\/140","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"26\/24\/22\/20 ( 20\/18\/16\/14)","name":"Soul Catcher","description":["Анимация применения: 0,3+0","Дальность применения: 700","Радиус: 175\/200\/225\/250","Потеря текущего здоровья: 25%\/30%\/35%\/40%","Иллюзия наносит урона: 0% ( 30%\/45%\/60%\/75%)","Иллюзия получает урона: 0% ( 200%)","Длительность: 10"],"hot_key":"W","legacy_key":"C"},{"spell":"Запускает в выбранном направлении облако, наносящее урон и отравляющее противников. Первые пять попаданий по одной и той же цели увеличивают базовый урон от яда в 1\/2\/4\/8\/16 раз, а за последующие добавляется по 50 урона. Накопленный урон наносится по окончании действия эффекта или при применении дополнительной способности Release Poison.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Shadow Poison движется со скоростью в 1000 единиц и всегда проходит полную дистанцию за 1.5 секунды.","Может поражать юнитов на расстоянии до 1700 единиц (складывается из дистации прохождения и радиуса).","Действует на невидимых юнитов и на юнитов, находящихся под эффектом Disruption, использованного Shadow Demon.","Полностью игнорирует неуязвимых или спрятанных юнитов.","Мгновенно наносит базовый урон и добавляет 1 заряд всем вражеским юнитам в радиусе 200 единиц при каждом использовании.","Яд сначала применяет дебафф или добавляет заряд, а затем наносит базовый урон.","Несколько использований на одного и того же юнита обновляет длительность всех зарядов.","Первые 5 зарядов умножают урон за заряд на 1\/2\/4\/8\/16 в зависимости от их количества.","Каждый следующий заряд добавляет дополнительно по 50 ( 50.125) единиц урона, поэтому урон начинает линейно расти после 5-го заряда.","Здесь указано, сколько урона могут нанести 1\/2\/3\/4\/5\/6 зарядов на каждом уровне (не принимая во внимание базовый урон): 1-й уровень: 20\/40\/80\/160\/320\/370 ( 20.05\/40.1\/80.2\/160.4\/320.8\/370.925) единиц урона 2-й уровень: 35\/70\/140\/280\/560\/610 ( 35.0875\/70.175\/140.35\/280.7\/561.4\/611.525) единиц урона 3-й уровень: 50\/100\/200\/400\/800\/850 ( 50.125\/100.25\/200.5\/401\/802\/852.125) единиц урона 4-й уровень: 65\/130\/260\/520\/1040\/1090 ( 65.1625\/130.325\/260.65\/521.3\/1042.6\/1092.725) единиц урона","Урон наносится в момент исчезновения (неважно, каким способом) дебаффа \"Shadow Poison\".","Текущее число зарядов видно Shadow Demon и его союзникам над задетыми юнитами. Враги их не видят. Это число визуально ограничено 19, хоть у самого яда нет лимита по зарядам. Текущее количество зарядов также отображается в иконке дебаффа, которая видна всем.","Снаряд при движении дает летающий обзор в радиусе 200 единиц."],"mana":"35\/40\/45\/50","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"2.5 ( 1)","name":"Shadow Poison","description":["Анимация применения: 0,25+0","Дальность применения: 1500","Дистанция прохождения: 1500","Радиус: 200","Базовый урон: 26\/34\/42\/50 ( 26.065\/34.085\/42.105\/50.125)","Урон за заряд: 20\/35\/50\/65 ( 20.05\/35.0875\/50.125\/65.1625)","Длительность заряда: 10"],"hot_key":"E","legacy_key":"W"},{"spell":"Выпускает яд, нанося урон всем зараженным врагам. Юниты, изгнанные Disruption, могут получать урон от Shadow Poison.","effects":["Способность Ненаправленная"],"notes":["Shadow Poison Release разблокируется после изучения Shadow Poison и всегда остается активной."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"1","name":"Shadow Poison Release","description":["Анимация применения: 0,3+0"],"hot_key":"D","legacy_key":"E"},{"spell":"Очищает цель, снимая с нее все положительные эффекты и замедляя на время действия заклинания. Скорость передвижения цели постепенно возрастает, полностью восстанавливаясь к окончанию заклинания. По окончании действия цель получает урон. Эффект заклинания сработает на врагов, изгнанных способностью Disruption.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Применяет к цели базовое развеивание, которое действует всю длительность способности. Урон наносится в конце действия.","Можно использовать на неуязвимых юнитов, применяя развеивание при использовании и дебафф, если неуязвимость можно развеять. В случае, если неуязвимость развеять нельзя, применяется только развеивание.","Дебаффы от нескольких применений работают отдельно друг от друга.","Действует на юнита, находящегося под эффектом Disruption, использованного Shadow Demon.","Замедление начинается с 100%, постепенно снижаясь до 20%. Затронутые юниты восстанавливают 0.381% от своей скорости передвижения с каждым обновлением сервера. То есть юниты возвращают 11.43% от своей скорости передвижения в секунду.","При улучшение Aghanim's Scepter применяет к цели истощение, отключая её пассивные способности."],"mana":"200","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60 ( 0)","name":"Demonic Purge","description":["Анимация применения: 0,3+0,6","Дальность применения: 800","Урон: 200\/300\/400 ( 700\/800\/900)","Макс. замедление скорости передвижения: 100%","Мин. замедление скорости передвижения: 20%","Длительность замедления: 7","Количество зарядов: 0 ( 3)","Время восстановления заряда: 0 ( 60)"],"hot_key":"R","legacy_key":"G"}],"bio":"Одни из верховных демонов с полным доступом к материальному миру, Doom занимается сугубо делами неинфернальных и низших спектральных сущностей, а Shadow Fiend путешествует исключительно с собирательскими экспедициями. Но вот демон тени Shadow Demon, наоборот, всегда уделял толику внимания и интереса к вещественному миру, будто чувствуя, что завладев этим хрупким перекрестком меж миров, он может заполучить ключ к власти и над остальными реальностями. Поначалу его призывали низшие колдуны, желания которых Shadow Demon исправно исполнял и регулярно демонстрировал собственную мощь маленькими порциями, постепенно увеличивая масштабы до тех пор, пока на него не обратили внимание величайшие демонологи — а после них и всяческие лорды, тираны, деспоты, иерофанты — сиречь те, чья ничтожная сила опиралась в основном на магию. Мастерство обмана демона было настолько велико, что всякий искренне считал, что именно он — его хозяин, а Shadow Demon — его слуга; тем временем, личность каждого «клиента» стиралась и заменялась необходимыми демону установками. В конце концов большинство членов культа превратились в бездушных марионеток, отростки его большой, злобной воли. Что же было следующим шагом в плане демона — остается лишь догадываться, так как как раз в то время Невермор впился в особенно прогнившую душу, и обнаружил, что там все залито тягучей нугой сущности Shadow Demon. Уловив тревожный звонок готовящегося заговора, грозившего нарушением древнего Договора Тени, Люцифер и Невермор заключили временный союз, чтобы уничтожить разрастающийся культ. Соединив заклинания невероятной мощи, они обратили столетия кропотливой работы демона в ничто, разнеся культ на куски, а его членов — в кровавые ошметки. Не осталось ничего, кроме маленькой искорки демонической тени. Бессмертной и неуничтожимой капельки Shadow Demon хватило, чтобы сразу же породить новый план. Демон сразу же принялся воплощать свою задумку в действие, все последующие столетия восполняя потери. Всё, до чего бы не дотрагивалась та толика тени, сразу же осквернялось — и сила ее, этой толики, росла. Из хаоса изуродованных частей, которые сшивались, сливались и переходили друг в друга, явилась новая форма демона, гораздо сильнее старой. Теперь он вновь владеет силой, а план всемирной власти уже очищен от старых ошибок. Казалось бы, такому совершенному существу, полному зла и жестокости, не найти места в нашем плотском мире… однако последователей у него предостаточно.","trivia":["В DotA имя Shadow Demon было \"Эредар\". Оно было удалено при переходе в Dota 2 во избежания нарушений авторских прав Blizzard, так как Эредары - раса обладателей магии во вселенной Warcraft. ","Шутливое\/альтернативное имя Shadow Demon'a было \"Giblet\" - потроха птиц, которые используют в кулинарии.","Все звуковые эффекты способностей основаны на некоторых фразах демона на демоническом языке Озкавош. Эта фраза (\"Sa nith icha gluth.\") используется при применении Disruption, первая часть этой фразы(\"Ozh icha tak izh\") используется при Soul Catcher, эта спользуется при Shadow Poison, а эта фраза(\"Ozh icha tak lash\") разделена на 3 части и используется при Demonic Purge."],"talents":["2 заряда способности Disruption:+500 урона от Demonic Purge","-1,5 сек. к перезарядке Shadow Poison:-6 сек. к перезарядке Soul Catcher","+25% к урону от Shadow Poison:+30 к скорости передвижения","+25% к получаемому опыту:Soul Catcher создаёт иллюзию героя при смерти"],"desc":"Shadow Demon — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Его первая способность, Disruption, ненадолго изгоняет цель из мира и после возвращения создаются две иллюзии изгнанного героя, переходящие под ваш контроль. Вторая способность, Soul Catcher, проклинает всех врагов в определенном радиусе, отнимая у них часть здоровья. Половниа отнятого здоровья возвращается назад через определенное время. Противник, находящиеся под действием способности Disruption, всё равно могут стать целью заклинания. Третья способность, Shadow Poison, наносит урон при попадании и отравляет врагов. Урон может быть накоплен. Этот накопленный урон наносится по окончании действия Shadow Poison или при использовании дополнительной способности Shadow Poison Release. Ультимативная способность, Demonic Purge, очищает цель, снимая с нее все положительные эффекты и замедляя на время действия заклинания. Скорость передвижения цели постепенно возрастает, полностью восстанавливаясь к окончанию заклинания. По окончании действия цель получает урон. Эффект заклинания сработает на врагов, изгнанных способностью Disruption. Улучшение с Aghanim's Scepter заменяет перезарядку способности на 3 заряда, восполняющиеся со временем. Также эта способность отключает пассивные способности цели на время действия."}