{
  "abilities": [
    {
      "notes": [
        "The Finger of Death damage per kill and the max health per kill talents are retroactive, adding damage and health to all already existing stacks, not just the ones made after the talent was taken.",
        "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+250 AoE Hex",
          "talentRight": "+800 Earth Spike Range"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Mana Drain Restores Allies",
          "talentRight": "+20 Finger of Death Damage Per Kill"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+70 Max Health Per Finger of Death Kill",
          "talentRight": "-2s Earth Spike Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+60 Damage",
          "talentRight": "+15 Movement Speed"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Lion_Earth_Spike_1.mp3\/revision\/latest?cb=20191216015624",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The spikes' max travel distance is based on the cast range, plus the range buffer. With the default cast range, it has a max travel distance of 850 (TagTalent 1650).",
        "With the default cast range, it has a max travel distance of 850 (TagTalent 1650).",
        "The spikes travel at a speed of 1600, taking 0.53 (TagTalent 1.03) seconds to travel the full distance.",
        "With the travel distance and the spikes radius, it can hit units up to 975 (TagTalent 1775) range away.",
        "When targeting a unit, the spikes are released towards its current location upon cast. Spikes do not home and thus can be evaded.",
        "Hit units are knocked up 350 range for the initial 0.5 seconds of the stun.",
        "While in the air, other units may pass below hit airborne units.",
        "The damage is applied upon landing, not upon getting hit.",
        "When Earth Spike hits invisible units, the visual effects below the hit unit are still visible."
      ],
      "mana": "85\/110\/135\/160",
      "item_behaviour": [],
      "name": "Earth Spike",
      "cooldown": "12 (TagTalent 10)",
      "description": "Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 575 (TagTalent 1375)",
        "Spikes Range Buffer: 275",
        "Spikes Radius: 125",
        "Damage: 80\/140\/200\/260",
        "Stun Duration: 1.4\/1.8\/2.2\/2.6",
        "Attempts to damage if already hit enemies turn spell immune before landing.",
        "Blocked upon impact by everyone within range of the spikes."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/43\/Lion_Hex_1.mp3\/revision\/latest?cb=20191216015630",
      "effects": [
        "Ability Target Unit (TagAghanim Target Area)",
        "Affects Enemies",
        "Damage Instant Kill"
      ],
      "notes": [
        "Applies a hex on the target, setting its base movement speed to 120, silencing, muting and disarming it. However, the target's movement speed can still be affected by movement speed bonuses from items and abilities. Since Hex sets the base movement speed of the target unit and does not actually apply a slow, all speed effects are calculated using the 120 base speed.",
        "However, the target's movement speed can still be affected by movement speed bonuses from items and abilities.",
        "Since Hex sets the base movement speed of the target unit and does not actually apply a slow, all speed effects are calculated using the 120 base speed.",
        "Hex instantly destroys illusions.",
        "Lion's hex transforms the target into a frog. The Fin King's Charm and Fin King's Charm of Eminent Revival change the model into a fish.",
        "The Fin King's Charm and Fin King's Charm of Eminent Revival change the model into a fish.",
        "With the level 25 talent, Hex turns into an area-targeted ability, so that it cannot directly target units anymore. Affects every valid target within the area. Does not affect invulnerable or hidden units but fully affects invisible units.",
        "Affects every valid target within the area. Does not affect invulnerable or hidden units but fully affects invisible units."
      ],
      "mana": "125\/150\/175\/200",
      "item_behaviour": [],
      "name": "Hex",
      "cooldown": "30\/24\/18\/12",
      "description": "Transforms an enemy unit into a harmless beast, with all special abilities disabled.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0.53",
        "Cast Range: 500",
        "Set Move Speed: 120",
        "Duration: 2.5\/3\/3.5\/4",
        "Radius: 250",
        "Effects persist if debuff was placed before spell immunity.",
        "Blocked as a single-target ability, not blocked when turned into an area-targeted ability."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Lion_Mana_Drain.mp3\/revision\/latest?cb=20191216015631",
      "effects": [
        "Ability Target Unit \/ Channeled",
        "Affects Enemies (TagAghanim Allies)",
        "Damage Instant Kill"
      ],
      "notes": [
        "Can only be cast on units which have a mana pool.",
        "The link breaks when the target gets out of vision, turns invulnerable, or exceeds the break distance. The link does not break when the target runs out of mana.",
        "The link does not break when the target runs out of mana.",
        "Drains 2\/4\/6\/12 mana in 0.1-second intervals, starting 0.1 seconds after cast, resulting in up to 50 instances. Instantly destroys targeted illusions on the first interval.",
        "Instantly destroys targeted illusions on the first interval.",
        "Can drain up to 100\/200\/300\/600 mana when fully channeled.",
        "The mana gained is based on how much the target actually lost on each interval. If they have no mana left, no mana is gained either. However, if Lion is at full mana, the target still continues to lose mana.",
        "However, if Lion is at full mana, the target still continues to lose mana.",
        "With the level 20 talent, Mana Drain can be cast on allies with reversed effects, draining the caster's mana into the target. Instantly destroys targeted allied illusions on the first interval as well. Like on enemies, the mana the ally gains is based on how much Lion actually loses. However, if the ally is at full mana, Lion continues to lose mana.",
        "Instantly destroys targeted allied illusions on the first interval as well.",
        "Like on enemies, the mana the ally gains is based on how much Lion actually loses.",
        "However, if the ally is at full mana, Lion continues to lose mana.",
        "With Aghanim's Shard, Mana Drain grants Lion spell immunity while channeling and automatically targets 2 additional enemies within range, using the same targeting rules. The spell immunity while channeling does not come with any dispel. The search range is based on the cast range, plus the buffer, resulting in a search range of 1150. Since the additional links use the ability's cast range, cast range increasing effects increase their range as well. The secondary targets are chosen randomly within the area. There are no priorities. When cast on allies, it still can choose random enemies within range. Does not target allies as secondary targets. The secondary links do not break and continue to drain mana, even if their targets turn invulnerable, spell immune or run out of mana. They do break when exceeding the link break distance. The secondary links stop draining mana if their targets turn invisible or get out of vision, but continue to slow them. All links break as soon as the primary target cannot be affected anymore.",
        "The spell immunity while channeling does not come with any dispel.",
        "The search range is based on the cast range, plus the buffer, resulting in a search range of 1150.",
        "Since the additional links use the ability's cast range, cast range increasing effects increase their range as well.",
        "The secondary targets are chosen randomly within the area. There are no priorities.",
        "When cast on allies, it still can choose random enemies within range. Does not target allies as secondary targets.",
        "The secondary links do not break and continue to drain mana, even if their targets turn invulnerable, spell immune or run out of mana. They do break when exceeding the link break distance.",
        "The secondary links stop draining mana if their targets turn invisible or get out of vision, but continue to slow them.",
        "All links break as soon as the primary target cannot be affected anymore."
      ],
      "mana": "10",
      "item_behaviour": [],
      "name": "Mana Drain",
      "cooldown": "15\/12\/9\/6",
      "description": "Absorbs the magical energies of a target enemy unit by taking mana from it every second.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 850",
        "Max Targets: 1 (TagTalent 3)",
        "Link Break Distance: 1100",
        "Mana Drain per Second: 20\/40\/60\/120",
        "Move Speed Slow: 20%\/25%\/30%\/35%",
        "Max Channel Time: 5",
        "Secondary Target Range Buffer: 300",
        "Causes Mana Drain to affect up to three enemies. You become Spell Immune while channeling.",
        "Effect does not persist and immediately ends if debuff was placed before spell immunity. Effect persists on secondary targets if debuff was placed before spell immunity. Can be cast on spell immune allies.",
        "Blocked normally upon cast. Blocked fully only when primary target."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/32\/Lion_Finger_of_Death_1.mp3\/revision\/latest?cb=20191216015627",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Places a debuff on the target upon cast, which applies the damage and the second debuff upon expiring. The debuff lasts 0.25 seconds. This means the damage can be avoided by being invulnerable, hidden or spell immune as the debuff expires.",
        "This means the damage can be avoided by being invulnerable, hidden or spell immune as the debuff expires.",
        "If the target dies while having the second debuff, Finger Of Death gains a permanent damage bonus. The status buff on Lion keeps track of how many heroes died with the debuff. The bonus debuff stacks, meaning that if Finger Of Death is cast on the same target twice within the 3-second time frame and the target dies, the bonus damage is granted twice. Although only gaining damage from hero kills, the debuff is placed on every target. Gains damage from dying Meepo Clones as well, but not from Tempest Doubles, illusions or creep-heroes. With the level 15 talent, the debuff also grants Lion a permanent 70 max health bonus per stack. The health gain keeps the current health percentage the same.",
        "The status buff on Lion keeps track of how many heroes died with the debuff.",
        "The bonus debuff stacks, meaning that if Finger Of Death is cast on the same target twice within the 3-second time frame and the target dies, the bonus damage is granted twice.",
        "Although only gaining damage from hero kills, the debuff is placed on every target.",
        "Gains damage from dying Meepo Clones as well, but not from Tempest Doubles, illusions or creep-heroes.",
        "With the level 15 talent, the debuff also grants Lion a permanent 70 max health bonus per stack. The health gain keeps the current health percentage the same.",
        "The health gain keeps the current health percentage the same.",
        "With Aghanim's Scepter, Finger of Death is cast on all enemy units within 325 radius of the primary target. Can hit invisible units and units inside the Fog of War.",
        "Can hit invisible units and units inside the Fog of War."
      ],
      "mana": "200\/420\/650",
      "item_behaviour": [],
      "name": "Finger of Death",
      "cooldown": "160\/100\/40 (TagTalent 100\/60\/20)",
      "description": "Rips at an enemy unit, trying to turn it inside-out. Deals massive damage and grows stronger with each life it consumes.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 900",
        "Effect Delay: 0.25",
        "Base Damage: 600\/725\/850 (TagAghanim 700\/825\/950)",
        "Damage Bonus per Kill: 40 (TagTalent 60)",
        "Kill Grace Duration: 3",
        "Max Health per Kill: 70",
        "Radius: 325",
        "Increases damage. Decreases cooldown. Finger of Death hits all units in a small area.",
        "Cannot be cast on spell immune enemies, but pierces spell immunity when turning spell immune after cast. Fully pierces spell immunity when reflected.",
        "Blocked fully only when primary target. Blocked upon cast. Particles still visually appear."
      ],
      "legacy_key": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 18.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.5,
    "attrAgility": 18.0
  },
  "description": "Lion, the Demon Witch, is a ranged intelligence hero, most commonly played as a support, who serves as a powerful offensive spellcaster. While exceptionally frail and vulnerable at all stages of the game due to his low health pool, armor, and movement speed, he has a tremendous amount of disabling and nuking power, allowing him to provide the necessary lockdown and burst damage to his team to bring down elusive and shifty enemies. Earth Spike is an area-of-effect line-based stun that also deals a moderate amount of damage. If Lion uses it at max level combined with his Hex, which briefly transfigures an enemy into a harmless critter, he can disable a single opponent for almost 7 seconds, more than enough time to bring down a lone enemy, especially if an ally is present. His ultimate, Finger of Death, serves as a powerful nuke and his primary source of burst damage to aid him in his endeavors. To offset the high mana cost of his abilities, he has Mana Drain, which provides him the sustenance he needs to continuously provide his disabling prowess in a skirmish. A team facing a Lion would do well to eliminate him first in a fight, lest it fall prey to his potent and disruptive spells.",
  "history": "Once a Grandmaster of the Demon Witch tradition of sorcery, Lion earned fame among his brethren for fighting on the side of light and righteousness. But adulation corrupts. With powers surpassed only by his ambition, the mage was seduced by a demon and turned to evil, trading his soul for prestige. After committing horrible crimes that marred his soul, he was abandoned. The demon betrayed him, striking better deals with his enemies. Such was Lion’s rage that he followed the demon back to hell and slew it, ripping it limb from limb, taking its demonic hand for his own. However, such demonoplasty comes at a cost. Lion was transfigured by the process, his body transformed into something unrecognizable. He rose from hell, rage incarnate, slaying even those who had once called him master, and laying waste to the lands where he had once been so adored. He survives now as the sole practitioner of the Demon Witch tradition, and those who present themselves as acolytes or students are soon relieved of their mana and carried off by the faintest gust of wind.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+250 AoE Hex",
      "talentRight": "+800 Earth Spike Range"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Mana Drain Restores Allies",
      "talentRight": "+20 Finger of Death Damage Per Kill"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+70 Max Health Per Finger of Death Kill",
      "talentRight": "-2s Earth Spike Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+60 Damage",
      "talentRight": "+15 Movement Speed"
    }
  ]
}