{"abilities":[{"spell":"Vector targeted. Void Spirit dispatches a remnant to the target location. The remnant stands watch over the region, facing the direction of his vector. When a unit crosses its gaze, the remnant pulls it in and damages it.","effects":["Ability Target Point \/ Vector Targeting","Affects Enemy Units","Damage Magical"],"notes":["Pull lasts 0.1 second on creeps. Aether Remnant first applies the damage, then the pull effect. Hypnotizes the target, forcing it to move towards the Remnant, and preventing it from acting. Grants the target unobstructed pathing, so it can move through cliffs, trees, and other units. The remnant move speed is 900. Watch distance is 450 and radius 130 while vision radius 200."],"mana":"85\/90\/95\/100","elements":["Does not pierce spell immunity."],"cooldown":"17\/15\/13\/11","name":"Aether Remnant","description":["Damage: 90\/150\/210\/270","Pull Duration: 1.2\/1.4\/1.6\/1.8","Remnant Duration: 20","Activation Time: 0.4","Cast Range: 1000","True Sight Radius: 0 ( 600)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Void Spirit temporarily fades into the aether, creating a number of portals through which he can reassemble himself. Upon exiting a portal, he damages all enemies in the area.","effects":["Ability No Target","Affects Enemy Units \/ Self","Damage Magical"],"notes":["Void Spirit is hidden, silenced, and muted during Dissimilate. Dissimilate creates seven portals with a radius of 275 each. One portal is centered on Void Spirit's location on cast. The other portals are arranged in an equilateral hexagon around the center portal, with one portal in the direction Void Spirit was facing on cast. Portals are centered 550 range away from each adjacent portal. Issuing a move command while Dissimilate is active will designate the portal centered nearest to the target location for Void Spirit to emerge from. If no move command is given, he will emerge from the center portal. Can reselect the exit portal any number of times per cast. The designated exit portal will be highlighted with a distinct visual effect that is not visible to the enemy team."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"20\/17\/14\/11","name":"Dissimilate","description":["Damage: 140\/220\/300\/380","Phase Duration: 1.3","Portal Radius: 275","Stun Duration: 0 ( 3)"],"hot_key":"W","legacy_key":"D"},{"spell":"Void Spirit wraps himself in a protective shield that absorbs physical damage and emits a single damaging pulse around him. The shield gains increased damage absorption for each enemy hero the pulse hits.","effects":["Ability No Target","Affects Enemy Units \/ Self","Damage Magical"],"notes":["Resonant Pulse expands at a speed of 1200, taking 0.4167 seconds to fully expand. The expanding ring is centered on Void Spirit and follows his movements. Any enemy hero hit by the pulse causes a projectile to return to Void Spirit that bestows the bonus damage absorption upon reaching him. The projectile travels at a speed of 900. Bonus absorption is given even if the base shield is lost. Possibly due to a bug, disjointing the projectiles (e.g. by Blinking) will negate the bonus absorption. The shield absorbs damage after it is reduced by armor."],"mana":"90\/100\/110\/120","elements":["Partially pierces spell immunity."],"cooldown":"14","name":"Resonant Pulse","description":["Pulse Damage: 70\/130\/190\/250 ( 220\/280\/340\/400)","Pulse Radius: 500","Shield Duration: 10","Base Shield Absorb: 50\/100\/150\/200","Bonus Absorb Per Hero Hit: 30\/45\/60\/75"],"hot_key":"E","legacy_key":"E"},{"spell":"Void Spirit tears a rift through the astral plane to appear at the target location, attacking all enemies along the path. This attack inflicts a void mark that slows and then detonates.","effects":["Ability Target Point","Affects Enemy Units","Damage Instant Attack \/ Magical"],"notes":["Causes Void Spirit to perform an instant attack on all hit enemies. These attacks have True Strike, and can therefore never miss. They also ignore disarms. Can proc any attack modifier on all of the hit targets normally, except cleave. The level 25 talent adds an ensured critical strike to Astral Step; crits with a lower value have no effect if they proc (higher crit value takes priority). All enemies hit by Astral Step's instant attacks receive the Astral Step debuff, which deals the void mark damage when lost through any means."],"mana":"80\/90\/100","elements":["Pierces spell immunity."],"cooldown":"0","name":"Astral Step","description":["Cast Animation: 0.2+?","Void Mark Damage: 150\/200\/250","Movement Speed Slow: 40%\/60%\/80%","Movement Slow Duration: 1.25","Max Distance: 700\/900\/1100","Max Charges: 2","Charge Restore Time: 25\/20\/15 ( 18\/13\/8)","Critical Damage: 0% ( 200%)"],"hot_key":"R","legacy_key":"T"}],"bio":"Not even the other spirits claim to understand the mind and machinations of the eldest amongst them, Inai the Void Spirit. Privy to secrets that would shatter a mortal mind, the Void Spirit observes the workings of the universe from an unknowable vantage, choosing to let carefully groomed servants do his bidding -- only emerging from his Hidden Temple into the material plane when he deems that he alone can steer the course of reality along its proper path. With an expansive perspective on existence, Inai is focused intently on a point in time beyond which he cannot see, when the fabrics of multiple realities are fated to collide. Now he steps from the aether to personally resolve the battle of the Ancients and prepare his allies for what he views as a greater conflict to come.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Void Spirit's Chinese voice actor is Ge Ping (葛平), who also worked on 3000 Whys of Blue Cat, a famous cartoon series in China."],"talents":["Dissimilate Stuns for 3s:Astral Step 200% Crit","-7 Astral Step Charge Restore Time:+15% Spell Amplification","+150 Resonant Pulse Damage:Remnant Provides 600 Truesight","+30 Damage:+3 Mana Regen"],"desc":"Void Spirit 22 + 2.8 19 + 2.2 24 + 3.1 Level Base 1 15 25 Health 200 640 1420 1980 Health regen 0 2.2 6.12 8.92 Magic res. 25% 26.32% 28.67% 30.35% Mana 75 363 879 1251 Mana regen 0 1.2 3.37 4.92 Spell dmg 0% 1.68% 4.72% 6.89% Armor 2.66 5.7 10.63 14.15 Att\/sec 0.59 0.7 0.88 1.01 Move sp amp. 0% 0.95% 2.49% 3.59% Damage 32‒36 56‒60 99‒103 130‒134 Movement speed 305 Attack speed 100 Turn rate 0.7 Vision range 1800\/800 Attack range 200 Projectile speed Instant Attack animation 0.35+1 Base attack time 1.7 Damage block 8 Collision size 24 Legs 2  Gib type Ethereal"}