{"abilities":[{"spell":"Vector targeted. Void Spirit dispatches a remnant to the target location. The remnant stands watch over the region, facing the direction of his vector. When a unit crosses its gaze, the remnant pulls it in and damages it.","effects":["Ability Target Point \/ Vector Targeting","Affects Enemies","Damage Magical"],"notes":["The remnant moves towards the targeted point at a speed of 900.","Upon reaching the targeted point, the remnant faces towards the targeted direction, and then remains inactive for 0.4 seconds.","After the activation delay, the remnant provides flying vision in front of it. The vision is provided by 2 vision cells, each with a radius of 200. The first vision cell is positioned 225 range in front of the remnant, the second one 450 range in front of it. The remnant itself also has 250 radius ground vision. This is the dummy's vision, and is provided at all times around the remnant. Together with the remnant's own vision, the total vision area has a length of 925, and a width of 450.","After the delay, the remnant searches for enemies within a path in front of it. The search path has a length of 450 and width of 130. When multiple enemies are within the area, it grabs the one furthest away closest to the center line.","Hypnotizes the target, forcing it to move towards the the remnant, and preventing it from acting. Sets the target's movement speed to 44%\/50%\/56%\/62% of the distance between Remnant and the target. If the target is too close, it stops moving once within 100 range of the remnant.","The speed is set once upon cast. If the target gets moved or teleported, the speed does not adapt.","Aether Remnant first applies the damage, then the pull debuff.","The level 15 talent adds 600 radius True Sight around the remnant's location."],"mana":"85\/90\/95\/100","elements":["Does not pierce spell immunity."],"cooldown":"17\/15\/13\/11","name":"Aether Remnant","description":["Cast Animation: 0+0.53","Cast Range: 1000","Remnant Search Range: 450","Remnant Watch Width: 130","Watch Path Vision Radius: 200","True Sight Radius: 0 ( 600)","Activation Delay: 0.4","Damage: 80\/130\/180\/230","Distance Moved: 44%\/50%\/56%\/62%","Pull Duration: 1.2\/1.4\/1.6\/1.8","Remnant Duration: 20"],"hot_key":"Q","legacy_key":"R"},{"spell":"Void Spirit temporarily fades into the aether, creating a number of portals through which he can reassemble himself. Upon exiting a portal, he damages all enemies in the area.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Magical"],"notes":["Creates 7 portals, with one of the being at the cast location. The remaining 6 portals form a ring around the center portal. One portal is created in front of Void Spirit, while the other 5 are adapted to it, with 60 degree angles between them, forming a hexagon. All portals are placed 520 range away from the center of the middle portal.","The player can decide at which portal to re-appear, by issuing a move order. A move order is given by right-clicking, or by pressing the move hotkey and selecting a target point. Directly clicking on the portals is not required, a directional order is enough. The closest portal to the right-clicked location gets selected. The player can change the selected portals as many time as they want during the phase duration. A selected portal is highlighted for Void Spirit and his allies. For enemies, all portals look the same.","Turns the caster invulnerable and hidden for its duration.","Fully disables, silences, mutes, and disarms Void Spirit, making him unable to do anything. Attack orders behave like move orders during disarms, so right-clicking an enemy selects the closest portal to the enemy as well.","Does not provide phased movement, so Void Spirit can still block other units during Dissimilate.","Does not disjoint projectiles upon teleporting.","The damage is dealt around the selected portal upon re-appearing. The level 25 talent also adds a stun to this. Applies the damage first, then the stun."],"mana":"100\/110\/120\/130","elements":["Cannot be cast while rooted or leashed.","Does not pierce spell immunity."],"cooldown":"20\/17\/14\/11","name":"Dissimilate","description":["Cast Animation: 0.2+0","Portals Radius: 275","Portals Distance: 520","Number of Portals: 7","Damage: 100\/180\/260\/340","Phase Duration: 1.3","Stun Duration: 0 ( 3)"],"hot_key":"W","legacy_key":"D"},{"spell":"Void Spirit wraps himself in a protective shield that absorbs physical damage and emits a single damaging pulse around him. The shield gains increased damage absorption for each enemy hero the pulse hits.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Magical"],"notes":["Interrupts Void Spirit's channeling spells upon cast.","The pulse spreads at a speed of 1200 and takes 0.42 seconds to reach maximum range and dissipate.","The pulse is a thin ring expanding outwards. This means it can be avoided by teleporting towards Void Spirit over the ring.","Any enemy hit by the ring gets damaged, and release a projectile that moves towards Void Spirit at a speed of 900. Once these projectiles reaches Void Spirit, they increase the shield's capacity by the given amount. If the base shield got depleted before these projectiles reach, they create a new shield, with their own capacity. These projectiles cannot be disjointed.","The pulse is bound to the Resonant Pulse Ring modifier. Multiple instances of the modifier stack, so that each cast releases a ring. The modifier is lost on death, so dying stops the ring.","The shield only works against physical attack damage. Magical or pure attack damage, and spell damage of any kind is not blocked.","Blocks after armor reduction, but before any other reductions."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"16","name":"Resonant Pulse","description":["Cast Animation: 0+0","Radius: 500","Damage: 70\/120\/170\/220 ( 170\/220\/270\/320)","Physical Attack Damage Blocked: 40\/80\/120\/160","Absorbtion bonus per Hit Hero: 30\/45\/60\/70","Duration: 10"],"hot_key":"E","legacy_key":"E"},{"spell":"Void Spirit tears a rift through the astral plane to appear at the target location, attacking all enemies along the path. This attack inflicts a void mark that slows for 1.25 seconds and then detonates.","effects":["Ability Target Point","Affects Enemies \/ Self","Damage Instant Attack \/ Magical"],"notes":["Void Spirit is teleported instantly towards the targeted point upon cast.","Does not disjoint projectiles upon teleporting.","Performs an instant attack on every enemy unit along the path. These attacks have True Strike and ignore disarms. Can trigger any attack modifier, except for cleave. Can trigger on-hit effects as well. The level 25 talent also adds critical strike to the instant attack.","All hit enemies also receive the slow debuff. This debuff deals damage upon losing it. This means dispelling it causes the damage to happen earlier.","Astral Step first applies the instant attack, then the debuff."],"mana":"100","elements":["Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"0","name":"Astral Step","description":["Cast Animation: 0.2+0","Cast Range: Global","Minimum Distance: 200","Maximum Distance: 700\/900\/1100","Path Width: 170","Movement Speed Slow: 40%\/60%\/80%","Critical Damage: 100% ( 200%)","Debuff Damage: 150\/200\/250","Debuff Duration: 1.25","Number of Charges: 2","Charge Replenish Time: 30\/25\/20 ( 23\/18\/13)"],"hot_key":"R","legacy_key":"T"}],"bio":"Not even the other spirits claim to understand the mind and machinations of the eldest amongst them, Inai the Void Spirit. Privy to secrets that would shatter a mortal mind, the Void Spirit observes the workings of the universe from an unknowable vantage, choosing to let carefully groomed servants do his bidding -- only emerging from his Hidden Temple into the material plane when he deems that he alone can steer the course of reality along its proper path. With an expansive perspective on existence, Inai is focused intently on a point in time beyond which he cannot see, when the fabrics of multiple realities are fated to collide. Now he steps from the aether to personally resolve the battle of the Ancients and prepare his allies for what he views as a greater conflict to come.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Void Spirit's Chinese voice actor is Ge Ping (葛平), who also worked on 3000 Whys of Blue Cat, a famous cartoon series in China.","Void Spirit was first teased in a comic that came with the release of Monkey King's arcana, almost 3 years before his official release."],"talents":["Dissimilate Stuns for 3s:Astral Step 200% Crit","-7 Astral Step Charge Restore Time:+15% Spell Amplification","+100 Resonant Pulse Damage:Remnant Provides 600 Truesight","+30 Damage:+3 Mana Regen"],"desc":"Inai, the Void Spirit is a melee intelligence hero that relies on the element of surprise to blast apart foes with the power of the void. He plays like no other hero, relying on a wide variety of skills that allow him to put his enemies out of position while quickly jumping in and out of combat. Using his Aether Remnants, Inai can start and end any fight in seconds by forcing enemies to attack remnants of himself that guard from all angles. The void is both sword and shield for Void Spirit, whether he takes a quick repose in the aether to teleport to an area of his choice with explosive force, or shields himself in volatile energy that slays the weak and nullifies the attacks of the mighty. Should anything manage to survive the Void Spirit's onslaught, he calls upon his mastery of the ultimate Astral Step technique, dashing through space and time to attack and mark enemies for death not once, but twice."}