{"abilities":[{"spell":"Векторное применение. Герой отправляет в указанную точку свою копию. Копия смотрит в сторону, указанную при применении. Когда в её обзор попадает существо, копия притягивает его и наносит урон.","effects":["Способность Направленная на точку \/ Направленная по вектору","Действует на Врагов","Урон Магический"],"notes":["Копия движется к указанной точке со скоростью в 900.","По достижении указанной точки копия поворачивается в указанное направление и остаётся неактивной 0,4 сек.","После задержки активации, копия даёт летающий обзор впереди себя. Обзор даётся двумя ячейками обзора, каждая с радиусом 200. Первая ячейка обзора распологается перед копией на расстоянии 225 от неё, вторая на расстоянии 450. Сама копия имеет наземный обзор в радиусе 250. Это обзор модели, и он всегда обеспечивается вокруг копии. Вместе с собственным обзором копии, общая область обзора имеет длинну 925 и ширину 450.","После задержки, копия ищет врагов на пути перед ней. Путь поиска имеет длину 450 и ширину . Если в области несколько врагов, копия притягивает самого дальнего и ближнего к центральной линии.","Гипнотизирует цель, заставляя её двигаться к копии и не давая ей действовать. Устанавливает скорость передвижения цели на 44%\/50%\/56%\/62% от расстоянии между копией и целью. Если цель слишком близко, движение останавливается как только она будет на расстоянии в 100 от копии.","Скорость устанавливается один раз за применение. Если цель подвинется или телепортируется, скорость не изменится.","Aether Remnant сперва применяет урон, затем дебафф притягивания.","Талант 15 уровня добавляет True Sight радиусом 600 вокруг места копии."],"mana":"85\/90\/95\/100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"17\/15\/13\/11","name":"Aether Remnant","description":["Анимация применения: 0+0,53","Дальность применения: 1000","Расстояние поиска копии: 450","Ширина взгляда копии: 130","Радиус пути обзора вгляда: 200","Радиус True Sight: 0 ( 600)","Задержка активации: 0,4","Урон: 80\/130\/180\/230","Проходимая дистанция: 44%\/50%\/56%\/62%","Длительность притягивания: 1,2\/1,4\/1,6\/1,8","Длительность копии: 20"],"hot_key":"Q","legacy_key":"R"},{"spell":"Герой временно исчезает в иной мир, создавая несколько порталов, через которые он может собрать свою сущность воедино. Выйдя из портала, герой наносит урон всем врагам в области действия.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Создаёт 7 порталов, с одним расположенным в месте применения. Оставшиеся 6 порталов формируют круг вокруг центрального портала. Один портал создаётся в направлении взгляда Void Spirit, а другие 5 подстраиваются под него, с углами 60 градусов между ними, формируя шестиугольник. Все порталы располагаются на расстоянии 520 от центра центрального портала.","Игрок может решать в каком портале появиться, давая команду движения. Команда движения даётся нажатием правой кнопкой мыши, или нажатием горячей клавиши движения и выбором целевой точки. Прямое нажатие на порталы не требуется, достаточно команды направления. Будет выбран ближайший портал к месту нажатия правой кнопкой мыши. Игрок может изменять выбранные порталы во время длительности исчезновения сколько угодно раз. Выбранный портал подсвечивается для Void Spirit и его союзников. Для врагов все порталы выглядят одинаково.","Делает заклинателя неуязвимым и спрятанным на длительность.","Полностью обезвреживает, обезмолвливает, заглушает и обезоруживает Void Spirit, что делает его неспособным делать что-либо. Команды атаки ведут себя так же как и команды движения во время обезоруживания, поэтому выбор врага правой кнопкой мыши также выберет ближайший портал к этому врагу.","Не даёт сквозное передвижение, поэтому Void Spirit всё ещё может блокировать других юнитов во время Dissimilate.","Не избегает снаряды при телепортации.","Урон наносится вокруг выбранного портала при появлении. Талант 25 уровня также добавляет к нему оглушение. Сперва применяется урон — потом оглушение."],"mana":"100\/110\/120\/130","elements":["Нельзя применять в оцепенении или будучи связанным.","Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/17\/14\/11","name":"Dissimilate","description":["Анимация применения: 0,2+0","Радиус портала: 275","Расстояние портала: 520","Количество порталов: 7","Урон: 100\/180\/260\/340","Длительность исчезновения: 1,3","Длительность оглушения: 0 ( 3)"],"hot_key":"W","legacy_key":"D"},{"spell":"Герой помещает себя в защитную оболочку, которая поглощает физический урон и выпускает одну наносящую урон волну. Оболочка поглощает тем больше урона, чем больше вражеских героев заденет волна.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Прерывает произносимые заклинания Void Spirit при применении.","Импульс распространяется со скоростью 1200, полностью расширяясь за 0,42 сек. до максимального радиуса и рассеиваясь.","Импульс представляет собой тонкий круг, расширяющееся наружу. Это значит что его можно избежать телепортацией внутрь круга к Void Spirit.","Любой враг пораженный кругом получает урон и выпускает снаряд движущийся к Void Spirit со скоростью в 900. Как только эти снаряды достигают Void Spirit, они увеличивают прочность оболочки на данное значение. Если базовая оболочка разрушится до достижения этими снарядами, они создадут новую, с собственной прочностью. Эти снаряды нельзя избежать.","Импульс связан с модификатором Resonant Pulse Ring. Несколько модификаторов складываются, поэтому каждое применение выпускает круг. Модификатор пропадает при смерти, поэтому смерть останавливает круг.","Оболочка работает только против урона физической атаки. Магический или чистый урон атаки, а также урон заклинаний любого типа не будут блокироваться.","Блокирует урон после уменьшения бронёй, но до любых других уменьшений."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"16","name":"Resonant Pulse","description":["Анимация применения: 0+0","Радиус: 500","Урон: 70\/120\/170\/220 ( 170\/220\/270\/320)","Блокируемый урон физических атак: 40\/80\/120\/160","Бонусное поглощение за пораженного героя: 30\/45\/60\/70","Duration: 10"],"hot_key":"E","legacy_key":"E"},{"spell":"Герой перемещается в указанную точку через астральный разлом, атакуя всех врагов на пути. Эта атака накладывает метку пустоты, которая замедляет жертв на 700\/900\/1100 сек. и затем наносит урон.","effects":["Способность Направленная на точку","Действует на Врагов \/ Себя","Урон Мгновенная атака \/ Магический"],"notes":["Void Spirit мгновенно телепортируется в указанную точку при применении.","Не избегает снаряды при телепортации.","Применяет мгновенную атаку на каждое вражеское существо на пути. Эти атаки имеют True Strike и игнорируют обезоруживания. Может сработать любой модификатор атаки, кроме рассечения. Может также спровоцировать эффекты от удара. Талант 25 уровня также добавляет к мгновенной атаке критический удар.","Все пораженные враги также получают замедляющий дебафф. Этот дебафф наносит урон при исчезновении. Это значит что его развеивание заставит урон нанестись раньше.","Astral Step сперва применяет мгновенную атаку — потом дебафф."],"mana":"100","elements":["Нельзя применять в оцепенении или будучи связанным.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Astral Step","description":["Анимация применения: 0,2+0","Дальность применения: Глобальная","Минимальное расстояние: 200","Максимальное расстояние: 700\/900\/1100","Ширина пути: 170","Замедление скорости передвижения: 40%\/60%\/80%","Критический урон: 100% ( 200%)","Урон метки: 150\/200\/250","Длительность метки: 1,25","Количество зарядов: 2","Время восстановления заряда: 30\/25\/20 ( 23\/18\/13)"],"hot_key":"R","legacy_key":"T"}],"bio":"Даже другие духи не понимают стремлений и замыслов их старшего брата Иная, духа пустоты. Он хранит секреты, которые могут расколоть сознание смертного, и наблюдает за мановениями вселенной с непостижимой прозорливостью, оставляя подготовленным слугам исполнять его волю; и только если он решит, что больше никто не сможет направить реальность на верный путь, он покинет сокрытый храм и переместится в материальный мир. Инай видит перед собой всё сущее, но его взгляд прикован к тому моменту времени, в котором столкнётся множество реальностей - грядущее ему неведомо.Теперь же он материализуется из небытия, чтобы лично решить исход битвы Древних и подготовить своих союзников к более важному противостоянию.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Китайский актёр озвучивания Void Spirit — Ge Ping (葛平), который также работал над 3000 Whys of Blue Cat, сериями известного мультфильма в Китае.","Void Spirit был впервые показан в комиксе, который вышел с Arcana-предметом для Monkey King, почти за 3 года до официального релиза."],"talents":["Dissimilate оглушает на 3 сек.:Критические атаки в 200% урона от Astral Step","-7 сек. восстановления заряда Astral Step:+15% к урону от способностей","+100 к урону от Resonant Pulse:Копия раскрывает невидимость в радиусе 600","+30 к урону:+3 маны в секунду"],"desc":"Инай, Void Spirit — герой ближнего боя с основным атрибутом интеллект, который полагается на неожиданность чтобы взрывать врагов силой пустоты. Он действует иначе, по сравнению с другими героями, полагаясь на способности, позволяющие ему заставать врагов врасплох, быстро врываясь в схватку и уходя из неё. Используя свои копии Aether Remnant, Инай может начать и закончить любой бой за секунды, заставляя врагов атаковать остаток себя. Пустота — меч и щит Иная: захочет ли он взять передышку в ином мире, чтобы ошеломительно ворваться обратно в выбранное место, или же он облачит себя в оболочку из изменчивой энергии, которая повергнет слабых и сведёт на нет атаки сильных. Если же кто-либо устоит перед натиском Иная, он взовёт к мастерству своей ультимативной техники Astral Step, стремясь через пространство и время для атаки и отметки врагов на смерть, и не раз, но дважды."}