{"abilities":[{"spell":"Векторное применение. Герой отправляет в указанную точку свою копию. Копия смотрит в сторону, указанную при применении. Когда в её обзор попадает существо, копия притягивает его и наносит урон.","effects":["Способность Направленная на точку \/ Направленная по вектору","Действует на Вражеских существ","Урон Магический"],"notes":["На крипах провокация длится 0,1 секунды. Aether Remnant сначала наносит урон, а затем применяет провокацию. Гипнотизирует цель, заставляя ее двигаться к Remnant'у, цель не может использовать способности и предметы. Remnant имеет беспрепятственный проход, так что он может перемещаться через скалы, деревья и другие объекты. Скорость движения Remnant'а составляет 900. Watch distance is 450 and radius 130 while vision radius 200."],"mana":"85\/90\/95\/100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"17\/15\/13\/11","name":"Aether Remnant","description":["Урон: 90\/150\/210\/270","Длительность притягивания: 1.2\/1.4\/1.6\/1.8","Длительность копии: 20","Время активации: 0.4","Дальность применения: 1000","Радиус True Sight: 0 ( 600)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Void Spirit temporarily fades into the aether, creating a number of portals through which he can reassemble himself. Upon exiting a portal, he damages all enemies in the area.","effects":["Способность Ненаправленная","Действует на Вражеских существ \/ Себя","Урон Магический"],"notes":["Void Spirit is hidden, silenced, and muted during Dissimilate. Dissimilate creates seven portals with a radius of 275 each. One portal is centered on Void Spirit's location on cast. The other portals are arranged in an equilateral hexagon around the center portal, with one portal in the direction Void Spirit was facing on cast. Portals are centered 550 range away from each adjacent portal. Issuing a move command while Dissimilate is active will designate the portal centered nearest to the target location for Void Spirit to emerge from. If no move command is given, he will emerge from the center portal. Can reselect the exit portal any number of times per cast. The designated exit portal will be highlighted with a distinct visual effect that is not visible to the enemy team."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/17\/14\/11","name":"Dissimilate","description":["Damage: 140\/220\/300\/380","Phase Duration: 1.3","Portal Radius: 275","Stun Duration: 0 ( 3)"],"hot_key":"W","legacy_key":"D"},{"spell":"Void Spirit wraps himself in a protective shield that absorbs physical damage and emits a single damaging pulse around him. The shield gains increased damage absorption for each enemy hero the pulse hits.","effects":["Способность Ненаправленная","Действует на Вражеских существ \/ Себя","Урон Магический"],"notes":["Resonant Pulse expands at a speed of 1200, taking 0.4167 seconds to fully expand. Bonus shield applies when the visual effects back to Void Spirit. The projectile return speed is 900. Can disjoint the projectile return then gain no bonus shield.(bug) Even Void Spirit lost its base shield before the visual effects back, he can still gain the bonus shield on the visual effects back. The shield absorbs damage after it is reduced by armor."],"mana":"90\/100\/110\/120","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"14","name":"Resonant Pulse","description":["Pulse Damage: 70\/130\/190\/250 ( 220\/280\/340\/400)","Pulse Radius: 500","Shield Duration: 10","Base Shield Absorb: 50\/100\/150\/200","Bonus Absorb Per Hero Hit: 30\/45\/60\/75"],"hot_key":"E","legacy_key":"E"},{"spell":"Void Spirit tears a rift through the astral plane to appear at the target location, attacking all enemies along the path. This attack inflicts a void mark that slows and then detonates.","effects":["Способность Направленная на точку","Действует на Вражеских существ","Урон Мгновенная атака \/ Магический"],"notes":["Causes Void Spirit to perform an instant attack on all hit enemies. These attacks have True Strike, and can therefore never miss. They also ignore disarms. Can proc any attack modifier on all of the hit targets normally, except cleave. The level 25 talent adds Astral Step an ensured critical strike, crits with a lower value have no effect if they proc (higher crit value takes priority). All enemies hit by Astral Step's instant attacks receive the Astral Step debuff, which deals the void mark damage when lost through any means."],"mana":"80\/90\/100","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Astral Step","description":["Анимация применения: 0.2+?","Void Mark Damage: 150\/200\/250","Movement Speed Slow: 40%\/60%\/80%","Movement Slow Duration: 1.25","Max Distance: 700\/900\/1100","Max Charges: 2","Charge Restore Time: 25\/20\/15 ( 18\/13\/8)","Critical Damage: ( 200%)"],"hot_key":"R","legacy_key":"T"}],"bio":"Даже другие духи не понимают стремлений и замыслов их старшего брата Иная, духа пустоты. Он хранит секреты, которые могут расколоть сознание смертного, и наблюдает за мановениями вселенной с непостижимой прозорливостью, оставляя подготовленным слугам исполнять его волю; и только если он решит, что больше никто не сможет направить реальность на верный путь, он покинет сокрытый храм и переместится в материальный мир. Инай видит перед собой всё сущее, но его взгляд прикован к тому моменту времени, в котором столкнётся множество реальностей - грядущее ему неведомо.Теперь же он материализуется из небытия, чтобы лично решить исход битвы Древних и подготовить своих союзников к более важному противостоянию.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"talents":["Dissimilate оглушает на 3.0 сек.:Критические атаки в 200% урона от Astral Step","-7 сек. восстановления заряда Astral Step:+15% к урону от способностей","+150 к урону от Resonant Pulse:Копия раскрывает невидимость в радиусе 600","+30 к урону:+3 маны в секунду"],"desc":"Void Spirit 22 + 2,8 19 + 2,2 24 + 3,1 Уровень Баз. 1 15 25 Здоровье 200 640 1420 1980 Реген. здор. 0 2,2 6,12 8,92 Сопр. маг. 25% 26,32% 28,67% 30,35% Мана 75 363 879 1251 Реген. маны 0 1,2 3,37 4,92 Урон закл. 0% 1,68% 4,72% 6,89% Броня 2,66 5,7 10,63 14,15 Атак\/сек. 0,59 0,7 0,88 1,01 Ув. ск. пер. 0% 0,95% 2,49% 3,59% Урон 32‒36 56‒60 99‒103 130‒134 Скорость передвижения 305 Скорость атаки 100 Скорость поворота 0,7 Дальность обзора 1800\/800 Дальность атаки 200 Скорость снаряда Мгновенная Анимация атаки 0,35+1 Базовое время атаки 1,7 Блокировка урона 8 Размер столкновения 24 Ног 2  Тип ошметков Призрачные"}