{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1f\/Armlet_of_Mordiggian_Unholy_Strength_1.mp3\/revision\/latest?cb=20191227195349",
      "effects": [
        "Бонус к урону: 35",
        "Бонус к силе: 25",
        "Бонус к броне: 4",
        "Потеря здоровья в секунду: 45",
        "Задержка полноценных бонусов: 0,6"
      ],
      "notes": [
        "Не прерывает произносимые заклинания владельца при переключении.",
        "При включении, мгновенно дает урон от атаки и начинает отнимать 5 здоровья в интервалах в 0,11 сек.",
        "Даёт 4,17 силы в интервалах в 0,1 сек., так что необходимо 0,6 сек. для получения полного бонуса к силе.",
        "Броня дается после 0,6 сек. и не мгновенно.",
        "Не отнимает здоровье если герой неуязвим или спрятан.",
        "Потеря здоровья не может опустить здоровье использовавшего ниже 1. Не отключается по достижению 1 единицы здоровья.",
        "При отключении, все бонусы мгновенно исчезают. Но, здоровье использовавшего не может упасть ниже 1 единицы здоровья.",
        "Unholy Strength не остается после смерти использовавшего. Если она была активна при смерти, герой появится с выключенным предметом.",
        "Несколько Unholy Strength не сочетаются. Если включить несколько таких предметов, выключение любого предмета уберет бафф Unholy Strength.",
        "Если включить несколько таких предметов, выключение любого предмета уберет бафф Unholy Strength."
      ],
      "mana": "0",
      "abilityName": "Unholy Strength",
      "cooldown": "0",
      "description": "На время действия увеличивает урон на 35, силу на 25 и броню на 4, но отнимает 45 здоровья в секунду. Вы не можете умереть ни от потери здоровья во время действия способности, ни от спада бонуса к силе после её отключения.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Бонусы к урону от атаки, скорости атаки, броне и регенерации здоровья от нескольких Armlet of Mordiggian не складываются.",
    "Включенная Unholy Strength даёт в итоге следующие бонусы: 500 здоровья + 7,5 восстановления здоровья 10 бонусной брони 50 бонусного урона всем героям и дополнительные 25 основного урона героям силы.",
    "500 здоровья + 7,5 восстановления здоровья",
    "10 бонусной брони",
    "50 бонусного урона всем героям и дополнительные 25 основного урона героям силы."
  ],
  "cost": "2500",
  "lore": null,
  "consistFrom": [
    "Helm of Iron Will",
    "Gloves of Haste",
    "Blades of Attack",
    "Recipe"
  ],
  "name": "Armlet of Mordiggian",
  "description": "",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}