{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Tango_Devour.mp3\/revision\/latest?cb=20191227195540",
      "effects": [
        "Дальность применения (TagAghanimДерево\/Союзник): 165",
        "Доп. восстановление здоровья: 7.1875",
        "Длительность (TagAghanimОбычное дерево): 16",
        "Длительность (TagAghanimПосаженое дерево): 32"
      ],
      "notes": [
        "Когда применяется на дерево, то Tango уничтожает его и увеличивает регенерацию здоровья владельца. При использовании на посаженые деревья от Iron Branch, Ironwood Tree, Mango Tree, Woodland Striders или Sprout, длительность лечения удваивается. Один заряд Tango может восстановить до 115 (230 при использовании на посаженое дерево) здоровья за всю длительность. Все 3 заряда Tango могут восстановить до 345 (690 при использовании на посаженое дерево) здоровья. Последовательные применения на одно и то же дерево не складываются, но обновляют длительность.",
        "При использовании на посаженые деревья от Iron Branch, Ironwood Tree, Mango Tree, Woodland Striders или Sprout, длительность лечения удваивается.",
        "Один заряд Tango может восстановить до 115 (230 при использовании на посаженое дерево) здоровья за всю длительность.",
        "Все 3 заряда Tango могут восстановить до 345 (690 при использовании на посаженое дерево) здоровья.",
        "Последовательные применения на одно и то же дерево не складываются, но обновляют длительность.",
        "При использовании на союзного героя, Tango создаёт Tango (не свой) в инвентаре выбранного союзника, а не исцеляет его. Если инвентарь выбранного союзника заполнен, то предмет падает на землю. Также можно использовать на крипов-героев, при этом только дух-медведь получает заряд Tango (не свой), с другими крипами-героями ничего не происходит. Также можно использовать на клона Meepo и Tempest Double, но без какого-либо эффекта. Нельзя использовать на иллюзии.",
        "Если инвентарь выбранного союзника заполнен, то предмет падает на землю.",
        "Также можно использовать на крипов-героев, при этом только дух-медведь получает заряд Tango (не свой), с другими крипами-героями ничего не происходит.",
        "Также можно использовать на клона Meepo и Tempest Double, но без какого-либо эффекта.",
        "Нельзя использовать на иллюзии."
      ],
      "mana": null,
      "abilityName": "Devour",
      "cooldown": null,
      "description": "Съедает дерево, увеличивая восстановление здоровья на 7. Действует 16 сек. Если съесть деревце от Iron Branch, то восстановится в два раза больше здоровья. Изначально имеет 3 заряда. Можно применить на союзного героя, чтобы дать ему один Tango.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "90",
  "lore": null,
  "consistFrom": null,
  "name": "Tango",
  "description": "Натуральная пища для выживания на поле боя.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}