{"abilities":[{"spell":"Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration.","effects":["Ability No Target","Affects Enemies \/ Self"],"notes":["Affected units cannot use any spells or items and are forced to attack Axe for its duration. Units attempt to follow and attack Axe regardless of distance, vision, obstacles, or status. Affected units are still subject to disables and do not gain free pathing.","If Axe turns invisible during the taunt, affected enemies start attacking the next closest enemy to them. If no enemies are nearby, affected units stand still. While standing still, they can be given one order which they then execute. This order cannot be manually canceled. This can be any order, including casting of an ability or item, or a move or attack order. After that order, the unit cannot do anything and stands still until the taunt expires. However, if Axe turns visible again, affected units start attacking him again.","The taunt has the same priority as Winter's Curse, but lower priority than Duel. Same priority means that affected units attack the first taunt source, and switch to the other source once the first one expires. Taunts generally have a higher priority than Fear, however, Fear prevents the unit from attacking while taunted.","Affects invisible units and units in the Fog of War. Does not affect towers, wards, invulnerable or hidden units.","Re-casting on a unit under the taunt effect of Berserker's Call refreshes the duration.","When Axe dies, the taunt ends immediately.","Does not affect lane creeps from the very first creep wave that spawns, until they meet the opposing creeps in the lane."],"mana":"80\/90\/100\/110","elements":["Pierces spell immunity."],"cooldown":"16\/14\/12\/10","name":"Berserker's Call","description":["Cast Animation: 0.4+0.5","Radius: 300 ( 400)","Armor Bonus: 30","Duration: 2\/2.4\/2.8\/3.2"],"hot_key":"Q","legacy_key":"E"},{"spell":"Enrages an enemy unit, causing it to be slowed and take damage over time until it kills another unit or the duration ends. Axe gains movement speed for each unit affected with Battle Hunger, half speed from creeps.","effects":["Ability Target Unit ( Target Area)","Affects Enemies \/ Self","Damage Magical"],"notes":["Axe is granted 12% movement speed for every affected enemy hero. This effect stacks. Every affected non-hero unit grants half the speed value. Treats creep-heroes as creeps.","Casting Battle Hunger multiple times on the same target does not stack, but refreshes the duration instead.","Denying an ally or destroying buildings or wards also removes the debuff.","Using Devour, Demonic Conversion, or Hand of Midas also removes the debuff.","Killing illusions does not remove the debuff.","The affected unit itself has to make the kill to remove the debuff. Summons or illusions owned by the same player do not remove it when they make a kill.","Deals damage based on the level upon cast of the ability. Leveling up Battle Hunger does not update the damage of already placed debuffs. However, choosing the damage upgrading talent immediately upgrades all of Axe's currently active Battle Hunger debuffs.","Deals damage in 1 second intervals, starting 1 second after the debuff is placed, resulting in 12 instances.","Can deal up to 192\/288\/384\/480 ( 1632\/1728\/1824\/1920) damage (before reductions) when lasting its full duration.","When upgraded, directly reduces any damage debuffed enemies deal. This includes damage from spells.","Aghanim's Scepter turns Battle Hunger into a ground-targeted spell, so no primary target is required. As a ground-targeted spell, it can debuff invisible enemies, and enemies inside the fog of war.","Choosing the damage upgrading talent immediately upgrades all of Axe's currently active Battle Hunger debuffs."],"mana":"50\/60\/70\/80","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"20\/15\/10\/5","name":"Battle Hunger","description":["Cast Animation: 0.3+0.5","Cast Range: 750","Radius: 0 ( 400)","Damage per Second: 16\/24\/32\/40 ( 136\/144\/152\/160)","Move Speed Slow: 12%","Self Move Speed Bonus: 12%","Enemy Damage Reduction: 0% ( 30%)","Duration: 12"],"hot_key":"W","legacy_key":"R"},{"spell":"When attacked, Axe performs a helix counter attack, dealing pure damage to all nearby enemies.","effects":["Ability Passive","Affects Enemies","Damage Pure"],"notes":["Can only proc when an enemy unit lands an attack on Axe, regardless of distance. This means it cannot proc on missed attacks.","Secondary attacks from Moon Glaives, Death Ward, Split Shot and Flak Cannon cannot trigger Counter Helix.","Can proc on the secondary attacks from other instant attacks.","Cannot proc on attacks from buildings, wards and allies.","Despite the visual effects, the damage is applied instantly within the radius.","Counter Helix uses pseudo-random distribution.","Counter Helix does not use a regular cooldown. It is neither displayed on the ability icon when proccing, nor is it affected by cooldown manipulating effects.","When the talent is chosen, the proc chance and cooldown are shared between the procs upon getting attacked and upon attacking."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0.45\/0.4\/0.35\/0.3","name":"Counter Helix","description":["Radius: 275","Proc Chance: 20%","Damage: 60\/100\/140\/180"],"hot_key":"E","legacy_key":"X"},{"spell":"Axe spots a weakness and strikes, instantly killing an enemy unit with low health, or dealing moderate damage otherwise. When an enemy hero is killed with Culling Blade, its cooldown is reset, and Axe and nearby allied units gain bonus movement speed.","effects":["Ability Target Unit","Affects Enemies \/ Allies","Damage Magical (HP Removal)"],"notes":["When the target's health is above the threshold, it only applies its regular damage (magical) and plays a different sound. Even when the target dies to the regular damage (possible with damage amplifications), the other effects of Culling Blade are not applied.","When the target's health is below the threshold, it does the following: It deals damage to the target equal to the health threshold value, in the form of pure damage (flagged as HP Removal). It applies the speed bonus to Axe and nearby allies. If the target was a hero, clone or illusion, its cooldown gets reset.","The target's health is checked upon reaching the cast point, so if it gained health during that time so it exceeds the health threshold, the cull fails.","Culling Blade is able to kill targets affected by Shallow Grave, False Promise and Battle Trance but not Wraith Delay."],"mana":"60\/120\/180","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"75\/65\/55","name":"Culling Blade","description":["Cast Animation: 0.3+0.5","Cast Range: 150","Kill Speed Bonus Radius: 900","Damage: 150\/250\/300","Kill Health Threshold: 250\/325\/400","Kill Move Speed Bonus: 30%","Kill Attack Speed Bonus: 30","Kill Bonus Duration: 6"],"hot_key":"R","legacy_key":"C"}],"bio":"As a grunt in the Army of Red Mist, Mogul Khan set his sights on the rank of Red Mist General. In battle after battle he proved his worth through gory deed. His rise through the ranks was helped by the fact that he never hesitated to decapitate a superior. Through the seven year Campaign of the Thousand Tarns, he distinguished himself in glorious carnage, his star of fame shining ever brighter, while the number of comrades in arms steadily dwindled. On the night of ultimate victory, Axe declared himself the new Red Mist General, and took on the ultimate title of 'Axe.' But his troops now numbered zero. Of course, many had died in battle, but a significant number had also fallen to Axe's blade. Needless to say, most soldiers now shun his leadership. But this matters not a whit to Axe, who knows that a one-man army is by far the best.","talentsTips":["The strength talent effectively grants Axe 160 health, 0.8 health regen, 0.64% magic resistance and 8 attack damage."],"trivia":["Axe's alternate\/fun name was \"Mogul Kahnt Touch This\", a reference to MC Hammer's famous song U Can't Touch This.","Axe, Disruptor, and Warlock are all related as they come from the Oglodi tribe.","Axe's phrase \"Better red than dead!\" is a reversed reference to an American Cold War slogan stating \"Better dead than Red\".","Several of Axe's deny and Culling Blade killing blow responses (such as \"You get nothing. Good day, sir!\") are references to Willy Wonka's infamous rage scene in the 1971 movie Willy Wonka & the Chocolate Factory.","Axe's name, lore and \"one-man army\" image may have been inspired by Khan Noonien Singh in the Star Trek series, who was also described as a \"one-man army\" and killed uncooperative subordinates (along with used-to wearing a red shirt).","Axe was the mascot of Dota 2, featuring only himself in several Dota 2 pages and game arts. This was removed in November 2013 for unknown reasons.","In The Lab, a VR game by Valve, there are some Bendies who wield Axe's war axe, along with other Dota 2 weapons like a Stout Shield, Huskar's spear and Legion Commander's sword."],"talents":["+120 Battle Hunger DPS:+100 Berserker's Call AoE","Attacking Procs Counter Helix:+25 Health Regen","+30 Movement Speed:+3 Mana Regen","+40 Attack Speed:+8 Strength"],"desc":"Mogul Khan, the Axe, is a melee strength hero, infamous for creating chaos in battle and thriving off of it."}