{"abilities":[{"spell":"Герой бросает вызов ближайшим врагам, заставляя их атаковать его, а также получает бонус к броне на время действия способности.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя"],"notes":["Затронутые юниты не могут использовать способности и предметы и вынуждены атаковать Axe. Юниты будут следовать и атаковать Axe вне зависимости от дистанции, обзора, препятствий и статуса. Затронутые юниты все так же могут быть подвержены другим обезвреживаниям и не получают свободного передвижения.","Если Axe станет невидимым во время провокации, затронутые юниты начнут атаковать ближайшего к ним врага. Если рядом врагов нет, то они останутся на месте. В это время они могут получить один приказ, исполнением которого они займутся. Этот приказ уже не может быть отменен. Приказ может любым, включая использование способности или предмета, передвижение или атаку. После этого приказа юнит больше не может ничего делать и стоит на месте пока провокация не закончится. Правда если Axe снова станет видимым, юниты вновь начнут его атаковать.","Провокация имеет одинаковый приоритет с Winter's Curse, но меньший чем Duel. Одинаковый приоритет означает, что затронутые юниты будут атаковать цель, которая первая использовала провокацию, и переключатся на другую цель, как только первая провокация завершилась. У провокации приоритет выше, чем у страха, при этом страх не дает юниту атаковать цель.","Действует на невидимых юнитов и юнитов в тумане войны. Не действует на башни, варды, неуязвимых и спрятанных юнитов.","Повторное применение способности на цель, уже находящуюся под её действием, обновляет длительность.","Если Axe умрет, эффект провокации мгновенно закончится.","Не действует на первую волну линейных крипов до встречи с волной противника."],"mana":"80\/90\/100\/110","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/14\/12\/10","name":"Berserker's Call","description":["Анимация применения: 0,4+0,5","Радиус: 300 ( 400)","Дополнительная броня: 30","Длительность: 2\/2.4\/2.8\/3.2"],"hot_key":"Q","legacy_key":"E"},{"spell":"Приводит врага в бешенство, замедляя его и нанося ему урон, пока он не убьет кого-нибудь или действие способности не закончится. Axe получает бонус к скорости передвижения за каждого юнита под воздействием этой способности.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Axe получает 12% к скорости передвижения за каждого пораженного врага. Эффекты складываются.","Повторное использование Battle Hunger на одну и ту же цель только обновляет длительность эффекта.","Добивание союзного юнита или уничтожение строения или варда убирает дебафф.","Использование способностей Death Pact, Devour, Demonic Conversion или Hand of Midas так же убирает дебафф. Исключением является Sacrifice.","Убийство иллюзий не избавляет от дебаффа.","Чтобы избавиться от дебаффа подверженные юниты должны совершить убийство сами. Призываемые существа или иллюзии под контролем того же игрока не избавляют от эффекта, если они совершат убийство.","Наносит урон основываясь на уровень способности во время применения. Улучшение способности после использования не обновляет значение урона на уже наложенные эффекты. Тем не менее изучение соответствующего таланта мгновенно обновляет значение урона на всех активных эффектах.","Наносит урон каждую секунду, спустя 1 секунду после применения, получая в итоге до 12 моментов нанесения урона.","Может нанести до 192\/288\/384\/480 ( 1632\/1728\/1824\/1920) урона, (без учета снижений).","С улучшением от Aghanim's Scepter способность напрямую уменьшает весь исходящий урон цели (включая урон от способностей)."],"mana":"50\/60\/70\/80","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/15\/10\/5","name":"Battle Hunger","description":["Анимация применения: 0,3+0,5","Дальность применения: 750","Урон в секунду: 16\/24\/32\/40 ( 136\/144\/152\/160)","Замедление скорости передвижения: 12%","Дополнительная скорость себе: 12%","Снижение урона: 0% ( 30%)","Длительность: 12"],"hot_key":"W","legacy_key":"R"},{"spell":"Герой отвечает на удары противников, нанося чистый урон всем врагам вокруг себя.","effects":["Способность Пассивная","Действует на Врагов","Урон Чистый"],"notes":["Срабатывает только когда вражеский юнит успешно завершает атаку на Axe вне зависимости от расстояния. Таким образом не срабатывает, если атака промахнется.","Не срабатывает при вторичных атаках от Moon Glaives, Death Ward, Split Shot и Flak Cannon.","Срабатывает при вторичных атаках от других мгновенных атак.","Не срабатывает при атаках строений, вардов и союзников.","Несмотря на визуальные эффекты, урон в радиусе наносится моментально.","Counter Helix использует псевдослучайное распределение.","Counter Helix использует нестандартную перезарядку. Ее время не показывается на иконке способности и не подвергается эффектам манипуляции временем перезарядки.","При выборе таланта шанс срабатывания и перезарядка делятся между шансами сработать при атаках самого героя и атаке по нему."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0,45\/0,4\/0,35\/0,3","name":"Counter Helix","description":["Радиус: 275","Шанс контратаки: 20%","Урон: 75\/110\/145\/180"],"hot_key":"E","legacy_key":"X"},{"spell":"Герой кидается на ослабшего противника, мгновенно убивая цель, если у неё низкий уровень здоровья. В ином случае удар нанесёт лишь небольшой урон. Герой и его союзники поблизости получат дополнительную скорость, а способность мгновенно восстановится, если ей убить вражеского героя.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический (Отнимающий здоровье)"],"notes":["Если уровень здоровья цели выше порога способности, наносится только обычный урон (магический) и проигрывается другой звук. Даже если цель умрет от этого урона (возможно с эффектами манипуляции урона), другие эффекты Culling Blade не накладываются.","Когда уровень здоровья цели ниже порога, происходит следующее: Наносится количество урона, равное количеству здоровья цели, в форме чистого урона (с пометкой отнимающий здоровье). Axe и близстоящие союзники получают бонус к скорости передвижения. Если целью был герой, клон или иллюзия, то перезарядка способности сбрасывается. При наличии Aghanim's Scepter, на всех вражеских героев (включая иллюзии и клонов) и крипов-героев в пределах радиуса действия накладывается Battle Hunger.","Уровень здоровья цели проверяется в момент окончания времени применения, так что если уровень здоровья поднялся выше порога за это время, мгновенного убийства не будет.","Если уровень здоровья цели ниже порога, Culling Blade может разрубить цель под действием Shallow Grave или False Promise, но не в форме призраков от Reincarnation"],"mana":"60\/120\/180","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"75\/65\/55","name":"Culling Blade","description":["Анимация применения: 0,3+0,5","Дальность применения: 150","Радиус ускорения: 900","Радиус применения Battle Hunger: 0 ( 700)","Урон: 150\/250\/300","Порог здоровья для убийства: 250\/325\/400","Доп. скорость передвижения: 30%","Доп. скорость атаки: 30","Длительность ускорения: 6"],"hot_key":"R","legacy_key":"C"}],"bio":"Ещё будучи рядовым бугаем в армии Красного тумана, Могул Хан положил глаз на генеральский титул. Битву за битвой он самыми кровавыми способами доказывал собственное превосходство. Облегчало подъём в чинах и то, что без тени сомнения он мог обезглавить старшего по званию. В семилетней кампании на Тысячеболотье Могул Хан отличился в кровопролитных бойнях, и звезда его славы засияла еще ярче, но число соратников неизменно сокращалось. В ночь безоговорочной победы он провозгласил себя генералом Красного тумана, присвоив себе заодно и титул верховного военачальника. Однако теперь в его отряде не значилось ни одного воина. Множество бойцов было повержено врагом, но и от его топора погибло достаточно. Стоит ли говорить, что большинство солдат теперь ни за что не переманить под его знамена? Но Могул Хана это совсем не смущает, ведь он знает: один в поле воин.","talentsTips":["Талант на силу в общем даёт Axe: 160"],"trivia":["Шутливое имя героя \"Mogul Kahnt Touch This\". Оно намекает на его способность Counter Helix и песню U Can't Touch This.","Axe, Disruptor и Warlock произошли из одного племени – Oglodi.","Одна из фраз Axe, которую он произносит после добивания своих крипов или убийства врага с помощью Culling Blade, \"Играть You get nothing. Good day, sir!\", взята из саркастического фильма 1971 года Вилли Вонка и шоколадная фабрика.","Имя Axe, его история и образ \"Человека-армии\" возможно были вдохновлены Ханом Нуньен Сингхом  из сериала Star Trek, который также был \"Человеком-армией\" и убивал дезертиров (кроме того он часто носил красную кофту).","Реплика Играть \"Better red than dead!\" это измененный лозунг времен Холодной войны \"Better dead than Red\"."],"talents":["+120 к урону в секунду от Battle Hunger:+100 к радиусу Berserker's Call","Counter Helix срабатывает от своих атак:+20 здоровья в секунду","+30 к скорости передвижения:+3 маны в секунду","+40 к скорости атаки:+8 к силе"],"tips":["В начале купите Stout Shield. Он дешевый и очень эффективен для вас. При необходимости, вы можете сражаться без своих крипов в лесу и даже сумеете убить вражеского героя-гангера. Ваш Counter Helix позволит убивать крипов очень быстро как на линии так и в лесу, а щит заблокирует часть нанесенных вам повреждений.","Такие предметы как Vanguard, Hood of Defiance и Shiva's Guard очень важны, так как позволяют Axe принять больше урона будучи танком и инициатором сражений.","Blade Mail просто незаменим в битве с противником! Ворвавшись в толпу противников с помощью Blink Dagger и использовав Berserker's Call вы практически заставите их убивать самих себя!","Blink Dagger - это необходимый предмет, который позволяет Axe инициировать драки.","Battle Hunger - лучшее средство против трусливых игроков: на четвёртом уровне способность уже наносит до 470 урона (с учётом 25% маг. сопротивления). Изменение скорости в вашу пользу позволит догнать убегающего врага и убить с помощью Culling Blade. Прочность Axe позволяет не обращать внимания на башни, особенно если есть Vanguard. Максимальное расстояние применения — 900.","Counter Helix - чем больше вас бьют вражеские юниты, тем чаще будет срабатывать способность. Способность не может быть активирована атаками осадных крипов, башен, а также Plague Ward и Death Ward. Используется псевдослучайное срабатывание и срабатывает у иллюзий героя.","Смертельный удар от Culling Blade снимает все эффекты с цели, перед тем как убьёт её. Это касается и героев, находящихся под действием Shallow Grave. Culling Blade также мгновенно убьет вражеского курьера, однако, в отличие от вражеских героев, после убийства курьера начнется перезарядка способности. Рошан также может быть убит этой способностью","Если Axe умрет во время использования Berserker's Call, то эффект моментально спадёт с врагов.","Blink Dagger лучше брать перед Vanguard, в идеале, к 10 минуте. Blink Dagger повышает эффективность ганков и позволяет убивать слабых героев почти мгновенно."],"desc":"%"}