{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Mask_of_Madness_Berserk.mp3\/revision\/latest?cb=20191227195455",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Does not interrupt the user's channeling spells upon cast."
      ],
      "mana": "25",
      "abilityName": "Berserk",
      "cooldown": "16",
      "description": "Gives 110 attack speed and 30 movement speed, but reduces your armor by 8 and silences you. Lasts 6 seconds.",
      "params": [
        "Attack Speed Bonus: 110",
        "Move Speed Bonus: 30",
        "Armor Reduction: 8",
        "Duration: 6",
        "Silence and armor reduction persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Stacks additively with other sources of lifesteal.",
        "Cannot lifesteal off of wards, buildings and allied units."
      ],
      "mana": null,
      "abilityName": "Lifesteal",
      "cooldown": null,
      "description": "Heals the attacker for 20% of attack damage dealt.",
      "params": [
        "Lifesteal: 20%",
        "Lifesteal particles are visible on illusions, but they do not gain health from their attacks."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1775",
  "lore": null,
  "consistFrom": [
    "Morbid Mask",
    "Quarterstaff"
  ],
  "boughtFrom": "Accessories",
  "name": "Mask of Madness",
  "description": "Once this mask is worn, its bearer becomes an uncontrollable aggressive force.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 Attack Damage",
    "+10 Attack Speed"
  ],
  "tips": [
    "Mask of Madness is the most cost-effective DPS and Attack Speed item in the game, costing only 14.79 gold per point of attack speed. The second best DPS item is the Diffusal Blade for an agility hero.",
    "Use your abilities before activating the Mask of Madness, particularly if you have a disable such as a stun. The active is extremely useful while farming. Taking more physical damage is negligible when simply running between lanes or hitting lane or jungle creeps, especially when the item itself provides sustain by its lifesteal.",
    "The active is extremely useful while farming. Taking more physical damage is negligible when simply running between lanes or hitting lane or jungle creeps, especially when the item itself provides sustain by its lifesteal.",
    "In general, an early Mask of Madness is more useful for farming than fighting. Without other damage and survivability items to back it up, the lifesteal alone will not be enough to sustain you in a teamfight.",
    "Mask of Madness can be disassembled in later stages of the game to help a hero build a Butterfly, an Echo Sabre or an Orchid Malevolence from the Quarterstaff and a Vladmir's Offering or a Satanic from the Morbid Mask."
  ]
}