{
  "abilities": [
    {
      "effects": [
        "Уменьшение сопротивления магии: 40%",
        "Длительность: 4"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца.",
        "Снижает общее сопротивление магии большинства героев до -5%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления. Снижает общее сопротивление магии Visage до -26%, учитывая его базовое сопротивление в 10% и не учитывая другие источники сопротивления.",
        "Уменьшение сопротивления магии от Ghost Form не сочетается с другими эффектами призрачной формы, так как у предмета более высокий приоритет.",
        "Имеет общую перезарядку с Ethereal Blade."
      ],
      "elements": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "name": "Ghost Form",
      "description": "Придаёт владельцу бесплотную форму, в которой он полностью защищён от физического урона, но не может атаковать и получает на 40% больше магического урона. Действует 4 сек."
    }
  ],
  "cost": "1500",
  "description": "На время переносит сущность владельца в мир духов, что защищает его от всех физических атак.",
  "further": [
    "Ethereal_Blade"
  ],
  "attrs": [
    "Активируемая Ghost Form",
    "Бонус +5 к силе +5 к ловкости +5 к интеллекту",
    "Можно разобрать? Нет",
    "Можно сообщать? Нет"
  ],
  "info": [
    "Для героев силы, даёт 112,5 здоровья, 0,63 регенерации здоровья, 0,5% сопротивления магии, 0,8 брони, 5 скорости атаки, 0,25% скорости передвижения, 60 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки.",
    "Для героев ловкости, даёт 90 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 1 брони, 6,25 скорости атаки, 0,31% скорости передвижения, 60 маны, 0,25 регенерации маны, 0,35% урона от способностей и 5 урона от атаки.",
    "Для героев интеллекта, даёт 90 здоровья, 0,5 регенерации здоровья, 0,4% сопротивления магии, 0,8 брони, 5 скорости атаки, 0,25% скорости передвижения, 75 маны, 0,31 регенерации маны, 0,44% урона от способностей и 5 урона от атаки."
  ]
}