{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+4% к здоровью для убийства от Ice Blast",
          "talentRight": "Cold Feet применяется по области радиусом 450"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+80 к урону от Chilling Touch",
          "talentRight": "−6% к скорости и сопротивлению от Ice Vortex"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+200 к расстоянию разрыва у Cold Feet",
          "talentRight": "−2 сек. перезарядки Ice Vortex"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8% к урону от заклинаний",
          "talentRight": "+200 дальность атаки от Chilling Touch"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Cold_Feet.mp3\/revision\/latest?cb=20161105140817",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на область)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Применение Cold Feet помечает цель негативным эффектом и отмечает её текущее местоположение ледяной отметкой.",
        "Пока цель находится в пределах 715 (TagTalent 915) единиц от отметки, она получает урон от дебаффа и спустя 4 секунды будет оглушена.",
        "Если цель отойдет на расстояние, превышающее 715 (TagTalent 915) единиц, пока действует дебафф, заклинание перестанет работать и снимет дебафф и отметку. То есть, при возвращении цели обратно к месту применения, она больше не получит оглушение или урон.",
        "То есть, при возвращении цели обратно к месту применения, она больше не получит оглушение или урон.",
        "Cold Feet нельзя применить на юнитов, которые уже находятся под действием модификатора Cold Feet или Coldfeet Freeze.",
        "Наносит урон с интервалом в 1 секунду, начиная сразу после применения, срабатывая 4 раза.",
        "Оглушение срабатывает спустя 1 секунду после последнего нанесенного урона.",
        "Может нанести до 120\/200\/280\/360 единиц урона (до учета сопротивления)."
      ],
      "mana": "125",
      "hotKey": "Q",
      "cooldown": "12\/11\/10\/9",
      "description": "Накладывает на врага морозное заклятие, отчего тот получает периодический урон. Эффект развеется, если цель отойдёт достаточно далеко от точки применения способности. В противном случае через 4 секунды цель будет оглушена и приморозится к месту.",
      "spellName": "Cold Feet",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения: 700\/800\/900\/1000",
        "Радиус: 0 (TagTalent 450)",
        "Дистанция разрыва: 715 (TagTalent 915)",
        "Периодический урон: 30\/50\/70\/90",
        "Длительность урона: 4",
        "Длительность оглушения: 2\/2,5\/3\/3,5",
        "Снимает с себя дебафф от способности.",
        "Блокируется при использовании. Не блокируется при превращении в заклинание, направленное на область."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3d\/Ice_Vortex.mp3\/revision\/latest?cb=20180510140423",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Все эффекты работают как аура. Модификатор задерживается на 0,5 секунды. Аура использует только один модификатор.",
        "Способность снижает сопротивление магии героев до 16%\/13%\/10%\/7% (TagTalent 12%\/9%\/5%\/2%), считая 0.25 за базовое сопротивление магии и не учитывая другие источники сопротивления.",
        "Несколько применений Ice Vortex не складываются. На юнита будет действовать только один из них, даже если они все находятся в одном месте.",
        "Дает наземный обзор в радиусе 200 единиц в области применения на всё время действия.",
        "Выбор таланта на снижение перезарядки способностей не влияет на текущее время перезарядки.",
        "Выбор таланта на снижение сопротивления сразу же обновит показатели всех существующих на момент выбора Ice Vortex, включая уже сработавший от них дебафф.",
        "Абсолютно каждому юниту, который будет находиться в области действия этой способности будет дана возможность проходить сквозь других."
      ],
      "mana": "40\/55\/70\/85",
      "hotKey": "W",
      "cooldown": "4 (TagTalent 2)",
      "description": "Создает вихрь ледяной энергии, который замедляет скорость передвижения и понижает сопротивление магии в зоне действия в течение 12%\/16%\/20%\/24% секунд.",
      "spellName": "Ice Vortex",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения: 1500",
        "Радиус: 275",
        "Замедление скорости передвижения: 15%\/20%\/25%\/30% (TagTalent 21%\/26%\/31%\/36%)",
        "Замедление скорости атаки: 0 (TagTalent 20)",
        "Снижение сопротивления магии: 12%\/16%\/20%\/24% (TagTalent 18%\/22%\/26%\/30%)",
        "Урон в секунду: 0 (TagTalent 40)",
        "Длительность задержки ауры: 0,5",
        "Длительность: 16",
        "Ice Vortex наносит 40 урона в секунду и уменьшает скорость атаки на 20.",
        "Замедление и снижение магического сопротивления остаются, если дебафф был применен до неуязвимости к магии и не был ранее развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f2\/Chilling_Touch.mp3\/revision\/latest?cb=20141212181735",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Дальность применения равна дальности атаки заклинателя плюс дополнительная дальность. Для Ancient Apparition она равна 735\/795\/855\/915.",
        "Урон от способности считается как отдельный источник урона и учитывается как урон заклинаний. То есть эта атака не учитывается любыми источниками, действующими на урон от атаки. Также на атаку действуют усиление урона заклинаний и вампиризм заклинаний.",
        "То есть эта атака не учитывается любыми источниками, действующими на урон от атаки.",
        "Также на атаку действуют усиление урона заклинаний и вампиризм заклинаний.",
        "Дебаффы от нескольких применений складываются, создавая каждый раз отдельный дебафф.",
        "Атака сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "30\/45\/60\/75",
      "hotKey": "E",
      "cooldown": "15\/11\/7\/3 (TagTalent 0)",
      "description": "Усиливает атаки владельца, отчего они наносят значительный магический урон и замедляют жертв. Увеличивает дальность таких атак.",
      "spellName": "Chilling Touch",
      "params": [
        "Анимация применения: 0,01+0",
        "Дополнительная дальность атаки: 60\/120\/180\/240",
        "Урон: 50\/90\/130\/170 (TagTalent 130\/170\/210\/250)",
        "Снижение скорости передвижения: 100%",
        "Длительность замедления: 0.5",
        "Убирает перезарядку.",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/74\/Ice_Blast.mp3\/revision\/latest?cb=20141212181830",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Вражеских героев",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "После использования Ice Blast заменяется навыком Release.",
        "Выпущенный снаряд летит со скоростью 1500 единиц до применения Release, смерти Ancient Apparition или вылета за пределы карты.",
        "Снаряд невидимый и не отображается для врагов. При наличии True Sight враги могут заметить снаряд в виде точки на миникарте.",
        "Невидимость также вызывает стандартный эффект ударной волны, как от некоторых источников невидимости, которые видны врагам с помощью True Sight.",
        "Пролетающий снаряд не наносит урон и не применяет дебафф.",
        "Радиус взрыва начинается с 275 единиц и увеличивается на 50 с каждой секундой полета, пока не достигнет радиуса в 1000 единиц. Требуется 15 секунд для достижения максимального радиуса взрыва, что равняется 22500 пройденным единицам.",
        "Требуется 15 секунд для достижения максимального радиуса взрыва, что равняется 22500 пройденным единицам.",
        "Снаряд дает летающий обзор в радиусе 500 единиц в момент полета.",
        "Дебафф работает на героев, клонов и крипов-героев, но не на иллюзии.",
        "Дебафф также работает на неуязвимых существ или существ с иммунитетом к магии, но не на спрятанных юнитов.",
        "В отличии от дебаффа, урон от взрыва наносится всем вражеским юнитам, включая крипов, но не на постройки и варды.",
        "Дебафф блокирует текущий уровень здоровья задетых юнитов, и не дает его восстанавливать каким-либо способом. Исключениями являются Sunder, Decay, Time Lapse, Morph Replicate, Supernova и Whirling Death.",
        "Юниты под действием дебаффа умрут, если значение их здоровья упадет ниже порога процента для убийства. Убийство приписывается тому источнику урона, чей урон привел показатель здоровья цели ниже требуемого порога. Но если урон был нанесен герою собой же, убийство будет засчитано Ancient Apparition.",
        "Но если урон был нанесен герою собой же, убийство будет засчитано Ancient Apparition.",
        "Shallow Grave не позволяет существам умереть от действия дебаффа, пока действует сама способность. Неуязвимые существа не могут разбиться.",
        "Дебафф наносит урон с интервалом в 1 секунду, начиная спустя 1 секунду после применения дебаффа, действия 10\/11\/12 раз.",
        "Дебафф может нанести до 125\/220\/384 единиц урона (до учета сопротивления).",
        "Вместе с взрывом Ice Blast может нанести до 375\/545\/784 единиц урона (до учета сопротивления)."
      ],
      "mana": "175",
      "hotKey": "R",
      "cooldown": "60\/50\/40",
      "description": "Отправляет снаряд в направлении выбранной точки на карте. Повторное применение запускает ледяной шар, который взорвётся там, где находился снаряд на момент активации. Чем дальше он пролетит, тем больше будет радиус взрыва. У врагов, которые оказались в радиусе взрыва или на пути ледяного шара, застывает кровь, что делает невозможным лечение или регенерацию. Если здоровье поражённых целей упадет ниже определённого уровня, они мгновенно разобьются на осколки.",
      "spellName": "Ice Blast",
      "params": [
        "Анимация применения: 0,01+1,07",
        "Дальность применения: Глобальная",
        "Радиус шара: 275",
        "Минимальный радиус взрыва: 275",
        "Максимальный радиус взрыва: 1000",
        "Урон от взрыва: 250\/325\/400",
        "Периодический урон: 12.5\/20\/32",
        "Процент здоровья для убийства: 12%\/13%\/14% (TagTalent 16%\/17%\/18%)",
        "Длительность: 10\/11\/12"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Release_%28Ice_Blast%29.mp3\/revision\/latest?cb=20141212181901",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Ice Blast после его применения.",
        "Имеет моментальное время примения, но прерывает произнесение способностей Ancient Apparition.",
        "При использовании останавливает полет снаряда и отмечает общую площадь поражения взрывом, который произойдет, когда ледяной шар достигнет своей позиции.",
        "Также дает летающий обзор в радиусе 650 единиц в конечной позиции на 4 секунды.",
        "Ледяной шар летит со скоростью 750 единиц или достигает конечной точки спустя 1,75 секунды после запуска, в зависимости от того, что произойдет быстрее.",
        "Ледяной шар выпускается только при применении Release или при смерти Ancient Apparition, когда снаряд ещё в полете.",
        "Шар не вылетит, если снаряд вылетит за пределы карты; в таком случае способность будет потрачена в никуда.",
        "Любой юнит, попавший в радиус полета шара в 275 единиц или под его взрыв, получит негативный эффект заморозки.",
        "Ледяной шар полностью виден врагам. Но, в отличии от снаряда, он не отображается на миникарте.",
        "Ледяной шар при полете дает летающий обзор в радиусе 500 единиц, который длится 3 секунды."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Запускает стремительный ледяной шар в выбранное местоположение.",
      "spellName": "Release",
      "params": [
        "Анимация применения: 0,01+1,1",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.9,
    "attrStrength": 20.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.4,
    "attrAgilityInc": 2.2,
    "attrAgility": 20.0
  },
  "description": "Ancient Apparition — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первой способностью Cold Feet Ancient Apparition пытается заморозить врага, в результате чего тот начинает получать периодической урон. Заклятие может быть развеяно, если цель выйдет из зоны действия; в противном случае через определенное время враг будет оглушен и приморожен к месту. Второй способностью Ice Vortex герой создает вихрь, который замедляет скорость передвижения и понижает сопротивление магии в зоне действия. Третьей способностью Chilling Touch выпускает ледяной шар который сильно замедляет врага на короткий промежуток времени. Ультимативная способность Ice Blast запускает снаряд в направлении выбранной точки на карте. Способность нужно повторно активировать, чтобы запустить ледяной шар, который взорвется там, где находился первый снаряд на момент активации. Чем дальше он пролетит, тем больше будет радиус взрыва. У врагов, которые оказались в радиусе взрыва или на пути ледяного шара, застывает кровь, что делает невозможным лечение или регенерацию. Если здоровье пораженных целей упадет ниже определенного уровня, они мгновенно разобьются на осколки. Улучшение Aghanim's Scepter убирает перезарядку третьей способности Chilling Touch .",
  "history": "Древний дух Калдр — образ, скрытый за пределами времени. Он возник из холодной, бесконечной пустоты, что предшествует вселенной и ждет её конца. Калдр был, Калдр есть, Калдр будет... И та его мощь, что мы видим в нашем мире, — лишь слабое увядшее эхо настоящего, вечного Калдра. Говорят, что чем древнее космос и чем ближе его конец, тем страшнее будет могущество Калдра, и иссякающая вечность принесёт духу молодость и силу. И тогда его ледяная хватка остановит всё сущее, и образ его начнёт источать ужасающее сияние; и он больше не будет всего лишь духом.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+4% к здоровью для убийства от Ice Blast",
      "talentRight": "Cold Feet применяется по области радиусом 450"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+80 к урону от Chilling Touch",
      "talentRight": "−6% к скорости и сопротивлению от Ice Vortex"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+200 к расстоянию разрыва у Cold Feet",
      "talentRight": "−2 сек. перезарядки Ice Vortex"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8% к урону от заклинаний",
      "talentRight": "+200 дальность атаки от Chilling Touch"
    }
  ]
}