{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Лучи от Eclipse оглушают на 0,2 сек.",
          "talentRight": "+35 к урону от Lunar Blessing"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 к урону от Lucent Beam",
          "talentRight": "Неограниченная дальность действия Lunar Blessing"
        },
        {
          "talentLvl": "15",
          "talentLeft": "−20 сек. перезарядки Eclipse",
          "talentRight": "−3,5 сек. перезарядки Lucent Beam"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0,4 сек. оглушения от Lucent Beam",
          "talentRight": "−8% снижения урона за отскок у Moon Glaives"
        }
      ]
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический Мгновенная атака"
      ],
      "notes": [
        "Lucent Beam сначала наносит урон, затем применяет дебафф.",
        "Оружие героя во время анимации применения выпускает немного частиц, видимых всем.",
        "С Aghanim's Shard, Lucent Beam можно применить на землю. При выборе точки на земле для поражения невидимого или находящегося в тумане врага не нужны обзор или True Sight. При выборе точки на земле способность ищет вражеских героев, иллюзии и крипов-героев. Другие существа игнорируются. Это означает, что если в радиусе поиска нет врага, Lucent Beam не нанесет урона. При применении на землю даёт наземный обзор в радиусе 300 на 3 секунды.",
        "При выборе точки на земле для поражения невидимого или находящегося в тумане врага не нужны обзор или True Sight.",
        "При выборе точки на земле способность ищет вражеских героев, иллюзии и крипов-героев. Другие существа игнорируются.",
        "Это означает, что если в радиусе поиска нет врага, Lucent Beam не нанесет урона.",
        "При применении на землю даёт наземный обзор в радиусе 300 на 3 секунды.",
        "С Aghanim's Shard, Lucent Beam применяет 1 мгновенную атаку по случайной цели в радиусе 500 вокруг луча. Могут сработать любые модификаторы атаки и эффекты от удара (включая Moon Glaives). Эта атака может промахнуться, но она игнорирует обезоруживание. Цель в радиусе выбирается случайно без каких-либо приоритетов. Не может атаковать невидимых существ, но может атаковать в существ в тумане войны. Мгновенные атаки исходят от выбранной точки или существа. При применении на землю, атака исходит из выбранной точки, даже если луч поразил вражеского героя.",
        "Могут сработать любые модификаторы атаки и эффекты от удара (включая Moon Glaives). Эта атака может промахнуться, но она игнорирует обезоруживание.",
        "Цель в радиусе выбирается случайно без каких-либо приоритетов.",
        "Не может атаковать невидимых существ, но может атаковать в существ в тумане войны.",
        "Мгновенные атаки исходят от выбранной точки или существа.",
        "При применении на землю, атака исходит из выбранной точки, даже если луч поразил вражеского героя."
      ],
      "mana": "90\/100\/110\/120 (TagTalent 40\/50\/60\/70)",
      "hotKey": "Q",
      "cooldown": "9\/8\/7\/6 (TagTalent 5,5\/4,5\/3,5\/2,5)",
      "description": "Направляет во врага луч лунной энергии, нанося урон и ненадолго оглушая его.",
      "spellName": "Lucent Beam",
      "params": [
        "Анимация применения: 0,4+0,47",
        "Дальность применения: 800",
        "Урон: 75\/150\/225\/300 (TagTalent 175\/250\/325\/400)",
        "Длительность оглушения: 0,8 (TagTalent 1,2)",
        "Радиус поиска врага: 325",
        "Радиус поиска врага для атаки: 500",
        "Количество атак: 1",
        "Позволяет применить способность на точку, чтобы ударить лучом по врагу в радиусе 325 вокруг неё и совершить атаку по случайной цели в радиусе 500 вокруг луча. Уменьшает расход маны на 50.",
        "Блокируется даже при применении способности на точку."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3c\/Luna_Moon_Glaives.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Отскочившие глефы летят со скоростью 900 (с той же скоростью, что и снаряд атаки героя).",
        "Moon Glaives срабатывают только при успешном попадании снаряда в цель. То есть при промахе или избегании атаки способность не сработает.",
        "Несмотря на описание способности, её эффекты считаются за пассивное заклинание, а не за атаки.",
        "Вопреки тому, как выглядит способности, её эффекты считаются пассивным заклинанием, а не обычной атакой. То есть кроме того, что урон рассчитывается от урона Luna и срабатывает от её атак, способность ничего не делает с атаками. Урон от отскочивших глеф считается за урон заклинаний, при этом они игнорируют усиление урона заклинаний и не используют вампиризм заклинаний. На глефы не срабатывают никакие модификаторы атаки и они не считаются атаками для эффектов, срабатывающих от атаки (например, Retaliate). Также глефы игнорируют уклонение. При этом блокировка урона уменьшает их урон.",
        "То есть кроме того, что урон рассчитывается от урона Luna и срабатывает от её атак, способность ничего не делает с атаками.",
        "Урон от отскочивших глеф считается за урон заклинаний, при этом они игнорируют усиление урона заклинаний и не используют вампиризм заклинаний.",
        "На глефы не срабатывают никакие модификаторы атаки и они не считаются атаками для эффектов, срабатывающих от атаки (например, Retaliate).",
        "Также глефы игнорируют уклонение. При этом блокировка урона уменьшает их урон.",
        "Можно избежать отскочившие глефы. Существо, избежавшее снаряд, не учитывается, поэтому глефа может немедленно отскочить от него снова, если оно окажется в радиусе отскоков.",
        "Отскок, которого избежали, считается произведенным, поэтому он уменьшает число оставшихся отскоков и урон следующего.",
        "Урон глефов зависит от урона запустившей их атаки и рассчитывается в начале атаки. То есть они взаимодействуют с критическим ударом и Quell, поскольку эффекты учитываются при расчете начального урона. Также неважно, сколько урона фактически получила цель, поскольку расчет происходит до попадания снаряда. При этом остальные бонусы к урону не учитываются (например, срабатывание Javelin), поскольку их урон наносится после урона атаки.",
        "То есть они взаимодействуют с критическим ударом и Quell, поскольку эффекты учитываются при расчете начального урона.",
        "Также неважно, сколько урона фактически получила цель, поскольку расчет происходит до попадания снаряда.",
        "При этом остальные бонусы к урону не учитываются (например, срабатывание Javelin), поскольку их урон наносится после урона атаки.",
        "С учетом всех отскоков, увеличивает урон Luna на 71,88%\/93,75%\/120,26%\/153,89% (TagTalent 93,1%\/122,47%\/158,69%\/205,88%).",
        "Может отскочить обратно в тех же существ, если способность поразит других ближайших. Если поблизости нет существ, способность ничего не сделает. Не может отскочить во врагов в тумане войны.",
        "Глефы не перескакивают на варды и союзников, но при атаке могут от них отскочить. Действует на постройки.",
        "При изучении оружие героя начинает выделять голубые частицы, видимые всем."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Заклинает глефы героя, позволяя им отскакивать по нескольким врагам. Каждый следующий отскок наносит меньше урона.",
      "spellName": "Moon Glaives",
      "params": [
        "Радиус отскоков: 500",
        "Отскоков: 3\/4\/5\/6",
        "Снижение урона за отскок: 56%\/50%\/44%\/38% (TagTalent 48%\/42%\/36%\/30%)"
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "При изучении Luna испускает очень слабые пульсирующие частицы.",
        "Увеличивает ночной обзор героя до 1050\/1300\/1550\/1800.",
        "Бафф ауры задерживается на 0,5 сек.",
        "Действует на неуязвимых и спрятанных существ.",
        "Вопреки описанию, Lunar Blessing так же действует на существ не-героев."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Повышает урон от атак владельца способности и союзных героев неподалёку. Также наделяет улучшенным ночным зрением.",
      "spellName": "Lunar Blessing",
      "params": [
        "Радиус: 1200 (TagTalent Глобальная)",
        "Дополнительный обзор ночью: 250\/500\/750\/1000",
        "Дополнительный урон от атаки: 5\/15\/25\/35 (TagTalent 40\/50\/60\/70)",
        "Длительность задержки ауры: 0,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "L",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5d\/Luna_Eclipse_1.mp3\/revision\/latest?cb=20191216015818",
      "effects": [
        "Способность Ненаправленная (TagAghanim Направленная на существо \/ Направленная на область)",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Лучи наносят урон в соответствии с текущим уровнем Lucent Beam; если способность не изучена, Eclipse не будет наносить урона.",
        "Eclipse превращает день в ночь на 10 секунд. Смена не связана с длительностью способности. Не мешает ночи, вызванной Dark Ascension, поэтому ночь, вызванная Night Stalker, не приостанавливается. Приоритет ночи от способности ниже, чем у дня, вызванного Supernova.",
        "Не мешает ночи, вызванной Dark Ascension, поэтому ночь, вызванная Night Stalker, не приостанавливается.",
        "Приоритет ночи от способности ниже, чем у дня, вызванного Supernova.",
        "Не поражает невидимых существ и существ в тумане войны.",
        "Оружие героя во время анимации применения испускает немного частиц, видимых для всех.",
        "Несколько применений (с и без Aghanim's Scepter) действуют независимо друг от друга.",
        "При смерти героя Eclipse прерывается. При этом 10-секундная ночь продолжается.",
        "Максимальный возможный урон по одной цели (до уменьшений): Уровень 1: 375 (TagTalent 875) (TagTalent 450\/900\/1350, 1050\/2100\/3150) Уровень 2: 750 (TagTalent 1250) (TagTalent 900\/1800\/2700, 1500\/3000\/4500) Уровень 3: 1125 (TagTalent 1625) (TagTalent 1350\/2700\/4050, 1950\/3900\/5850) Уровень 4: 1500 (TagTalent 2000) (TagTalent 1800\/3600\/5400, 2400\/4800\/7200)",
        "Уровень 1: 375 (TagTalent 875) (TagTalent 450\/900\/1350, 1050\/2100\/3150)",
        "Уровень 2: 750 (TagTalent 1250) (TagTalent 900\/1800\/2700, 1500\/3000\/4500)",
        "Уровень 3: 1125 (TagTalent 1625) (TagTalent 1350\/2700\/4050, 1950\/3900\/5850)",
        "Уровень 4: 1500 (TagTalent 2000) (TagTalent 1800\/3600\/5400, 2400\/4800\/7200)",
        "При выборе таланта 25 уровня каждый луч также будет оглушать пораженных врагов на 0,2 сек. В отличии от урона оглушение применяется независимо от текущего уровня Lucent Beam, так как оно не связано с оглушением способности. Талант мгновенно применяет эффект, поэтому лучи уже активированной способности будут оглушать. Лучи сначала наносят урон, затем применяют дебафф.",
        "В отличии от урона оглушение применяется независимо от текущего уровня Lucent Beam, так как оно не связано с оглушением способности.",
        "Талант мгновенно применяет эффект, поэтому лучи уже активированной способности будут оглушать.",
        "Лучи сначала наносят урон, затем применяют дебафф.",
        "При улучшении Aghanim's Scepter позволяет применять способность на область или любое союзное существо. ↓↓ Двойное нажатие применяет способность на себя. Может выбрать целью любое союзное существо, за исключением вардов и строений. При улучшении и применении на союзника способность прервется при смерти союзника. При улучшении и применении на землю способность прервется при смерти Luna. Даёт наземный обзор в радиусе 675 единиц на всю длительность в случае, если существо не было выбрано.",
        "↓↓ Двойное нажатие применяет способность на себя.",
        "Может выбрать целью любое союзное существо, за исключением вардов и строений.",
        "При улучшении и применении на союзника способность прервется при смерти союзника.",
        "При улучшении и применении на землю способность прервется при смерти Luna.",
        "Даёт наземный обзор в радиусе 675 единиц на всю длительность в случае, если существо не было выбрано."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "140\/130\/120 (TagTalent 120\/110\/100)",
      "description": "Бьёт случайных врагов неподалёку лучами от способности Lucent Beam текущего уровня. Лучи не оглушают и могут ударить по одному существу ограниченное число раз. Также способность на 10 сек. превращает день в ночь.",
      "spellName": "Eclipse",
      "params": [
        "Анимация применения: 0,5+0,37",
        "Радиус: 675",
        "Всего лучей: 6\/9\/12 (TagAghanim 6\/12\/18)",
        "Макс. лучей на существо: 5 (TagAghanim 6\/12\/18)",
        "Интервал лучей: 0,6 (TagAghanim 0,3)",
        "Длительность: 2,4\/4,2\/6 (TagAghanim 1,5\/3,3\/5,1)",
        "Длительность оглушения за луч: 0,2",
        "Дальность применения: 2500",
        "Позволяет применять способность на область или любое союзное существо, чтобы она действовала вокруг него. Увеличивает число лучей и длительность способности, снимает ограничение на число срабатываний по одному существу и уменьшает интервал между ударами в два раза."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 3.4,
    "attrAgility": 24.0
  },
  "description": "Luna — это герой с дальним типом атаки, основным атрибутом которого является ловкость. Ее первая способность, Lucent Beam, направляет сконцентрированный луч лунной энергии во врага, нанося урон и оглушая его. Первая пассивная способность, Moon Glaives, позволяет атакам Luna отскакивать на врагов рядом с основной целью. Каждый следующий отскок наносит меньше урона. Вторая пассивная способность, Lunar Blessing, повышает основный атрибут Luna и окружающих её союзников, а также наделяет героя улучшенным ночным зрением. Ультимативная способность, Eclipse, призывает несколько Lucent Beams, которые бьют врагов рядом с Luna, основываясь на уровне первой способности. Любая цель не может получить больше определенного количества ударов. Также способность на 10 секунд превращает день в ночь. Улучшение с Aghanim's Scepter позволяет использовать способность на любом союзном юните или точке, чтобы способность действовала вокруг них, или на области. Также увеличивает количество лучей, максимальное число ударов по юниту, их частоту и длительность способности.",
  "history": "Как она опустилась до такого? Бич равнин, беспощадный повелитель людей и зверей, она могла сеять страх там, где ей вздумается. Теперь она была далеко от своей родины, на грани безумия от голода и месяцев скитаний, а её армия либо была давно мертва, либо их настигла участь хуже смерти. Едва она преступила границу древнего леса, в темноте блеснул пылающий взор. Что-то красивое и смертельное искало себе добычу в увядающих сумерках. Бесшумно оно развернулось и ушло. Ей завладела ярость. Схватив ржавый кинжал, она ринулась вслед за зверем, в надежде вернуть хотя бы частичку былой славы, но добыча все ускользала от неё. Три раза она загоняла зверя в угол, и три раза она нападала, но видела лишь ускользающую в леса тень. Освещая все вокруг, взошла полная луна, и отследить зверя стало легче. Достигнув светлой вершины холма, огромная кошка, более не скрываясь, сидела в ожидании. Когда женщина стала размахивать кинжалом, зверь поднялся, взревел и кинулся на неё. Казалось, смерть наконец настигла её. Но она спокойно остановилась. Через мгновение зверь выбил кинжал из её рук и исчез в лесу. Тишина. Фигуры в капюшонах приблизились к ней. В почтительных тонах они поведали, что Селемине, Богиня Луны выбрала её, вела её и испытала её. Невольно она выполнила священный ритуал Темной Луны, воинов Серебряных лесов. Ей предложили выбор: присоединиться к Темной Луне и поклясться служить Селемине или уйти и никогда не возвращаться. Она не колебалась. Принимая своё освобождение, она отказалась от кровавого прошлого, и с тех пор её имя — Luna, устрашающая лунная наездница, беспощадная и непоколебимая защитница Серебряных лесов.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Лучи от Eclipse оглушают на 0,2 сек.",
      "talentRight": "+35 к урону от Lunar Blessing"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 к урону от Lucent Beam",
      "talentRight": "Неограниченная дальность действия Lunar Blessing"
    },
    {
      "talentLvl": "15",
      "talentLeft": "−20 сек. перезарядки Eclipse",
      "talentRight": "−3,5 сек. перезарядки Lucent Beam"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0,4 сек. оглушения от Lucent Beam",
      "talentRight": "−8% снижения урона за отскок у Moon Glaives"
    }
  ]
}