{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на точку"
      ],
      "notes": [
        "Iron Branch расходуется в процессе.",
        "Нельзя поставить внутри области фонтана (включая маленькую область перед подъёмом на базу), или в логове Рошана.",
        "Создаёт обычное дерево в указанной точке. Дерево меньше, чем другие деревья на карте, и имеет меньший размер столкновения.",
        "Созданное дерево, как и любое другое дерево, блокирует обзор и используется всеми способностями, которые взаимодействуют с деревьями.",
        "Tango лечит вдвое дольше, если его использовать на дерево с Iron Branch.",
        "Частицы вокруг дерева видны всем, указывая на то, что это посаженое дерево."
      ],
      "mana": null,
      "abilityName": "Plant Tree",
      "cooldown": "0",
      "description": "Сажает в указанное место маленькое счастливое деревце, которое исчезнет через 20 секунд.",
      "params": [
        "Дальность применения: 400",
        "Время жизни деревца: 20"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Для героев силы, даёт 20 здоровья, 0,1 регенерации здоровья, 0,17 брони, 1 скорости атаки, 12 маны, 0,05 регенерации маны и 1 урона от атаки.",
    "Для героев ловкости, даёт 20 здоровья, 0,1 регенерации здоровья, 0,17 брони, 1 скорости атаки, 12 маны, 0,05 регенерации маны и 1 урона от атаки.",
    "Для героев интеллекта, даёт 20 здоровья, 0,1 регенерации здоровья, 0,17 брони, 1 скорости атаки, 12 маны, 0,05 регенерации маны и 1 урона от атаки.",
    "Iron Branch не складывается в инвентаре."
  ],
  "cost": "50",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Атрибуты",
  "name": "Iron Branch",
  "description": "Обычная, казалось бы, веточка дарует владельцу стойкость железного дерева, с которого она срублена.",
  "trivia": [
    "В DotA, Iron Branch назывался «Ironwood Branch».",
    "В описании активной способности фраза маленькое счастливое деревце — отсылка на Боба Росса, популярного художника, который часто использовал эту фразу в своей телевизионной программе «The Joy of Painting».",
    "Посаженое дерево имеет ту же модель, что и деревья от Sprout, а также оно имеет те же эффекты, что и дерево, на которое использовали Eyes In The Forest.",
    "Написав «GG» в строке поиска магазина, вы увидите Iron Branch. Это отсылка к фанатскому названию «GG Branches» из первой Dota, где ему дали описание «Покупка одного из них обеспечит хорошую игру (англ. Buying one of these will ensure a good game)»."
  ],
  "upgradeIn": [
    "Magic Wand"
  ],
  "bonuses": [
    "+1 к силе",
    "+1 к ловкости",
    "+1 к интеллекту"
  ],
  "tips": [
    "Предмет используется на начальной стадии игры в виде дешёвого усиления атрибутов, затем улучшается в Magic Wand или продаётся.",
    "Если у вас есть запасные ячейки в инвентаре, то лучше занять их Iron Branch насколько это возможно, так как Iron Branch даёт хороший прирост атрибутов из-за низкой стоимости. В будущем вы сможете променять Iron Branch на более полезный предмет.",
    "Используйте Iron Branch, чтобы создать дерево, которое поймает или остановит движение врага, находясь между другими деревьями."
  ]
}