{
  "abilities": [
    {
      "notes": [
        "The attack damage and health talents affect the regular Lycan Wolves and the Lane Wolves. The attack damage talent is added as raw attack damage and is not affected by most percentage-based damage increasing or reducing effects.",
        "The attack damage talent is added as raw attack damage and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+2 Wolves Summoned",
          "talentRight": "+32% Chance Shapeshift Critical Strike"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+25% Feral Impulse Damage",
          "talentRight": "+6s Shapeshift Duration"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-15s Shapeshift Cooldown",
          "talentRight": "+200 Summon Wolves Health"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+13 Summon Wolves Damage",
          "talentRight": "+10 Feral HP Regen"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2a\/Lycan_Summon_Wolves.mp3\/revision\/latest?cb=20191216015828",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Casting Summon Wolves replaces currently active wolves from a previous cast.",
        "The wolves are summoned 200 range in front of Lycan, with 120 range distance between the wolves. Lycan is always at the center of the line.",
        "The wolves gain Invisibility on level 3 and Cripple on level 4. Already summoned wolves do not get new abilities when the ability is leveled. Only wolves summoned after leveling get them. The attack damage increasing talent immediately upgrades all of Lycan's currently living wolves. The health increasing talent does not upgrade any of Lycan's currently living wolves.",
        "Already summoned wolves do not get new abilities when the ability is leveled. Only wolves summoned after leveling get them.",
        "The attack damage increasing talent immediately upgrades all of Lycan's currently living wolves.",
        "The health increasing talent does not upgrade any of Lycan's currently living wolves.",
        "Has a cast backswing of 0.6 during Shapeshift.",
        "With Aghanim's Shard, 1 Lane Wolf is spawned together with each creep wave in one random lane. The lane for the wolf is selected at complete random each time. If Summon Wolves is not learned, the Lane Wolf does not spawn. Although the Lane Wolf is uncontrollable, Lycan is considered their owner, meaning last hits they make grant bounty and experience to Lycan. This also means they are affected by Feral Impulse and can gain critical strike from Shapeshift, but not the haste speed. The Lane Wolf has Cripple, but not Invisibility. The Lane Wolf's Cripple can proc on buildings. The Lane Wolf have the lowest target priority than any other unit, so they are targeted by auto-attacks as last.",
        "The lane for the wolf is selected at complete random each time.",
        "If Summon Wolves is not learned, the Lane Wolf does not spawn.",
        "Although the Lane Wolf is uncontrollable, Lycan is considered their owner, meaning last hits they make grant bounty and experience to Lycan.",
        "This also means they are affected by Feral Impulse and can gain critical strike from Shapeshift, but not the haste speed.",
        "The Lane Wolf has Cripple, but not Invisibility. The Lane Wolf's Cripple can proc on buildings.",
        "The Lane Wolf have the lowest target priority than any other unit, so they are targeted by auto-attacks as last."
      ],
      "mana": "125\/130\/135\/140",
      "item_behaviour": [],
      "name": "Summon Wolves",
      "cooldown": "30",
      "description": "Summons two wolves to fight for Lycan. Level 3-4 wolves have Permanent Invisibility, and level 4 wolves have Cripple.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.73",
        "Number of Wolves: 2 (TagTalent 4)",
        "Duration: 50",
        "Number of Lane Wolves: 1",
        "Causes one of your creep waves to include one uncontrollable wolf that moves with the wave. Additionally, wolves spawned this way may Cripple towers"
      ],
      "legacy_key": "V",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b1\/Lycan_Howl_1.mp3\/revision\/latest?cb=20191216015832",
      "effects": [
        "Ability No Target",
        "Affects Enemies"
      ],
      "notes": [
        "The debuff does not stack, so if an enemy is within range of more than one source, it gets affected by the debuff once.",
        "Lycan and his wolves (both Lycan Wolf and Lane Wolf) apply the effects around them simultaneously, there is no delay.",
        "Reduces the main attack damage of affected units. Bonus attack damage is not reduced."
      ],
      "mana": "35\/40\/45\/50",
      "item_behaviour": [],
      "name": "Howl",
      "cooldown": "22\/20\/18\/16",
      "description": "Strikes fear into enemies, reducing armor and attack damage to all enemies within 2000 range of Lycan and his wolves.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Radius: 2000",
        "Attack Damage Reduction: 25%\/30%\/35%\/40%",
        "Armor Reduction: 4\/5\/6\/7",
        "Duration: 8"
      ],
      "legacy_key": "W",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Self"
      ],
      "notes": [
        "Grants flat bonus attack damage based on the affected units' main attack damage. Does not further increase bonus attack damage.",
        "Feral Impulse affects all units under Lycan's control, not just himself and his wolves.",
        "Does not affect invulnerable units.",
        "Can regenerate up to 60\/180\/300\/420 (TagTalent 660\/780\/900\/1020) health in one minute.",
        "The aura's buff lingers for 0.5 seconds.",
        "Lycan illusions created by abilities (e.g. Disruption etc.) do provide their owner and units the bonuses. However, illusions that are Enchanted do not grant Enchantress' units the bonuses, only the illusion itself keeps them.",
        "However, illusions that are Enchanted do not grant Enchantress' units the bonuses, only the illusion itself keeps them."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Feral Impulse",
      "cooldown": null,
      "description": "Increases the HP regeneration and damage of Lycan and all units under his control.",
      "hot_key": "E",
      "params": [
        "Radius: Global",
        "Attack Damage Bonus: 11%\/22%\/33%\/44% (TagTalent 36%\/47%\/58%\/69%)",
        "Health Regen Bonus: 1\/3\/5\/7 (TagTalent 11\/13\/15\/17)",
        "Aura Linger Duration: 0.5"
      ],
      "legacy_key": "I",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Lycan_Shapeshift.mp3\/revision\/latest?cb=20191216015834",
      "effects": [
        "Ability Target Unit",
        "Affects Allied Heroes"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked. If the item is acquired before Shapeshift was learned, Wolf Bite will be at level 1.",
        "If the item is acquired before Shapeshift was learned, Wolf Bite will be at level 1.",
        "Wolf Bite automatically levels up with Shapeshift, and cannot be leveled up separately.",
        "Applies all effects of Shapeshift on the ally, including the transformation time, the night vision, the critical strike and the haste speed. However, the aura only affects the targeted ally, meaning units owned by them do not gain the bonuses.",
        "However, the aura only affects the targeted ally, meaning units owned by them do not gain the bonuses.",
        "Grants regular lifesteal and shared lifesteal to both, the caster and the target. This means, no matter who of them attacks, both always get healed. Lifesteal amplification affects shared lifesteal as well, but only if the amplification source is the healed unit.",
        "This means, no matter who of them attacks, both always get healed.",
        "Lifesteal amplification affects shared lifesteal as well, but only if the amplification source is the healed unit.",
        "The lifesteal is granted immediately upon cast. It does not rely on the transformation to finish.",
        "The shared lifesteal requires the caster and the target to be within 1200 of each other. The regular lifesteal works regardless of distance.",
        "If Shapeshift is not learned, the targeted ally goes through the transformation time, but does not transform. This means, in such case, this ability effectively only stuns the ally, and grants the lifesteal to both for seconds. If the Shapeshift duration talent is chosen, the ally transforms for 6 seconds, gains the lifesteal, but does not get the speed, night vision, or the crit chance.",
        "This means, in such case, this ability effectively only stuns the ally, and grants the lifesteal to both for seconds.",
        "If the Shapeshift duration talent is chosen, the ally transforms for 6 seconds, gains the lifesteal, but does not get the speed, night vision, or the crit chance."
      ],
      "mana": "150",
      "item_behaviour": [],
      "name": "Wolf Bite",
      "cooldown": "125\/110\/95 (TagTalent 110\/95\/80)",
      "description": "Lycan bites an ally, granting them Shapeshift properties. Lycan and the bitten target gain 30% Lifesteal and share the healing effect of Lifesteal with each other as long as they are within 1200 range of each other.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.3+0.73",
        "Lifesteal Radius: 1200",
        "Lifesteal: 30%",
        "Shared Lifesteal: 30%",
        "Illusions get their own Shapeshift buff lasting its regular duration. Illusions benefit from the aura's effects (TagTalentmovement speed and critical strike), but do not bestow it. Red critical numbers are before illusion and armor reduction. Illusions gain the night vision as well."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Lycan_Shapeshift.mp3\/revision\/latest?cb=20191216015834",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "During the transformation, Lycan cannot do anything. Cannot be interrupted.",
        "Increases Lycan's night vision to a total of 1800.",
        "Turns the caster into a melee unit with 150 attack range for its duration (relevant for Wolf Bite, and when cast by ranged heroes). This causes items that use different values for melee and ranged heroes (e.g. Manta Style) treat the caster as a melee hero. Attack range bonuses fully overridden, including passive item bonuses.",
        "This causes items that use different values for melee and ranged heroes (e.g. Manta Style) treat the caster as a melee hero.",
        "Attack range bonuses fully overridden, including passive item bonuses.",
        "The movement speed and critical strike are provided by a global aura which affects all units owned by Lycan. The aura's effects linger for 0.1 seconds.",
        "The aura's effects linger for 0.1 seconds.",
        "Does not affect invulnerable units.",
        "Hastes affected units, meaning they cannot be slowed below 550 movement speed.",
        "The critical strike increases the attack damage of Lycan and all his units by an average of 20%\/30%\/40% (TagTalent 36%\/54%\/72%). The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority. The critical strike uses pseudo-random distribution.",
        "The proc chances of multiple crit sources stack.",
        "If two sources of critical strike proc at the same time, the higher multiplier has priority.",
        "The critical strike uses pseudo-random distribution.",
        "Lycan gets his maximum and current health increased by the given value. This does not count as a heal. Upon losing the buff, his current health stays the same and only the maximum health bonus gets reverted.",
        "Upon losing the buff, his current health stays the same and only the maximum health bonus gets reverted.",
        "Shapeshift is fully canceled on death."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Shapeshift",
      "cooldown": "125\/110\/95 (TagTalent 110\/95\/80)",
      "description": "Lycan assumes his lupine form, granting him and his units critical strikes and added vision at night. During Shapeshift, Lycan and all units under his control move at increased speed, cannot be slowed and have a 40% chance to deal a critical strike doing 150%\/175%\/200% damage.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Transformation Time: 1.1",
        "Night Vision Bonus: 1000",
        "Base Attack Range: 150",
        "Radius: Global",
        "Haste Speed: 550",
        "Health Bonus: 200\/300\/400",
        "Critical Chance: 40% (TagTalent 72%)",
        "Critical Damage: 150%\/175%\/200%",
        "Aura Linger Duration: 0.1",
        "Duration: 28 (TagTalent 34)",
        "Grants a new ability: Wolf Bite.",
        "Illusions get their own Shapeshift buff lasting its regular duration. Illusions benefit from the aura's effects (TagTalentmovement speed and critical strike), but do not bestow it. Red critical numbers are before illusion and armor reduction. Illusions gain the night vision as well."
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Requires level 3 Summon Wolves to be unlocked. Available for level 3 and level 4 wolves.",
        "Available for level 3 and level 4 wolves.",
        "The invisibility is broken upon landing an attack. Missed attacks or attacking items do break it.",
        "Does not allow to pass through other units."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Invisibility",
      "cooldown": null,
      "description": "Permanently invisible when not attacking.",
      "hot_key": null,
      "params": [
        "Fade Delay: 1.7",
        ""
      ],
      "legacy_key": null,
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Lycan_Wolf_Cripple.mp3\/revision\/latest?cb=20191216015830",
      "effects": [
        "Ability Passive",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "Requires level 4 Summon Wolves to be unlocked. Available for level 4 wolves.",
        "Available for level 4 wolves.",
        "Deals damage in 1-second intervals, starting 1 second after proccing, resulting in 4 instances.",
        "Can deal up to 32 damage to the target (before reductions).",
        "Multiple procs on the same target do not stack, but refresh the duration instead.",
        "The proccing attack first applies the debuff, then its own damage.",
        "Can proc on allied units as well. Does not proc on wards. Does not proc on buildings for regular Lycan Wolves, but does for Lane Wolves.",
        "Does not proc on buildings for regular Lycan Wolves, but does for Lane Wolves."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Cripple",
      "cooldown": null,
      "description": "Gives 20% chance to cripple the target, causing 8 damage per second and lose 60 attack speed for 4 seconds.",
      "hot_key": null,
      "params": [
        "Proc Chance: 20%",
        "Damage per Second: 8",
        "Move Speed Slow: 15%",
        "Attack Speed Slow: 60",
        "Duration: 4",
        ""
      ],
      "legacy_key": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 26.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.7,
    "attrAgility": 16.0
  },
  "description": "Banehallow, the Lycan, is a melee strength hero who is capable of immense physical damage and considerable movement speed, who also excels at pushing buildings and bolstering his team's damage and health. He is capable of summoning Wolves who make excellent sources of damage and objective control. His Howl gives a large reduction in attack damage and armor to his enemies, while Feral Impulse turns Lycan and his pack into prime fighters on their own with bonus attack damage and health regeneration. When the time is right, Shapeshift allows the Lycan himself to join in the hunt, overwhelming foes with deadly critical strikes and incredible movement speed.",
  "history": "Banehallow was noble-born to the house of Ambry, the greatest of the landed castes in the old kingdom of Slom. Before the Fall, as the King's wants grew strange, and his court grew crowded with sorcerers and charlatans, the house of Ambry was the first to rise against the avarice of the throne. No longer willing to pay homage and fealty, they instead sent six-thousand swords into the capital, where they were wiped out in the Massacre of the Apostates. And then came the teeth behind the old truth: When you strike a king's neck, you had better take his head. Enraged by the betrayal, the king exterminated the vast Ambry bloodline, sparing only the lord of the house and his youngest son, Banehallow. Before all the royal court, with the disgraced lord chained to the ornate marble floor, the King bade his magicians transform the boy into a wolf so that he might tear out his own father's throat. \"Do this,\" the king said, \"so that Lord Ambry will understand the bite of betrayal.\" Powerful magic was invoked, and the child was transformed. But though his body was changed, his spirit remained intact, and instead of biting the exposed neck of his father, he attacked his handlers, tearing them to pieces. A dozen of the King's knights perished under the wolf's teeth before they managed to drive it off into the night. Lord Ambry laughed from his chains even as the King ran him through with a sword. Now the heir to the lost house of Ambry, Banehallow wanders the trail as the Lycan, part warrior, part wolf, in search of justice for all that he lost.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+2 Wolves Summoned",
      "talentRight": "+32% Chance Shapeshift Critical Strike"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+25% Feral Impulse Damage",
      "talentRight": "+6s Shapeshift Duration"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-15s Shapeshift Cooldown",
      "talentRight": "+200 Summon Wolves Health"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+13 Summon Wolves Damage",
      "talentRight": "+10 Feral HP Regen"
    }
  ]
}