{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Grimstroke_Stroke_of_Fate_1.mp3\/revision\/latest?cb=20191216013954",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The ink travels at a speed of 2000.",
        "With the travel distance and end radius, the ink takes 0.7 (TagTalent 1.2) seconds to reach max distance and can hit units up to 1560 (TagTalent 2560) range away.",
        "The ink trail starts 120 range towards Grimstroke's left side and travels towards the targeted point. This means the ink's travel direction is not based on the caster's facing direction, but instead on the angle between the aforementioned points. Portrait-casting automatically launches Stroke of Fate to the right of Grimstroke's facing direction.",
        "This means the ink's travel direction is not based on the caster's facing direction, but instead on the angle between the aforementioned points.",
        "Portrait-casting automatically launches Stroke of Fate to the right of Grimstroke's facing direction.",
        "Stroke of Fate first applies the damage, then the debuff.",
        "The damage increment has no cap and counts any valid units hit by the ink. Neither affects nor counts invulnerable or hidden units to the total damage.",
        "Neither affects nor counts invulnerable or hidden units to the total damage.",
        "Plays an initial sound and particles upon start casting, visible and audible to everyone.",
        "The projectile provides ground vision within its effect radius around it as it travels. This vision does not last. Provides ≈200 radius flying vision at every hit enemy's location and at the end location of the projectile, which lasts for 2 seconds.",
        "Provides ≈200 radius flying vision at every hit enemy's location and at the end location of the projectile, which lasts for 2 seconds."
      ],
      "mana": "11\/9\/7\/5",
      "item_behaviour": [],
      "name": "Stroke of Fate",
      "cooldown": "100\/110\/120\/130",
      "description": "Grimstroke paints a path of ink with his brush, damaging and slowing enemies. The damage is increased with each enemy the ink hits.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.6+0.63",
        "Cast Range:  1400 ( 2400)",
        "Wave Distance:  1400 ( 2400)",
        "Start Radius: 120",
        "End Radius: 160",
        "Base Damage: 100\/160\/220\/280 ( 150\/240\/330\/420)",
        "Damage Increment per Hit: 20\/30\/40\/50 ( 30\/45\/60\/75)",
        "Move Speed Slow: 50%\/60%\/70%\/80%",
        "Slow Duration: 1.75"
      ],
      "legacy_key": "F",
      "story": "The corruptive force of Grimstroke's ink, drawn from the reservoir of his fallen people, consumes any enemy caught in its path."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Grimstroke_Phantom%27s_Embrace_1.mp3\/revision\/latest?cb=20191216013948",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The Phantom travels to the target at a speed of 850.",
        "The phantom is attackable (A or Left Click) as soon as it is launched, so it can be killed before it reaches its target. Phantoms have the highest priority for auto-attack behaviors, together with Beetles.",
        "Phantoms have the highest priority for auto-attack behaviors, together with Beetles.",
        "The Phantom latches onto the target when it comes within 130 range of it. Once latched, it always stays 130 range in front of the target.",
        "The Phantom instantly dies in the following conditions: When its target turns invisible or spell immune, including while the Phantom is still traveling towards it. When its target turns invulnerable or hidden, but not while traveling.",
        "When its target turns invisible or spell immune, including while the Phantom is still traveling towards it.",
        "When its target turns invulnerable or hidden, but not while traveling.",
        "The Phantom returns to Grimstroke at a speed of 1150 upon expiring, when its target dies, or after 10 damage instances. It does not return when it is killed. Chronosphere instantly causes already latched Phantoms to return to their caster, and freezes traveling Phantoms.",
        "It does not return when it is killed.",
        "Chronosphere instantly causes already latched Phantoms to return to their caster, and freezes traveling Phantoms.",
        "While attached, the Phantom silences its target and deals damage to it. Damage dealt to the affected target is sourced to Grimstroke, not the Phantom. Deals 5\/10\/15\/20 (TagTalent 30\/35\/40\/45) damage in 0.5-second intervals, starting immediately upon reaching the target, resulting in 10 instances. Can deal up to 170\/300\/430\/560 (TagTalent 420\/550\/680\/810) damage to each latched enemy, including the final rend damage (before reductions).",
        "Damage dealt to the affected target is sourced to Grimstroke, not the Phantom.",
        "Deals 5\/10\/15\/20 (TagTalent 30\/35\/40\/45) damage in 0.5-second intervals, starting immediately upon reaching the target, resulting in 10 instances.",
        "Can deal up to 170\/300\/430\/560 (TagTalent 420\/550\/680\/810) damage to each latched enemy, including the final rend damage (before reductions).",
        "Successive casts on the target fully stack, although all casts share one debuff. The damage per second is increased for each stack. All casts share the same damage interval and are summed up into one instance per interval.",
        "The damage per second is increased for each stack. All casts share the same damage interval and are summed up into one instance per interval.",
        "The Phantom resets the cooldown of the Phantom's Embrace upon having fully returned to Grimstroke. With multiple Phantoms, each fully returned Phantom resets the cooldown of the ability independently. The cooldown also is reset if the target dies at any time during Phantom's Embrace, even when it dies to the Phantom itself.",
        "With multiple Phantoms, each fully returned Phantom resets the cooldown of the ability independently.",
        "The cooldown also is reset if the target dies at any time during Phantom's Embrace, even when it dies to the Phantom itself.",
        "The phantom provides shared vision over the target while flying towards it, and while latched. The vision instantly stops once letting go of the target. The phantom itself has 200 ground vision as well, which it provides while traveling to the target and while latched. However, this vision is not applied while the phantom travels back to the caster.",
        "The phantom itself has 200 ground vision as well, which it provides while traveling to the target and while latched.",
        "However, this vision is not applied while the phantom travels back to the caster.",
        "The phantom cannot be interacted with while it returns to the caster.",
        "SOULBIND Only the Phantom returned from the primary target refreshes the ability's cooldown."
      ],
      "mana": "36\/30\/24\/18",
      "item_behaviour": [],
      "name": "Phantom's Embrace",
      "cooldown": "80\/100\/120\/140",
      "description": "Summons a phantom that moves quickly towards the target, latching to it when she arrives. Once latched, the phantom damages and silences. If she survives the full latch duration she rends her victim for heavy damage and refreshes Phantom's Embrace's cooldown. Hero attacks against the phantom count as 3 attacks each.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range:  900",
        "Hero Attacks to Destroy: 2\/2\/3\/3 ( 3\/3\/4\/4)",
        "Non-Hero Attacks to Destroy: 6\/6\/9\/9 ( 9\/9\/12\/12)",
        "Damage per Second: 10\/20\/30\/40 ( 60\/70\/80\/90)",
        "Rend Damage: 120\/200\/280\/360",
        "Latch Duration: 5"
      ],
      "legacy_key": "E",
      "story": "Grimstroke holds no sorrow for the downfall of his people. Only for Yaovhi, she who was most dear to him, does he feel even a semblance of longing."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Grimstroke_Ink_Swell_1.mp3\/revision\/latest?cb=20191216014001",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies \/ Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Has a longer cast backswing of 0.86 when cast on self, due to a different animation. ↓↓ Double-tapping automatically targets self.",
        "↓↓ Double-tapping automatically targets self.",
        "Ink Swell first applies the damage, then the debuff.",
        "The tendrils deal 5\/7\/9\/11 (TagTalent 7\/9.8\/12.6\/15.4) damage in 0.2-second intervals, starting immediately as the buff is placed, resulting in up to 15 instances. They can deal up to 75\/105\/135\/165 (TagTalent 105\/147\/189\/231) damage to a single unit (before reductions).",
        "They can deal up to 75\/105\/135\/165 (TagTalent 105\/147\/189\/231) damage to a single unit (before reductions).",
        "The damage and stun upon losing the buff is based on the number of damage instances the tendrils applied to a single enemy hero. This means to reach the max damage and stun, at least one enemy hero must be damaged throughout the whole duration of Ink Swell. Only counts damage dealt to real heroes and clones, excluding illusions and creep-heroes. The actual amount of damage dealt does not matter, Ink Swell only considers the amount of damage instances applied. The stun duration increases by 0.09\/0.15\/0.22\/0.28 seconds, and the damage by 7.2\/14.4\/21.6\/28.8 (TagTalent 10.08\/20.16\/30.24\/40.32) for each instance applied, reaching the maximum after 13 instances.",
        "This means to reach the max damage and stun, at least one enemy hero must be damaged throughout the whole duration of Ink Swell.",
        "Only counts damage dealt to real heroes and clones, excluding illusions and creep-heroes.",
        "The actual amount of damage dealt does not matter, Ink Swell only considers the amount of damage instances applied.",
        "The stun duration increases by 0.09\/0.15\/0.22\/0.28 seconds, and the damage by 7.2\/14.4\/21.6\/28.8 (TagTalent 10.08\/20.16\/30.24\/40.32) for each instance applied, reaching the maximum after 13 instances.",
        "When the debuff is lost prematurely, it still applies the area expire damage and stun, based on the damage instances applied up to that point. However, if the affected unit dies, the area expire damage and stun will not apply.",
        "However, if the affected unit dies, the area expire damage and stun will not apply.",
        "The expire damage and stun only apply when there is at least one enemy hero within the area.",
        "Recasting Ink Swell on the same target refreshes the duration, without resetting the damage instance counter.",
        "SHARD NOTES The targeted ally is now healed for the expire max damage. The heal is based on the damage values before any reductions or amplifications, so the total damage enemies actually take is irrelevant. The tendrils heal 2.8\/3.92\/5.04\/6.16 health for each instance of damage they deal. The tendrils can heal up to 42\/58.8\/75.6\/92.4 health for each damaged enemy over its full duration. The expire damage can heal the target for up to 50.4\/100.8\/151.2\/201.6 health for each enemy hit by it. The strong dispel at the end is applied no matter how the buff is removed.",
        "The heal is based on the damage values before any reductions or amplifications, so the total damage enemies actually take is irrelevant.",
        "The tendrils heal 2.8\/3.92\/5.04\/6.16 health for each instance of damage they deal.",
        "The tendrils can heal up to 42\/58.8\/75.6\/92.4 health for each damaged enemy over its full duration.",
        "The expire damage can heal the target for up to 50.4\/100.8\/151.2\/201.6 health for each enemy hit by it.",
        "The strong dispel at the end is applied no matter how the buff is removed."
      ],
      "mana": "30\/26\/22\/18 (TagTalent 25\/21\/17\/13)",
      "item_behaviour": [],
      "name": "Ink Swell",
      "cooldown": "120\/130\/140\/150",
      "description": "Grimstroke shrouds an allied unit in ink, increasing its movement speed. Enemies in range of the allied unit are damaged with inky tendrils over time. After 3 seconds it triggers, applying damage and stun in an area around the unit in proportion to how long ink tendril was near any hero.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.15+0.73\/0.86",
        "Cast Range:  400\/525\/650\/775",
        "Radius: 375 ( 525)",
        "Move Speed Bonus: 12%\/14%\/16%\/18% ( 28%\/30%\/32%\/34%)",
        "Tendrils Damage per Second: 25\/35\/45\/55 ( 35\/49\/63\/77)",
        "Expire Max Damage: 90\/180\/270\/360 ( 126\/252\/378\/504)",
        "Max Stun Duration: 1.1\/1.9\/2.7\/3.5",
        "Max Damage\/Stun Accumulation Time: 2.5",
        "Buff Duration: 3",
        "Damage as Heal: 40%"
      ],
      "legacy_key": "W",
      "story": "Now that the rise of the ink tide no longer threatens to overwhelm Grimstroke, its tendrils of power are never far from his hand."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c2\/Grimstroke_Dark_Portrait.mp3\/revision\/latest?cb=20210120230733",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Heroes"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "The created illusions are visually distinguishable from the real hero for allies and enemies. The illusion spawns 108 range away randomly on the north, south, east, and west from the target. The illusion gains its spell immunity and movement speed bonus through a buff, so it is possible for enemies to check the buff and ‼ Ping the remaining duration of the illusion. The illusion has a EXPR 2 * IllusionLVL bounty.",
        "The illusion spawns 108 range away randomly on the north, south, east, and west from the target.",
        "The illusion gains its spell immunity and movement speed bonus through a buff, so it is possible for enemies to check the buff and ‼ Ping the remaining duration of the illusion.",
        "The illusion has a EXPR 2 * IllusionLVL bounty."
      ],
      "mana": "35",
      "item_behaviour": [],
      "name": "Dark Portrait",
      "cooldown": "200",
      "description": "Creates an ink illusion of a target enemy hero. Illusion is spell immune, and has bonus movement speed and attack damage.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0.54",
        "Cast Range:  1200",
        "Number of Illusions: 1",
        "Illusion Damage Dealt: 150%",
        "Illusion Damage Taken: 300%",
        "Illusion Move Speed Bonus: 30%",
        "Illusion Duration: 25"
      ],
      "legacy_key": "D",
      "story": "No dark creation is beyond the skill of the master's hand."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Grimstroke_Soulbind_1.mp3\/revision\/latest?cb=20191216013951",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Heroes"
      ],
      "notes": [
        "A full list of unique interactions with Soulbind can be found here.",
        "The targeting reticule must be centered over an enemy unit.",
        "Only binds the primary target to heroes, clones and creep-heroes, excluding illusions. The primary target can be an illusion though. Does not bind to nearby invisible or invulnerable heroes.",
        "Does not bind to nearby invisible or invulnerable heroes.",
        "The more the chain gets stretched, the slower the affected heroes can walk away from each other, eventually coming to a full stop. It directly affects their movement speed. The chain is considered fully stretched at 600 range, but can be stretched up to 700 range before it breaks. In order to stretch it further than 600, forced movement sources or abilities with teleporting effects must be used. The following abilities are not able to break the chain: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, Force Staff and Hurricane Pike. However, Force and Hurricane Thrust (Ally) can break the chain if the target hasn't moved after being bound. Every other source of forced movement (e.g. Primal Roar and Blinding Light) can break the leash.",
        "The chain is considered fully stretched at 600 range, but can be stretched up to 700 range before it breaks.",
        "In order to stretch it further than 600, forced movement sources or abilities with teleporting effects must be used.",
        "The following abilities are not able to break the chain: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, Force Staff and Hurricane Pike.",
        "However, Force and Hurricane Thrust (Ally) can break the chain if the target hasn't moved after being bound.",
        "Every other source of forced movement (e.g. Primal Roar and Blinding Light) can break the leash.",
        "Leashes the target and the ally it is bound to, preventing them from casting certain mobility abilities. Does not leash the target if it is not bound to an ally.",
        "Does not leash the target if it is not bound to an ally.",
        "If the enemies manage to break the link, the debuff stays active on the primary target still and immediately links the next enemy hero within the latch radius to them.",
        "While linked, every single-target ability cast on one of the heroes is also cast on the linked hero, following the same rules as Spell Reflection, with some exceptions. Soulbind has the lowest priority of all Spell Reflection sources, which causes it to not duplicate spell casts onto the linked hero, if the primary target is affected by any other source of Spell Reflection. When an illusion is the primary target, single-target abilities are not cast on the secondary target. The following abilities do not work exactly so: Duel Attacks the primary taunted target first. When the primary target is killed, then the secondary target. Duels the creep-hero if its the secondary target, but neither can be the winner. If Legion Commander dies, both bound units will recieve bonus damage. During Static Link, Razor attacks only the secondary target. Winter's Curse affects both soulbound enemies, and their teammates will attack the closest one. In addition, they will not be able to deal damage to either ally if the 2 soulbound enemies are within each other's curse radius. Winter Wyvern and her controlled units are still able to do damage like normal. Multicast triggers separately for both bound enemies. Charge of Darkness only works on the primary target. Omnislash and Nether Strike only work on the secondary target. Mana Drain requires 4 targets to work. The ability cast on the linked hero is sourced to the original caster so that their stats and items are applied to the ability as well. If the primary target of the single-target ability is affected by Spellblock or Transfer Spellblock, it still gets cast on the secondary target.",
        "Soulbind has the lowest priority of all Spell Reflection sources, which causes it to not duplicate spell casts onto the linked hero, if the primary target is affected by any other source of Spell Reflection.",
        "When an illusion is the primary target, single-target abilities are not cast on the secondary target.",
        "The following abilities do not work exactly so: Duel Attacks the primary taunted target first. When the primary target is killed, then the secondary target. Duels the creep-hero if its the secondary target, but neither can be the winner. If Legion Commander dies, both bound units will recieve bonus damage. During Static Link, Razor attacks only the secondary target. Winter's Curse affects both soulbound enemies, and their teammates will attack the closest one. In addition, they will not be able to deal damage to either ally if the 2 soulbound enemies are within each other's curse radius. Winter Wyvern and her controlled units are still able to do damage like normal. Multicast triggers separately for both bound enemies. Charge of Darkness only works on the primary target. Omnislash and Nether Strike only work on the secondary target. Mana Drain requires 4 targets to work.",
        "Duel Attacks the primary taunted target first. When the primary target is killed, then the secondary target. Duels the creep-hero if its the secondary target, but neither can be the winner. If Legion Commander dies, both bound units will recieve bonus damage.",
        "During Static Link, Razor attacks only the secondary target.",
        "Winter's Curse affects both soulbound enemies, and their teammates will attack the closest one. In addition, they will not be able to deal damage to either ally if the 2 soulbound enemies are within each other's curse radius. Winter Wyvern and her controlled units are still able to do damage like normal.",
        "Multicast triggers separately for both bound enemies.",
        "Charge of Darkness only works on the primary target.",
        "Omnislash and Nether Strike only work on the secondary target.",
        "Mana Drain requires 4 targets to work.",
        "The ability cast on the linked hero is sourced to the original caster so that their stats and items are applied to the ability as well.",
        "If the primary target of the single-target ability is affected by Spellblock or Transfer Spellblock, it still gets cast on the secondary target.",
        "Many aspects of spell reflection are applied to Soulbind: Single target abilities and items cast by creep-heroes cannot be reflected, therefore, their effects are not applied on the secondary target. Relevant for Earth, Storm and Spirit Bear. The ability's effects are first applied to the secondary target, then the primary target. As a consequence of this, Focus Fire only works on the primary target, since the Focus Fire buff for the primary target replaces the Focus Fire buff for the secondary target. Additionally, Hurricane Thrust's global attacks only work on the secondary target, since multiple casts of Hurricane Pike on enemies only refresh the duration of the Hurricane Thrust buff. If an ability cannot be reflected such as Dive Bomb, it is not cast on the secondary target.",
        "Single target abilities and items cast by creep-heroes cannot be reflected, therefore, their effects are not applied on the secondary target. Relevant for Earth, Storm and Spirit Bear.",
        "Relevant for Earth, Storm and Spirit Bear.",
        "The ability's effects are first applied to the secondary target, then the primary target. As a consequence of this, Focus Fire only works on the primary target, since the Focus Fire buff for the primary target replaces the Focus Fire buff for the secondary target. Additionally, Hurricane Thrust's global attacks only work on the secondary target, since multiple casts of Hurricane Pike on enemies only refresh the duration of the Hurricane Thrust buff.",
        "As a consequence of this, Focus Fire only works on the primary target, since the Focus Fire buff for the primary target replaces the Focus Fire buff for the secondary target.",
        "Additionally, Hurricane Thrust's global attacks only work on the secondary target, since multiple casts of Hurricane Pike on enemies only refresh the duration of the Hurricane Thrust buff.",
        "If an ability cannot be reflected such as Dive Bomb, it is not cast on the secondary target.",
        "Abilities that do not pierce spell immunity when cast this way will still be cast on the linked spell immune targets but will have no effect on them. This means that if the secondary target is spell immune, Finger of Death, Lightning Bolt and Mist Coil hit the AoE around the secondary target, but not the secondary target itself. Arc Lightning and Fade Bolt do not cast on the linked target if it is spell immune. This means that the following abilities and items will pierce the spell immunity of a linked hero when cast via Soulbind, since they pierce spell immunity when reflected (the ability is forcefully cast on the target regardless of \"castability\", and there are no further checks to check if the target is spell immune): Brain Sap, Spirit Siphon, Lightning Storm, Laguna Blade, Wrath of Nature, Reaper's Scythe, Decrepify, Soul Rip, and Energy Burst. For more specific details of each ability, please refer to their ability page, since some of them have more complex interactions with reflection.",
        "This means that if the secondary target is spell immune, Finger of Death, Lightning Bolt and Mist Coil hit the AoE around the secondary target, but not the secondary target itself.",
        "Arc Lightning and Fade Bolt do not cast on the linked target if it is spell immune.",
        "This means that the following abilities and items will pierce the spell immunity of a linked hero when cast via Soulbind, since they pierce spell immunity when reflected (the ability is forcefully cast on the target regardless of \"castability\", and there are no further checks to check if the target is spell immune): Brain Sap, Spirit Siphon, Lightning Storm, Laguna Blade, Wrath of Nature, Reaper's Scythe, Decrepify, Soul Rip, and Energy Burst. For more specific details of each ability, please refer to their ability page, since some of them have more complex interactions with reflection.",
        "For more specific details of each ability, please refer to their ability page, since some of them have more complex interactions with reflection.",
        "Provides shared vision over both targets, revealing their silhouette when invisible, and seeing what they see.",
        "A hero may only be affected by one Soulbind at a time. Recasting Soulbind on the same target, or on the secondary target refreshes the duration on both of them. Casting Soulbind on the a target within range of the already linked two does not link the third hero to any of the other two until their link expires.",
        "Casting Soulbind on the a target within range of the already linked two does not link the third hero to any of the other two until their link expires.",
        "TALENT NOTES The spell damage amplification talent only amplifies the outgoing spell damage of abilities to both bound targets."
      ],
      "mana": "90\/70\/50",
      "item_behaviour": [],
      "name": "Soulbind",
      "cooldown": "150\/200\/250",
      "description": "Binds a targeted enemy hero to its nearest allied hero within the bind radius, preventing both from moving away from each other. Any unit-targeted ability that either bound hero receives also gets cast on the other hero. If the bind is broken before the duration expires, the initial target will be bound to its nearest allied hero in the radius.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.15+0.5",
        "Cast Range:  700\/800\/900",
        "Latch Radius: 600",
        "Break Distance: 700",
        "Duration: 6\/7\/8",
        "<span image=\"images\\Talent\"><\/span> Bound Units Spell Damage Amplification: 25%"
      ],
      "legacy_key": "B",
      "story": "The Ascended were chosen sons of Ashkavor, granted immense power by the bonds forged between their own souls and those they were charged with protecting. In the years that followed the ruination of his kin, Grimstroke discovered much more sinister applications for the binding rituals…"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.9,
    "attrAgility": 18.0
  },
  "description": "Disables enemies with a swipe of his brush. The peoples of Ashkavor gave their lives for the newly Ascended, one unlike any Ascended before him. Grimstroke's lust for power had tainted the sacred ritual, and the corrupted ink consumed him — along with his kin. The defiled remnant of his former beloved remains at his side, agonizing those caught in this Phantom's Embrace. Shrouded by a shadowy Ink Swell, Grimstroke retaliates with lashing black tendrils, while a Stroke of Fate forms under his brush, darkening the land and painting a Dark Portrait of an unfortunate foe. Drawing on Ashkavorian rituals of protection, Grimstroke twists the ancient arts to Soulbind foes together, so that the sufferings and vexes of one will be felt equally by the other.  Support Nuker Disabler Escape ★★☆",
  "trivia": [
    "Grimstroke's abilities have different names in the game files: Stroke of Fate: Dark Artistry Phantom's Embrace: Ink Creature Ink Swell: Spirit Walk Soulbind: Soul Chain",
    "Stroke of Fate: Dark Artistry",
    "Phantom's Embrace: Ink Creature",
    "Ink Swell: Spirit Walk",
    "Soulbind: Soul Chain",
    "The line Link▶️ \"More art than science.\" is a reference to the common phrase \"More of an art than a science\", when referring to an activity or field that is not bound by clearly-defined rules and is open to subjective interpretation.",
    "The line Link▶️ \"At least you died with a smile on your face.\" is a reference to album of the label \"Bella Union\".",
    "The line Link▶️ \"Welcome to the real void.\" perhaps a reference to the film \"Matrix\" - \"Welcome to the real world\".",
    "Grimstroke after killing Lich he says Link▶️ \"Another self-styled king meets his end.\" perhaps a reference to the Lich-King in fantasy world \"Warcraft\".",
    "The line Link▶️ \"Brush beats scythe.\" is a reference to game \"Rock, paper, scissors\"."
  ],
  "history": "The people of Ashkavor crowded around the temple square, eager to witness the ascension of their new guardian -- to stand near the man as he bound their souls to his own. But as his final brush strokes fell against the runestone, and the bond of a new Ascended One was forged, everyone -- even those who'd stayed in their homes -- could sense that something had gone terribly wrong. He knew the cause instantly. The droplets of ichor he'd procured to amplify the potency of his inkpots had instead contaminated them, and the power of the binding spell he'd cast now threatened to consume him. An inky corruption snaked upward from the runestone, along the handle of his brush, soon overtaking his hands. From there it spread quickly. Once it overcame his face and his mouth, he couldn't have screamed even if he'd wanted to. All of his life he'd calculated on how to attain ever greater powers than the limits presented by his teachers would allow--going so far as to break the sacred prohibition against augmenting the inks. Indeed, with the Wellspring of the Ascended Bond open to him, he felt a measure of power coursing into his soul like he'd never imagined. His greatest triumph was upon him, if he could only survive it. He drew deep from the power of the bond, pushing back against the corrupted ink flow. A great moan filled the air -- the collective cry of his people. Some swayed on their feet. The weakest collapsed. Many tried to run. And still deeper he pulled from their bloodline reservoir. But it wasn't enough to stop the ink tide. It was only when the breath trapped in his lungs began to fail him, and the inkpool darkness fully encased him, that he saw his way out. The bond he'd made with the Ashkavoran people -- his people -- meant to be drawn upon only in service of their protection... It flowed two ways. With a final surge of strength -- this time directed by more than just blind repulsion -- he pushed the ink torrent into the bond itself. Slowly, he felt the tide retreat... and heard the awful wails of his people as the corruption in turn rolled over them. When at last the ink relented, his eyes opened upon a world changed. The Ashkavoran people as he knew them were gone. Every last soul was transformed into terrifying shades of their former selves -- comprised no longer of blood and bone, only viscid, tainted ink.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+150 Ink Swell Radius",
        "talent_left": "+50% Stroke of Fate Damage"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+1000 Stroke of Fate Cast Range",
        "talent_left": "+3 Hits to Kill Phantom"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+25% Soulbind Spell Damage",
        "talent_left": "+16% Ink Swell Movement Speed"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+50 Phantom's Embrace DPS",
        "talent_left": "-5s Ink Swell Cooldown"
      }
    ]
  }
}