{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Bloodstone_Bloodpact.mp3\/revision\/latest?cb=20191227195357",
      "effects": [
        "Spell Lifesteal Multiplier: 2.5",
        "Spell Damage Dealt as Mana Restore: 100%",
        "Duration: 6"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Increases Bloodstone's spell lifesteal against heroes to 75% and against creeps to 15%.",
        "The mana restoration is based on the total spell lifesteal value of the item, including bonuses. This means spell lifesteal manipulation indirectly affects the mana restoration as well. The mana restoration itself is also affected by mana restore manipulation. If the caster's health is full, they still get the full amount of mana restored.",
        "This means spell lifesteal manipulation indirectly affects the mana restoration as well.",
        "The mana restoration itself is also affected by mana restore manipulation.",
        "If the caster's health is full, they still get the full amount of mana restored.",
        "Does not apply the buff if the caster has been affected by it in the last 30 seconds. A status buff icon on the caster shows how much time is left for it to be able to get affected by Bloodpact again. The buff's duration is set upon cast and is affected by cooldown manipulation.",
        "A status buff icon on the caster shows how much time is left for it to be able to get affected by Bloodpact again.",
        "The buff's duration is set upon cast and is affected by cooldown manipulation."
      ],
      "mana": null,
      "abilityName": "Bloodpact",
      "cooldown": null,
      "description": "Increases Bloodstone's Spell Lifesteal by 2.5x and also converts the same percentage of damage dealt to mana. Lasts 6 seconds.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Spell lifesteal from different sources stacks additively.",
    "Multiple instances of spell lifesteal from the same source do not stack."
  ],
  "cost": "4400",
  "lore": null,
  "consistFrom": [
    "Voodoo Mask",
    "Soul Booster",
    "Recipe"
  ],
  "name": "Bloodstone",
  "description": "The Bloodstone's bright ruby color is unmistakable on the battlefield, as the owner seems to have infinite vitality and spirit.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Most heroes wanting to build Bloodstone can take advantage of the ability to disassemble Arcane Boots to complete the Soul Booster.",
    "Bloodpact makes spells with an area of effect restore large amounts of health and mana while fighting multiple targets."
  ]
}