{
  "abilities": [
    {
      "notes": [
        "Successive casts of Decay fully stack on the targets and on Undying. There is no limit to how much this can be done",
        "Decay first steals the  strength, then applies its damage. Despite the visual effects, the stolen strength is gained instantly",
        "Strength steals cannot reduce a hero's strength below 0, but Undying always gains the full amount of strength, no matter how much the target has left. Cannot steal strength from illusions, but can temporarily steal from clones. When multiple  Meepo Clones are in the area, one of them (randomly chosen on each cast) gets their strength stolen. The same applies to  Arc Warden and the  Tempest Double. However, the damage still hit all affected targets",
        "Reduces the target's current health by 80 ( 160), instead of keeping the current health percentage. This lost health is not returned when the debuff expires. This means Decay effectively deals up to 80\/120\/160\/200 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 140\/180\/220\/260 or  220\/260\/300\/340) damage (before reductions). Can deal up to 0\/80\/160\/240 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 120\/200\/280\/360) to creeps",
        "The target also effectively loses 0.4 ( 0.8) health regeneration and 4 ( 8) main attack damage if it is a strength hero. Vice versa, it temporarily increases Undying's health, health regeneration, and main attack damage by the same amount per cast. Undying does not keep the current health percentage either. This health increase does not count as a heal, so it is unaffected by amplifications. Therefore, the health increase is not considered by  Ice Blast's percentage health kill threshold and  False Promise's delayed health amplification",
        "Each stack places a new hidden modifier buff\/debuff on both Undying and the target. This means their durations are independent of each other. The counter modifiers on both Undying and his targets show how much strength they gained or lost. The number of stolen strength stacks can be seen on the status buff icon. Each status buff increases Undying's model size by 2%. This has no impact on his collision size. Upon death, the dying hero's strength restores back to its normal values, while Undying keeps the bonus strength values for the remaining duration",
        "SCEPTER NOTES Upon acquiring or losing  Aghanim's Scepter, all stacks of stolen strength instantly update to the current values. Upon updating the strength values, Undying's current health stays the same. However, debuffed enemies keep their current health percentage. Their health also only updates upon gaining or losing max health again"
      ],
      "item_behaviour": [],
      "description": "Undying steals strength from all enemy heroes in an area, dealing base damage as he claims the enemy's strength for himself. Deals 2x damage to creeps.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  650",
        "Radius: 325",
        "Damage: 0\/40\/80\/120 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 60\/100\/140\/180)",
        "Creep Damage Multiplier: 2",
        "Strength Steal: 4 ( 8)",
        "Decay Duration: 45"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Undying_Decay_1.mp3\/revision\/latest?cb=20200523111740",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": "10\/8\/6\/4 (TagTalent 8\/6\/4\/2)",
      "aghanim": null,
      "name": "Decay",
      "cooldown": "100",
      "legacy_key": "D",
      "story": "The strength of the living is simply borrowed from the strength of the dead."
    },
    {
      "notes": [
        "↓↓ Double-tapping automatically targets self",
        "Can cast on  Tombstone regardless of factions, but not on any other ward type unit. When cast on an allied Tombstone, it always increases its attacks to destroy value for 4\/8\/12\/16 hero attacks, regardless of unit count. This is not considered as heal. Can target enemy Tombstone, but does not damage or heal it",
        "Cannot cast on  Undying Zombie",
        "The 1300 search radius is always centered on Undying, even when targeting other units",
        "Units within the radius are selected randomly and have their health set to 15\/25\/35\/45 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 25\/35\/45\/55) lower the previous amount. The health cost counts as setting health and is thus never lethal. Does not count Undying, the target, enemy  Couriers, wards, buildings, invisible, untargetable enemies and units in the Fog of War. Spell immune allies are counted, including ally Couriers and the Undying Zombies from Tombstone. Units that require a certain amount of attacks to be killed and  Familiars do not lose health when counted in by Soul Rip. If there are no valid units within the search radius, no damage or healing is done",
        "The damage or heal is summed up and the target receives the total value in one instance",
        "Soul Rip can damage or heal a unit for up to 150\/250\/350\/450 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 250\/350\/450\/550) health (before reductions)"
      ],
      "item_behaviour": [],
      "description": "Undying rips health away from all nearby units and uses it to heal an ally, or damage an enemy. Soul Rip can also be used to heal Tombstone.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  750",
        "Search Radius: 1300",
        "Damage\/Heal per Unit: 15\/25\/35\/45 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 25\/35\/45\/55)",
        "Max Units: 10",
        "Tombstone Heal: 4\/8\/12\/16"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/89\/Undying_Soul_Rip.mp3\/revision\/latest?cb=20191216025942",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Allies",
        "Damage: Magical"
      ],
      "mana": "18\/14\/10\/6",
      "aghanim": null,
      "name": "Soul Rip",
      "cooldown": "90\/100\/110\/120",
      "legacy_key": "R",
      "story": "Even allies feel despair in Undying's presence."
    },
    {
      "notes": [
        "Destroys trees within 300 radius around the Tombstone upon cast",
        "Undying Zombies do not spawn for invisible units or units in the Fog of War. Zombies also do not spawn for wards, buildings,  Courier, hidden, untargetable units and zombies from an enemy Tombstone. However, they spawn for invulnerable and ethereal units. They are uncontrollable and do nothing but attack their set target. However, they can be boosted by allied abilities or auras",
        "The Tombstone starts spawning zombies immediately upon cast, resulting in 8\/9\/10\/11 instances. A player may only have up to 64 zombies under their control, no matter how many Tombstones they summon",
        "The zombies and their set target have the following interactions: When the set target turns invisible, the associated zombies die after 0.1 seconds. When the set target dies, including with Reincarnation, the associated zombies die instantly. However, with  Meepo Clones dying, the zombies stand around until the Tombstone expires. When the set target turns invulnerable, ethereal, hidden, untargetable, or is affected by the Fog of War, the associated zombies will still follow it",
        "When the Tombstone expires or is destroyed, all its zombies instantly die",
        "Both the Tombstone and the Undying Zombie treats attacks from illusions and creep-heroes as creeps",
        "Tombstones can also be affected by  Soul Rip and  Decrepify, regardless of source",
        "Tombstone can spawn two types of Undying Zombies, either a crawling zombie or a walking zombie. This only has cosmetic purposes and has no impact on gameplay",
        "TALENT NOTES The Zombie damage increasing <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent instantly updates all current active Zombies. The Tombstone on Death <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent summons Tombstone based on its current level passively and instantly on Undying's death location whenever he dies. The Tombstone lasts its full duration, it is not bound to Undying's death timer and does not disappear when he respawns. It also triggers with Reincarnation sources"
      ],
      "item_behaviour": [],
      "description": "Summons a tombstone at the target point. Zombies will frequently spawn next to every enemy unit in the area around the Tombstone, and attack them. Zombies have the Deathlust ability, which causes their attacks to slow the target, and if the target reaches below a certain amount of health, increases the attack and movement speed of the zombie.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.6+0",
        "Cast Range:  500",
        "Zombie Spawn Radius: 1200",
        "Zombie Spawn Interval: 4\/3.6\/3.2\/2.8",
        "Hero Attacks to Destroy Tombstone: 5\/6\/7\/8 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 11\/12\/13\/14)",
        "Non-Hero Attacks to Destroy Tombstone: 20\/24\/28\/32 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 44\/48\/52\/56)",
        "Hero\/Tower Attacks to Kill Zombie: 1",
        "Other Attacks to Kill Zombie: 2",
        "Tombstone Duration: 30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/be\/Undying_Tombstone_1.mp3\/revision\/latest?cb=20191216025944",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies"
      ],
      "mana": "90\/85\/80\/75 (TagTalent 75\/70\/65\/60)",
      "aghanim": null,
      "name": "Tombstone",
      "cooldown": "120\/140\/160\/180",
      "legacy_key": "T",
      "story": "Dirge calls on his fallen brothers to fight for the Dead God."
    },
    {
      "notes": [
        "Interrupts Undying's channeling abilities upon cast",
        "Increases Undying's total amount of  strength, including base and bonus strength, by 40%\/50%\/60%. Checks Undying's strength periodically and adapts the bonus instantly",
        "Successive casts update the ability values and refresh its duration. However, leveling up the ability while active does not update its ability value",
        "Increases Undying's base movement speed to 330\/340\/350 when active",
        "Multiple attacks on the same target do not stack but refresh the duration instead",
        "Applies generic incoming damage amplification on the targets. Stacks additively with other sources of generic incoming damage manipulation. Amplifies all 3 damage types, but not from HP Removal effects (e.g.  Sunder,  Soul Ring)",
        "Flesh Golem is fully canceled on death",
        "SHARD NOTES Whenever Undying lands an attack on the target, an  Undying Zombie based on the current level of  Tombstone is summoned on the attacked target when Flesh Golem is active. Missed attacks do not summon zombies. Zombies summoned this way last for 15 seconds. When the attacked target turns invisible, the associated zombies may die instantly, or up to 0.5 seconds later. When the set target dies, including with Reincarnation, the associated zombies die instantly. Works against any unit, including allies, except for buildings or wards. For allies, Zombies created do not attack the ally, but instead stand where they are summoned and may attack any enemy that comes too close. Tombstone and Undying Zombie notes fully apply. If Tombstone is not learned, no zombies are spawned. SPELL STEAL  Rubick transforms into a lesser Flesh Golem.  Zombies summoned are based on  Undying's current ability level when acquired"
      ],
      "item_behaviour": [],
      "description": "Undying transforms into a horrifying flesh golem. Gains a percentage increase to strength and imbues attacks with a slow and damage amplification.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Strength Bonus: 40%\/50%\/60%",
        "Self Move Speed Bonus: 30\/40\/50",
        "Enemy Move Speed Slow: 40%\/45%\/50%",
        "Enemy Incoming Damage Amplification: 25%\/30%\/35%",
        "Debuff Duration: 6",
        "Flesh Golem Duration: 40",
        "Zombie Duration:  15"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Undying_Flesh_Golem_1.mp3\/revision\/latest?cb=20191216025939",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Self"
      ],
      "mana": "125 (TagTalent 90)",
      "aghanim": null,
      "name": "Flesh Golem",
      "cooldown": "100\/125\/150",
      "legacy_key": "F",
      "story": "The flesh of the recently dead add to the power of Dirge's plague."
    },
    {
      "notes": [
        "Requires the level 25 <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent learned to be unlocked. This ability is shown as a permanent buff in the HUD",
        "Reincarnation cannot be prevented in any way. If Undying dies while it is off-cooldown, it is used. Fully stacks with other Reincarnation sources, with the <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent always triggering first when off-cooldown",
        "Revives with full health and mana. Does not resets the cooldowns of items and abilities",
        "Provides 1800\/800 ground vision at the death location during its delay",
        "The buff icon shows a cooldown whenever the Reincarnation is used. The cooldown is not affected by any cooldown reduction and cooldown resets sources"
      ],
      "item_behaviour": [],
      "description": "There is no description for this ability.",
      "hot_key": "?",
      "params": [
        "Effect Delay: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Undying_Reincarnation.mp3\/revision\/latest?cb=20200523111743",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": "300",
      "aghanim": null,
      "name": "Reincarnation",
      "cooldown": "0",
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "The movement speed slow from multiple attacks and Undying Zombies fully stack",
        "Each attack increases its stack count but does not refresh the duration of the entire stack. The number of current stacks can be seen on the debuff icon. Each stack lasts for 2.5 seconds",
        "The attacked target's health is checked in 0.5-second intervals. If their health is below the threshold, the Deathlust buff is placed. The buff lasts for 2.5 seconds, and it gets refreshed as long as the target stays below the health threshold",
        "Does not trigger against  Familiars"
      ],
      "item_behaviour": [],
      "description": "Slows enemy units on attack. If the attacked unit's health goes below the threshold, the zombie receives enhanced movement and attack speed.",
      "hot_key": "?",
      "params": [
        "Enemy Health Threshold: 40%",
        "Threshold Move Speed Bonus: 35%\/40%\/45%\/50%",
        "Threshold Attack Speed Bonus: 50\/60\/70\/80",
        "Move Speed Slow: 5%",
        "Slow Duration: 2.5"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Deathlust",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "The Tombstone has this ability as well",
        "The status buff uses the other  Spell Immunity icon"
      ],
      "item_behaviour": [],
      "description": "This unit does not feel the effects from magical damage sources.",
      "hot_key": "?",
      "params": [],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Spell Immunity",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 22.0,
    "attrIntelligence": 27.0,
    "attrIntelligenceInc": 2.8,
    "attrAgilityInc": 1.2,
    "attrAgility": 10.0
  },
  "description": "Summons hordes of zombies to attack his foes. Consumed by the chorus of the unending, Dirge, the Undying one marches across the land, rallying the dead to rise against the living. He Saps the Strength from his enemies, and Rip Souls from close-by beings, searing enemies while infusing allies with health. Atop the battlefield he erects a terrible Tombstone, calling forth legions of clawing zombies to maim and incapacitate his foes. The Undying's powers grow as he ultimately transforms into a gruesome Flesh Golem. Monstrous and truly horrifying, Undying finds great pleasure in keeping himself alive and vital, while his adversaries suffer as he delivers death to the field.  Support Durable Disabler Nuker ★☆☆",
  "trivia": [
    "In DotA, his hero name was Dirge, and his hero title was Undying.",
    "Undying was originally an intelligence hero. He became a strength hero as he got reworked in the 6.58 gameplay patch. All his abilities, but Soul Rip got reworked. His old abilities are explained here.",
    "Undying makes several references to the Left 4 Dead series, saying names of special infected, campaign names, and even the title itself in his dialogue. One notable reference is Undying's line, Link▶️ \"No dead are safe from Blueheart Bob.\"; this phrase is highly similar to the famous Left 4 Dead \"Chicago Ted\" graffiti line (\"No zombie is safe from Chicago Ted\"). Undying refers to Bounty Hunter as a Hunter due to the Hunter in Left 4 Dead being able to ambush players, just like how Bounty Hunter can. Spirit Breaker is referred to as a Charger due to the Charger sprinting at other players and repeatedly stunning them, just like how Spirit Breaker can. Venomancer is referred to as a Spitter for its ability to spit acid at players, similar to Venomancer himself. Alchemist is referred to as a Jockey as the Jockey climbs on players and steers them, similar to how the Alchemist himself steers his Ogre.",
    "One notable reference is Undying's line, Link▶️ \"No dead are safe from Blueheart Bob.\"; this phrase is highly similar to the famous Left 4 Dead \"Chicago Ted\" graffiti line (\"No zombie is safe from Chicago Ted\").",
    "Undying refers to Bounty Hunter as a Hunter due to the Hunter in Left 4 Dead being able to ambush players, just like how Bounty Hunter can.",
    "Spirit Breaker is referred to as a Charger due to the Charger sprinting at other players and repeatedly stunning them, just like how Spirit Breaker can.",
    "Venomancer is referred to as a Spitter for its ability to spit acid at players, similar to Venomancer himself.",
    "Alchemist is referred to as a Jockey as the Jockey climbs on players and steers them, similar to how the Alchemist himself steers his Ogre.",
    "Undying also references the Half Life series in a rival line towards Tinker ( Link▶️ \"For Lamarr.\"). Dr. Kleiner, who shares his voice actor with Tinker, has a pet headcrab named Lamarr. Headcrabs are small, parasitic creatures that attach themselves to the head of their victims, after which the victims turn into zombies.",
    "Undying's taunt against Kunkka Link▶️ \"Where is your ex-parrot?\" is a reference to the famous Parrot Sketch from Monty Python's Flying Circus.",
    "Undying's taunt against Invoker Link▶️ \"Carl? Is that you?\" is a reference to the 6.72's leaked changelog (which turned out to be a fake), where Invoker's name \"Kael\" was mistakenly translated into \"Carl\".",
    "A dirge is a sombre song of mourning or grieving, typically performed at a funeral.",
    "Undying's line, Link▶️ \"Shop smart.\" is a reference to the Army of Darkness movie."
  ],
  "history": "How long has it been since he lost his name? The torn ruin of his mind no longer knows. Dimly he recalls armor and banners and grim-faced kin riding at his side. He remembers a battle: pain and fear as pale hands ripped him from his saddle. He remembers terror as they threw him into the yawning pit of the Dead God alongside his brothers, to hear the Dirge and be consumed into nothingness. In the darkness below, time left them. Thought left them. Sanity left them. Hunger, however, did not. They turned on each other with split fingernails and shattered teeth. Then it came: distant at first, a fragile note at the edge of perception, joined by another, then another, inescapable and unending. The chorus grew into a living wall of sound pulsing in his mind until no other thought survived. With the Dirge consuming him, he opened his arms to the Dead God and welcomed his obliteration. Yet destruction was not what he'd been chosen for. The Dead God demanded war. In the belly of the great nothing, he was granted a new purpose: to spread the Dirge across the land, to rally the sleepless dead against the living. He was to become the Undying, the herald of the Dead God, to rise and fall and rise again whenever his body failed him. To trudge on through death unending, that the Dirge might never end.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Gains Reincarnation 300 CD",
        "talent_left": "+6 Tombstone Attacks to Destroy"
      },
      {
        "talent_lvl": "20",
        "talent_right": "Tombstone On Death",
        "talent_left": "-2s Decay Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+20 Tombstone Zombie Damage",
        "talent_left": "+10 Soul Rip Damage\/Heal"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+60 Decay Damage",
        "talent_left": "-15s Tombstone Cooldown"
      }
    ],
    "notes": [
      "The Zombie attack damage talent is added to the base damage, and not as bonus damage."
    ]
  }
}