{
  "abilities": [
    {
      "notes": [
        "При применении прерывает произносимые заклинания Clockwerk",
        "Продолжает действовать, даже если герой обезврежен",
        "Всего выстреливает шрапнелью 16 ( 24) раз сразу после использования способности",
        "Может нанести до 320\/720\/1120\/1520 урона героям (до учёта сопротивлений)\n Может нанести до 704\/1104\/1504\/1904 урона с выбранным  талантом на увеличение урона\n Может нанести до 480\/1080\/1680\/2280 урона с выбранным  талантом на снижение интервала между выстрелами\n Может нанести до 1056\/1656\/2256\/2856 урона при двух выбранных  талантах",
        "Может нанести до 40\/90\/140\/190 ( 88\/138\/188\/238) урона за шрапнель не-герою\n Считает крипов-героев за героев\n Может нанести до 640\/1440\/2240\/3040 урона не-герою (до учёта сопротивлений)\n Может нанести до 1408\/2208\/3008\/3808 урона не-герою при выбранном  талантом на увеличение урона\n Может нанести до =960\/2160\/3360\/4560 урона не-герою при выбранном  таланте на снижение интервала между выстрелами\n Может нанести до 2112\/3312\/4512\/5712 урона не-герою при двух выбранных  талантах.",
        "Выбор  таланта на увеличение урона мгновенно обновляет урон, наносимый действующей Battery Assault",
        "Выбор  таланта на снижение интервала между выстрелами не влияет на интервалы уже действующей Battery Assault\n Не изменяет интервалы при обновлении действующей способности\n Способность должна сначала закончиться\n Каждая шрапнель сначала наносит урон, затем применяет дебафф",
        "Наносит урон существам в тумане войны, но не действует на невидимых, неуязвимых и исчезнувших существах",
        "Бафф от нескольких применений Battery Assault не складывается, но обновляет длительность",
        "Во время действия   Overclocking Battery Assault оглушает и наносит урон всем целям в радиусе 275"
      ],
      "item_behaviour": [],
      "description": "Выпускает высокомощную шрапнель в случайных существ неподалёку, нанося им незначительный магический урон и ненадолго их оглушая.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 275",
        "Интервал выстрелов: 0,7 ( 0,45)",
        "Урон за шрапнель: 20\/45\/70\/95 ( 44\/69\/94\/119)",
        "Процент урона крипам: 200%",
        "Длительность оглушения: 0,1",
        "Длительность: 10,5",
        "Число целей: 1 ( Неограниченное)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Clockwerk_Battery_Assault_1.mp3\/revision\/latest?cb=20191215184902",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "24\/22\/20\/18",
      "aghanim": null,
      "name": "Battery Assault",
      "cooldown": "90",
      "legacy_key": "E",
      "story": "Некоторые устройства Болтозвяка не работают так, как надо, так что в бою их можно просто взрывать."
    },
    {
      "notes": [
        "Шестерни всегда размещаются одинаково\n 8 шестерней располагаются так, что образуют круг вокруг Clockwerk\n Центр круга остаётся пустым\n Каждая шестерня появляется на расстоянии 215 единиц от Clockwerk, эффективно блокируя радиус в 255 единиц благодаря своим размерам столкновения\n Все шестерни располагаются на расстоянии 164,5 единиц друг от друга\n Вместе с их размером столкновения промежуток между шестернями составляет 4,5 единицы\n То есть любое существо, оказавшееся внутри круга из шестерней, не сможет выбраться, если оно не имеет беспрепятственное перемещения",
        "Шестерня отталкивает первое вражеское существо, которое подошло к ней на расстояние 2 снаружи\n Шестерня может ударить только один раз",
        "Шестерни ударяют только тех существ, которые имеют ману (например, крипа-мага)\n Существам без запаса маны удар шестерней не наносится (к примеру,  Рошан)",
        "Удар шестерни не требует обзора, она может атаковать невидимых существ и врагов в тумане войны",
        "Удар отбрасывает существо назад на дистанцию в 300 единицы со скоростью в 300 единиц за 1 секунды",
        "Существа отбрасываются назад в том же направлении, с которого они затронули шестерню",
        "Во время отбрасывания назад существо полностью обезврежено\n Нанесение урона и потеря маны происходят после окончания отбрасывания\n Сначала наносится урон, затем сжигается мана",
        "Не ударяет существ, которые ранее уже были затронуты эффектом принудительного движения от других источников, исключая <span image=\"items\/force_staff\/full.webp\">[Force Staff]<\/span> Force Staff и <span image=\"items\/hurricane_pike\/full.webp\">[Hurricane Pike]<\/span> Hurricane Pike",
        "Несмотря на то, что удары наносят шестерни, источником эффектов (урона, сжигания маны, отталкивания) ялвяется Clockwerk, а не шестерня",
        "Отталкиваемые враги уничтожают задетые деревья",
        "Хотя шестерня имеет 100 единиц здоровья, атака по ней наносит 0 единиц урона\n Полоска здоровья тоже не меняется при атаке шестерни",
        "Существа, которые не находятся под контролем любого из игроков, не пытаются обойти шестерни, а просто идут на них, как будто их вообще нет\n Фактически это заставляет их застревать в шестернях до тех пор, пока они не сменят направление (например, если их отвлечёт другое существо)",
        "Также союзники могут атаковать и разрушать\/добивать шестерни, при этом им нужно сделать столько же атак, сколько и врагам\n Только Clockwerk может уничтожить шестерни с одного удара",
        "Шестерни создают ауру в центре шестерней с радиусом в 225\n Эта аура накладывает на противников негативный эффект\n Аура действует только на героев, иллюзии, клонов и крипов-героев\n Аура всегда длится столько же, сколько должны существовать шестерни\n Если их всех уничтожить, то аура продолжит действовать\n Аура задерживается на сек\n С привязывающим существ внутри шестерней  талантом накладывает эффект привязки всем враждебным существам\n С дающим невосприимчивость к магии внутри шестерней  талантом аура также начинает действовать на Clockwerk, давая ему иммунитет к заклинаниям\n Другие существа под его контролем не будут получать того же бонуса\n Во время действия   Overclocking та же аура даёт Clockwerk 250 ко скорости атаки"
      ],
      "item_behaviour": [],
      "description": "Создаёт вокруг героя барьер из заряженных шестерней, захватывая в ловушку всех ближайших существ. Шестерни отталкивают коснувшихся их снаружи врагов, сжигая здоровье и ману. Сработавшие шестерни отключаются. Враги могут уничтожить шестерню несколькими атаками, а владельцу способности на это требуется один удар.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Радиус появления шестерней: 215",
        "Радиус ауры шестерней: 225",
        "Количество шестерней: 8",
        "Атак для уничтожения: 2 ( 4)",
        "Радиус для отталкивания: 185",
        "Урон: 50\/125\/200\/275",
        "Сжигание маны: 50\/80\/110\/140",
        "Дальность отталкивания: 300",
        "Длительность отталкивания: 1",
        "Длительность: 5\/6\/7\/8",
        "Длительность задержки ауры:  0,5",
        "Бонус к скорости атаки:  250"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Clockwerk_Power_Cogs_1.mp3\/revision\/latest?cb=20191215184910",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "15 (TagTalent 13)",
      "aghanim": null,
      "name": "Power Cogs",
      "cooldown": "80",
      "legacy_key": "C",
      "story": "Часовщик очень гордится одним из своих изобретений — силовыми шестернями... хотя его соратники не всегда им рады."
    },
    {
      "notes": [
        "Скорость полета ракеты — 2250",
        "Дает летающий обзор в радиусе 600 единиц на 1 секунду во время полета и на 6 секунд после приземления в выбранной области\n При выборе  таланта 20-го уровня также даёт в выбранной области радиусом 600 единиц эффект раскрытия невидимости на 10 секунд\n Эффект раскрытия невидимости предоставляется в виде ауры, которая влияет на врагов\n Дебафф задерживается на 0,5 сек\n Не может раскрыть  Eyes In The Forest\n Выбор таланта даст эффект раскрытия невидимости уже летящим ракетам\n Однако уже долетевшие и взорвавшиеся ракеты не получат эффекта раскрытия невидимости",
        "Ракету можно увидеть на мини-карте\n Для союзников она отображается зелёным, для врагов — красным (для этого им нужен обзор)",
        "Во время действия   Overclocking Rocket Flare запускает 3 ракеты, которые запускаются с интервалами в 0,15 сек\n Ракеты запускаются в следующей последовательности: на целевую область ➤ на 125° правее целевой области ➤ на 125° левее целевой области\n Overclocking также устанавливает перезарядку в 3 сек\n во время активации\n Не обнуляет перезарядку способности, если она была применена до активации Overclocking"
      ],
      "item_behaviour": [],
      "description": "Выпускает сигнальную ракету в любую точку карты. Ракета взрывается в указанной зоне, нанося урон противникам и давая обзор данной зоны в течение 6 секунд.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: Глобальная",
        "Радиус: 600",
        "Число ракет: 1 ( 3)",
        "Урон: 80\/120\/160\/200",
        "Длительность обзора: 6",
        "Длительность раскрытия невидимости:  10",
        "Длительность задержки ауры раскрытия невидимости:  0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/da\/Clockwerk_Rocket_Flare_1.mp3\/revision\/latest?cb=20191215184914",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "20\/18\/16\/14 (TagTalent 18\/16\/14\/12) (TagTalent 3)",
      "aghanim": null,
      "name": "Rocket Flare",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "R",
      "story": "Со временем праздничное представление превратилось в полезное орудие для разведки и бомбардировки."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter для разблокировки\n В режиме Ability Draft способность может быть разблокирована игроком выбравшим  Hookshot",
        "При применении прерывает произносимые заклинания Clockwerk",
        "Оглушение нельзя чем-либо избежать — оно применится даже под действием неуязвимости или исчезновения\n На длительность оглушения не влияет сопротивление эффектам",
        "Повторное применение обновит длительность дебаффа"
      ],
      "item_behaviour": [],
      "description": "Перегружает способности героя: Battery Assault срабатывает на всех врагов в радиусе действия, Power Cogs увеличивает скорость атаки владельца внутри шестерней, Rocket Flare перезаряжается быстрее и выпускает по дополнительной ракете по бокам от цели, а Hookshot оглушает дольше и в большей области. После окончания эффекта оглушает владельца.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Радиус Battery Assault: 275",
        "Доп\n скорость атаки в шестернях: 250",
        "Число дополнительных ракет: 2",
        "Угол запуска дополнительных ракет: 125°",
        "Перезарядка Rocket Flare: 3",
        "Множитель радиуса\/длительности оглушения Hookshot: 1,5",
        "Buff Duration: 13",
        "Длительность оглушения владельца: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0f\/Clockwerk_Overclocking_1.mp3\/revision\/latest?cb=20191215184907",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "60",
      "aghanim": null,
      "name": "Overclocking",
      "cooldown": "90",
      "legacy_key": "F",
      "story": "Болтозвяк осознаёт предел возможностей своей брони и понимает, как он рискует, выходя за них во времена нужды."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard для разблокировки",
        "Пока Jetpack активен, герою не требуется поворачиваться для применения способностей и предметов",
        "75 градусов\/сек\n эквивалентны скорости поворота, равной 0,039",
        "Clockwerk может поворачиваться не более 1 секунды после получения приказа\n Это значит, что один приказ не будет вынуждать героя кружить вокруг точки\n Конечный путь Clockwerk зависит от вектора, началом которого является изначальное местоположение Clockwerk, а концом — место, куда был отдан приказ\n Вектор траектории будет коллинеарным (параллельным) этому вектору",
        "Clockwerk не обезврежен во время полёта и может использовать все способности и предметы\n Применение  Hookshot заканчивает действие Jetpack сразу после начала перемещения героя на крюке\n Не прекращает полёт, если герой промахнулся",
        "Скорость полёта равна скорости перемещения Clockwerk"
      ],
      "item_behaviour": [],
      "description": "Герой взмывает в небо. получая перемещение и обзор в полёте. Скорость передвижения увеличивается на 20%, но герой не может атаковать и имеет уменьшенную скорость поворота. Длится 6 сек. или до применения способности Hookshot.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0,53",
        "Скорость поворота в градусах\/сек.: 75",
        "Увеличение скорости передвижения: 20%",
        "Длительность: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Clockwerk_Jetpack_1.mp3\/revision\/latest?cb=20201224171015",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "16",
      "aghanim": null,
      "name": "Jetpack",
      "cooldown": "75",
      "legacy_key": "G",
      "story": null
    },
    {
      "notes": [
        "Скорость полета крюка 4000\/5000\/6000, требуется 0.5 секунды, чтобы ему достигнуть максимальной длины",
        "Когда крюк цепляется за существо, Clockwerk притягивается к нему с той же скоростью, с которой крюк летит к цели\n Clockwerk притягивается в направлении текущего местоположения выбранного существа, а не к месту, где оно изначально находилось\n То есть, если цель переместилась или её передвинули, то траектория притягивания Clockwerk мгновенно изменится\n В момент притягивания на Clockwerk действует безмолвие и обезоруживание, предотвращая атаки и использование им способностей\n Можно использовать предметы\n Притягивание максимально занимает 0,5 секунды, поэтому если цель переместилась слишком далеко, то Clockwerk не сможет полностью до неё дотянутся\n Притягивание отменяется, когда Clockwerk попадает под действие других источников принудительного движения",
        "Область урона и оглушения вокруг Clockwerk срабатывает всегда вне зависимости от того, кого зацепил крюк - союзника или врага",
        "При цеплянии за союзника он не оглушается и продолжает действовать как обычно\n Не прерывает его действия",
        "При цеплянии за врага он оглушается на 1,5\/1,75\/2 секунды или до момента приближения Clockwerk\n То есть, если Clockwerk не притянулся к врагу, то враг оглушается только один раз на полную длительность\n Это может произойти, если притягивание отменилось или цель передвинулась слишком далеко, пока длилось притягивание",
        "Враг, за которого зацепились, также получает оглушение и урон по области То есть выбранная цель оглушается на 0,5 дольше, чем вторичные цели, поскольку на неё действует и базовое оглушение от крюка",
        "Hookshot сначала накладывает дебафф, затем наносит урон",
        "Полностью игнорирует  курьеров, варды, постройки и спрятанных существ\n Может зацепиться за неуязвимых и невидимых существ",
        "Во время активации   Overclocking радиус оглушения и нанесения урона увеличивается в 262,5\n Также увеличивается длительность оглушения до 2,25\/2,625\/3"
      ],
      "item_behaviour": [],
      "description": "Быстро выпускает захватное устройство в указанном направлении. Если крюк попадает в живое существо, герой запускает себя в цель, оглушая её и нанося урон. Любые враги, с которыми герой сталкивается по пути, также получают урон и оглушаются.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 2000\/2500\/3000",
        "Максимальная дистанция: 2000\/2500\/3000",
        "Радиус захвата: 125",
        "Радиус получения оглушения и урона: 175 ( 262,5)",
        "Урон: 75\/175\/275",
        "Длительность оглушения: 1,5\/1,75\/2 ( 2,25\/2,625\/3)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Clockwerk_Hookshot_1.mp3\/revision\/latest?cb=20191215184903",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Союзников \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "60\/45\/30",
      "aghanim": null,
      "name": "Hookshot",
      "cooldown": "100\/125\/150",
      "legacy_key": "T",
      "story": "Несмотря на свою громоздкость, крюк способен отправить неуклюжую броню Часовщика в затяжной полет."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 26.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 2.3,
    "attrAgility": 13.0
  },
  "description": "Притягивается к врагам своим захватным крюком Притягиваясь ко врагам своим захватным крюком, Clockwerk изолирует жертву и разрывает её на части дезориентирующей шрапнелью. Разведывая поле битвы своими ракетами, он всегда находит цель, на которую можно налететь.  Инициация Контроль Стойкость Быстрый урон ★★☆",
  "history": "Болтозвяк — выходец из того же смышлёного народца, что и Снайпер и Механик, и он также компенсирует свою низкорослость механическими приспособлениями и хитростью ума. Сын часовщика, Болтозвяк много лет учился ремеслу отца — до тех пор, пока война не сошла с гор и не унесла из равнинных поселений мирные профессии. «Теперь твоё ремесло — война», — сказал ему умирающий отец, пока деревня их прадедов дымилась, обугленная и сожжённая. Плох тот ремесленник, который винит инструменты, и Болтозвяк был не из тех, что придумывал отговорки. Похоронив отца в руинах деревни, он устремился превратить себя в величайший инструмент войны всех миров и времён. Он поклялся, что его больше никогда не застанут врасплох — и соорудил, используя свои знания, механические доспехи, в сравнении с которыми снаряжение иноземцев было подобно консервным банкам. Теперь Болтозвяк живёт вместе со своими устройствами — некрупный, но смертоносный воин, разрушение и засада для которого стали способностями, работающими почти автоматически и точно, как часовой механизм. Механик смерти, он быстро кончает жизнь неподготовленных противников с помощью своих творений и несёт с собой новый век военной экипировки. Который час? Час Часовщика!"
}