{"abilities":[{"spell":"Winter Wyvern soars upon an arctic wind, granting her unobstructed movement and allowing her to exhale a blistering chill into each attack. While soaring, her attacks travel further and faster, and slow enemies with a burning freeze that strips them of 6%\/7%\/8%\/9% of their current health each second. Her sight is also hardened against night's chill, granting her 400 additional vision range at night while soaring.","effects":["Ability No Target ( Toggle)","Affects Self \/ Enemies","Damage Magical"],"notes":["Arctic Burn interrupts Winter Wyvern's channeling spells upon cast.","Temporarily turns Winter Wyvern into a flying unit, allowing her to fly over impassable terrain, trees, units and buildings. However, it does not grant Winter Wyvern flying vision.","Increases attack range to 775\/850\/925\/1000, projectile speed to 1200, night vision range to 1200 and reduces attack point to 0.1.","Each enemy can only receive the debuff once per cast. Successive attacks on the same target neither stack, nor refresh the duration.","The attacks first apply the debuff, then their own damage.","Deals damage in 1 second intervals, starting 1 second after the debuff is placed, resulting in 5 instances.","Can deal up to 27%\/30%\/34%\/38% of the target's current health as damage (before reductions), assuming nothing else affects the target's health.","Since the damage per second is based on a percentage of the target's current health, it can never kill an enemy by itself.","During Arctic Burn, Winter Wyvern can neither trigger nor take damage from Proximity Mines.","Destroys trees within a 250 radius at the end of the duration.","Does not affect wards, buildings, Roshan.","Aghanim's Scepter turns this spell into a toggle ability. As such, it no longer interrupts Winter Wyvern's channeling spells upon cast. Scepter also removes the 1 attack per target limit, allowing her to refresh the debuff with consecutive attacks on the same target. Drains mana in 1 second intervals, starting 1 second after toggling. Still uses the initial cast cost upon toggling on."],"mana":"90","elements":["Does not proc any on-cast effects when cast.","Cannot be used by illusions.","Does not pierce spell immunity."],"cooldown":"50\/40\/30\/20 ( 0)","name":"Arctic Burn","description":["Cast Animation: 0+0","Attack Range Bonus: 350\/425\/500\/575","Attack Projectile Speed Bonus: 500","Night Vision Bonus: 400","Current Health as Damage per Second: 6%\/7%\/8%\/9%","Move Speed Slow: 22%\/28%\/34%\/40% ( 37%\/43%\/49%\/55%)","Debuff Duration: 5","Arctic Burn Duration: 8 ( Indefinite)","Mana Cost per Second: 0 ( 30)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Launches a ball of brittle ice towards an enemy. The ice shatters on impact, leaving the primary target completely unaffected, while hurling damaging splinters into nearby enemies in a 500 radius. Enemies struck by these splinters are slowed by 30%.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The initial projectile travels at a speed between 650 and 4000. It adapts so that it reaches the target in 1 second. This means when the target gets more than 4000 range away on cast, it takes more than 1 second to reach it. Vice versa, if the target gets closer than 650 range on cast, it takes less than 1 second to reach it.","The secondary projectiles travel at a static speed of 600.","Fully affects invisible units and units in the Fog of War.","The stun of the level 25 talent only affects the secondary taragets, like the damage and slow. The stun does not replace the slow. The slow is still applied, effectively slowing hit units for 2 seconds.","The splinters first apply the damage, then the debuff."],"mana":"105\/120\/135\/150","elements":["Can partially be disjointed.","Partially blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"7","name":"Splinter Blast","description":["Cast Animation: 0.3+1.17","Cast Range: 1200","Splinter Search Radius: 500","Damage: 100\/180\/260\/340","Move Speed Slow: 30%","Slow Duration: 4","Stun Duration: 0 ( 2)"],"hot_key":"W","legacy_key":"T"},{"spell":"Encases an ally in an icy cocoon, freezing them solid while healing a base amount as well as a percentage of their maximum health each second. The cocoon blocks all physical damage.","effects":["Ability Target Unit","Affects Allies"],"notes":["Stuns the target and turns it immune to physical damage. The target can still be attacked and affected by magical and pure damage.","Can regenerate up to 56\/72\/88\/104 + 12%\/16%\/20%\/24% of a unit's max health over its full duration.","Cannot be cast on allies who have disabled help from Winter Wyvern."],"mana":"50\/60\/70\/80","elements":["Pierces spell immunity."],"cooldown":"24\/21\/18\/15 ( 19\/16\/13\/10)","name":"Cold Embrace","description":["Cast Animation: 0.3+0.63","Cast Range: 1000","Base Health Regen Bonus: 14\/18\/22\/26","Max Health as Health Regen Bonus: 3%\/4%\/5%\/6%","Duration: 4"],"hot_key":"E","legacy_key":"E"},{"spell":"Winter Wyvern freezes an enemy in place while striking those nearby with a maddening curse which causes them to attack their frozen ally with increased attack speed. The frozen ally and those cursed to attack their ally are immune to all damage from their enemies with the exception of Winter Wyvern or her controlled units.","effects":["Ability Target Unit","Affects Enemies"],"notes":["The target gets stunned, while any of its allies within the radius get taunted.","Enemies that enter the radius after cast also get taunted for its remaining duration.","The taunt is based on an aura, with an infinite linger duration. The debuff gets cleared as soon as the primary target loses the debuff or dies. This means the taunt sticks on the affected units, and getting moved outside the area does not free the unit from the taunt.","The taunt area is centered around the primary target, meaning it is moved with the target when it gets forcibly moved.","The taunt has the same priority as Berserker's Call, but lower priority than Duel. Same priority means that affected units attack the first taunt source, and switch to the other source once the first one expires. Taunts generally have a higher priority than Fear, however, Fear prevents the unit from attacking while taunted.","The taunt does not affect buildings, wards, and invulnerable or hidden units. Only affects units allied to the target. This means when cast on an enemy, neutral creeps are not taunted, and vice versa.","All affected units gain 100% damage reduction, they do not gain damage negation. HP Removal is not reduced. The damage reduction has no effect against damage dealt by Winter Wyvern and units under her control.","If the target gets killed by its allies or enemies during the curse, Winter Wyvern gets credit for the kill, except under the following circumstances: If the target is affected by Reaper's Scythe upon dying, Necrophos gets the kill credit, no matter who made the killing blow.","Does not disable any abilities. However, most passive abilities do not affect allied units.","When the primary target dies, the taunt effect ends immediately."],"mana":"250","elements":["Can be used by illusions.","Partially blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"80","name":"Winter's Curse","description":["Cast Animation: 0.3+1.37","Cast Range: 800","Radius: 500","Curse Damage Reduction: 100%","Curse Attack Speed Bonus: 55","Duration: 4\/4.75\/5.5 ( 5.5\/6.25\/7)"],"hot_key":"R","legacy_key":"W"}],"bio":"Like many great poets, Auroth just wants time to write, but the Winter Wyvern's life is full of interruptions. The epics of the Eldwurms have a long and colorful history, but some fear that the remaining dragon scholars are not as prolific as they once were, with few lines added to the Eldwurm Eddas since the last age of greatness. Auroth laments: \"We forget that there is more to life than triumph and dominion over enemies. We must also live our lives in the pursuit of creative expression.\" She embarks on research expeditions, collecting books for inspiration. But all this research can be terribly distracting, and she spends less time writing than she should. Although she knows she should be lurking in her lair, adding to the Eddas, she finds herself engaged in epic battles against powerful enemies. She loots castles, raids ancient libraries... and if she happens to heap glory on herself in the process, she tells herself that it's merely a side effect of her research. The fact is, while her skill and power on the battlefield are legendary, her scholarly travails have thus far hardly been the stuff of literary acclaim. But she is not content to stand as a protagonist of heroic lore. She wishes also to create it.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","Gold granted from the talent is unreliable gold.","The night vision talent does not counter any vision reducing effect.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Winter Wyvern made her first official Dota 2 appearance in the New Bloom trailer \"The Coming of the Year Beast\" which was showcased the first time after the finals of the Dota 2 Asia Championship 2015 on the 9th of February 2015. The trailer video was later posted on the official Dota 2 blog as part 1 of the New Bloom event. Her next official appearance was in the comic \"The new neighbors\", which was posted on the 10th of February 2015 on the official Dota 2 blog. In the comic, she is depicted as an \"artistic\" dragon with interests in books who does not follow the traditional behavior of dragons razing cities to the ground.","Much like Legion Commander, who is also voiced by Merle Dandridge, the gender of Winter Wyvern was changed from male to female with the transition from DotA to Dota 2.","In DotA, Winter Wyvern makes use the model of the Warcraft 3 version of a frost wyrm, a well known undead dragon type from the Warcraft universe.","Winter Wyvern's response when meeting Axe as an ally, \"In this world, nothing is certain but ice and axes\" is a nod to a quote by Benjamin Franklin, which states: \"In this world nothing can be said to be certain, except death and taxes.\"","Winter Wyvern's response, \"Winter is coming. Winter Wyvern that is.\" is a reference to Game of Thrones, specifically the motto of the House of Stark: \"Winter is coming.\"","Winter Wyvern's rivalry line towards Dragon Knight \"I knew Slyrak, Dragon Knight. You're no Slyrak.\" is a reference to Lloyd Bentsen's political quip \"... I knew Jack Kennedy... Senator, you're no Jack Kennedy\".","When the hero's abilities were showcased in The International 2016, Winter's Curse was cast on a Naga Siren, which caused her team mates, Gyrocopter, Ancient Apparition, Earthshaker and Storm Spirit, to kill her. This is in reference to how Aui_2000, who played Naga during Game 4 in the finals of the previous International against CDEC, was subsequently kicked out of the team."],"talents":["Splinter Blast 2s Stun:+1.5s Winter's Curse Duration","-5s Cold Embrace Cooldown:+15% Arctic Burn Slow","+500 Night Vision:+350 Health","+60 Damage:+90 Gold\/Min"],"desc":"Auroth, the Winter Wyvern, is a ranged intelligence hero whose arsenal of spells gives her powerful nuking capabilities. Usually played as a lane support, Winter Wyvern's spells allow her to fulfill a myriad of roles depending on what her team needs. Arctic Burn grants her temporarily flying movement, increased attack range as well as night vision while causing her attacks to slow enemies and burn their health over time, allowing her to gank and harass with ease. Splinter Blast is a low-cooldown nuke that, while leaving its target unaffected, slows and deals tremendous damage to all other nearby enemies. Cold Embrace allows Winter Wyvern to encase a target ally within a protective layer of ice, disabling them for the duration of the spell but also rendering them immune to physical damage while healing them for a percentage of their maximum health. Her ultimate, Winter's Curse, turns the enemies' own weapons against them by stunning the target enemy while forcing all of their nearby allies to attack them. A fearsome ganker and powerful nuker, Winter Wyvern can chill her foes to the bone and wreak havoc on their ranks."}