{"abilities":[{"spell":"Виверна взмывает в небо на арктическом ветре, получая беспрепятственное передвижение и вдыхая жгучий мороз в каждую свою атаку. В полете можно атаковать дальше и быстрее. Цель морозных атак замедляется и каждую секунду получает урон в размере 6%\/7%\/8%\/9% от текущего запаса здоровья. Также эта способность защищает глаза от ночной прохлады, увеличивая радиус ночного обзора в полете на 400.","effects":["Способность Ненаправленная ( Переключаемая)","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Прерывает произносимые заклинания Winter Wyvern.","Временно превращает Winter Wyvern в летающего юнита, позволяя летать над непроходимой местностью, деревьями, существами и строениями. При этом не даёт Winter Wyvern летающий обзор.","Увеличивает дальность атаки до 775\/850\/925\/1000, скорость полета снаряда до 1200, ночной обзор до 1200 и уменьшает анимацию атаки до 0,1.","Каждый враг может получить дебафф только один раз за атаку. Атаки, проводимые по одной цели, не сочитаются и не обновляют длительность.","Атаки сначала применяют дебафф, а затем наносят урон.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после наложения дебаффа, срабатывая 5 раз.","Может нанести до 27%\/30%\/34%\/38% урона от текущего здоровья цели (до учёта сопротивления), предполагая, что ничто иное не влияет на здоровье цели.","Поскольку урон основывается на проценте от текущего здоровья цели, то он никогда не сможет убить цель сам по себе.","С Arctic Burn, Winter Wyvern не может ни активировать, ни получить урон от Proximity Mines.","После окончания действия уничтожает деревья в радиусе 250 от героя.","Действует на варды, но не действует на строения и Рошана.","Aghanim's Scepter превращает эту способность в переключаемую. Таким образом, Arctic Burn больше не прерывает произносимые заклинания при активации. Aghanim's Scepter также убирает ограничение на 1 атаку по врагу, позволяя обновлять негативный эффект с последовательными атаками по юниту. Поглощает ману с интервалом в 1 секунду спустя 1 секунду после переключения. Всё ещё требует ману на активацию."],"mana":"90","elements":["Не провоцирует эффекты своим применением.","Не может использоваться иллюзиями.","Блокируется иммунитетом к заклинаниям."],"cooldown":"50\/40\/30\/20 ( 0)","name":"Arctic Burn","description":["Анимация применения: 0+0","Бонус к дальности атаки: 350\/425\/500\/575","Бонус к скорости полета снаряда: 500","Доп. радиус обзора ночью: 400","Урон от текущего здоровья в секунду: 6%\/7%\/8%\/9%","Замедление передвижения: 22%\/28%\/34%\/40% ( 37%\/43%\/49%\/55%)","Длительность эффекта: 5","Длительность: 6 ( Бесконечная)","Маны в секунду: 0 ( 30)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Запускает во врага ледяной шар, который после удара раскалывается на осколки, летящие в противников в радиусе 500 вокруг цели, не причиняя ей ущерб. Задетые осколками противники будут замедлены на 30%.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Базовый снаряд движется со скоростью от 650 до 4000. Его скорость зависит от дистанции и изменяется динамически, чтобы достичь цель за 1 секунду. Это означает, что если цель перемещается со скоростью более 4000 единиц, то снаряду требуется больше 1 секунды для её достижения. И наоборот, если цель перемещается со скоростью меньше 650 единиц, то снаряду требуется меньше 1 секунды, чтобы её достичь.","Вторичные снаряды или же осколки движутся со скоростью 600.","Действует на невидимых существ и существ в тумане войны.","Оглушение, даваемое талантом на 25-ом уровне, действует только на вторичные цели (как и урон с замедлением). Оглушение не заменяет замедление. Оно также применяется, замедляя пораженных существ на 2 секунды.","Осколки сначала наносят урон, а затем применяют дебафф."],"mana":"105\/120\/135\/150","elements":["Можно частично избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"7","name":"Splinter Blast","description":["Анимация применения: 0,3+1,17","Дальность применения: 1200","Радиус поиска цели: 500","Урон: 100\/180\/260\/340","Замедление скорости передвижения: 30%","Длительность замедления: 4","Длительность оглушения: 0 ( 2)"],"hot_key":"W","legacy_key":"T"},{"spell":"Заковывает союзника в ледяной кокон, замораживая его и ежесекундно восстанавливая определенное число здоровья плюс процент от максимального уровня здоровья. Кокон полностью блокирует весь физический урон.","effects":["Способность Направленная на юнита","Действует на Союзников"],"notes":["Оглушает цель, делая её невосприимчивой к физическому урону. На цель всё также могут напасть и атаковать её магическим и чистым уроном.","Лечение представлено в виде регенерации здоровья, поэтому исцеляет на 0.00013597513597514 + 0,3%\/0,4%\/0,5%\/0,6% здоровья с интервалом в 0,1 секунды.","Может исцелить до 0.0054390054390054 + 12%\/16%\/20%\/24% от максимального здоровья.","Нельзя использовать на союзников, которые отключили помощь от Winter Wyvern."],"mana":"50\/60\/70\/80","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"24\/21\/18\/15 ( 19\/16\/13\/10)","name":"Cold Embrace","description":["Анимация применения: 0,3+0,63","Дальность применения: 1000","Базовая регенерация здоровья: 14\/18\/22\/26","Регенерация от процента макс. здоровья: 3%\/4%\/5%\/6%","Длительность: 4"],"hot_key":"E","legacy_key":"E"},{"spell":"Примораживает противника к земле, повергая окружающих его союзников в безумие и заставляя их атаковать цель способности с повышенной скоростью. Противник под этим эффектом получает урон от своих союзников, владельца способности и его подконтрольных юнитов.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["Цель способности получает оглушение, а все её союзники - провокацию.","Противник, зашедший в радиус действия способности после ее произнесения, попадет под действие провокации на оставшуюся длительность.","Провокация держится на задетых существах до конца. Перемещение юнита из области не освободит его от действия провокации.","Область провокации закрепляется за основной целью, то есть при передвижении цели c помощью принудительного движения область также передвинется.","Провокация имеет такой же приоритет, как и Berserker's Call, но меньше, чем Duel. Равный приоритет означает, что существа будут спровоцированы тем заклинанием, которое подействовало раньше и переключат свое внимание на другую цель при истечении первого заклинания. У провокации приоритет по умолчанию выше, чем у страха, но при этом страх предотвращает атаку той цели, что вызвала провокацию.","Провокация не действует на строения, варды и неуязвимых или спрятанных юнитов. Действует только на союзников цели. Это означает, что при использовании способности на врага, нейтральные крипы не будут спровоцированы, и наоборот.","Все задетые герои получают 100% уменьшение урона, но не отрицание урона. Отнимающий здоровье урон не снижается.","Если цель под действием способности умирает из-за союзника или врага, то убийство засчитывается Winter Wyvern, за исключением таких случаев: Если цель находилась под действием Reaper's Scythe, то убийство засчитывается Necrophos, независимо от того, кто убил её.","Не отключает способности. Однако большинство пассивных способностей не действуют на союзных юнитов.","Когда главная цель умирает, провокация моментально прекращается."],"mana":"250","elements":["Может использоваться иллюзиями.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"80","name":"Winter's Curse","description":["Анимация применения: 0,3+1,37","Дальность применения: 800","Радиус: 500","Уменьшение получаемого урона: 100%","Увеличение скорости атаки: 55","Длительность: 4\/4.75\/5.5 ( 5,5\/6,25\/7)"],"hot_key":"R","legacy_key":"W"}],"bio":"Как и другим великим поэтам, Аурос постоянно не хватает времени на творчество, ведь жизнь ее полна неожиданностей. Эпос древних драконов знаменит своей долгой и насыщенной историей, но некоторые с опаской полагают, что оставшиеся ученые драконы не настолько плодовиты, как их предки, поскольку с момента процветания в Сказание драконов было добавлено всего лишь несколько строк. Аурос сетует: «Мы стали забывать, что жизнь — это не только победы над врагами и завоевания земель. Каждый должен стремиться к творчеству». Она собралась в исследовательскую экспедицию на поиски новых книг для вдохновения. Но эти исследования жутко утомляют и отвлекают от творческого процесса, на который должно уходить гораздо больше времени. Хоть Аурос и должна скрываться в своем логове, постоянно пополняя сказание, она часто вступает в грандиозные битвы с могучими противниками. Она обыскивает замки и древние библиотеки, а славу, заслуженную в процессе своих поисков, считает побочным эффектом этих исследований. Ее мастерство и отвага на полях сражений стали легендарными, но в муках творчества она не смогла создать того, что заслужило бы признание. Как бы то ни было, она не будет довольствоваться ролью героя сказания. Она хочет быть его автором.","talentsTips":["Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Золото с таланта является ненадёжным.","Талант на ночной обзор не поддается никакому эффекту уменьшения обзора.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Winter Wyvern впервые была официально представлена в Dota 2 в трейлере \"Новоцвета\" \"The Coming of the Year Beast\", который был показан после финалов Dota 2 Asia Championship 2015 9 февраля 2015. Позже трейлер был размещён на официальном блоге Dota 2 как первая часть Новоцвета. Следующим официальным появлением стал комикс \"Новые Соседи\", который был размещён 10 февраля 2015 в официальном блоге разработчиков. В комиксе она представлена \"творческим\" драконом, интересующимся книгами и не ведущим обычный для дракона образ жизни.","Как и Legion Commander, также озвученная Merle Dandridge, пол Winter Wyvern был изменён с мужского на женский при переносе из DotA в Dota 2.","В DotA, Winter Wyvern реализована с использованием модели Warcraft 3 версии Frost Wyrm, мёртвого дракона из вселенной Warcraft.","Приветственная реплика Winter Wyvern при встрече с союзником Axe, \"In this world, nothing is certain but ice and axes.\" является отсылкой к словам Бенджамина Франклина: \"In this world nothing can be said to be certain, except death and taxes.\"","Причина по которой Winter Wyvern поэтесса в её истории, может быть в том что её имя Auroth которое иногда значит Author - автор."],"talents":["Splinter Blast дает 2 сек. оглушения:+1,5 сек. к длительности Winter's Curse","-5 сек. к перезарядке Cold Embrace:+15% к замедлению от Arctic Burn","+500 к ночному обзору:+350 к здоровью","+60 к урону:+90 золота в минуту"],"desc":"Winter Wyvern — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Она имеет четыре способности, каждая из которых является активной. Первая способность, Arctic Burn, дает герою бонусную дальность атаки и способность к полету. Атаки, произведенные во время Arctic Burn будут наносить урон в размере 9% от текущего здоровья цели, а также будут замедлять её на определенный процент. Вторая способность, Splinter Blast, кидает в противника осколок льда. При попадании в цель осколок разбивается на несколько частей, которые замедляют и наносят урон окружающим врагам, оставляя начальную цель нетронутой. Третья способность, Cold Embrace, заковывает союзника или самого себя в ледяную ловушку, при этом восстанавливая процент от максимального здоровья, а также блокируя весь физический урон. Ультимативная способностью, Winter's Curse, накладывает на поле битвы холод, заставляя выбранного врага замерзнуть на месте. Все окружающие союзники вражеского юнита впадают в неконтролируемое безумие, начиная его бить. При этом как цель, так и её союзники имеют 100% сопротивление всему входящему урону. Улучшение от Aghanim's Scepter делает способность Arctic Burn переключаемой, также убирая ограничение на количество атак по цели."}