{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e8\/Helm_of_the_Dominator_Dominate.mp3\/revision\/latest?cb=20191227195434",
      "effects": [
        "Cast Range: 700",
        "Max Units: 1",
        "Min Base Health: 1000",
        "Set Move Speed: 380",
        "Set Gold Bounty: 100",
        "Base Attack Damage Bonus: 25",
        "Health Regen Bonus: 12",
        "Mana Regen Bonus: 4",
        "Armor Bonus: 4"
      ],
      "notes": [],
      "mana": "0",
      "abilityName": "<span style=\"font-weight:bold; color:#fff; text-shadow:1px 1px 2px #000;;\">Dominate<\/span>",
      "cooldown": "45",
      "description": "Takes control of one neutral target unit and sets its movement speed to 380 and max health to a minimum of 1000. Also provides the unit with +25 base attack damage, +12 health regen, +4 mana regen and +4 armor. Dominated units with a max health of greater than 1000 retain their original max health. Dominated unit's bounty is set to 100 gold.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "132 health and 0.6 health regeneration.",
    "72 mana, 0.3 mana regeneration and 0.6% flat base magic resistance.",
    "6 attack speed and 1 main armor.",
    "6 main attack damage to all \/ \/ heroes.",
    "12.6 main attack damage to universal heroes."
  ],
  "cost": "2625",
  "lore": null,
  "consistFrom": [
    "Helm of Iron Will",
    "Diadem",
    "Recipe"
  ],
  "name": "Helm of the Dominator",
  "description": "The powerful headpiece of a dead necromancer.",
  "trivia": null,
  "upgradeIn": [
    "Helm of the Overlord"
  ],
  "tips": [
    "Dominated creeps can be used to remotely stack an ancient camp. Some creeps have abilities that are very useful, such as Dark Troll Summoner and Ogre Frostmage.",
    "You can dominate the Alpha Wolf for the helpful damage aura and have it follow your carry.",
    "A dominated creep can be used as a scout that can be placed inside Roshan's pit. Just be sure not to place it too close to Roshan, so he does not attack it.",
    "Dominate always sets the creep's base movement speed to 380. The only units which have more than 425 movement speed are Lycan Wolves at level 3 or higher. This means dominating one of them actually reduces their base speed down to 380. Besides these, all other dominatable creeps have lower movement speed than 380."
  ]
}
