{"abilities":[{"spell":"Метает в указанного врага магическое копьё, которое наносит цели урон и замедляет её, а также создает атакующую её союзную иллюзию.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Spirit Lance летит со скоростью в 1000.","Копье сначала применяет дебафф, а затем наносит урон.","Иллюзия появляется только в случае успешного поражения и нанесения урона или замедления цели.","Иллюзия появляется в 58 единицах от цели в случайном месте.","Иллюзии Phantom Lancer в радиусе 675 единиц от него выпускают фальшивые Spirit Lance. Они проигрывают ту же анимацию применения и выпускают фальшивые копья одновременно с настоящим Spirit Lance. Когда иллюзии не имеют никаких приказов и спокойно стоят, они поворачиваются к цели и используют фальшивые копья. Когда иллюзии двигаются или атакуют, они продолжают это делать и не поворачиваются к цели. У них проиграется анимация использования, перекрывающая их анимации движения или атаки. При отмене использования иллюзии все равно проигрывают полностью анимацию применения, но копья не выпускают. Фальшивые копья ни с чем не взаимодействуют: не наносят урон, не замедляют и не создают иллюзии.","Иллюзии, созданные Spirit Lance, дают при убийстве 5 золота и единиц опыта и это значение не меняется с повышением уровней.","Не отскакивает от невидимых юнитов или юнитов в тумане войны.","Не поражает дважды одну и ту же цель за применение.","Все отскоки вместе могут нанести до 500\/750\/1000\/1250 ( 1125\/1375\/1625\/1875) единиц урона (до учета сопротивления)."],"mana":"125\/130\/135\/140","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"7","name":"Spirit Lance","description":["Анимация применения: 0,3+0,73","Дальность применения: 525\/600\/675\/750","Урон: 100\/150\/200\/250 ( 225\/275\/325\/375)","Замедление скорости передвижения: 10%\/18%\/26%\/34%","Иллюзии получают урона: 400%","Иллюзии наносят урона: 20%","Длительность иллюзии: 2\/4\/6\/8","Длительность замедления: 3,25","Радиус отскока: 0 ( 400)","Кол-во целей: 1 ( 5)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Герой и все иллюзии неподалёку ненадолго исчезают с поля боя. Через 1 сек. в случайных точках указанной области появляются сам герой, его копии, а также две новые иллюзии с разными характеристиками. Продлевает время жизни всех иллюзий. Одна из них получает обычный урон, но не наносит его, а другая — получает 600% и наносит 20% урона.","effects":["Способность Направленная на область","Действует на Себя"],"notes":["Doppelganger может быть использована для избегания снарядов.","При использовании применяет к Phantom Lancer базовое развеивание.","Phantom Lancer и его иллюзии неуязвимы и скрыты в момент задержки появления.","Phantom Lancer не может ничего делать в момент задержки. Любой приказ, отданный в этот момент, будет поставлен в очередь.","Phantom Lancer и 2 созданные иллюзии будут смотреть в ту сторону, куда смотрел Phantom Lancer при использовании способности.","Остальные собранные иллюзии сохраняют предыдущий градус расположения.","Phantom Lancer и его иллюзии располагаются после появления в виде плюса с возможными вариациями.","После появления иллюзии продолжат двигаться или атаковать цель, если ранее им были отданы эти команды.","Для всех иллюзий, собранных Doppelganger, увеличивается длительность. Это не распространяется на иллюзии, созданные применением способности. Увеличение длительность происходит при использовании, давая 1 дополнительную секунду к длительности, поскольку появление Phantom Lancer и иллюзий занимает 1 секунду.","Иллюзия, получающая обычный урон и не наносящая его, ярче, поэтому Phantom Lancer и его союзники могут выделять её среди других иллюзий.","Иллюзия, получающая 600% урона и наносящая 20% от урона, выглядит как все остальные иллюзии Phantom Lancer.","В отличии от иллюзий, создаваемых другими способностями Phantom Lancer, иллюзии Doppelganger используют фиксированное значение золота и оно меняется с повышением уровней.","Doppelganger не может быть прервана ничем, кроме смерти. То есть, когда Phantom Lancer получает эффект телепортации (от, например, Glimpse), то он все равно появится в выбранной области.","Способность разрушает деревья в радиусе 200 единиц вокруг Phantom Lancer и каждой задействованной иллюзии при их появлении."],"mana":"50","elements":["Нельзя применять в оцепенении.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"25\/20\/15\/10 ( 19\/14\/9\/4)","name":"Doppelganger","description":["Анимация применения: 0,1+0","Дальность применения: 600","Радиус области: 325","Радиус сбора иллюзий: 900","Задержка появления: 1","Количество иллюзий: 2","Первая иллюзия получает урона: 100%","Первая иллюзия наносит урона: 0%","Вторая иллюзия получает урона: 600%","Вторая иллюзия наносит урона: 20%","Длительность сбора иллюзий: 2","Длительность иллюзий от Doppelganger: 8"],"hot_key":"W","legacy_key":"D"},{"spell":"Выбрав цель атаки, Phantom Lancer быстро сближается с ней, на время получая дополнительную ловкость. Иллюзии героя также обладают этой способностью.","effects":["Способность Переключаемая","Действует на Себя"],"notes":["Способность можно отключать. Переключение действует только на Phantom Lancer, для его иллюзий она остается активной.","Требует непосредственного приказа для атаки по цели для активации. Авто-атака или приказ на атаку, отданный на землю, не активируют Phantom Rush.","Не может совершить рывок через юнитов или по непроходимой территории.","Применяет к Phantom Lancer эффект ускорения, поэтому невозможно замедлить его скорость передвижения при наличии баффа.","Phantom Rush может срабатывать от любой цели, включая варды и строения.","Обезоруживание или призрачная форма не мешают Phantom Lancer совершать рывок. При этом он не может выбрать и совершить рывок к юнитам, которых невозможно атаковать (например, неуязвимых или находящихся в призрачной форме юнитов).","При срабатывании Phantom Lancer получает бафф рывка, который дает герою ускорение. Бафф длится 5 секунд до успешного удара по цели рывка Phantom Lancer или до получения героем другого приказа. Ненаправленные предметы не могут отменить рывок. Предметы, которые можно использовать на себя двойным нажатием, считаются за направленные. Бафф рывка также теряется при оглушении, сне, проклятии, исчезновении или действии урагана. Оцепенение не отменяет действие баффа на Phantom Lancer и он продолжит рывок при истечении оцепенения. Провокация заставляет Phantom Lancer ускорится непосредственно к её источнику без потери баффа. Принудительные атаки, вызываемые провокацией, не отменяют действие баффа. Если цель прячется, становится невидимой или перемещается в туман войны, то Phantom Lancer совершает рывок к последнему известному расположению цели.","Phantom Lancer получает дающий ловкость бафф и теряет бафф рывка при атаке врага. То есть, если рывок был отменен любым способом помимо атаки цели, то ловкость ему не дается. Поскольку новый приказ на атаку отменяет рывок, то получить бафф к ловкости он сможет только при атаке выбранной ранее цели. Поскольку бафф дается при начале атаки, то для него не важно, промахнулась атака или нет.","В среднем бафф к ловкости дает Phantom Lancer 1.44\/2.88\/4.32\/5.76 единиц брони, 0.45%\/0.9%\/1.35%\/1.8% скорости передвижения и 9\/18\/27\/36 скорости атаки и урона от атаки."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"16\/12\/8\/4","name":"Phantom Rush","description":["Мин. расстояние до рывка: 250","Макс. расстояние до рывка: 600\/700\/800\/900 ( 1100\/1200\/1300\/1400)","Скорость рывка: 800","Бонусная ловкость: 9\/18\/27\/36","Макс. длительность рывка: 5","Длительность бонусной ловкости: 2"],"hot_key":"E","legacy_key":"R"},{"spell":"При каждой атаке герой может раздробить свою сущность, создав иллюзорную копию себя. Все иллюзии героя также могут раздробиться. Копии, созданные самим героем, живут 8 сек., а копии, созданные другими иллюзиями — 4 сек.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Шанс создания иллюзии срабатывает только при атаке.","Juxtapose использует псевдо-случайное распределение.","Иллюзии, созданные Juxtapose, будут атаковать цель, которая активировала способность. То есть иллюзии, созданные Juxtapose, используют Phantom Rush, если их цель находится на подходящей дистанции.","Иллюзии, созданные Juxtapose, дают при убийстве 5 золота и единиц опыта и это значение не меняется с повышением уровней.","Иллюзии появляются в 72 единицах от Phantom Lancer с одной из 4 сторон света.","Juxtapose влияет на все иллюзии Phantom Lancer, а не только на те, которые созданы его способностями. Это распространяется и на иллюзии, созданные предметами ( Manta Style), или с помощью других способностей ( Disruption, Reflection). То есть даже иллюзия, созданная врагом с Phantom Lancer (например, Disruption), имеет шанс создать еще одну под контролем врага.","Действует на варды, но не на строения."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Juxtapose","description":["Шанс: 40%\/45%\/50%","Шанс у иллюзий: 8%","Максимум иллюзий: 6\/8\/10 ( 11\/13\/15)","Иллюзии получают урона: 650%","Иллюзии наносят урона: 16%","Длительность иллюзий (созданных героем): 8","Длительность иллюзий (созданных иллюзией): 4"],"hot_key":"R","legacy_key":"X"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Увеличивает урон от атак в среднем на 30%.","Шанс срабатывания сочетается с другими источниками критического урона. Если одновременно срабатывают два источника критического удара, используется более высокий множитель.","Critical Strike использует псевдослучайное распределение.","Не работает на варды, строения и союзных юнитов."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Критический удар","description":["Шанс срабатывания: 30%","Критический урон: 200%"]}],"bio":"Удалённая деревня Поул не знала о войнах, идущих в центре королевства. Спокойная ловля рыбы и ужин в кругу семьи — для них это была полноценная жизнь. Но война всё равно настигла их. Присоединившись к крепким рекрутам, проходившим мимо домов, скромный копейщик Азраф дал клятву принести мир своему королевству и его жителям. Его сородичи принесли великую жертву, находясь в авангарде последнего боя с магом ужаса Ворном. Когда битва подступила к крепости, Азраф остался один, и он единственный смог пробраться в неё. Сосредоточенный и разъяренный той бойней, в которой пали его братья, Азраф преодолел смертельно опасные ловушки чародея и его околдованных стражей. Вскоре простой рыбак прибыл в башню святилища Ворна. До самого рассвета, пока внизу царил хаос, они сражались, копьё против посоха, пока, наконец, Азраф не пронзил своего врага с оглушающим криком. Но колдун не просто пал: он распался на бесчисленные осколки света, которые пронзили мощью убийцу. Когда улеглась пыль, а туман войны рассеялся, Азраф обнаружил, что находится среди своих сородичей. Каждый казался одет в ту же одежду, что и он сам, каждый имел то же оружие, что и он сам, и Азраф почувствовал, что все мысли их также подобны его собственным. Зная о приближении союзников, Азраф пожелал, чтобы фантомы спрятались, и они один за другим превратились в ничто. Придя в святилище, солдаты нашли воина, что сразил чародея. Когда они приблизились к герою, копейщик испарился. Он оказался всего лишь ещё одним фантомом.","talentsTips":["Талант на уклонение мультипликативно сочетается с другими источниками уклонения.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Модель героя в DotA основана на модели Kimahri Ronso, игрового персонажа из RPG игры Final Fantasy X. В Dota 2, модель Phantom Lancer также получил много сходств с Kimahri Ronso.","Модель Phantom Lancer схожа по дизайну с ранними концептами Monkey King."],"talents":["Шанс в 30% нанести двойной урон:-6 сек. перезарядки Doppelganger","+5 к максимуму иллюзий от Juxtapose:+500 к дальности Phantom Rush","+125 к урону от Spirit Lance:+250 к здоровью","+20 к скорости атаки:+15% к уклонению"],"tips":["Модель героя в DotA основана на модели Kimahri Ronso, игрового персонажа из RPG игры Final Fantasy X. В Dota 2, модель Phantom Lancer также получил много сходств с Kimahri Ronso.","Модель Phantom Lancer схожа по дизайну с ранними концептами Monkey King."],"desc":"Phantom Lancer — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Spirit Lance, метает в противника магическое копье, которое наносит цели урон и замедляет ее, а также создает атакующую ее союзную иллюзию. Вторая способность, Doppelganger, позволяет Phantom Lancer ненадолго исчезает с поля боя. Через секунду он, все его иллюзии неподалеку, а также две новые иллюзии появляются в случайных точках в указанной области. Эти две новые иллюзии различаются: одна получает обычный урон, но не наносит его, а другая — получает 600% и наносит 20% урона. Пассивная способность, Phantom Rush, позволяет Phantom Lancer быстро бежать к выбранной цели. Иллюзии героя также обладают этой способностью. Ультимативная пассивная способность, Juxtapose, позволяет Phantom Lancer раздробиться надвое, создав свою иллюзию. Иллюзии также имеют возможность раздробиться."}