{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.",
        "Талант на силу в общем даёт Outworld Destroyer: 400 здоровья и 2 регенерации здоровья.",
        "Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.",
        "Талант вампиризма заклинаний лечит на 0,4% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+30% к вампиризму заклинаниями",
          "talentRight": "+2% к урону от Arcane Orb"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0,15 к множителю разницы в мане у Sanity's Eclipse",
          "talentRight": "+20 к силе"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к скорости передвижения",
          "talentRight": "+250 к мане"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к скорости атаки",
          "talentRight": "+200 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Outworld_Destroyer_Arcane_Orb_1.mp3\/revision\/latest?cb=20191216021430",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Дополнительный урон наносится отдельным источником урона и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Наносит урон до урона атаки, но всё еще зависит от попадания атаки по цели.",
        "Проверяет запас маны Outworld Destroyer до попадания снаряда, поэтому увеличение или уменьшение запаса маны во время полета снаряда повлияет на его урон."
      ],
      "mana": "20% от текущей маны",
      "hotKey": "Q",
      "cooldown": "6\/4\/2\/0",
      "description": "Герой наполняет атаки дополнительным чистым уроном, зависящим от текущего запаса маны.",
      "spellName": "Arcane Orb",
      "params": [
        "Дальность применения: 450",
        "Текущей маны в урон: 16% (TagTalent 18%)"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Знания Внемирья позволяют Предвестнику перехватывать потоки духовной энергии и перенаправлять их на себя."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Outworld_Destroyer_Astral_Imprisonment.mp3\/revision\/latest?cb=20191216021424",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "Astral Imprisonment обезвреживает цель и делает её неуязвимой и спрятанной на всю длительность.",
        "Помещает союзника в заточение без применения остальных эффектов.",
        "Если цель — враг, то в конце заключения он получит урон.",
        "Если цель — вражеский герой (включая иллюзии и клонов, но исключая крипов-героев), то способность также крадет часть его максимальной маны. Уменьшает значение только максимальной маны цели; текущая мана не меняется. То же условие действует при возвращении маны цели: увеличивается только максимальная мана, текущая не изменяется. То же правило действует на Outworld Destroyer: уменьшается только максимальная мана, текущая не изменяется. Outworld Destroyer получает иконку баффа, отображающую текущее количество полученной от Astral Imprisonment маны.",
        "Уменьшает значение только максимальной маны цели; текущая мана не меняется.",
        "То же условие действует при возвращении маны цели: увеличивается только максимальная мана, текущая не изменяется.",
        "То же правило действует на Outworld Destroyer: уменьшается только максимальная мана, текущая не изменяется.",
        "Outworld Destroyer получает иконку баффа, отображающую текущее количество полученной от Astral Imprisonment маны.",
        "Красное кольцо, расширяющееся в центре визуального эффекта, показывает стандартную длительность заточения. Его видят только союзники.",
        "Функция \"Без помощи\" не позволяет союзному Outworld Destroyer использовать эту способность на вашего героя."
      ],
      "mana": "150",
      "hotKey": "W",
      "cooldown": "24\/20\/16\/12 (TagTalent 0)",
      "description": "Помещает выбранное существо в астральное заточение, где оно неуязвимо и не может ничего делать. По окончании эффекта происходит взрыв, наносящий цели урон и крадущий долю от её максимального запаса маны.",
      "spellName": "Astral Imprisonment",
      "params": [
        "Анимация применения: 0,25+0,4",
        "Дальность применения: 650 (TagAghanim 800)",
        "Урон: 120\/200\/280\/360",
        "Кража макс. маны: 16%\/18%\/20%\/22%",
        "Длительность заточения: 1,75\/2,5\/3,25\/4",
        "Длительность кражи: 30\/40\/50\/60",
        "Число зарядов: 2",
        "Время восстановления заряда: 12",
        "Перезарядка этой способности заменяется зарядами. Увеличивает дальность её применения на 150."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Запертые в карманном измерении на границе с Внемирьем, жертвы осознают свою смертность и ничтожность своих знаний."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Outworld_Destroyer_Essence_Flux_2.mp3\/revision\/latest?cb=20191216021427",
      "effects": [
        "Способность Пассивная Н\/Д",
        "Действует на Себя"
      ],
      "notes": [
        "Восстанавливает ману после применения заклинания.",
        "Essence Flux не срабатывает от способностей предметов.",
        "Essence Flux использует псевдослучайное распределение.",
        "В среднем восстанавливает 6%\/9%\/12%\/15% от максимальной маны заклинателя за применение.",
        "Aghanim's Shard превращает Essence Flux в активную способность, сохраняющую пассивную часть. Приравнивает значение текущего здоровья к 75% текущей маны и наоборот. То есть в среднем применение способности стоит 25% от текущих здоровья и маны. Напрямую манипулирует здоровьем и маной, поэтому не взаимодействует с эффектами, реагирующими на урон.",
        "Приравнивает значение текущего здоровья к 75% текущей маны и наоборот.",
        "То есть в среднем применение способности стоит 25% от текущих здоровья и маны.",
        "Напрямую манипулирует здоровьем и маной, поэтому не взаимодействует с эффектами, реагирующими на урон."
      ],
      "mana": "0",
      "hotKey": "E",
      "cooldown": "45",
      "description": "Каждое применение способности может восстановить долю от максимального запаса маны.",
      "spellName": "Essence Flux",
      "params": [
        "Анимация применения: 0+0",
        "Шанс: 30%",
        "Восстановление маны от максимального запаса маны: 20%\/30%\/40%\/50%",
        "Макс. длительность: 1,5",
        "Обмен здоровья\/маны: 75%",
        "Делает способность прерываемой с прочтением в 1,5 секунды, которая меняет местами 75% от максимальных показателей здоровья и маны владельца. Перезарядка: 45 секунд.\""
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Внемирье тонет в магической энергии, которая иногда может просачиваться сквозь порталы Предвестника."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Outworld_Destroyer_Sanity%27s_Eclipse.mp3\/revision\/latest?cb=20191216021429",
      "effects": [
        "Способность Направленная на область",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "При применении урон рассчитывается от максимального запаса маны Outworld Destroyer и пораженных врагов, а не от текущего.",
        "Урон наносится только вражеским героям и иллюзиям. Другие существа способностью игнорируются.",
        "Влияет на существ под действием Astral Imprisonment, но игнорирует неуязвимых или спрятанных существ."
      ],
      "mana": "200\/325\/450",
      "hotKey": "R",
      "cooldown": "160\/145\/130",
      "description": "Вызывает ментальный взрыв, который наносит урон, зависящий от разницы в мане между жертвами и самим героем. Действует на врагов под действием способности Astral Imprisonment.",
      "spellName": "Sanity's Eclipse",
      "params": [
        "Анимация применения: 0,25+0,4",
        "Дальность применения: 700",
        "Радиус: 400\/500\/600",
        "Базовый урон: 200\/300\/400",
        "Множитель разницы в мане: 0,4 (TagTalent 0,55)"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Кристалл из Внемирья разбивается, выпуская на волю разрушительную энергию, отголоски которой ощущаются и в других мирах."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 21.0,
    "attrIntelligence": 30.0,
    "attrIntelligenceInc": 4.2,
    "attrAgilityInc": 1.6,
    "attrAgility": 22.0
  },
  "description": "Outworld Destroyer — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность Arcane Orb уникальный модификатор атаки добавляющий к атакам Outworld Destroyer дополнительный чистый урон, пропорциональный текущему запасу маны. Наносит дополнительный урон призванным существам и иллюзиям. Второй способностью Astral Imprisonment помещает вражеского или союзного героя в астрал. Герой в астрале неуязвим и неактивен. Улучшение с Aghanim's Scepter увеличивает дальность применения способности и добавляет ей 2 заряда. Пассивная способность Essence Flux восстанавливает часть маны, когда Outworld Destroyer использует заклинания. Улучшение от Aghanim's Shard добавляет к этой способности активную составляющую, позволяющую поменять 75% здоровья и маны местами. Ультимативная способность Sanity's Eclipse вызывает взрыв, который наносит вражеским героям урон, зависящий от разницы в мане между жертвами и самим Outworld Destroyer. Срабатывает на целях, находящихся под действием Astral Imprisonment.",
  "history": "Представитель благородной и властной расы, Предвестник бороздит кромку Пустоши и в одиночку несёт дозор в последней оставшейся заставе мира у края бездны. Он провёл вечность в выщербленном кристаллическом Внемирье, ни на мгновение не покидая свой пост, вглядываясь в небеса и ожидая движения в бездонной ночи за звёздами. Глубоко в сияющих переплетениях его интеллекта лежит узор пророчества — тёмная музыка, предвещающая, что однажды за гранью мироздания проснётся некое зло, которое обратит свой взор к нашему миру. Полностью поглощённый наблюдением, страж оставлял без внимания события, происходящие у самого солнца. Но вот наконец конфликт Древних и чувство нарастающей угрозы изнутри и извне заставили его двинуться в сторону солнца, к просторам сражений. Наши пророчества недвусмысленно говорят о Предвестнике: он — знак грядущих катастроф. Однако и само по себе его прибытие сулит беду.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+30% к вампиризму заклинаниями",
      "talentRight": "+2% к урону от Arcane Orb"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0,15 к множителю разницы в мане у Sanity's Eclipse",
      "talentRight": "+20 к силе"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к скорости передвижения",
      "talentRight": "+250 к мане"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к скорости атаки",
      "talentRight": "+200 к здоровью"
    }
  ]
}