{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/87\/Crimson_Guard_Guard.mp3\/revision\/latest?cb=20191227195406",
      "effects": [
        "Radius: 1200",
        "Damage Block Chance: 100%",
        "Blocked Damage: 75",
        "Buff Duration: 12",
        "Stack Limit Duration: 34"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Affects allied heroes, including illusions and buildings, invulnerable and hidden units. Does not affect creep-heroes.",
        "Does not affect creep-heroes.",
        "Does not affect units that have been affected by Guard in the last 34 seconds. A status buff icon on affected units shows how much time is left for it to be able to get affected by the aforementioned abilities again. The stack limit duration is set upon cast and is unaffected by cooldown manipulation.",
        "A status buff icon on affected units shows how much time is left for it to be able to get affected by the aforementioned abilities again.",
        "The stack limit duration is set upon cast and is unaffected by cooldown manipulation.",
        "Guard has an ensured damage block. Therefore damage block with a lower value (e.g. Vanguard etc.) will not proc, since the higher damage block value takes priority.",
        "Does not work against damage from wards sources (e.g. Death Ward etc.).",
        "Does not reduce physical damage from abilities, except for these spells.",
        "Stacks with all other sources of Damage Block.",
        "Damage Block uses pseudo-random distribution."
      ],
      "mana": "0",
      "abilityName": "Guard",
      "cooldown": "35",
      "description": "For 12 seconds, grant nearby allied heroes and buildings a 100% chance to block 75 damage from each incoming attack. Units may only be affected by Guard once every 34 seconds.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Proc Chance: 60%",
        "Blocked Damage (TagAghanimMelee): 75",
        "Blocked Damage (TagAghanimRanged): 50"
      ],
      "notes": [
        "Does not work against damage from wards sources (e.g. Death Ward etc.).",
        "Does not reduce physical damage from abilities, except for these spells.",
        "Stacks with all other sources of damage block.",
        "Damage Block uses pseudo-random distribution."
      ],
      "mana": null,
      "abilityName": "Damage Block",
      "cooldown": null,
      "description": "Grants a 60% chance to block 75 damage from incoming attacks on melee heroes, and 50 damage on ranged.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The proc chances of all sources of Damage Block work independently from each other.",
    "When multiple sources of Damage Block proc on the same attack, only the one with the highest blocked damage value takes effect."
  ],
  "cost": "3600",
  "lore": null,
  "consistFrom": [
    "Vanguard",
    "Helm of Iron Will",
    "Recipe"
  ],
  "name": "Crimson Guard",
  "description": "A cuirass originally built to protect against the dreaded Year Beast.",
  "trivia": [
    "The icon for this item is based on the armor worn by Ember Spirit on an old concept artwork."
  ],
  "upgradeIn": null,
  "tips": [
    "The high damage block of Crimson Guard's active is good against illusions because their low damage is heavily reduced or negated completely.",
    "Similarly, it is good against small summons such as Undying Zombie, Spiderling, Spiderite or Treant to name a few.",
    "Crimson Guard is effective against armor reduction as the damage block takes effect before the damage reduction of armor. This means that if incoming damage is actually going to be amplified due to negative armor, a large portion of it can be blocked before it is amplified.",
    "The damage block and armor reduces a lot the damage returned by an enemy Blade Mail.",
    "Best combined with Pipe of Insight or other sources of barrier."
  ]
}