{
  "abilities": [
    {
      "notes": [
        "The intelligence talent effectively grants Skywrath Mage 120 mana, 0.5 mana regeneration, and 10 main attack damage.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+450 Mystic Flare Damage",
          "talentRight": "Arcane Bolt Pierces Spell Immunity"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+12% Ancient Seal Magic Resistance Reduction",
          "talentRight": "Global Concussive Shot"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1 Arcane Bolt Per Cast",
          "talentRight": "-8s Ancient Seal Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 Intelligence",
          "talentRight": "+175 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Skywrath_Mage_Arcane_Bolt_1.mp3\/revision\/latest?cb=20191216023606",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The bolt travels at a speed of 500. The projectile has a 325 radius flying vision. This vision does not linger. Also provides the same vision at the target's location for 3.34 seconds upon successfully hitting it.",
        "The projectile has a 325 radius flying vision. This vision does not linger.",
        "Also provides the same vision at the target's location for 3.34 seconds upon successfully hitting it.",
        "Checks Skywrath Mage's intelligence upon releasing the projectile. This means that the projectile's damage is set upon launch and does not adapt when losing or gaining intelligence.",
        "This means that the projectile's damage is set upon launch and does not adapt when losing or gaining intelligence.",
        "This is how much damage Arcane Bolt deals with a certain amount of intelligence (before reductions): Level 1 (25 intelligence): 110\/130\/150\/170 damage Level 5 (41 intelligence): 133\/153\/173\/193 damage Level 10 (61 intelligence): 162\/182\/202\/222 damage Level 15 (82 intelligence): 190\/210\/230\/250 damage Level 20 (102 intelligence): 219\/239\/259\/279 damage Level 25 (123 intelligence): 248\/268\/288\/308 damage Level 30 (143 intelligence): 276\/296\/316\/336 damage",
        "Level 1 (25 intelligence): 110\/130\/150\/170 damage",
        "Level 5 (41 intelligence): 133\/153\/173\/193 damage",
        "Level 10 (61 intelligence): 162\/182\/202\/222 damage",
        "Level 15 (82 intelligence): 190\/210\/230\/250 damage",
        "Level 20 (102 intelligence): 219\/239\/259\/279 damage",
        "Level 25 (123 intelligence): 248\/268\/288\/308 damage",
        "Level 30 (143 intelligence): 276\/296\/316\/336 damage",
        "",
        "With Aghanim's Scepter, whenever Arcane Bolt is cast, a different random target within the search radius is also targeted by a second Arcane Bolt. The search radius is centered around the primary target, not around Skywrath Mage. Since it uses a defined radius and is not based on the cast range, it is not affected by cast range modifying abilities (e.g. Aether Lens). Prioritizes heroes (including illusions and clones) over other units. Treats creep-heroes as creeps. If no other valid targets are found within the search radius, the second Arcane Bolt is not released. The level 15 talent adds a third target to this, following the same rules.",
        "The search radius is centered around the primary target, not around Skywrath Mage.",
        "Since it uses a defined radius and is not based on the cast range, it is not affected by cast range modifying abilities (e.g. Aether Lens).",
        "Prioritizes heroes (including illusions and clones) over other units. Treats creep-heroes as creeps.",
        "If no other valid targets are found within the search radius, the second Arcane Bolt is not released.",
        "The level 15 talent adds a third target to this, following the same rules."
      ],
      "mana": "90",
      "hotKey": "Q",
      "cooldown": "5\/4\/3\/2",
      "description": "Skywrath Mage launches a slow-moving bolt of arcane magic, dealing damage to an enemy unit based on Skywrath Mage's intelligence.",
      "spellName": "Arcane Bolt",
      "params": [
        "Cast Animation: 0.1+0.9",
        "Cast Range: 875",
        "Number of Targets: 1 (TagTalent 2) (TagTalent 2, 3)",
        "Base Damage: 75\/95\/115\/135",
        "Bonus Damage per Intelligence: 1.4",
        "Secondary Targets Search Radius: 700 (TagTalent 700)",
        "When Skywrath Mage casts Arcane Bolt, a different random target within 700 range willl be hit with the same ability. Heroes will take priority.",
        "Does not pierce spell immunity. Fully pierces spell immunity.",
        "Blocked upon impact, as primary and secondary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Skywrath_Mage_Concussive_Shot_1.mp3\/revision\/latest?cb=20191216023609",
      "effects": [
        "Ability No Target",
        "Affects Enemy Heroes",
        "Damage Magical"
      ],
      "notes": [
        "Concussive Shot interrupts Skywrath Mage's channeling abilities upon cast.",
        "Concussive Shot travels at a speed of 800. The projectile has 300 radius flying vision. This vision does not linger. Also provides the same vision at the target's location for 3.34 seconds upon successfully hitting it.",
        "The projectile has 300 radius flying vision. This vision does not linger.",
        "Also provides the same vision at the target's location for 3.34 seconds upon successfully hitting it.",
        "Concussive Shot targets the closest enemy unit that is not a ward, a building, or a creep-hero. Prioritizes heroes (including clones) over other units. Treats illusions as creeps. Does not target invisible or hidden units or units in the Fog of War.",
        "Prioritizes heroes (including clones) over other units. Treats illusions as creeps.",
        "Does not target invisible or hidden units or units in the Fog of War.",
        "The area damage deals 75\/120\/165\/210 damage to creeps. Treats creep-heroes as creeps.",
        "The shot first applies the damage, then the debuff.",
        "With Aghanim's Scepter, whenever Concussive Shot is cast, a different random target within the search radius is also targeted by a second Concussive Shot. Uses the same search radius as the primary projectile, but slightly different targeting behaviors Targets the closest enemy unit that is not a ward or a building. Prioritizes heroes (including clones, illusions, and creep-heroes) over other units. Does not target invisible, invulnerable, hidden, or spell immune units or units in the Fog of War. If no other valid targets are found within the search radius, the second Concussive Shot is not released.",
        "Uses the same search radius as the primary projectile, but slightly different targeting behaviors",
        "Targets the closest enemy unit that is not a ward or a building.",
        "Prioritizes heroes (including clones, illusions, and creep-heroes) over other units.",
        "Does not target invisible, invulnerable, hidden, or spell immune units or units in the Fog of War.",
        "If no other valid targets are found within the search radius, the second Concussive Shot is not released."
      ],
      "mana": "80\/85\/90\/95",
      "hotKey": "W",
      "cooldown": "15\/14\/13\/12",
      "description": "Skywrath Mage sets off a long range shot that hits the closest hero within a long range. Upon impact, it deals damage and slows in an area of effect.",
      "spellName": "Concussive Shot",
      "params": [
        "Cast Animation: 0+1.03",
        "Search Radius: 1600 (TagTalent Global)",
        "Damage & Slow Radius: 250",
        "Number of Targets: 1 (TagAghanim 2)",
        "Hero Damage: 100\/160\/220\/280",
        "Creep Damage Percentage: 75%",
        "Move Speed Slow: 40%",
        "Slow Duration: 4",
        "When Skywrath Mage casts Concussive Shot, a different random target within cast range will be hit with the same ability. Heroes will take priority.",
        "Can target spell immune enemies, but does not slow or damage them. The area effects are still applied. Cannot target secondary spell immune units.",
        "Disjointing the projectile causes it to completely fizzle."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e1\/Skywrath_Mage_Ancient_Seal.mp3\/revision\/latest?cb=20191216023604",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Reduces most heroes' total magic resistance to 2%\/-1%\/-5%\/-9% (TagTalent -7%\/-10%\/-14%\/-18%). The magic resistance reduction does not affect non-hero units.",
        "The magic resistance reduction does not affect non-hero units.",
        "Successive casts on the same target do not stack, but refresh the duration instead.",
        "With Aghanim's Scepter, whenever Ancient Seal is cast, a different random target within the search radius is also targeted. The search radius is centered around the primary target, not around Skywrath Mage. Prioritizes heroes (including illusions and clones) over other units. Treats creep-heroes as creeps. If no other valid targets are found within the search radius, the second Ancient Seal is not applied.",
        "The search radius is centered around the primary target, not around Skywrath Mage.",
        "Prioritizes heroes (including illusions and clones) over other units. Treats creep-heroes as creeps.",
        "If no other valid targets are found within the search radius, the second Ancient Seal is not applied."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "E",
      "cooldown": "14 (TagTalent 6)",
      "description": "Skywrath Mage seals the targeted unit with an ancient rune, silencing it and causing it to take additional damage from spells.",
      "spellName": "Ancient Seal",
      "params": [
        "Cast Animation: 0.1+0.97",
        "Cast Range: 700\/750\/800\/850",
        "Number of Targets: 1 (TagAghanim 2)",
        "Magic Resistance Reduction: 30%\/35%\/40%\/45% (TagTalent 42%\/47%\/52%\/57%)",
        "Duration: 3\/4\/5\/6",
        "Secondary Target Search Radius: 700",
        "Anytime Skywrath Mage casts Ancient Seal, a different random target within 700 range will be affected by the same ability. Heroes will take priority.",
        "Blocked only for the primary target. Secondary target still gets hit."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Skywrath_Mage_Mystic_Flare_1.mp3\/revision\/latest?cb=20191216023602",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "If enemy heroes are within the radius (including illusions, clones and creep-heroes), only the heroes are affected. Completely ignores spell immune, invulnerable and hidden units.",
        "Completely ignores spell immune, invulnerable and hidden units.",
        "Deals damage in 0.1-second intervals, starting 0.1 seconds after cast, resulting in 22 damage instances.",
        "This is how much damage Mystic Flare deals when hitting a certain amount of units for the full duration (before reductions): 1 Unit: 34.09\/53.41\/72.73 (TagTalent 54.55\/73.86\/93.18) per interval, and 750\/1175\/1600 (TagTalent 1200\/1625\/2050) total damage. 2 Units: 17.05\/26.7\/36.36 (TagTalent 27.27\/36.93\/46.59) per interval, and 375\/587.5\/800 (TagTalent 600\/812.5\/1025) total damage. 3 Units: 11.36\/17.8\/24.24 (TagTalent 18.18\/24.62\/31.06) per interval, and 250\/391.67\/533.33 (TagTalent 400\/541.67\/683.33) total damage. 4 Units: 8.52\/13.35\/18.18 (TagTalent 13.64\/18.47\/23.3) per interval, and 187.5\/293.75\/400 (TagTalent 300\/406.25\/512.5) total damage. 5 Units: 6.82\/10.68\/14.55 (TagTalent 10.91\/14.77\/18.64) per interval, and 150\/235\/320 (TagTalent 240\/325\/410) total damage.",
        "1 Unit: 34.09\/53.41\/72.73 (TagTalent 54.55\/73.86\/93.18) per interval, and 750\/1175\/1600 (TagTalent 1200\/1625\/2050) total damage.",
        "2 Units: 17.05\/26.7\/36.36 (TagTalent 27.27\/36.93\/46.59) per interval, and 375\/587.5\/800 (TagTalent 600\/812.5\/1025) total damage.",
        "3 Units: 11.36\/17.8\/24.24 (TagTalent 18.18\/24.62\/31.06) per interval, and 250\/391.67\/533.33 (TagTalent 400\/541.67\/683.33) total damage.",
        "4 Units: 8.52\/13.35\/18.18 (TagTalent 13.64\/18.47\/23.3) per interval, and 187.5\/293.75\/400 (TagTalent 300\/406.25\/512.5) total damage.",
        "5 Units: 6.82\/10.68\/14.55 (TagTalent 10.91\/14.77\/18.64) per interval, and 150\/235\/320 (TagTalent 240\/325\/410) total damage.",
        "",
        "A hidden debuff is responsible for the particle effects on hit enemies. It has only visual purposes. The debuff is placed by an aura, and lingers for 0.5 seconds.",
        "The debuff is placed by an aura, and lingers for 0.5 seconds.",
        "With Aghanim's Scepter, casting Mystic Flare automatically casts another Mystic Flare centered on a random enemy within the search radius but outside the 170 effect radius. The search radius is centered around the targeted area, not around Skywrath Mage. Prioritizes heroes (including illusions and clones) over other units. Treats creep-heroes as creeps. Ignores spell immune or invulnerable units within the search radius. If no other valid targets are found within the search radius, the second Mystic Flare is not released.",
        "The search radius is centered around the targeted area, not around Skywrath Mage.",
        "Prioritizes heroes (including illusions and clones) over other units. Treats creep-heroes as creeps.",
        "Ignores spell immune or invulnerable units within the search radius.",
        "If no other valid targets are found within the search radius, the second Mystic Flare is not released."
      ],
      "mana": "300\/550\/800",
      "hotKey": "R",
      "cooldown": "60\/40\/20",
      "description": "Skywrath Mage uses his ultimate magical ability to conjure a precise and violent mystical field that lays waste to his adversaries. Deals massive damage distributed evenly among any Heroes in the area over seconds.",
      "spellName": "Mystic Flare",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range: 1200",
        "Flare Radius: 170",
        "Number of Flares: 1 (TagAghanim 2)",
        "Total Damage: 750\/1175\/1600 (TagTalent 1200\/1625\/2050)",
        "Flare Duration: 2.2",
        "Secondary Target Search Radius: 700",
        "When Skywrath Mage casts Mystic Flare, another Mystic Flare will be created on the position of a different random target enemy within 700 range. Heroes will take priority."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Does not trigger on active item abilities, on abilities with 0 cooldown, or on abilities which do not trigger on-cast effects.",
        "Each stack has its own duration, successive spell casts do not refresh the duration of previous stacks. The stacking modifier is not visible in the HUD. Instead, a counting modifier is visible, showing the current amount of stacks on the icon. Although the counting modifier is dispelled on death, the stacks themselves are not, so dying only removes the information of current number of stacks.",
        "The stacking modifier is not visible in the HUD. Instead, a counting modifier is visible, showing the current amount of stacks on the icon.",
        "Although the counting modifier is dispelled on death, the stacks themselves are not, so dying only removes the information of current number of stacks.",
        "Each stack effectively grants 60 mana, 0.25 mana regeneration, and 5 main attack damage."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Everytime you cast abilities you gain +5 Intelligence and +1 Armor for 35 seconds. Stacks independently.",
      "spellName": "Hero Shard Upgrade",
      "params": [
        "Intelligence Bonus per Stack: 5",
        "Armor Bonus per Stack: 1",
        "Duration: 35"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 4.1,
    "attrAgilityInc": 0.8,
    "attrAgility": 13.0
  },
  "description": "Dragonus, the Skywrath Mage, is a ranged intelligence hero equipped with tremendously powerful nukes, able to enhance magical damage and thus scales well into late game. However, he is a proverbial glass cannon; while he can bring superb amounts of damage, he is dangerously vulnerable and will most likely meet a swift end if the player isn't careful. Arcane Bolt is his main spell; its damage is based on his current Intelligence level. Concussive Shot blasts the nearest enemy hero, along with nearby units around the foe, slowing them down. The Ancient Seal marks the target with magic amplification and silence, leaving the target vulnerable to magic and unable to cast spells. Skywrath Mage's ultimate Mystic Flare is one of the most dangerous nukes in the game. Enemy heroes caught in this field will suffer massive damage. Its power is split equally among enemy heroes within its radius; if it is used on a single hero, it will deal its full damage potential. His spells are most effective when targeted on a lone hero and thus suffer decreased effectiveness when used on groups.",
  "history": "A highly placed mage in the court of the Ghastly Eyrie, Dragonus lives a troubled existence. Sworn by birth to protect whoever sits within the Nest of Thorns, he hates the current Skywrath queen with all his soul. As a youth, high-born, he was a friend and companion to the eldest Skywrath princess, Shendelzare, first in line for the Nest. He had loved her warmly and unshakably, but as his studies took hold, his mind turned to arcane learning and the mastery of Skywrath sorcery. Obsessed with matters aetherial, he missed the mundane signs of courtly treachery that hinted at a plot against Shendelzare, and lost his chance to foil it. When the court was shaken by a swift and violent coup, he emerged from his studies to discover his oldest and dearest friend had been lost to him. The Nest of Thorns now belonged to Shendelzare's ruthless younger sister, and Dragonus could do nothing. The magic of the Skywrath Mage serves only the sworn protector of the Skywrath scion, so to act against the Nest would render him helpless. He clings to his post, believing it to be the best hope of one day restoring his true love to her rightful place. Meanwhile, his secret is known only to the goddess Scree'auk, whose magic it was transformed Shendelzare from a crippled physical creature into an embodiment of pure vengeful energy. While he dreams of restoring his beloved queen to the Ghastly Eyrie, he dreams even more desperately of restoring Shendelzare herself to a fully healed physical form. The duplicity of his role at court tortures him, for he is a noble and good-hearted creature; but the worst torture of all is imagining the hatred that Vengeful Spirit must hold in her heart for him.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+450 Mystic Flare Damage",
      "talentRight": "Arcane Bolt Pierces Spell Immunity"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+12% Ancient Seal Magic Resistance Reduction",
      "talentRight": "Global Concussive Shot"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1 Arcane Bolt Per Cast",
      "talentRight": "-8s Ancient Seal Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 Intelligence",
      "talentRight": "+175 Health"
    }
  ]
}