{
  "abilities": [
    {
      "effects": [
        "Cast Range: 750",
        "Push Distance: 600",
        "Push Duration: 0.5"
      ],
      "notes": [
        "Double clicking the item casts it on self.",
        "Pushes the target at a speed of 1200.",
        "The target is not disabled during the push, so it still can cast spells or items, attack and turn during the push.",
        "It also means that it does not cancel channeling spells of the target. However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them.",
        "Does not push units affected by Black Hole, Chronosphere, Duel, Flaming Lasso, or Kinetic Field.",
        "If the target is leashed by Pounce, the leash gets instantly broken upon cast. However, it cannot break the leash when getting leashed during the push. The pushed unit gets stopped at Pounce's max radius.",
        "Can target any unit, except for wards and buildings. It can also push a Homing Missile.",
        "Can force units over impassable terrain. Trees within 100 radius around the pushed target get destroyed during the push.",
        "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement.",
        "Shares cooldown with Hurricane Pike."
      ],
      "elements": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "name": "Force",
      "description": "Pushes any target unit 600 units in the direction it is facing."
    }
  ],
  "contains": [
    "Staff_of_Wizardry",
    "Ring_of_Regen",
    "Recipe"
  ],
  "cost": "2250",
  "description": "Allows you to manipulate others, for good or evil.",
  "trivia": [
    "Crystal Maiden's cosmetic item, Force Staff, is based on Force Staff and shares its name."
  ],
  "further": [
    "Hurricane_Pike"
  ],
  "tips": [
    "This is an overall good and cheap utility item for saving allies and messing up enemy positioning.",
    "Force can push units over cliffs and through trees, making it a great chasing or escaping item.",
    "It is also good for countering Heroes that can make impassable barriers, such as Earthshaker, Clockwerk or Nature's Prophet.",
    "Unlike Blink Dagger, the item is not disabled when receiving damage, allowing for both initiation and escape (but the distance is shorter). And it can be upgraded into an hurricane pike even for melee heroes late game to get extra stats compared to the blink dagger.",
    "Force Staff is the cheapest item to disable a Linken's Sphere allowing you to use more powerful spells like Hex from a Scythe of Vyse and\/or Soul Rend from Bloodthorn.",
    "When chasing enemies, the Force Staff can be used to chase down enemies easily and disable them although one should use it with extreme caution."
  ],
  "attrs": [
    "Active Force",
    "Bonus +10 Intelligence +2.5 Health regeneration",
    "Disassemble? No",
    "Alert allies? No"
  ],
  "info": [
    "For strength heroes, it grants 2.5 health regen, 120 mana, 0.5 mana regen and 0.7% spell damage.",
    "For agility heroes, it grants 2.5 health regen, 120 mana, 0.5 mana regen and 0.7% spell damage.",
    "For intelligence heroes, it grants 2.5 health regen, 150 mana, 0.63 mana regen, 0.88% spell damage and 10 attack damage."
  ]
}