{
  "abilities": [
    {
      "notes": [
        "The armor talent does not benefit illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "1.5s Sidekick Spell Immunity",
          "talentRight": "+1.5s Unleash Pulse Silence"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 Movement Speed",
          "talentRight": "+25% Sidekick Lifesteal"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+200 Rebound Cast\/Jump Range",
          "talentRight": "+0.5s Dispose Stun Duration"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+2 Mana Regen",
          "talentRight": "+5 Armor"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Marci_Dispose_1.mp3\/revision\/latest?cb=20211029201345",
      "effects": [
        "Ability Target Unit",
        "Affects Allies \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Although seeming like a melee ability, the cast range can be further increased by other cast range bonuses. However, it is not affected by attack range bonuses.",
        "Moves the target in an arc over Marci's head, with a height of 150. The throw always takes 0.5 seconds. The target is fully disabled during the throw, and always lands 350 range behind Marci, so the throw distance varies based on the target's location. With the throw and stun duration, the affected enemy is disabled for 1.4\/1.8\/3.2\/2.6 (TagTalent 1.9\/2.3\/3.7\/3.1) seconds.",
        "The target is fully disabled during the throw, and always lands 350 range behind Marci, so the throw distance varies based on the target's location.",
        "With the throw and stun duration, the affected enemy is disabled for 1.4\/1.8\/3.2\/2.6 (TagTalent 1.9\/2.3\/3.7\/3.1) seconds.",
        "The damage and stun are applied upon landing, and affects the target as well if it was an enemy. Thrown allies are not affected. Dispose first applies the stun, then the damage.",
        "Dispose first applies the stun, then the damage.",
        "Can be cast on, but cannot move Roshan. The area damage and stun are applied instantly around Roshan.",
        "The throw can only be interrupted by death or by other sources of forced movement. When interrupted, the area damage and stun are applied prematurely at the unit's current location.",
        "When interrupted, the area damage and stun are applied prematurely at the unit's current location.",
        "Cannot be cast on Courier, wards, buildings, and invulnerable units."
      ],
      "mana": "90",
      "hotKey": "Q",
      "cooldown": "16\/14\/12\/10",
      "description": "Marci grabs an allied or enemy target and throws it effortlessly behind her, damaging and stunning the unit if it's an enemy. Any enemy units in the landing area will also be damaged and stunned.",
      "spellName": "Dispose",
      "params": [
        "Cast Animation: 0.2+1.04",
        "Cast Range: 175",
        "Landing Radius: 275",
        "Landing Distance: 350",
        "Landing Damage: 70\/120\/170\/220",
        "Throw Duration: 0.5",
        "Stun Duration: 0.9\/1.3\/2.7\/2.1 (TagTalent 1.4\/1.8\/3.2\/2.6)",
        "Can be cast on spell immune allies. Cannot be cast on spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4a\/Marci_Rebound_1.mp3\/revision\/latest?cb=20211029201355",
      "effects": [
        "Ability Target Unit \/ Vector Targeting",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Marci dashes towards the target at a speed of 2000. Can dash over impassable terrain and through trees.",
        "Launches a projectile on cast, and periodically drags Marci along with it. The visual effects around Marci come from that projectile.",
        "If the distance between the target and Marci becomes greater than the current cast range +700 at any time, the dash stops. However, the projectile itself does not stop. If re-cast before the projectile reaches the target, it may cause the leap of the new cast to trigger earlier.",
        "However, the projectile itself does not stop. If re-cast before the projectile reaches the target, it may cause the leap of the new cast to trigger earlier.",
        "Upon reaching the target, Marci leaps towards the targeted direction, facing towards that direction. The leap has a minimum duration of 0.1 and maximum of 0.2 seconds, and a minimum height of 200 and maximum of 250.",
        "The leap has a minimum duration of 0.1 and maximum of 0.2 seconds, and a minimum height of 200 and maximum of 250.",
        "During the dash and the leap, Marci is fully disabled.",
        "If targeted unit is an ally, they receive 35% movement speed bonus. Targeted enemies are neither debuffed nor damaged.",
        "Marci does not land at the center of the area of effect. Instead, she lands 64 range away from the center, towards where she leapt from. With the position offset and leap distance, the actual minimum and maximum distance is 386 – 736 (TagTalent 936). This means the damage and slow radius is always located 64 range in front of Marci upon landing.",
        "With the position offset and leap distance, the actual minimum and maximum distance is 386 – 736 (TagTalent 936).",
        "This means the damage and slow radius is always located 64 range in front of Marci upon landing.",
        "The dash can only be interrupted by death or by other sources of Forced Movement. The leap can only be interrupted by other sources of forced movement. If interrupted at any point, the ability fully cancels.",
        "The leap can only be interrupted by other sources of forced movement.",
        "If interrupted at any point, the ability fully cancels.",
        "Rebound first applies the damage, then the slow within the area.",
        "Cannot be cast on Courier, wards, buildings, and invulnerable units."
      ],
      "mana": "70\/80\/90\/100",
      "hotKey": "W",
      "cooldown": "17\/15\/13\/11",
      "description": "Vector targeted. Marci bounds to the targeted unit, choosing a direction and distance she will spring away from it. Upon reaching the unit, Marci lunges to her final destination, damaging and slowing enemies in the area. If the unit she runs to is an ally, it receives 35% bonus movement speed for 5s.",
      "spellName": "Rebound",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range: 800 (TagTalent 1000)",
        "Min Leap Distance: 450",
        "Max Leap Distance: 800 (TagTalent 1000)",
        "Landing Position Offset: 64",
        "Landing Radius: 325",
        "Landing Damage: 90\/160\/230\/300",
        "Landing Move Speed Slow: 30%\/40%\/50%\/60%",
        "Ally Move Speed Bonus: 35%",
        "Slow Duration: 3",
        "Ally Buff Duration: 5",
        "Can be cast on any spell immune unit. Can place the buff on spell immune enemies. Does not affect spell immune enemies within the area.",
        "Neither triggers Spell Block, nor Spell Reflection.",
        "When disjointed, Marci stops at the target's last location before the disjoint.",
        "Cannot be cast while rooted. Getting rooted after cast does not cancel the cast."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a2\/Marci_Sidekick.mp3\/revision\/latest?cb=20211029201400",
      "effects": [
        "Ability Target Unit",
        "Affects Self \/ Allied Heroes"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self. When cast on self, Sidekick searches for the nearest ally within a 700 radius around Marci. If no ally is found, Marci gets the buff normally. The 0.54 cast backswing is only used when there is an ally within the search radius, self-casting has no cast backswing. Cast range increasing effects increases the search radius as well.",
        "When cast on self, Sidekick searches for the nearest ally within a 700 radius around Marci. If no ally is found, Marci gets the buff normally.",
        "The 0.54 cast backswing is only used when there is an ally within the search radius, self-casting has no cast backswing.",
        "Cast range increasing effects increases the search radius as well.",
        "Can only be cast on, and only searches for allied heroes, including illusions, clones, and creep-heroes.",
        "Grants regular flat bonus attack damage.",
        "Stacks additively with other sources of lifesteal. Cannot lifesteal off of buildings or allied units. Can lifesteal off of wards that do not require a fixed amount of attacks to be destroyed.",
        "Cannot lifesteal off of buildings or allied units.",
        "Can lifesteal off of wards that do not require a fixed amount of attacks to be destroyed.",
        "With the level 25 talent, Sidekick also applies a basic dispel and grants spell immunity to Marci and the ally. The spell immunity granted does not apply a spell immunity dispel. Therefore certain debuffs (e.g. Pounce) only dispellable by spell immunity are not removed. Sidekick first applies the buff, and then the spell immunity buff.",
        "The spell immunity granted does not apply a spell immunity dispel. Therefore certain debuffs (e.g. Pounce) only dispellable by spell immunity are not removed.",
        "Sidekick first applies the buff, and then the spell immunity buff."
      ],
      "mana": "45\/40\/35\/30",
      "hotKey": "E",
      "cooldown": "36\/28\/20\/12",
      "description": "Marci's loyalty helps ensure survival, imbuing a chosen allied hero and herself with lifesteal and attack damage.",
      "spellName": "Sidekick",
      "params": [
        "Cast Animation: 0+0.54",
        "Cast Range: 700",
        "Ally Search Radius: 700",
        "Attack Damage Bonus: 20\/35\/50\/65",
        "Lifesteal: 35%\/40%\/45%\/50% (TagTalent 60%\/65%\/70%\/75%)",
        "Buff Duration: 6",
        "Spell Immunity Duration: 1.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e6\/Marci_Unleash_1.mp3\/revision\/latest?cb=20211029201402",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Applies a basic dispel on Marci upon cast.",
        "While active, Unleash unlocks maximum attack speed and removes the 700 attack speed cap for Marci. The 700\/975\/1325 attack speed bonus is only gained while having the Flurry buff. An attack charge is consumed whenever an attack is executed, missed attacks use up charges as well. The number of remaining attacks is visible on the buff icon and on top of Marci. The buff and the visual effects of the ability are visible to everyone.",
        "The 700\/975\/1325 attack speed bonus is only gained while having the Flurry buff.",
        "An attack charge is consumed whenever an attack is executed, missed attacks use up charges as well.",
        "The number of remaining attacks is visible on the buff icon and on top of Marci. The buff and the visual effects of the ability are visible to everyone.",
        "Upon finishing the Flurry combo, Unleash releases a pulse around the attack target on the last attack and removes the Flurry buff. This pulse deals 60\/130\/200 damage within its radius, slows and silences them. The attack releasing the pulse first applies pulse debuff, then the pulse damage, then the silence, then its own attack damage.",
        "This pulse deals 60\/130\/200 damage within its radius, slows and silences them.",
        "The attack releasing the pulse first applies pulse debuff, then the pulse damage, then the silence, then its own attack damage.",
        "Upon starting a Flurry combo, all attacks must be executed within 1 second, otherwise, the combo fails and the Flurry buff is lost.",
        "Upon losing the Flurry buff in any way, the cooldown debuff is applied. If the flurry combo was executed successfully, Marci's base attack rate is set to a fixed 2 seconds by this debuff afterward. This prevents her from performing attacks for 2 seconds after the last strike. The fixed attack rate resets as the next flurry starts, effectively preventing her from attacking for 1.75 seconds. If the Flurry cooldown was applied by failing the combo, her base attack rate will not be changed and she can attack normally.",
        "If the flurry combo was executed successfully, Marci's base attack rate is set to a fixed 2 seconds by this debuff afterward. This prevents her from performing attacks for 2 seconds after the last strike.",
        "The fixed attack rate resets as the next flurry starts, effectively preventing her from attacking for 1.75 seconds.",
        "If the Flurry cooldown was applied by failing the combo, her base attack rate will not be changed and she can attack normally.",
        "Once the cooldown debuff expires, she gains the Flurry buff again, with a new set of 3\/4\/5 charges. This repeats indefinitely while Unleash is active, there is no limit to how many Flurry buffs can be gained.",
        "This repeats indefinitely while Unleash is active, there is no limit to how many Flurry buffs can be gained."
      ],
      "mana": "100\/125\/150",
      "hotKey": "R",
      "cooldown": "110\/90\/70",
      "description": "Marci taps a hidden power, gaining Fury charges that allow her to deliver a rapid sequence of strikes. The last strike in every Fury combo creates a damaging pulse around the target that slows movement and attack speed for 2s. In between Fury combos, Marci is unable to attack for 1.75s. Marci receives a basic dispel when Unleash is cast and gains 15% movement speed.",
      "spellName": "Unleash",
      "params": [
        "Cast Animation: 0.2+0.34",
        "Self Move Speed Bonus: 15%",
        "Attacks per Flurry: 3\/4\/5",
        "Flurry Attack Speed Bonus: 700\/975\/1325",
        "Flurry Time Window: 1",
        "Flurry Cooldown: 1.75",
        "Pulse Radius: 800",
        "Pulse Damage: 60\/130\/200",
        "Pulse Move Speed Slow: 30%",
        "Pulse Attack Speed Slow: 60\/80\/100",
        "Pulse Debuff Duration: 2",
        "Duration: 16",
        "Pulse Silence Duration: 1.5",
        "Can be cast while spell immune. Attacks against spell immune units fully count. Pulse does not affect spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 23.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.4,
    "attrAgility": 20.0
  },
  "description": "Marci is...",
  "history": "Admired by many, Marci's origins are known to nameless few. She travels mostly in the company of the Princess Mirana, but the roots of their friendship are entwined in secrets neither would ever needlessly reveal. To allies, she serves as fierce and honest companion. To enemies, she acts as dauntless deterrence against harming any she deems friend. Though unwise opponents may consider her size unremarkable, Marci possesses an inner power that imbues her strikes with incredible might. She'll decimate those who think to test her, but those who earn her favor will have an unflappable confidant for life.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "1.5s Sidekick Spell Immunity",
      "talentRight": "+1.5s Unleash Pulse Silence"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 Movement Speed",
      "talentRight": "+25% Sidekick Lifesteal"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+200 Rebound Cast\/Jump Range",
      "talentRight": "+0.5s Dispose Stun Duration"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+2 Mana Regen",
      "talentRight": "+5 Armor"
    }
  ]
}