{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Trusty_Shovel_Dig.mp3\/revision\/latest?cb=20191227195721",
      "effects": [
        "Cast Animation: 0.1+0",
        "Channel Time: 1",
        "Bounty Rune Drop Chance: 16%",
        "Healing Salve Drop Chance: 28%",
        "Enchanted Mango Drop Chance: 28%",
        "Kobold Drop Chance: 28%"
      ],
      "notes": [
        "The channeling must succeed to get a reward.",
        "Can dig up a Bounty Rune, a Healing Salve (75 ), an Enchanted Mango (65 ), or a neutral Kobold.",
        "Since the dug-up Kobold is a neutral unit, it attacks both factions, can drop neutral items, and scales like other neutral creeps as well. Kobold gives an average gold bounty of 6 .",
        "Kobold gives an average gold bounty of 6 .",
        "Dug-up items cannot be sold, are fully shareable, cannot be destroyed, and don't count towards Net Worth.",
        "Stacks of dug-up items can be combined with stacks of regular items, even if the regular item is owned by a different player. If this happens, the whole stack becomes unsellable and cannot be destroyed. If a stack of dug-up items is combined into a stack of regular items, the whole stack becomes unshareable and retains the owner. If a stack of regular items is combined into a stack of dug-up items, the whole stack becomes completely shareable. This type of merge cannot happen if both stacks are already in the inventory (dragging the slot of regular items into the slot of dug-up items doesn't merge them, but swaps them instead). The merge must happen by obtaining a stack of regular items while a stack of dug-up items is in the inventory.",
        "If this happens, the whole stack becomes unsellable and cannot be destroyed.",
        "If a stack of dug-up items is combined into a stack of regular items, the whole stack becomes unshareable and retains the owner.",
        "If a stack of regular items is combined into a stack of dug-up items, the whole stack becomes completely shareable. This type of merge cannot happen if both stacks are already in the inventory (dragging the slot of regular items into the slot of dug-up items doesn't merge them, but swaps them instead). The merge must happen by obtaining a stack of regular items while a stack of dug-up items is in the inventory.",
        "This type of merge cannot happen if both stacks are already in the inventory (dragging the slot of regular items into the slot of dug-up items doesn't merge them, but swaps them instead). The merge must happen by obtaining a stack of regular items while a stack of dug-up items is in the inventory.",
        "The same Trusty Shovel cannot spawn the same reward twice in a row."
      ],
      "mana": "0",
      "abilityName": "Dig",
      "cooldown": "50",
      "description": "Channel for 1 second. Can find a Bounty Rune, a Flask, an Enchanted Mango, or an enemy Kobold.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c4\/Items_rune_bounty.mp3\/revision\/latest?cb=20201219110206",
      "effects": [
        "Initial Spawn Team Gold: 40",
        "Following Spawn Base Team Gold: 36",
        "Following Spawn Extra Team Gold per Interval: 9",
        "Extra Team Gold Interval: 300"
      ],
      "notes": [
        "Since Trusty Shovel can only be obtained past the 7:30th minute mark, the Bounty Runes will be worth at least 45 per hero. When bottling a Bounty Rune, it grants gold based on the time at which it is activated, not bottled.",
        "When bottling a Bounty Rune, it grants gold based on the time at which it is activated, not bottled.",
        "Using a stored Bounty Rune with Bottle only grant 2 charges.",
        "Grants reliable gold to each player of the team that picks it up.",
        "An over-head text shows how much gold was given exactly. This number is not visible to enemies.",
        "When gaining gold from a Bounty Rune, a small golden particle effect briefly bursts from the player, visible to everyone.",
        "In Turbo Mode, the gold given by Bounty Runes is doubled, despite the notification message showing standard values."
      ],
      "mana": null,
      "abilityName": "Bounty",
      "cooldown": null,
      "description": "Grants bonus Gold.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Trusty Shovel",
  "description": "Former plaything of a young deity, received as a gift from his uncle.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}