{"abilities":[{"effects":["Дальность применения: 140","Длительность оглушения: 2"],"notes":["Эффект мгновенный."],"elements":["Способность Направленная на юнита","Действует на Врагов"],"name":"Overwhelm","description":"Оглушает выбранного противника на 2 секунды. Проходит сквозь невосприимчивость к заклинаниям."},{"effects":["Шанс для героев ближнего боя: 25%","Шанс для героев дальнего боя: 10%","Урон: 100","Длительность оглушения: 1.5"],"notes":["Не сочетается с другим Abyssal Blade, Skull Basher.","При наличии нескольких предметов со способностью Bash, работать будет та которая дольше находится в инвентаре.","Бонусный урон от Bash может использоваться вампиризмом. Однако, не может быть критическим или прорубающим.","Урон можно уменьшить с Enfeeble или Static Link. Однако, нельзя усилить с помощью Empower или Руна двойного урона.","В среднем добавляет 25 урона каждой атаке для героев ближнего боя, и 10 урона для героев дальнего боя.","Не работает против вардов и строений, но работает против союзных юнитов.","Bash использует псевдо-случайное распределение."],"elements":["Способность Пассивная","Действует на Врагов","Урон Магический"],"name":"Bash","description":"Каждая атака может оглушить цель на 1.5 сек. и нанести 100 магического урона. Вероятность зависит от типа атаки владельца: 25% в ближнем бою, 10% — в дальнем."},{"effects":["Шанс: 50%","Блокирует урона (ближний): 70","Блокирует урона (дальний): 35"],"notes":["Не работает против вардов ( Plague Ward, Mass Serpent Ward, Death Ward).","Не уменьшает физический урон от заклинаний, кроме The Swarm.","Блокировка урона использует псевдо-случайное распределение.","Для деталей, смотрите Блокировка урона."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Damage Block","description":"С вероятностью в 50% блокирует 70 урона от атак, если владелец — герой ближнего боя, или 35 урона, если герой дальнего боя."}],"cost":"4500","description":"Острие потерянного клинка Повелителя бездны впивается врагу прямо в душу.","further":["Vanguard","Skull_Basher","Рецепт"],"attrs":["Активируемая Overwhelm","Пассивная Bash, Damage Block","Бонус +10 к силе +250 к здоровью +7 к регенерации здоровья +25 к урону","Можно разобрать? Да","Можно сообщать? Нет"],"info":["Для героев силы, даёт 450 здоровья, 8 регенерации здоровья, 0,8% сопротивления магии и 10 урона от атаки.","Для героев ловкости, даёт 450 здоровья, 8 регенерации здоровья и 0,8% сопротивления магии.","Для героев интеллекта, даёт 450 здоровья, 8 регенерации здоровья и 0,8% сопротивления магии.","В руках Slardar, Spirit Breaker, или Faceless Void Bash не срабатывает."]}