{"abilities":[{"spell":"Beastmaster sends his axes flying and calls them home again, slicing through enemy units and trees along their path. Each axe can hit an enemy once, and amplifies subsequent damage from Beastmaster and his units.","effects":["Ability Target Point","Affects Enemies","Damage Physical"],"notes":["The axes either travel at a speed of 1200 or reach the target point in one second, whichever is faster. The same applies upon returning. Upon returning, their speed periodically adapts based on their distance to Beastmaster and the remaining travel time. This means the axes fly a maximum of up to two seconds, up to one seconds towards the point and up to one second back.","The axe spread up to 450 distance away from each other before moving back together while traveling towards the targeted point.","The axes' minimum travel distance is 450 as well, so when targeting a point closer than 450 range, they still intersect 450 range away.","Both axes fly in arcs, so that the axe coming from Beastmaster's left hand travels back towards his right hand, and vice versa.","Uses one debuff on hit targets for all stacks. The debuff has a number on it, showing the amount of stacks.","Successive hits on the same unit fully refresh the whole stack's duration.","The axes first apply the debuff, then the damage. This means they effectively amplify their own damage as well. Since the axes work separate, one of the axes always benefits from 2 stacks of the debuff, if both hit.","A unit can only get hit once by each axe, so the maximum possible damage (before reductions and amplifications) is 60\/120\/180\/240 ( 210\/270\/330\/390).","The damage amplification only works for Beastmaster and all his units. Allies do not benefit from it.","Does not affect couriers.","The axes destroy trees within 175 radius around them.","Both axes grant 350 radius flying vision around themselves as they travel. This vision does not last.","Choosing the damage upgrading talent immediately upgrades all of Beastmaster's currently flying axes."],"mana":"80\/85\/90\/95","elements":["Does not pierce spell immunity."],"cooldown":"8 ( 0)","name":"Wild Axes","description":["Cast Animation: 0.4+0.47","Cast Range: 1500","Axes Radius: 175","Axes Travel Distance: 1500","Axes Spread Distance: 450","Damage per Axe: 30\/60\/90\/120 ( 105\/135\/165\/195)","Damage Amplification per Stack: 6%\/8%\/10%\/12%","Stack Duration: 10"],"hot_key":"Q","legacy_key":"W"},{"spell":"Beastmaster calls forth a Boar to aid in the battlefield.","effects":["Ability No Target"],"notes":["Leveling this spell automatically levels Call of the Wild Hawk as well.","Does not destroy a previous summon if this ability is used again before the previous Boar expires.","The boar spawns at a random location within a 100 radius around to Beastmaster."],"mana":"50","elements":[],"cooldown":"42\/38\/34\/30","name":"Call of the Wild Boar","description":["Cast Animation: 0.3+0.67","Number of Boars: 1","Summons Duration: 60"],"hot_key":"W","legacy_key":"D"},{"spell":"Beastmaster sends an invisible Hawk to scout an area.","effects":["Ability No Target"],"notes":["Leveling this spell automatically levels Call of the Wild Boar as well.","Does not destroy a previous summon if this ability is used again before the previous Hawk expires.","The hawk spawns at a random location within a 300 radius around to Beastmaster. It spawns invisible, without any fade time.","The hawk cannot be controlled at all. Once cast, it automatically flies towards the targeted area and stays there.","If the hawk gets its movement disabled (e.g. stunned, rooted, etc), it resumes moving to the location as soon as it can move again.","Taunts and hypnotize cause the hawk to stop for their duration, but it resumes as soon as the taunt expires. The hawk completely ignores fear."],"mana":"30","elements":[],"cooldown":"60\/50\/40\/30 ( 40\/30\/20\/10)","name":"Call of the Wild Hawk","description":["Cast Animation: 0.3+0.67","Number of Hawks: 1","Summons Duration: 60"],"hot_key":"E","legacy_key":"E"},{"spell":"Untaps the inner fury of allies, passively increasing their attack speed.","effects":["Ability Aura","Affects Allies"],"notes":["Affects all summons, illusions and invulnerable units.","The aura's buff lingers for 0.5 seconds."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Inner Beast","description":["Radius: 1200","Attack Speed Bonus: 10\/20\/30\/40 ( 35\/45\/55\/65)","Aura Linger Duration: 0.5"],"hot_key":"D","legacy_key":"B"},{"spell":"Beastmaster lets loose a deafening roar that stuns, and shoves open a path to its target. All units in the path of the roar are damaged, while units shoved aside by the roar have their movement and attack speed slowed. Additionally, Beastmaster and his units gain 40% movement speed for 3 seconds.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Only enemy units are shoved aside from the path of the roar. Roshan is not affected by the knockback.","Affected units are fully disabled during the knockback.","Primal Roar can be used on a courier to stun it, but it is not damaged. Couriers are also a valid target for the knockback.","Knocks units aside at a speed of 450, up to 450 range away, resulting in a knockback duration of 1 seconds.","Units hit by the knockback are made to face towards the direction they are getting pushed.","The knockback and slow have a dynamic range, based on the distance between Beastmaster and the primary target. For every 2 distance between Beastmaster and the target upon cast, the knockback range increases by 1. When the target is 600 range away, the knockback hits units up to 300 range behind the target and behind Beastmaster. When the target is 850 range away, the knockback hits units up to 425 range behind the target and behind Beastmaster. The width of the knockback area is always 300, so the affected area is always stadium-shaped.","Considering the dynamic range, the slow\/knockback can hit units up to 900 range away.","When an enemy is perfectly aligned with Beastmaster and his Primal Roar target, it does not get knocked aside. However, the slow and damage are still applied, and the target is still disabled for the knockback duration.","On the primary target, the roar first applies the debuff, then the damage. On secondary targets, the roar first applies the damage, then the debuff.","The movement speed bonus only affects Beastmaster and his units. Other nearby allies are not buffed."],"mana":"150\/175\/200","elements":["Partially blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"90\/80\/70","name":"Primal Roar","description":["Cast Animation: 0.5+0.63","Cast Range: 600","Speed Bonus Radius: 900","Knockback Width: 300","Damage: 150\/225\/300","Enemy Move Speed Slow: 60%","Enemy Attack Speed Slow: 60","Allies Movement Speed Bonus: 40%","Slow Duration: 3\/3.5\/4","Knockback Distance: 450","Knockback Duration: 1","Stun Duration: 3\/3.5\/4","Speed Duration: 3"],"hot_key":"R","legacy_key":"R"},{"spell":"Inflicts a poison that slows attack and movement speeds.","effects":["Ability Passive","Affects Enemies"],"notes":["Level scales together with Call of the Wild's level. However, the level of already summoned boars does not adapt.","Successive attacks do not stack the slow, they refresh the duration.","The attacks first apply their damage, then the debuff."],"mana":"0","elements":["Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Poison","description":["Move Speed Slow: 10%\/20%\/30%\/40%","Attack Speed Slow: 10\/20\/30\/40","Slow Duration: 3"]}],"bio":"Karroch was born a child of the stocks. His mother died in childbirth; his father, a farrier for the Last King of Slom, was trampled to death when Karroch was five. Afterward Karroch was indentured to the king’s menagerie, where he grew up among all the beasts of the royal court: lions, apes, fell-deer, and things less known, things barely believed in. When the lad was seven, an explorer brought in a beast like none before seen. Dragged before the King in chains, the beast spoke, though its mouth moved not. Its words: a plea for freedom. The King only laughed and ordered the beast perform for his amusement; and when it refused, struck it with the Mad Scepter and ordered it dragged to the stocks. Over the coming months, the boy Karroch sneaked food and medicinal draughts to the wounded creature, but only managed to slow its deterioration. Wordlessly, the beast spoke to the boy, and over time their bond strengthened until the boy found he could hold up his end of a conversation—could in fact speak now to all the creatures of the King's menagerie. On the night the beast died, a rage came over the boy. He incited the animals of the court to rebel and threw open their cages to set them amok on the palace grounds. The Last King was mauled in the mayhem. In the chaos, one regal stag bowed to the boy who had freed him; and with Beastmaster astride him, leapt the high walls of the estate, and escaped. Now a man, Karroch the Beastmaster has not lost his ability to converse with wild creatures. He has grown into a warrior at one with nature’s savagery.","talentsTips":["The armor talent does not benefit illusions.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Beastmaster's original name was Rexxar, a character in the Warcraft universe. Rexxar was the main playable character of the bonus campaign in Warcraft III: The Frozen Throne.","Beastmaster's item the \"Shrieking Razorback\" design seems to be based on the Shriekers from Tremors II: Aftershocks.","Beastmaster's lines \"Basshunter, on the hunt\" are a reference to Swedish singer Basshunter, who has a song about DotA."],"talents":["-20s Hawks Cooldown:+25 Inner Beast Attack Speed","+500 Health:+75 Wild Axes Damage","+40 Boar Damage:+6 Armor","+20 Movement Speed:+25% XP Gain"],"desc":"Karroch, the Beastmaster, is a versatile melee strength hero most commonly played as an offlaner and ganker who brings a good amount of utility to his team in any situation. His Wild Axes allows him to lane and farm quite effectively throughout the game, even when pressured. He is able to summon a hawk and boar to aid him, each providing a good amount of utility to his team. Hawks provide free flying vision around the map, scouting his enemies while his Boars can harass and slow his enemies to a crawl while aiding him in combat. His Inner Beast aura makes his team a force to be reckoned with, providing a hefty boost to attack speed to himself, his summons, and all nearby allies. Finally, his ultimate, Primal Roar, is the longest lasting single-target reliable stun in the game and also penetrates spell immunity (being only counterable by Linken's Sphere), providing a strong initiation for his team to claim a kill. With these skills, he can push enemy towers quickly and safely, take down undefended targets with the help of Necronomicon summons, lock down a single target, and also kite enemies in teamfights. With careful observation of the battlefield, Beastmaster takes down enemies one by one and paves the way to victory."}