{"abilities":[{"spell":"Герой швыряет топоры, которые прорубают деревья и противников на своём пути и возвращаются обратно. Каждый топор задевает одного врага лишь единожды и увеличивает урон, получаемый от героя и его существ.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Физический"],"notes":["Топоры или летят со скоростью 1200 или долетают до цели за одну секунду, смотря что быстрее. Работает также при возвращении. При возвращении скорость топоров периодически обновляется, основываясь на расстоянии до Beastmaster и оставшемся времени полета. Таким образом в полете топоры находятся до двух секунд, до одной секунды в каждом направлении.","Топоры разлетаются в стороны друг от друга на расстояние 450 перед тем как начнут сближаться, летя в сторону цели.","Минимальная дистанция полета топоров - 450, поэтому при выборе точки, находящейся на расстоянии меньшем, чем 450 единиц, топоры все равно пересекутся на расстоянии в 450","Оба топора летят по дуге, таким образом топор, выпущенный из правой руки героя, возвращается в левую руку и наоборот.","Использует один дебафф на пораженных целях для всех зарядов. Иконка дебаффа отражает количество зарядов.","Повторное поражение одного и того же юнита обновит длительность всех зарядов.","Топоры сначала применяют дебафф, затем наносят урон. То есть они также увеличивают свой урон. Поскольку топоры действуют отдельно друг от друга, то один из топоров всегда наносит больше урона за счет 2 зарядов дебаффа.","Юнит может быть задет каждым топором лишь единожды, таким образом максимальный возможный урон (до учета сопротивлений и усилений) - 60\/120\/180\/240 ( 190\/250\/310\/370).","Топоры накладывают на цель эффект увеличения урона только для Beastmaster и его подконтрольных юнитов.","Не действует на курьеров.","Изучение соответствующего таланта мгновенно обновляет значение урона всех топоров героя, находящихся в полете.","Топоры разрушают деревья в радиусе 175 вокруг каждого.","Каждый топор имеет летающий обзор в радиусе 350. Этот обзор не задерживается."],"mana":"80\/85\/90\/95","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"8","name":"Wild Axes","description":["Анимация применения: 0,4+0,47","Дальность применения: 1500","Радиус: 175","Дистанция полета топоров: 1500","Расстояние разлета топоров: 450","Урон каждого топора: 30\/60\/90\/120 ( 95\/125\/155\/185)","Увеличение урона за эффект: 6%\/8%\/10%\/12%","Длительность эффекта: 10"],"hot_key":"Q","legacy_key":"W"},{"spell":"Герой призывает на поле битвы кабана-помощника..","effects":["Способность Ненаправленная"],"notes":["Повышение уровня этого заклинания автоматически улучшает Call of the Wild (ястреб).","Не убивает предыдущего призванного Кабана, если способность используют до его исчезновения.","Кабан призывается в случайной точке около Beastmaster на расстоянии 100 единиц."],"mana":"50","elements":[],"cooldown":"42\/38\/34\/30","name":"Call of the Wild (кабан)","description":["Анимация применения: 0,3+0,67","Число кабанов: 1","Длительность жизни: 60"],"hot_key":"W","legacy_key":"D"},{"spell":"Герой отправляет невидимого ястреба разведать территорию.","effects":["Способность Ненаправленная"],"notes":["Повышение уровня этого заклинания автоматически улучшает Call of the Wild (кабан).","Не убивает предыдущего призванного Ястреба, если способность используют до его исчезновения.","Ястреб призывается в случайной точке около Beastmaster на расстоянии 300 единиц. Он сразу невидим без какой-либо задержки.","Ястреба нельзя контролировать. После призыва он автоматически летит к выбранной области и там зависает.","Если перемещение ястреба прервали (например, оглушением, оцепенением и т.д.), то после завершения эффекта он продолжит свой полет.","Провокация и гипноз заставляют ястреба остановиться, но после завершения эффекта он продолжит свой полет. Также юнит игнорирует эффект страха."],"mana":"30","elements":[],"cooldown":"60\/50\/40\/30 ( 40\/30\/20\/10)","name":"Call of the Wild (ястреб)","description":["Анимация применения: 0,3+0,67","Число ястребов: 0\/0\/1\/1","Длительность жизни: 60"],"hot_key":"W","legacy_key":"E"},{"spell":"Высвобождает животную ярость союзников, увеличивая скорость их атак.","effects":["Способность Аура","Действует на Союзников"],"notes":["Действует на всех призываемых существ, иллюзии и неуязвимых юнитов.","Эффект ауры задерживается на 0,5 секунды."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Inner Beast","description":["Радиус: 1200","Доп. скорость атаки: 15\/25\/35\/45 ( 40\/50\/60\/70)","Длительность задержки ауры: 0,5"],"hot_key":"E","legacy_key":"B"},{"spell":"Герой издаёт громогласный рык, который оглушает цель и раскидывает всех противников на пути к ней. Все задетые враги получают урон, а у отлетевших в стороны врагов снижается скорость атаки и передвижения. Также на 3 секунды скорость передвижения героя и его существ увеличивается на 40%%.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Откидываются только вражеские юниты. На Рошана отталкивание не работает.","Юниты под воздействием откидывания полностью обезврежены.","Primal Roar можно использовать на курьера для оглушения, но он не получит урона. Курьеры также подвергаются откидыванию.","Раскидывает юниты по сторонам со скоростью 450, на расстояние до 450, получая в итоге откидывание на 1 секунд.","Откинутые юниты смотрят в направлении, откуда их толкнули.","Откидывание и замедление имеют динамический радиус действия, основанный на расстоянии между Beastmaster и основной целью. За каждые 2 единицы расстояния между Beastmaster и целью, радиус действия откидывания увеличивается на 1. Когда цель находится на расстоянии 600, откидываются юниты, находящиеся на расстоянии до 300 за целью и Beastmaster. Когда цель находится на расстоянии 950, откидываются юниты, находящиеся на расстоянии до 475 за целью и Beastmaster. Ширина откидывания всегда равна 300, так что площадь, на которой действует эффект, всегда в форме стадиона.","Учитывая динамическую дальность, замедление\/откидывание могут попасть по юнитам на расстоянии до 900 ( 1425)","Если враг стоит ровно между Beastmaster и целью Primal Roar, его не откидывает в сторону. Тем не менее, замедление и урон по-прежнему накладываются, и цель оказывается обезврежена на время откидывания.","На основную цель сначала накладывается дебафф, затем наносится урон. Вторичные цели сначала получают урон, затем - дебафф.","Дополнительная скорость передвижения действует только на Beastmaster и его подконтрольных юнитов."],"mana":"150\/175\/200","elements":["Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"90\/80\/70 ( 45)","name":"Primal Roar","description":["Анимация применения: 0,5+0,63","Дальность применения: 600 ( 950)","Радиус доп. скорости: 900","Радиус откидывания: 300","Урон: 150\/225\/300","Замедление скорости передвижения: 60%","Замедление скорости атаки: 60","Доп. скорость передвижения союзникам: 40%","Длительность замедления: 3\/3.5\/4","Расстояние откидывания: 450","Длительность откидывания: 1","Длительность оглушения: 3\/3.5\/4","Длительность ускорения: 3"],"hot_key":"R","legacy_key":"R"},{"spell":"Впрыскивает яд, замедляющий атаку и скорость врага.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Удачные атаки не накапливают замедление, длительность обновляется."],"mana":"0","elements":["Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Poison","description":["Замедление передвижения: 10%\/20%\/30%\/40%","Замедление атаки: 10\/20\/30\/40","Длительность замедления: 3"]}],"bio":"Детство Карроха прошло несладко. Мать его умерла при родах. Отца, кузнеца при последнем короле Слома, растоптали насмерть, когда ребенку было пять лет. Тогда Карроха поселили в королевский зверинец, где он рос среди животных: львов, обезьян, оленей-падунов и других, менее известных существ, в которых не всякий верил. На седьмой год жизни парня королевский лазутчик привел во дворец новую тварь. Её подтащили к королю, закованную в цепи, и та заговорила, хоть и не двигала ртом. Просила она одно: свободы. Король лишь рассмеялся и приказал зверю выступать ему на потеху, а когда тот отказался, огрел его своим Диким скипетром и приказал отправить тварь в темницу. Следующие месяцы мальчик тайком проносил к существу еду и лекарства, но они лишь слегка отодвигали полное истощение. Без слов зверь говорил с мальчиком, и со временем их связь усилилась настолько, что Каррох понял — он может поддерживать разговор. Более того, он научился общаться со всеми обитателями королевского зверинца. В ночь, когда зверь умер, мальчик впал в ярость. Он повел чудищ войной на прислужников короля, отперев клетки и выпустив зверей на дворцовые земли. В погроме насмерть растерзали и самого короля. Пока царила неразбериха, Каррох освободил одного из королевских оленей, и тот поклонился в ответ, а затем, с Каррохом на спине, перемахнул через высокие стены дворца, унося того из проклятого места. Теперь повелитель зверей Каррох по прозвищу Beastmaster уже взрослый мужчина, но он не потерял способности говорить с дикими зверьми. Сирота из королевского зверинца превратился в неукротимого воина природы.","talentsTips":["Талант на броню не дается иллюзиям.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Оригинальное имя Beastmaster - Rexxar, что является отсылкой к герою из вселенной Warcraft.","Возможно, что зверь, которого Beastmaster встретил в королевском зверинце — это Lycan, который был превращен в волка по приказу короля Слома. На это намекает фраза Lycan \"ИгратьYou were no master of me.\" - \"Ты не был моим хозяином.\", произносимая при убийстве Beastmaster.","Имя героя, Beastmaster, является отсылкой к одноименному фильму, где главный герой, Дар, умел телепатически общаться с животными. Ястреб, кабан и случайный зверь, призываемые второй способностью, также являются отсылкой к фильму, где у героя были спутники: орёл, хорьки и лев"],"talents":["-20 сек. перезарядки Call of the Wild (ястреб):+25 к скорости атаки от Inner Beast","+500 к здоровью:+50 к урону кабана","+65 к урону от Wild Axes:+6 к броне","+20 к скорости передвижения:+25% к получаемому опыту"],"tips":["Герой, который может с успехом стоять соло на линии и использовать свои Wild Axes чтобы фармить крипов или расчищать себе проход через лес для ганка или побега.","Обладает сильнейшим одиночным оглушением в игре, используйте это, чтобы влиять на ход битвы.","Bottle должна быть следующим предметом после начальных, особенно если вы стоите на мидл лайне. Затем берите Boots of Speed.","Убивайте линию крипов используя Wild Axes, этим вы неплохо пофармите и сможете пропушить линию.","В начале игры уделите внимание разведке соколом и контролю рун с его помощью.","Каждый раз, когда вы намереваетесь использовать Primal Roar в присутствии двух или более вражеских героев не забудьте про Blink Dagger. Он поможет вам внезапно появится перед ними и нанести урон, затронув их всех.","Beastmaster может отлично нагромождать древних крипов, а потом убивать их своими Wild Axes, поскольку они действуют на юнитов с иммунитет к заклинаниям."],"desc":"%"}