{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Anti-Mage: 180 здоровья и 0,9 восстановления здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−50 сек. перезарядки Mana Void",
          "talentRight": "+20% к сопротивлению магии от Counterspell"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+250 к дальности Blink",
          "talentRight": "+0,1 к урону за единицу маны от Mana Void"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+0,7 сек. оглушения от Mana Void",
          "talentRight": "+0,6% к сжигаемой макс. мане от Mana Break"
        },
        {
          "talentLvl": "10",
          "talentLeft": "−1 перезарядки у Blink",
          "talentRight": "+9 к силе"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f1\/Mana_Break.mp3\/revision\/latest?cb=20150210214551",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Наносит 14\/20\/26\/32 дополнительного урона + 0,5%\/0,9%\/1,3%\/1,7% (TagTalent 0,8%\/1,2%\/1,6%\/2%) от максимального запаса маны цели в виде урона (до учёта сопротивлений). Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом и он может быть прорубающим, но он не может быть критическим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки.",
        "От этого урона идет лечение вампиризмом и он может быть прорубающим, но он не может быть критическим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "Иллюзии снижает сниженное число маны: 14\/20\/26\/32 единиц + 0,5%\/0,9%\/1,3%\/1,7% от максимального запаса маны за удар. Иллюзии также имеют меньший бонусный урон: 7\/10\/13\/16 дополнительного урона + 0,25%\/0,45%\/0,65%\/0,85% (TagTalent 0,4%\/0,6%\/0,8%\/1%) от максимального запаса маны цели в виде урона (до учёта сопротивлений).",
        "Иллюзии также имеют меньший бонусный урон: 7\/10\/13\/16 дополнительного урона + 0,25%\/0,45%\/0,65%\/0,85% (TagTalent 0,4%\/0,6%\/0,8%\/1%) от максимального запаса маны цели в виде урона (до учёта сопротивлений).",
        "Сначала сжигает ману, затем наносит урон.",
        "Не действует на союзных существ при атаке.",
        "Не складывается со способностью Manabreak у Diffusal Blade."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Mana Break",
      "cooldown": null,
      "description": "Сжигает ману врага с каждым ударом. Mana Break наносит противнику урон в размере 50% от сожженной маны.",
      "hot_key": "Q",
      "params": [
        "Сжигание маны за удар: 28\/40\/52\/64",
        "Сжигаемая доля от макс. маны: 1%\/1,8%\/2,6%\/3,4% (TagTalent 1,6%\/2,4%\/3,2%\/4%)",
        "Урон за единицу маны: 50%",
        "Процент для иллюзий: 50%",
        "Для иллюзий значения вдвое меньше."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/96\/Blink_%28AM%29.mp3\/revision\/latest?cb=20140921015525",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя"
      ],
      "notes": [
        "Blink можно использовать для избегания летящих снарядов.",
        "Не телепортирует на полное расстояние при выборе точки, находящейся на меньшем расстоянии, чем максимальное.",
        "При выборе точки, находящейся дальше, чем это позволяет способность, дистанция перемещения будет максимальной."
      ],
      "mana": "60",
      "item_behaviour": [],
      "name": "Blink",
      "cooldown": "15\/12\/9\/6 (TagTalent 14\/11\/8\/5)",
      "description": "Телепортация на короткую дистанцию, позволяющая Anti-Mage врываться в схватку и быстро возвращаться назад.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,53",
        "Дальность применения: Глобальная",
        "Макс. дальность телепортации: 925\/1000\/1075\/1150 (TagTalent 1175\/1250\/1325\/1400)",
        "Дарует новую способность: Blink Fragment."
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7b\/Spell_Shield_block.mp3\/revision\/latest?cb=20161218122434",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Сочетается мультипликативно с другими источниками сопротивления магии.",
        "Увеличивает общее значение сопротивления магии Anti-Mage до 36,25%\/43,75%\/51,25%\/58,75% (TagTalent 51,25%\/58,75%\/66,25%\/73,75%).",
        "Отраженные прерываемые способности можно отменить.",
        "Эффекты от Linken's Sphere, Mirror Shield и Lotus Orb сработают только в том случае, если Counterspell находится на перезарядке.",
        "Counterspell не отражает заклинания, отраженные Mirror Shield и Lotus Orb (отраженные заклинания повторно не отражаются).",
        "Эффект использует обычную перезарядку, поэтому на неё действуют любые эффекты, манипулирующие перезарядкой.",
        "В отличие от других источников отражения заклинаний, способность не отражает Phantom Strike и Blink Strike. Эти способности только блокируются."
      ],
      "mana": "45\/50\/55\/60",
      "item_behaviour": [],
      "name": "Counterspell",
      "cooldown": "15\/11\/7\/3",
      "description": "Увеличивает сопротивление магическому урону. Можно применить, чтобы создать вокруг себя противомагический щит, который полностью отражает все направленные заклинания обратно во врага.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Доп. сопротивление магии: 15%\/25%\/35%\/45% (TagTalent 35%\/45%\/55%\/65%)",
        "Длительность: 1,2",
        "Внешний радиус ауры: 900",
        "Внутренний радиус ауры: 300",
        "Снижение магического урона во внешнем радиусе: 10%",
        "Множитель снижения магического урона во внутреннем радиусе: 3",
        "Длительность ауры: 0,5",
        "Counterspell получает пассивную ауру радиусом 900, которая уменьшает магический урон противников на 10%. У врагов в радиусе 300 магический урон уменьшается ещё на 20%.",
        "Пассивное сопротивление магии отключается."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Anti-Mage_Blink_Fragment_1.mp3\/revision\/latest?cb=20201220204524",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "Созданная иллюзия смотрит в том же направлении, что и заклинатель, использует частицы и звук способности Blink.",
        "Если Blink не изучена, то Blink Fragment будет использовать дальность применения способности Blink первого уровня.",
        "Иллюзия полностью неконтролируемая.",
        "Иллюзия не является неуязвимой, её можно атаковать и убить.",
        "Если целью является враждебный юнит, то иллюзия будет атаковать это существо.",
        "Если целью является точка, то иллюзия будет использовать стандартные правила автоатаки. Иллюзия игнорирует настройки автоатаки игрока и всегда использует стандартную автоатаку. Если рядом с точкой нет противников, то иллюзия будет стоять, пока в радиусе автоатаки не появится враг.",
        "Иллюзия игнорирует настройки автоатаки игрока и всегда использует стандартную автоатаку.",
        "Если рядом с точкой нет противников, то иллюзия будет стоять, пока в радиусе автоатаки не появится враг.",
        "Иллюзия имеет сквозное передвижение.",
        "Иллюзия от этой способности получает бонусы от улучшения Counterspell с помощью Aghanim's Shard, создавая иллюзии Anti-Mage при успешном отражении способности"
      ],
      "mana": "50",
      "item_behaviour": [],
      "name": "Blink Fragment",
      "cooldown": "0",
      "description": "Перемещает к выбранному врагу или в выбранную точку иллюзию, которая 7 секунд атакует противников. Эта иллюзия применяет Counterspell одновременно с основным героем. Имеет 3 заряда.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,84",
        "Дальность применения: 925\/1000\/1075\/1150 (TagTalent 1175\/1250\/1325\/1400)",
        "Урон иллюзии: 50%",
        "Урон по иллюзии: 250%",
        "Длительность иллюзии: 7",
        "Число зарядов: 3",
        "Время восстановления заряда: 25",
        "Нельзя применить на невосприимчивых к магии врагам.",
        ""
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Mana_Void.mp3\/revision\/latest?cb=20141130185226",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Перекрестие указателя должно выделять вражеского юнита.",
        "Урон основывается на количестве маны у основной цели, но урон наносится всем противникам в радиусе действия способности.",
        "Mana Void сначала применяет дебафф, затем наносит урон.",
        "Только основная цель будет оглушена.",
        "При использовании на существ без запаса маны применяет только мини-оглушение.",
        "Звуковой эффект проигрывается во время применения и слышен всем."
      ],
      "mana": "125\/200\/275",
      "item_behaviour": [],
      "name": "Mana Void",
      "cooldown": "70 (TagTalent 20)",
      "description": "За каждую отсутствующую у цели единицу маны ей и окружающим противникам наносится урон. Основная цель кратковременно оглушается.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,63",
        "Дальность применения: 600",
        "Радиус: 500",
        "Урон за единицу отсутствующей маны: 0,8\/0,95\/1,1 (TagTalent 0,9\/1,05\/1,2)",
        "Длительность оглушения: 0,3 (TagAghanim 1)",
        "Блокируется только основной целью."
      ],
      "legacy_key": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.6,
    "attrStrength": 23.0,
    "attrIntelligence": 12.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.8,
    "attrAgility": 24.0
  },
  "description": "Anti-Mage — это герой с ближним типом атаки, основным атрибутом которого является ловкость. Его первая пассивная способность, Mana Break, сжигает ману врага за каждый удар. Mana Break наносит противнику урон в размере 50% от сожженной маны. Вторая способность, Blink, позволяет Anti-Mage телепортироваться на короткое расстояние. Третья способность, Counterspell, увеличивает сопротивление Anti-Mage магическому урону, а также даёт ему возможность блокировать и отразить любое направленное вражеское заклинание. Ультимативная способность, Mana Void, наносит урон цели за каждую отсутствующую у нее единицу маны. Окружающим противникам также наносится урон. Основная цель кратковременно оглушается.",
  "history": "Монахи Турстаркури наблюдали за неровными долинами, раскинувшимися под их горным монастырем, в то время, как вторженцы, волна за волной, набегали на стоявшие у подножья королевства. Аскетичные, прагматичные, они пребывали в медитации, не знавшей никаких богов, засев в своем отрешенном от суетного мира высокогорном гнезде. Потом грянул легион Мертвого бога — крестоносцы, уничтожающие все местные культы и заменяющие их своей верой, родом из земель, известных лишь безжалостностью и тысячелетними войнами. Легионы мертвецов осадили Турстаркури. Две недели монастырь едва сдерживал натиск врагов, а те немногие монахи, что решили разузнать, в чем дело, восприняли нападение как попытку бесовских иллюзий отвлечь их от медитации. Они были убиты прямо на своих шелковых подстилках. Выжил лишь один молодой послушник — пилигрим, пришедший в поисках мудрости, но еще не принятый в монастырь. С ужасом он смотрел за тем, как монахи, которым он еще недавно подавал чаи и травы, гибли на своих местах, а потом присоединялись к рядам служителей Мертвого бога. Схватив охапку ценнейших священных писаний, он бежал в более безопасное место, поклявшись не только искоренить армию колдунов Мертвого бога, но и положить конец любой, какой бы то ни было, магии.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−50 сек. перезарядки Mana Void",
      "talentRight": "+20% к сопротивлению магии от Counterspell"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+250 к дальности Blink",
      "talentRight": "+0,1 к урону за единицу маны от Mana Void"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+0,7 сек. оглушения от Mana Void",
      "talentRight": "+0,6% к сжигаемой макс. мане от Mana Break"
    },
    {
      "talentLvl": "10",
      "talentLeft": "−1 перезарядки у Blink",
      "talentRight": "+9 к силе"
    }
  ]
}