{"abilities":[{"spell":"Vector Targeted. Pangolier dashes along the target line, then slashes all enemies in the drawn direction with several quick swipes. Lucky Shot has a chance to activate from this damage.","effects":["Ability Target Point \/ Vector Targeting","Affects Enemies \/ Self","Damage Instant Attack"],"notes":["Casting Swashbuckle during Rolling Thunder immediately cancels Rolling Thunder.","Pangolier dashes towards the targeted point at a speed of 2000. Can dash over impassable terrain and through trees.","After the dash, Pangolier performs 4 slashes towards the targeted direction. Slashes in 0.1 second intervals, starting immediately upon reaching the target point, taking 0.3 seconds in total.","During the dash and the 4 slashes, Pangolier is stunned, and therefore unable to act.","Causes Pangolier to perform instant attacks on all hit enemies. These attacks have True Strike, and can therefore never miss. They also ignore disarms. Can proc any attack modifier (including Lucky Shot) on all of the hit targets normally. Procs Echo Sabre on all hit targets without putting the item on cooldown. Cleave effects are based on the hit enemies position, damaging a trapezoid area the opposite direction where the attacks came from. Despite the audio, the slashes do not hit ethereal units, so that attack modifiers may not proc. Also applies an instant attack on each enemy Pangolier directly dashes through.","Sets Pangolier's damage to the given values. This means attack damage bonuses and reductions are completely ignored. Items which add a flat attack damage bonus on proc (e.g. Skull Basher or Javelin) still apply their damage.","All slashes together can deal up to 96\/168\/240\/312 ( 256\/328\/400\/472) damage per hit enemy (before reductions).","The slashes can hit units up to 1025 ( 1325) range away from Pangolier after the dash. When used at max cast range, can hit units up to 2025 ( 2325) range away from the original cast location.","Choosing the damage increasing talent during an active cast immediately updates the damage of the remaining slashes."],"mana":"80\/90\/100\/110","elements":["Cannot be cast while rooted or leashed.","Pierces spell immunity."],"cooldown":"20\/16\/12\/8 ( 17\/13\/9\/5)","name":"Swashbuckle","description":["Cast Animation: 0+0","Cast Range: 1000","Slash Range: 900 ( 1200)","Slash Width: 125","Damage per Slash: 24\/42\/60\/78 ( 64\/82\/100\/118)","Number of Slashes: 4","Slash Interval: 0.1"],"hot_key":"Q","legacy_key":"W"},{"spell":"Pangolier jumps in the air and slams back to the ground in front of his current position, damaging all enemies in a radius. For each enemy hero hit, he gains a percentage of incoming damage reduction for a short time. Forward movement is maintained if Shield Crash is used while Rolling Thunder is active, and allows Rolling Thunder to clear walls or cliffs.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Pangolier jumps 225 range forwards when cast, 250 range high. While in the air, other units can pass below him.","During Rolling Thunder, Shield Crash only moves on the z axis (vertical movement), and does not move him on the x and y axis (horizontal). However, due to how vertical and horizontal movement stack with each other, it does not interfere with spells which move Pangolier on the x and y axis. This means when cast during Rolling Thunder, he effectively jumps in an arc, using the height of the jump and the velocity of Rolling Thunder.","During the short jump, Pangolier is stunned, and therefore unable to act. However, he is not disabled when jumping during Rolling Thunder.","When Rolling Thunder expires during the jump of Shield Crash, its duration gets expanded based on how long the jump takes, so that the velocity is kept until landing. However, when Rolling Thunder is ended manually during the jump, via its sub-spell, the velocity is lost, so that Pangolier falls straight down.","The actual length of the jump depends on the terrain. This means jumping onto a higher\/lower ground results in a shorter\/longer jump. This does not affect the jump distance.","The area damage hits all enemies within range, but the buff only counts hit heroes.","Does not count illusions for the buff, but does count clones. Treats creep-heroes as creeps.","This is how much resistance he has with a certain amount of heroes hit on each level. Level 1: 9%\/18%\/27%\/36%\/45% Level 2: 12%\/24%\/36%\/48%\/60% Level 3: 15%\/30%\/45%\/60%\/75% Level 4: 18%\/36%\/54%\/72%\/90%","The visual effect (5 shields circling) around Pangolier has 3 different states, based on how many enemies were hit. With one or two enemies hit, the 5 shields are small and have no extra effects. With three enemies hit, the shields are bigger and gain a light yellow flame-like effect. With four or more enemies hit, the yellow flame gets much stronger.","When recast while still having the buff from a previous cast, it refreshes, and the damage resistance updates if more enemy heroes were hit, but not if less were hit.","If Pangolier is stunned mid jump, he will not apply the damage or gain the damage resistance buff upon landing, but the skill will still go on cooldown","The cast backswing increases to 0.54 during Rolling Thunder.","When upgraded, the Swashbuckle is applied instantly upon cast, not upon landing. The location of the effect is set upon cast as well, and does not follow Pangolier. The angle is based on Pangolier's facing angle, with the other Swashbuckles being 90° apart from each other."],"mana":"90\/100\/110\/120","elements":["Does not pierce spell immunity."],"cooldown":"19\/17\/15\/13 ( 2)","name":"Shield Crash","description":["Cast Animation: 0+0.37","Radius: 500","Damage: 75\/150\/225\/300","Damage Reduction per Hero: 9%\/12%\/15%\/18%","Jump Distance: 225","Damage Reduction Duration: 10","Jump Duration: 0.4","Jump Duration During Rolling Thunder: 0.75"],"hot_key":"W","legacy_key":"C"},{"spell":"Pangolier rolls the dice and lets fate decide the outcome for his enemies. Grants a chance to slow, apply a Disarm and reduce armor.","effects":["Ability Passive","Affects Enemies"],"notes":["The proccing attack first applies the debuff, then its own damage.","Multiple procs on the same target do not stack, but refresh the duration instead.","Lucky Shot uses pseudo-random distribution."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Lucky Shot","description":["Proc Chance: 17%","Movement Speed Slow: 35%","Armor Reduction: 3\/4\/5\/6","Duration: 2\/3\/4\/5"],"hot_key":"E","legacy_key":"E"},{"spell":"Pangolier curls into a spell-immune ball and rolls out. When rolling, he moves at an increased speed and can move through trees, but has a decreased ability to turn. Striking enemies knocks them back, inflicting damage and stunning them when they land. Colliding with walls or cliffs will cause a temporary pause while Pangolier reverses in direction.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Magical"],"notes":["Applies spell immunity for the duration and a basic dispel upon cast.","For better readability, the turn rate during Rolling Thunder is given as degrees per second, instead of radians per 0.03 seconds. 120 degrees per second equal a turn rate of 0.063.","The turn rate is boosted by an additional 165 degrees upon beginning to roll, upon hitting a cliff or wall, or upon landing after Shield Crash. This boost lasts for 0.25 seconds. It effectively increases the turn rate to 0.149 for that time.","Pangolier takes a maximum of 180° turns per move order he gives. This means he does not move in a circle around one targeted point. Pangolier's final path and direction pre move order depends on a vector from Pangolier's position to targeted point, which is always parallel with the path.","Upon colliding with unpathable terrain, Pangolier stops for 0.2 seconds and then starts rolling the direction he came from. Can also collide with the pathing blockers created by Power Cogs, Fissure, and Ice Shards. When colliding with trees, they get destroyed instead and Pangolier continues rolling without stopping. Does not collide with buildings or wards, he simply rolls through them.","Pangolier is not disabled while rolling and can use any items and abilities normally.","The roll speed is fixed and cannot be altered in any way.","Every enemy (except for Roshan) coming within 150 of Pangolier while rolling gets damaged, knocked back, and stunned. The damage and knockback happen immediately on contact. The stun is applied right after the knockback, although the knockback itself is disabling as well. Enemies are knocked 150 range away from Pangolier over 0.4 seconds. Can knock enemies over impassable terrain. This means the disable lasts a total of 1.4\/1.65\/1.9 seconds. The Timeout debuff prevents units from getting hit by Rolling Thunder again. Its duration equals the combined duration of the knockback and the stun and cannot be altered.","Rolling Thunder first applies the damage, then the debuffs."],"mana":"100","elements":["Cannot be cast while rooted or leashed.","Does not pierce spell immunity."],"cooldown":"70 ( 35)","name":"Rolling Thunder","description":["Cast Animation: 1.2+0","Collision Radius: 150","Damage: 200\/275\/350","Roll Speed: 600","Turn Rate in Degrees per Second: 120","Turn Rate Boost After Start\/Jump\/Bounce: 165","Enemy Knockback Distance: 150","Enemy Bounce Duration: 0.4","Enemy Stun Duration: 1\/1.25\/1.5","Rolling Thunder Duration: 8 ( 10)"],"hot_key":"R","legacy_key":"R"},{"spell":"Halt!","effects":["Ability No Target","Affects Self"],"notes":["Replaces Rolling Thunder for its duration or until used."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"0","name":"Stop Rolling","description":["Cast Animation: 0+0"],"hot_key":"R","legacy_key":"R"}],"bio":"The men and women that make up the Nivan Gallants live a life of swordplay, chandelier swinging, and tawdry romance. And while all adhere to their creed that \"A life of adventure is the only life worth living,\" the exploits of Donté Panlin still manage to raise the eyebrows of even the most hedonistic of swordsmen. There is no monster he won’t slay. No creature he won’t woo. No tyrant he won’t stand against. And no noble immune to his silver tongue.","talentsTips":["The strength talent effectively grants Pangolier 400 health, 2 health regen and 1.6% magic resistance."],"trivia":["Pangolier is sometimes labeled in the game files as Armadillo, and other times as Pangolin.","Pangolier speaks some French phrases, and has a French accent.","A swashbuckler is an heroic archetype in European adventure literature that is typified by the use of a sword and chivalric ideals.","Pangolier's character was likely partially inspired by The Three Musketeers' D'Artagnan (for his mannerism, hot-hotheadedness, and French phrases) and Zorro.","Some of Pangoliers abilities have different names in the game files: Swashbuckle: Swash Shield Crash: Thump Rolling Thunder: Shell, Gyroshell Stop Rolling: Shell Stop","Rolling Thunder was the name of an American bombing campaign during the Vietnam War.","Pangolier's response to killing Kunkka \"What to do with a drunken sailor? Simple. Stab him in the heart.\" refers to the famous folk song\/sea shanty Drunken Sailor (Also known as What Shall We Do with a\/the Drunken Sailor?).","Pangolier's response to meeting Death Prophet as ally \"Try to look on the bright side of life.\" is a reference to Eric Idle's famous song Always Look On The Bright Side Of Life, featured in the classic Monty Python movie Life of Brian IMDB.","Pangolier's response to meeting ally Lion \"Which level of hell is your favorite, Lion? I prefer the second. Or perhaps the seventh.\" alludes to Dante Alighieri's famous work: Divine Comedy. There are Nine Circles of Hell in Dante's work: the second is Lust, and the seventh is Violence, indicative of Pangolier's personality. Pangolier's name Donté Panlin also bears resemblance to Dante Alighieri.","Pangolier's rivalry response towards Witch Doctor \"In my professional opinion? You're dead.\" is a direct quote from the Medic from Team Fortress 2."],"talents":["-35s Rolling Thunder Cooldown:-3s Swashbuckle Cooldown","+20 Strength:+40 Swashbuckle Damage","+2s Rolling Thunder Duration:2s Shield Crash CD in Ball","+300 Swashbuckle Slash Range:+3 Mana Regen"],"desc":"Donté Panlin, the Pangolier, is a melee agility hero. Due to his aggressive and brawling-oriented nature, he is best played in a position where he can quickly get an item advantage over the enemy. Perhaps his most iconic skill is the vector-targeted Swashbuckle, a trickster's tool for swordplay and mobility. Other tools in his kit include Shield Crash, which deals an area nuke and provides him with incoming damage reduction for each enemy hero hit, Lucky Shot, giving his attacks a chance to disarm, and Rolling Thunder, during which he curls into an unstoppable rolling ball which stuns and knocks back anything it hits, at the cost of a decreased turn rate."}