{"abilities":[{"spell":"Направление действия выбирается отдельно. Герой отскакивает в указанную сторону, а затем атакует всех врагов в выбранном направлении несколькими быстрыми ударами. Может активировать способность Lucky Shot.","effects":["Способность Направленная на точку \/ Направленная по вектору","Действует на Врагов \/ Себя","Урон Физический"],"notes":["Использование способности Swashbuckler в Rolling Thunder моментально отменит последнюю.","Pangolier отскакивает в указанную область со скоростью 2000, проскакивая через непроходимую территорию и деревья.","После отскока Pangolier делает 4 удара в выбранном направлении. Атаки происходят раз в 0.1 секунды, начинаются сразу после достижении выбранной точки, тратя 0.3 секунды на их нанесение.","Во время рывка и нанесения 4 атак Pangolier находится под действием оглушения и не может совершать иные действия.","Позволяет Pangolier совершать мгновенные атаки по всем пораженным врагам. На эти атаки действует эффект True Strike и они не могут промахнутся. Они также игнорируют обезоруживание. На атаки могут сработать любые модификаторы атаки (включая Lucky Shot) на все пораженные цели. При срабатывании Echo Sabre наносит удары по всем целям без ухода на перезарядку. Эффект прорубания основывается на позиции пораженных врагов, нанося урон в трапецевидной области, которая противоположна изначальному направлению атаки. Вопреки звуковым эффектам удары не поражают существ в призрачной форме, поэтому на них модификаторы атаки не срабатывают. Также способность совершает мгновенные атаки по всем врагам, через которых Pangolier пролетел.","Устанавливает значение атаки Pangolier равным значению способности. Это означает, что дополнительный урон и его уменьшения игнорируются. Предметы, у которых фиксированный урон наносится при срабатывании (как, например, Skull Basher или Javelin), продолжают наносить его.","Все удары могут вместе нанести до 96\/168\/240\/312 ( 256\/328\/400\/472) единиц урона каждому задетому врагу (до учета сопротивления).","После рывка удары могут задевать существ на расстоянии до 1025 единиц от Pangolier. При использовании максимальной дальности применения может задевать существ на расстоянии до 2025 единиц от основного места использования.","Выбор таланта, увеличивающего урон, во время использования мгновенно обновит значение урона для оставшихся ударов."],"mana":"80\/90\/100\/110","elements":["Нельзя применять в оцепенении или будучи связанным.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/16\/12\/8 ( 17\/13\/9\/5)","name":"Swashbuckle","description":["Анимация применения: 0+0","Дальность применения: 1000","Дальность ударов: 900 ( 1200)","Ширина ударов: 125","Урон за удар: 24\/42\/60\/78 ( 64\/82\/100\/118)","Ударов: 4","Интервал ударов: 0.1"],"hot_key":"Q","legacy_key":"W"},{"spell":"Герой подпрыгивает и бьётся спиной о землю, нанося урон всем врагам неподалёку. За каждого задетого противника он получает эффект, ненадолго снижающий получаемый урон. Если применить эту способность во время действия Rolling Thunder, движение не прекратится, а герой перепрыгнет через любые препятствия.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Pangolier прыгает вперед на расстояние 225 единиц и вверх на 250 единиц. При нахождении в воздухе под ним могут проходить другие юниты.","При активном Rolling Thunder Shield Crash может перемещать героя только по оси z (вертикальное движение) и не может перемещать по осям x и y (по горизонтали). При этом, поскольку вертикальное и горизонтальное перемещение сочетаются друг с другом, то оно не мешает заклинаниям, которые могут передвинуть Pangolier по осям x и y. Это означает, что при использовании с активной Rolling Thunder герой прыгает по дуге, используя высоту прыжка и скорость Rolling Thunder.","При прыжке Pangolier полностью обезвреживается. При использовании с активной Rolling Thunder герой не обезвреживается.","Если Rolling Thunder завершается при начале прыжка Shield Crash, то скорость не сохраняется и герой снова падает вниз.","Урон по области наносится всем врагам, но бафф, получаемый Pangolier от способности, учитывает только вражеских героев.","Эффект снижения урона не учитывает иллюзии, но учитывает клонов. Считает крипов-героев за крипов.","Здесь указано, сколько сопротивления получит Pangolier за определенное количество пораженных героев на каждом уровне способности. Уровень 1: 9%\/18%\/27%\/36%\/45% Уровень 2: 12%\/24%\/36%\/48%\/60% Уровень 3: 15%\/30%\/45%\/60%\/75% Уровень 4: 18%\/36%\/54%\/72%\/90%","Визуальный эффект (пять кружащихся щитов) вокруг Pangolier имеет три различные анимации, основанные на том, сколько врагов задела способность. При поражении одного или двух врагов 5 щитов маленькие и у них нет дополнительных эффектов. При поражении троих врагов щиты становятся больше и начинают испускать эффект, похожий на пламя. При поражении четырех или более врагов желтое пламя пылает еще сильнее.","При повторном использовании с действущим баффом сам бафф и сопротивление урону обновятся (причем сопротивление урону повышает значение, если вражеских героев стало больше, но не уменьшает, если их стало меньше).","С активным Rolling Thunder время после применения равно 0,54.","При улучшении при использовании способности (а не при приземлении) мгновенно активируется Swashbuckle. Положение эффекта устанавливается при применении и не следует за Pangolier. Угол определяется стороной, куда смотрит герой, а остальные удары располагаются под углом 90° друг к другу."],"mana":"90\/100\/110\/120","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"19\/17\/15\/13 ( 2)","name":"Shield Crash","description":["Анимация применения: 0+0,37","Радиус: 500","Урон: 75\/150\/225\/300","Снижение урона за героя: 9%\/12%\/15%\/18%","Дальность прыжка: 225","Длительность уменьшения урона: 10","Длительность прыжка: 0.4","Длительность прыжка с Rolling Thunder: 0.75"],"hot_key":"W","legacy_key":"C"},{"spell":"Герой бросает кости, оставляя врагов на милость судьбы. Даёт шанс замедлить цель атаки, снизить её броню и наложить на неё бессилие.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Сработавшая атака сначала применяет дебафф, затем наносит урон.","Несколько срабатываний на одну и ту же цель не складываются, но обновляют длительность.","Lucky Shot использует псевдослучайное распределение"],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Lucky Shot","description":["Шанс срабатывания: 17%","Замедление скорости передвижения: 35%","Уменьшение брони: 3\/4\/5\/6","Длительность: 2\/3\/4\/5"],"hot_key":"E","legacy_key":"E"},{"spell":"Pangolier сворачивается в невосприимчивый к магии шар и катится с увеличенной скоростью, проходя сквозь деревья, но поворачиваясь медленнее обычного. Шар отталкивает задетых врагов, а когда они приземляются наносит им урон и оглушает. Столкнувшись со стеной, шар после небольшой задержки покатится в обратную сторону.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Применяет к герою иммунитет к заклинаниям на всю длительность и базовое развеивание при использовании.","Для лучшего понимания скорость поворота в Rolling Thunder указывается в градусах в секунду вместо радианов в 0,03 секунды. 120 градусов в секунду равны скорости поворота в 0.063.","Скорость поворота возрастает до 165 при запуске, столкновении с возвышенностью или стеной или приземлении после использования Shield Crash. Ускорение длится 0,25 секунд. На это время скорость разворота увеличивается до 0.149.","Pangolier при получении приказа может максимально развернутся на 180°. То есть он не движется вокруг одной выбранной точки. Окончательный путь и направление движения Pangolier зависит от вектора позиции героя до выбранной точки, который всегда параллелен пути.","При столкновении с непроходимой территорией Pangolier останавливается на 0,2 секунды и начинает катится в сторону направления, откуда он двигался. Способность также может сталкиваться с препятствиями, создаваемыми Power Cogs, Fissure и Ice Shards. При столкновении с деревьями они мгновенно разрушаются, а Pangolier продолжает катиться без остановки. Герой не сталкивается с строениями или вардами, а просто прокатывается сквозь них.","Pangolier не обезоруживается при движении и может использовать любые предметы и способности.","Скорость, с которой герой катится, фиксированная и её нельзя ничем изменить.","Любой враг (за исключением Рошана), оказавшийся в 150 единицах от Pangolier, получит урон, будет отброшен и оглушен. Урон и отбрасывание применяются мгновенно при соприкосновении. Оглушение применяется сразу же после отбрасывания, несмотря на то, что отбрасывание также обезвреживает врагов. Врагов отбрасывает на 150 единиц от Pangolier за 0.4 секунды. Способность может отбросить врагов на непроходимую территорию. То есть в итоге обезвреживание длится 1.4\/1.65\/1.9 секунд. Дебафф \"Gyroshell Timeout\" предотвращает повторное получение удара от Rolling Thunder. Его длительность равна сумме длительность отбрасывания и оглушения и не может быть ничем измененаю","Rolling Thunder сначала наносит урон, затем применяет дебаффы."],"mana":"100\/150\/200","elements":["Нельзя применять в оцепенении или будучи связанным.","Блокируется иммунитетом к заклинаниям."],"cooldown":"70 ( 35)","name":"Rolling Thunder","description":["Анимация применения: 1,2+0","Радиус столкновения: 150","Урон: 200\/275\/350","Скорость шара: 600","Скорость разворота в градусах в секунду: 120","Ускорение разворота после применения\/прыжка\/отскока: 165","Дальность толчка: 150","Длительность отталкивания врага: 0.4","Длительность оглушения врага: 1\/1.25\/1.5","Длительность: 8 ( 10)"],"hot_key":"R","legacy_key":"R"},{"spell":"Стоять!","effects":["Способность Ненаправленная","Действует на Себя"],"notes":["Заменяет Rolling Thunder на время её действия или до использования."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Stop Rolling","description":["Анимация применения: 0+0"],"hot_key":"R","legacy_key":"R"}],"bio":"Дамы и господа, что зовутся Ниванскими франтами, живут фехтованием, гуляньями и помпезной романтикой. И пусть все они держатся своего кредо — «Достойна лишь та жизнь, что полна приключений», — подвиги Донтé Панлина вскружат голову даже самому праздному мастеру клинка. Он сразит любое чудище. Расположит к себе кого угодно. Восстанет против каждого тирана. И никакой чин не устоит перед его сладкими речами.","talentsTips":["Талант на силу в общем даёт Pangolier: 400 здоровья, 2 регенерации здоровья и 1,6% сопротивления магии."],"trivia":["Pangоlier is sometimes labeled in the game files as Armadillo, despite his pangolin-like appearance.","Pangolier speaks with a French accent, as well as some French phrases.","Pangolier is partially inspired by Don Quixote, the fictional character created by Miguel de Cervantes. Pholi the Squire, a courier with Pangolier's aesthetics, is likely based on Sancho Panza, Don Quixote's comical squire."],"talents":["-35 сек. перезарядки Rolling Thunder:-3 сек. перезарядки Swashbuckle","+20 к силе:+40 к урону за удар Swashbuckle","+2 сек. к длительности Rolling Thunder:В Rolling Thunder способность Shield Crash перезаряжается 2 сек.","+300 к дальности ударов Swashbuckle:+1,5 маны в секунду"],"desc":"Донтé Панлин, Pangolier — герой с ближним типом атаки и основной характеристикой ловкость. Swashbuckle — одна из самых значимых способностей героя, использующая направление по вектору. После её активации, Донтé отскакивает в указанную сторону, а после атакует попавших под направление врагов несколькими быстрыми ударами. Shield Crash наносит урон по области и позволяет Pangolier-у ненадолго снизить получаемый урон за каждого задетого противника. Пассивная способность Lucky Shot даёт шанс обезоружить и снизить показатель брони врага, а также замедлить скорость его передвижения. При помощи ультимативной способности Rolling Thunder герой сворачивается в невосприимчивый к магии шар, который ценой замедленной скорости поворота оглушает, отталкивает и наносит урон всем врагам, которых встречает на пути. Способность также можно остановить преждевременно через Stop Rolling."}