{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Black_King_Bar_Avatar.mp3\/revision\/latest?cb=20191227195352",
      "effects": [
        "Model Size Increase: 30%",
        "Duration: 9\/8\/7\/6"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Applies spell immunity for the duration and a basic dispel upon cast. Causes the caster's model size to increase by 30% for its duration. This has no impact on its collision size.",
        "Causes the caster's model size to increase by 30% for its duration. This has no impact on its collision size.",
        "During Avatar, the hero cannot be affected by Ethereal sources (e.g. Ghost Form or Ghost Shroud) and the buff is removed immediately. With the exception of Ether Blast, the buff on an ally target will not be dispelled only if cast prior to activating Avatar.",
        "With the exception of Ether Blast, the buff on an ally target will not be dispelled only if cast prior to activating Avatar.",
        "A countdown also appears on the item's icon, visible to everyone, showing the remaining duration of Avatar.",
        "The duration of Avatar is bound to the hero. Purchasing the item again does not reset it.",
        "For more details, including a list of abilities that are not blocked by Avatar, see here."
      ],
      "mana": "50",
      "abilityName": "Avatar",
      "cooldown": "90",
      "description": "Grants Spell Immunity. Duration decreases with each use.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "200 health and 1 health regeneration.",
    "10 main attack damage to heroes."
  ],
  "cost": "4050",
  "lore": null,
  "consistFrom": [
    "Ogre Axe",
    "Mithril Hammer",
    "Recipe"
  ],
  "name": "Black King Bar",
  "description": "A powerful staff imbued with the strength of giants.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "When facing a lot of magical damage or many disables, a Black King Bar alone can provide enough survivability, allowing carry heroes to focus on damage items after having Black King Bar. Vice versa, Black King Bar is not effective against physical damage, or spell immunity piercing spells, so other items for survivability should be considered (e.g. armor items against physical damage, or escape items against some spells).",
    "Vice versa, Black King Bar is not effective against physical damage, or spell immunity piercing spells, so other items for survivability should be considered (e.g. armor items against physical damage, or escape items against some spells).",
    "Black King Bar applies a basic dispel on cast allowing to clear out most negative status debuffs. Instead of casting it hastily to engage at first sight, a reactive activation against a debuff will be more beneficial."
  ]
}