{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,75 к урону за единицу маны от Nether Ward",
          "talentRight": "+160 к урону от Nether Blast"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+1,5 сек. к длительности Decrepify",
          "talentRight": "+20% к лечению от Life Drain"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+3 удара по Nether Ward",
          "talentRight": "−1 сек. перезарядки Nether Blast"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+200 к здоровью",
          "talentRight": "+20 к скорости передвижения"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/04\/Pugna_Nether_Blast_1.mp3\/revision\/latest?cb=20210424155908",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Наносит 50\/87,5\/125\/162,5 (TagTalent 130\/167,5\/205\/242,5) единиц урона по постройкам.",
        "Визуальные эффекты и звук в момент 0,8 сек. задержки видны и слышны только союзникам."
      ],
      "mana": "85\/105\/125\/145",
      "hotKey": "Q",
      "cooldown": "5 (TagTalent 4)",
      "description": "Взрыв астральной энергии, который наносит урон врагам и постройкам в области действия. Постройки получают только половину урона.",
      "spellName": "Nether Blast",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 400",
        "Радиус: 400",
        "Задержка: 0,8",
        "Урон: 100\/175\/250\/325 (TagTalent 260\/335\/410\/485)",
        "Урон по строениям: 50%"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/92\/Pugna_Decrepify.mp3\/revision\/latest?cb=20191216022123",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Применяет к цели призрачную форму, обезоруживая её, давая иммунитет к атакам и 100% сопротивление к физическому урону. Уменьшение сопротивления магии не складывается с остальными эффектами, дающими призрачную форму; приоритет за эффектом с наивысшим значением снижения. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "Уменьшение сопротивления магии не складывается с остальными эффектами, дающими призрачную форму; приоритет за эффектом с наивысшим значением снижения.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Снижает общее сопротивление магии союзных героев до 6,25% и не замедляет союзников.",
        "Снижает сопротивление магии вражеских героев до 2%\/-5%\/-13%\/-20%.",
        "Можно применять на Nether Ward и Tombstone. Возможность распространяется на союзные Nether Ward\/Tombstone и вражеский Nether Ward, но не на вражеский Tombstone, поскольку способность не проходит сквозь иммунитет к магии врагов. Нельзя применить к остальным вардам.",
        "Возможность распространяется на союзные Nether Ward\/Tombstone и вражеский Nether Ward, но не на вражеский Tombstone, поскольку способность не проходит сквозь иммунитет к магии врагов.",
        "Нельзя применить к остальным вардам."
      ],
      "mana": "60",
      "hotKey": "W",
      "cooldown": "15\/12\/9\/6",
      "description": "Могущественное заклятие изгнания замедляет выбранное существо, лишает его возможности атаковать или быть атакованным, а также увеличивает получаемый им урон от заклинаний.",
      "spellName": "Decrepify",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 400\/500\/600\/700",
        "Замедление скорости передвижения врагов: 30%\/40%\/50%\/60%",
        "Уменьшение сопротивления магии союзников: 25%",
        "Уменьшение сопротивления магии врагов: 30%\/40%\/50%\/60%",
        "Длительность: 3,5 (TagTalent 5)",
        "Все эффекты остаются, если если бафф\/дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Pugna_Nether_Ward_1.mp3\/revision\/latest?cb=20191216022128",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически размещает вард в 150 единицах перед Pugna.",
        "При атаке варда иллюзии считаются за крипов, поэтому им нужно 16 (TagTalent 28) атак для разрушения в отличии от 4 (TagTalent 7) для героев.",
        "Снижение регенерации маны представлено аурой с радиусом в 1600. Дебафф задерживается на 0,5 сек. Вспышки не связаны с аурой. Выжигает до 5,55%\/13,5%\/23,85%\/36,6% от максимальной маны существа за всю длительность. Выжигает всю ману существа за 333,33\/166,67\/111,11\/83,33 сек. Не действует на нейтральных и линейных крипов.",
        "Выжигает до 5,55%\/13,5%\/23,85%\/36,6% от максимальной маны существа за всю длительность.",
        "Выжигает всю ману существа за 333,33\/166,67\/111,11\/83,33 сек.",
        "Не действует на нейтральных и линейных крипов.",
        "Урон наносится при каждом случае использования маны заклинаниями. Если они не расходуют ману при использовании, то вард на них не реагирует. То есть способность реагирует на заклинания, периодически расходующие ману (например, Chakram), с каждым расходом. Но при этом вард не активируется из-за способностей, на которые не реагируют эффекты, срабатывающие при использовании. То есть переключаемые заклинания и активные модификаторы атаки вард не активируют.",
        "Если они не расходуют ману при использовании, то вард на них не реагирует.",
        "То есть способность реагирует на заклинания, периодически расходующие ману (например, Chakram), с каждым расходом.",
        "Но при этом вард не активируется из-за способностей, на которые не реагируют эффекты, срабатывающие при использовании. То есть переключаемые заклинания и активные модификаторы атаки вард не активируют.",
        "Не реагирует на потерю маны любым способом (все виды сжигания маны, Mana Drain, Sanity's Eclipse и т.д.).",
        "Урон наносится до применения заклинания; если цель варда умрет, то её способность не используется. То есть способности, дающие защиту (например, Rage, Refraction), не спасут заклинателя от смертельного урона. Смерть с Reincarnation активирует урон, поскольку способность расходует ману, но не помешает воскрешению.",
        "То есть способности, дающие защиту (например, Rage, Refraction), не спасут заклинателя от смертельного урона.",
        "Смерть с Reincarnation активирует урон, поскольку способность расходует ману, но не помешает воскрешению.",
        "Источником урона является сам вард, поэтому эффекты, реагирующие на урон, будут реагировать на вард, а не на Pugna (например, Blade Mail).",
        "Действует на неуязвимых и невидимых существ и существ в тумане войны."
      ],
      "mana": "80",
      "hotKey": "E",
      "cooldown": "35",
      "description": "Герой создаёт в указанном месте тотем бездны, который каждую секунду сжигает врагам долю от их максимального запаса маны и наносит им урон, когда те применяют способности. Часть урона постоянна, а часть зависит от того, сколько маны использует жертва.",
      "spellName": "Nether Ward",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 150",
        "Радиус: 1600",
        "Атак героев для уничтожения: 4 (TagTalent 7)",
        "Атак не-героев для уничтожения: 16 (TagTalent 28)",
        "Базовый урон: 50",
        "Урон за единицу маны: 1\/1,25\/1,5\/1,75 (TagTalent 2,75\/3\/3,25\/3,5)",
        "Макс. маны в снижение регенерации: 0,3%\/0,6%\/0,9%\/1,2%",
        "Длительность задержки ауры: 0,5",
        "Время жизни тотема: 18\/22\/26\/30"
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/98\/Pugna_Life_Drain.mp3\/revision\/latest?cb=20191216022124",
      "effects": [
        "Способность Направленная на существо \/ Произносимая",
        "Действует на Врагов \/ Союзников",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "Связь разрывается, когда цель становится неуязвимой или спрятанной, преодолевает дистанцию разрыва или у неё заканчивается здоровье.",
        "Дает эффект True Sight на цель и раскрывает её местоположение.",
        "Восстановление здоровье равно наносимому за тик урону (после всех уменьшений). То есть при снижении или усилении урона за тик способность лечит на уменьшенное\/увеличенное значение. Также это относится к выбору целью союзников. Чем больше урона способность наносит Pugna, тем больше лечит союзника и наоборот. То есть Pugna не может лечить союзников, если у него будет 100% сопротивление к магии (например, Fate's Edict) или эффект от магического барьера) Талант 20-го уровня на увеличение лечения от Life Drain усиливает лечение на 20%. Усиление лечение сочетается по закону убывающей полезности с другими источниками усиления.",
        "То есть при снижении или усилении урона за тик способность лечит на уменьшенное\/увеличенное значение.",
        "Также это относится к выбору целью союзников. Чем больше урона способность наносит Pugna, тем больше лечит союзника и наоборот.",
        "То есть Pugna не может лечить союзников, если у него будет 100% сопротивление к магии (например, Fate's Edict) или эффект от магического барьера)",
        "Талант 20-го уровня на увеличение лечения от Life Drain усиливает лечение на 20%. Усиление лечение сочетается по закону убывающей полезности с другими источниками усиления.",
        "Если здоровье Pugna или союзного героя полное, а существо, получающее урон — герой, то вместо здоровья начнет восстанавливаться мана. То есть способность также восстанавливает ману союзным существам не-героям, если у них полный запас здоровья, в то время, как Pugna (герой) получает урон. Как и восстановление здоровья, количество восстанавливаемой маны равно наносимому урону после всех уменьшений.",
        "То есть способность также восстанавливает ману союзным существам не-героям, если у них полный запас здоровья, в то время, как Pugna (герой) получает урон.",
        "Как и восстановление здоровья, количество восстанавливаемой маны равно наносимому урону после всех уменьшений.",
        "Урон, наносимый себе при выборе союзника, смертельный, поэтому способность можно использовать для добивания себя.",
        "Вытягивает 37,5\/56,25\/75 (50\/75\/100) здоровья с интервалом в 0,25 секунды спустя 0,25 секунды после начала применения, срабатывая до 40 раз. Талант 20-го уровня усиливает лечение до 45\/67,5\/90 (60\/90\/120) без изменения значения урона.",
        "Талант 20-го уровня усиливает лечение до 45\/67,5\/90 (60\/90\/120) без изменения значения урона.",
        "Вытягивает до 1500\/2250\/3000 (2000\/3000\/4000) здоровья (до уменьшений) при полном произнесении. С талантом излечивает до 1800\/2700\/3600 (2400\/3600\/4800) здоровья, в то время, как наносимый урон не меняется.",
        "С талантом излечивает до 1800\/2700\/3600 (2400\/3600\/4800) здоровья, в то время, как наносимый урон не меняется.",
        "Цвет связи меняется в зависимости от ситуации: При вытягивании здоровья из врага связь красно-зеленого цвета (розово-голубая, если у Pugna полные показатели здоровья). При передаче здоровья союзнику связь лимонно-зеленого цвета (голубой с зеленым, если у союзника полные показатели здоровья).",
        "При вытягивании здоровья из врага связь красно-зеленого цвета (розово-голубая, если у Pugna полные показатели здоровья).",
        "При передаче здоровья союзнику связь лимонно-зеленого цвета (голубой с зеленым, если у союзника полные показатели здоровья).",
        "Мгновенно уничтожает выбранные вражеские иллюзии при первом тике. Союзные иллюзии не умирают, а излечиваются.",
        "С Aghanim's Shard создается дополнительная Life Drain каждые 1,5 сек. спустя 1,5 сек. после применения, создавая до 7 связей. Связи создаются только при выборе врага. При выборе союзника они не появляются. Выбирает только вражеских героев, включая иллюзии, клонов и крипов-героев. Цель выбирается случайно. Дальность поиска рассчитывается от дальности применения плюс дополнительное расстояние, достигая расстояния в 900 единиц. Поскольку дополнительные связи используют дальность применения заклинания, то эффекты, увеличивающие её, так же действуют на них. Исчезновение во время произнесения основной цели не отменяет применение на вторичных целях.",
        "Связи создаются только при выборе врага. При выборе союзника они не появляются.",
        "Выбирает только вражеских героев, включая иллюзии, клонов и крипов-героев. Цель выбирается случайно.",
        "Дальность поиска рассчитывается от дальности применения плюс дополнительное расстояние, достигая расстояния в 900 единиц.",
        "Поскольку дополнительные связи используют дальность применения заклинания, то эффекты, увеличивающие её, так же действуют на них.",
        "Исчезновение во время произнесения основной цели не отменяет применение на вторичных целях."
      ],
      "mana": "125\/175\/225",
      "hotKey": "R",
      "cooldown": "7 (TagTalent 0)",
      "description": "При применении на врага даёт над ним обзор и отнимает его жизненные силы, пополняя здоровье героя. После полного излечения эта способность пополняет ману героя. При применении на союзника передаёт ему своё здоровье.",
      "spellName": "Life Drain",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 700",
        "Максимальная длительность: 10",
        "Дистанция разрыва: 900",
        "Здоровья в секунду: 150\/225\/300 (TagAghanim 200\/300\/400)",
        "Лечение от урона: 100% (TagTalent 120%)",
        "Доп. расстояние для поиска вторичной цели: 200",
        "Интервал применения на вторичные цели: 1,5",
        "Убирает перезарядку и увеличивает урон.",
        "Каждые 1,5 секунды действия герой начинает применять эту способность на ещё одного случайного вражеского героя.",
        "Можно применить к союзникам с иммунитетом к заклинаниям. Нельзя применить к врагам с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 19.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 5.2,
    "attrAgilityInc": 1.3,
    "attrAgility": 24.0
  },
  "description": "Pugna — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первая способность, Nether Blast, создает взрыв астральной энергии, который наносит урон врагам и сооружениям в области действия. Сооружения получают только половину урона. Вторая способность, Decrepify, изгоняет и замедляет выбранного юнита, лишает его возможности атаковать или быть атакованным, а также увеличивает получаемый им урон от заклинаний. Третья способность, Nether Ward, создает Nether Ward, стреляющий вспышками маны по врагам, которые осмеливаются применять заклинания, в то же время уменьшая их регенерацию маны. Nether Ward наносит урон, равный коэффициенту урона, помноженному на ману, потраченную вражеским героем. Ультимативная способность, Life Drain, поглощает здоровье врага. Если целью является герой, а запас здоровья Pugna полон, то восстанавливается мана. Если целью является союзник, Pugna будет передавать свое здоровье выбранному союзнику. Улучшение с Aghanim's Scepter увеличивает скорость поглощения и сводит время перезарядки до нуля.",
  "history": "В родном мире Пугны стоял ламаистский монастырь искусства Забвения, черпающего энергию из пробоин Нижних пределов. Когда настоятель храма отошёл в Забвение, осиротевшие последователи немедля стали проводить ритуалы, дабы найти новое воплощение своего учителя. Пять лет спустя все знаки наконец указывали на соседние поселения: в тени храма притулились несколько деревень, и по их улицам разносился радостный детский визг. Пугна, младенец тринадцати месяцев от роду, был лишь одним из многих непосед, и в назначенный день его представили монахам вместе с ещё двумя многообещающими малышами. Детям подали горсть потрёпанных, но ценных реликвий прежнего настоятеля. Один мальчик схватил порфировую палочку, принадлежавшую ламе... и стал ковыряться ей в носу. А шаловливая девчонка сцапала амулет ламы и тут же проглотила его. Пугна невозмутимо посмотрел на обоих, весело рассмеялся и испепелил проказников изумрудным пламенем. Потом он вытащил палочку и амулет из двух кучек праха и крикнул: «Моё!» Регенты усадили малыша на плечи, обмотали его в одеяния старого настоятеля и спешно понесли к трону, пока малыш не успел закапризничать. Через пять лет кучей пепла стал уже весь монастырь, чему Пугна был очень и очень рад.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,75 к урону за единицу маны от Nether Ward",
      "talentRight": "+160 к урону от Nether Blast"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+1,5 сек. к длительности Decrepify",
      "talentRight": "+20% к лечению от Life Drain"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+3 удара по Nether Ward",
      "talentRight": "−1 сек. перезарядки Nether Blast"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+200 к здоровью",
      "talentRight": "+20 к скорости передвижения"
    }
  ]
}