{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/41\/Abyssal_Blade_Overwhelm.mp3\/revision\/latest?cb=20210414122317",
      "effects": [
        "Дальность применения: 150",
        "Длительность оглушения: 2"
      ],
      "notes": [
        "Заклинатель получает приказ атаковать цель.",
        "Вопреки визуальным эффектам, эффект мгновенный и не имеет времени полёта.",
        "При применении этой способности Bash уходит на перезарядку.",
        "Можно применять на курьеров."
      ],
      "mana": "75",
      "abilityName": "Overwhelm",
      "cooldown": "35",
      "description": "Оглушает выбранного противника на 2 сек. Проходит сквозь невосприимчивость к заклинаниям.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Abyssal_Blade_Bash.mp3\/revision\/latest?cb=20191227195343",
      "effects": [
        "Шанс для героев ближнего боя: 25%",
        "Шанс для героев дальнего боя: 10%",
        "Урон: 120",
        "Длительность оглушения: 1,5"
      ],
      "notes": [
        "Не сочетается с другим Abyssal Blade или Skull Basher. Не сочетается Time Lock, Bash of the Deep и Greater Bash. Если хоть одна из них доступна, то оглушение от атаки не сработает.",
        "Не сочетается Time Lock, Bash of the Deep и Greater Bash. Если хоть одна из них доступна, то оглушение от атаки не сработает.",
        "При наличии нескольких предметов c оглушающим ударом, работать будет та которая дольше находится в инвентаре.",
        "Сработавшая атака сначала применяет дебафф, затем наносит свой урон.",
        "Дополнительный урон наносится одним источником вместе с атакой и считается за бонусный урон от атаки. Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он все равно учитывается и добавляется напрямую к урону атаки владельца. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. Этот урон можно уменьшить фиксированными уменьшениями урона (например, блокировкой урона). На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он все равно учитывается и добавляется напрямую к урону атаки владельца.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "Этот урон можно уменьшить фиксированными уменьшениями урона (например, блокировкой урона).",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "В среднем добавляет 30 урона каждой атаке для героев ближнего боя и 12 урона для героев дальнего боя.",
        "Не действует на варды и постройки, но срабатывает на союзных существ. Клоны не могут использовать Bash.",
        "Клоны не могут использовать Bash.",
        "Bash использует псевдослучайное распределение.",
        "При применении Overwhelm уходит на перезарядку.",
        "Эта способность использует особую перезарядку. Она не отображается на иконке предмета, её нельзя снизить при помощи уменьшения перезарядки."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": null,
      "description": "Каждая атака может оглушить цель на 1,5 сек. и нанести 120 физического урона. Вероятность зависит от типа атаки владельца: 25% в ближнем бою, 10% — в дальнем.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Шанс срабатывания: 60%",
        "Блокирует урона (TagAghanimближний бой): 70",
        "Блокирует урона (TagAghanimдальний бой): 35"
      ],
      "notes": [
        "Не действует против вардов (TagTalent Plague Ward, Mass Serpent Ward, Death Ward).",
        "Не уменьшает физический урон от заклинаний, за исключением Moon Glaives и The Swarm.",
        "Damage Block использует псевдослучайное распределение.",
        "Для деталей, смотрите Блокировка урона."
      ],
      "mana": null,
      "abilityName": "Damage Block",
      "cooldown": null,
      "description": "С вероятностью в 60% блокирует 70 урона от атак, если владелец — герой ближнего боя, или 35 урона, если герой дальнего боя.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6250",
  "lore": null,
  "consistFrom": [
    "Skull Basher",
    "Vanguard",
    "Recipe"
  ],
  "name": "Abyssal Blade",
  "description": "Острие потерянного клинка Повелителя бездны впивается врагу прямо в душу.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}