{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+140 Chronosphere AoE",
          "talentRight": "+20% Backtrack"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+70 Time Lock Damage",
          "talentRight": "+120 Attack Speed during Chronosphere"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+7% Time Dilation Slow per Cooldown",
          "talentRight": "-1.5s Time Walk"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0.5 Time Walk Backtrack Duration",
          "talentRight": "+6 Time Dilation DPS per cooldown"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Faceless_Void_Time_Walk.mp3\/revision\/latest?cb=20191216013832",
      "effects": [
        "Ability Target Point",
        "Affects Self (TagAghanim Enemies)"
      ],
      "notes": [
        "Time Walk moves Faceless Void with a speed of 3000.",
        "Faceless Void is invulnerable during Time Walk.",
        "Does not disjoint projectiles upon cast.",
        "Does not travel the full distance, when targeting closer than the max distance.",
        "Upon cast, any damage Faceless Void took in the last 2 2.5) seconds gets healed back up. This includes damage dealt by allies. Since it is a heal, it is fully affected by heal manipulation.",
        "Since it is a heal, it is fully affected by heal manipulation.",
        "Backtracks the 3 damage types but not heals and HP Removal. This means it cannot backtrack abilities like Sunder, False Promise, Soul Ring and Armlet of Mordiggian.",
        "This means it cannot backtrack abilities like Sunder, False Promise, Soul Ring and Armlet of Mordiggian.",
        "Status buffs and debuffs, cooldowns and mana are completely unaffected.",
        "With Aghanim's Scepter, Time Walk triggers Time Lock based on its current level on every enemy within 350 radius at the destination point. Does not perform instant attacks to trigger the Time Lock. Instead, the force proc modifier is placed on enemies, which makes Time Lock trigger on them. Dispelling this debuff does not remove the Time Lock stun, but it prevents the Time Lock instant attack from occuring.",
        "Does not perform instant attacks to trigger the Time Lock. Instead, the force proc modifier is placed on enemies, which makes Time Lock trigger on them.",
        "Dispelling this debuff does not remove the Time Lock stun, but it prevents the Time Lock instant attack from occuring."
      ],
      "mana": "40",
      "hotKey": "Q",
      "cooldown": "24\/18\/12\/6 (TagTalent 22.5\/16.5\/10.5\/4.5)",
      "description": "Rushes to a target location while backtracking any damage taken in the last 2 seconds.",
      "spellName": "Time Walk",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: Global",
        "Max Travel Distance: 650 (TagTalent 1050)",
        "Backtracked Time: 2 (TagTalent 2.5)",
        "Time Lock Radius: 350",
        "Applies a Time Lock proc to all units at the landing destination.",
        "Increases Time Walk cast range by 400. Grants a new ability: Reverse Time Walk.",
        "Does not apply Time Lock on spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Darkterror tears a hole in time, passing through Claszureme, and appearing back in an instant."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Faceless_Void_Time_Dilation_1.mp3\/revision\/latest?cb=20191216013829",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Affects units in the Fog of War and invisible units, but not invulnerable and hidden units.",
        "Causes enemy cooldowns and charge-based abilities to recharge 60% slower while they have the debuff. Affects cooldowns of passive abilities, but not the cooldown of items.",
        "Affects cooldowns of passive abilities, but not the cooldown of items.",
        "Deals damage in 1.1-second intervals, starting 1.1 seconds after the debuff is placed, resulting in up to 7\/8\/9\/10 possible instances.",
        "This is how much it can slow and how much damage it can deal for a certain amount of cooldowns, considering the cooldowns are present for the entire duration: 1 Cooldown: 70\/88\/108\/130 (TagTalent 112\/136\/162\/190) damage and 10% (TagTalent 17%) movement speed slow. 2 Cooldowns: 140\/176\/216\/260 (TagTalent 224\/272\/324\/380) damage and 20% (TagTalent 34%) movement speed slow. 3 Cooldowns: 210\/264\/324\/390 (TagTalent 336\/408\/486\/570) damage and 30% (TagTalent 51%) movement speed slow. 4 Cooldowns: 280\/352\/432\/520 (TagTalent 448\/544\/648\/760) damage and 40% (TagTalent 68%) movement speed slow. 5 Cooldowns: 350\/440\/540\/650 (TagTalent 560\/680\/810\/950) damage and 50% (TagTalent 85%) movement speed slow. 6 Cooldowns: 420\/528\/648\/780 (TagTalent 672\/816\/972\/1140) damage and 60% (TagTalent 102%) movement speed slow.",
        "1 Cooldown: 70\/88\/108\/130 (TagTalent 112\/136\/162\/190) damage and 10% (TagTalent 17%) movement speed slow.",
        "2 Cooldowns: 140\/176\/216\/260 (TagTalent 224\/272\/324\/380) damage and 20% (TagTalent 34%) movement speed slow.",
        "3 Cooldowns: 210\/264\/324\/390 (TagTalent 336\/408\/486\/570) damage and 30% (TagTalent 51%) movement speed slow.",
        "4 Cooldowns: 280\/352\/432\/520 (TagTalent 448\/544\/648\/760) damage and 40% (TagTalent 68%) movement speed slow.",
        "5 Cooldowns: 350\/440\/540\/650 (TagTalent 560\/680\/810\/950) damage and 50% (TagTalent 85%) movement speed slow.",
        "6 Cooldowns: 420\/528\/648\/780 (TagTalent 672\/816\/972\/1140) damage and 60% (TagTalent 102%) movement speed slow.",
        "",
        "The damage per second and movement speed slow increasing talents do not update already existing debuffs on enemies.",
        "The slow and damage per second have no stack limit. Each ability on cooldown adds a stack. Also counts the cooldown of hidden abilities, like Invoker's uninvoked abilities or Morph's copies. Rubick's stolen abilities which are on cooldown and already lost do not count, as they are not hidden, but removed.",
        "Also counts the cooldown of hidden abilities, like Invoker's uninvoked abilities or Morph's copies.",
        "Rubick's stolen abilities which are on cooldown and already lost do not count, as they are not hidden, but removed.",
        "The debuff checks all cooldowns continuously, and adapts the slow and damage values and stack count immediately.",
        "Abilities affected by Time Dilation can still be reset (e.g. Refresher Orb).",
        "Multiple instances of Time Dilation do not stack, but refresh the duration."
      ],
      "mana": "60\/70\/80\/90",
      "hotKey": "W",
      "cooldown": "28\/24\/20\/16",
      "description": "Faceless Void traps all nearby enemies in a time dilation field for 8\/9\/10\/11 seconds, extending their cooldowns and slowing their movement and attack speed by 10% for each cooldown extended. Deals damage per second for each cooldown.",
      "spellName": "Time Dilation",
      "params": [
        "Cast Animation: 0.1+0.4",
        "Radius: 775",
        "Cooldown Rate Reduction: 60%",
        "Slow per Extended Cooldown: 10% (TagTalent 17%)",
        "Damage per Second per Extended Cooldown: 10\/11\/12\/13 (TagTalent 16\/17\/18\/19)",
        "Duration: 8\/9\/10\/11",
        "Effects persist if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "For those facing off against Darkterror, each moment seems to stretch into eternity."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Faceless_Void_Time_Lock.mp3\/revision\/latest?cb=20191216013831",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Magical \/ Instant Attack"
      ],
      "notes": [
        "Does not stack with other bashes. The bash from Skull Basher and Abyssal Blade is completely disabled for Faceless Void. In Ability Draft, fully stacks with the bash from Skull Basher and Abyssal Blade.",
        "In Ability Draft, fully stacks with the bash from Skull Basher and Abyssal Blade.",
        "The proccing attack first applies the debuff, then its own damage.",
        "Time Lock works against allied units, but not against wards and buildings.",
        "Upon proccing, the stun debuff gets applied. 0.33 seconds later, the second attack, and the damage applies. The bash damage is dealt in a separate instance and is spell damage. It is not added as attack damage. This means the damage works with spell lifesteal and spell damage amplification, but not with lifesteal, crit, or cleave. The second attack is an instant attack, which can proc any attack modifiers except for cleave (including Time Lock itself) and on-hit effects normally. They do not have True Strike. Applies the instant attack first, then Time Lock's own damage.",
        "The bash damage is dealt in a separate instance and is spell damage. It is not added as attack damage.",
        "This means the damage works with spell lifesteal and spell damage amplification, but not with lifesteal, crit, or cleave.",
        "The second attack is an instant attack, which can proc any attack modifiers except for cleave (including Time Lock itself) and on-hit effects normally. They do not have True Strike.",
        "Applies the instant attack first, then Time Lock's own damage.",
        "Despite the visual effect, the angle of the second attack is still based on Faceless Void's position, so cleave hits towards where he is facing, and not the image that appears.",
        "Adds an average of 1.8\/3.2\/5\/7.2 (TagTalent 10.2\/14.4\/19\/24) damage to every attack.",
        "The damage increasing talent immediately updates already procced instances of Time Lock.",
        "Time Lock uses pseudo-random distribution."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Adds the chance for an attack to lock an enemy unit in time while attacking it a second time.",
      "spellName": "Time Lock",
      "params": [
        "Proc Chance: 12%\/16%\/20%\/24%",
        "Damage: 15\/20\/25\/30 (TagTalent 85\/90\/95\/100)",
        "Second Attack Delay: 0.33",
        "Hero Duration: 0.65",
        "Non-Hero Duration: 2"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "The strike of the Faceless Void lands with dimension shifting force."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Faceless_Void_Time_Walk.mp3\/revision\/latest?cb=20191216013832",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "This ability stays inactive until Time Walk is cast and turns inactive again once 1.5 seconds pass. In Ability Draft, due to non-ultimate abilities being limited to one ability slot, Reverse Time Walk replaces Time Walk while castable, instead of being in a separate slot.",
        "In Ability Draft, due to non-ultimate abilities being limited to one ability slot, Reverse Time Walk replaces Time Walk while castable, instead of being in a separate slot.",
        "When cast, moves Faceless Void back to where he was as he cast Time Walk, using the same travel speed.",
        "Does not reverse anything else. The health change are not reversed, and the Time Lock bash from the upgrade does not proc.",
        "If Time Walk was cast multiple times within 1.5 seconds, casting this moves Faceless Void back to where he was on the first cast."
      ],
      "mana": "0",
      "hotKey": "D",
      "cooldown": "0.5",
      "description": "Replaces Time Walk with Reverse Time Walk for 1.5 seconds after landing. If used in this time period, you will reverse your time walk back to your previous cast location. Does not affect health or proc scepter hits.",
      "spellName": "Reverse Time Walk",
      "params": [
        "Cast Animation: 0+0",
        "Reversal Time Window: 1.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/03\/Faceless_Void_Chronosphere.mp3\/revision\/latest?cb=20191216013838",
      "effects": [
        "Ability Target Area",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "Chronosphere freezes all units which are not owned by Faceless Void, including buildings, wards and allies.",
        "Does not affect Couriers, hidden units and invulnerable heroes. All other invulnerable units are fully affected. Instantly destroys Beetles and Homing Missiles. Instantly causes already latched Phantoms to return to their caster, and freezes traveling phantoms.",
        "Instantly destroys Beetles and Homing Missiles.",
        "Instantly causes already latched Phantoms to return to their caster, and freezes traveling phantoms.",
        "Affected units are stunned. When other units walk inside the area, they also get affected for its remaining duration.",
        "While in the Chronosphere, Faceless Void and any units he controls are phased and hasted, meaning they cannot be slowed below the set value. With the level 20 talent, they all also gain 120 attack speed while inside. The attack speed increasing talent immediately upgrades all currently active Chronospheres, but not already placed buffs.",
        "With the level 20 talent, they all also gain 120 attack speed while inside.",
        "The attack speed increasing talent immediately upgrades all currently active Chronospheres, but not already placed buffs.",
        "Faceless Void and illusions of him (be it his own, enemy or allied illusions) cannot be frozen by Chronospheres, regardless of source. This is innate to Faceless Void. However, the haste and phased movement is only provided to the caster and their units. In Ability Draft, Faceless Void keeps his innate immunity to Chronospheres, even when not drafting it.",
        "However, the haste and phased movement is only provided to the caster and their units.",
        "In Ability Draft, Faceless Void keeps his innate immunity to Chronospheres, even when not drafting it.",
        "Provides flying vision and True Sight over the whole affected area for its duration.",
        "Cancels most sources of Forced Movement upon applying the disabling debuff on a unit.",
        "Units inside Chronosphere can be pulled out by various abilities. However, the following abilities or items cannot move units out of Chronosphere: Force Staff, Hurricane Pike, Psychic Headband, Telekinesis, Snowball and Geomagnetic Grip.",
        "However, the following abilities or items cannot move units out of Chronosphere: Force Staff, Hurricane Pike, Psychic Headband, Telekinesis, Snowball and Geomagnetic Grip.",
        "Despite its visual effects, the effective area is a cylinder not a sphere."
      ],
      "mana": "150\/225\/300",
      "hotKey": "R",
      "cooldown": "160\/150\/140",
      "description": "Creates a blister in spacetime, trapping all units caught in its sphere of influence and causes you to move very quickly inside it. Only Faceless Void and any units he controls are unaffected. Invisible enemies in the sphere will be revealed.",
      "spellName": "Chronosphere",
      "params": [
        "Cast Animation: 0.35+0.35",
        "Cast Range: 500",
        "Radius: 500 (TagTalent 640)",
        "Haste Speed: 1000",
        "Duration: 4\/4.5\/5",
        "Attack Speed Bonus: 120",
        "Faceless Void's immunity to Chronospheres is not disabled by Break."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "When a rift opens to Claszureme, all poor souls caught within will likely never return."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Grants Faceless Void a chance to avoid damage completely.",
        "Backtrack belongs to the group of damage negating effects. It is not evasion. This means it only negates damage, it does not evade any side effects of spells or attacks, like disables. When an attack has e.g. Mana Break and Backtrack triggers on the attack, the damage is avoided, but the mana burn still takes effect. This also means that True Strike or Accuracy does not stop Backtrack from avoiding attack damage. Evasion has priority over Backtrack. When evasion procs, Backtrack cannot proc on that attack.",
        "This means it only negates damage, it does not evade any side effects of spells or attacks, like disables.",
        "When an attack has e.g. Mana Break and Backtrack triggers on the attack, the damage is avoided, but the mana burn still takes effect.",
        "This also means that True Strike or Accuracy does not stop Backtrack from avoiding attack damage.",
        "Evasion has priority over Backtrack. When evasion procs, Backtrack cannot proc on that attack.",
        "Backtrack has the third highest priority in the group of damage negating effects. This means when combined with e.g. Aphotic Shield or Refraction, Backtrack negates damage while the other sources do not.",
        "This means when combined with e.g. Aphotic Shield or Refraction, Backtrack negates damage while the other sources do not.",
        "As with all damage manipulating effects, Backtrack can negate all 3 damage types (Physical, Magical and Pure). Increases Faceless Void's effective health by an average of 25% against those damage types.",
        "Increases Faceless Void's effective health by an average of 25% against those damage types.",
        "Fully ignores damage which is flagged as HP Removal.",
        "Backtrack uses pseudo-random distribution."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "There is no description for this ability.",
      "spellName": "Backtrack",
      "params": [
        "Proc Chance: 20%"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 20.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.0,
    "attrAgility": 19.0
  },
  "description": "Darkterror, the Faceless Void, is a melee agility hero played as an offlaner or carry. Given a little time, he becomes a terrifying hero capable of destroying entire enemy teams in seconds.",
  "history": "Darkterror the Faceless Void is a visitor from Claszureme, a realm outside of time. It remains a mystery why this being from another dimension believes the struggle for the Nemesis Stones is worth entering our physical plane, but apparently an upset in the balance of power in this world has repercussions in adjacent dimensions. Time means nothing to Darkterror, except as a way to thwart his foes and aid his allies. His long-view of the cosmos has given him a remote, disconnected quality, although in battle he is quite capable of making it personal.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+140 Chronosphere AoE",
      "talentRight": "+20% Backtrack"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+70 Time Lock Damage",
      "talentRight": "+120 Attack Speed during Chronosphere"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+7% Time Dilation Slow per Cooldown",
      "talentRight": "-1.5s Time Walk"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0.5 Time Walk Backtrack Duration",
      "talentRight": "+6 Time Dilation DPS per cooldown"
    }
  ]
}