{
  "abilities": [
    {
      "notes": [
        "Оглушение атакой от таланта сочетается с оглушением от Skull Basher или Abyssal Blade.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на силу в общем даёт Ogre Magi: 600 здоровья и 3 регенерации здоровья.",
        "Оглушающий удар от талантов не отключается истощением. Для дополнительной информации, смотрите Оглушающий удар."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+240 к урону от Fireblast",
          "talentRight": "Шанс в 20% оглушить атакой на 1,5 сек."
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 к скорости атаки от Bloodlust",
          "talentRight": "+30 к силе"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+275 к здоровью",
          "talentRight": "+80 к урону"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+75 к дальности заклинаний",
          "talentRight": "+16 к урону в секунду от Ignite"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/72\/Ogre_Magi_Fireblast.mp3\/revision\/latest?cb=20191216021153",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При сработавшей Multicast Fireblast поражает одну и ту же цель несколько раз с интервалом в 0,6 сек.",
        "Здесь указано, сколько урона может нанести Fireblast, сработавшая несколько раз (до уменьшений) и сколько будет длится оглушение на каждом уровне: 2x Multicast: 120\/240\/360\/480 (TagTalent 600\/720\/840\/960) урона, 2,1 сек. оглушения. 3x Multicast: 180\/360\/540\/720 (TagTalent 900\/1080\/1260\/1440) урона, 2,7 сек. оглушения. 4x Multicast: 240\/480\/720\/960 (TagTalent 1200\/1440\/1680\/1920) урона, 3,3 сек. оглушения.",
        "2x Multicast: 120\/240\/360\/480 (TagTalent 600\/720\/840\/960) урона, 2,1 сек. оглушения.",
        "3x Multicast: 180\/360\/540\/720 (TagTalent 900\/1080\/1260\/1440) урона, 2,7 сек. оглушения.",
        "4x Multicast: 240\/480\/720\/960 (TagTalent 1200\/1440\/1680\/1920) урона, 3,3 сек. оглушения.",
        "",
        "Каждая волна сначала наносит урон, затем применяет дебафф."
      ],
      "mana": "75\/85\/95\/105",
      "hotKey": "Q",
      "cooldown": "11\/10\/9\/8",
      "description": "Поражает врага огненной волной, нанося цели урон и оглушая её.",
      "spellName": "Fireblast",
      "params": [
        "Анимация применения: 0,45+0,53",
        "Дальность применения: 475 (TagTalent 550)",
        "Интервал Multicast: 0,6",
        "Урон: 60\/120\/180\/240 (TagTalent 300\/360\/420\/480)",
        "Длительность оглушения: 1,5",
        "Дарует новую способность: Unrefined Fireblast.",
        "При блокировке прерывает Multicast: не важно, было ли заблокировано изначальное применение или применение сработавшего Multicast."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Огров легко развлечь: они часами забавляются игрой с огнём."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/71\/Ogre_Magi_Ignite_1.mp3\/revision\/latest?cb=20191216021143",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Ignite летит со скоростью 1000 единиц.",
        "Дополнительный снаряд выбирает только тех врагов, на которых еще не действует дебафф Ignite.",
        "Если в радиусе действия несколько врагов без дебаффа, то для второго снаряда выбирается ближайшая цель. Не может выбрать невидимых, неуязвимых, спрятанных существ или существ в тумане войны.",
        "Не может выбрать невидимых, неуязвимых, спрятанных существ или существ в тумане войны.",
        "При сработавшей Multicast запускает снаряды Ignite с интервалом в 0,6 сек. в случайных врагов или нейтральных крипов в радиусе 1600 единиц от Ogre Magi. Multicast также выпускает 2 снаряда за применение. Не может выбрать целью невидимых, неуязвимых, спрятанных существ или существ в тумане войны. Приоритет выше для существ без дебаффа от Ignite. Может выбрать одно и то же существо несколько раз.",
        "Multicast также выпускает 2 снаряда за применение.",
        "Не может выбрать целью невидимых, неуязвимых, спрятанных существ или существ в тумане войны.",
        "Приоритет выше для существ без дебаффа от Ignite.",
        "Может выбрать одно и то же существо несколько раз.",
        "Дебаффы от Ignite не складываются между собой. При этом новое применение добавляет свою длительность к уже существующему дебаффу, а не обновляет его.",
        "Наносит урон с интервалом в 1 секунду сразу после применения дебаффа. С сработавшей Multicast на цель каждый снаряд с тиком наносит урон при попадании. При этом таймер тиков сбрасывается при каждом попадании, поэтому все тики, кроме 1, при попадании отменяются, в среднем срабатывая до: Без Multicast: 6\/7\/8\/9 раз. 2x Multicast: 11\/13\/15\/17 раз. 3x Multicast: 16\/19\/22\/25 раз. 4x Multicast: 21\/25\/29\/33 раз.",
        "С сработавшей Multicast на цель каждый снаряд с тиком наносит урон при попадании.",
        "При этом таймер тиков сбрасывается при каждом попадании, поэтому все тики, кроме 1, при попадании отменяются, в среднем срабатывая до:",
        "Без Multicast: 6\/7\/8\/9 раз.",
        "2x Multicast: 11\/13\/15\/17 раз.",
        "3x Multicast: 16\/19\/22\/25 раз.",
        "4x Multicast: 21\/25\/29\/33 раз.",
        "",
        "Ниже указано, сколько урона нанесет Ignite с и без Multicast (до уменьшений): Без Multicast: 120\/210\/320\/450 (TagTalent 216\/322\/448\/594) урона. 2x Multicast: 220\/390\/600\/850 (TagTalent 396\/598\/840\/1122) урона. 3x Multicast: 320\/570\/880\/1250 (TagTalent 576\/874\/1232\/1650) урона. 4x Multicast: 420\/750\/1160\/1650 (TagTalent 756\/1150\/1624\/2178) урона.",
        "Без Multicast: 120\/210\/320\/450 (TagTalent 216\/322\/448\/594) урона.",
        "2x Multicast: 220\/390\/600\/850 (TagTalent 396\/598\/840\/1122) урона.",
        "3x Multicast: 320\/570\/880\/1250 (TagTalent 576\/874\/1232\/1650) урона.",
        "4x Multicast: 420\/750\/1160\/1650 (TagTalent 756\/1150\/1624\/2178) урона.",
        ""
      ],
      "mana": "90",
      "hotKey": "W",
      "cooldown": "15",
      "description": "Обливает цель и ещё одно случайное существо летучим веществом, поджигая их. Жертвы испытывают невероятную боль, получают урон и передвигаются медленнее.",
      "spellName": "Ignite",
      "params": [
        "Анимация применения: 0,45+0,43",
        "Дальность применения: 700\/800\/900\/1000 (TagTalent 775\/875\/975\/1075)",
        "Радиус поиска доп. цели: 900\/1000\/1100\/1200",
        "Радиус Multicast: 1600",
        "Интервал Multicast: 0,6",
        "Число целей: 2",
        "Урон в секунду: 20\/30\/40\/50 (TagTalent 36\/46\/56\/66)",
        "Замедление скорости передвижения: 20%\/22%\/24%\/26%",
        "Длительность: 5\/6\/7\/8",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется при попадании в любую цель. Не прерывает Multicast."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "На, лови!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d7\/Ogre_Magi_Bloodlust.mp3\/revision\/latest?cb=20191216021152",
      "effects": [
        "Способность Направленная на существо \/ Авто-применяемая",
        "Действует на Союзников"
      ],
      "notes": [
        "Вопреки визуальному эффекту, при использовании бафф сразу применяется к цели. Снаряд имеет только визуальное значение.",
        "При сработавшей Multicast мгновенно применяет бафф от Bloodlust на случайных союзников в радиусе действия.",
        "Также увеличивает размер модели целей на 25% на всю длительность. Способность не влияет на размер столкновения.",
        "Можно применять на любое союзное существо, не являющееся вардом. В этот список также включены строения и неуязвимые союзники.",
        "Можно включить автоприменение способности. При включенном автоприменении Ogre Magi автоматически применяет способность на ближайшего союзного героя, еще не находящегося под действием баффа от Bloodlust. Действие также распространяется на клонов героев, крипов-героев, но не на иллюзии. Не выбирает автоматически линейных крипов, крипов-героев с иммунитетом к заклинаниям и других союзных или находящихся в подчинении героя призываемых существ. Может прервать текущую задачу Ogre Magi и заставить его забыть следующую команду в очереди. При этом автоприменение не активируется при произнесении способностей.",
        "При включенном автоприменении Ogre Magi автоматически применяет способность на ближайшего союзного героя, еще не находящегося под действием баффа от Bloodlust.",
        "Действие также распространяется на клонов героев, крипов-героев, но не на иллюзии.",
        "Не выбирает автоматически линейных крипов, крипов-героев с иммунитетом к заклинаниям и других союзных или находящихся в подчинении героя призываемых существ.",
        "Может прервать текущую задачу Ogre Magi и заставить его забыть следующую команду в очереди. При этом автоприменение не активируется при произнесении способностей."
      ],
      "mana": "65",
      "hotKey": "E",
      "cooldown": "20\/18\/16\/14",
      "description": "Заставляет союзника впасть в бешенство, повышая скорость его атаки и передвижения.",
      "spellName": "Bloodlust",
      "params": [
        "Анимация применения: 0,45+0,67",
        "Дальность применения: 600 (TagTalent 675)",
        "Радиус Multicast: 700",
        "Доп. скорость передвижения: 7%\/9%\/11%\/13%",
        "Доп. скорость атаки: 30\/40\/50\/60 (TagTalent 70\/80\/90\/100)",
        "Доп. скорость атаки для владельца: 30\/50\/70\/90 (TagTalent 70\/90\/110\/130)",
        "Длительность: 30"
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "«Бегать очень скучно... Ага, подраться бы»!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/72\/Ogre_Magi_Fireblast.mp3\/revision\/latest?cb=20191216021153",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки.",
        "Ogre Magi всегда будет хватать маны для использования данной способности, поскольку она всегда требует 30% от его текущего запаса маны (округленный показатель).",
        "Описание показывает текущий расход маны и обновляется всякий раз, когда курсор мыши наводится на иконку способности.",
        "При сработавшей Multicast, Unrefined Fireblast поражает одну и ту же цель несколько раз с интервалом в 0,6 сек.",
        "Ниже указано, сколько урона нанесет Unrefined Fireblast, сработавшая несколько раз (до уменьшений) и сколько будет длится оглушение на каждом уровне: 2x Multicast: 550 урона, 2,1 сек. оглушения. 3x Multicast: 825 урона, 2,7 сек. оглушения. 4x Multicast: 1100 урона, 3,3 сек. оглушения.",
        "2x Multicast: 550 урона, 2,1 сек. оглушения.",
        "3x Multicast: 825 урона, 2,7 сек. оглушения.",
        "4x Multicast: 1100 урона, 3,3 сек. оглушения.",
        "",
        "Каждая волна сначала наносит урон, затем применяет дебафф.",
        "В режиме Ability Draft эта способность недоступна из-за связи заклинаний, даваемых Aghanim's Scepter, с ультимативными способностями."
      ],
      "mana": "30% от текущей маны",
      "hotKey": "D",
      "cooldown": "6",
      "description": "Поражает врага огненной волной, нанося цели урон и оглушая её. На применение этой способности уходит 30% текущего запаса маны.",
      "spellName": "Unrefined Fireblast",
      "params": [
        "Анимация применения: 0,45+0,53",
        "Дальность применения: 475 (TagTalent 550)",
        "Интервал Multicast: 0,6",
        "Урон: 275",
        "Длительность оглушения: 1,5",
        "При блокировке прерывает Multicast: не важно, было ли заблокировано изначальное применение или применение сработавшей Multicast."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Если огры не могут решить, кому колдовать первым, спор разрешается просто: они колдуют одновременно."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Ogre_Magi_Fire_Shield_1.mp3\/revision\/latest?cb=20210102002122",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "С сработавшей Multicast мгновенно применяет бафф к случайным союзникам в радиусе.",
        "Можно применять на любое союзное существо, не являющееся вардом. В этот список также включены строения.",
        "Нельзя применять на неуязвимых союзников; при этом Multicast союзников выбирает.",
        "Щит реагирует только на атаки: уменьшение урона применяется только к урону атак.",
        "Срабатывает только при попадании атаки вражеского существа с любого расстояния. То есть щит не реагирует на промахнувшиеся атаки.",
        "Не реагирует на атаки строений и вардов. Действует на атаки союзников.",
        "Шары летят со скоростью 1400.",
        "Источником урона шаров всегда является заклинатель Fire Shield, но не существо под щитом.",
        "Вместе шары наносят до 375 урона до уменьшений.",
        "Число оставшихся атак обозначается визуальным эффектом: для каждого оставшегося срабатывания есть огненный шар, который летает вокруг существа. Число также отображается в иконке баффа.",
        "Число также отображается в иконке баффа.",
        "Повторное применение на цель не сбросит число атак, а лишь обновит длительность."
      ],
      "mana": "75",
      "hotKey": "F",
      "cooldown": "16",
      "description": "Создаёт вокруг союзного существа или постройки щит, поглощающий урона от следующих атак. В нападающего летят огненные шары, которые наносят %damage% урона. Длительность: 25 сек.",
      "spellName": "Fire Shield",
      "params": [
        "Анимация применения: 0,2+0,6",
        "Дальность применения: 600",
        "Радиус Multicast: 1000",
        "Число атак: 3",
        "Уменьшение урона от атак: 70%",
        "Урон огненного шара: 125",
        "Длительность: 25",
        "Можно применять на союзников с иммунитетом к заклинаниям. Выпускает шары в врагов с иммунитетом, но они не наносят урон.",
        "Шары можно избежать."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/79\/Ogre_Magi_Multicast_1.mp3\/revision\/latest?cb=20191216021147",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Помимо срабатывания собственных заклинаний Multicast может активировать направленные на цель предметы при выборе врагов. Следующие предметы активируют Multicast: Force Staff, Heaven's Halberd, Abyssal Blade, Diffusal Blade, Bloodthorn, Hurricane Pike, Ethereal Blade, Eul's Scepter of Divinity, Medallion of Courage, Dagon, Hand of Midas, Rod of Atos, Solar Crest, Nullifier, Orchid Malevolence, Scythe of Vyse, Clumsy Net, Iron Talon. Следующие предметы активируют Multicast, но не срабатывают: Spirit Vessel, Urn of Shadows. Следующие предметы не активируются Multicast: Helm of the Dominator.",
        "Следующие предметы активируют Multicast: Force Staff, Heaven's Halberd, Abyssal Blade, Diffusal Blade, Bloodthorn, Hurricane Pike, Ethereal Blade, Eul's Scepter of Divinity, Medallion of Courage, Dagon, Hand of Midas, Rod of Atos, Solar Crest, Nullifier, Orchid Malevolence, Scythe of Vyse, Clumsy Net, Iron Talon.",
        "Следующие предметы активируют Multicast, но не срабатывают: Spirit Vessel, Urn of Shadows.",
        "Следующие предметы не активируются Multicast: Helm of the Dominator.",
        "Активирует предметы только при выборе врагов, даже если сам предмет по умолчанию может выбрать целью союзника. Если поблизости нет врагов, то Multicast не даст эффекта. Он не может выбрать целью одно и то же существо несколько раз. Предметы продолжают действовать по своим правилам выбора цели. Например, предмет, выбирающий только крипов, не может умножить своё действие на вражеских героев.",
        "Если поблизости нет врагов, то Multicast не даст эффекта. Он не может выбрать целью одно и то же существо несколько раз.",
        "Предметы продолжают действовать по своим правилам выбора цели. Например, предмет, выбирающий только крипов, не может умножить своё действие на вражеских героев.",
        "Радиус множественного срабатывания основан на дальности применения предмета, дополнительной дальности применения и дальности в 600 от способности.",
        "При срабатывании нескольких множителей выбирается наивысшее значение. Без срабатывания: 25%\/25%\/25% 2x Multicast: 75%\/45%\/45% 3x Multicast: 0%\/30%\/15% 4x Multicast: 0%\/0%\/15%. То есть в среднем каждое заклинание применяется в 175%\/205%\/220% случаев.",
        "Без срабатывания: 25%\/25%\/25%",
        "2x Multicast: 75%\/45%\/45%",
        "3x Multicast: 0%\/30%\/15%",
        "4x Multicast: 0%\/0%\/15%.",
        "То есть в среднем каждое заклинание применяется в 175%\/205%\/220% случаев.",
        "Способность недоступна в режиме Ability Draft."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Позволяет способностям и предметам героя срабатывать по нескольку раз за одно применение.",
      "spellName": "Multicast",
      "params": [
        "Дальность применения Ignite: 1600",
        "Радиус применения Bloodlust: 700",
        "Радиус применения Fire Shield: 1000",
        "Доп. дальность применения предметов: 600",
        "Шанс 2x: 75%\/75%\/75%",
        "Шанс 3x: 0%\/30%\/30%",
        "Шанс 4x: 0%\/0%\/15%",
        "Дарует новую способность: Fire Shield"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Пускай умом огры не блещут, к успеху в битве их приведёт мастерство чистой воды."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 2.5,
    "attrAgilityInc": 1.5,
    "attrAgility": 14.0
  },
  "description": "Ogre Magi — это герой с ближним типом атаки, основной характеристикой которого является интеллект, однако сила героя значительно больше. Силой своей воли он способен порождать природное пламя и взрывы, уничтожающие врагов. Знаменит огромным случайным уроном, сочетающимся с экстремально большим для мага здоровьем. Способность Fireblast позволяет поразить врага огненной волной, которая оглушит его и нанесет урон. Способностью Ignite герой кидает в противников горючие смеси, которые замедляют их и наносят периодический урон. Третья способность Bloodlust дает возможность герою наделить союзника жаждой крови, под котором союзник получает бонусы к скорости атаки и передвижения. Главная и пассивная способность - Multicast улучшает способности героя. Например, первая способность может поразить цель несколько раз подряд, выдав некоторый Multicast, а вторая способность увеличивает радиус действия и так далее.",
  "history": "Огр обыкновенный — создание, для которого словно придумали выражение «туп как пень». В обычной своей форме огр решительно неспособен на осмысленный поступок или обоснованное действие. Обычно покрытый грязью, он может вдруг обнаружить, что завернулся в шкуру падали, только что ей пообедав. Не намного лучше и его социальные способности — огр частенько нежно заигрывает с камнем или пнём, которые случайно принял за кого-то из своих (этим зачастую и объясняют маленький уровень рождаемости у огров). Однако примерно раз в поколение на расу огров снисходит благословение — рождение двухголового чудотворца, которому сразу же дается традиционное имя Аггрон Стонбрейк — так звали первого и, возможно, единственного мудрого огра за всю историю их расы. С двумя головами огр уже способен жить и мыслить на уровне, для которого многим другим существам хватило бы и одной. Пусть такой огр и не выйдет победителем из философского спора (даже с самим собой), ему дана посланная с небес «удача дурака» — склонность к необъяснимым, случайным чередам невероятной удачи, которые позволяют расе огров блистать, несмотря на врагов, жестокие погодные условия и неспособность прокормить себя. Будто бы сама богиня удачи, переполненная жалостью к печально недалёким существам, берёт одарённого огра к себе под крыло. И кому же её винить? Бедняжки.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+240 к урону от Fireblast",
      "talentRight": "Шанс в 20% оглушить атакой на 1,5 сек."
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 к скорости атаки от Bloodlust",
      "talentRight": "+30 к силе"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+275 к здоровью",
      "talentRight": "+80 к урону"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+75 к дальности заклинаний",
      "talentRight": "+16 к урону в секунду от Ignite"
    }
  ]
}