{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Дальность применения: 300",
        "Радиус действия: 300",
        "Время действия: 4",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Раскрывает противников в области применения способности, даже если они находятся в тумане войны, также применяет на них раскрытие невидимости.",
        "Эффект ауры задерживается на 0,5 сек.",
        "Не может обнаружить противников, находящихся под действием способности Shadow Dance, но может раскрыть противников, под действием иммунитета к раскрытию невидимости от других источников.",
        "Не действует на неуязвимых противников.",
        "Визуальный эффект в выбранной области виден только команде, применившей способность. Звук слышен обеим командам."
      ],
      "mana": "0",
      "abilityName": "Reveal",
      "cooldown": "12",
      "description": "Раскрывает невидимость в радиусе 300, показывая даже варды и существ в тумане войны.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 900",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Эффект раскрытия невидимости даётся в радиусе 900, независимо от фактического обзора носителя. Он полностью беспрепятственный. Эффект раскрытия невидимости даётся аурой, которая действует на врагов. Негативный эффект задерживается на 0,5 секунды. Раскрытие невидимости не работает, если предмет находится в инвентаре курьера или духа-медведя.",
        "Эффект раскрытия невидимости даётся аурой, которая действует на врагов. Негативный эффект задерживается на 0,5 секунды.",
        "Раскрытие невидимости не работает, если предмет находится в инвентаре курьера или духа-медведя.",
        "Полностью действует на неуязвимых существ.",
        "Не может обнаружить существ под эффектами Shadow Dance, Depth Shroud, Disguise и Solitary Disguise."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Даёт владельцу и его союзникам возможность видеть невидимых существ и варды в радиусе 900.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Этот предмет выпадает, когда носитель умирает, если только у него нет воскрешения.",
    "Gem of True Sight нельзя переложить в ранец."
  ],
  "cost": "900",
  "lore": null,
  "consistFrom": null,
  "name": "Gem of True Sight",
  "description": "Как не сдаётся житель моря, Как души утонувших моряков, Как Маэльрон не ведает покоя, Сей камень вечно прослужить готов.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}