{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Doom_Devour.mp3\/revision\/latest?cb=20191216012532",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских существ",
        "Урон: Мгновенное убийство"
      ],
      "notes": [
        "Целью могут быть все нейтральные крипы и призываемые существа, за исключением курьеров, древних крипов и крипов-героев. При выборе соответствующего таланта целью могут стать древние крипы (исключая курьеров и Рошана). Следующие крипы не могут быть сожраны из-за ограничений в уровне: Уровень 4: Может сожрать любого крипа Уровень 3: Может сожрать любого крипа Уровень 2, не может сожрать: Древний гранитный голем, Древний громозавр, Древний чёрный дракон, Древний шаман льда, Сатир-мучитель, Тролль-некромант, Уровень 1, также не может сожрать: Вожак волков, Воин Некрономикона, Дикокрыл-потрошитель, Древний грохозавр, Древний каменный голем, Древний морозный голем, Кентавр-захватчик, Лучник Некрономикона, Медведемон-крушитель, Сосновый налётчик,",
        "При выборе соответствующего таланта целью могут стать древние крипы (исключая курьеров и Рошана).",
        "Следующие крипы не могут быть сожраны из-за ограничений в уровне: Уровень 4: Может сожрать любого крипа Уровень 3: Может сожрать любого крипа Уровень 2, не может сожрать: Древний гранитный голем, Древний громозавр, Древний чёрный дракон, Древний шаман льда, Сатир-мучитель, Тролль-некромант, Уровень 1, также не может сожрать: Вожак волков, Воин Некрономикона, Дикокрыл-потрошитель, Древний грохозавр, Древний каменный голем, Древний морозный голем, Кентавр-захватчик, Лучник Некрономикона, Медведемон-крушитель, Сосновый налётчик,",
        "Уровень 4: Может сожрать любого крипа",
        "Уровень 3: Может сожрать любого крипа",
        "Уровень 2, не может сожрать: Древний гранитный голем, Древний громозавр, Древний чёрный дракон, Древний шаман льда, Сатир-мучитель, Тролль-некромант,",
        "Уровень 1, также не может сожрать: Вожак волков, Воин Некрономикона, Дикокрыл-потрошитель, Древний грохозавр, Древний каменный голем, Древний морозный голем, Кентавр-захватчик, Лучник Некрономикона, Медведемон-крушитель, Сосновый налётчик,",
        "Выбранный крип мгновенно умирает, при этом герой получит награду и опыт как будто он совершил последний удар.",
        "Модификаторы от нескольких применений складываются.",
        "Автоприменение разрешает перенимать заклинания нейтральных крипов. Оно не заставляет Doom автоматически применять способность. Doom приобретает способности только из первой и второй ячеек нейтрального крипа. Если крип имеет третью способность, то Doom её не приобретет. Это значит, что когда Doom пожирает Древнего дракона, то он получает Fireball и Splash Attack, но не Dragonhide Aura. Приобретённые способности появляются в 4-й и 5-й ячейке способностей Doom. Пожирание крипа без способностей не уберет полученные ранее способности. Герой не приобретает способности, относящиеся к классам атаки. Может получать способности от нейтральных крипов. Способности других существ не передаются. Способности приобретаются мгновенно при пожирании нейтрального крипа. Способности используют то же время применения, что было у поглощенного существа, однако задержка после применения зависит от способности (смотрите таблицу ниже). Способности, перенятые от нейтральных крипов, сохраняются даже после смерти Doom до момента, пока герой не поглотит другого нейтрального крипа со способностями, когда будет включено Автоприменение.",
        "Doom приобретает способности только из первой и второй ячеек нейтрального крипа. Если крип имеет третью способность, то Doom её не приобретет.",
        "Это значит, что когда Doom пожирает Древнего дракона, то он получает Fireball и Splash Attack, но не Dragonhide Aura.",
        "Приобретённые способности появляются в 4-й и 5-й ячейке способностей Doom.",
        "Пожирание крипа без способностей не уберет полученные ранее способности.",
        "Герой не приобретает способности, относящиеся к классам атаки.",
        "Может получать способности от нейтральных крипов. Способности других существ не передаются. Способности приобретаются мгновенно при пожирании нейтрального крипа.",
        "Способности используют то же время применения, что было у поглощенного существа, однако задержка после применения зависит от способности (смотрите таблицу ниже).",
        "Способности, перенятые от нейтральных крипов, сохраняются даже после смерти Doom до момента, пока герой не поглотит другого нейтрального крипа со способностями, когда будет включено Автоприменение."
      ],
      "mana": "60",
      "item_behaviour": [],
      "name": "Devour",
      "cooldown": "40\/50\/60\/70",
      "description": "Пожирает вражеского или нейтрального крипа, перенимая его способности и получая дополнительную броню на время, пока он переваривается. Если автоматическое применение выключено, способности не перенимаются. Длительность действия равна времени перезарядки способности.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,93",
        "Дальность применения: 300",
        "Макс. уровень крипа: 4\/5\/6\/6",
        "Доп. золото: 50\/100\/150\/200",
        "Доп. броня: 1\/3\/5\/7",
        "Длительность переваривания: 60"
      ],
      "legacy_key": "E",
      "story": "Обжорство и жадность Люцифера неистощимы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f8\/Doom_Scorched_Earth.mp3\/revision\/latest?cb=20191216012530",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "notes": [
        "При использовании Scorched Earth прерывает произносимые способности Doom.",
        "Центр радиуса способности закреплен за Doom всю длительность.",
        "Если заклинатель спрятан, Scorched Earth перестаёт наносить урон по область, а визуальные эффекты исчезают до тех пор, пока исчезновение не закончится.",
        "Скорость передвижения предоставлена аурой, задерживающейся на 0,5 секунды.",
        "Урон не связан с аурой.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая до 10\/12\/14\/16 раз.",
        "Может нанести до 180\/384\/644\/960 (TagTalent 380\/624\/924\/1280) урона одному врагу, если он оставался в радиусе действия всю длительность (до уменьшений).",
        "Выбор увеличивающего урон способности таланта мгновенно увеличит урон от текущего применения. Однако поднятие уровня способности не увеличивает урон от текущего применения.",
        "Однако поднятие уровня способности не увеличивает урон от текущего применения.",
        "Выбор увеличивающего скорость передвижения таланта на дополнительную скорость передвижения не увеличит скорость передвижения от текущего применения.",
        "Несколько применений Scorched Earth не складываются. Активация способности просто обновит бафф."
      ],
      "mana": "35 (TagTalent 25)",
      "item_behaviour": [],
      "name": "Scorched Earth",
      "cooldown": "60\/70\/80\/90",
      "description": "Устилает пламенем землю вокруг героя, увеличивая его скорость передвижения, а также нанося урон противникам.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0,5",
        "Радиус: 600",
        "Урон в секунду: 18\/32\/46\/60 ( 38\/52\/66\/80)",
        "Доп. скорость передвижения: 9%\/11%\/13%\/15% ( 44%\/46%\/48%\/50%)",
        "Длительность задержки ауры: 0,5",
        "Длительность: 10\/12\/14\/16"
      ],
      "legacy_key": "T",
      "story": "Падший оставляет за собой страшные разрушения — пламя, питающее его, не щадит никого."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Дальность применения Infernal Blade основана на дальности применения заклинателя. Дальность применения может быть увеличена бонусами к дальности атаки, однако она не может быть увеличена при помощи бонусов к дальности применения. Автоприменение и ручное применение используют текущую дальность атаки Doom.",
        "Дальность применения может быть увеличена бонусами к дальности атаки, однако она не может быть увеличена при помощи бонусов к дальности применения.",
        "Автоприменение и ручное применение используют текущую дальность атаки Doom.",
        "Не срабатывает при мгновенных атаках.",
        "Не действует на Рошана.",
        "Infernal Blade не работает против союзных существ, построек или вардов.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 4 раз.",
        "Может нанести до 80\/120\/160\/200 + 4%\/8%\/12%\/16% (TagTalent 12,4%\/16,4%\/20,4%\/24,4%) от максимального здоровья цели (до уменьшений).",
        "Несколько применений на одну и ту же цель сочетаются и действуют независимо друг от друга. Выбор увеличивающего урон способности таланта или повышение уровня способности не увеличит урон от уже наложенного эффекта.",
        "Выбор увеличивающего урон способности таланта или повышение уровня способности не увеличит урон от уже наложенного эффекта.",
        "Оглушение представлено оглушающим ударом, сочетающимся с другими способностями, использующими этот эффект. Сначала применяется оглушение, затем накладывается горение, после чего наносится урон от атаки.",
        "Сначала применяется оглушение, затем накладывается горение, после чего наносится урон от атаки.",
        "При улучшении с Aghanim's Shard, увеличивает урон на 150 и длительность оглушения до 3, если уровень жертвы равен 3\/6\/9\/12\/15\/18\/21\/24\/25\/26\/27\/28\/29\/30. Если существо имеет требуемый уровень, то атака нанесёт сначала дополнительный урон от этого. Работает также против существ, не являющихся героями. Следующие существа будут получать дополнительность оглушение и урон: Гигантский волк, Древний гранитный голем, Древний громозавр, Древний чёрный дракон, Древний чёрный дракончик, Древний шаман льда, Дух-элементаль, Крип-знаменосец, Крип-мечник, Линейный Волк Ликантропа, Огр-чародей, Паучок, Призрак, Сатир-мучитель, Тролль-некромант, Холмовой тролль, Штормовая гарпия,",
        "Если существо имеет требуемый уровень, то атака нанесёт сначала дополнительный урон от этого.",
        "Работает также против существ, не являющихся героями. Следующие существа будут получать дополнительность оглушение и урон: Гигантский волк, Древний гранитный голем, Древний громозавр, Древний чёрный дракон, Древний чёрный дракончик, Древний шаман льда, Дух-элементаль, Крип-знаменосец, Крип-мечник, Линейный Волк Ликантропа, Огр-чародей, Паучок, Призрак, Сатир-мучитель, Тролль-некромант, Холмовой тролль, Штормовая гарпия,"
      ],
      "mana": "16\/12\/8\/4",
      "item_behaviour": [],
      "name": "Infernal Blade",
      "cooldown": "40",
      "description": "Для этой способности нет описания.",
      "hot_key": "E",
      "params": [
        "Дальность применения: 200",
        "Начальный урон: 20\/30\/40\/50",
        "Сжигание от максимального здоровья: 1%\/2%\/3%\/4% ( 3,1%\/4,1%\/5,1%\/6,1%)",
        "Длительность горения: 4",
        "Длительность оглушения: 0,6 ( 1,2)",
        "Кратность уровня: 3",
        "Доп. урон при кратности уровня: 150",
        "Доп. длительность оглушения при кратности уровня: 1,8"
      ],
      "legacy_key": "V",
      "story": "Люцифер рад поделиться клеймом, полученным после изгнания."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0d\/Doom_Doom.mp3\/revision\/latest?cb=20191216012527",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "notes": [
        "При использовании применяет к цели базовое развеивание, снимая большинство действующих баффов.",
        "Обезмолвивает и заглушает цель, предотвращая применение заклинаний и использование предметов.",
        "Нельзя применить на древних крипов. Можно применить на крипов-героев и иллюзии.",
        "Наносит урон с интервалом в 1 секунду сразу после применения, срабатывая 16 (TagTalent 22) раз.",
        "Может нанести до 480\/720\/960 (TagTalent 660\/990\/1320) без взятия талантов (до уменьшений). При выборе увеличивающего урон таланта, может нанести до 672\/912\/1152 (TagTalent 924\/1254\/1584) урона.",
        "При выборе увеличивающего урон таланта, может нанести до 672\/912\/1152 (TagTalent 924\/1254\/1584) урона.",
        "Повышение уровня способности не обновит урон уже действующей способности, но выбор таланта на дополнительный урон способность улучшает. Однако взятие увеличивающего урон таланта обновит значение наносимого урона.",
        "Однако взятие увеличивающего урон таланта обновит значение наносимого урона.",
        "Союзники могут добить героев под действием Doom, если уровень их здоровья опустится ниже 25%.",
        "Несколько применений на одно и то же существо не складываются, но обновляют длительность.",
        "При улучшении с Aghanim's Scepter, накладывает на жертву истощение, отключая её пассивные способности."
      ],
      "mana": "145",
      "item_behaviour": [],
      "name": "Doom",
      "cooldown": "150\/200\/250",
      "description": "Вражеского героя настигает жуткая участь, отчего тот получает периодический урон и не может применять способности или использовать предметы.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,5+0,4",
        "Дальность применения: 500",
        "Урон в секунду: 30\/45\/60 ( 42\/57\/72)",
        "Длительность: 16 ( 22)"
      ],
      "legacy_key": "D",
      "story": "По ком прозвонил колокол Вашундола, за тем последует неминуемый рок."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 24.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.5,
    "attrAgility": 15.0
  },
  "description": "Запрещает одному врагу применять способности и предметы. Doom забирает жизни своих врагов разными способами. Он пожирает существ, чтобы перенять их способности, а также способен наслать на врага адское пламя, не дающее тому использовать способности и предметы.  Керри Контроль Инициация Стойкость Быстрый урон ★★☆",
  "history": "Он — тот, кто горит, но не сгорает, пожирает, но не насыщается, убивает, но остается безнаказанным. Падший ангел несёт погибель всем, кто осмелится противостоять ему, срезая души остриём своего пламенного меча. Когда-то Люцифер был уважаемым генералом из мира за гранью света, но однажды не преклонил колени и был обвинён в грехе — неповиновении. Шесть раз пробил его имя великий колокол Вашундола. Шестьдесят и ещё шесть раз его крылья клеймили, покуда от них не остались лишь дымящиеся культи. Бескрылый, он потерял свою связь со светом и со страшным воплем пал оземь, оставив в пустыне кратер. Покинув Рай навеки, теперь он нападает на любого без повода и без пощады. Из всех живых существ лишь он волен ходить по семи тёмным владениям. Движимый непреложными стремлениями, искажённый невообразимыми способностями, он всегда несёт с собой свой собственный ад. Люцифер не покорится никому, и когда-нибудь мир будет принадлежать ему."
}