{"abilities":[{"spell":"Silencer will permanently steal 2 (4 with Talent) intelligence from any enemy hero that dies within 925 range or is killed by the Silencer.","effects":["Ability Passive","Affects Enemy Heroes \/ Self"],"notes":["This is an innate ability and does not need to be skilled. It is not bound to any ability, but to Silencer himself.","Stolen intelligence is directly removed from the enemy's base intelligence and added to Silencer's base intelligence.","Can only steal from base intelligence + intelligence gained from levels. Bonus intelligence cannot be stolen.","It does not matter how an enemy hero within the radius dies, Silencer always steals its intelligence.","Silencer also always steals intelligence when he deals the killing blow on an enemy hero, regardless of distance. However, Silencer needs to be alive as the kill happens to steal the intelligence.","Cannot steal intelligence from illusions or hero clones. When Silencer kills a Meepo clone however, he does steal intelligence, since killing a Meepo clone also kills the main Meepo.","Cannot reduce enemy base intelligence below 1. Silencer also does not gain intelligence from heroes that are at 1 intelligence. The status buff, however, increases by 2 on every kill or nearby death.","Enemy non-intelligence heroes effectively lose 24 ( 48) mana, 0.1 ( 0.2) mana regen and 0.14% ( 0.28%) spell damage. Enemy intelligence heroes effectively lose 24 ( 48) mana, 0.1 ( 0.2) mana regen, 0.14% ( 0.28%) spell damage, and 2 ( 4) attack damage. Vice versa, effectively increases Silencer's mana, mana regen amplification, spell damage, and attack damage by the same amount per stack."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break."],"cooldown":"0","name":"Intelligence Steal","description":["Steal Radius: 925","Stolen Intelligence: 2 ( 4)"]},{"spell":"Curses the target area, causing enemy heroes to take damage and slowing their movement speed. Anytime affected enemies cast a spell, the duration is increased.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Whenever an affected unit casts a spell, the duration is increased by 5. This effect has no stack limit.","Fully ignores toggle abilities, active attack modifiers and the abilities listed here.","If an affected unit gets silenced, the duration and the damage are paused until the silence expires. However, the slow is not paused while silenced and still slows affected enemies.","Successive casts of Arcane Curse fully stack, always placing an independent debuff.","Deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 6 (+5 per penalty) instances.","Can deal up to 96\/144\/192\/240 (+80\/120\/160\/200 per penalty) ( 276\/324\/372\/420, +230\/270\/310\/350 per penalty) damage to a single unit (before reductions).","The sound effect played on every damage instance is only audible to the affected unit's player."],"mana":"125\/130\/135\/140","elements":["Does not pierce spell immunity."],"cooldown":"20\/18\/16\/14","name":"Arcane Curse","description":["Cast Animation: 0.3+0.37","Cast Range: 1000","Radius: 425","Damage per Second: 16\/24\/32\/40 ( 46\/54\/62\/70)","Move Speed Slow: 9%\/12%\/15%\/18%","Base Duration: 6","Penalty Duration: 5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Silencer enchants his glaives with his wisdom, dealing additional damage based on his Intelligence.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Pure"],"notes":["The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","Glaives of Wisdom deal their damage before the attack damage is applied, but still depend on the attack hitting the target.","Checks Silencer's intelligence as the projectile hits. Gaining\/losing intelligence while the projectile is travelling does affect its damage.","When having Aghanim's Scepter, the glaives deal 50%\/90%\/130%\/170% ( 90%\/130%\/170%\/210%) of Silencer's intelligence as damage to silenced targets."],"mana":"15","elements":["Cannot be used by illusions.","Can be disjointed.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"0","name":"Glaives of Wisdom","description":["Cast Range: 600 ( 725)","Intelligence as Damage: 25%\/45%\/65%\/85% ( 45%\/65%\/85%\/105%)","Damage Multiplier Against Silenced: 1 ( 2)"],"hot_key":"W","legacy_key":"W"},{"spell":"Enchants a target, causing them to be damaged and silenced if they cast a spell or if the enchantment timer expires.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["When the target casts a spell during the initial debuff, it gets damaged, then silenced, and then the cast spell goes off. Since the spell counts as cast, the silence does not prevent it from happening. Although the silence happens first, the spell's effects are already queued up. However death does stop the spell, meaning when the damage from Last Word is enough to kill the target, the cast spell does not go off. This also means that damage negating spells like Refraction and spells that provide spell immunity do not block its damage.","Does not trigger on toggle abilities, active attack modifiers and the abilities listed here. Triggers on channeling spells, but waits for the channeling to stop first. Last Word does trigger on Phase Shift. However, it only applies its effects when Phase Shift is canceled by the player prematurely.","When the initial debuff expires, it still damages and silences the target.","The curse first applies the debuffs, then the damage.","Grants shared vision as long as the 4 second initial debuff is on.","The Last Word Disarm debuff, although no longer serving a purpose, is still applied and visible in the HUD."],"mana":"115","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"22\/18\/14\/10","name":"Last Word","description":["Cast Animation: 0.3+0.47","Cast Range: 900","Initial Debuff Duration: 4","Damage: 75\/150\/225\/300","Silence Duration: 3\/4\/5\/6"],"hot_key":"E","legacy_key":"T"},{"spell":"Silencer stops all sound, preventing enemy heroes and units on the map from casting spells.","effects":["Ability No Target","Affects Enemies"],"notes":["The silence affects spell immune, invisible and invulnerable creeps, summons and heroes. Does not affect hidden units.","The sound effect of Global Silence which plays on each enemy's hero has the highest sound priority in the game. This means it heavily tones down other game sounds for enemies, making it basically the only sound they can hear during the silence."],"mana":"300\/450\/600","elements":["Pierces spell immunity."],"cooldown":"130","name":"Global Silence","description":["Cast Animation: 0.3+0.37","Radius: Global","Duration: 4.5\/5.25\/6 ( 6.5\/7.25\/8)"],"hot_key":"R","legacy_key":"E"}],"bio":"Part of the seventh and final generation of a carefully designed pedigree, Nortrom was bred by the ancient order of the Aeol Drias to be the greatest magic user the world had ever seen. He was the prophesied one, the culmination of two-hundred years of careful pairings, a war-mage who would bring glory to the order, and destruction to their sworn enemies, The Knights of the Fold. Raised with other young mages in a hidden cantonment among the hills of the Hazhadal barrens, the order's preceptors waited for Nortrom’s abilities to manifest. While the other students honed their talents with fire, or ice, or incantatory spells, Nortrom sat silent and talentless, unable to cast so much as a hex. As the day of final testing approached, he still hadn’t found his magic. In disgust, the preceptors berated him, while the children laughed. “You are no mage,” the head of the order declared. Still, Nortrom did not slink away. He entered the day of testing and faced down the young mages who had mocked him. And then his preceptors learned a valuable lesson: a lack of magic can be the greatest magic of all. Nortrom silenced the young mages one by one and defeated them in single combat, until he alone stood as champion of the Aeol Drias, in fulfillment of the prophecy.","talentsTips":["The attack range talent also affects the cast range of Glaives of Wisdom.","The armor talent does not benefit illusions.","Gold granted from the talent is unreliable gold."],"trivia":["Unlike most heroes, Silencer's attack projectiles actually use the model of his equipped cosmetic weapon.","Like Death Prophet, Omniknight and Io, Silencer received a color palette change, changing his model and icons, having his former red armor replaced with violet. Before his palette change, newer players would occasionally mistake Silencer for Dragon Knight, and he would sometimes be referred to as \"The other Dragon Knight\". Even after the palette swap, some older players may refer to him as \"Purple Dragon Knight\".","Silencer's spell sound effects are based on some of his voice lines. Arcane Curse debuff sounds is based on \" Curse you!\", Last Word is based on one of his laughing lines and Global Silence is based on this.","Chen is a member of the Knights of the Fold which would make him an enemy to Silencer based on Silencer's background. Despite this, there is no dialogue between the two heroes."],"talents":["+2s Global Silence:+20% Glaives of Wisdom Damage","+30 Arcane Curse Damage:+125 Attack Range","+2 Intelligence Steal:+120 Gold\/Min","+25 Attack Speed:+6 Armor"],"desc":"Nortrom, the Silencer, is a ranged intelligence hero who can be played as a support, carry, or initiator. He is one of the few intelligence heroes that truly benefit from intelligence items and is effective against heroes that rely mostly on spells, as he can silence them while stealing their intelligence and adding it to his own. He is a notorious anti-caster hero who can disrupt the magical abilities of his enemies and cripple spellcasters throughout the game. Arcane Curse slows and causes enemies to lose health for a set duration, but increases with each spell the enemy casts, forcing them to either wait and cast no spell until it expires, or cast spells and prolong the debuff and thus take more damage. Last Word places a curse on Nortrom's target that damages and silences for a long duration if the target casts a spell. If the target does not cast a spell before the curse duration ends the effects are the same. Glaives of Wisdom is an active attack modifier that deals a percentage of Nortrom's intelligence as pure damage. Nortrom's ultimate, Global Silence, silences all enemy units on the map for a few seconds. A well-timed Global Silence can be used to save yourself or an ally, initiate a teamfight, or ruin the enemy's initiation."}