{"abilities":[{"spell":"Герой навсегда крадёт 2 единицы интеллекта (4 с талантом) у любого вражеского героя, который умирает в радиусе 925.","effects":["Способность Пассивная","Действует на Вражеских героев \/ Себя"],"notes":["Это врожденная способность, её не нужно изучать. Она связана с Silencer, а не с его заклинаниями.","Украденный интеллект напрямую забирается из базового интеллекта врага и добавляется к базовому интеллекту Silencer.","Крадет только базовый интеллект и интеллект, получаемый за уровни. Бонусный интеллект украсть нельзя.","Неважно, как именно умрет вражеский герой в пределах радиуса, Silencer всегда получает его интеллект.","Также Silencer всегда получает интеллект, если он нанесет урон, повлекший смерть вражеского героя, независимо от расстояния. Но при этом для получения заряда Silencer должен быть жив на момент смерти цели.","Не может украсть интеллект у иллюзий или клонов героя. Когда Silencer убивает клона Meepo, он получает интеллект, поскольку убийство клона Meepo также убивает главного Meepo.","Не может довести базовый показатель вражеский интеллекта ниже 1. Также Silencer не получает интеллект от героев, у которых показатель интеллекта уже равен 1.","Изучение таланта не пересчитывает уже полученные заряды.","Вражеские герои, чей основной атрибут не интеллект, теряют по 24 ( 48) маны, 0.1 ( 0.2) регенерации маны и 0.14% ( 0.28%) урона заклинаний. Вражеские герои с основным атрибутом интеллект теряют по 24 ( 48) маны, 0.1 ( 0.2) регенерации маны, 0.14% ( 0.28%) урона заклинаний и 2 ( 4) урона от атаки. И наоборот, мана, усиление регенерации маны, урон заклинаний и урон от атаки Silencer увеличиваются на те же значения."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением."],"cooldown":"0","name":"Intelligence Steal","description":["Радиус кражи: 925","Кража интеллекта: 2 ( 4)"]},{"spell":"Проклинает вражеских героев в выбранной области, нанося им периодический урон и замедляя их скорость передвижения. Каждая применённая жертвой способность увеличивает длительность эффекта.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Всякий раз, когда существо под действием способности использует заклинание, длительность увеличивается на 5 секунды. У данного эффекта нет лимита на число зарядов.","Игнорирует переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице.","Если существо под действием способности получило безмолвие, длительность и урон от неё приостанавливается, пока эффект не закончится. При этом замедление не перестает действовать при безмолвии.","Несколько применений складываются, всегда накладывая отдельные дебаффы.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 6 (+5 за примененную способность) раз.","Наносит до 96\/144\/192\/240 (+80\/120\/160\/200 за примененную способность) ( 276\/324\/372\/420, +230\/270\/310\/350 за примененную способность) урона одному существу (до уменьшений).","Звуковой эффект, проигрывающийся за каждое нанесение урона способностью ,слышен только игроку, чье существо находится под действием дебаффа."],"mana":"125\/130\/135\/140","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Arcane Curse","description":["Анимация применения: 0,3+0,37","Дальность применения: 1000","Радиус: 425","Урон в секунду: 16\/24\/32\/40 ( 46\/54\/62\/70)","Замедление скорости передвижения: 9%\/12%\/15%\/18% ( 21%\/24%\/27%\/30%)","Начальная длительность: 6","Добавочная длительность: 5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Герой наполняет глефы своей мудростью, отчего они наносят дополнительный урон, зависящий от интеллекта владельца, и временно крадут интеллект цели с каждой атакой.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Чистый"],"notes":["Дополнительный урон наносится отдельным источником и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.","Урон Glaives of Wisdom наносится до урона от атаки, но его нанесение всё еще зависит от попадания атаки по цели.","Проверяет показатель интеллекта Silencer как только снаряд поражает цель. Увеличение\/потеря интеллекта в момент, пока снаряд летит, влияет на его урон. Крадет интеллект до нанесения урона и, соответственно, увеличивает урон Glaives of Wisdom.","Также уменьшает текущую ману цели на 12 за украденный интеллект вместо сохранения текущего соотношения. В среднем убирает 12\/12\/24\/36 текущей маны у цели. Мана возвращается при завершении дебаффа.","Silencer, в отличии от целей, сохраняет соотношение текущей маны при получении и потере интеллекта.","Не может довести показатель вражеского интеллекта до отрицательных значений, но Silencer всегда получает интеллект за атаки.","В среднем цель теряет 12\/12\/24\/36 маны, 0,05\/0,05\/0,1\/0,15 регенерации здоровья и 0,07%\/0,07%\/0,14%\/0,21% урона заклинаний (и 1\/1\/2\/3 урона, если главный атрибут цели — интеллект). И наоборот, мана, её регенерация, урон заклинаний и урон от атаки Silencer увеличиваются на те же значения.","Каждая атака накладывает модификатор баффа\/дебаффа как на цель, так и на Silencer. То есть их длительность не связана друг с другом.","Модификаторы-счетчики на цели и Silencer показывают количество потерянного\/полученного интеллекта. Интеллект умершего героя возвращается к обычному значению, а оставшегося сохраняет изменение на длительность дебаффа.","Не крадет интеллект у иллюзий или клонов Meepo. Крадет у Tempest Double."],"mana":"15","elements":["Не может использоваться иллюзиями.","Можно избежать.","Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Glaives of Wisdom","description":["Дальность применения: 600 ( 725)","Интеллекта в урон: 15%\/35%\/55%\/75% ( 35%\/55%\/75%\/95%)","Кража интеллекта: 1\/1\/2\/3","Длительность кражи: 10\/20\/30\/40"],"hot_key":"W","legacy_key":"W"},{"spell":"Зачаровывает цель, отчего она через некоторое время получит урон и будет обезмолвлена. Также даёт обзор по цели. Чары сработают раньше, если жертва применит способность. Наносит дополнительный урон, зависящий от разницы в интеллекте с целью.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Врагов","Урон Магический"],"notes":["Когда цель использует заклинание во время действия первоначального дебаффа, она получает урон, затем — безмолвие, а уже затем применяет своё заклинание. Поскольку способность считается примененной, безмолвие не мешает его применению. Хотя безмолвие срабатывает первым, эффект заклинания уже стоит в очереди. При этом смерть цели может остановить заклинание; в случае, если урона от Last Word будет достаточно для убийства цели, оно не сработает. Также заклинания, отрицающие урон (например, Refraction) и заклинания, дающие иммунитет к заклинаниям не блокируют этот урон.","Не реагирует на переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице. Реагирует на произносимые заклинания, но сначала ждет окончания произнесения. Last Word срабатывает на Phase Shift, но применяет безмолвие только в случае ручной отмены Phase Shift.","Когда базовый дебафф истечет, он нанесет урон и обезмолвит цель.","Если у цели нет интеллекта, она получит только базовый урон.","Last Word сначала применяет дебаффы, затем наносит урон.","Дает общий обзор на все 4 секунд действия базового дебаффа.","Aghanim's Scepter превращает способность в направленное на область заклинание и больше не требующее цели для применения."],"mana":"115","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"22\/18\/14\/10","name":"Last Word","description":["Анимация применения: 0,3+0,47","Дальность применения: 900","Радиус: 0 ( 600)","Базовый урон: 80\/120\/160\/200","Множитель разницы в интеллекте: 1,5\/2\/2,5\/3","Базовая длительность дебаффа: 4","Длительность безмолвия: 3\/4\/5\/6"],"hot_key":"E","legacy_key":"T"},{"spell":"Герой заглушает все звуки на поле боя, не давая врагам применять способности.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Безмолвие действует на невосприимчивых к магии, невидимых и неуязвимых крипов, призванных существ и героев. Не действует на спрятанных существ.","Звуковой эффект от Global Silence, который проигрывается каждому вражескому герою, имеет высочайший приоритет среди всех звуков в игре. То есть способность сильно заглушает остальные игровые звуки для врагов, делая его практически единственным звуком, который они будут слышать на протяжении длительности безмолвия."],"mana":"300\/450\/600","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"130","name":"Global Silence","description":["Анимация применения: 0,3+0,37","Радиус: Глобальный","Длительность: 4.5\/5.25\/6 ( 6,5\/7,25\/8)"],"hot_key":"R","legacy_key":"E"}],"bio":"Часть седьмого и последнего поколения тщательно спланированной селекции, Нортром выведен древним орденом Эол Драйас, дабы стать величайшим из магов, что видел свет. Он был тем, о ком гласило пророчество: кульминацией двухсот лет осторожного скрещивания, магом-бойцом, что принёс бы славу ордену и погибель заклятым врагам его, рыцарям Покрова. Он рос вместе с другими молодыми магами в военном городке, сокрытом среди холмов Хажадальских пустошей, и наставники ждали, когда способности Нортрома проявят себя. Остальные ученики уже оттачивали мастерство обращения с огнём, льдом или чарами, а Нортром оставался молчаливым и бездарным, неспособным даже наложить сглаз. День финальных испытаний близился, но он так и не нашёл своего призвания. С отвращением наставники ругали его, а дети осмеивали. «Ты не маг», — провозгласил глава ордена. И всё же Нортром не отступил. Он явился в день экзамена и дерзко предстал перед молодыми магами, что насмехались над ним. И тогда его наставники получили ценный урок: отсутствие магии может быть лучшим из всех её видов. Юные маги не могли произнести ни слова, а Нортром одерживал победу в одном поединке за другим, покуда не остался на поле сражения один. Пророчество было исполнено. Именно он — величайший маг ордена Эол Драйас.","talentsTips":["Талант на дальность атаки также действует на дальность применения Glaives of Wisdom.","Талант на броню не дается иллюзиям."],"trivia":["Silencer, вместе с Death Prophet и Io, имели раньше костюмы и иконки умений другой цветовой гаммы. Изменения Silencer связаны вероятно с тем, чтобы отличаться от Dragon Knight, которой имел схожую окраску героя.","Silencer имеет самый большой прирост Ловкости среди героев, основной характеристикой которых не является Ловкость.","Silencer и Magnus - два героя, имеющие репутацию среди героев доты. Silencer всегда становится объектом насмешек, в то время как Magnus - уважаемый воин."],"talents":["+2 сек. к длительности Global Silence:+20% к урону от Glaives of Wisdom","+30 к урону от Arcane Curse:+125 к дальности атаки","+2 к краже интеллекта от Intelligence Steal:+12% к замедлению от Arcane Curse","+25 к скорости атаки:+6 к броне"],"desc":"Silencer — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Данный герой является единственным героем, который при убийстве врага ворует его интеллект. Воровство интеллекта является неотъемлемой частью героя. Arcane Curse заставляет вражеского героя терять единицы здоровья на протяжении достаточно короткого времени, однако оно увеличивается с каждой использованной способностью и приостанавливается при получении целью безмолвия. Last Word проклинает врага, нанося урон и обезмолвивает всякий раз, когда противник использует способность. Если он не использовал ни одного умения, то по истечении проклятья он получит урон, безмолвие и будет замедлен. Glaives of Wisdom наносит дополнительный чистый урон прямо-пропорционально количеству интеллекта Silencer. Особое умение героя, Global Silence, позволяет обезмолвливать всех вражеских юнитов на несколько секунд. Его точное применение может быть использовано, чтобы спасти кого-то из своей команды, начать битву или сорвать наступление врага. Улучшается с Aghanim's Scepter."}