{"abilities":[{"spell":"Silencer навсегда крадет 2 единицы интеллекта у любого вражеского героя, который умирает в радиусе.","effects":["Способность Пассивная","Действует на Вражеских героев \/ Себя"],"notes":["Это врожденная способность, её не нужно изучать. Она не связана не с какой-либо способностью, а с самим Silencer.","Украденный интеллект напрямую забирается из базового интеллекта врага и добавляется к базовому интеллекту Silencer.","Может украсть только базовый интеллект и интеллект, получаемый за уровни. Бонусный интеллект нельзя украсть способностью.","Неважно, каким образом в радиусе кражи вражеский герой умрет, Silencer всегда получит его интеллект.","Silencer всегда получает интеллект, если он нанесет урон, повлекший к смерти вражеского героя, независимо от расстояния. Но при этом Silencer должен быть жив на момент смерти цели, чтобы украсть интеллект.","Не может украсть интеллект у иллюзий или клонов героя. Когда Silencer убивает клона Meepo, он получает интеллект, поскольку убийство клона Meepo также убивает главного Meepo.","Не может снизить базовый вражеский показатель интеллекта ниже 1. Silencer также не получает интеллект от героев, у которых показатель интеллекта уже равен 1. При этом счётчик на панели баффов всё равно увеличится на 2 за каждое убийство или смерть рядом с ним.","Вражеские герои, чей основной атрибут не интеллект, теряют по 24 ( 48) маны, 0.1 ( 0.2) регенерации маны и 0.14% ( 0.28%) урона заклинаний. Вражеские герои с основным атрибутом интеллект теряют по 24 ( 48) маны, 0.1 ( 0.2) регенерации маны, 0.14% ( 0.28%) урона заклинаний и 2 ( 4) урона от атаки. И наоборот, мана, усиление регенерации маны, урон заклинаний и урон от атаки Silencer увеличиваются на те же значения."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением."],"cooldown":"0","name":"Intelligence Steal","description":["Радиус кражи: 925","Кража интеллекта: 2 ( 4)"]},{"spell":"Проклинает вражеских героев в выбранной области, нанося им периодический урон и замедляя их скорость передвижения. Каждая примененная жертвой способность увеличивает длительность эффекта.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Всякий раз, когда юнит под действием способности использует заклинания, длительность увеличивается на 5 секунды. У данного эффекта нет лимита на количество зарядов.","Полностью игнорирует переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице.","Если юнит под действием способности получил безмолвие, длительность и урон от неё приостанавливается, пока безмолвие не закончится. При этом замедление не перестает работать при безмолвии.","Несколько применений полностью складываются, всегда накладывая отдельный дебафф.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 6 (+5 за примененную способность) раз.","Может нанести до 96\/144\/192\/240 (+80\/120\/160\/200 за примененную способность) ( 276\/324\/372\/420, +230\/270\/310\/350 за примененную способность) урона в одиночного юнита (до учета сопротивления).","Звуковой эффект проигрывается за каждое нанесение урона способностью и слышен только игроку с юнитом под действием дебаффа."],"mana":"125\/130\/135\/140","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Arcane Curse","description":["Анимация применения: 0,3+0,37","Дальность применения: 1000","Радиус: 425","Урон в секунду: 16\/24\/32\/40 ( 46\/54\/62\/70)","Замедление скорости передвижения: 9%\/12%\/15%\/18%","Базовая длительность: 6","Увеличение длительности: 5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Герой наполняет глефы своей мудростью, отчего они наносят дополнительный урон, зависящий от интеллекта владельца.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Чистый"],"notes":["Glaives of Wisdom наносят урон как отдельный источник урона, поэтому на них не действует ни один эффект от модификатора атаки.","Glaives of Wisdom наносят свой урон до применения урона от атаки, но продолжают зависеть от попадания атаки по цели.","Проверяет показатель интеллекта Silencer как только снаряд поражает цель. Увеличение\/потеря интеллекта в момент, пока снаряд летит, влияет на его урон.","Если у героя есть Aghanim's Scepter, то глефы наносят 50%\/90%\/130%\/170% ( 90%\/130%\/170%\/210%) от интеллекта Silencer в качестве урона по повторно обезмолвленных целей."],"mana":"15","elements":["Не может использоваться иллюзиями.","Можно избежать.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Glaives of Wisdom","description":["Дальность применения: 600 ( 725)","Интеллекта в урон: 25%\/45%\/65%\/85% ( 45%\/65%\/85%\/105%)","Интеллекта в урон против обезмолвленных: 1 ( 2)"],"hot_key":"W","legacy_key":"W"},{"spell":"Насылает на цель проклятие, которое через некоторое время наносит ей урон и накладывает на неё безмолвие. Проклятие сработает раньше, если жертва применит способность.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Когда цель использует заклинание во время действия первоначального дебаффа, она получает урон, затем обезмолвивается, а уже затем заклинание выпускается. Поскольку способность уже считается примененной, безмолвие не мешает его применению. Хоть и безмолвие происходит первым, эффект заклинания уже стоит в очереди. При этом смерть цели может остановить заклинание; в случае, если урона от Last Word будет достаточно для убийства цели, заклинание не произнесется. Это также означает, что способности, отрицающие урон (например, Refraction) и способности, дающие иммунитет к заклинаниям не блокируют этот урон.","Не реагирует на переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице. Реагирует на произносимые способности, но сначала ждет окончания произнесения. Last Word срабатывает на Phase Shift, но применяет безмолвие только в случае ручной отмены Phase Shift. Когда используется Recall при наличии дебаффа, дебафф замораживается и и не срабатывает, пока не используют другую способность.","Когда базовый дебафф истечет, он нанесет урон и обезмолвит цель.","Дает общий обзор на все 4 секунды действия базового дебаффа.","Модификатор Last Word Disarm может больше не работать на цель, но остается примененным и видимым в статус-баре."],"mana":"115","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"22\/18\/14\/10","name":"Last Word","description":["Анимация применения: 0,3+0,47","Дальность применения: 900","Базовая длительность дебаффа: 4","Урон: 75\/150\/225\/300","Длительность безмолвия: 3\/4\/5\/6"],"hot_key":"E","legacy_key":"T"},{"spell":"Silencer заглушает все звуки, не давая всем врагам на всей карте использовать заклинания.","effects":["Способность Ненаправленная","Действует на Врагов"],"notes":["Безмолвие действует на невосприимчивых к магии, невидимых и неуязвимых крипов, призванных существ и героев. Не действует на спрятанных юнитов.","Звуковой эффект от Global Silence, который проигрывается каждому вражескому герою, имеет высочайший приоритет среди всех звуков в игре. То есть способность сильно заглушает остальные игровые звуки для врагов, делая его практически единственным звуком, который они будут слышать на протяжении длительности безмолвия."],"mana":"300\/450\/600","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"130","name":"Global Silence","description":["Анимация применения: 0,3+0,37","Дальность: Глобальная","Длительность: 4.5\/5.25\/6 ( 6.5\/7.25\/8)"],"hot_key":"R","legacy_key":"E"}],"bio":"Часть седьмого и последнего поколения тщательно спланированной селекции, Нортром выведен древним орденом Эол Драйас, дабы стать величайшим из магов, что видел свет. Он был тем, о ком гласило пророчество: кульминацией двухсот лет осторожного скрещивания, магом-бойцом, что принёс бы славу ордену и погибель заклятым врагам его, рыцарям Покрова. Он рос вместе с другими молодыми магами в военном городке, сокрытом среди холмов Хажадальских пустошей, и наставники ждали, когда способности Нортрома проявят себя. Остальные ученики уже оттачивали мастерство обращения с огнём, льдом или чарами, а Нортром оставался молчаливым и бездарным, неспособным даже наложить сглаз. День финальных испытаний близился, но он так и не нашёл своего призвания. С отвращением наставники ругали его, а дети осмеивали. «Ты не маг», — провозгласил глава ордена. И всё же Нортром не отступил. Он явился в день экзамена и дерзко предстал перед молодыми магами, что насмехались над ним. И тогда его наставники получили ценный урок: отсутствие магии может быть лучшим из всех её видов. Юные маги не могли произнести ни слова, а Нортром одерживал победу в одном поединке за другим, покуда не остался на поле сражения один. Пророчество было исполнено. Именно он — величайший маг ордена Эол Драйас.","talentsTips":["Талант на дальность атаки также действует на дальность применения Glaives of Wisdom.","Талант на броню не дается иллюзиям.","Золото с таланта является ненадёжным."],"trivia":["Silencer, вместе с Death Prophet и Io, имели раньше костюмы и иконки умений другой цветовой гаммы. Изменения Silencer связаны вероятно с тем, чтобы отличаться от Dragon Knight, которой имел схожую окраску героя.","Silencer имеет самый большой прирост Ловкости среди героев, основной характеристикой которых не является Ловкость.","Silencer и Magnus - два героя, имеющие репутацию среди героев доты. Silencer всегда становится объектом насмешек, в то время как Magnus - уважаемый воин."],"talents":["+2 сек. к длительности Global Silence:+20% к урону от Glaives of Wisdom","+30 к урону от Arcane Curse:+125 к дальности атаки","+2 к краже интеллекта от Intelligence Steal:+120 золота в минуту","+25 к скорости атаки:+6 к броне"],"tips":["Silencer, вместе с Death Prophet и Io, имели раньше костюмы и иконки умений другой цветовой гаммы. Изменения Silencer связаны вероятно с тем, чтобы отличаться от Dragon Knight, которой имел схожую окраску героя.","Silencer имеет самый большой прирост Ловкости среди героев, основной характеристикой которых не является Ловкость.","Silencer и Magnus - два героя, имеющие репутацию среди героев доты. Silencer всегда становится объектом насмешек, в то время как Magnus - уважаемый воин."],"desc":"Silencer — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Данный герой является единственным героем, который при убийстве врага ворует его интеллект. Воровство интеллекта является неотъемлемой частью героя. Arcane Curse заставляет вражеского героя терять единицы здоровья на протяжении достаточно короткого времени, однако оно увеличивается с каждой использованной способностью и приостанавливается при получении целью безмолвия. Last Word проклинает врага, нанося урон и обезмолвивает всякий раз, когда противник использует способность. Если он не использовал ни одного умения, то по истечении проклятья он получит урон, безмолвие и будет замедлен. Glaives of Wisdom наносит дополнительный чистый урон прямо-пропорционально количеству интеллекта Silencer. Особое умение героя, Global Silence, позволяет обезмолвливать всех вражеских юнитов на несколько секунд. Его точное применение может быть использовано, чтобы спасти кого-то из своей команды, начать битву или сорвать наступление врага. Улучшается с Aghanim's Scepter."}