{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "При использовании прерывает произносимые способности у союзников и врагов.",
        "Может быть применено на любое союзное, вражеское или нейтральное существо, включая Рошана и крипов-героев.",
        "С помощью Shadows можно избежать атаки дальнего боя, но нельзя избегать снаряды способностей.",
        "Во время действия Shadows, существо нельзя выбрать целью для атаки или направленного на цель заклинания. Любые атаки или заклинания, направленные на существо в момент анимации атаки или применения, будут отменены.",
        "Любые атаки или заклинания, направленные на существо в момент анимации атаки или применения, будут отменены.",
        "Во время действия Shadows на существо действует сквозное передвижение, позволяя ему проходить сквозь других юнитов."
      ],
      "mana": null,
      "abilityName": "Shadows",
      "cooldown": "15",
      "description": "Целью может быть союзник, враг или сам владелец. Выбранное существо 3 секунды нельзя выбрать целью, оно не может применять способности, использовать предметы или атаковать. Применяет нормальное развеивание.",
      "params": [
        "Может быть применено на себя, если владелец имеет иммунитет к заклинаниям. Можно применить на союзника с невосприимчивостью к заклинаниям, но способность на него не подействует и уйдёт на перезарядку, не дав никакого эффекта. Нельзя применить на невосприимчивого к заклинаниям противнике."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "нейтральных крипов",
  "name": "Book of Shadows",
  "description": "Невозможный фолиант, полный нечитаемых рассказов, рождённых из непостижимых мыслей.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+12 к силе",
    "+12 к ловкости",
    "+12 к интеллекту",
    "+400 к ночному обзору"
  ],
  "tips": null
}