{"cost":"4100","description":"Cost 4100 Bought From Artifacts","trivia":["v • d • e Items Basics Consumables Town Portal Scroll Clarity Faerie Fire Smoke of Deceit Observer Ward Sentry Ward Enchanted Mango Healing Salve Tango Tome of Knowledge Dust of Appearance Animal Courier Bottle Attributes Iron Branch Gauntlets of Strength Slippers of Agility Mantle of Intelligence Circlet Belt of Strength Band of Elvenskin Robe of the Magi Crown Ogre Axe Blade of Alacrity Staff of Wizardry Armaments Ring of Protection Stout Shield Quelling Blade Infused Raindrop Orb of Venom Blight Stone Blades of Attack Chainmail Quarterstaff Helm of Iron Will Javelin Broadsword Claymore Mithril Hammer Arcane Magic Stick Wind Lace Ring of Regen Sage's Mask Boots of Speed Gloves of Haste Cloak Ring of Tarrasque Ring of Health Void Stone Gem of True Sight Morbid Mask Shadow Amulet Ghost Scepter Blink Dagger Upgrades Common Magic Wand Null Talisman Wraith Band Bracer Soul Ring Power Treads Phase Boots Oblivion Staff Perseverance Mask of Madness Helm of the Dominator Hand of Midas Boots of Travel Moon Shard Support Ring of Basilius Headdress Buckler Urn of Shadows Tranquil Boots Medallion of Courage Arcane Boots Drum of Endurance Vladmir's Offering Mekansm Holy Locket Spirit Vessel Pipe of Insight Guardian Greaves Caster Glimmer Cape Veil of Discord Force Staff Aether Lens Necronomicon Dagon Eul's Scepter of Divinity Rod of Atos Solar Crest Orchid Malevolence Aghanim's Scepter Nullifier Refresher Orb Scythe of Vyse Octarine Core Armor Hood of Defiance Vanguard Blade Mail Soul Booster Aeon Disk Crimson Guard Lotus Orb Black King Bar Hurricane Pike Shiva's Guard Manta Style Bloodstone Linken's Sphere Heart of Tarrasque Assault Cuirass Weapons Crystalys Armlet of Mordiggian Meteor Hammer Shadow Blade Skull Basher Monkey King Bar Battle Fury Ethereal Blade Radiance Daedalus Butterfly Silver Edge Divine Rapier Abyssal Blade Bloodthorn Artifacts Dragon Lance Sange Yasha Kaya Echo Sabre Maelstrom Diffusal Blade Heaven's Halberd Desolator Kaya and Sange Sange and Yasha Yasha and Kaya Satanic Eye of Skadi Mjollnir Others Secret Shop Bottle Ring of Health Void Stone Energy Booster Vitality Booster Point Booster Platemail Talisman of Evasion Hyperstone Ultimate Orb Demon Edge Mystic Staff Reaver Eaglesong Sacred Relic Drop Only Aegis of the Immortal Cheese Refresher Shard Hidden Items Observer and Sentry Wards Tango (Shared) Power Treads (Strength) Power Treads (Agility) Power Treads (Intelligence) Boots of Travel 1 Boots of Travel 2 Dagon 1 Dagon 2 Dagon 3 Dagon 4 Dagon 5 Necronomicon 1 Necronomicon 2 Necronomicon 3 Removed Items (Dota 2) Banana Flying Courier Iron Talon Poor Man's Shield Ring of Aquila Removed Items (DotA) Leather Tunic Shedd's Cleaver The Leveller Upgrader Arcane Ring"],"further":["Kaya","Yasha"],"tips":["The mana loss reduction does not only work for mana cost of spells, it affects any form of mana loss not caused by losing intelligence."],"attrs":["Bonus +16 Agility +16 Intelligence +16 Attack speed +12% Spell damage +16% Mana loss reduction +30 Movement speed","Disassemble? Yes","Alert allies? No"],"info":["For strength heroes, it grants 2.56 armor, 32 attack speed, 0.8% movement speed, 192 mana, 0.8 mana regen and 13.12% spell damage.","For agility heroes, it grants 2.56 armor, 32 attack speed, 0.8% movement speed, 192 mana, 0.8 mana regen, 13.12% spell damage and 16 attack damage.","For intelligence heroes, it grants 2.56 armor, 32 attack speed, 0.8% movement speed, 192 mana, 0.8 mana regen, 13.12% spell damage and 16 attack damage.","Mana loss reduction and spell damage amplification from multiple Kaya-based items ( Kaya, Kaya and Sange, Yasha and Kaya) do not stack.","Stacks additively with other sources of mana loss reduction.","Movement speed bonuses from multiple Yasha-based items ( Yasha, Sange and Yasha, Yasha and Kaya, Manta Style) do not stack."]}