{
  "abilities": [
    {
      "notes": [
        "The all \/ \/ stats talent effectively grants Luna 160 health, 0.8 health regeneration, 1.33 armor, 8 attack speed, 96 mana, 0.4 mana regeneration, and 8 attack damage.",
        "The lifesteal talent stacks additively with other sources of lifesteal."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+0.2s Eclipse Lucent Ministun",
          "talentRight": "30% Lifesteal"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 Lucent Beam Damage",
          "talentRight": "+8 All Stats"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25 Movement Speed",
          "talentRight": "-3.5s Lucent Beam Cooldown"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+350 Cast Range",
          "talentRight": "+15 Attack Speed"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Luna_Lucent_Beam_1.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Ability Target Unit (TagAghanim Target Point)",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Lucent Beam first applies the damage, then the debuff.",
        "With Aghanim's Shard, Lucent Beam can either be cast on a unit or on the ground. When targeting the ground, does not require any vision or True Sight. It can hit invisible and fogged enemies. Only searches for heroes (including illusions, clones and Creep-heroes) within the search area. Other units are ignored. This means if there are no heroes within the search area, targeting ground wastes the ability. The speed buff is only applied when it actually hits an enemy. Hitting the ground does not grant the buff. Provides 300 radius ground vision at the targeted point for 3 seconds when cast on the ground.",
        "When targeting the ground, does not require any vision or True Sight. It can hit invisible and fogged enemies.",
        "Only searches for heroes (including illusions, clones and Creep-heroes) within the search area. Other units are ignored.",
        "This means if there are no heroes within the search area, targeting ground wastes the ability.",
        "The speed buff is only applied when it actually hits an enemy. Hitting the ground does not grant the buff.",
        "Provides 300 radius ground vision at the targeted point for 3 seconds when cast on the ground.",
        "Luna's glaive emits some particles during the cast time, visible to everyone."
      ],
      "mana": "90\/100\/110\/120",
      "hotKey": "Q",
      "cooldown": "6 (TagTalent 2.5)",
      "description": "Calls a beam of lunar energy down upon an enemy, damaging and briefly stunning them.",
      "spellName": "Lucent Beam",
      "params": [
        "Cast Animation: 0.4+0.47",
        "Cast Range: 800 (TagTalent 1150)",
        "Damage: 75\/150\/225\/300 (TagTalent 175\/250\/325\/400)",
        "Stun Duration: 0.8 (TagTalent 1.2)",
        "Hero Search Radius: 325",
        "Move Speed Bonus: 30%",
        "Speed Duration: 3",
        "Allows Lucent Beam to be ground targeted with a 325 target search radius. Also increases stun duration to 1.2 seconds and grants Luna +30% bonus movement speed for 3 seconds.",
        "Blocked even when upgraded."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Selemene smites those who encroach upon the Nightsilver Woods."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3c\/Luna_Moon_Glaives.mp3\/revision\/latest?cb=20191216015815",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "The bouncing glaives travel at a speed of 900 (the same speed as her attack projectile).",
        "Does not perform instant attacks. The projectile is entirely spell-based. This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them. Their damage counts as spell damage, however, they ignore outgoing spell damage amplification and cannot spell lifesteal.",
        "This means they do not trigger any attack modifier or on-hit effects, and ignore evasion. However, damage block affects them.",
        "Their damage counts as spell damage, however, they ignore outgoing spell damage amplification and cannot spell lifesteal.",
        "The glaives deal damage based on the damage amount calculated for the leading attack. Attack damage amount is calculated upon attack begin. This means it works with Critical Strike and Quell, since these are included in the initial damage calculations. This also means that it does not matter how much damage the attack actually did to the target, since that part is being calculated on projectile hit. It also means that other conditional attack damage bonuses like a Javelin proc are not included, since these happen later as well.",
        "This means it works with Critical Strike and Quell, since these are included in the initial damage calculations.",
        "This also means that it does not matter how much damage the attack actually did to the target, since that part is being calculated on projectile hit.",
        "It also means that other conditional attack damage bonuses like a Javelin proc are not included, since these happen later as well.",
        "Effectively increases Luna's attack damage by 87.5%\/114.76%\/148.21%\/191.49% if all bounces hit.",
        "Can bounce back to the same units if it already hit all other nearby units. If no other units are nearby, the ability does nothing. Cannot bounce on enemies in the Fog of War.",
        "Does not bounce towards wards and allies, but it does bounce off of them when attacking them. Fully works against buildings.",
        "Upon learning, Luna's glaive permanently emits blue particles, visible to everyone."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Empowers Luna's glaives, causing her attacks to bounce between enemy units. Deals less damage with each bounce.",
      "spellName": "Moon Glaives",
      "params": [
        "Search Radius: 500",
        "Number of Bounces: 3\/4\/5\/6",
        "Damage Reduction per Bounce: 50%\/44%\/38%\/32%",
        "When disjointed, the disjointing unit is not registered as hit, meaning the glaive can immediately bounce on it again if within range. A disjointed bounce still counts towards the max bounces."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "Carefully sharpened, Luna's boomerang-like weapon cuts a wide swath through enemy numbers."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies"
      ],
      "notes": [
        "Upon learning, Luna emits very faint pulsing particles around her.",
        "Increases Luna's night vision to a total of 1050\/1300\/1550\/1800.",
        "The aura's buff lingers for 0.5 seconds.",
        "Affects invulnerable, but not hidden units.",
        "Despite the in-game description, Lunar Blessing affects all allied units, not only ranged heroes."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Increases the attack damage for Luna and nearby allied ranged player units. Luna is also blessed with increased vision range at night.",
      "spellName": "Lunar Blessing",
      "params": [
        "Radius: 1200",
        "Attack Damage Bonus: 5\/15\/25\/35",
        "Night Vision Bonus: 250\/500\/750\/1000",
        "Aura Linger Duration: 0.5"
      ],
      "itemBehaviour": [],
      "legacyKey": "L",
      "story": "The Goddess of the Moon smiles upon her kin."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5d\/Luna_Eclipse_1.mp3\/revision\/latest?cb=20191216015818",
      "effects": [
        "Ability No Target (TagAghanim Target Unit \/ Target Area)",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Beams deal damage based on Luna's current level of Lucent Beam, so if not learned, Eclipse deals no damage. In Ability Draft, Lucent Beam must be drafted as well for Eclipse's beam to deal damage.",
        "In Ability Draft, Lucent Beam must be drafted as well for Eclipse's beam to deal damage.",
        "Eclipse turns day into night for 10 seconds. This is independent from the Eclipse duration. Does not interfere with the night caused by Dark Ascension in any way, meaning Night Stalker's night is not paused. Has a lower priority than the daytime caused by Supernova.",
        "Does not interfere with the night caused by Dark Ascension in any way, meaning Night Stalker's night is not paused.",
        "Has a lower priority than the daytime caused by Supernova.",
        "Does not hit invisible units and units in the Fog of War.",
        "When Luna dies, Eclipse stops. However, the 10 second night still continues. When upgraded and cast on the ground, it still ends when Luna dies. When upgraded and cast on an ally, it stops when the ally dies.",
        "When upgraded and cast on the ground, it still ends when Luna dies.",
        "When upgraded and cast on an ally, it stops when the ally dies.",
        "Luna's glaive emits some particles during the cast time, visible to everyone.",
        "Multiple casts (both with and without Aghanim's Scepter) work fully independently from each other.",
        "Maximum possible damage to a single target (before reductions): Lucent Beam Level 1: 375 (TagTalent 875) (TagTalent 450\/900\/1350, 1050\/2100\/3150) Lucent Beam Level 2: 750 (TagTalent 1250) (TagTalent 900\/1800\/2700, 1500\/3000\/4500) Lucent Beam Level 3: 1125 (TagTalent 1625) (TagTalent 1350\/2700\/4050, 1950\/3900\/5850) Lucent Beam Level 4: 1500 (TagTalent 2000) (TagTalent 1800\/3600\/5400, 2400\/4800\/7200)",
        "Lucent Beam Level 1: 375 (TagTalent 875) (TagTalent 450\/900\/1350, 1050\/2100\/3150)",
        "Lucent Beam Level 2: 750 (TagTalent 1250) (TagTalent 900\/1800\/2700, 1500\/3000\/4500)",
        "Lucent Beam Level 3: 1125 (TagTalent 1625) (TagTalent 1350\/2700\/4050, 1950\/3900\/5850)",
        "Lucent Beam Level 4: 1500 (TagTalent 2000) (TagTalent 1800\/3600\/5400, 2400\/4800\/7200)",
        "With Aghanim's Scepter, double-clicking the ability targets self. Can target any allied units, except for wards and buildings. Provides 675 radius ground vision for its duration when not targeting a unit.",
        "Can target any allied units, except for wards and buildings.",
        "Provides 675 radius ground vision for its duration when not targeting a unit.",
        "When choosing the level 25 talent, each beam also stuns hit enemies for 0.2 seconds. Unlike the damage, the stun is applied regardless of Lucent Beam's level, since it is not based on Lucent Beam's stun. The talent immediately takes effect, causing the already active casts to stun as well. The beams first apply their damage, then the debuff.",
        "Unlike the damage, the stun is applied regardless of Lucent Beam's level, since it is not based on Lucent Beam's stun.",
        "The talent immediately takes effect, causing the already active casts to stun as well.",
        "The beams first apply their damage, then the debuff."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "140",
      "description": "Showers random nearby enemies with strikes from Luna's current level of Lucent Beam. These beams do not stun their targets, and there is a maximum number of times that a single target can be struck. Also turns day into night for 10 seconds.",
      "spellName": "Eclipse",
      "params": [
        "Cast Animation: 0.6+0.2",
        "Search Radius: 675",
        "Number of Beams: 6\/9\/12 (TagAghanim 6\/12\/18)",
        "Max Beams per Unit: 5 (TagAghanim 6\/12\/18)",
        "Beam Interval: 0.6 (TagAghanim 0.3)",
        "Eclipse Duration: 2.4\/4.2\/6 (TagAghanim 1.5\/3.3\/5.1)",
        "Stun Duration per Beam: 0.2",
        "Cast Range: 2500 (TagAghanim 2850)",
        "Allows Luna to cast Eclipse on an allied unit or herself and have its effects follow them, or cast it on an area. Also increases total beams and duration, removes the limit on beams per unit, and makes the beams appear twice as fast."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "In times of great need, Selemene herself descends into the world, blocking out the light and hope of the opposed."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 3.4,
    "attrAgility": 24.0
  },
  "description": "Luna, the Moon Rider, is a ranged agility carry hero. Even though she can be seen as a tempting target for enemy heroes, Luna possesses solid early game laning presence due to her Lucent Beams, a cheap, low-cooldown nuke, and her Lunar Blessing aura, which grants all nearby allied heroes an increase in their attack damage. Mid-game, she becomes far more formidable with Moon Glaives, allowing her to kill entire creep waves with two to three attacks, and Eclipse, which can very quickly kill a hero if that hero is unfortunate enough to catch its full blast. Her Achilles' Heel is her fragility; she has no escape abilities and cannot handle a lot of punishment, relying on her movement speed to keep her out of harm's way. Luna begins and ends a match dangerously, and if played carefully and skillfully, she will destroy anybody who stands against her.",
  "history": "How had she been reduced to this? She was once the Scourge of the Plains, a merciless leader of men and beasts, and able to sow terror wherever she dared. Now she was far from her homeland, driven half mad from starvation and months of wandering, her army long dead or worse. As she stood at the edge of an ancient forest, a pair of glowing eyes spied on from an elder branch. Something beautiful and deadly sought a meal in the wilting dusk. Without a sound, it turned and left. Fury overtook her. Clutching a rust-eaten dagger, she charged after the beast determined to reclaim even a shred of her past glory, but her quarry would not be caught. Three times she cornered the creature among the rocks and trees, and three times she pounced only to witness its fading shadow darting further into the woods. Yet the full moon shone brightly, and the creature's trail was easy to follow. Arriving in a clearing atop a high hill, the beast's massive feline form sat in the open, attentive and waiting. When the woman brandished her dagger, the creature reared and roared and charged. Death, it seemed, had come for her at long last in this strange place. She stood, calm and ready. A flash of movement, and the beast snatched the dagger from her hand before vanishing into the forest. Stillness. Hooded figures approached. In reverent tones they revealed that Selemene, Goddess of the Moon, had chosen her, had guided her, had tested her. Unwittingly she had endured the sacred rites of the Dark Moon, warriors of the Nightsilver Woods. She was offered a choice: join the Dark Moon and pledge herself to the service of Selemene, or leave and never return. She did not hesitate. Embracing her absolution, she renounced her bloody past, and took up a new mantle as Luna of the Dark Moon, the dreaded Moon Rider, ruthless and ever-loyal guardian of the Nightsilver Woods.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+0.2s Eclipse Lucent Ministun",
      "talentRight": "30% Lifesteal"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 Lucent Beam Damage",
      "talentRight": "+8 All Stats"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25 Movement Speed",
      "talentRight": "-3.5s Lucent Beam Cooldown"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+350 Cast Range",
      "talentRight": "+15 Attack Speed"
    }
  ]
}