{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+14 Max Thirst MS",
          "talentRight": "-4s Blood Rite Cooldown"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+400 Health",
          "talentRight": "+475 Rupture Cast Range"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+85 Blood Rite Damage",
          "talentRight": "+10% Rupture Initial Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8% Bloodrage Spell Amplification",
          "talentRight": "+30 Bloodrage Attack Speed"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Bloodseeker_Bloodrage.mp3\/revision\/latest?cb=20191216011308",
      "effects": [
        "Ability Target Unit",
        "Affects Allied Heroes",
        "Damage Pure (TagAghanimHP Removal)"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self.",
        "Deals 1% of max health as damage in 0.5-second intervals, starting 0.5 seconds after cast, resulting in 16 instances. The damage is flagged as HP Removal, so it does not trigger any on-damage effects. Does not drain health while invulnerable. Health drain cannot bring the target's health below 1.",
        "The damage is flagged as HP Removal, so it does not trigger any on-damage effects.",
        "Does not drain health while invulnerable. Health drain cannot bring the target's health below 1.",
        "Applies generic outgoing damage amplification on the target. Stacks additively with other sources of generic outgoing damage manipulation. The amplification affects only spell damage the target deals that is not flagged as HP removal. Attack damage is not amplified.",
        "The amplification affects only spell damage the target deals that is not flagged as HP removal. Attack damage is not amplified.",
        "Successive casts with different levels on a same target only refresh the duration, but do not update the attack speed or the amplification.",
        "With Aghanim's Shard, Bloodseeker's attacks deals pure damage based on the target's maximum health. The damage is directly added to Bloodseeker's attack damage, however, it is ignored by percentage-based damage bonus or reductions. The damage cannot crit, cleave, or lifesteal with other sources of lifesteal than its own. Bloodrage's lifesteal is affected by lifesteal manipulation. Bloodrage's own outgoing damage amplification does not affect the shard's percentage-based pure damage. Does not work against Roshan.",
        "The damage is directly added to Bloodseeker's attack damage, however, it is ignored by percentage-based damage bonus or reductions.",
        "The damage cannot crit, cleave, or lifesteal with other sources of lifesteal than its own.",
        "Bloodrage's lifesteal is affected by lifesteal manipulation.",
        "Bloodrage's own outgoing damage amplification does not affect the shard's percentage-based pure damage.",
        "Does not work against Roshan."
      ],
      "mana": "25",
      "item_behaviour": [],
      "name": "Bloodrage",
      "cooldown": "14\/12\/10\/8",
      "description": "Drives you into a bloodthirsty rage during which causes you to attack faster and deal more spell damage at the cost of a percentage of your health per second. Provides half attack speed to allied heroes.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0.4",
        "Cast Range: 800",
        "Max Health as Cost per Second: 2%",
        "Self Attack Speed Bonus: 60\/90\/120\/150 (TagTalent 90\/120\/150\/180)",
        "Allied Attack Speed Bonus: 30\/45\/60\/75 (TagTalent 45\/60\/75\/90)",
        "Outgoing Spell Damage Amplification: 15%\/20%\/25%\/30% (TagTalent 23%\/28%\/33%\/38%)",
        "Duration: 8",
        "Enemy Max Health as Damage\/Lifesteal: 2%",
        "Bloodrage attacks now deal 2% of the target's max health as pure damage and heals Bloodseeker for that amount. Only works for Bloodseeker."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Bloodseeker_Blood_Rite_1.mp3\/revision\/latest?cb=20191216011313",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "The affected area is visible to enemies.",
        "Applies a silence within the targeted area after the 2.6-second delay.",
        "Blood Rite first applies the damage, then the debuff.",
        "With level 4 Bloodrage on Bloodseeker, Blood Rite deals 156\/208\/260\/312 (TagTalent 266.5\/318.5\/370.5\/422.5) damage (before reductions). The damage upgrading talent immediately upgrades all of Bloodseeker's currently active Blood Rite casts when chosen during the delay. With the spell damage amplification increasing talent it deals 165.6\/220.8\/276\/331.2 (TagTalent 282.9\/338.1\/393.3\/448.5) damage.",
        "The damage upgrading talent immediately upgrades all of Bloodseeker's currently active Blood Rite casts when chosen during the delay.",
        "With the spell damage amplification increasing talent it deals 165.6\/220.8\/276\/331.2 (TagTalent 282.9\/338.1\/393.3\/448.5) damage.",
        "Grants 600 radius ground vision at the center of the affected area for 6 seconds after cast."
      ],
      "mana": "90\/100\/110\/120",
      "item_behaviour": [],
      "name": "Blood Rite",
      "cooldown": "15\/14\/13\/12 (TagTalent 11\/10\/9\/8)",
      "description": "Bloodseeker baptizes an area in sacred blood. After 2.9 seconds the ritual completes, causing any enemies caught in the area to take damage and become silenced.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.63",
        "Cast Range: 1500",
        "Effect Radius: 600",
        "Effect Delay: 2.6",
        "Damage: 120\/160\/200\/240 (TagTalent 205\/245\/285\/325)",
        "Silence Duration: 3\/4\/5\/6",
        "Silence persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "legacy_key": "B",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self \/ Enemies"
      ],
      "notes": [
        "Learning Thirst unlocks maximum movement speed and removes the 550 movement speed cap for Bloodseeker.",
        "When an enemy hero drops below 25% health, Thirst exposes the target and provides True Sight over them. When enemies are revealed by Thirst, a debuff and particle effects are placed on them, which is visible to everyone. Bloodseeker himself also gets a status buff and particle effects and speaks certain lines, making it clear that an enemy is currently being revealed by Thirst.",
        "When enemies are revealed by Thirst, a debuff and particle effects are placed on them, which is visible to everyone.",
        "Bloodseeker himself also gets a status buff and particle effects and speaks certain lines, making it clear that an enemy is currently being revealed by Thirst.",
        "Thirst is not triggered by enemy illusions, but is triggered by hero clones. It is not triggered by hidden enemy heroes, but does react on invulnerable ones.",
        "It is not triggered by hidden enemy heroes, but does react on invulnerable ones.",
        "The first stack is applied when an enemy hero is below 80% health and the last when below 26%.",
        "Grants 0.25%\/0.44%\/0.62%\/0.8% (TagTalent 0.51%\/0.69%\/0.87%\/1.05%) movement speed for each percent of missing health between 80% and 25%. However, since the HUD does not show decimals, movement speed increases by 1% for every missing 3.93%\/2.29%\/1.62%\/1.25% (TagTalent 1.96%\/1.45%\/1.15%\/0.95%) health.",
        "However, since the HUD does not show decimals, movement speed increases by 1% for every missing 3.93%\/2.29%\/1.62%\/1.25% (TagTalent 1.96%\/1.45%\/1.15%\/0.95%) health.",
        "The bonuses linger for 4 seconds if the enemy dies. However, it does not linger, and disappears immediately if the enemy has Reincarnation. The bonuses are always the maximum values, regardless of the health percentage the enemy had right before the killing blow.",
        "The bonuses are always the maximum values, regardless of the health percentage the enemy had right before the killing blow.",
        "This is how much movement speed Bloodseeker gains from Thirst with a certain amount of heroes being below 25% of their maximum health: 2 Heroes: 28%\/48%\/68%\/88% (TagTalent 56%\/76%\/96%\/116%) movement speed. 3 Heroes: 42%\/72%\/102%\/132% (TagTalent 84%\/114%\/144%\/174%) movement speed. 4 Heroes: 56%\/96%\/136%\/176% (TagTalent 112%\/152%\/192%\/232%) movement speed. 5 Heroes: 70%\/120%\/170%\/220% (TagTalent 140%\/190%\/240%\/290%) movement speed.",
        "2 Heroes: 28%\/48%\/68%\/88% (TagTalent 56%\/76%\/96%\/116%) movement speed.",
        "3 Heroes: 42%\/72%\/102%\/132% (TagTalent 84%\/114%\/144%\/174%) movement speed.",
        "4 Heroes: 56%\/96%\/136%\/176% (TagTalent 112%\/152%\/192%\/232%) movement speed.",
        "5 Heroes: 70%\/120%\/170%\/220% (TagTalent 140%\/190%\/240%\/290%) movement speed.",
        "",
        "The heal is based on the dying unit's maximum health, and not on Bloodseeker's health.",
        "Heals from any unit killed by Bloodseeker, and from any hero that dies within 300 radius of Bloodseeker, including allied heroes. Does not heal upon killing illusions, Tempest Doubles, Roshan, wards, or buildings. Denying allied non-hero units heals for 5.5%\/7%\/8.5%\/10% of their max health. Denying allied heroes still heal for the full value.",
        "Does not heal upon killing illusions, Tempest Doubles, Roshan, wards, or buildings.",
        "Denying allied non-hero units heals for 5.5%\/7%\/8.5%\/10% of their max health. Denying allied heroes still heal for the full value."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Thirst",
      "cooldown": null,
      "description": "Bloodseeker is invigorated by the wounds of his enemies, restoring some life when he kills a unit. Restores for half values when denying, or if an ally kills a nearby enemy hero. Also gains bonus movement speed when an enemy hero's health falls below 80%, with the bonuses increasing as their health falls further. If an enemy hero's health falls below 25%, he will also gain vision and True Sight of that hero. Bonuses stack per hero. Unlocks max movement speed for Bloodseeker.",
      "hot_key": "E",
      "params": [
        "Detection Radius: Global",
        "Enemy Hero Death Heal Radius: 300",
        "Thirst Health Threshold: 80%",
        "Visibility Health Threshold: 25%",
        "Max Move Speed Bonus per Hero: 14%\/24%\/34%\/44% (TagTalent 28%\/38%\/48%\/58%)",
        "Hero Max Health as Heal: 10%\/15%\/20%\/25%",
        "Non-Hero Max Health as Heal: 11%\/14%\/17%\/20%",
        "Speed Linger Duration: 4",
        "Completely ignores spell immune enemies.",
        "Disables the detection, movement speed bonus, and the movement speed limit removal, but not the heal on kill or nearby death.",
        "Heal and speed limit removal work for illusions, movement speed bonus and detection do not."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c6\/Bloodseeker_Rupture_1.mp3\/revision\/latest?cb=20191216011310",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Checks the distance the affected unit moved every 0.25 seconds, starting immediately upon cast, resulting in 41\/45\/49 checks. If the unit's position changed between checks, it takes damage based on the distance. If the unit did not move, or moved a distance greater than 1300 between a check, no damage is applied. If the unit is invulnerable as a check occurs, the value is set nil, so that it does not take damage on the next check, regardless of distance.",
        "If the unit's position changed between checks, it takes damage based on the distance.",
        "If the unit did not move, or moved a distance greater than 1300 between a check, no damage is applied.",
        "If the unit is invulnerable as a check occurs, the value is set nil, so that it does not take damage on the next check, regardless of distance.",
        "The initial damage is dealt upon placing the buff, but not again upon refreshing it.",
        "This is how much damage Rupture deals (before reductions) when the affected unit travels certain distances: 300 Distance: 99\/132\/165 damage. 600 Distance: 198\/264\/330 damage. 900 Distance: 297\/396\/495 damage. 1200 Distance: 396\/528\/660 damage. 1500 Distance: 495\/660\/825 damage.",
        "300 Distance: 99\/132\/165 damage.",
        "600 Distance: 198\/264\/330 damage.",
        "900 Distance: 297\/396\/495 damage.",
        "1200 Distance: 396\/528\/660 damage.",
        "1500 Distance: 495\/660\/825 damage.",
        "",
        "With level 4 Bloodrage on Bloodseeker, Rupture deals 13% (TagTalent 26%) current health as damage to the target. With the spell damage amplification increasing talent it deals 13.8% (TagTalent 27.6%) current health as damage. This is how much damage it deals for certain distances traveled with level 4 Bloodrage (and with the spell damage amplification increasing talent). 300 Distance: 128.7\/171.6\/214.5 (TagTalent 136.62\/182.16\/227.7) damage. 600 Distance: 257.4\/343.2\/429 (TagTalent 273.24\/364.32\/455.4) damage. 900 Distance: 386.1\/514.8\/643.5 (TagTalent 409.86\/546.48\/683.1) damage. 1200 Distance: 514.8\/686.4\/858 (TagTalent 546.48\/728.64\/910.8) damage. 1500 Distance: 643.5\/858\/1072.5 (TagTalent 683.1\/910.8\/1138.5) damage.",
        "With the spell damage amplification increasing talent it deals 13.8% (TagTalent 27.6%) current health as damage.",
        "This is how much damage it deals for certain distances traveled with level 4 Bloodrage (and with the spell damage amplification increasing talent). 300 Distance: 128.7\/171.6\/214.5 (TagTalent 136.62\/182.16\/227.7) damage. 600 Distance: 257.4\/343.2\/429 (TagTalent 273.24\/364.32\/455.4) damage. 900 Distance: 386.1\/514.8\/643.5 (TagTalent 409.86\/546.48\/683.1) damage. 1200 Distance: 514.8\/686.4\/858 (TagTalent 546.48\/728.64\/910.8) damage. 1500 Distance: 643.5\/858\/1072.5 (TagTalent 683.1\/910.8\/1138.5) damage.",
        "300 Distance: 128.7\/171.6\/214.5 (TagTalent 136.62\/182.16\/227.7) damage.",
        "600 Distance: 257.4\/343.2\/429 (TagTalent 273.24\/364.32\/455.4) damage.",
        "900 Distance: 386.1\/514.8\/643.5 (TagTalent 409.86\/546.48\/683.1) damage.",
        "1200 Distance: 514.8\/686.4\/858 (TagTalent 546.48\/728.64\/910.8) damage.",
        "1500 Distance: 643.5\/858\/1072.5 (TagTalent 683.1\/910.8\/1138.5) damage.",
        "",
        "Multiple casts on the same target do not stack, but refresh the duration instead.",
        "Despite the sounds, affected units take no damage with vertical movement (e.g. Torrent or Impale).",
        "Can be cast on, but cannot damage Couriers.",
        "With Aghanim's Scepter, Rupture goes on a 0.25-second cooldown when cast, this is to prevent accidental double-casts on the same target. Acquiring Aghanim's Scepter instantly grants 1 extra charge. This only happens once, so re-acquiring it does not grant another charge.",
        "Acquiring Aghanim's Scepter instantly grants 1 extra charge. This only happens once, so re-acquiring it does not grant another charge."
      ],
      "mana": "100\/150\/200",
      "item_behaviour": [],
      "name": "Rupture",
      "cooldown": "70 (TagTalent 0.25)",
      "description": "Causes an enemy unit's skin to rupture, dealing initial damage based on its current health. If the unit moves, it takes damage based on the distance moved. The damage is dealt through spell immunity.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.4+0.53",
        "Cast Range: 800 (TagTalent 1275)",
        "Initial Current Health as Damage: 10% (TagTalent 20%)",
        "Moved Distance as Damage: 33%\/44%\/55%",
        "Duration: 10\/11\/12",
        "Number of Charges: 2",
        "Charge Replenish Time: 40",
        "Grants Bloodseeker two charges of Rupture and reduces Rupture's Cooldown to 40s"
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.7,
    "attrStrength": 24.0,
    "attrIntelligence": 17.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.1,
    "attrAgility": 22.0
  },
  "description": "Strygwyr, the Bloodseeker, is a melee agility hero imbued with dreadful powers to fuel violence and rip enemies apart in the heat of close combat.",
  "history": "Strygwyr the Bloodseeker is a ritually sanctioned hunter, Hound of the Flayed Twins, sent down from the mist-shrouded peaks of Xhacatocatl in search of blood. The Flayed Ones require oceanic amounts of blood to keep them sated and placated, and would soon drain their mountain empire of its populace if the priests of the high plateaus did not appease them. Strygwyr therefore goes out in search of carnage. The vital energy of any blood he lets, flows immediately to the Twins through the sacred markings on his weapons and armor. Over the years, he has come to embody the energy of a vicious hound; in battle he is savage as a jackal. Beneath the Mask of the Bloodseeker, in the rush of bloody quenching, it is said that you can sometime see the features of the Flayers taking direct possession of their Hound.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+14 Max Thirst MS",
      "talentRight": "-4s Blood Rite Cooldown"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+400 Health",
      "talentRight": "+475 Rupture Cast Range"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+85 Blood Rite Damage",
      "talentRight": "+10% Rupture Initial Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8% Bloodrage Spell Amplification",
      "talentRight": "+30 Bloodrage Attack Speed"
    }
  ]
}