{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+240 Crystal Nova Damage",
          "talentRight": "+1.25s Frostbite Duration"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+50 Freezing Field Damage",
          "talentRight": "+200 Attack Speed"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-3s Crystal Nova Cooldown",
          "talentRight": "+6% Magic Resistance Arcane Aura"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+125 Crystal Nova AoE",
          "talentRight": "+200 Health"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Crystal_Maiden_Crystal_Nova.mp3\/revision\/latest?cb=20191216012225",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Provides 900 radius ground vision at the target area for 6 seconds.",
        "Crystal Nova first applies the damage, then the debuff.",
        "Plays a sound effect during the cast time which is audible to everyone."
      ],
      "mana": "130\/145\/160\/175",
      "hotKey": "Q",
      "cooldown": "11\/10\/9\/8 (TagTalent 8\/7\/6\/5)",
      "description": "A burst of damaging frost slows enemy movement and attack rate in the targeted area.",
      "spellName": "Crystal Nova",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range: 700",
        "Effect Radius: 425 (TagTalent 550)",
        "Damage: 130\/170\/210\/260 (TagTalent 370\/410\/450\/500)",
        "Move Speed Slow: 20%\/30%\/40%\/50%",
        "Attack Speed Slow: 20\/30\/40\/50",
        "Slow Duration: 4.5",
        "Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "The air temperature around Rylai drops rapidly, chilling all around her to the core."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "The air temperature around Rylai drops rapidly, chilling all around her to the core."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Crystal_Maiden_Frostbite.mp3\/revision\/latest?cb=20191216012227",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Despite the visual effects, Frostbite applies its effects immediately and cannot be disjointed.",
        "Roots and disarms the target, preventing it from moving, attacking and casting certain mobility spells. Provides True Sight over the target.",
        "Provides True Sight over the target.",
        "Deals 25 damage in 0.25-second intervals, starting 0.25 seconds after cast, resulting in 6\/8\/10\/12 (TagTalent 11\/13\/15\/17) damage instances to heroes and 40 (TagTalent 45) to creeps. Can deal up to 150\/200\/250\/300 (TagTalent 275\/325\/375\/425) damage to heroes and 1000 (TagTalent 1125) damage to creeps (before reductions).",
        "Can deal up to 150\/200\/250\/300 (TagTalent 275\/325\/375\/425) damage to heroes and 1000 (TagTalent 1125) damage to creeps (before reductions).",
        "Treats illusions, creep-heroes, ancient creeps and Roshan as heroes."
      ],
      "mana": "140\/145\/150\/155",
      "hotKey": "W",
      "cooldown": "9\/8\/7\/6",
      "description": "Encases an enemy unit in ice, prohibiting movement and attack, while dealing damage over time. Lasts 10 seconds on creeps level 6 or lower.",
      "spellName": "Frostbite",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range: 550",
        "Damage Interval: 0.25",
        "Damage per Second: 100",
        "Hero Duration: 1.5\/2\/2.5\/3 (TagTalent 2.75\/3.25\/3.75\/4.25)",
        "Creep Duration: 10 (TagTalent 11.25)",
        "Root and disarm persist and attempts to damage if debuff was placed before spell immunity and when not dispelled.",
        "Rylai channels winds from the Blueheart Glacier, imprisoning attackers in thick blocks of ice."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Rylai channels winds from the Blueheart Glacier, imprisoning attackers in thick blocks of ice."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Allies"
      ],
      "notes": [
        "The aura's buff lingers for 0.5 seconds.",
        "Can regenerate up to 30\/60\/90\/120 mana in one minute for allies. Can regenerate up to 90\/180\/270\/360 mana in one minute for Crystal Maiden.",
        "Can regenerate up to 90\/180\/270\/360 mana in one minute for Crystal Maiden.",
        "Does not affect invulnerable units.",
        "With the level 15 talent, Arcane Aura grants bonus magic resistance to her team. Stacks multiplicatively with other sources of magic resistance. The 6% magic resistance is affected by the self bonus factor for Crystal Maiden. Increases most heroes' total magic resistance to 29.5%. Increases Crystal Maiden's total magic resistance to 38.5%.",
        "The 6% magic resistance is affected by the self bonus factor for Crystal Maiden.",
        "Increases most heroes' total magic resistance to 29.5%.",
        "Increases Crystal Maiden's total magic resistance to 38.5%."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Gives additional mana regeneration to all friendly units on the map. This bonus is increased for Crystal Maiden.",
      "spellName": "Arcane Aura",
      "params": [
        "Radius: Global",
        "Mana Regen Bonus: 0.5\/1\/1.5\/2",
        "Self Bonus Factor: 3",
        "Aura Linger Duration: 0.5",
        "Magic Resistance Bonus: 6%",
        "Cold temperatures promote the essence of magic, causing Rylai's presence to allow spell usage in abundance."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Cold temperatures promote the essence of magic, causing Rylai's presence to allow spell usage in abundance."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e2\/Crystal_Maiden_Freezing_Field.mp3\/revision\/latest?cb=20191216012226",
      "effects": [
        "Ability No Target \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The slow is applied to all enemies within the radius in 0.1-second intervals, regardless of the ice explosions.",
        "Every 0.1 seconds an explosion occurs, for a total of 100 explosions.",
        "Each ice explosion can spawn within a random distance of 195 to 785 away from Crystal Maiden. The explosion spawn radius is divided into four 90° segments (0°–90°, 90°–180°, 180°–270°, 270°–360°). The first explosion occurs within the north-east segment of the circle, following explosions proceed counterclockwise.",
        "The explosion spawn radius is divided into four 90° segments (0°–90°, 90°–180°, 180°–270°, 270°–360°).",
        "The first explosion occurs within the north-east segment of the circle, following explosions proceed counterclockwise.",
        "With the max spawn radius and explosion radius, it can damage units up to 1085 range away.",
        "The average damage is roughly constant up to a radius of 485, falling off after that. It is slightly less than 50% at a radius of 785. The very center does 5% more damage. Deals about 2000\/3300\/4800 damage to enemies within 485 range over the full duration, ±1.9 explosions.",
        "It is slightly less than 50% at a radius of 785. The very center does 5% more damage.",
        "Deals about 2000\/3300\/4800 damage to enemies within 485 range over the full duration, ±1.9 explosions.",
        "If all explosion could hit a single target, it would deal up to 10500\/17000\/25000 (TagTalent 15500\/22000\/30000) damage (before reductions).",
        "The radius is always centered on Crystal Maiden and follows her even when she is moved.",
        "Despite the visual effects, the damage is dealt as the falling ice shards are spawned, not upon them reaching the ground.",
        "With Aghanim's Scepter, Freezing Field provides an aura which tracks enemies within the area. The tracker lingers for 0.1 seconds. If an enemy unit is affected by the tracker for 1.75 seconds, Frostbite is applied to the enemy unit based on its current level. A unit can only be frostbitten once per cast of Freezing Field. Even if they re-enter the area, they are not affected a second time. If a unit is already frostbitten by a manual cast, it can still be frostbitten again by Freezing Field, refreshing the duration. The tracker resets whenever it is reapplied to a unit. This means a unit must be affected by it for 1.75 seconds continuously in order to be frostbitten. The tracker is placed on enemies even without having Aghanim's Scepter, tracking the duration enemies spend within the area normally. This means if Freezing Field is upgraded while channeling, enemies which have been in the area for more than 1.75 seconds instantly have Frostbite applied to them. The tracker does not affect invulnerable or hidden units. The tracker modifier lingers for 0.1 seconds. In Ability Draft, Frostbite must be drafted as well for this upgrade to work.",
        "If an enemy unit is affected by the tracker for 1.75 seconds, Frostbite is applied to the enemy unit based on its current level.",
        "A unit can only be frostbitten once per cast of Freezing Field. Even if they re-enter the area, they are not affected a second time.",
        "If a unit is already frostbitten by a manual cast, it can still be frostbitten again by Freezing Field, refreshing the duration.",
        "The tracker resets whenever it is reapplied to a unit. This means a unit must be affected by it for 1.75 seconds continuously in order to be frostbitten.",
        "The tracker is placed on enemies even without having Aghanim's Scepter, tracking the duration enemies spend within the area normally.",
        "This means if Freezing Field is upgraded while channeling, enemies which have been in the area for more than 1.75 seconds instantly have Frostbite applied to them.",
        "The tracker does not affect invulnerable or hidden units.",
        "The tracker modifier lingers for 0.1 seconds.",
        "In Ability Draft, Frostbite must be drafted as well for this upgrade to work.",
        "With Aghanim's Shard, Freezing Field no longer requires to be channeled, so that Crystal Maiden can act freely during it. However, her movement speed is heavily slowed. This is a regular slow and can be off-set by movement speed bonuses, including haste. Freezing Field is interrupted if Crystal Maiden gets stunned, silenced, cycloned, feared, hexed or slept during it. It also stops when Crystal Maiden dies, or when she uses the Stop Freezing Field sub-ability.",
        "However, her movement speed is heavily slowed. This is a regular slow and can be off-set by movement speed bonuses, including haste.",
        "Freezing Field is interrupted if Crystal Maiden gets stunned, silenced, cycloned, feared, hexed or slept during it.",
        "It also stops when Crystal Maiden dies, or when she uses the Stop Freezing Field sub-ability."
      ],
      "mana": "200\/400\/600",
      "hotKey": "R",
      "cooldown": "110\/100\/90",
      "description": "Surrounds Crystal Maiden with random icy explosions that slow enemies and deal massive damage. Grants bonus armor while channeling. Lasts 10 seconds.",
      "spellName": "Freezing Field",
      "params": [
        "Cast Animation: 0+0",
        "Max Channel Time: 10 (TagTalent 0)",
        "Slow Radius: 810",
        "Min Explosion Spawn Radius: 195",
        "Max Explosion Spawn Radius: 785",
        "Explosion Damage Radius: 300",
        "Self Armor Bonus: 20",
        "Damage: 105\/170\/250 (TagTalent 155\/220\/300)",
        "Move Speed Slow: 30%",
        "Attack Speed Slow: 60",
        "Slow Duration: 1",
        "Frostbite Timer: 1.75",
        "Self Move Speed Slow: 75%",
        "Duration: 10",
        "Applies Frostbite to any unit that has been standing in the Freezing Field for over a set amount of time.",
        "Grants a new ability: Stop Freezing Field. Allows you to move, cast and attack during Freezing Field. Can still be interrupted by enemies. You move 75% slower during this.",
        "Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "Once the place of her exile, Icewrack has become an anchor for Rylai's frigid onslaught."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Once the place of her exile, Icewrack has become an anchor for Rylai's frigid onslaught."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Requires Aghanim's Shard to be unlocked.",
        "Replaces Freezing Field until the sub-ability is used or the duration ends.",
        "Stop Freezing Field interrupts Crystal Maiden's channeling abilities on cast.",
        "Goes into a 1-second cooldown right after Freezing Field is cast, this is to prevent accidental double-casts prematurely ending the ability."
      ],
      "mana": "0",
      "hotKey": "R",
      "cooldown": "1",
      "description": "Immediately stops the Freezing Field",
      "spellName": "Stop Freezing Field",
      "params": [
        "Cast Animation: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 18.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Rylai, the Crystal Maiden, is a ranged intelligence hero who uses the power of frost and ice to disable and dispatch her foes. A slow and fragile support, Crystal Maiden's strength lies in her battery of strong nukes, disables and slows. Crystal Nova is an area-of-effect nuke that slows enemies' attack and movement speeds, while Frostbite immobilizes an enemy in a block of ice, dealing moderate damage per second. Coordinating these spells with a laning partner's own abilities will bring many an enemy to their knees. Her passive Arcane Aura also improves the mana regeneration for heroes in Rylai's team, multiplying their spellcasting in the early game. Later on, she has the potential to lay waste to her enemies in teamfights if she can channel her deadly ultimate Freezing Field uninterrupted. Her global mana aura, strong disables and nukes, and a lack of item dependence make Crystal Maiden a reliable and, with judicious use of her ultimate, a devastating support caster.",
  "history": "Born in a temperate realm, raised with her fiery older sister Lina, Rylai the Crystal Maiden soon found that her innate elemental affinity to ice created trouble for all those around her. Wellsprings and mountain rivers froze in moments if she stopped to rest nearby; ripening crops were bitten by frost, and fruiting orchards turned to mazes of ice and came crashing down, spoiled. When their exasperated parents packed Lina off to the equator, Rylai found herself banished to the cold northern realm of Icewrack, where she was taken in by an Ice Wizard who had carved himself a hermitage at the crown of the Blueheart Glacier. After long study, the wizard pronounced her ready for solitary practice and left her to take his place, descending into the glacier to hibernate for a thousand years. Her mastery of the Frozen Arts has only deepened since that time, and now her skills are unmatched.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+240 Crystal Nova Damage",
      "talentRight": "+1.25s Frostbite Duration"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+50 Freezing Field Damage",
      "talentRight": "+200 Attack Speed"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-3s Crystal Nova Cooldown",
      "talentRight": "+6% Magic Resistance Arcane Aura"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+125 Crystal Nova AoE",
      "talentRight": "+200 Health"
    }
  ]
}