{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Observer_Ward_Plant.mp3\/revision\/latest?cb=20191227195516",
      "effects": [
        "Cast Range: 500",
        "Vision Radius: 1600",
        "Hero Attacks to Destroy: 2",
        "Non-Hero Attacks to Destroy: 8",
        "Gold Bounty Growth per Minute: 4",
        "Experience Growth per Minute: 6",
        "Duration: 360"
      ],
      "notes": [
        "Provides 1600 radius ground vision at its location.",
        "Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit. Cannot be placed on impassable terrain, or spots obscured by trees.",
        "Cannot be placed on impassable terrain, or spots obscured by trees.",
        "Item is unshareable (Ctrl) with Couriers or with the Spirit Bear.",
        "Neutral creep spawn ranges are shown before placing a ward, allowing camps to be blocked.",
        "The radius of already placed Observer Wards is shown as well, allowing its caster to see how they overlap.",
        "While having the ward selected, multiple indicators appear on the world and minimap. The targeting cursor depicts the ward, with a green circle around it. The circle shows its vision range. The minimap shows a yellow area, depicting the vision range when placed at that point. The yellow markings consider trees and terrain height around the area.",
        "The targeting cursor depicts the ward, with a green circle around it. The circle shows its vision range.",
        "The minimap shows a yellow area, depicting the vision range when placed at that point.",
        "The yellow markings consider trees and terrain height around the area.",
        "The Ward's bounty increases by 1 every 15 seconds, and the experience by 1XP every 10 seconds.",
        "Treat illusions and creep-heroes as creeps."
      ],
      "mana": "0",
      "abilityName": "Plant",
      "cooldown": "1",
      "description": "Plants an Observer Ward, an invisible watcher that gives ground vision in a 1600 radius to your team. Lasts 6 minutes. Hold Control to give one Observer Ward to an allied hero.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Attacking Accuracy: 100%",
        "Melee Attack Range Bonus: 150",
        "Ally Deny Health Threshold: 50"
      ],
      "notes": [
        "The ability and modifier are not displayed in-game.",
        "Attacks against the affected target have absolute accuracy, which prevents its attacks from being missed (i.e. evasion or blind effects). Geminate Attack does not work against Observer Wards.",
        "Geminate Attack does not work against Observer Wards.",
        "Melee units have an extra 150 attack range when attacking Observer Wards.",
        "Observer Wards can always be attacked by their owner, and can only be attacked by other ally heroes if they are within the spawn areas of neutral creeps, regardless of the ward's current health. Observer Wards receive 10 damage from ally heroes when it has over 50 health.",
        "Observer Wards receive 10 damage from ally heroes when it has over 50 health."
      ],
      "mana": null,
      "abilityName": "Planted Ward",
      "cooldown": null,
      "description": "This unit is permanently invisible and phased.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks with itself and with Sentry Wards in a single inventory slot, there is no stack limit. The sell value adapts based on the number of instances in a stack. Wards from multiple players are combined when given by allies.",
    "Wards from multiple players are combined when given by allies.",
    "Observer Wards do not provide True Sight.",
    "Killing an Observer Ward prints out a chat notification to allies."
  ],
  "cost": "0",
  "lore": [
    "Knowing how to craft a ward is an important skill for artificers of magical goods. Rylai showed great talent at crafting wards, and once considered becoming an artificer.",
    "Despite this, the flavor text for this item refers to Observer Wards as plants and states that they are \"often cultivated by apprentice wizards.\" This implies that they are grown as opposed to crafted, directly contradicting the White Sentry's description."
  ],
  "consistFrom": null,
  "name": "Observer Ward",
  "description": "A form of half-sentient plant, often cultivated by apprentice wizards.",
  "trivia": null,
  "upgradeIn": [
    "Observer and Sentry Wards"
  ],
  "tips": [
    "Essential to victory, Observer Wards allow you to keep watch over areas and spy on your enemies while keeping you and other heroes safe. It is important to keep wards up in key locations, and destroy enemy wards.",
    "Observer Wards are considered essential to map control, providing vision for runes, watching out for ganks, and blocking neutral creeps from spawning in the jungle.",
    "Although it is common for the support to purchase wards, mid and offlaners can purchase them to set up ganks or block the enemy team's safe lane jungle camp respectively.",
    "Avoid placing wards on top of destroyed trees. Trees do not grow back if a unit is obstructing their location, so a ward placed on a destroyed tree prevents it from growing. All destroyed trees re-grow together on a set timer, so if a single tree does not re-grow together with the others indicates that something is blocking it, which could be an enemy ward, or any other invisible enemy.",
    "All destroyed trees re-grow together on a set timer, so if a single tree does not re-grow together with the others indicates that something is blocking it, which could be an enemy ward, or any other invisible enemy."
  ]
}