{
  "abilities": [
    {
      "spell": "Рошан блокирует одно направленное заклинание каждые 15 секунд и имеет сопротивление эффектам в 25%.",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Не блокирует заклинания, применяемые союзниками.",
        "Не блокирует Ion Shell, Toss и Snowball.",
        "Не блокирует Urn of Shadows, Spirit Vessel, Medallion of Courage и Solar Crest.",
        "Список блокируемых способностей указан в статье Блокировка заклинаний.",
        "Кроме того, Рошан дополнительно блокирует некоторые ненаправленные способности. Список способностей можно найти здесь."
      ],
      "mana": "0",
      "elements": [
        "Не отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "15",
      "name": "Защита от способностей",
      "description": [
        "Бонусное сопротивление эффектам: 25%"
      ]
    },
    {
      "spell": "Рошан может оглушить при атаке.",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Сработавшая атака сначала применяет дебафф, затем наносит урон.",
        "Дополнительный урон наносится вместе с основной атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "В среднем добавляет по 7.5 единиц урона к каждой атаке.",
        "Наносит урон, но не оглушает варды.",
        "Действует на строения.",
        "Оглушающий удар использует псевдослучайное распределение."
      ],
      "mana": "0",
      "elements": [
        "Отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Оглушающий удар",
      "description": [
        "Шанс: 15%",
        "Дополнительный урон: 50",
        "Длительность оглушения: 1.65"
      ]
    },
    {
      "spell": "Рошан сотрясает землю, нанося урон и замедляя всех врагов поблизости. Урон от способности увеличивается каждую минуту.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Хлопок сначала применяет дебафф, затем наносит урон.",
        "Рошан использует Хлопок, если только рядом с ним 3 или более вражеских юнитов.",
        "При этом, если в его радиусе оказались 3 врагов, то Рошан начнет постоянно использовать способность после атаки по нему независимо от числа врагов (до его следующего возрождения).",
        "Урон увеличивается на каждую минуту с момента первого появления крипов. Первое увеличение произойдет с появлением первой волны крипов.",
        "Сколько урона наносит Хлопок (до уменьшений) в разное время игры: 10 минута: 170 урона 20 минута: 270 урона 30 минута: 370 урона 40 минута: 470 урона 50 минута: 570 урона 60 минута: 670 урона 80 минута: 870 урона 100 минута: 1070 урона"
      ],
      "mana": "0",
      "elements": [
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "10",
      "name": "Хлопок",
      "description": [
        "Анимация применения: 0,47+0,57",
        "Радиус: 350",
        "Начальный урон: 70",
        "Дополнительный урон за минуту: 10",
        "Замедление скорости передвижения: 50%",
        "Замедление скорости атаки: 50",
        "Длительность на героях: 2",
        "Длительность на не-героях: 4"
      ],
      "hot_key": "E",
      "legacy_key": "E"
    },
    {
      "spell": "У Рошана множество защитных способностей: он получает меньше урона от атак иллюзий, имеет сопротивление магии в 55%, а также бонус к броне, увеличивающийся со временем.",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Первый бонус к броне дается при появлении первой волны крипов, затем — каждую минуту.",
        "Броня дается в виде ауры с радиусом в 1 единицу. То есть, она может действовать и на других нейтральных крипов, если они будут находится достаточно близко к Рошану.",
        "Бафф ауры задерживается на 0,5 секунды.",
        "Сквозное состояние дается юниту с момента появления.",
        "Все другие бонусы даются каждую минуту после первой волны крипов.",
        "Бонусы не пропадают после смерти и продолжают увеличиваться когда он мертв.",
        "Атаки иллюзий наносят на 80% урона Рошану. Если они могут использовать способности, то урон от заклинаний будет полным.",
        "Дополнительная скорость атаки позволяет Рошану атаковать ровно раз в секунду."
      ],
      "mana": "0",
      "elements": [
        "Не отключается истощением.",
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Strength of the Immortal",
      "description": [
        "Интервал в минутах: 1",
        "Бонусная броня за интервал: 0.325",
        "Бонусное макс. здоровье за интервал: 115",
        "Бонусный урон от атаки за интервал: 4",
        "Прирост опыта за убийство за интервал: 20",
        "Бонусная скорость атаки: 100",
        "Уменьшение урона от иллюзий: 80%"
      ]
    }
  ],
  "trivia": [
    "Рошан был назван в честь шара для боулинга Guinsoo.",
    "According to the Are We Heroes Yet? comic, Roshan killed a Shopkeeper, thus claiming the Aegis of the Immortal, and being cursed to have his treasure stolen from him again and again..... and again..."
  ],
  "desc": "Рошан, он же Бессмертный Рошан, — самый сильный нейтральный монстр в Dota 2. Он с легкостью одолевает большинство героев один на один. Игроки обычно ждут поздней фазы игры, когда фарм-герои соберут свои лучшие предметы, или пробуют убить его всей командой."
}