{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "80% Magic Resistance for Chaotic Offering Golems",
          "talentRight": "+20 Chaotic Offering Golems Armor"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+25 Shadow Word Damage\/Heal",
          "talentRight": "Summons a Golem on Death"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-5s Shadow Word Cooldown",
          "talentRight": "+10s Upheaval Attack Speed per second on Allies"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+50 Chaotic Offering Golems Movement Speed",
          "talentRight": "+3% Fatal Bonds Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Warlock_Fatal_Bonds_1.mp3\/revision\/latest?cb=20191216030434",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Source Type (TagAghanimNo-reflection)"
      ],
      "notes": [
        "Fatal Bonds has no bounce delay, so all targets are bonded at the same time.",
        "When cast multiple times, it searches and prioritizes enemies which were not debuffed by the previous cast, and then it searches for the next closest units. The debuff can still stack on the same units if no other previously bonded units are nearby. Successive casts of Fatal Bonds fully stack and work independently from each other. Does not affect Roshan at all.",
        "The debuff can still stack on the same units if no other previously bonded units are nearby.",
        "Successive casts of Fatal Bonds fully stack and work independently from each other.",
        "Does not affect Roshan at all.",
        "Can bond units inside the Fog of War, but cannot bond invisible units.",
        "Damage shared is the same type as the source damage. Shares all 3 damage types, but not from HP Removal effects (e.g. Sunder, Soul Ring). Therefore, the shared damage interacts with every on-damage effects (i.e. disabling Blink Dagger). Shared physical damage and magical damage is still affected by damage block and magic resistance respectively. It is also fully affected by outgoing damage manipulation, if the amplification is sourced to Warlock.",
        "Shares all 3 damage types, but not from HP Removal effects (e.g. Sunder, Soul Ring).",
        "Therefore, the shared damage interacts with every on-damage effects (i.e. disabling Blink Dagger).",
        "Shared physical damage and magical damage is still affected by damage block and magic resistance respectively.",
        "It is also fully affected by outgoing damage manipulation, if the amplification is sourced to Warlock.",
        "Fatal Bonds' damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.",
        "Spreads the full damage value before the affected enemy targets actually take the damage. This means that the damage spreads before all manipulations, so that it may only be affected by incoming damage manipulation the affected targets have. This also means it shares overkill damage dealt to the targets. If a damage source exceeded targets' current health and killed them, the damage shared will be the same damage value. The shared damage is always sourced to Warlock.",
        "This means that the damage spreads before all manipulations, so that it may only be affected by incoming damage manipulation the affected targets have.",
        "This also means it shares overkill damage dealt to the targets. If a damage source exceeded targets' current health and killed them, the damage shared will be the same damage value.",
        "The shared damage is always sourced to Warlock.",
        "The distance between the bonded units does not matter. Once bonded, they always spread and\/or receive the spread damage.",
        "Non-player-controlled units are not aggro'd by the damage. Bonded neutral creeps do not react to the damage.",
        "Bonded neutral creeps do not react to the damage.",
        "If a unit dies to the damage done by Fatal Bonds, Warlock gets credited for the kill.",
        "Increases the total damage output of every damage by 60%\/80%\/100%\/120% (TagTalent 75%\/95%\/115%\/135%) when the maximum amount of units is bonded."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "Q",
      "cooldown": "36\/30\/24\/18",
      "description": "Binds several enemy units together, causing a percentage of the damage dealt to one of them to be felt by the others.",
      "spellName": "Fatal Bonds",
      "params": [
        "Cast Animation: 0.2+0",
        "Cast Range: 1000",
        "Bounce Distance: 700",
        "Number of Bounces: 6",
        "Damage Shared: 12%\/16%\/20%\/24% (TagTalent 15%\/19%\/23%\/27%)",
        "Bonds Duration: 25",
        "Cannot be cast on spell immune enemies. Does not bind spell immune enemies. Damages bond enemies if debuff was placed before spell immunity (TagTalentmagical damage gets reduced to 0).",
        "Blocked fully only when primary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5e\/Warlock_Shadow_Word_1.mp3\/revision\/latest?cb=20191216030441",
      "effects": [
        "Ability Target Unit (TagAghanim Target Area)",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "↓↓ Double-tapping automatically targets self.",
        "Can be cast on allied Couriers.",
        "Deals damage or heals in 1-second intervals, starting 1 second after cast, resulting in 10 instances.",
        "Can deal up to 180\/270\/360\/450 (TagTalent 430\/520\/610\/700) damage to the target (before reductions), or heal for the same amount of health if cast on an ally.",
        "Successive casts of Shadow Word fully stack and work independently from each other.",
        "The first sound is played when the target is an ally, the second sound when it is an enemy.",
        "With Aghanim's Shard, Shadow Word turns into an area-targeted ability, so that it cannot directly target units anymore. Can target invisible units and units inside the Fog of War. ↓↓ Double-tapping centers the radius around Warlock.",
        "Can target invisible units and units inside the Fog of War.",
        "↓↓ Double-tapping centers the radius around Warlock."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "W",
      "cooldown": "14 (TagTalent 9)",
      "description": "Warlock whispers an incantation, healing a friendly unit or damaging an enemy unit over time.",
      "spellName": "Shadow Word",
      "params": [
        "Cast Animation: 0.4+0.76",
        "Cast Range: 600\/700\/800\/900",
        "Damage per Second: 18\/27\/36\/45 (TagTalent 43\/52\/61\/70)",
        "Heal per Second: 18\/27\/36\/45 (TagTalent 43\/52\/61\/70)",
        "Duration: 10",
        "Radius: 450",
        "Move Speed Change: 10%",
        "Turns Shadow Word into a 450 AoE Spell. Grants 10% movement speed bonus to allies and slows enemies by .",
        "Can be cast on spell immune allies. Cannot be cast on spell immune enemies. Attempts to damage if debuff was placed before spell immunity and when not dispelled.",
        "Not blocked when upgraded."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Warlock_Upheaval.mp3\/revision\/latest?cb=20191216030444",
      "effects": [
        "Ability Target Area \/ Channeled",
        "Affects Enemies (TagAghanim Allies)"
      ],
      "notes": [
        "The strength of the movement speed slow and the attack speed bonus are based on Warlock's channel duration, not on how long a unit stands in the affected area.",
        "The movement speed slow percentage and the attack speed bonus increases by 0.4%\/0.57%\/0.73%\/0.9% and 0.33 on each server tick respectively, starting 1 tick after cast. To reach the maximum values, the movement speed slow takes 3.33\/3.53\/3.64\/3.7 seconds, while the attack speed buff takes 7 seconds. Both debuff and buff values are applied or refreshed in the same intervals. When the attack speed bonus talent is learned while already channeling, it immediately updates the current instance.",
        "To reach the maximum values, the movement speed slow takes 3.33\/3.53\/3.64\/3.7 seconds, while the attack speed buff takes 7 seconds.",
        "Both debuff and buff values are applied or refreshed in the same intervals.",
        "When the attack speed bonus talent is learned while already channeling, it immediately updates the current instance."
      ],
      "mana": "70\/90\/110\/130",
      "hotKey": "E",
      "cooldown": "35",
      "description": "A powerful slowing current that grows stronger as it's channelled. Lasts up to 10\/12\/14\/16 seconds. Enemies are slowed for 3 seconds after leaving the area or the spell ends.",
      "spellName": "Upheaval",
      "params": [
        "Cast Animation: 0.4+0",
        "Cast Range: 1200",
        "Radius: 500\/550\/600\/650",
        "Max Channel Time: 10\/12\/14\/16",
        "Move Speed Slow Increase per Second: 12%\/17%\/22%\/27%",
        "Max Move Speed Slow: 40%\/60%\/80%\/100%",
        "Slow Duration: 3",
        "Allies Attack Speed Bonus Increase per Second: 10",
        "Allies Max Attack Speed Bonus: 70",
        "Attack Speed Duration: 3",
        "Does not affect spell immune enemies. Affects spell immune allies."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/ff\/Warlock_Chaotic_Offering_1.mp3\/revision\/latest?cb=20191216030434",
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "Warlock Golems are always summoned at the center of the targeted area. They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "They are considered as creep-heroes and ancient creeps, making them interact differently with several abilities.",
        "Successive casts of Chaotic Offering do not replace any of the currently active Warlock Golems from a previous cast. Their attack damage, health, and armor values (including the movement speed, magic resistance or armor increasing talents) are only updated upon ability recast, and not immediately upon leveling the ability up (or learning the respective talents).",
        "Their attack damage, health, and armor values (including the movement speed, magic resistance or armor increasing talents) are only updated upon ability recast, and not immediately upon leveling the ability up (or learning the respective talents).",
        "Upon spawning, Warlock Golems destroy all trees within a 600 radius around them.",
        "The visual effects and sounds during the effect delay are visible and audible to everyone. It also plays a sound effect during the cast time, which is audible to everyone as well.",
        "It also plays a sound effect during the cast time, which is audible to everyone as well.",
        "With the level 20 talent, 1 Warlock Golem based on the current level is passively cast automatically and instantly, regardless of mana and cooldown, on Warlock's death location whenever he dies. However, it does not trigger with Reincarnation sources. The golem lasts its full duration, it is not bound to Warlock's death timer and does not disappear when he respawns. Chaotic Offering notes and all of Warlock Golem's talents fully apply. Aghanim's Scepter neither upgrades nor affects the stats of this on-death summoned golem.",
        "However, it does not trigger with Reincarnation sources.",
        "The golem lasts its full duration, it is not bound to Warlock's death timer and does not disappear when he respawns.",
        "Chaotic Offering notes and all of Warlock Golem's talents fully apply.",
        "Aghanim's Scepter neither upgrades nor affects the stats of this on-death summoned golem.",
        "With Aghanim's Scepter, Chaotic Offering summons a second golem 0.2 seconds after the first golem. The second golem applies the area stun and destroys all trees within the radius as well, effectively extending the total stun duration to 1.2 seconds. Aghanim's Scepter only affects manual casts. The on-death Chaotic Offering cast is not upgraded.",
        "The second golem applies the area stun and destroys all trees within the radius as well, effectively extending the total stun duration to 1.2 seconds.",
        "Aghanim's Scepter only affects manual casts. The on-death Chaotic Offering cast is not upgraded."
      ],
      "mana": "250\/375\/500",
      "hotKey": "R",
      "cooldown": "170",
      "description": "Summons a Golem from the depths, stunning enemies for one second. The Golem lives 60 seconds, takes reduced damage from spells, has Permanent Immolation and Flaming Fists on attack.",
      "spellName": "Chaotic Offering",
      "params": [
        "Cast Animation: 0.5+0.7",
        "Cast Range: 1200",
        "Stun Radius: 600",
        "Effect Delay: 0.5",
        "Number of Golems: 1 (TagAghanim 2)",
        "Stun Duration: 1",
        "Golem Duration: 60",
        "Golem Spawn Interval: 0.2",
        "Number of Golems on Death: 1",
        "Calls 2 golems with reduced stats and bounty."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Enemies"
      ],
      "notes": [
        "Neither affects buildings and wards, nor damages ethereal and attack immune units.",
        "The radius is centered around the attacked target. The bonus damage hits the attack target as well.",
        "The bonus damage hits the attack target as well."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Deals extra damage to nearby units when attacking.",
      "spellName": "Flaming Fists",
      "params": [
        "Radius: 300",
        "Damage: 40\/50\/60",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Aura",
        "Affects Enemies"
      ],
      "notes": [
        "Permanent Immolation of multiple Warlock Golems fully stacks with each other.",
        "Permanent Immolation is an aura. Its debuff lingers for 0.5 seconds. Deals damage in 1-second intervals, starting 1 second after the debuff is placed. This results in 59 possible instances, and it can deal up to 1770\/2950\/4130 damage (before reductions) within the area per golem for the entire duration.",
        "Deals damage in 1-second intervals, starting 1 second after the debuff is placed.",
        "This results in 59 possible instances, and it can deal up to 1770\/2950\/4130 damage (before reductions) within the area per golem for the entire duration."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Burns the Golem's nearby enemy units, with damage per second.",
      "spellName": "Permanent Immolation",
      "params": [
        "Radius: 300",
        "Damage per Second: 30\/50\/70",
        "Aura Linger Duration: 0.5",
        "Attempts to damage if debuff was placed before spell immunity and when not dispelled.",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 24.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 1.0,
    "attrAgility": 10.0
  },
  "description": "Demnok Lannik, the Warlock, is a ranged intelligence hero who possesses many powerful teamfight spells capable of inflicting chaos upon the enemy team. Shadow Word is a highly versatile spell, as it allows him to support allies by healing them or harass enemies by dealing damage over time, giving him strong lane presence. Beyond the early game, Warlock can turn any teamfight in his team's favor as his other spells are strong when unleashed against multiple enemies. Fatal Bonds causes all enemies linked together to take bonus damage when one of their number takes damage, magnifying the strength of area-of-effect spells, while Upheaval can allow him to greatly slow any enemies caught in the radius of the spell, making it harder for them to maneuver in fights or escape. His ultimate, Chaotic Offering, summons a Golem after stunning all enemies in a wide area, allowing him to throw them into disarray. While unassuming and weak by himself, Warlock is a dangerous threat in any teamfight as his spells allow him to turn the enemies' numbers against them and sow chaos amongst their ranks.",
  "history": "As Chief Curator and Head of Acquisitions for the Arcane Archives of the Ultimyr Academy, Demnok Lannik was tireless in his pursuit of lost, rare and forbidden tomes. No cursed temple was so foreboding, no cavern path so treacherous, that any concern for his own survival could dissuade him from entering if rumors hinted that some pamphlet of primordial lore might still survive in its depths. However, so often did his investigations trigger the wrath of protector entities, that he finally found it necessary to master the arts of magic. He bent himself to learning sorcery with the same thorough obsessiveness that marked his quest for incunabula, becoming the most powerful Warlock of the Academy in less time than most practitioners required to complete a course of undergraduate work. Almost as an afterthought, he carved a staff of Dreadwood and summoned into it a captive spirit from the Outer Hells. And anticipating the day when he will have recovered every last lost spellbook, he has commenced writing his own Black Grimoire. It will undoubtedly be instructive.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "80% Magic Resistance for Chaotic Offering Golems",
      "talentRight": "+20 Chaotic Offering Golems Armor"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+25 Shadow Word Damage\/Heal",
      "talentRight": "Summons a Golem on Death"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-5s Shadow Word Cooldown",
      "talentRight": "+10s Upheaval Attack Speed per second on Allies"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+50 Chaotic Offering Golems Movement Speed",
      "talentRight": "+3% Fatal Bonds Damage"
    }
  ]
}