{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/87\/Teleport.mp3\/revision\/latest?cb=20141213224822",
      "effects": [
        "Дальность применения: Глобальная",
        "Минимальное расстояние прицеливания на постройку: 70",
        "Максимальное расстояние прицеливания на постройку: 800",
        "Максимальное расстояние прицеливания на аванпост: 250",
        "Время первого произнесения: 3",
        "Время первого произнесения на аванпост: 6",
        "Увеличение времени второго произнесения: 2",
        "Увеличение времени последующих произнесений: 0,5",
        "Радиус проверки недавней телепортации: 1150",
        "Длительность проверки недавней телепортации: 25"
      ],
      "notes": [
        "Двойное нажатие по предмету на расстоянии не менее 1500 единиц от фонтана команды автоматически выберет его целью.",
        "При наведении на землю предмет автоматически выбирает ближайшую доступную цель для телепортации. По умолчанию предмет нацелен только на здания. С Boots of Travel он нацелен на союзных существ, не являющихся героями. С Boots of Travel 2 он нацелен на героев. Не может телепортировать прямо на строения. Вместо этого, предмет выбирает минимальное расстояние до телепорта. При улучшении может телепортировать прямо на союзных героев\/существ.",
        "По умолчанию предмет нацелен только на здания. С Boots of Travel он нацелен на союзных существ, не являющихся героями. С Boots of Travel 2 он нацелен на героев.",
        "Не может телепортировать прямо на строения. Вместо этого, предмет выбирает минимальное расстояние до телепорта. При улучшении может телепортировать прямо на союзных героев\/существ.",
        "Если несколько героев телепортируются в одну точку в течение проверки до недавней телепортации, то длительность произнесения увеличивается за каждого героя. Первое произнесение займёт 3, второе — 5, все последующие будут длиться на 0,5 секунды дольше предыдущего. Телепортация на захваченные аванпосты занимает на 3 секунды больше, чем на другие постройки. Поэтому первая телепортация занимает 6 секунд. Телепортация на фонтан всегда занимает 3 секунды для каждого героя. Каждая постройка имеет собственный радиус проверки. Учитывает только телепортацию в радиусе 0,5 от башен. Телепортация вне радиуса башни не увеличивают длительность произнесения. Учитывает телепортацию только от Town Portal Scroll. Остальные источники телепортации (в том числе Boots of Travel) игнорируются. Телепортация необязательно должна быть успешной. Отменённые телепорты всё равно учитываются и увеличивают длительность произнесения.",
        "Первое произнесение займёт 3, второе — 5, все последующие будут длиться на 0,5 секунды дольше предыдущего.",
        "Телепортация на захваченные аванпосты занимает на 3 секунды больше, чем на другие постройки. Поэтому первая телепортация занимает 6 секунд.",
        "Телепортация на фонтан всегда занимает 3 секунды для каждого героя.",
        "Каждая постройка имеет собственный радиус проверки.",
        "Учитывает только телепортацию в радиусе 0,5 от башен. Телепортация вне радиуса башни не увеличивают длительность произнесения.",
        "Учитывает телепортацию только от Town Portal Scroll. Остальные источники телепортации (в том числе Boots of Travel) игнорируются.",
        "Телепортация необязательно должна быть успешной. Отменённые телепорты всё равно учитываются и увеличивают длительность произнесения.",
        "При наведении точки для телепортации вдали от союзных строений, телепортирует к ближайшей постройке в радиусе 800 от постройки.",
        "Телепортация позволяет избегать снаряды.",
        "Во время произнесения место телепортации помечается визуальным эффектом, использующим цвет игрока, а также проигрывается звук.",
        "Эффект и звук видны и слышны всем. Визуальный эффект также виден при телепортации невидимого врага.",
        "Также отмечает точку на мини-карте для союзников. Отметка того же цвета, что и сам игрок длится столько же, сколько произнесение.",
        "Во время произнесения даёт летающий обзор в радиусе 200 в месте назначения — даже если телепортация была отменена. Обзор задерживается на 1 секунду.",
        "При телепортации на союзных существ, приоритет атакующих вражеских существ на цель будет понижен.",
        "Когда объект телепортации умирает или меняет владельца во время произнесения, телепорт отменяется, тратя время перезарядки и стоимость маны. Телепортация не отменяется, если выбранное строение было разрушено или захвачено до завершения произнесения.",
        "Телепортация не отменяется, если выбранное строение было разрушено или захвачено до завершения произнесения.",
        "Не делит перезарядку с Boots of Travel. При этом телепортация с помощью Boots of Travel не тратит заряд Town Portal Scroll и добавляет к его перезарядке 40\/30 секунд (даже если предмет был готов к применению).",
        "При этом телепортация с помощью Boots of Travel не тратит заряд Town Portal Scroll и добавляет к его перезарядке 40\/30 секунд (даже если предмет был готов к применению)."
      ],
      "mana": "75",
      "abilityName": "Teleport",
      "cooldown": "80",
      "description": "После 3 сек. произнесения заклинания, телепортирует героя к выбранной союзной постройке. При двойном нажатии телепортирует к фонтану своей команды.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [],
  "cost": "100",
  "lore": null,
  "consistFrom": null,
  "name": "Town Portal Scroll",
  "description": "То, что нужно истинному герою.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}