{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Hero Lifesteal: 30%",
        "Creep Lifesteal: 15%"
      ],
      "notes": [
        "Stacks additively with other sources of lifesteal.",
        "Cannot lifesteal off of wards, buildings or allied units."
      ],
      "mana": null,
      "abilityName": "Lifesteal",
      "cooldown": null,
      "description": "Heals the attacker for 30% of attack damage dealt. Lifesteal from creeps is reduced by 50%",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/87\/Satanic_Unholy_Rage.mp3\/revision\/latest?cb=20191227195524",
      "effects": [
        "Hero Lifesteal Bonus: 145%",
        "Creep Lifesteal Bonus: 72.5%",
        "Duration: 6"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities upon cast.",
        "Applies a basic dispel on the user upon cast.",
        "Increases the passive lifesteal granted of each Satanic by 145%, resulting in 175% lifesteal."
      ],
      "mana": "0",
      "abilityName": "Unholy Rage",
      "cooldown": "30",
      "description": "Increases Lifesteal percentage to 175% for 6 seconds. Lifesteal from creeps is reduced by 50%",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "500 health and 2.5 health regeneration.",
    "25 main attack damage to heroes."
  ],
  "cost": "5050",
  "lore": null,
  "consistFrom": [
    "Morbid Mask",
    "Claymore",
    "Reaver"
  ],
  "name": "Satanic",
  "description": "Immense power at the cost of your soul.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Satanic's active ability, Unholy Rage, has quite a short duration. If the enemy has many disables, it is recommended to get a Black King Bar first and use them together, or wait for the main disables to get used first and then join the fight.",
    "Since lifesteal heals for the actual amount of damage dealt, attacking targets with low armor and damage reduction and\/or obtaining high amounts of attack damage can greatly increase the survivability in a fight. With high enough attack damage, one critical strike during Unholy Rage can potentially fully restore the user's health.",
    "Missing an attack does not grant lifesteal. Consider a Monkey King Bar if an opponent has evasion.",
    "Lifesteal is more efficient with defensive items that give Effective Hit Points like Armor, Damage Block, Evasion and Magic Resistance than items that only give HP."
  ]
}