{
  "abilities": [
    {
      "notes": [
        "Втягивание всегда происходит за 0,3\/0,4\/0,5\/0,6 секунды, поэтому не имеет значения, как далеко или близко существа находятся от центра способности, скорость втягивания будет варьироваться",
        "Урон наносится после потери дебаффа, то есть развеивание дебаффа нанесет урон раньше",
        "Существа под действием способности обезврежены на всё время действия стягивания",
        "Может затянуть существ на непроходимую территорию",
        "Действует на невидимых и неуязвимых существ (за исключением Cyclone  Eul's Scepter of Divinity), но не на спрятанных",
        "Не действует на древних крипов и крипов-героев",
        "При использовании Vacuum разрушает деревья на расстоянии 150 в выбранной точке после наложения дебаффа на врагов"
      ],
      "item_behaviour": [],
      "description": "Герой создаёт в выбранной области вакуум, который втягивает в себя врагов и наносит им урон.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Дальность применения: 450\/500\/550\/600",
        "Радиус: 400\/450\/500\/550 ( 500\/550\/600\/650)",
        "Урон: 100\/150\/200\/250",
        "Длительность втягивания: 0,3\/0,4\/0,5\/0,6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Dark_Seer_Vacuum.mp3\/revision\/latest?cb=20191216012246",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "60\/50\/40\/30",
      "aghanim": null,
      "name": "Vacuum",
      "cooldown": "60\/90\/120\/150",
      "legacy_key": "C",
      "story": "Ишь-Кафэль создает центр притяжения в указанном месте."
    },
    {
      "notes": [
        "Щит можно повесить на вражеских и союзных существ; урон наносится только вражеским\n Существо с щитом не получает от него урон\n Действует на невидимых существ, если они подойдут к щиту достаточно близко, но визуальные эффекты работать на них не будут\n Нельзя применить на крипов-героев или  курьеров\n ↓↓ Двойное нажатие автоматически применяет на владельца способности",
        "Несколько применений щита на одно и то же существо не складываются, но обновляют длительность и улучшают урон до текущего уровня способности\n Если два героя из разных команд одновременно применяют щит на одну и ту же цель, то модификатор обновится и начнет наносить урон врагам последнего заклинателя\n При этом статус модификатора не обновляется\n Его состояние (бафф или дебафф) определяется при первом применении и не обновляется при повторном",
        "Наносит 4,5\/7,5\/10,5\/13,5 ( 12\/15\/18\/21) урона с интервалом в 0,15 секунду спустя 0,15 секунды после применения, срабатывая 140\/160\/180\/200 ( 240\/260\/280\/300) раз",
        "Может нанести до 630\/1200\/1890\/2700 ( 1680\/2400\/3240\/4200) единиц урона в одиночную цель (до уменьшений), если цель будет стоять в радиусе урона все время действия\n При улучшении с <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter может нанести до <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter, it can deal up to 1080\/1950\/2940\/4050 ( 2880\/3900\/5040\/6300) урона одной цели (до учёта сопротивления магии, если противник будет под воздействием способности всю её длительность\n Получение увеличивающего урон  таланта немедленно улучшает все действующие щиты Ion Shell",
        "При улучшении с <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter Ion Shell также увеличивает максимальное здоровье союзной цели на 275, сохраняя текущий процент здоровья"
      ],
      "item_behaviour": [],
      "description": "Окружает выбранную цель колючим щитом, наносящим урон всем врагам вокруг.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,7",
        "Дальность применения: 600",
        "Радиус урона: 275 ( 525)",
        "Урон в секунду: 30\/50\/70\/90 ( 80\/100\/120\/140)",
        "Длительность: 21\/24\/27\/30 ( 36\/39\/42\/45)",
        "Увеличение здоровья:  275",
        "Количество зарядов:  2",
        "Время восполнения заряда:  9"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/81\/Dark_Seer_Ion_Shell.mp3\/revision\/latest?cb=20191216012241",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов ",
        "Урон: Магический"
      ],
      "mana": "9 (TagTalent 0)",
      "aghanim": null,
      "name": "Ion Shell",
      "cooldown": "110\/120\/130\/140",
      "legacy_key": "E",
      "story": "Dark Seer создает дыры в «мир за стеной», заставляя призматическую энергию просачиваться наружу."
    },
    {
      "notes": [
        "↓↓ Двойное нажатие автоматически применяет на владельца способности\n Применяет на цель ускорение, поэтому цель нельзя замедлить, пока эффект не спадёт",
        "Также позволяет цели проходить сквозь других существ",
        "Дающий применение по области  Талант превращает Surge в заклинание, применяемое по области 350, поэтому способность больше нельзя применить напрямую на существо\n ↓↓ Двойное нажатие применяет способность вокруг Dark Seer, считая его центром области"
      ],
      "item_behaviour": [],
      "description": "Заряжает дружественное существо энергией, ненадолго увеличивающей скорость передвижения и позволяющей проходить сквозь существ. Цель достигает стандартного максимума скорости, и её невозможно замедлить.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: 600",
        "Скорость: 550",
        "Длительность: 3\/4\/5\/6",
        "Радиус применения:  350"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e0\/Dark_Seer_Surge.mp3\/revision\/latest?cb=20191216012245",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников"
      ],
      "mana": "19\/16\/13\/10",
      "aghanim": null,
      "name": "Surge",
      "cooldown": "35\/40\/45\/50",
      "legacy_key": "R",
      "story": "Однажды Ишь-Кафэль использовал скорость своего разума, чтобы преодолеть лабиринт между стенами."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard для разблокировки",
        "Перезарядка активируется только при успешном попадании по вражескому герою\n При промахе способность не уходит на перезарядку",
        "Урон от этой способности наносится отдельным источником урона, также он считается уроном заклинаний\n Это значит, что на урон от этой способности не будут действовать модификаторы атаки\n Также это значит, что на урон от этой способности будут действовать усиление урона от заклинаний и вампиризм заклинаний",
        "Постоянно проверяет расстояние, преодолённое Dark Seer, и считает урон, расстояние толчка, длительность толчка и длительность оглушения соответственно\n Каждые 10 единиц расстояния урон увеличивается на 3,222, расстояние толчка на 3,333, длительность толчка на 0,011, длительность оглушения на 0,023\n Эффекты телепортации (включая Blink) могут добавить не более 600 единиц к преодоленному расстоянию вне зависимости от реальной дальности телепортации\n Счётчик расстояния никогда не обнуляется, то есть можно ударить противника несколько раз полностью заряженными ударами при помощи сброса перезарядки\n Далее приведён урон, дальность толчка, длительность толчка, длительность оглушения за расстояние, преодолённое за 3 до применения способности (до учёта сопротивления магии): Преодолённое расстояние 0: 10 урона, 50 дальность толчка, 0,1 сек\n длительность толчка, 0,2 сек\n длительность оглушения\n Преодолённое расстояние 180: 68 урона, 110 дальность толчка, 0,305 сек\n длительность толчка, 0,61 сек\n длительность оглушения\n Преодолённое расстояние 360: 126 урона, 170 дальность толчка, 0,51 сек\n длительность толчка, 1,02 сек\n длительность оглушения\n Преодолённое расстояние 540: 184 урона, 230 дальность толчка, 0,715 сек\n длительность толчка, 1,43 сек\n длительность оглушения\n Преодолённое расстояние 720: 242 урона, 290 дальность толчка, 0,92 сек\n длительность толчка, 1,84 сек\n длительность оглушения\n Преодолённое расстояние 900: 300 урона, 350 дальность толчка, 1,125 сек\n длительность толчка, 2,25 сек\n длительность оглушения.",
        "Normal Punch сначала применяет оглушение, затем урон, затем обрасывание\n После этого наносится урон от атаки",
        "Иллюзия появляется на расстоянии 350 позади места приземления противнка спустя 0,7 секунд после применения Normal Punch\n Иллюзия полностью контролируема\n При появлении ей отдаётся приказ атаковать ударенного противника\n Эффекта удара и звуковые эффекты улучшаются, если преодоленное расстояние достигает отметки 300 и 900 единиц"
      ],
      "item_behaviour": [],
      "description": "Дарует Normal Punch. Пассивная способность с перезарядкой. Следующая атака по вражескому герою создаст его иллюзию, оглушит, нанесёт дополнительный урон и оттолкнёт. Сила эффекта зависит от того, какое расстояние герой преодолел за 3 секунды до атаки. При расстоянии в 900 достигается максимальный эффект: 3 секунды оглушения, 300 урона и толчок на расстояние в 350. Иллюзия живёт 6. Перезарядка: 14.",
      "hot_key": "?",
      "params": [
        "Время: 3",
        "Расстояние для макс\n эффекта: 900",
        "Мин\n расстояние толчка: 50",
        "Макс\n расстояние толчка: 350",
        "Мин\n урон: 10",
        "Макс\n урон: 300",
        "Мин\n длительность оглушения: 0,2",
        "Макс длительность оглушения: 2,25",
        "Количество иллюзий: 1",
        "Наносимый иллюзией урон: 80%",
        "Получаемый иллюзией урон: 200%",
        "Задердка перед появлением иллюзии: 0,7",
        "Длительность иллюзии: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Dark_Seer_Normal_Punch_1.mp3\/revision\/latest?cb=20201224202126",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Normal Punch",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Значения для стены устанавливаются при создании и не обновляются при поднятии уровня заклинания во время действия способности",
        "Стена создает только одну иллюзию для каждого игрока\n То есть, при нескольких стенах (от таланта или нескольких использований) каждая из них создает отдельную иллюзию врага\n Также для врагов с несколькими героями (клоны  Divided We Stand и  Tempest Double) количество иллюзий ограничено одной за каждую стену\n Даже если иллюзия будет приручена  Enchant, то стена не создаст новую для данного героя",
        "Создает иллюзии только из героев\n Не создает иллюзии с иллюзий\n Может создать иллюзии клонов Divided We Stand и Tempest Double, но не  Wukong's Command\n Создает иллюзии неуязвимых врагов, но не спрятанных\n К неуязвимым замедление не применяется",
        "При появлении иллюзия автоматически получает приказ атаковать героя, создавшего её",
        "При смерти иллюзии стена может создать новую как только герой появится в радиусе действия",
        "Убийство иллюзии от Wall of Replica даёт фиксированные 5  и 5XP, которые не увеличиваются с повышением уровня способности",
        "Время жизни иллюзий основано на оставшейся длительности стены, из которой они были созданы",
        "Иллюзии появляются в 108 единицах от героя, если размер столкновения равен 24 единицам и в 72, если размер столкновения равен 8\n Иллюзия появляется с одной из сторон(сверху, слева, снизу или справа)",
        "Иллюзии от Wall of Replica визуально различимы для врагов",
        "Замедление постоянно применяется по всей области стены\n Если стены накладываются друг на друга, то их замедления не складываются",
        "При выборе  таланта на создание параллельной стены, вторая стена располагается позади первой стены на расстоянии  единиц"
      ],
      "item_behaviour": [],
      "description": "Создает стену преломленного света, которая наносит урон и создает копии любого вражеского героя, проходящего сквозь нее. Копии врага служат Dark Seer. Копии пропадут, если их уничтожить или если закончится время действия стены.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0,73",
        "Дальность применения: 1300",
        "Количество стен: 1 ( 3)",
        "Длина стены: 1300",
        "Ширина стены: 50",
        "Замедление скорости передвижения: 50%\/60%\/70%",
        "Иллюзии наносят урона: 70%\/85%\/100% ( 90%\/105%\/120%)",
        "Иллюзии получают урона: 200%",
        "Длительность: 30",
        "Длительность замедления: 1",
        "Расстояние до параллельной стены:"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/14\/Dark_Seer_Wall_of_Replica.mp3\/revision\/latest?cb=20191216012247",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Вражеских героев"
      ],
      "mana": "100 (TagTalent 60)",
      "aghanim": null,
      "name": "Wall of Replica",
      "cooldown": "125\/250\/375",
      "legacy_key": "W",
      "story": "Пусть Иш'Кафель и не в состоянии вернуться домой, силой своего разума он может призвать отрывок призматической стены, вызывая смятение в рядах врагов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.8,
    "attrAgility": 19.0
  },
  "description": "Стягивает врагов в точку и манипулирует их местоположением. В итоге выверенными движениями Ишь'Кафэль привел свою бесчисленную армию в новый мир, проложив путь волной темной энергии. Хитрый стратег, Dark Seer, манипулирует гравитацией, чтобы втянуть противников в Vacuum, притягивая их к призматическим шипам Ion Shell. Вооруженный только своим интеллектом, он, с помощью Surge, поднимается над землей, чтобы поспеть к каждой точке конфликта. В стратегических местах Ишь'Кафэль размещает свою Wall of Replica, сея смущения в рядах противника, поскольку им придется сражаться против армии призрачных двойников, подобных им самим.  Инициация Лес Побег Контроль ★☆☆",
  "history": "Стремительный в час нужды стратег Иш'Кафэль — расчётливый провидец, что обходится в бою без острых мечей: если нужно уничтожить противника, он полагается на мощь своего разума, мастерски направляя сражение в нужное русло. Сей воин пришёл из измерения вне граней реальности, которое он сам называет «миром за стеной». Когда-то Иш'Кафэль был великим военачальником своего народа и храбрым защитником святого короля Даматрикса, но в последние дни Великой войны Пределов его войско пало под натиском превосходящих сил. Поражение было неминуемо, но стратег совершил отчаянный поступок: он завёл армию врага в лабиринт меж стен. В последний миг Иш'Кафэль выскользнул из окружения и выпустил сокрушительную волну тёмной энергии, навеки заточив преследователей в лабиринте. Когда пыль улеглась, стратег увидел, что спас свой народ, однако сам он очутился под светилом иного мира, неспособный вернуться домой. Теперь Иш'Кафэль неуклонно проявляет свой военный гений, поклявшись показать себя величайшим тактиком из всех, что видел этот странный новый мир."
}