{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,5% к урону от макс. здоровья у Sun Ray",
          "talentRight": "+3 к атакам для уничтожения Supernova"
        },
        {
          "talentLvl": "20",
          "talentLeft": "Sun Ray во время Supernova",
          "talentRight": "+1100 к дальности Icarus Dive"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+500 к здоровью",
          "talentRight": "+25 к урону в секунду от Fire Spirits"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+6% к урону от заклинаний",
          "talentRight": "+18% к замедлению от Icarus Dive"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Phoenix_Icarus_Dive.mp3\/revision\/latest?cb=20191216021826",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Расход 15% от текущего здоровья — это отнимающий здоровье урон.",
        "Phoenix летит по траектории эллипса, вытянутого по длине на 1400 (TagTalent 2500) и по ширине — на 500. В итоге все расстояние равно 3154,41 (TagTalent 5252,33), которое Phoenix пересекает за 2 (TagTalent 3) секунды. То есть, Phoenix летит со средней скоростью в 1577,21 (TagTalent 2626,16) единиц. Скорость полета не имеет фиксированного значения. Phoenix начинает полет со скоростью в 0 единиц, ускоряясь до достижения половины максимального расстояния, затем замедляется при достижении максимального расстояния, и затем повторяет эти действия на обратном пути.",
        "В итоге все расстояние равно 3154,41 (TagTalent 5252,33), которое Phoenix пересекает за 2 (TagTalent 3) секунды.",
        "То есть, Phoenix летит со средней скоростью в 1577,21 (TagTalent 2626,16) единиц.",
        "Скорость полета не имеет фиксированного значения. Phoenix начинает полет со скоростью в 0 единиц, ускоряясь до достижения половины максимального расстояния, затем замедляется при достижении максимального расстояния, и затем повторяет эти действия на обратном пути.",
        "Phoenix всегда начинает полет по часовой стрелке, поражая существ сначала с левой стороны. Существа, находящиеся ровно в середине арки, образованной эллипсом, не получают урон.",
        "Способность можно прервать, если герой получил оглушение, попал в ураган, был проклят, усыплен или на него воздействовал один из источников принудительного движения. Оцепенение и провокация полет не прерывают.",
        "Phoenix может атаковать, использовать способности и предметы при полете (включая произносимые способности). Но при этом Sun Ray неактивна.",
        "Но при этом Sun Ray неактивна.",
        "Во время полета Phoenix не нужно поворачиваться для использование направленных способностей или предметов.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 4 раз.",
        "Наносит до 40\/120\/200\/280 урона одному существу (до уменьшений)."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Герой летит вперёд по дуге, замедляя всех врагов на своём пути и нанося им периодический урон, а затем возвращается в исходную точку. Если применить способность Supernova, полёт прервётся.",
      "spellName": "Icarus Dive",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: Глобальная",
        "Расход текущего здоровья: 15%",
        "Радиус: 200",
        "Дальность полета: 1400 (TagTalent 2500)",
        "Ширина: 500",
        "Продолжительность полета: 2 (TagTalent 3)",
        "Урон в секунду: 10\/30\/50\/70",
        "Замедление скорости передвижения: 19%\/22%\/25%\/28% (TagTalent 37%\/40%\/43%\/46%)",
        "Длительность замедления и урона: 4",
        "Замедление остается и наносится урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Получение оцепенения во время полета его не отменяет."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Хоть путешествия в космосе этому существу не чужды, полёт под куполом атмосферы приносит ему несравнимое удовольствие."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/62\/Stop_Icarus_Dive.mp3\/revision\/latest?cb=20141127110352",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Icarus Dive до окончания полета.",
        "При использовании прерывает произносимые заклинания Phoenix."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Мгновенно прерывает полет.",
      "spellName": "Stop Icarus Dive",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "СКРИ!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Fire_Spirits.mp3\/revision\/latest?cb=20141127110259",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания Phoenix.",
        "Расход 20% от текущего здоровья — это отнимающий здоровье урон.",
        "Горение, вызываемое духами, не складывается. Попадание по одним и тем же существам несколько раз просто обновит длительность дебаффа.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 4 раз.",
        "Каждый дух наносит до 60\/140\/220\/300 (TagTalent 160\/240\/320\/400) единиц урона одному существу (до уменьшений). Все духи вместе наносят до 240\/560\/880\/1200 (TagTalent 640\/960\/1280\/1600) единиц урона одному существу (до уменьшений).",
        "Все духи вместе наносят до 240\/560\/880\/1200 (TagTalent 640\/960\/1280\/1600) единиц урона одному существу (до уменьшений)."
      ],
      "mana": "120",
      "hotKey": "W",
      "cooldown": "51\/44\/37\/30",
      "description": "Призывает 4 огненных духа, которые кружатся вокруг героя. Каждого из них по отдельности можно выпустить в указанную точку. Долетев до неё, дух подожжёт всех противников вокруг себя, нанося им периодический урон и уменьшая их скорость атаки.",
      "spellName": "Fire Spirits",
      "params": [
        "Анимация применения: 0+0",
        "Расход текущего здоровья: 20%",
        "Радиус: 175",
        "Урон в секунду: 15\/35\/55\/75 (TagTalent 40\/60\/80\/100)",
        "Замедление скорости атаки: 80\/100\/120\/140",
        "Длительность замедления и урона: 4",
        "Длительность духов: 20",
        "Замедление остается и наносится урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Непрерывно сокращающееся звёздное ядро часто испускает скоротечные всплески разумного света."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Phoenix_Launch_Fire_Spirit_1.mp3\/revision\/latest?cb=20191216021830",
      "effects": [
        "Способность Направленная на область"
      ],
      "notes": [
        "Заменяет Fire Spirits до того, пока все духи не будут выпущены.",
        "Запущенные духи движутся к цели со скоростью 900.",
        "Пока действуют Icarus Dive и Sun Ray духов можно запустить в любую сторону без необходимости разворота в ту сторону Phoenix.",
        "Fire Spirit дает наземный обзор в радиусе 175 единиц на 1 секунду после попадания на выбранную область."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Каждого духа по отдельности можно выпустить в указанную точку. Долетев до неё, дух подожжёт всех противников вокруг себя, нанося им периодический урон и уменьшая их скорость атаки.",
      "spellName": "Launch Fire Spirit",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 1400"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "КУДАХ-БА-БАХ!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Phoenix_Sun_Ray.mp3\/revision\/latest?cb=20191216021815",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "Расход в 6% в секунду от текущего здоровья — это отнимающий здоровье урон. Тратит 1,2% от текущего здоровья с интервалом в 0,2 секунды спустя 0,2 секунды после применения, в итоге сжигая здоровье 30 раз за 6 секунд. В итоге общий расход здоровья составляет 30,38% от базового текущего уровня здоровья Phoenix за полные 6 секунд применения.",
        "Тратит 1,2% от текущего здоровья с интервалом в 0,2 секунды спустя 0,2 секунды после применения, в итоге сжигая здоровье 30 раз за 6 секунд.",
        "В итоге общий расход здоровья составляет 30,38% от базового текущего уровня здоровья Phoenix за полные 6 секунд применения.",
        "Для лучшего понимания скорость поворот при использовании Sun Ray определяется как градусы в секунду, а не в радиантах за 0,03 секунды. 25 градусов в секунду эквивалентно скорости поворота в 0,013.",
        "25 градусов в секунду эквивалентно скорости поворота в 0,013.",
        "Дает наземный обзор в 175 единиц по всей длине луча на все время действия.",
        "Способность можно прервать, если Phoenix получил оглушение, безмолвие, попал в ураган, был проклят или усыплен. Оцепенение и принудительное движение способность не прерывают.",
        "Duel и Savage Roar могут прервать способность, но при этом провокация от Berserker's Call и Winter's Curse этого не делает. Но при этом, пока действует провокация, Phoenix не может менять свое положение с помощью Toggle Movement или вручную прервать действие с помощью Stop Sun Ray.",
        "Но при этом, пока действует провокация, Phoenix не может менять свое положение с помощью Toggle Movement или вручную прервать действие с помощью Stop Sun Ray.",
        "Sun Ray устанавливает скорость передвижения Phoenix равной 0 (имеет приоритет над ускорением) и обезоруживает на все время действия, поэтому герой не может двигаться или атаковать.",
        "Phoenix может использовать предметы и способности, пока действует Sun Ray (включая произносимые способности). Применение Icarus Dive также не прервет способность.",
        "Пока действует Sun Ray, Phoenix не нужно поворачиваться для использование направленных способностей или предметов.",
        "Sun Ray неактивна, пока длится полет от Icarus Dive, поэтому её нельзя использовать в полете.",
        "Наносит урон или лечит с интервалом в 0,2 секунды спустя 0,2 секунды после применения, срабатывая 30 раз за существо. Изначально луч наносит 14\/20\/26\/32 + 1,5%\/3,25%\/5%\/6,75% (TagTalent 3%\/4,75%\/6,5%\/8,25%) от максимального здоровья существ под действием способности в качестве урона в секунду. За каждые прошедшие 0,02 секунды урон увеличивается на 0,467\/0,667\/0,867\/1,067 + 0,1%\/0,1%\/0,2%\/0,2% (TagTalent 0,1%\/0,2%\/0,2%\/0,3%) от их максимального здоровья. За 6 секунд урон составит 28\/40\/52\/64 + 3%\/6,5%\/10%\/13,5% (TagTalent 6%\/9,5%\/13%\/16,5%) от их максимального запаса здоровья в секунду. И на этом луч закончится. Изначально луч излечивает 7\/10\/13\/16 + 0,625%\/1,25%\/1,875%\/2,5% от максимального запаса здоровья существ под действием способности в секунду. За каждые прошедшие 0,2 секунды лечение увеличивается на 0,233\/0,333\/0,433\/0,533 + 0%\/0%\/0,1%\/0,1% от их максимального здоровья. За 6 секунд лечение составит 14\/20\/26\/32 + 1,25%\/2,5%\/3,75%\/5% от их максимального здоровья в секунду. И на этом луч закончится.",
        "Изначально луч наносит 14\/20\/26\/32 + 1,5%\/3,25%\/5%\/6,75% (TagTalent 3%\/4,75%\/6,5%\/8,25%) от максимального здоровья существ под действием способности в качестве урона в секунду.",
        "За каждые прошедшие 0,02 секунды урон увеличивается на 0,467\/0,667\/0,867\/1,067 + 0,1%\/0,1%\/0,2%\/0,2% (TagTalent 0,1%\/0,2%\/0,2%\/0,3%) от их максимального здоровья.",
        "За 6 секунд урон составит 28\/40\/52\/64 + 3%\/6,5%\/10%\/13,5% (TagTalent 6%\/9,5%\/13%\/16,5%) от их максимального запаса здоровья в секунду. И на этом луч закончится.",
        "Изначально луч излечивает 7\/10\/13\/16 + 0,625%\/1,25%\/1,875%\/2,5% от максимального запаса здоровья существ под действием способности в секунду.",
        "За каждые прошедшие 0,2 секунды лечение увеличивается на 0,233\/0,333\/0,433\/0,533 + 0%\/0%\/0,1%\/0,1% от их максимального здоровья.",
        "За 6 секунд лечение составит 14\/20\/26\/32 + 1,25%\/2,5%\/3,75%\/5% от их максимального здоровья в секунду. И на этом луч закончится.",
        "Наносит до 126\/180\/234\/288 + 13,5%\/29,25%\/45%\/60,75% (TagTalent 27%\/42,75%\/58,5%\/74,25%) от максимального здоровья в качестве урон, если на врага способность действовала все время.",
        "Вылечивает до 63\/90\/117\/144 + 5,625%\/11,25%\/16,875%\/22,5% от максимального здоровья в случае, если союзник оставался под лучом все время действия.",
        "Не действует на курьеров."
      ],
      "mana": "100",
      "hotKey": "E",
      "cooldown": "30",
      "description": "Герой выпускает из себя луч света ценой собственного здоровья. Луч наносит урон врагам и исцеляет союзников на определенное число плюс процент от общего запаса здоровья. Этот процент тем выше, чем дольше применяется луч.",
      "spellName": "Sun Ray",
      "params": [
        "Анимация применения: 0,01+0,5",
        "Дальность применения: 1300",
        "Расход текущего здоровья в секунду: 6%",
        "Длина луча: 1250",
        "Ширина луча: 130",
        "Базовый урон в секунду: 14\/20\/26\/32",
        "Макс. здоровье в урон в секунду: 1,5%\/3,25%\/5%\/6,75% (TagTalent 3%\/4,75%\/6,5%\/8,25%)",
        "Базовое лечение в секунду: 7\/10\/13\/16",
        "Макс. здоровье в лечение в секунду: 0,625%\/1,25%\/1,875%\/2,5%",
        "Скорость поворота в градусах в секунду: 25",
        "Длительность луча: 6",
        "Лечит союзников с иммунитетом к заклинаниям. Не наносит урон врагам с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Потоки, что несут энергию звезды, не шире нескольких атомов."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя"
      ],
      "notes": [
        "Эта способность становится активна только при наличии действующего баффа от Sun Ray. Способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний.",
        "Способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний.",
        "При использовании прерывает произносимые заклинания Phoenix.",
        "Phoenix движется в сторону луча с фиксированной скоростью в 250 единиц. Замедление и эффекты, влияющие на скорость передвижения, никак не влияют на неё.",
        "Phoenix может проходить через преграды и разрушать деревья на своем пути."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Включает медленное передвижение вперёд во время действия Sun Ray.",
      "spellName": "Toggle Movement",
      "params": [
        "Анимация применения: 0+0",
        "Оцепенение приостанавливает движение до истечения дебаффа."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "КАР!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c6\/Stop_Sun_Ray.mp3\/revision\/latest?cb=20141127110357",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Sun Ray до конца действия луча.",
        "При использовании прерывает произносимые Phoenix способности."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Немедленно останавливает Sun Ray.",
      "spellName": "Stop Sun Ray",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "ЧИРИК!"
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Phoenix_Supernova_1.mp3\/revision\/latest?cb=20191216021816",
      "effects": [
        "Способность Ненаправленная (TagAghanim Направленная на существо)",
        "Действует на Врагов \/ Союзных героев",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "Способность превращает ночь в день на время действия. Её приоритет выше приоритет, чем у ночи, вызванной Dark Ascension и Eclipse.",
        "Позволяет избежать снаряды и применяет сильное развеивание при использовании. Также развеивает Fire Spirits.",
        "При применении сбрасывает перезарядку способностей Phoenix и восстанавливает герою ману. Не сбрасывает перезарядку предметов и ультимейтов. Если солнце уцелело, то в конце действия также восстанавливается здоровье Phoenix.",
        "Если солнце уцелело, то в конце действия также восстанавливается здоровье Phoenix.",
        "Во время действия Supernova Phoenix спрятан, неуязвим, обезоружен, заглушен и на него действует оцепенение. Все заклинания Phoenix также становятся неактивными до перерождения, поэтому их нельзя применить. С талантом 20 уровня, появляется возможность использовать Sun Ray. Но, поскольку на Phoenix действует оцепенение, то вспомогательную способность Toggle Movement использовать нельзя. При этом герой может поворачивать луч.",
        "Все заклинания Phoenix также становятся неактивными до перерождения, поэтому их нельзя применить.",
        "С талантом 20 уровня, появляется возможность использовать Sun Ray.",
        "Но, поскольку на Phoenix действует оцепенение, то вспомогательную способность Toggle Movement использовать нельзя. При этом герой может поворачивать луч.",
        "Только атаки от героев (включая клонов, но исключая иллюзии) наносят урон солнцу.",
        "Урон наносится в виде ауры, дебафф от него задерживается на 0,5 секунды. Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая до 0,5 раз. Наносит до 360\/540\/720 единиц урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность. Источник урона — заклинатель, а не солнце, поэтому на урон распространяется усиление урона заклинаний.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая до 0,5 раз.",
        "Наносит до 360\/540\/720 единиц урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность.",
        "Источник урона — заклинатель, а не солнце, поэтому на урон распространяется усиление урона заклинаний.",
        "Солнце можно добить, если у него остается менее половины здоровья. Это действие также добьет Phoenix (и находящегося внутри союзника).",
        "Разрушает деревья в радиусе 500 единиц вокруг Phoenix.",
        "Aghanim's Scepter превращает эту способность в направленную на цель с дальностью применения в 500 единиц. Дальность применения действует только на выбор существа в радиусе дальности. Солнце продолжает появляться в месте нахождения Phoenix. Может выбирать в качестве целей только союзных героев (включая иллюзии) и себя (двойное нажатие применит способность на себя). Внутри солнца союзник не может отдавать приказы, помимо тех эффектов, которые применяются на Phoenix. Если солнце уцелело, то здоровье и мана союзника будут восполнены и все способности, кроме ультимейта и предметов, будут обновлены. Уничтожение солнца приписывает смерть героев тому, кто его разрушил. Если солнце разрушили, но у Phoenix была возможность воскрешения, то здоровье, мана и способности союзника не изменятся. Если солнце разрушили, а у союзника внутри есть источник воскрешения, то он воскреснет после смерти Phoenix.",
        "Дальность применения действует только на выбор существа в радиусе дальности. Солнце продолжает появляться в месте нахождения Phoenix.",
        "Может выбирать в качестве целей только союзных героев (включая иллюзии) и себя (двойное нажатие применит способность на себя).",
        "Внутри солнца союзник не может отдавать приказы, помимо тех эффектов, которые применяются на Phoenix.",
        "Если солнце уцелело, то здоровье и мана союзника будут восполнены и все способности, кроме ультимейта и предметов, будут обновлены.",
        "Уничтожение солнца приписывает смерть героев тому, кто его разрушил.",
        "Если солнце разрушили, но у Phoenix была возможность воскрешения, то здоровье, мана и способности союзника не изменятся.",
        "Если солнце разрушили, а у союзника внутри есть источник воскрешения, то он воскреснет после смерти Phoenix."
      ],
      "mana": "200",
      "hotKey": "R",
      "cooldown": "110",
      "description": "Герой прекращает свою жизнь ради шанса переродиться. Он превращается в горящее солнце, которое могут уничтожить атаками вражеские герои. Солнце обжигает врагов в большом радиусе, а спустя 6 сек. взрывается, оглушая всех врагов вокруг. Герой появляется на месте взрыва с полным запасом здоровья, маны и без перезарядки на других способностях.",
      "spellName": "Supernova",
      "params": [
        "Анимация применения: 0,01+0,5",
        "Дальность применения: 0 (TagAghanim 500)",
        "Радиус: 1300",
        "Атак героя для уничтожения: 6\/8\/10 (TagTalent 9\/11\/13) (TagTalent 7\/10\/13, 10\/13\/16)",
        "Урон в секунду: 60\/90\/120",
        "Длительность оглушения: 2\/2,5\/3",
        "Длительность задержки ауры: 0,5",
        "Длительность: 6",
        "Увеличивает число атак для уничтожения солнца, а также позволяет применять эту способность на союзного героя, чтобы переродиться вместе с ним. Не сбрасывает время перезарядки ультов."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Солнечный жар сверхновой звезды может быть смертелен, но из его пламени в бесконечность устремляются всё новые лучи."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Phoenix — это герой с дальним типом атаки, основным атрибутом которого является сила. Его первая способность, Icarus Dive, несет Phoenix по дуге, замедляя всех врагов на своем пути и нанося им урон, а затем возвращается на исходную позицию. Полет можно остановить, использовав Stop Icarus Dive. Вторая способность, Fire Spirits, призывает 4 духа, которые кружатся вокруг Phoenix. Каждого духа можно выпустить независимо от других в указанную область. При столкновении с врагами наносит им периодический урон и значительно снижает скорость атаки. Третьей способность, Sun Ray, Phoenix выпускает огромный луч света за счет собственной здоровья. Луч наносит урон врагам, отнимает часть их здоровья и исцеляет союзников на половину этого значения. Пока луч горит, урон от него возрастает вплоть до двойного. Использовав Toggle Movement во время действия Sun Ray, Phoenix начнет лететь вперед. Способность также можно остановить, использовав Stop Sun Ray. Ультимативная способность, Supernova, превращает Phoenix в горящее солнце, которое могут уничтожить вражеские герои. Солнце обжигает врагов в большом радиусе, а спустя время взрывается, оглушая всех окружающих врагов. Phoenix появляется на месте взрыва с полным запасом здоровья, маны и без перезарядки на других способностях. Улучшение с Aghanim's Scepter позволяет Phoenix использовать Supernova на союзном герое, забирая обоих в солнце для последующего перерождения. Не сбрасывает время перезарядки ультов.",
  "history": "Первому солнцу Хранителя, единственной точке разумного света в изначальной тьме, было предначертано принести тепло в холодную пустоту. Бесчисленными миллиардами лет этот ослепительный луч собирал свою неизмеримую энергию, и однажды расцвёл в разрушительном взрыве сверхновой звезды. Из этого огня появились новые лучи, звёздные потомки своего родителя, что устремились в океан тьмы и стали созвездиями. Со временем и они стали сверхновыми, пробуждая новый свет. Так продолжался цикл рождения и перерождения — пока не стало мерцать и сиять всё небо, созданное тяжёлым трудом Титанов. Из этой кузницы и явилась в мир сущий одно особенное для простых смертных светило. Его, как и многих предков, извергли в безграничный космос, дабы оно нашло своё место среди небесных братьев и сестёр. Но птенца захватил интерес к тому, что гаснущие предки согревали во тьме, и в течение многих лет он познавал мир. Он узнал, что среди целых и разрушенных миров скоро образуется замкнутый центр, где всевозможные силы сойдутся в противостоянии, несущем вселенское значение. И узнал, что в той битве потребуется нечто большее, чем далёкие лучи умирающего солнца. И потому звёздное дитя приняло земную форму, чтобы в путешествиях нести тепло всем нуждающимся и, возможно, исполнить свою звёздную судьбу.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,5% к урону от макс. здоровья у Sun Ray",
      "talentRight": "+3 к атакам для уничтожения Supernova"
    },
    {
      "talentLvl": "20",
      "talentLeft": "Sun Ray во время Supernova",
      "talentRight": "+1100 к дальности Icarus Dive"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+500 к здоровью",
      "talentRight": "+25 к урону в секунду от Fire Spirits"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+6% к урону от заклинаний",
      "talentRight": "+18% к замедлению от Icarus Dive"
    }
  ]
}