{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1,5% к урону от макс. здоровья у Sun Ray",
          "talentRight": "+3 к атакам для уничтожения Supernova"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+0,5 сек. оглушения от Supernova",
          "talentRight": "+1000 к дальности Icarus Dive"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+500 к здоровью",
          "talentRight": "+25 к урону в секунду от Fire Spirits"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+6% к урону от заклинаний",
          "talentRight": "+24% к замедлению от Icarus Dive"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Phoenix_Icarus_Dive.mp3\/revision\/latest?cb=20191216021826",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Icarus Dive нельзя использовать во время Supernova. Применение Supernova мгновенно прерывает полёт.",
        "Применение Supernova мгновенно прерывает полёт.",
        "Расход 15% от текущего здоровья — это отнимающий здоровье урон.",
        "Phoenix летит по траектории эллипса, вытянутого по длине на 1400 (TagTalent 2400) и по ширине — на 500. В итоге все расстояние равно 3154,41 (TagTalent 5058,83) единицам, преодолеваемым Phoenix за 2 (TagTalent 3) сек. То есть, Phoenix летит со средней скоростью в 1577,21 (TagTalent 2529,41) единиц. Скорость полета не имеет фиксированного значения. Phoenix начинает полет со скоростью в 0 единиц, ускоряясь до достижения половины максимального расстояния, затем замедляется при достижении максимального расстояния, и затем повторяет эти действия на обратном пути.",
        "В итоге все расстояние равно 3154,41 (TagTalent 5058,83) единицам, преодолеваемым Phoenix за 2 (TagTalent 3) сек.",
        "То есть, Phoenix летит со средней скоростью в 1577,21 (TagTalent 2529,41) единиц.",
        "Скорость полета не имеет фиксированного значения. Phoenix начинает полет со скоростью в 0 единиц, ускоряясь до достижения половины максимального расстояния, затем замедляется при достижении максимального расстояния, и затем повторяет эти действия на обратном пути.",
        "Во время полета деревья в радиусе 150 от Phoenix разрушаются.",
        "Phoenix всегда начинает полет по часовой стрелке, сначала задевая существ с левой стороны. Существа, находящиеся ровно в середине арки, образованной эллипсом, не получают урон.",
        "Полет прерывается, если герой оглушен, попал в ураган, был проклят, усыплен или на него подействовал один из источников принудительного движения. Оцепенение и провокация полет не прерывают.",
        "Во время полета Phoenix может атаковать, использовать и произносить способности и предметы. Но при этом Sun Ray неактивна. Во время полета Phoenix не нужно поворачиваться для использование направленных способностей или предметов.",
        "Но при этом Sun Ray неактивна.",
        "Во время полета Phoenix не нужно поворачиваться для использование направленных способностей или предметов.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 4 раз. Наносит до 40\/120\/200\/280 урона одному существу (до уменьшений).",
        "Наносит до 40\/120\/200\/280 урона одному существу (до уменьшений)."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Icarus Dive",
      "cooldown": null,
      "description": "Герой летит вперёд по дуге, замедляя всех врагов на своём пути и нанося им периодический урон, а затем возвращается в исходную точку. Если применить способность Supernova, полёт прервётся.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: Глобальная",
        "Расход текущего здоровья: 15%",
        "Радиус: 200",
        "Дальность полета: 1400 (TagTalent 2400)",
        "Ширина полета: 500",
        "Продолжительность полета: 2 (TagTalent 3)",
        "Урон в секунду: 10\/30\/50\/70",
        "Замедление скорости передвижения: 19%\/22%\/25%\/28% (TagTalent 43%\/46%\/49%\/52%)",
        "Длительность замедления и урона: 4",
        "Замедление остается и наносится урон, если дебафф был применен до невосприимчивости к магии и не был развеян.",
        "Получение оцепенения не отменяет совершаемый полет."
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Icarus Dive до использования вспомогательной способности или окончания полета.",
        "При использовании прерывает произносимые заклинания Phoenix."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Stop Icarus Dive",
      "cooldown": null,
      "description": "Мгновенно прерывает полет.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/29\/Phoenix_Fire_Spirits.mp3\/revision\/latest?cb=20191216021825",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Fire Spirits нельзя использовать во время Supernova. Использование Supernova с активной Fire Spirits мгновенно убирает бафф.",
        "Использование Supernova с активной Fire Spirits мгновенно убирает бафф.",
        "Расход 20% от текущего здоровья — это отнимающий здоровье урон.",
        "При применении прерывает произносимые заклинания Phoenix.",
        "При применении дает Launch Fire Spirit 4 заряда. Число духов отображается в иконке баффа.",
        "Бафф горения не складывается. Попадание по одним и тем же существам несколько раз просто обновит длительность дебаффа.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 80\/100\/120\/140 раз.",
        "Каждый дух наносит до 60\/140\/220\/300 (TagTalent 160\/240\/320\/400) урона одному существу (до уменьшений). Все духи наносят до 240\/560\/880\/1200 (TagTalent 640\/960\/1280\/1600) урона одному существу (до уменьшений).",
        "Все духи наносят до 240\/560\/880\/1200 (TagTalent 640\/960\/1280\/1600) урона одному существу (до уменьшений)."
      ],
      "mana": "120",
      "item_behaviour": [],
      "name": "Fire Spirits",
      "cooldown": "51\/44\/37\/30",
      "description": "Призывает 4 огненных духа, которые кружатся вокруг героя. Каждого из них по отдельности можно выпустить в указанную точку. Долетев до неё, дух подожжёт всех противников вокруг себя, нанося им периодический урон и уменьшая их скорость атаки.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Расход текущего здоровья: 20%",
        "Радиус: 175",
        "Число духов: 4",
        "Урон в секунду: 15\/35\/55\/75 (TagTalent 40\/60\/80\/100)",
        "Замедление скорости атаки: 80\/100\/120\/140",
        "Длительность замедления и урона: 4",
        "Длительность духов: 20",
        "Замедление остается и наносится урон, если дебафф был применен до невосприимчивости к магии и не был развеян."
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Phoenix_Launch_Fire_Spirit_1.mp3\/revision\/latest?cb=20191216021830",
      "effects": [
        "Способность Направленная на область"
      ],
      "notes": [
        "Заменяет Fire Spirits до запуска всех духов.",
        "Максимальное число зарядов для Launch Fire Spirit всегда равно значению, даваемому баффом.",
        "Запущенные духи движутся со скоростью 900.",
        "Во время действия Icarus Dive и Sun Ray духов можно запустить в любом направлении без поворота Phoenix.",
        "Огненный дух дает наземный обзор в радиусе 175 единиц на 1 секунду при попадании в выбранную область."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Launch Fire Spirit",
      "cooldown": "0",
      "description": "Каждого духа по отдельности можно выпустить в указанную точку. Долетев до неё, дух подожжёт всех противников вокруг себя, нанося им периодический урон и уменьшая их скорость атаки.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 1400",
        "Макс. зарядов: 4"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Phoenix_Sun_Ray.mp3\/revision\/latest?cb=20191216021815",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "Sun Ray нельзя использовать во время Icarus Dive и Supernova. Применение Supernova мгновенно прерывает луч, применение Icarus Dive — нет.",
        "Применение Supernova мгновенно прерывает луч, применение Icarus Dive — нет.",
        "Расход в 6% в секунду от текущего здоровья — это отнимающий здоровье урон. Тратит 1,2% от текущего здоровья с интервалом в 0,2 секунды спустя 0,2 секунды после применения, в итоге сжигая здоровье 30 раз за 6 сек. В итоге общий расход здоровья составляет 30,38% от базового текущего уровня здоровья Phoenix за полные 6 сек. применения.",
        "Тратит 1,2% от текущего здоровья с интервалом в 0,2 секунды спустя 0,2 секунды после применения, в итоге сжигая здоровье 30 раз за 6 сек.",
        "В итоге общий расход здоровья составляет 30,38% от базового текущего уровня здоровья Phoenix за полные 6 сек. применения.",
        "Для лучшего понимания скорость поворот при использовании Sun Ray определяется как градусы в секунду, а не в радианы за 0,03 секунды. 25° градусов в секунду эквивалентно скорости поворота в 0,013.",
        "25° градусов в секунду эквивалентно скорости поворота в 0,013.",
        "Дает наземный обзор радиусом 175 вокруг луча на всю длительность.",
        "Способность прерывается, если на Phoenix действует оглушение, безмолвие, ураган, проклятие или сон. Оцепенение, провокация и принудительное движение способность не прерывают. Duel прервает Sun Ray, поскольку применяет к дуэлянтам безмолвие. Пока действует провокация, Phoenix не может менять направление или использовать Toggle Movement и Stop Sun Ray.",
        "Duel прервает Sun Ray, поскольку применяет к дуэлянтам безмолвие.",
        "Пока действует провокация, Phoenix не может менять направление или использовать Toggle Movement и Stop Sun Ray.",
        "Sun Ray приравнивает скорость передвижения Phoenix к 0 (приоритет выше, чем у ускорения) и обезоруживает на всю длительность, поэтому герой не может двигаться или атаковать.",
        "Phoenix может использовать и применять способности и предметы во время Sun Ray.",
        "Пока действует Sun Ray, Phoenix не нужно поворачиваться для использование направленных способностей или предметов.",
        "Наносит урон или лечит с интервалом в 0,2 секунды спустя 0,2 секунды после применения, срабатывая 30 раз за существо.",
        "Изначально луч наносит 14\/20\/26\/32 + 1%\/2,75%\/4,5%\/6,25% (TagTalent 2,5%\/4,25%\/6%\/7,75%) от максимального здоровья затронутых существ в качестве урона в секунду. За каждые прошедшие 0,2 секунды урон увеличивается на 0,467\/0,667\/0,867\/1,067 + 0%\/0,1%\/0,2%\/0,2% (TagTalent 0,1%\/0,1%\/0,2%\/0,3%) от их максимального здоровья. За 6 секунд урон достигнет 28\/40\/52\/64 + 2%\/5,5%\/9%\/12,5% (TagTalent 0,1%\/0,1%\/0,2%\/0,3%) от их максимального запаса здоровья в секунду. И на этом луч закончится.",
        "За каждые прошедшие 0,2 секунды урон увеличивается на 0,467\/0,667\/0,867\/1,067 + 0%\/0,1%\/0,2%\/0,2% (TagTalent 0,1%\/0,1%\/0,2%\/0,3%) от их максимального здоровья.",
        "За 6 секунд урон достигнет 28\/40\/52\/64 + 2%\/5,5%\/9%\/12,5% (TagTalent 0,1%\/0,1%\/0,2%\/0,3%) от их максимального запаса здоровья в секунду. И на этом луч закончится.",
        "Наносит до 126\/180\/234\/288 + 9%\/24,75%\/40,5%\/56,25% (TagTalent 22,5%\/38,25%\/54%\/69,75%) от максимального здоровья в качестве урона (до уменьшений), если на врага способность действовала всю длительность.",
        "Изначально луч излечивает 7\/10\/13\/16 + 0,625%\/1,25%\/1,875%\/2,5% от максимального здоровья затронутых существ в секунду. За каждые прошедшие 0,2 секунды лечение увеличивается на 0,233\/0,333\/0,433\/0,533 + 0%\/0%\/0,1%\/0,1% от их максимального здоровья. За 6 сек. лечение достигнет 14\/20\/26\/32 + 1,25%\/2,5%\/3,75%\/5% от их максимального здоровья в секунду. И на этом луч закончится. Вылечивает до 63\/90\/117\/144 + 5,625%\/11,25%\/16,875%\/22,5% от максимального здоровья в случае, если союзник оставался под лучом всю длительность.",
        "Изначально луч излечивает 7\/10\/13\/16 + 0,625%\/1,25%\/1,875%\/2,5% от максимального здоровья затронутых существ в секунду.",
        "За каждые прошедшие 0,2 секунды лечение увеличивается на 0,233\/0,333\/0,433\/0,533 + 0%\/0%\/0,1%\/0,1% от их максимального здоровья.",
        "За 6 сек. лечение достигнет 14\/20\/26\/32 + 1,25%\/2,5%\/3,75%\/5% от их максимального здоровья в секунду. И на этом луч закончится.",
        "Вылечивает до 63\/90\/117\/144 + 5,625%\/11,25%\/16,875%\/22,5% от максимального здоровья в случае, если союзник оставался под лучом всю длительность.",
        "Не действует на курьеров или Рошана.",
        "С Aghanim's Shard Sun Ray можно применять под действием Supernova, а применение Supernova не прерывает действующий луч. Замедление применяется ко всем врагам с каждым нанесением урона. Sun Ray сначала наносит урон, затем применяет замедление.",
        "Замедление применяется ко всем врагам с каждым нанесением урона.",
        "Sun Ray сначала наносит урон, затем применяет замедление."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Sun Ray",
      "cooldown": "30",
      "description": "Герой выпускает из себя луч света ценой собственного здоровья. Луч наносит урон врагам и исцеляет союзников на определенное число плюс процент от общего запаса здоровья. Этот процент тем выше, чем дольше применяется луч.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,01+0,5",
        "Дальность применения: 1200",
        "Расход текущего здоровья в секунду: 6%",
        "Длина луча: 1150",
        "Ширина луча: 130",
        "Базовый урон в секунду: 14\/20\/26\/32",
        "Макс. здоровье в урон в секунду: 1%\/2,75%\/4,5%\/6,25% (TagTalent 2,5%\/4,25%\/6%\/7,75%)",
        "Базовое лечение в секунду: 7\/10\/13\/16",
        "Макс. здоровье в лечение в секунду: 0,625%\/1,25%\/1,875%\/2,5%",
        "Скорость поворота в градусах в секунду: 25°",
        "Длительность луча: 6",
        "Замедление скорости передвижения: 12%",
        "Длительность замедления: 0,67",
        "Способность замедляет врагов на 12%. Позволяет применять её под действием Supernova.",
        "Лечит союзников с невосприимчивостью к магии. Не наносит урон врагам с невосприимчивостью."
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Переключаемая",
        "Действует на Себя"
      ],
      "notes": [
        "Эта способность активна только при наличии баффа Sun Ray. Способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний.",
        "Способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний.",
        "При использовании прерывает произносимые заклинания Phoenix.",
        "Перемещает Phoenix в направлении луча с фиксированной скоростью в 250. Скорость не связана со скоростью передвижения Phoenix, поэтому замедление и эффекты, влияющие на скорость передвижения, никак не влияют на неё. Перемещает Phoenix через возвышенности и разрушает деревья на его пути.",
        "Скорость не связана со скоростью передвижения Phoenix, поэтому замедление и эффекты, влияющие на скорость передвижения, никак не влияют на неё.",
        "Перемещает Phoenix через возвышенности и разрушает деревья на его пути."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Toggle Movement",
      "cooldown": null,
      "description": "Включает медленное передвижение вперёд во время действия Sun Ray.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Скорость передвижения заклинателя: 250",
        "Оцепенение приостанавливает движение до истечения дебаффа."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Заменяет Sun Ray до использования вспомогательной способности или конца действия луча.",
        "При использовании прерывает произносимые способности Phoenix."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Stop Sun Ray",
      "cooldown": "0",
      "description": "Немедленно останавливает Sun Ray.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Phoenix_Supernova_1.mp3\/revision\/latest?cb=20191216021816",
      "effects": [
        "Способность Ненаправленная (TagAghanim Направленная на существо)",
        "Действует на Врагов (TagAghanim Союзных героев)",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "Способность превращает ночь в день на время действия. Её приоритет выше приоритет, чем у ночи, вызванной Dark Ascension и Eclipse.",
        "Позволяет избежать снаряды и применяет сильное развеивание к Phoenix при использовании. Также развеивает Fire Spirits.",
        "При применении сбрасывает перезарядку способностей Phoenix и восстанавливает ману. Не сбрасывает перезарядку предметов и ультимейтов. Если солнце уцелело, то в конце действия также восстанавливается здоровье Phoenix и повторно мана.",
        "Если солнце уцелело, то в конце действия также восстанавливается здоровье Phoenix и повторно мана.",
        "Во время действия Supernova Phoenix спрятан, неуязвим, обезоружен, заглушен и на него действует оцепенение. Все заклинания Phoenix также становятся неактивными до перерождения, поэтому их нельзя применить.",
        "Все заклинания Phoenix также становятся неактивными до перерождения, поэтому их нельзя применить.",
        "Только атаки от героев (включая клонов, но исключая иллюзии) наносят урон солнцу.",
        "Урон наносится аурой. Её дебафф задерживается на 0,5 сек. Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая до 6 раз. Наносит до 360\/540\/720 урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность. Источник урона — заклинатель, а не солнце, поэтому на урон распространяется усиление урона заклинаний.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая до 6 раз.",
        "Наносит до 360\/540\/720 урона одному существу (до уменьшений), если оно оставалось в радиусе действия всю длительность.",
        "Источник урона — заклинатель, а не солнце, поэтому на урон распространяется усиление урона заклинаний.",
        "Солнце можно добить, если у него остается менее половины здоровья. Это действие также добьет Phoenix.",
        "При применении разрушает деревья в прямоугольнике со стороной в 500 единиц вокруг Phoenix.",
        "С Aghanim's Scepter Supernova становится заклинанием, направленным на цель, с дальностью применения в 500 единиц. Дальность применения используется только при выборе существа в радиусе дальности. Солнце все равно появляется на месте Phoenix. Может выбирать целью только союзных героев, включая иллюзии, клонов и себя, но исключая крипов-героев. ↓↓ Двойное нажатие автоматически выбирает себя. Внутри солнца союзник не может отдавать приказы и на него действуют те же эффекты, которые применяются к Phoenix. Если солнце уцелело, то здоровье и мана союзника будут восполнены и все способности, кроме ультимейта и предметов, будут обновлены. Уничтожение солнца приписывает смерть героев тому, кто его разрушил. То же правило распространяется и на добивание. Если солнце разрушили, но у Phoenix была возможность воскрешения, то здоровье, мана и способности союзника не изменятся. Если солнце разрушили, а у союзника внутри есть источник воскрешения, то он воскреснет после смерти Phoenix.",
        "Дальность применения используется только при выборе существа в радиусе дальности. Солнце все равно появляется на месте Phoenix.",
        "Может выбирать целью только союзных героев, включая иллюзии, клонов и себя, но исключая крипов-героев. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Внутри солнца союзник не может отдавать приказы и на него действуют те же эффекты, которые применяются к Phoenix.",
        "Если солнце уцелело, то здоровье и мана союзника будут восполнены и все способности, кроме ультимейта и предметов, будут обновлены.",
        "Уничтожение солнца приписывает смерть героев тому, кто его разрушил. То же правило распространяется и на добивание.",
        "Если солнце разрушили, но у Phoenix была возможность воскрешения, то здоровье, мана и способности союзника не изменятся.",
        "Если солнце разрушили, а у союзника внутри есть источник воскрешения, то он воскреснет после смерти Phoenix.",
        "С Aghanim's Shard Sun Ray можно использовать под действием Supernova, а применение Supernova не прерывает действующий луч. Но, поскольку на Phoenix действует оцепенение, то герой не может двигаться или использовать вспомогательную способность Toggle Movement. При этом герой может поворачиваться и менять направление луча.",
        "С Aghanim's Shard Sun Ray можно использовать под действием Supernova, а применение Supernova не прерывает действующий луч.",
        "Но, поскольку на Phoenix действует оцепенение, то герой не может двигаться или использовать вспомогательную способность Toggle Movement.",
        "При этом герой может поворачиваться и менять направление луча.",
        "Замедление применяется ко всем врагам с каждым нанесением урона. Sun Ray сначала наносит урон, затем применяет замедление. При этом Stop Sun Ray использовать нельзя. Если во время действия Sun Ray использована Supernova, то луч снова активируется после завершения, поскольку Supernova при применении сбрасывает его перезарядку. Если Supernova завершилась во время действия Sun Ray, то способность останется активной, а её вспомогательная способность вновь становится доступной.",
        "Замедление применяется ко всем врагам с каждым нанесением урона.",
        "Sun Ray сначала наносит урон, затем применяет замедление.",
        "При этом Stop Sun Ray использовать нельзя.",
        "Если во время действия Sun Ray использована Supernova, то луч снова активируется после завершения, поскольку Supernova при применении сбрасывает его перезарядку.",
        "Если Supernova завершилась во время действия Sun Ray, то способность останется активной, а её вспомогательная способность вновь становится доступной."
      ],
      "mana": "150\/200\/250",
      "item_behaviour": [],
      "name": "Supernova",
      "cooldown": "120",
      "description": "Герой прекращает свою жизнь ради шанса переродиться. Он превращается в горящее солнце, которое могут уничтожить атаками вражеские герои. Солнце обжигает врагов в большом радиусе, а спустя сек. взрывается, оглушая всех врагов вокруг. Герой появляется на месте взрыва с полным запасом здоровья, маны и без перезарядки на других способностях.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,01+0,5",
        "Радиус: 1200",
        "Атак героя для уничтожения: 6\/8\/10 (TagTalent 9\/11\/13) (TagTalent 7\/10\/13, 10\/13\/16)",
        "Урон в секунду: 60\/90\/120",
        "Длительность оглушения: 2\/2,5\/3 (TagTalent 2,5\/3\/3,5)",
        "Длительность задержки ауры: 0,5",
        "Длительность: 6",
        "Дальность применения: 500",
        "Увеличивает число атак для уничтожения солнца, а также позволяет применять эту способность на союзного героя, чтобы переродиться вместе с ним. Не сбрасывает время перезарядки ультов."
      ],
      "legacy_key": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Phoenix — это герой с дальним типом атаки, основным атрибутом которого является сила. Его первая способность, Icarus Dive, несет Phoenix по дуге, замедляя всех врагов на своем пути и нанося им урон, а затем возвращается на исходную позицию. Полет можно остановить, использовав Stop Icarus Dive. Вторая способность, Fire Spirits, призывает 4 духа, которые кружатся вокруг Phoenix. Каждого духа можно выпустить независимо от других в указанную область. При столкновении с врагами наносит им периодический урон и значительно снижает скорость атаки. Третьей способность, Sun Ray, Phoenix выпускает огромный луч света за счет собственной здоровья. Луч наносит урон врагам, отнимает часть их здоровья и исцеляет союзников на половину этого значения. Пока луч горит, урон от него возрастает вплоть до двойного. Использовав Toggle Movement во время действия Sun Ray, Phoenix начнет лететь вперед. Способность также можно остановить, использовав Stop Sun Ray. Ультимативная способность, Supernova, превращает Phoenix в горящее солнце, которое могут уничтожить вражеские герои. Солнце обжигает врагов в большом радиусе, а спустя время взрывается, оглушая всех окружающих врагов. Phoenix появляется на месте взрыва с полным запасом здоровья, маны и без перезарядки на других способностях. Улучшение с Aghanim's Scepter позволяет Phoenix использовать Supernova на союзном герое, забирая обоих в солнце для последующего перерождения. Не сбрасывает время перезарядки ультов.",
  "history": "Первому солнцу Хранителя, единственной точке разумного света в изначальной тьме, было предначертано принести тепло в холодную пустоту. Бесчисленными миллиардами лет этот ослепительный луч собирал свою неизмеримую энергию, и однажды расцвёл в разрушительном взрыве сверхновой звезды. Из этого огня появились новые лучи, звёздные потомки своего родителя, что устремились в океан тьмы и стали созвездиями. Со временем и они стали сверхновыми, пробуждая новый свет. Так продолжался цикл рождения и перерождения — пока не стало мерцать и сиять всё небо, созданное тяжёлым трудом Титанов. Из этой кузницы и явилась в мир сущий одно особенное для простых смертных светило. Его, как и многих предков, извергли в безграничный космос, дабы оно нашло своё место среди небесных братьев и сестёр. Но птенца захватил интерес к тому, что гаснущие предки согревали во тьме, и в течение многих лет он познавал мир. Он узнал, что среди целых и разрушенных миров скоро образуется замкнутый центр, где всевозможные силы сойдутся в противостоянии, несущем вселенское значение. И узнал, что в той битве потребуется нечто большее, чем далёкие лучи умирающего солнца. И потому звёздное дитя приняло земную форму, чтобы в путешествиях нести тепло всем нуждающимся и, возможно, исполнить свою звёздную судьбу.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1,5% к урону от макс. здоровья у Sun Ray",
      "talentRight": "+3 к атакам для уничтожения Supernova"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+0,5 сек. оглушения от Supernova",
      "talentRight": "+1000 к дальности Icarus Dive"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+500 к здоровью",
      "talentRight": "+25 к урону в секунду от Fire Spirits"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+6% к урону от заклинаний",
      "talentRight": "+24% к замедлению от Icarus Dive"
    }
  ]
}