{"abilities":[{"effects":["Effect Radius: 1200","Dispel Radius: 1025","Fade Time: 0","Move Speed Bonus: 15%","Duration: 35"],"notes":["Interrupts the user's channeling spells and any other order upon using, with the exception of regular move orders.","Affected units can cast spells and use items while invisible without breaking it. However, attacking does break it.","When attacking, the invisibility is lost upon reaching the attack point, even when the attack misses.","Invisible units can pick up and drop items without breaking the invisibility.","True Sight cannot detect units affected by Smoke of Deceit.","Only units affected by Chronosphere, or units that have their unit model revealed by abilities such as Thirst or Track, can be seen in spite of being smoked. See shared vision for the full list of abilities that reveal unit models. Smoked units that become visible this way are still hidden from the mini-map.","Smoked units do not provide vision from shared vision abilities unless they also have their unit model revealed by a different shared vision ability that specifically reveals unit models.","Only affects player controlled units. Does not affect invulnerable and hidden allies. However, invulnerable and hidden enemy heroes dispel it.","The effect is only dispelled when approaching enemy heroes (including hero clones, excluding illusions) or towers.","Can be cast by the courier, but does not affect it."],"elements":["Ability No Target","Affects Allies"],"description":"Turns the caster and all allied player-controlled units in a 1200 radius invisible, and grants 15% bonus movement speed for 35 seconds. Attacking, or moving within 1025 range of an enemy hero or tower, will break the invisibility. Disguise grants invisibility that is immune to True Sight."}],"cost":"80","description":"The charlatan wizard Myrddin's only true contribution to the arcane arts.","tips":["Though it cannot be used for daring escapes or to gain the upper hand in the middle of combat, Smoke of Deceit plays a cunning role against a well-warded team. The added mobility makes it easy to set up surprise attacks or to slip behind enemies without being spotted. However, if a hero hidden with Smoke of Deceit comes too close to an enemy hero or building, the effect ends, meaning you should keep your distance. Smoke of Deceit is especially useful to get to Roshan undetected as many players ward the surrounding area.","Since True Sight cannot reveal units affected by Smoke of Deceit, it can be used to dodge certain abilities like Thundergod's Wrath and other spells which require vision in order to hit their targets. This also goes for disjointable projectiles. It is even possible to disjoint Assassinate. The True Sight applied by Assassinate is unable to reveal smoked units and therefore gets disjointed."],"attrs":["Active Disguise","Charges 1","Disassemble? No","Alert allies? Yes"],"info":["Smoke of Deceit starts with a stock count of 3 and is limited to a count of 3. It takes 600 seconds for 1 smoke to replenish in the stock.","Stacks with itself in the inventory, there is no stack limit. The sell value adapts based on the number of instances in a stack.","Smoke of Deceit is completely shareable."]}