{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/07\/Blink_Dagger_Blink_1.mp3\/revision\/latest?cb=20191227195354",
      "effects": [
        "Cast Range: Global",
        "Max Blink Distance: 1200",
        "Penalty Blink Distance: 960",
        "Damage Cooldown: 3"
      ],
      "notes": [
        "Disjoints projectiles upon cast.",
        "Does not blink for the full distance when targeting closer than the maximum distance.",
        "When point-targeted beyond the maximum blink distance, it blinks using the 960 range penalty distance, towards the targeted direction instead of maximum distance. ↓↓ Double-tapping automatically casts it on the team's fountain, blinking towards its direction using the penalty distance.",
        "↓↓ Double-tapping automatically casts it on the team's fountain, blinking towards its direction using the penalty distance.",
        "The second sound only plays when the blinked distance is greater than 960. It is audible to everyone.",
        "Player-based damage, regardless of factions, and Roshan-based damage greater than 0 (after reductions) puts the item on a 3 second cooldown. Does not get dispelled by self-damage sources and damage flagged as HP Removal. The damage cooldown always triggers, even if the item is dropped, if the item is in the backpack or before being purchased. The cooldown is unaffected by cooldown reduction. However, it is affected by cooldown resetting.",
        "Does not get dispelled by self-damage sources and damage flagged as HP Removal.",
        "The damage cooldown always triggers, even if the item is dropped, if the item is in the backpack or before being purchased.",
        "The cooldown is unaffected by cooldown reduction. However, it is affected by cooldown resetting.",
        "Shares cooldown with other Blink Dagger-based items. However, it does not share cooldown with Fallen Sky.",
        "However, it does not share cooldown with Fallen Sky."
      ],
      "mana": "0",
      "abilityName": "Blink",
      "cooldown": "15",
      "description": "Teleport to a target point up to 1200 units away. Blink Dagger cannot be used for 3 seconds after taking damage from an enemy hero or Roshan.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "2250",
  "lore": null,
  "consistFrom": null,
  "name": "Blink Dagger",
  "description": "The fabled dagger used by the fastest assassin ever to walk the lands.",
  "trivia": [
    "In the original DotA, this item was called Kelen's Dagger of Escape and changed to Kelen's Dagger because players used the item offensively, in reference to a Warcraft III item, Kelen's Dagger of Escape. Kelen was a well known rogue in the Warcraft universe, who was known for his ability to escape from any dangerous situation thanks to the help of his dagger.",
    "Kelen was a well known rogue in the Warcraft universe, who was known for his ability to escape from any dangerous situation thanks to the help of his dagger.",
    "Riki and Lion are the only heroes who are missing responses for acquiring a Blink Dagger.",
    "Axe's cosmetic item, Little Blink Dagger, is based on Blink Dagger."
  ],
  "upgradeIn": [
    "Overwhelming Blink",
    "Swift Blink",
    "Arcane Blink"
  ],
  "tips": [
    "Blink requires heroes to face the direction in which they are blinking. This means that heroes facing away from their blink destination will have to turn first, causing a slight delay depending on their turn rate.",
    "Hood of Defiance's barrier blocks damage over time, meaning that it will prevent items like Radiance from resetting Blink Dagger's cooldown.",
    "Use Blink to dodge incoming projectile-based abilities such as Storm Hammer or Spirit Lance, and from items like Rod of Atos.",
    "When Blink dagger go into cooldown upon taking damage on an escape, a quick self-cast with Eul's Scepter of Divinity will allow you to wait the short cooldown relatively safely and blink out the moment you land on the ground.",
    "Blink Dagger can turn into a very strong escape tool if you are affected by False Promise."
  ]
}