{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ad\/Io_Tether_1.mp3\/revision\/latest?cb=20191216014349",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Себя",
        "Урон: "
      ],
      "notes": [
        "Если Io попытается связаться с союзником на расстоянии в 700 единиц или больше, то его притянет к нему. Io притягивается со скоростью в 1000 единиц, пока не окажется на расстоянии в 300 от цели. Может затягивать Io на непроходимую территорию. После притягивания уничтожает все деревья в радиусе 150 от Io. Если Io разрывает связь во время притягивания, то оно мгновенно прервется. Притягивание прерывается, если на Io подействует оглушение, проклятие, исчезновение, страх, гипноз или оцепенение. Принудительное движение также отменяет притягивание, но при завершении движения, а не при применении. Провокация, привязка и безмолвие притягивание не прерывают. Если расстояние между Io и целью превысит 2150 во время притягивания, то Tether разорвется.",
        "Io притягивается со скоростью в 1000 единиц, пока не окажется на расстоянии в 300 от цели.",
        "Может затягивать Io на непроходимую территорию.",
        "После притягивания уничтожает все деревья в радиусе 150 от Io.",
        "Если Io разрывает связь во время притягивания, то оно мгновенно прервется.",
        "Притягивание прерывается, если на Io подействует оглушение, проклятие, исчезновение, страх, гипноз или оцепенение.",
        "Принудительное движение также отменяет притягивание, но при завершении движения, а не при применении.",
        "Провокация, привязка и безмолвие притягивание не прерывают.",
        "Если расстояние между Io и целью превысит 2150 во время притягивания, то Tether разорвется.",
        "Если расстояние между Io и целью превышает 1000, тот связь рвётся. Когда расстояние между Io и целью превышает 700, то визуально связь меняется.",
        "Когда расстояние между Io и целью превышает 700, то визуально связь меняется.",
        "Длительность Tether не ограничена. Она разорвется лишь в случае, если будет превышена дистанция прерывания, использована вспомогательная способность Break Tether, Io спрятали с помощью Dismember или если заклинатель или выбранная им цель умрет.",
        "Дополнительная скорость передвижения применяется только к союзнику, а скорость Io копирует скорость цели. То есть для Io устанавливается только базовая скорость передвижения и любые бонусы (фиксированные и процентные). Полностью перекрывает все фиксированные бонусы и фиксированные замедления на Io, например, от предметов или способностей. Не копирует скорость передвижения цели, если Io находится под ускорением. Во время связки Io не может превысить максимальную скорость передвижения, даже если это делает связанный союзник. Во время связки Io также не может превысить максимальную скорость передвижения при помощи предметов и способностей (например, Force Boots, Thirst).",
        "То есть для Io устанавливается только базовая скорость передвижения и любые бонусы (фиксированные и процентные).",
        "Полностью перекрывает все фиксированные бонусы и фиксированные замедления на Io, например, от предметов или способностей.",
        "Не копирует скорость передвижения цели, если Io находится под ускорением.",
        "Во время связки Io не может превысить максимальную скорость передвижения, даже если это делает связанный союзник. Во время связки Io также не может превысить максимальную скорость передвижения при помощи предметов и способностей (например, Force Boots, Thirst).",
        "Во время связки Io также не может превысить максимальную скорость передвижения при помощи предметов и способностей (например, Force Boots, Thirst).",
        "На привязанное существо действуют Overcharge, Relocate и регенерация и восстановление здоровья и маны, действующие на Io. Существа продолжают получать бонусы от всех эффектов в невидимом, спрятанном или неуязвимом состоянии. Восстановление здоровья и маны действует даже если здоровье или мана Io полные. Здоровье\/мана передаются после учитывания всех снижений\/усилений на Io.",
        "Существа продолжают получать бонусы от всех эффектов в невидимом, спрятанном или неуязвимом состоянии.",
        "Восстановление здоровья и маны действует даже если здоровье или мана Io полные.",
        "Здоровье\/мана передаются после учитывания всех снижений\/усилений на Io.",
        "Если Io связывается с невидимым существом, то враги увидят фальшивую связь, соединенную с последним известным расположением этого существа. Если связанное существо становится видимым для противника, то связь будет отображаться нормально.",
        "Замедление применяется к каждому врагу, который приблизился на расстояние в 55 единиц к связке. Оно применяется с каждым тиком сервера.",
        "Выбор увеличивающего скорость передвижения связанных существ таланта не обновит параметры уже существующей связи Tether.",
        "При выборе таланта «Атака вместе с целью Tether», Io совершает мгновенные атаки по каждому врагу, которого атакует связанный союзник. На мгновенные атаки Io могут сработать любые модификаторы атаки. У этих атак нет эффекта True Strike. Атака совершается в тот момент, когда союзник запускает свою (включая мгновенные атаки). Неважно, попала ли атака или нет. Если Io оглушен или обезоружен, то мгновенные атаки не происходят. Не атакует, если у связанной цели также есть этот талант (т.е. цель - иллюзия Io).",
        "На мгновенные атаки Io могут сработать любые модификаторы атаки. У этих атак нет эффекта True Strike.",
        "Атака совершается в тот момент, когда союзник запускает свою (включая мгновенные атаки). Неважно, попала ли атака или нет.",
        "Если Io оглушен или обезоружен, то мгновенные атаки не происходят.",
        "Не атакует, если у связанной цели также есть этот талант (т.е. цель - иллюзия Io).",
        "С Aghanim's Shard Tether пассивно даёт бонус к вампиризму заклинаний и также даёт связанной цели весь вампиризм заклинаний Io. Сочетается аддитивно с другими источниками вампиризма заклинаний. Исцеляет на 2% при атаке не-героев. Считает крипов-героев за крипов и не получает лечения от иллюзий. Источником переданного вампиризма заклинаний все еще считается Io, а не связанный союзник.",
        "Сочетается аддитивно с другими источниками вампиризма заклинаний.",
        "Исцеляет на 2% при атаке не-героев. Считает крипов-героев за крипов и не получает лечения от иллюзий.",
        "Источником переданного вампиризма заклинаний все еще считается Io, а не связанный союзник."
      ],
      "mana": "12",
      "item_behaviour": [],
      "name": "Tether",
      "cooldown": "40",
      "description": "Связывает героя с союзным существом, увеличивая скорость передвижения обоих. Когда владелец способности восстанавливает здоровье или ману, их в приумноженном количестве получает и привязанное существо. Связь разорвётся, если отменить способность вручную или если расстояние до цели окажется слишком большим.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 1600",
        "Дистанция разрыва: 1000",
        "Дистанция притягивания: 700",
        "Дистанция прерывания связи при притягивании: 2150",
        "Множитель восстановления: 60%\/80%\/100%\/120%",
        "Доп. скорость передвижения: 6%\/8%\/10%\/12% ( 12%\/14%\/16%\/18%)",
        "Замедление скорости передвижения врага: 15%\/25%\/35%\/45% ( 30%\/40%\/50%\/60%)",
        "Замедление скорости атаки врага: 15\/25\/35\/45 ( 30\/40\/50\/60)",
        "Длительность замедления: 0,2",
        "Бонус к урону от атаки: 15",
        "Бонус к здоровью: 400",
        "Пассивный бонус к вампиризму заклинаниями: 10%"
      ],
      "legacy_key": "T",
      "story": "Великодушное прикосновение предвечного наполняет межпространственной силой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/48\/Break_Tether.mp3\/revision\/latest?cb=20140525161243",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "notes": [
        "Заменяет Tether, пока Io связан.",
        "При использовании прерывает произносимые заклинания Io.",
        "Уходит на 0,25-секундную перезарядку при использовании Tether, поэтому связь нельзя разорвать мгновенно."
      ],
      "mana": "1",
      "item_behaviour": [],
      "name": "Break Tether",
      "cooldown": "0",
      "description": "Разрывает связь.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Начальная перезарядка: 0,25"
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Io_Spirits_1.mp3\/revision\/latest?cb=20191216014346",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания Io.",
        "При применении заклинание заменяется вспомогательным, позволяющим приближать или отдалять духов.",
        "Призывает духов с интервалом в 1 сек., начиная немедленно после начала применения. Призыв всех 5 духов занимает 5 сек. Первый дух появляется на севере от Io, следующие позади предыдущего. Духи автоматически появляются на максимальной дистанции. Духи всегда крутятся по часовой стрелке и следуют за расположением Io. Приближение или отдаление духов не разрушает их порядок расположения. Они всегда движутся по кругу и сохраняют равное расстояние между собой.",
        "Первый дух появляется на севере от Io, следующие позади предыдущего.",
        "Духи автоматически появляются на максимальной дистанции.",
        "Духи всегда крутятся по часовой стрелке и следуют за расположением Io.",
        "Приближение или отдаление духов не разрушает их порядок расположения. Они всегда движутся по кругу и сохраняют равное расстояние между собой.",
        "Духи проходят весь круг за 2,7 секунды независимо от дистанции от Io. Их угловая скорость постоянна, поэтому они будут ускоряться при отдалении от заклинателя. То есть первый созданный дух может облететь Io 0 раз.",
        "Их угловая скорость постоянна, поэтому они будут ускоряться при отдалении от заклинателя.",
        "То есть первый созданный дух может облететь Io 0 раз.",
        "Если не-геройское существо или иллюзия оказывается в пределах 150 радиуса столкновения духов, то оно получает урон от столкновения. Герои и дух-медведь не получают урона от столкновения.",
        "Герои и дух-медведь не получают урона от столкновения.",
        "Если герой или крип-герой оказывается в радиусе 110 столкновения духов, то дух взрывается, нанося урон и замедляя противников в радиусе 360 единиц. Урон от взрыва и замедление действуют на всех противников, не только на героев. Взрыв сначала наносит урон, затем накладывает замедление.",
        "Урон от взрыва и замедление действуют на всех противников, не только на героев.",
        "Взрыв сначала наносит урон, затем накладывает замедление.",
        "Духи не сталкиваются с и не взрываются от спрятанных или неуязвимых героев, но полностью действуют на невидимых героев.",
        "Оставшиеся духи одновременно взорвутся при истечении длительности или при повторном использовании, нанося урон от взрыва.",
        "Духи дают летающий обзор на 3 секунды в радиусе 150 единиц при столкновении с героем. Они не дают обзор, если взорвались из-за истечения длительности или повторного применения.",
        "Они не дают обзор, если взорвались из-за истечения длительности или повторного применения.",
        "Духи не видны врагам, если сам Io находится в невидимости.",
        "Может нанести до 150\/250\/350\/450 (TagTalent 425\/525\/625\/725) единиц урона одному существу, если все духи взорвутся у цели (до уменьшений).",
        "Приобретение Aghanim's Scepter убирает необходимость применения Spirits, постоянно призывая духов вокруг Io. Подспособности Spirits In и Spirits Out становятся всегда доступными При получении Aghanim's Scepter с духами от применения способности последние исчезают без взрыва. При потере Aghanim's Scepter появившиеся духи не исчезают без взрыва.",
        "Подспособности Spirits In и Spirits Out становятся всегда доступными",
        "При получении Aghanim's Scepter с духами от применения способности последние исчезают без взрыва.",
        "При потере Aghanim's Scepter появившиеся духи не исчезают без взрыва."
      ],
      "mana": "26\/24\/22\/20",
      "item_behaviour": [],
      "name": "Spirits",
      "cooldown": "100\/110\/120\/130",
      "description": "Призывает пять духов, которые кружатся вокруг героя. При столкновении с вражеским героем дух взрывается, нанося урон всем существам в области вокруг взрыва. При столкновении с крипом дух наносит немного урона, но не взрывается. По окончании действия способности взрываются все оставшиеся духи.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Радиус столкновения для не-героев: 150",
        "Радиус столкновения для героев: 110",
        "Радиус взрыва: 360",
        "Число духов: 5",
        "Урон при столкновении: 10\/15\/20\/25",
        "Урон при взрыве: 30\/50\/70\/90 ( 85\/105\/125\/145)",
        "Длительность: 19 ( Постоянная)",
        "Замедление скорости передвижения при взрыве: 15%",
        "Длительность замедления: 0,3"
      ],
      "legacy_key": "W",
      "story": "Своей невообразимой силой предвечный раскручивает частицы вселенной."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/80\/Io_Overcharge.mp3\/revision\/latest?cb=20191216014342",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Союзников"
      ],
      "notes": [
        "Прерывает произносимые заклинания Io.",
        "Накладывает общее усиление исходящего урона на Io и связанного с ним союзника. Сочетается аддиктивно с другими источниками общего усиления исходящего урона. Усиление работает только на урон от заклинаний Io и связанного с ним союзника, если он не отмечен в как отнимающий здоровье. Урон от атаки не усиляется.",
        "Усиление работает только на урон от заклинаний Io и связанного с ним союзника, если он не отмечен в как отнимающий здоровье. Урон от атаки не усиляется.",
        "Эффект Overcharge действует на союзника даже если Io свяжется с ним после активации заклинания. Длительность Overcharge на союзника не отображается и эффект появляется как постоянный бафф.",
        "Длительность Overcharge на союзника не отображается и эффект появляется как постоянный бафф.",
        "Может восстановить до 4%\/4,8%\/5,6%\/6,4% от максимального здоровья Io за всю длительность.",
        "Может восстановить связанному союзнику до 4%\/4,8%\/5,6%\/6,4% от его максимального здоровья + 2,4%\/3,84%\/5,6%\/7,68% от максимального здоровья Io за всю длительность. Увеличивающий восстановление от макс. здоровья талант не обновит значения для уже существующей связи Tether. С этим талантом может восстановить связанному союзнику 5,6%\/6,4%\/7,2%\/8% от его максимального здоровья + 3,36%\/5,12%\/7,2%\/9,6% от максимального здоровья Io.",
        "Увеличивающий восстановление от макс. здоровья талант не обновит значения для уже существующей связи Tether.",
        "С этим талантом может восстановить связанному союзнику 5,6%\/6,4%\/7,2%\/8% от его максимального здоровья + 3,36%\/5,12%\/7,2%\/9,6% от максимального здоровья Io."
      ],
      "mana": "25\/22\/19\/16",
      "item_behaviour": [],
      "name": "Overcharge",
      "cooldown": "40\/60\/80\/100",
      "description": "Герой повышает свою скорость атаки, наносит увеличенный урон от заклинаний и получает дополнительное восстановление здоровья, зависящее от своего максимального здоровья. Связанное с владельцем способности существо также получает эти бонусы.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость атаки: 35\/60\/85\/110",
        "Восстановление от макс. здоровья: 0,5%\/0,6%\/0,7%\/0,8% ( 0,7%\/0,8%\/0,9%\/1%)",
        "Доп. урон от заклинаний: 8%\/10%\/12%\/14% ( 18%\/20%\/22%\/24%)",
        "Длительность: 8"
      ],
      "legacy_key": "V",
      "story": "Привлекая энергию мироздания из всех миров, предвечный начинает расплетать время."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Переключаемая"
      ],
      "notes": [
        "Эта способность спрятана, если Io не имеет баффа от духов.",
        "Не прерывает прерываемые способности Io при применении.",
        "Двигает духов ближе к Io со скоростью 250. Приближение при максимальном отдалении занимает 1,8 сек.",
        "С Aghanim's Scepter подспособность становится всегда доступной."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Spirits In",
      "cooldown": "0",
      "description": "Приближает духов к герою. Повторное применение остановит приближение.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Минимальная дистанция: 200"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Переключаемая"
      ],
      "notes": [
        "Эта способность спрятана, если Io не имеет баффа от духов.",
        "Не прерывает прерываемые способности Io при применении.",
        "Двигает духов дальше от Io со скоростью 250. Отдаление при минимальном отдалении занимает 1,8 сек.",
        "С Aghanim's Scepter подспособность становится всегда доступной."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Spirits Out",
      "cooldown": null,
      "description": "Отдаляет духов от героя. Повторное применение остановит отдаление.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0",
        "Максимальная дистанция: 650"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Io_Relocate_1.mp3\/revision\/latest?cb=20191216014343",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя \/ "
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически отправит героя к своему фонтану.",
        "Если при применении Io будет оглушен, проклят или на него подействует сон или ураган, то Relocate отменится. Если на Io действует безмолвие, но телепортация не произойдет, если оно не исчезнет до конца задержки. Обезвреживание связанного союзника Io не прервет телепортацию, если применение успешно завершено. Возвращение нельзя прервать.",
        "Если на Io действует безмолвие, но телепортация не произойдет, если оно не исчезнет до конца задержки.",
        "Обезвреживание связанного союзника Io не прервет телепортацию, если применение успешно завершено.",
        "Возвращение нельзя прервать.",
        "Враги видят во время задержки ‼ Сообщение на мини-карте, показывающий выбранную точку для телепортации. Создает визуальный эффект в выбранной точке во время задержки телепортации, видный всем. Создает визуальный эффект на позиции Io до телепортации, который также виден всем.",
        "Создает визуальный эффект в выбранной точке во время задержки телепортации, видный всем.",
        "Создает визуальный эффект на позиции Io до телепортации, который также виден всем.",
        "Relocate прерывает произносимые заклинания и текущие приказы Io и связанного союзника как при телепортации, так и при возвращении.",
        "При телепортации в выбранную точку позволяет Io избежать снаряды, но не позволяет их избежать при возвращении. Союзник не избегает снаряды.",
        "Союзник не избегает снаряды.",
        "Io может разорвать связь в любой момент, чтобы предотвратить возвращение героя вместе с ним.",
        "Может телепортировать только героев, клонов, иллюзии и крипов-героев.",
        "Телепортирует неуязвимые и спрятанные цели.",
        "При телепортации разрушает деревья в радиусе 150 единиц."
      ],
      "mana": "100\/90\/80 (TagTalent 75\/65\/55)",
      "item_behaviour": [],
      "name": "Relocate",
      "cooldown": "175",
      "description": "Телепортирует героя и связанного с ним союзника в любую точку карты. Спустя некоторое время герой вернётся туда, откуда он телепортировался, также перенеся связанного с собой союзника. Двойное нажатие отправит героя к своему фонтану.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0,53",
        "Дальность применения: Глобальная",
        "Время применения: 3,5\/3,25\/3",
        "Длительность: 12"
      ],
      "legacy_key": "R",
      "story": "Ио есть воплощение тайн вселенной."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 17.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.6,
    "attrAgility": 14.0
  },
  "description": "Связывается с союзниками, чтобы усилить их Io мастерски повышает эффективность союзников. Связав себя с кем-нибудь из них, он ускоряет свою цель, а враги между ним и его товарищем замедляются. Способность телепортироваться вместе с союзником может многократно увеличить потенциал и без того смертоносного героя.  Поддержка Побег Быстрый урон ★★★",
  "history": "Ио — непостижимое проявление жизненной силы, присутствующее везде и во всём, и для врагов оно оказывается великим разрушителем, а для учёных мужей — блеском божественного ока. Сущность эта находится одновременно на всех уровнях бытия, а её малейшие частицы воплощаются в физическом мире в каждое отдельно взятое мгновение. Подобно великим всадникам-близнецам, Тьме и Свету, а также древнему путнику, чьё истинное происхождение затеряно в веках, — это предвечная сущность вселенной, сила старше самого времени, пришелец из миров за гранью понимания смертных. Ио есть совокупность всех материальных сил притяжения и отторжения, разумное проявление связующей реальность энергии. Присутствие его в материальном мире осязается лишь в контролируемых искривлениях векторов этих сил. Сущность эта по своей природе благожелательна, и передаёт свой непостижимый магнетизм союзникам, делая их сильнее и выносливее. Что движет этой невообразимой силой — неведомо, а её движение по физическому миру — прекрасное напоминание, что вселенная полна загадок и тайн."
}