{"abilities":[{"spell":"Places a frozen hex on an enemy unit that deals damage over time, but can be dispelled by moving away from the initial cast point. If the enemy unit doesn't move out of the given range, it will be stunned and frozen in place after 4 seconds.","effects":["Ability Target Unit ( Target Area)","Affects Enemies","Damage Magical"],"notes":["Cold Feet places an initial debuff on the target and places an icy marker at its current position upon cast.","As long as the target stays within 740 radius of the mark, it takes damage from the debuff and after 4 seconds it is stunned.","If the target moves 740 range away from the mark at any point during the initial debuff, the spell completely stops, removing the debuff and the marker. This means even when the target moves back within range, it is not frozen or damaged further.","When cast on units which already have the Cold Feet modifier, nothing happens.","Deals damage in 1 second intervals, starting immediately upon cast, resulting in 4 instances.","The stun is applied 1 second after the last instance.","Can deal up to 120\/200\/280\/360 damage to the target (before reductions).","The talent turns Cold Feet into an area-targeted spell, so that it cannot directly target units anymore. The break distances are individual for each hit enemy. They do not share it. Can target invisible enemies and enemies inside the fog of war."],"mana":"125","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"10\/9\/8\/7","name":"Cold Feet","description":["Cast Animation: 0.01+0","Cast Range: 700\/800\/900\/1000","Effect Radius: 0 ( 700)","Break Distance: 740","Damage per Tick: 30\/50\/70\/90","Damage Duration: 4","Stun Duration: 2\/2.5\/3\/3.5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Creates a vortex of icy energy that slows movement speed and increases magic damage done in its range.","effects":["Ability Target Area","Affects Enemies \/ Self"],"notes":["All effects are provided by an aura. The modifier lingers for 0.5 seconds.","Reduces most heroes' total magic resistance to 14%\/10%\/6%\/2% ( 8%\/4%\/0%\/-4%), assuming basic 25% magic resistance and no other sources of magic resistance.","Successive casts of Ice Vortex do not stack. A unit can only be affected by one of them even when multiple of them are overlapping.","Provides 200 radius ground vision at the targeted point for its duration.","Choosing the cooldown reducing talent does not affect the ability's currently running cooldown.","Choosing the slow and resistance reduction increasing talent immediately upgrades all of Ancient Apparition's currently active Ice Vortexes, including already placed debuffs."],"mana":"40\/60\/80\/100","elements":["Does not pierce spell immunity."],"cooldown":"4 ( 1.5)","name":"Ice Vortex","description":["Cast Animation: 0.01+0","Cast Range: 1500","Effect Radius: 275","Move Speed Slow: 15%\/20%\/25%\/30% ( 23%\/28%\/33%\/38%)","Magic Resistance Reduction: 15%\/20%\/25%\/30% ( 23%\/28%\/33%\/38%)","Aura Linger Duration: 0.5","Duration: 16"],"hot_key":"W","legacy_key":"E"},{"spell":"Enhances your attacks with heavy magic damage and slow. Grants increased range for this attack.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Magical"],"notes":["The cast range equals the caster's attack range + the bonus range. For Ancient Apparition, the range is 735\/795\/855\/915.","The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.","The debuffs from successive casts fully stack, with each instance creating its own debuff.","The attacks first apply the debuff, then their own damage."],"mana":"30\/50\/70\/90","elements":["Can be disjointed.","Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"15\/11\/7\/3","name":"Chilling Touch","description":["Cast Animation: 0.01+0","Attack Range Buffer: 60\/120\/180\/240","Damage: 50\/90\/130\/170 ( 130\/170\/210\/250)","Movement Speed Slow: 100%","Slow Duration: 0.5"],"hot_key":"E","legacy_key":"G"},{"spell":"Launches a tracer towards any location of the battlefield, which must be triggered again to mark the area to be blasted by a damaging explosion of hail. The further the tracer travels, the larger the explosion will be. Enemies caught in the explosion, or who touched the icy ball of hail as it travels, are frostbitten, taking damage and prevented from regenerating or healing. If a frostbitten unit's health drops below a certain percentage, they will instantly shatter.","effects":["Ability Target Point","Affects Enemies \/ Enemy Heroes","Damage Magical (HP Removal)"],"notes":["Upon cast, Ice Blast is replaced by the sub-skill Release.","The tracer projectile travels at a speed of 1500 until Release is cast, Ancient Apparition dies, or it reaches the map boundaries.","The tracer is visible to allies only. The initial cast sound is also only audible to allies.","The tracer projectile itself is harmless. It neither deals damage, nor places the debuff.","The explosion radius starts at 275 and increases by 50 for every second the tracer has traveled, capped at 1000 radius. Thus, it takes at least 15 seconds to reach the maximum radius, equaling 22500 units traveled.","The tracer provides 500 radius flying vision around itself as it travels. This vision does not last.","The debuff is only placed on heroes, clones and creep-heroes, but not on illusions.","The debuff can also be placed on spell immune or invulnerable, but not on hidden units.","Unlike the debuff, the explosion damage hits all enemy units, including creeps, excluding buildings and wards.","The debuff prevents the current health of affected units to increase in any way. The only exceptions are Sunder, Decay, Time Lapse, Morph Replicate, Supernova and Whirling Death.","Units with the debuff on die instantly when their health drops below the threshold. The kill is credited to the source of the damage which brought them below the threshold. The debuff checks the unit's health upon taking damage, excluding the damage flagged by HP removal. However, if it was caused by self-inflicted damage, Ancient Apparition is credited for the kill.","Min health prevents affected units from dying to the shatter for its duration. Invulnerable units cannot shatter.","The debuff deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 10\/11\/12 ( 17) instances.","The debuff itself can deal up to 125\/220\/384 ( 212.5\/340\/544) damage (before reductions).","Together with the explosion, Ice Blast can deal up to 375\/570\/834 ( 462.5\/690\/994) damage (before reductions)."],"mana":"150","elements":["Partially pierces spell immunity."],"cooldown":"40","name":"Ice Blast","description":["Cast Animation: 0.01+1.07","Cast Range: Global","Projectile Radius: 275","Min Explosion Radius: 275","Max Explosion Radius: 1000","Explosion Damage: 250\/350\/450","Damage per Second: 12.5\/20\/32","Percentage Health Kill Threshold: 10%\/11%\/12% ( 15%\/16%\/17%)","Duration: 10\/11\/12 ( 17)"],"hot_key":"R","legacy_key":"T"},{"spell":"Releases the ice blast to explode at the tracer's current location.","effects":["Ability No Target"],"notes":["Replaces Ice Blast until the sub-spell is cast or the tracer disappears.","Upon cast, the tracer stops travelling and marks the total area hit by the explosion once the icy ball of hail reaches its position.","It also provides 650 radius flying vision at that position for 4 seconds.","The icy ball of hail travels at a speed of 750, or reaches the targeted point 2 seconds after launch, whichever is faster.","The icy ball is only released when Release is cast, or when Ancient Apparition dies while the tracer is still travelling.","It is not released when the tracer reaches the map boundary. In this case, the spell is wasted.","Every enemy unit which comes within 275 radius of the icy ball as it travels, or is hit by the explosion gets the Frostbitten debuff. The debuff starts expiring only once outside of range of the icy ball. Getting within range again immediately refreshes the duration.","The icy ball is fully visible to enemies. But unlike the tracer, it is not visible on the minimap.","The icy ball provides 500 radius flying vision as it travels, which lasts for 3 seconds."],"mana":"0","elements":["Does not proc any on-cast effects when cast."],"cooldown":"1","name":"Release","description":["Cast Animation: 0.01+1.1"],"hot_key":"R","legacy_key":"T"}],"bio":"Kaldr, the Ancient Apparition, is an image projected from outside time. He springs from the cold, infinite void that both predates the universe and awaits its end. Kaldr is, Kaldr was, Kaldr shall be… and what we perceive, powerful as it appears to us, is but the faintest faded echo of the true, eternal Kaldr. Some believe that as the cosmos ages and approaches its final moments, the brightness and power of Kaldr will also intensify—that the Ancient Apparition will grow younger and stronger as eternity's end draws nigh. His grip of ice will bring all matter to a stop, his image will cast a light too terrible to behold. An Apparition no longer!","talentsTips":["Gold granted from the talent is unreliable gold."],"trivia":["Kaldr's lore suggests that he is the embodiment of the Heat Death, a theoretical fate of the universe. According to this theory, the universe will achieve thermodynamic equilibrium and will no longer transfer energy. This would result in a universal temperature growing colder and a cessation of processes that require energy consumption, such as life.","\"Kaldr\" is old norse and translates to \"cold\" in English.","In DotA, Ancient Apparition is one of several heroes with custom models. It utilizes a custom model called \"IcyGhost\", created in 2006 by the pseudonymous content creator PrMosquito, from the Hive Workshop community. The Dota 2 counterpart is modeled after the original design."],"talents":["+5% Ice Blast Kill Threshold:700 AoE Cold Feet","+80 Chilling Touch Damage:+8% Ice Vortex Slow\/Resistance","+20 Health Regen:-2.5s Ice Vortex Cooldown","+10% Spell Amplification:+90 Gold\/Min"],"desc":"Ancient Apparition 20 + 1.9 20 + 2.2 23 + 3.4 Level Base 1 15 25 Health 200 600 1120 1500 Health regen 0 2 4.66 6.56 Magic res. 25% 26.2% 27.8% 28.94% Mana 75 351 915 1323 Mana regen 0 1.15 3.53 5.23 Spell dmg 0% 1.61% 4.94% 7.32% Armor -1 2.2 7.13 10.65 Att\/sec 0.59 0.71 0.89 1.02 Move sp amp. 0% 1% 2.54% 3.64% Damage 21‒31 44‒54 91‒101 125‒135 Movement speed 290 Attack speed 100 Turn rate 0.6 Vision range 1800\/800 Attack range 675 Projectile speed 1250 Attack animation 0.45+0.3 Base attack time 1.7 Collision size 24 Legs 2  Gib type Ice"}