{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/44\/Observer_Ward_Plant.mp3\/revision\/latest?cb=20191227195516",
      "effects": [
        "Ability Target Area"
      ],
      "notes": [
        "Provides 1400 radius ground vision at its location.",
        "Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit.",
        "It is not possible to give couriers or Spirit Bear an Observer Ward by holding Control.",
        "Creep spawn ranges are shown before placing a ward, allowing camps to be blocked.",
        "The radiuses of already placed Observer Wards is shown as well, allowing to see how they overlap.",
        "While having the ward selected, multiple indicators appear on the world and minimap. The targeting courser depicts the ward, with a green circle around it. The circle shows its vision range. The minimap shows a yellow area, depecting how much the ward would reveal when placed at that point. The yellow markings consider trees and terrain height around the area.",
        "The targeting courser depicts the ward, with a green circle around it. The circle shows its vision range.",
        "The minimap shows a yellow area, depecting how much the ward would reveal when placed at that point.",
        "The yellow markings consider trees and terrain height around the area.",
        "The Ward's gold bounty increases by 1 every 15 seconds, and the experience by 1 every 10 seconds.",
        "Illusions and creep-heroes are treated as creeps when attacking the ward, so they take 8 attacks to destroy it, instead of 2 like heroes."
      ],
      "mana": "0",
      "abilityName": "Plant",
      "cooldown": "1",
      "description": "Plants an Observer Ward, an invisible watcher that gives ground vision in a 1400 radius to your team. Lasts 6 minutes. Hold Control to give one Observer Ward to an allied hero.",
      "params": [
        "Cast Range: 500",
        "Vision Radius: 1400",
        "Hero Attacks to Destroy: 2",
        "Non-Hero Attacks to Destroy: 8",
        "Gold Bounty Growth per Minute: 4",
        "Experience Growth per Minute: 6",
        "Duration: 360"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "The ability and modifier are not displayed in-game."
      ],
      "mana": null,
      "abilityName": "Invisibility",
      "cooldown": null,
      "description": "This unit is permanently invisible.",
      "params": [
        "Fade Time: 0"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Stacks with itself and with Sentry Wards in the inventory, there is no stack limit. The sell value adapts based on the number of instances in a stack. Wards from multiple players are combined when given by allies.",
    "Wards from multiple players are combined when given by allies.",
    "Observer Wards are completely shareable.",
    "Observer Wards do not provide True Sight.",
    "Killing an Observer Ward prints out a chat notification to allies.",
    "The Observer Ward's gold bounty is granted to the player that provided the True Sight. In case of Gem of True Sight and Sentry Wards, it is granted to the player who bought them. If the gem or Sentry Wards were stolen from the enemy, it is granted to the player that wields the stolen gem, or planted the stolen Sentry Wards. In case of a level 3 Necronomicon Warrior, it is granted to the current owner of the unit. In case of Lightning Bolt, Thundergod's Wrath, and Rocket Flare, the caster of the spell gets the credits. In case of Chronosphere, Kinetic Field, and Aether Remnant, the player that kills the ward gets the credits instead.",
    "In case of Gem of True Sight and Sentry Wards, it is granted to the player who bought them.",
    "If the gem or Sentry Wards were stolen from the enemy, it is granted to the player that wields the stolen gem, or planted the stolen Sentry Wards.",
    "In case of a level 3 Necronomicon Warrior, it is granted to the current owner of the unit.",
    "In case of Lightning Bolt, Thundergod's Wrath, and Rocket Flare, the caster of the spell gets the credits.",
    "In case of Chronosphere, Kinetic Field, and Aether Remnant, the player that kills the ward gets the credits instead.",
    "Melee units have an extra 150 attack range when attacking Observer Wards.",
    "Observer Wards can be attacked by the player who bought them at any time, regardless of deny range. Observer Wards receive 10 damage when it has over 50 health.",
    "Observer Wards receive 10 damage when it has over 50 health."
  ],
  "cost": "0",
  "lore": [
    "Knowing how to craft a ward is an important skill for artificers of magical goods. Rylai showed great talent at crafting wards, and once considered becoming an artificer.",
    "Despite this, the flavor text for this item refers to Observer Wards as plants and states that they are \"often cultivated by apprentice wizards.\" This implies that they are grown as opposed to crafted, directly contradicting the White Sentry's description."
  ],
  "consistFrom": null,
  "boughtFrom": "Consumables",
  "name": "Observer Ward",
  "description": "A form of half-sentient plant, often cultivated by apprentice wizards.",
  "trivia": null,
  "upgradeIn": [
    "Observer and Sentry Wards"
  ],
  "bonuses": null,
  "tips": [
    "Essential to victory, Observer Wards allow you to keep watch over areas and spy on your enemies while keeping you and other heroes safe. It is important to keep wards up in key locations, and destroy enemy wards.",
    "Observer Wards are considered essential to map control, providing vision for runes, watching out for ganks, and blocking neutral creeps from spawning in the jungle.",
    "Although it is common for the support to purchase wards, mid and offlaners can purchase them to set up ganks or block the enemy team's safe lane jungle camp respectively."
  ]
}