{
  "abilities": [
    {
      "notes": [
        "Талант на \/ \/ все атрибуты в общем даёт Spectre: 100 здоровья, 0,5 усиления восстановления здоровья, 0,83 брони, 5 скорости атаки, 60 маны, 0,25 восстановления маны и 5 урона от атаки.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+5% к отражающему урону у Dispersion",
          "talentRight": "+32% к урону иллюзий от Haunt"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+14% к замедлению и ускорению от Spectral Dagger",
          "talentRight": "+400 к здоровью"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+100 урона от Spectral Dagger",
          "talentRight": "+12 к урону от Desolate"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+5 ко всем атрибутам",
          "talentRight": "−4 сек. перезарядки Spectral Dagger"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Spectre_Spectral_Dagger_1.mp3\/revision\/latest?cb=20191216024330",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Spectral Dagger летит со скоростью 800 единиц.",
        "Может напрямую выбирать героев и крипов-героев. При выборе героя кинжал будет следовать за целью, пока её не достигнет.",
        "При выборе точки на земле или крипа-героя кинжал летит по прямой на расстояние 1800 единиц. Он не следует за крипом-героем.",
        "Каждое вражеское существо, попавшее в радиус 125 от летящего кинжала, получает урон.",
        "Поражает вражеских героев и иллюзии, также накладывая дебафф «Dagger Path Creator», создающий за ними след из тени как и обычный кинжал. Этот дебафф также дает общий обзор на вражеских героев, подсвечивая их силуэт, пока они невидимы.",
        "Этот дебафф также дает общий обзор на вражеских героев, подсвечивая их силуэт, пока они невидимы.",
        "Spectre и враги при нахождении на следе получают модификатор «След от Spectral Dagger», увеличивая её и снижая их скорость передвижения. Модификатор задерживается на 4 сек. после ухода с тени. Модификатор обновляется только от изначального источника. То есть Spectre не замедлится от Spectral Dagger, примененной врагом, при наличии модификатора баффа.",
        "Модификатор задерживается на 4 сек. после ухода с тени.",
        "Модификатор обновляется только от изначального источника. То есть Spectre не замедлится от Spectral Dagger, примененной врагом, при наличии модификатора баффа.",
        "Также Spectre получает скрытый бафф, позволяющий ей перемещаться по непроходимой территории. Бафф задерживается на 1 сек. после ухода со следа.",
        "Бафф задерживается на 1 сек. после ухода со следа.",
        "Части теневого следа длятся 12 сек., начиная с момента, когда они были созданы, а не когда была использована способность.",
        "След дает летающий обзор в радиусе 200 единиц вокруг себя."
      ],
      "mana": "130\/140\/150\/160",
      "hotKey": "Q",
      "cooldown": "22\/20\/18\/16 (TagTalent -78\/-80\/-82\/-84)",
      "description": "Герой бросает кинжал, наносящий урон и оставляющий теневой след, который замедляет всех врагов. Враги, поражённые кинжалом, также будут оставлять за собой след. Двигаясь по нему, владелец способности преодолевает любые препятствия.",
      "spellName": "Spectral Dagger",
      "params": [
        "Анимация применения: 0,3+0,37",
        "Дальность применения: 1800",
        "Радиус: 125",
        "Урон: 75\/130\/185\/240",
        "Замедление\/доп. скорость передвижения: 10%\/14%\/18%\/22% (TagTalent 24%\/28%\/32%\/36%)",
        "Длительность следа: 12",
        "Длительность источника следа: 7",
        "Задержка замедления\/ускорения скорости передвижения: 4",
        "Задержка беспрепятственного движения: 1",
        "Может выбрать целью врагов с иммунитетом к заклинаниям, закрепляя за ними след и накладывая дебафф замедления. Дебафф замедления неактивен во время действия иммунитета.",
        "Срабатывает только в случае, если вторичная цель - герой, выбранный напрямую. При этом Spectral Dagger мгновенно стремится применить к ней дебафф, запуская перезарядку Linken's Sphere. Не взаимодействует с основной целью или при поражении цели при применении на землю."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/35\/Spectre_Desolate.mp3\/revision\/latest?cb=20210103161358",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Эффекты Desolate применяются после завершения атаки независимо от её попадания. То есть Desolate применяется, даже если изначальная атака промахнулась. При использовании героями дальнего боя эффект применяется при запуске снаряда, а не при его попадании.",
        "То есть Desolate применяется, даже если изначальная атака промахнулась.",
        "При использовании героями дальнего боя эффект применяется при запуске снаряда, а не при его попадании.",
        "Дополнительный урон наносится отдельным источником урона и считается за урон заклинаний. То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки. Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на него не действует и он не учитывается любыми эффектами, влияющими на урон от атаки.",
        "Также на него действует усиление урона заклинаний и вампиризм заклинаний.",
        "Действует на любых вражеских существ, исключая варды и постройки.",
        "Desolate игнорирует наличие рядом вардов, строений, неуязвимых или спрятанных существ. То есть Desolate продолжит наносить урон, пока рядом с целью находятся только вышеперечисленные союзные существа.",
        "То есть Desolate продолжит наносить урон, пока рядом с целью находятся только вышеперечисленные союзные существа.",
        "Проверяет наличие только союзных для цели существ, поэтому ближайшие нейтральные крипы не предотвращают нанесение урона существам вражеской команды и наоборот."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Каждая атака наносит дополнительный урон, если в радиусе 425 от жертвы нет её союзников.",
      "spellName": "Desolate",
      "params": [
        "Радиус: 425",
        "Доп. урон: 15\/30\/45\/60 (TagTalent 27\/42\/57\/72)"
      ],
      "itemBehaviour": [],
      "legacyKey": "L",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная (TagAghanim Направленная на существо)",
        "Действует на Себя \/ Врагов",
        "Урон Отнимающий здоровье"
      ],
      "notes": [
        "Дает Spectre снижение получаемого урона, увеличивая её выживаемость против любого урона на 9%\/14%\/19%\/25% (TagTalent 15%\/20%\/27%\/33%).",
        "Отраженный урон наносится всем целям в радиусе, а не только источнику.",
        "Отражённый урон имеет тот же тип, что и нанесённый.",
        "Dispersion отражает урон до любого вида манипуляции уроном. При этом манипуляция уроном на враге всё еще влияет на урон.",
        "На отраженный физический урон действует блокировка урона.",
        "Урон от Dispersion отмечен как отнимающий здоровье, поэтому он не активирует любые эффекты, реагирующие на урон.",
        "Всегда отражает процент от полного значения урона, при этом не важно, достаточно ли осталось здоровья у Spectre до его получения. То есть способность отражает излишний урон, убивший Spectre, поэтому, если источник урона превышает текущее здоровье Spectre и убивает её, то отраженный урон расчитывается от полного значения.",
        "То есть способность отражает излишний урон, убивший Spectre, поэтому, если источник урона превышает текущее здоровье Spectre и убивает её, то отраженный урон расчитывается от полного значения.",
        "Dispersion отражает урон до нанесения его Spectre, поэтому, если Spectre и её противник одновременно умирают от урона, то враг всегда умирает первым.",
        "Отраженный урон не распределяется между противниками. Каждое существо получает полный урон.",
        "Отражает все 8%\/12%\/16%\/20% урона в радиусе 300 от Spectre. Этот урон линейно уменьшается до достижения расстояния в 700 от владельца.",
        "Здесь указано, сколько урона Dispersion нанесет врагам на определенном расстоянии: 300 единиц: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%) от нанесенного урона. 400 единиц: 6%\/9%\/12%\/15% (TagTalent 9,75%\/12,75%\/15,75%\/18,75%) от нанесенного урона. 500 единиц: 4%\/6%\/8%\/10% (TagTalent 6,5%\/8,5%\/10,5%\/12,5%) от нанесенного урона. 600 единиц: 2%\/3%\/4%\/5% (TagTalent 3,25%\/4,25%\/5,25%\/6,25%) от нанесенного урона.",
        "300 единиц: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%) от нанесенного урона.",
        "400 единиц: 6%\/9%\/12%\/15% (TagTalent 9,75%\/12,75%\/15,75%\/18,75%) от нанесенного урона.",
        "500 единиц: 4%\/6%\/8%\/10% (TagTalent 6,5%\/8,5%\/10,5%\/12,5%) от нанесенного урона.",
        "600 единиц: 2%\/3%\/4%\/5% (TagTalent 3,25%\/4,25%\/5,25%\/6,25%) от нанесенного урона.",
        "",
        "С Aghanim's Shard Dispersion становится активной способностью, сохраняющей пассивную часть. Создает иллюзию от Haunt для вражеского существа, наносившего урон Spectre. Целью может быть выбранный враг или при выборе точки на земле — ближайшее подходящее существо. Действуют те же примечания, что и для иллюзии от Haunt. Если нет врагов, наносивших урон Spectre в течение последних 8 сек., то Dispersion нельзя применить. Не учитывает урон от союзников, строений, вардов, неуязвимых, спрятанных или мертвых существ.",
        "Создает иллюзию от Haunt для вражеского существа, наносившего урон Spectre. Целью может быть выбранный враг или при выборе точки на земле — ближайшее подходящее существо.",
        "Целью может быть выбранный враг или при выборе точки на земле — ближайшее подходящее существо.",
        "Действуют те же примечания, что и для иллюзии от Haunt.",
        "Если нет врагов, наносивших урон Spectre в течение последних 8 сек., то Dispersion нельзя применить.",
        "Не учитывает урон от союзников, строений, вардов, неуязвимых, спрятанных или мертвых существ."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "25",
      "description": "Урон, нанесённый владельцу способности, отражается на его врагов, не нанося ему повреждений. Эффект ослабевает с расстоянием.",
      "spellName": "Dispersion",
      "params": [
        "Анимация применения: 0+0,47",
        "Минимальный радиус: 300",
        "Максимальный радиус: 700",
        "Отражаемый урон: 8%\/12%\/16%\/20% (TagTalent 13%\/17%\/21%\/25%)",
        "Таймер получения урона: 8",
        "Урон иллюзии: 40%\/60%\/80% (TagTalent 72%\/92%\/112%)",
        "Урон по иллюзии: 200%",
        "Длительность Haunt: 5",
        "Позволяет применить эту способность на героя, который наносил вам урон в течение последних 8 секунд. Иллюзия существует 5 секунд. Перезарядка: 25 секунд."
      ],
      "itemBehaviour": [],
      "legacyKey": "I",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1a\/Spectre_Shadow_Step_1.mp3\/revision\/latest?cb=20210103160705",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Требует Aghanim's Scepter для разблокировки. В режиме Ability Draft может быть разблокирована при выборе игроком Haunt.",
        "В режиме Ability Draft может быть разблокирована при выборе игроком Haunt.",
        "Значения Shadow Step равны значениям Haunt.",
        "Мгновенно применяет Spectral Dagger текущего уровня к цели без использования снаряда.",
        "На Shadow Step действуют те же примечания, что и для иллюзии от Haunt.",
        "Нельзя применять на крипов-героев."
      ],
      "mana": "180",
      "hotKey": "F",
      "cooldown": "30",
      "description": "Позволяет призвать спектральную копию от способности Haunt к одному выбранному герою.",
      "spellName": "Shadow Step",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: Глобальная",
        "Урон иллюзии: 40%\/60%\/80% (TagTalent 72%\/92%\/112%)",
        "Урон по иллюзии: 200%",
        "Длительность Haunt: 5\/6\/7"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Spectre_Reality.mp3\/revision\/latest?cb=20191216024328",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Себя"
      ],
      "notes": [
        "Reality разблокируется при изучении Haunt и всегда остается активной.",
        "Использование не позволяет избегать снаряды.",
        "При выборе точки на земле Spectre меняется местами с ближайшей от выбранной точки иллюзией от Haunt.",
        "По иллюзиям можно перемещаться, пока действует способность или пока все иллюзии не умрут.",
        "После обмена иллюзия все равно движется к цели и атакует ее."
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Герой меняется местами с выбранной иллюзией от способности Haunt.",
      "spellName": "Reality",
      "params": [
        "Анимация применения: 0+0,7",
        "Дальность применения: Глобальная"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Spectre_Haunt_1.mp3\/revision\/latest?cb=20191216024324",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Иллюзии от Haunt выделяемы, но они неподконтрольны герою.",
        "Иллюзии могут перемещаться по непроходимой территории.",
        "Иллюзии появляются в 58 единицах в случайной точке от целей.",
        "Иллюзии преследуют невидимых противников, но не атакуют. Также они появляются и следуют за неуязвимыми и спрятанными существами.",
        "Иллюзии появляются возле клонов Meepo, но не перед другими клонами или иллюзиями.",
        "Иллюзии исчезают, если их цель умирает."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "180\/160\/140",
      "description": "Создаёт рядом с каждым вражеским героем спектральную копию, которая атакует его. Во время действия можно применить способность Reality, чтобы поменяться местами с выбранной иллюзией. Иллюзии не находятся под контролем игрока, игнорируют препятствия, получают больше урона и наносят меньше урона, чем сам герой.",
      "spellName": "Haunt",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Радиус: Глобальный",
        "Урон иллюзии: 40%\/60%\/80% (TagTalent 72%\/92%\/112%)",
        "Урон по иллюзии: 200%",
        "Длительность Haunt: 5\/6\/7",
        "Дарует новую способность: Shadow Step."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.1,
    "attrAgility": 23.0
  },
  "description": "Меркуриал, Spectre — герой с ближним типом атаки и основной характеристикой ловкость, умеющий наносить чистый урон одиноким целям и мощен как в наступлении, так и в защите. Spectral Dagger обеспечивает значительную мобильность, позволяя Spectre проходить сквозь объекты, существ и ландшафт, замедляя врагов, которые вступают в контакт с теневым следом, оставленным её кинжалом. Desolate позволяет Spectre наносить большой чистый урон вражеским героям, рядом с которыми нет союзников. Dispersion уменьшает и отражает весь урон, будь то атаки или заклинания, в области вокруг Spectre. Dispersion даёт ей большую прочность, особенно при наличии предметов, дающих здоровье, броню и блокировку урона. И наконец, Haunt создаёт злобную спектральную иллюзию для всех вражеских героев на карте. Haunt позволяет Spectre наносить ущерб в столкновениях и при ганках, в то время как её союзники будут вводить врагов в заблуждение. Spectre может использовать Reality во время Haunt, мгновенно телепортируя её к своей иллюзии, чтобы принять её форму. Это позволяет Spectre преследовать свою жертву в любом месте на карте. Меркуриал является опасным сверхъестественным существом, поскольку она может преследовать свою жертву по всей карте. Её набор способностей позволяет ей играть роль фарм в команде, очень сильно воздействуя на врагов в боях в конце игры. Более конкретно, отражение повреждений от Dispersion делает его невыгодным для команд, чтобы сфокусироваться на Spectre. Её способности имеют сложный характер, и новые игроки обычно не играют за Spectre, поскольку она чрезвычайно зависима от фарма и уровня. Лучше встретить союзную Spectre, поскольку встреча с ней как с врагом в одиночку не всегда является лучшим вариантом.",
  "history": "Равно как самая непостижимая энергия всегда стремится к состоянию покоя, так и Меркуриал, воплощающую неудержимые и жестокие силы, непреодолимо притягивает к сценам раздора, что возникают в материальном мире. Её обычное спектральное состояние превосходит пределы восприятия, и каждый раз, обретая физическую форму, она теряет воспоминания о себе... но не о своей цели. В пылу схватки её личность разбивается и преображается, и вновь начинается процесс самоосознания. Она быстро вспоминает, что имя ей — Меркуриал, а заполонившие поле боя призраки — не более чем тени её самой, единственной и настоящей. В борьбе за выживание приходит концентрация, истинный разум вновь заявляет о себе, и Меркуриал превосходит материю, вновь и вновь возрождаясь в своей вечной форме вплоть до последних моментов победы или поражения.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+5% к отражающему урону у Dispersion",
      "talentRight": "+32% к урону иллюзий от Haunt"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+14% к замедлению и ускорению от Spectral Dagger",
      "talentRight": "+400 к здоровью"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+100 урона от Spectral Dagger",
      "talentRight": "+12 к урону от Desolate"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+5 ко всем атрибутам",
      "talentRight": "−4 сек. перезарядки Spectral Dagger"
    }
  ]
}