{
  "abilities": [
    {
      "notes": [
        "Blade Fury нельзя использовать во время действия  Omnislash и  Swiftslash",
        "При использовании не прерывает произносимые способности Juggernaut",
        "При использовании применяет базовое развеивание и невосприимчивость к магии на всю длительность. Пока действует способность, Juggernaut не может подвергнутся действию  Ghost Form. Бафф от неё будет мгновенно снят",
        "Juggernaut может продолжать атаковать, использовать способности и предметы во время действия способности. Однако, при этом  Omnislash и  Swiftslash неактивны и их нельзя применить, пока действует Blade Fury",
        "Во время Blade Fury, атаки Juggernaut наносят 0 урона, кроме вардов и построек. Модификаторы атаки (например,  Monkey King Bar и т.п.) всё ещё применяют свои эффекты и урон при срабатывании. Не смотря на визуальный эффект, критический удар, вампиризм и прорубающий удар не действуют, так как они основываются на нанесённом уроне",
        "Наносит 18\/23\/28\/33 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 48\/53\/58\/63) единиц урона с интервалом в 0,2, начиная спустя 0,2 сек. после применения, нанося урон 25 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 30) раз. Может нанести до 450\/575\/700\/825 единиц урона одному существу (до учета сопротивления). С <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом на увеличение длительности может нанести до 540\/690\/840\/990 урона. С <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом на увеличение урона может нанести до 1200\/1325\/1450\/1575 урона. С обоими <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантами может нанести до 1440\/1590\/1740\/1890 урона",
        "При улучшении с  Aghanim's Shard, Juggernaut начинает наносить мгновенные атаки по случайным целям каждые 1,2 сек., начиная спустя 0,2 секунды после применения, в результате срабатывая 5 раз. На эти мгновенные атаки могут сработать любые модификаторы атаки. Они не имеют эффекта True Strike, но полностью игнорируют бессилие. Мгновенные атаки выбирают случайные цели, они не имеют никаких приоритетов. Не могут сработать на варды и постройки. В отличие от обычных атак во время действия Blade Fury, мгновенные атаки наносят ΣАтак × 75%, вместо 0. Так как урон мгновенных атак исходит от обычных атак, он считается уроном от атаки и может быть снижен блокировкой урона. Также увеличивает скорость передвижения Juggernaut до 375, пока активна"
      ],
      "item_behaviour": [],
      "description": "Герой крутится в вихре сокрушительных ударов клинком, становясь невосприимчивым к магии и нанося урон врагам поблизости.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 260 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 335)",
        "Урон в секунду: 90\/115\/140\/165 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 240\/265\/290\/315)",
        "Длительность: 5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 6)",
        "Доп. скорость передвижения:  75",
        "Урон от мгновенных атак:  75%",
        "Интервал мгновенных атак:  1,2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e5\/Juggernaut_Blade_Fury_1.mp3\/revision\/latest?cb=20191216014540",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "42\/34\/26\/18",
      "aghanim": null,
      "name": "Blade Fury",
      "cooldown": "120\/110\/100\/90",
      "legacy_key": "F",
      "story": "Умение Юрнеро обращаться с катаной внушает страх и воинам, и магам."
    },
    {
      "notes": [
        "После применения вард сразу следует за Juggernaut, если ему не была отдана другая команда",
        "Восстановление представлена в виде ауры. Бафф лечения задерживается на 2,5 сек. Ауры от нескольких целительных тотемов не складываются",
        "Лечение представлено в виде восстановления здоровья, поэтому вард восстанавливает 0,2%\/0,3%\/0,4%\/0,5% от максимального запаса здоровья с интервалом в 0,1 сек. Может вылечить до 55%\/82,5%\/110%\/137,5% от максимального здоровья существа (складывается из длительности варда и задержки баффа). Полностью излечивает существ за 50\/33,33\/25\/20 секунд",
        "Не работает на варды, постройки неуязвимых и спрятанных существ"
      ],
      "item_behaviour": [],
      "description": "Призывает тотем, лечащий всех союзников неподалёку и передвигающийся со скоростью . Объём лечения зависит от максимального здоровья союзника. Действует 2,5 сек.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: 350",
        "Радиус: 400",
        "Атак для уничтожения: 1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 3)",
        "Лечение в секунду: 2%\/3%\/4%\/5%",
        "Длительность задержки ауры: 2,5",
        "Длительность: 25"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Juggernaut_Healing_Ward.mp3\/revision\/latest?cb=20191216014542",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Союзников"
      ],
      "mana": "60 (TagTalent 40)",
      "aghanim": null,
      "name": "Healing Ward",
      "cooldown": "140\/130\/120\/110",
      "legacy_key": "G",
      "story": "Среди ритуалов, выученных на острове Масок, навык залечивания ран с толикой магии вуду оказался довольно полезным."
    },
    {
      "notes": [
        "Усиливает урон атаки в среднем на 16%\/20%\/24%\/28%",
        "Выпадение критического удара определяется при замахе, а не при нанесении удара. Когда срабатывает критический удар, Juggernaut использует особую анимацию атаки, появляются визуальные эффекты вокруг его оружия",
        "Шанс срабатывания от нескольких источников критического удара сочетается. Если два источника критического удара сработают одновременно, то приоритет будет у большего модификатора",
        "Шанс использует псевдослучайное распределение",
        "Сочетается аддитивно с другими источниками вампиризма"
      ],
      "item_behaviour": [],
      "description": "Дает герою шанс нанести атакой критический урон.",
      "hot_key": "E",
      "params": [
        "Шанс: 20%\/25%\/30%\/35%",
        "Критический урон: 180%",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Вампиризм:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Juggernaut_Blade_Dance.mp3\/revision\/latest?cb=20191216014552",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Blade Dance",
      "cooldown": null,
      "legacy_key": "C",
      "story": "Как последний представитель своего культа, Юрнеро должен убедиться, что вы запомните стиль его боя."
    },
    {
      "notes": [
        "Требуется  Aghanim's Scepter для разблокирования способности",
        "Swiftslash не может быть использована во время  Blade Fury",
        "Не требует изученной  Omnislash для разблокирования, открывается сразу после покупки  Aghanim's Scepter. Однако, она основывается на Omnislash, так как напрямую использует её значения. То есть, если Omnislash не изучена, то Swiftslash ничего не сделает. Все примечания к Omnislash также относятся к Swiftslash",
        "Swiftslash имеет синие частицы при применении, в отличие от оранжевых частиц Omnislash"
      ],
      "item_behaviour": [],
      "description": "Герой применяет короткую версию Omnislash.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 550",
        "Длительность: 0,8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c5\/Juggernaut_Swiftslash.mp3\/revision\/latest?cb=20200419153429",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Мгновенная атака"
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Swiftslash",
      "cooldown": "125",
      "legacy_key": "W",
      "story": null
    },
    {
      "notes": [
        "Применяет базовое развеивание при использовании и даёт Juggernaut неуязвимость, невосприимчивость к магии и оцепенение и на всю длительность",
        "Juggernaut может продолжать использовать способности и предметы в течение действия Omnislash Однако, при этом  Blade Fury неактивна и её нельзя применить. Пока действует способность, Juggernaut не нужно разворачиваться для применения направленных способностей или предметов",
        "Интервал атак равен текущей частоте атаки Juggernaut, поделённой на 1,5. Это можно определить как  Учитывая ограничения скорости атаки, минимальные и максимальные интервалы атак равны 0,133 ‒ 4,667 секунды за атаку соответственно. Интервал не устанавливается при применении. С каждым прыжком он адаптируется к текущей скорости атаки героя",
        "Позволяет совершать мгновенные атаки по целям прыжков. Эти мгновенные атаки могут спровоцировать любые модификаторы атаки и эффекты при ударе. Они не обладают True Strike, но полностью игнорируют бессилие",
        "Не считает целями и не прыгает по вардам,  курьерам и постройкам. Может прыгать на неуязвимых, невосприимчивым к атакам и бесплотным существам, однако, мгновенные атаки не срабатывают. Не может перепрыгнуть на существ в тумане войны, невидимых или спрятанных существ,  нетленных зомби и на  астрального духа",
        "Если поблизости нет подходящих целей в течение 0,15 сек. после предыдущего прыжка, способность преждевременно завершается",
        "С каждым прыжком Juggernaut появляется на противоположной стороне от своей позиции около цели, повернувшись к цели. Радиус прыжков закреплен за Juggernaut, а не за текущей целью",
        "Даёт летающий обзор в радиусе 200 единиц вокруг цели на 1 секунду с каждым ударом",
        "Повторное применение Omnislash при уже действующей способности отменит предыдущую и начнёт новую. Это также работает с применением  Swiftslash во время действия Omnislash и наоборот",
        "Камера игрока фиксируется на Juggernaut при применении и двигается за его положением, пока действует способность"
      ],
      "item_behaviour": [],
      "description": "Герой прыгает к указанному врагу, а затем с повышенной скоростью атакует его и ближайших противников. На время действия способности герой становится неуязвимым.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 350",
        "Радиус прыжков: 425",
        "Множитель скорости атаки: 1,5",
        "Дополнительный урон: 30\/40\/50",
        "Доп. скорость атаки: 40",
        "Длительность: 3\/3,25\/3,5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 4\/4,25\/4,5)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Juggernaut_Omnislash.mp3\/revision\/latest?cb=20191216014545",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Мгновенная атака"
      ],
      "mana": "130",
      "aghanim": null,
      "name": "Omnislash",
      "cooldown": "200\/275\/350",
      "legacy_key": "E",
      "story": "«Плоды дисциплины; повторение - мать умения»."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 20.0,
    "attrIntelligence": 14.0,
    "attrIntelligenceInc": 1.4,
    "attrAgilityInc": 2.8,
    "attrAgility": 34.0
  },
  "description": "Разрубает врагов точными взмахами меча Никто не мог сказать о том, что находится под маской у Juggernaut. Последний из своего рода, Юрнеро несёт в себе только боевые традиции родного острова, который теперь затоплен. Juggernaut поднимает свой меч, создавая художественную форму неподвижного циклона, Blade Fury, и бьёт по особо уязвимым местам при помощи Blade Dance. Если он и его союзники получат повреждения на поле боя, он быстро залечит раны и восполнит жизненные силы передвижным Healing Ward. Юрнеро терпеливо ждёт чтобы применить на врагах свою самую опасную технику. Метающийся между противниками с незаметной быстротой, Juggernaut с помощью Omnislash потрошит противников ещё до того, как они успевают защитить себя.  Керри Осада Побег ★☆☆",
  "history": "Никто никогда не видел лица, что скрыто за маской Юрнеро. Остаётся гадать, каков он на вид. Однажды Юрнеро бросил вызов нечистому на руку лорду и был изгнан с древнего острова Масок. Кара спасла ему жизнь: скорой ночью остров исчез под волнами, ведомыми мстительной магией. Лишь Юрнеро отныне хранит обычаи острова: древние ритуалы и искусство боя на мечах. Непоколебимость и мужество пришли к нему в нескончаемых упражнениях с клинком, а изобретательность в бою он укоренял, неутомимо испытывая себя. Как и лик воина, желания его остаются тайной. Он уже дважды терял всё, но сражается так, будто победа предрешена."
}