{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Smoke_of_Deceit.mp3\/revision\/latest?cb=20141214193046",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "Прерывает произносимые заклинания и любой другой приказ при использовании, за исключением обычных приказов передвижения.",
        "Затронутые существа могут использовать заклинания и предметы, будучи невидимыми, без отмены невидимости. Однако, атака отменит её.",
        "При атаке, невидимость теряется при достижении цели атаки, даже если атака промахнётся.",
        "Невидимые существа могут подбирать и выкладывать предметы без отмены невидимости.",
        "True Sight не может обнаружить существ под действием Smoke of Deceit.",
        "Только существа задетые Chronosphere или существа, на которых распространяются Thirst и Track, раскрывают невидимость, находясь под эффектом Smoke of Deceit. Смотрите полный список способностей с общим обзором, которые раскрывают модели существ под действием Smoke of Deceit. Невидимые существа после раскрытия, всё ещё будут скрыты на мини-карте.",
        "Смотрите полный список способностей с общим обзором, которые раскрывают модели существ под действием Smoke of Deceit.",
        "Невидимые существа после раскрытия, всё ещё будут скрыты на мини-карте.",
        "Затрагивает только подконтрольных игроку или союзникам существ. Не действует на неуязвимых и спрятанных союзников. Однако, неуязвимые и спрятанные вражеские герои могут развеять эффект.",
        "Однако, неуязвимые и спрятанные вражеские герои могут развеять эффект.",
        "Эффект развеивается только при приближении вражеских героев (включая клоны героев, исключая иллюзии) или башен.",
        "Можно применять курьером, но на него это не подействует."
      ],
      "mana": null,
      "abilityName": "Disguise",
      "cooldown": "1",
      "description": "Все подконтрольные игрокам существа и герои в радиусе 1200 на 35 секунд становятся невидимыми, а скорость их передвижения увеличивается на 15%. Если совершить атаку или приблизиться к вражескому герою или башне на расстояние в 1025, то невидимость раскроется. Другие эффекты, раскрывающие невидимость, не действуют.",
      "params": [
        "Радиус: 1200",
        "Радиус раскрытия: 1025",
        "Время до невидимости: 0",
        "Доп. скорость передвижения: 15%",
        "Длительность: 35"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складывается в инвентаре без ограничения. Стоимость продажи варьируется от количества Smoke of Deceit в инвентаре.",
    "Smoke of Deceit можно передавать."
  ],
  "cost": "50",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Smoke of Deceit",
  "description": "Единственный достойный вклад волшебника-шарлатана Мирддина в колдовское искусство.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Smoke of Deceit не может быть использован для простого побега или для получения огромного преимущества в середине игры, однако он играет важную роль в нападении против хорошо-защищённой вражеской команды. Дополненная скорость с лёгкостью позволяет осуществить внезапные атаки или незаметно пробраться за спину врагов. Однако учтите, что вы должны держать дистанцию с вражескими героями или строениями, чтобы не раскрыть себя. Smoke of Deceit особенно полезен для скрытой атаки на логово Рошана, так как многие игроки ставят варды в этой области."
  ]
}