{"abilities":[{"spell":"After a short delay, Slark sacrifices some of his life blood, purging most negative debuffs and dealing damage to enemy units around him and to himself. Slark only takes 50% of the damage.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Dark Pact interrupts Slark's channeling spells upon cast.","Deals 7.5\/15\/22.5\/30 ( 22.5\/30\/37.5\/45) damage within a 325 radius in 0.1 second intervals, starting 1.5 seconds after cast for a total of 10 instances.","Slark takes 3.75\/7.5\/11.25\/15 ( 11.25\/15\/18.75\/22.5) damage in the same intervals, resulting in 37.5\/75\/112.5\/150 ( 112.5\/150\/187.5\/225) total damage.","Applies a strong dispel on Slark in the same intervals, before each of its damage instances.","The self-inflicted damage can be reduced or amplified, but can never kill Slark.","The visual effects and sounds during the 1.5 seconds delay is only visible and audible to allies.","The visual effect of the damaging pulses are visible even when Slark is invisible.","Dark Pact ends 2.5 seconds after cast, but ends instantly when Slark dies.","Re-casting Dark Pact during the effect delay cancels the previous cast and starts a new one instead."],"mana":"60","elements":["Does not pierce spell immunity."],"cooldown":"9\/8\/7\/6","name":"Dark Pact","description":["Cast Animation: 0+0","Damage Radius: 325","Effect Delay: 1.5","Total Damage: 75\/150\/225\/300 ( 225\/300\/375\/450)","Self Damage Percentage: 50%"],"hot_key":"Q","legacy_key":"C"},{"spell":"Slark leaps forward, grabbing the first hero he connects with. That unit is leashed, and can only move a limited distance away from Slark's landing position.","effects":["Ability No Target","Affects Enemy Heroes \/ Self","Damage Magical"],"notes":["Slark leaps forward at a speed of 933.33 for up to 0.75 seconds.","Always jumps for the full distance, unless an enemy hero gets within 95 radius of Slark during the jump.","Leashes the hit enemy hero, preventing them from casting certain mobility spells.","Can latch on enemy heroes up to 795 range away (max distance + latch radius).","Slark can turn, cast spells, and use items during Pounce, but cannot attack.","Pounce can latch on invisible units, but not on invulnerable\/hidden units, or on illusions.","When latching on a unit, Slark is automatically ordered to attack the target.","The more the leash gets stretched, the slower the affected unit can walk away from the center, eventually coming to a full stop. It directly affects the target's movement speed.","If cast before getting leashed, the following spells are not able to break the leash: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, and Hurricane Pike when targeting an enemy.","Every other position changing effect, including spells like Primal Roar and Blinding Light, can break the leash.","Force Staff and a self-targeted Hurricane Pike instantly break the leash when cast, while other sources of forced movement only break it when stretched beyond the max radius.","When the leash expires while a position changing effect is ongoing, it instantly cancels the position changing effect. This goes for the following spells: Flamebreak, Primal Roar, Power Cogs, Hookshot, Vacuum, Gust, Boulder Smash, Rolling Boulder, Geomagnetic Grip, Deafening Blast, Tether, Blinding Light, Adaptive Strike (Strength), Charge of Darkness, Greater Bash, Timber Chain, Walrus PUNCH!, Force Staff and Hurricane Pike.","Pounce destroys trees within 100 radius around Slark upon landing."],"mana":"75","elements":["Cannot be cast while rooted or leashed.","Does not pierce spell immunity."],"cooldown":"20\/16\/12\/8","name":"Pounce","description":["Cast Animation: 0+0.53","Leap Distance: 700","Latch Radius: 95","Leash Radius: 400","Leash Duration: 2.5\/2.75\/3\/3.25 ( 3.75\/4\/4.25\/4.5)"],"hot_key":"W","legacy_key":"E"},{"spell":"Slark steals the life essence of enemy heroes with his attacks, draining each of their attributes and converting them to bonus Agility. If Slark kills an affected enemy hero, he permanently steals 1 Agility.","effects":["Ability Passive","Affects Enemy Heroes \/ Self"],"notes":["Essence Shift steals attributes before attack damage is applied.","Successive attacks do not refresh the duration of all stolen\/lost attributes. Each stack has its own duration.","The status buff and debuff icon show the number of current stacks and show the duration of the last stack.","Effective stats loss by primary attribute of attacked enemies, on top of 1 attack damage: Strength: 20 health, 0.1 health regen, 0.08% magic resistance, 0.16 armor, 0.05% move speed, 1 attack speed, 12 mana, 0.05 mana regen, 0.07% spell damage. Agility: 20 health, 0.1 health regen, 0.08% magic resistance, 0.16 armor, 0.05% move speed, 1 attack speed, 12 mana, 0.05 mana regen, 0.07% spell damage. Intelligence: 20 health, 0.1 health regen, 0.08% magic resistance, 0.16 armor, 0.05% move speed, 1 attack speed, 12 mana, 0.05 mana regen, 0.07% spell damage.","Effectively grants Slark 0.48 armor, 0.15% move speed, 3 attack speed, and 3 attack damage per stack.","Essence Shift cannot reduce any attribute below 0. However, Slark continues to gain agility, both temporarily and permenantly, even when the attacked hero has no more attributes left to steal.","When Slark dies, he loses all temporarily stolen attributes, but the affected enemies do not get theirs back, and vice versa.","Cannot steal attributes from illusions, but can steal from hero clones.","Can steal attributes from allies.","To permanently steal agility, an enemy hero has to die within 300 range of Slark while having the Essence Shift debuff. Alternatively, Slark also steals agility when he kills a debuffed enemy hero from any distance."],"mana":"0","elements":["Cannot be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Essence Shift","description":["Permanent Steal Radius: 300","Permanent Agility Steal: 1","All Attributes Lost per Attack: 1","Agility Gained per Attack: 3","Duration: 15\/30\/60\/120 ( 95\/110\/140\/200)"],"hot_key":"E","legacy_key":"N"},{"spell":"When used, Slark hides himself in a cloud of shadows, becoming immune to detection. Attacking, casting spells, and using items will not reveal Slark. Passively, when not visible to the enemy team, Slark gains bonus movement speed and health regeneration.","effects":["Ability No Target \/ Passive","Affects Self ( Allied Heroes)"],"notes":["Shadow Dance interrupts Slark's channeling spells upon cast.","Slark gains or loses the health regen and movement speed bonus 0.5 seconds after getting in or out of enemy vision, or casting Shadow Dance.","If Slark is damaged by a neutral creep, the health regen and movement speed bonus are lost for 2 seconds.","When casting Shadow Dance, he turns invisible and cannot be revealed by anything. However, the black cloud created is visible to enemies.","The invisibility is granted by an aura, its buff lingers for 0.5 seconds. When not upgraded, the buff immediately disappears as soon as Shadow Dance expires. When upgraded, it lingers out when expiring. This means Shadow Dance effectively lasts 4.5\/4.75\/5 ( 5.5\/5.75\/6) seconds when upgraded, even for Slark. When not upgraded, the aura affects the caster only. When upgraded, it affects allied heroes, illusions and creep-heroes as well. The aura only provides the invisibility. Therefore, allies do not receive the passive health regeneration and movement speed buff. The aura does not affect invulnerable units, so even if Slark turns invulnerable during it, he gets revealed.","Can regenerate up to 12%\/21.25%\/31.5% ( 15%\/26.25%\/38.5%) ( 13.5%\/23.75%\/35%, 16.5%\/28.75%\/42%) of Slark's max health over its full duration.","Can regenerate up to 180%\/300%\/420% of Slark's max health in one minute.","Can fully regenerate Slark's health within 33.33\/20\/14.29 seconds.","Shadow Dance does not allow Slark to walk through units."],"mana":"120","elements":["Cannot be used by illusions.","Partially disabled by Break.","Pierces spell immunity."],"cooldown":"80\/70\/60 ( 30)","name":"Shadow Dance","description":["Cast Animation: 0+0","Aura Radius: 0 ( 325)","Fade Time: 0","Move Speed Bonus: 20%\/35%\/50%","Max Health as Regen per Second: 3%\/5%\/7%","Passive Activation Delay: 0.5","Neutral Creep Damage Deactivate Duration: 2","Aura Linger Duration: 0.5","Active Duration: 4\/4.25\/4.5 ( 5\/5.25\/5.5)"],"hot_key":"R","legacy_key":"D"}],"bio":"Little known to the inhabitants of the dry world, Dark Reef is a sunken prison where the worst of the sea-breed are sent for crimes against their fellows. It is a razor barbed warren full of murderous slithereen, treacherous Deep Ones, and sociopathic meranths. In this dim labyrinth, patrolled by eels and guarded by enormous anemones, only the vicious survive. Pitched into Dark Reef for crimes unknown, Slark spent half a lifetime without kin or kindness, trusting no one, surviving through a combination of stealth and ruthlessness, keeping his thoughts and his plans to himself. When the infamous Dark Reef Dozen plotted their ill-fated breakout, they kept their plans a perfect secret, murdering anyone who could have put the pieces together--but somehow Slark discovered their scheme and made a place for himself in it. Ten of the Dozen died in the escape attempt, and two were captured, hauled back to Dark Reef, then executed for the entertainment of their fellow inmates. But Slark, the unsung thirteenth, used the commotion as cover and slipped away, never to be caught. Now a furtive resident of the carnivorous mangrove scrub that grips the southern reach of Shadeshore, Slark remains the only successful escapee from Dark Reef.","talentsTips":["The agility talent effectively grants Slark 0.96 armor, 6 attack speed, 0.3% movement speed and 6 attack damage.","The strength talent effectively grants Slark 200 health, 1 health regen and 0.8% magic resistance.","The lifesteal talent stacks additively with other sources of lifesteal."],"trivia":["Slark is named after a rare murloc in World of Warcraft.","Slark's murloc heritage was completely removed in the transition to Dota 2 to avoid copyright issues, since the murlocs are an existing race in the Warcraft universe.","Slark's response \"Met you once, cut you twice.\" is a reference to the carpentry phrase \"measure twice, cut once\".","Slark's respawn line \"Griefer madness...\" is a reference to the propaganda film Reefer Madness. As well, a griefer is a role a player assumes while in a multiplayer game to deliberately irritate other players.","Slark's weapon, a shiv, is the traditional prison weapon and is a reference to his backstory."],"talents":["+80s Essence Shift Duration:+1s Shadow Dance Duration","+1.25s Pounce Leash:+150 Dark Pact Damage","20% Lifesteal:+30 Attack Speed","+6 Agility:+10 Strength"],"desc":"Slark, the Nightcrawler, is a melee agility hero that utilizes his abilities to spring onto enemy heroes and slip out unhindered. He is a very mobile ganker, but remains attribute-wise below most other carries unless he is able to steal away attributes with his abilities. Once he does, though, only a few heroes can hope to be as fearsome as the Nightcrawler - extremely mobile to the point of ever-presence, his strikes only hitting harder and faster."}