{"abilities":[{"spell":"После небольшой задержки Slark жертвует немного собственной крови, что снимает с него большинство отрицательных эффектов и наносит урон всем врагам поблизости. Сам Slark получает 50% нанесенного этой способностью урона.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["При использовании Dark Pact прерывает произносимые способности Slark.","Наносит 7.5\/15\/22.5\/30 ( 22.5\/30\/37.5\/45) единиц урона в радиусе 325 единиц с интервалом в 0,1 секунды спустя 1.5 секунды после применения 10 раз.","Slark получает 3.75\/7.5\/11.25\/15 ( 11.25\/15\/18.75\/22.5) единиц урона с интервалом в 0,1 секунды, в общем получая по себе 37.5\/75\/112.5\/150 ( 112.5\/150\/187.5\/225) единиц урона.","Применяет к Slark сильное развеивание каждые 0,1 секунды после каждого интервала получения урона.","Наносимый себе урон может быть снижен или усилен, но он никогда не убьет Slark.","Визуальные эффекты и звуки в момент задержки в 1.5 секунды видны и слышны только союзникам.","Визуальные эффекты от вспышек урона видны даже если Slark находится в невидимости.","Dark Pact завершается спустя 2.5 секунды после применения, но в случае смерти Slark способность мгновенно прерывается.","Повторное применение Dark Pact в момент задержки способности отменит предыдущее применение и начнет наносить урон заново."],"mana":"60","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"9\/8\/7\/6","name":"Dark Pact","description":["Анимация применения: 0+0","Радиус: 325","Задержка: 1.5","Урон: 75\/150\/225\/300 ( 225\/300\/375\/450)","Урон, наносимый себе: 50%"],"hot_key":"Q","legacy_key":"C"},{"spell":"Slark прыгает вперед, хватаясь за первого героя, попавшегося ему на пути. Враг получает урон и привязывается к Slark, что позволяет ему двигаться только в определенном радиусе от позиции приземления Slark.","effects":["Способность Ненаправленная","Действует на Вражеских героев \/ Себя","Урон Магический"],"notes":["Slark прыгает вперед со скоростью в 933,33 единиц за 0.75 секунды.","Прыжок всегда совершается на всю дистанцию, крому случая, если в момент прыжка вражеский герой окажется в радиусе 95 единиц от Slark.","Привязывает вражеского героя, запрещая использование определенных заклинаний для перемещения.","Может цеплять вражеских герой на расстоянии до 795 единиц (складывается из максимальной дистанции и радиуса захвата).","Slark может поворачиваться, использовать заклинания и предметы в момент прыжка, но не может атаковать.","Pounce может привязать невидимых юнитов, но не может сделать это с неуязвимыми\/спрятанными юнитами или с иллюзиями.","При привязке юнита Slark автоматически получает приказ на атаку цели.","Чем больше привязывание растягивается, тем сильнее замедляется юнит при удалении от центра, в итоге полностью останавливаясь. Это также напрямую влияет на скорость передвижения цели.","Перечисленные способности не могут разорвать привязку, если были применены до привязки: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, Force Staff и Hurricane Pike при использовании на врага.","Остальные эффекты, меняющие позицию, включая заклинания, схожие с Primal Roar и Blinding Light, могут разрывать связку.","Force Staff и использованный на себя Hurricane Pike мгновенно разрывают связку, хоть остальные источники принудительного движения разрывают её только при преодолении максимального радиуса действия.","Когда действие привязки истекает в момент действия эффекта, меняющего позицию, то она мгновенно отменяет этот эффект. Это относится к следующим заклинаниям: Flamebreak, Primal Roar, Power Cogs, Hookshot, Vacuum, Gust, Boulder Smash, Rolling Boulder, Geomagnetic Grip, Deafening Blast, Tether, Blinding Light, Adaptive Strike (Сила), Charge of Darkness, Greater Bash, Timber Chain, Walrus PUNCH!, Force Staff и Hurricane Pike.","Все деревья в радиусе 100 единиц вокруг места приземления Slark будут разрушены."],"mana":"75","elements":["Нельзя применять в оцепенении.","Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/16\/12\/8","name":"Pounce","description":["Анимация применения: 0+0,53","Дистанция прыжка: 700","Радиус привязки: 95","Радиус захвата: 400","Урон: 30\/60\/90\/120","Длительность привязки: 2.5\/2.75\/3\/3.25 ( 3.75\/4\/4.25\/4.5)"],"hot_key":"W","legacy_key":"E"},{"spell":"Герой крадёт атаками жизненную сущность вражеских героев, выкачивая все их атрибуты и превращая их в дополнительную ловкость для себя. Владелец этой способности навсегда крадёт 1 ловкости, если убивает жертву под этим эффектом или находится в радиусе 300 во время её смерти.","effects":["Способность Пассивная","Действует на Вражеских героев \/ Себя"],"notes":["Essence Shift крадет атрибуты до нанесения урона.","Успешные атаки не обновляют длительность всех украденных\/потерянных атрибутов. Каждый заряд обладает своей длительностью.","Иконка баффа и дебаффа отображает текущее количество зарядов и длительность последнего заряда.","Помимо потери 1 урона от атаки вражеские герои теряют: Сила: 22.5 единиц здоровья, 0.13 регенерации здоровья, 0.1% сопротивления магии, 0.16 единиц брони, 0.05% скорости передвижения, 1 скорости атаки, 12 маны, {0.05 регенерации маны и 0.07% урона заклинаний. Ловкость: {18 единиц здоровья, 0.1 регенерации здоровья, 0.08% сопротивления магии, 0.2 единиц брони, 0.2 скорости передвижения, 1.25 скорости атаки, 12 маны, 0.05 регенерации маны и 0.07% урона заклинаний. Интеллект: 18 единиц здоровья, 0.1 регенерации здоровья, 0.08% сопротивления магии, 0.16 единиц брони, 0.05% скорости передвижения, 1 скорости атаки, 15 маны, 0.06 регенерации маны и 0.09% урона заклинаний.","В среднем заряд дает Slark 0.6 единиц брони, 0.19% скорости передвижения, 3.75 единиц скорости атаки и 3 урона от атаки.","Essence Shift не может снизить значение любого атрибута ниже нуля. При этом Slark продолжает получать ловкость даже если у атакуемого героя больше не осталось атрибутов для кражи.","Когда Slark умирает, то он теряет все украденные атрибуты, но к затронутым врагам они не возвращаются и наоборот.","Не может украсть атрибуты у иллюзий, но может украсть у клонов героев.","Может украсть атрибуты у союзников.","Для получения постоянного бонуса к ловкости нужно, чтобы в радиусе 300 от Slark умер вражеский герой под действием дебаффа Essence Shift. Или же герой также получает ловкость, если враг под дебаффом умер от Slark на любом расстоянии."],"mana":"0","elements":["Не может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Essence Shift","description":["Радиус постоянного похищения: 300","Постоянный бонус к ловкости: 1","Потеря атрибутов за атаку: 1","Ловкости за атаку: 3","Длительность: 15\/30\/60\/120 ( 95\/110\/140\/200)"],"hot_key":"E","legacy_key":"N"},{"spell":"Скрывает героя в облаке теней, делая его невидимым. Эта невидимость не раскрывается ничем; атаки, использование предметов и применение способностей также не снимают невидимость. Способность также имеет пассивный эффект, который увеличивает скорость передвижения и восстановления здоровья героя, когда его не видит вражеская команда.","effects":["Способность Ненаправленная ( Аура)","Действует на Себя ( Союзных героев)"],"notes":["При использовании Shadow Dance прерывает произносимые способности Slark.","Slark получает или теряет регенерацию здоровья и дополнительную скорость передвижения спустя 0.5 секунды после покидания или попадания в область вражеского обзора или использования Shadow Dance.","Если нейтральный крип наносит урон Slark, то дополнительная скорость и регенерация пропадают на 2 секунды.","При использовании Shadow Dance герой становится невидимым и недоступным для обнаружения чем-либо. При этом созданное черное облако видно врагам.","Невидимость предоставляется в виде ауры, бафф от которой задерживается на 0.5 секунды. Без улучшения бафф мгновенно исчезает при завершении Shadow Dance. С улучшением бафф задерживается. То есть Shadow Dance при улучшении длится 4.5\/4.75\/5 ( 5.5\/5.75\/6)и для Slark, и для союзников. Без улучшения аура действует только на владельца. При улучшении способность действует на союзных героев, иллюзий и крипов-героев. Аура дает только невидимость, поэтому союзники не получают дополнительную пассивную регенерацию здоровья и бафф на скорость передвижения. Аура не действует на неуязвимых юнитов, поэтому если Slark станет неуязвимым, пока действует способность, то он раскроется.","Восстанавливает 12%\/21.25%\/31.5% ( 15%\/26.25%\/38.5%)( 13.5%\/23.75%\/35%, 16.5%\/28.75%\/42%) от максимального запаса здоровья Slark в активном состоянии, учитывая то, что ничего не мешает регенерации.","Восстанавливает здоровье в виде регенерации, регенерируя 0.3%\/0.5%\/0.7% от максимального здоровья с интервалом в 0,1 секунды.","Может восстановить 100% здоровья Slark за 34\/20\/15 секунд.","Shadow Dance не позволяет Slark проходить сквозь других юнитов."],"mana":"120","elements":["Не может использоваться иллюзиями.","Частично отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"80\/70\/60 ( 30)","name":"Shadow Dance","description":["Анимация применения: 0+0","Радиус ауры: 0 ( 325)","Время до исчезновения: 0","Доп. скорость передвижения: 20%\/35%\/50%","Реген. здоровья в секунду: 3%\/5%\/7%","Задержка активации пассивного эффекта: 0.5","Длительность бездействия от урона нейтральных крипов: 2","Длительность задержки ауры: 0.5","Длительность при активации: 4\/4.25\/4.5 ( 5\/5.25\/5.5)"],"hot_key":"R","legacy_key":"D"}],"bio":"Мало кому из жителей суши известно о Темном рифе — подводной темнице для всяческого рода подводного отребья: убийц-слизеринов, изменников из рода Глубоководных, маньяков-мерантов и прочих морских обитателей, совершивших преступления против своих сородичей. Коридоры ее темны и запутанны, стены покрыты острыми как бритва кораллами. Лабиринт неустанно патрулируют юркие угри, а на страже незыблемо стоят гигантские анемоны. Выживают здесь лишь самые злобные и беспощадные. В этом скверном месте Сларк провел большую часть жизни, заточенный за никому неизвестные прегрешения, не ведая добра и лишенный любых радостей. Скрытный и безжалостный, он всегда хранил свои планы и замыслы при себе. Однажды двенадцать заключенных, прозванных впоследствии Дюжиной, объединились для побега. Заговорщики хранили свои планы в строжайшей тайне и расправлялись со всеми любопытными, кто пытался что-то выведать. Но все же хитрецу Сларку каким-то образом удалось обо всем узнать. Планам Дюжины не суждено было сбыться: в злосчастный день побега десятеро из них было убито, а двоих изловили живьем и публично казнили на потеху остальным каторжникам. Однако никто не знал, что был и тринадцатый беглец. Воспользовавшись суматохой, Сларк проскользнул незамеченным мимо охраны и тотчас же затерялся в глубинах. Своим новым местом обитания он выбрал опасные мангровые заросли у южной оконечности Тенистого Взморья. Таким образом, Сларк стал единственным известным в истории заключенным, которому удалось сбежать из Темного Рифа.","talentsTips":["Талант на ловкость в общем даёт Slark: 1,2 брони, 7,5 скорости атаки, 0,38% скорости передвижения и 6 урона от атаки.","Талант на силу в общем даёт Slark: 180 здоровья, 1 регенерации здоровья и 0,8% сопротивления магии.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"trivia":["Slark's murloc heritage was completely removed in transition to Dota 2 to avoid copyright issues, since the murloc are an existing race in the Warcraft universe.","Slark's response, Играть \"Met you once, cut you twice.\" is a reference to the carpentry phrase, \"Measure twice, cut once.\"","Slark's respawn line, Играть \"Griefer madness...\" is a reference to the propaganda film, Reefer Madness. As well, a griefer is a role a player assumes while in a multiplayer game to deliberately irritate other players.","Slark's weapon, a Shiv, is the traditional prison weapon and is a reference to his backstory.","The set deep sea scoundrel is a refernce to silence of the lambs character hannibal."],"talents":["+80 сек. действия Essence Shift:+1 сек. действия Shadow Dance","+1,25 сек. действия Pounce:+150 к урону от Dark Pact","20% вампиризма:+30 к скорости атаки","+6 к ловкости:+10 к силе"],"tips":["Задержка от Dark Pact не видна врагам. Используйте ее, чтобы внести элемент неожиданности в ваше нападение.","Связка Pounce и Dark Pact является одним из основных для героя.","Slark под действием Shadow Dance не может быть обнаружен ни одним источником обнаружения невидимости (включая фонтан, башни и использование любых предметов)."],"desc":"Slark — это универсальный герой с ближним типом атаки, основной характеристикой которого является ловкость. Первая способность, Dark Pact, после небольшой задержки Slark жертвует здоровьем, что снимает с него большинство отрицательных эффектов и наносит урон всем врагам поблизости. Сам Slark получает 50% нанесенного этой способностью урона. Второй способностью, Pounce, Slark прыгает вперед, хватаясь за первого героя, попавшегося ему на пути. Враг получает урон и привязывается к Slark, что позволяет ему двигаться только в определенном радиусе от позиции приземления Slark. Пассивная способность, Essence Shift, крадет все атрибуты вражеских героев при атаках, превращая их в дополнительную ловкость себе. Ультимативная способность, Shadow Dance, скрывает Slark в облаке теней, делая его невидимым. Эта невидимость не раскрывается ничем; атаки, а также использование предметов и заклинаний не снимают невидимость (кроме Chronosphere ). Кроме того, когда его не видит вражеская команда, он быстрее передвигается и восстанавливает здоровье."}