{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Bloodthorn_Soul_Rend.mp3\/revision\/latest?cb=20191227195358",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Does not directly amplify damage as it is dealt, but rather saves all damage values and deals 30% of it 5 seconds after cast. This means that the damage can be avoided by becoming spell immune or invulnerable\/hidden at the end of the duration.",
        "This means that the damage can be avoided by becoming spell immune or invulnerable\/hidden at the end of the duration.",
        "The damage is applied as soon as the debuff expires. Dispelling the debuff, however, skips the damage entirely. Recasting Soul Rend on the same target refreshes the duration. Doing this delays the damage further, and gives more time to deal damage to the target. The damage is credited to the last caster of Soul Rend on the target.",
        "Recasting Soul Rend on the same target refreshes the duration.",
        "Doing this delays the damage further, and gives more time to deal damage to the target.",
        "The damage is credited to the last caster of Soul Rend on the target.",
        "Only considers magical, physical and pure damage (after all reductions). Other sources of health loss are ignored.",
        "Applies Accuracy on the target, causing all attacks done against it to not miss to evasion or blind effects.",
        "The critical strike is only applied to attacks launched on a debuffed enemy. Previously launched attack projectiles are unaffected. In reverse, this also means that projectiles launched during the debuff still crit even when landing after it already expired.",
        "In reverse, this also means that projectiles launched during the debuff still crit even when landing after it already expired.",
        "Shares cooldown with Orchid Malevolence."
      ],
      "mana": "100",
      "abilityName": "Soul Rend",
      "cooldown": null,
      "description": "Silences a target for 5 seconds. At the end of the silence, an additional 30% of all damage taken during the silence will be dealt to the target as magical damage. All attacks on the silenced target will have True Strike and 100% chance to crit for 130% damage.",
      "params": [
        "Cast Range: 900",
        "Damage Amplification: 30%",
        "Critical Proc Chance: 100%",
        "Critical Damage: 130%",
        "Duration: 5"
      ],
      "itemBehaviour": [
        "(Spell_immunity_block_symbol)^Does not pierce spell immunity\nEffect persists and attempts to deal damage when expiring while spell immune if debuff was placed before spell immunity and when not dispelled."
      ],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 90 attack speed, 300 mana, 6.75 mana regen and 30 attack damage.",
    "For agility heroes, it grants 90 attack speed, 300 mana, 6.75 mana regen and 30 attack damage.",
    "For intelligence heroes, it grants 90 attack speed, 300 mana, 6.75 mana regen and 55 attack damage."
  ],
  "cost": "6475",
  "lore": null,
  "consistFrom": [
    "Orchid Malevolence",
    "Hyperstone",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Bloodthorn",
  "description": "A reviled blade that bites deeper with each wriggle of its victim's final throes.",
  "trivia": [
    "Prior to the July 14, 2017 Patch, Bloodthorn's active ability, Soul Rend, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."
  ],
  "upgradeIn": null,
  "bonuses": [
    "+25 Intelligence",
    "+5.5 Mana regeneration",
    "+30 Attack damage",
    "+90 Attack speed"
  ],
  "tips": null
}