{"abilities":[{"effects":["Cast Range: 400","Duration: 20"],"notes":["The Iron Branch is consumed in the process.","Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit.","Creates a regular tree at the target point. This tree is smaller than the other trees on the map and has a smaller collision size.","This means it blocks vision and is treated like any other tree by all abilities which interact with trees.","Tango heals for twice as long when targeting an Iron Branch tree, using the ward duration instead of the tree duration.","The particles around the tree are visible to everyone, making it clear that it is a planted tree."],"elements":["Ability Target Point"],"description":"Targets the ground to plant a happy little tree that lasts for 20 seconds."}],"cost":"50","description":"A seemingly ordinary branch, its ironlike qualities are bestowed upon the bearer.","trivia":["In the original DotA, Iron Branch's full name was \"Ironwood Branch\".","The happy little trees in the active ability description is a reference to Bob Ross, a popular painter who often used the phrase on his television program, The Joy of Painting.","The planted tree uses the same model as the Sprout trees and is surrounded by the same effects as a tree enchanted with Eyes In The Forest.","Typing in 'GG' into the shop search bar will bring up the Iron Branch, in reference to their fan name of \"GG Branches\" due to Dota 1 giving them the description of \"Buying one of these will ensure a good game\"."],"further":["Magic_Wand","Buckler","Ring_of_Basilius","Headdress"],"tips":["The item is used early game for a cheap boost of attributes and it is then made into a Magic Wand or a Mekansm, or sold.","Due to how efficient the Iron Branch is gold-wise, it is a good idea, if you have spare inventory slots, to buy as many as you can. If you cannot micro the courier effectively, it is a good idea to leave one space for another item that you will get in the future.","Plant an Iron Branch to create a tree that traps or blocks enemy movement."],"attrs":["Active Plant Tree","Charges 1","Bonus +1 Strength +1 Agility +1 Intelligence","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 20 health, 0.1 health regen, 0.08% magic resistance, 0.16 armor, 1 attack speed, 0.05% movement speed, 12 mana, 0.05 mana regen, 0.07% spell damage and 1 attack damage.","For agility heroes, it grants 20 health, 0.1 health regen, 0.08% magic resistance, 0.16 armor, 1 attack speed, 0.05% movement speed, 12 mana, 0.05 mana regen, 0.07% spell damage and 1 attack damage.","For intelligence heroes, it grants 20 health, 0.1 health regen, 0.08% magic resistance, 0.16 armor, 1 attack speed, 0.05% movement speed, 12 mana, 0.05 mana regen, 0.07% spell damage and 1 attack damage.","Iron Branches do not stack in the inventory."]}