{
  "abilities": [
    {
      "notes": [
        "Impetus' cast range can only be further increased by attack range bonuses of the same range type as the caster\n However, it is not affected by cast range bonuses\n Both Autocast and manually casting it uses Enchantress' current attack range",
        "The distance is calculated as the projectile hits the target\n This means moving away from the target causes it to deal more damage on impact, and vice versa",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage\n This also means that it fully works with spell damage amplification and spell lifesteal",
        "Impetus deals its damage before the attack damage is applied, but still depends on the attack hitting the target",
        "Impetus does not work against allied units, buildings or wards",
        "The damage is capped at a distance of 1750, resulting in the following maximum damage values: Treats creep-heroes and  Roshan as heroes, illusions as creeps\n Can deal a total of 140\/210\/280\/350 ( 253.75\/323.75\/393.75\/463.75) damage to heroes\n Can deal a total of 280\/420\/560\/700 ( 507.5\/647.5\/787.5\/927.5) damage to creeps",
        "Cannot be cast on  Couriers"
      ],
      "item_behaviour": [],
      "description": "Places an enchantment on each attack while activated, causing it to deal additional damage based on how far away the target is. The farther the target, the greater the damage dealt. Deals double damage to creeps and illusions.",
      "hot_key": "Q",
      "params": [
        "Cast Range:  575",
        "Distance as Damage: 8%\/12%\/16%\/20% ( 14.5%\/18.5%\/22.5%\/26.5%)",
        "Distance Cap: 1750",
        "Creep Damage Multiplier: 2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Enchantress_Impetus_1.mp3\/revision\/latest?cb=20191216013613",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Enemies",
        "Damage: Pure"
      ],
      "mana": "6\/4\/2\/0",
      "aghanim": null,
      "name": "Impetus",
      "cooldown": "50",
      "legacy_key": "T",
      "story": "While Aiushtha favors peaceful means, she is capable of a magical onslaught from a distance, her spears gaining energy from the natural life around her."
    },
    {
      "notes": [
        "Casting Enchant on heroes and on the following targets applies the movement speed slow and a basic dispel on them (the long sound is played): Clones, creep-heroes and on the   Vengeance Illusion\n  Couriers can be targeted, but it has no effect on them, wasting the mana and cooldown\n Successive casts on heroes refresh its duration",
        "Cannot be cast on ancient creeps,  Siege Creeps,  Necronomicon Warriors and  Necronomicon Archers\n Cannot be cast again on enchanted creeps from the same faction\n TALENT NOTES Enchant's ancient creeps targeting restriction is removed upon learning the  talent\n Treats creep-heroes with the ancient tags (e.g\n  Roshan) now as heroes, hence only applies the movement speed slow",
        "Slowed units leave behind a trail of flowers as they move, which is only visible when having vision over the unit",
        "Casting Enchant on any other enemy unit enchants it (short sound is played)\n Enchant applies a basic dispel on the target creep which removes buffs and debuffs\n Then it increases the enchanted creep's max health while fully healing it, and grants flat bonus attack damage to it\n However, its mana is not restored",
        "Treats illusions as creeps\n Enchanting an illusion does not change the creator of the illusion\n It also does not heal and grant the enchanted illusion bonus attack damage\n The enchanted illusion is also not counted to the max enchanted units allowed",
        "Enchanting a new creep instantly kills the previous enchanted creep\n There are no limit to how many illusions that can be enchanted\n When an enchanted creep's duration ends, it gets instantly killed as well\n These deaths are not credited to anyone so that no one gets experience from it",
        "The following neutral creeps cannot be targeted at all due to the level restriction: Level 4: Can enchant all neutral creeps Level 3: Can enchant all neutral creeps Level 2 cannot enchant:  Ancient Black Dragon,  Ancient Granite Golem,  Ancient Ice Shaman,  Ancient Thunderhide,  Dark Troll Summoner,  Satyr Tormenter, Level 1, additionally:  Alpha Wolf,  Ancient Frostbitten Golem,  Ancient Rock Golem,  Ancient Rumblehide,  Centaur Conqueror,  Hellbear Smasher,  Warpine Raider,  Wildwing Ripper,"
      ],
      "item_behaviour": [],
      "description": "Enchantress charms an enemy. If the enemy is a hero, they are slowed. If the enemy is a creep, she brings it under her control, increasing its attack damage and max health. Only one creep can be controlled at a time.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.67",
        "Cast Range:  500\/550\/600\/650",
        "Hero Move Speed Slow: 55%",
        "Hero Slow Duration: 3.75\/4.5\/5.25\/6",
        "Max Enchanted Creeps: 1",
        "Creep Max Health Bonus: 200\/300\/400\/500",
        "Creep Attack Damage Bonus: 10\/30\/50\/70",
        "Creep Armor Bonus: 2\/4\/6\/8",
        "Enchant Creep Max Level: 4\/5\/6\/6",
        "Enchant Duration: 30\/60\/90\/120"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8f\/Enchantress_Enchant_1.mp3\/revision\/latest?cb=20191216013612",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies"
      ],
      "mana": "28\/24\/20\/16",
      "aghanim": null,
      "name": "Enchant",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "C",
      "story": "A true steward of the forest, Aiushtha befriends all within it - from lowly trolls to powerful centaurs."
    },
    {
      "notes": [
        "Every 0.5 seconds, each wisp chooses a random allied unit to heal\n So it is possible to heal up to 8 ( 13) allies at a time",
        "The heal targets are chosen randomly, without any priorities\n Multiple wisps can randomly select the same unit\n Each wisp approaches its chosen target, indicating the wisp is healing the target",
        "Nature's Attendants ignores ancient creeps and allies that already are at full health",
        "It can heal invulnerable units, but not hidden units",
        "The search radius is centered around Enchantress' current location and follows her at all times",
        "When Enchantress dies, the wisps still continue to heal units nearby her death location\n When Reincarnation triggers, the wisps fly back from nearby units to Enchantress upon respawning",
        "Successive casts do not stack but refresh the duration",
        "Can heal a total of 32\/64\/96\/128 health per second or 392\/864\/1416\/2048 health over its full duration",
        "TALENT NOTES The movement speed increasing  talent does not update the current active instance\n Increases Enchantress' total movement speed to 350 while active\n The number of wisps increasing  talent can heal a total of 52\/104\/156\/208 health per second or 468\/1040\/1716\/2496 health over its full duration\n However, the ability's visual effects do not adapt for this  talent\n The bonus heal per wisp  talent can heal a total of 192\/224\/256\/288 health per second or 1728\/2240\/2816\/3456 health over its full duration\n With both  talents, it can heal a total of 312\/364\/416\/468 health per second or 2808\/3640\/4576\/5616 health over its full duration"
      ],
      "item_behaviour": [],
      "description": "A cloud of wisps heals Enchantress and any friendly units nearby. Lasts 9\/10\/11\/12 seconds.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.3+0.93",
        "Search Radius: 275",
        "Number of Wisps: 8 ( 13)",
        "Heal per Second per Wisp: 4\/8\/12\/16 ( 24\/28\/32\/36)",
        "Duration: 9\/10\/11\/12",
        "Move Speed Bonus:  30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/96\/Enchantress_Nature%27s_Attendants.mp3\/revision\/latest?cb=20191216013606",
      "effects": [
        "Ability: No Target",
        "Affects: Allies"
      ],
      "mana": "35",
      "aghanim": null,
      "name": "Nature's Attendants",
      "cooldown": "140",
      "legacy_key": "R",
      "story": "Whimsical spirits of the woods possess a healing power that is quite subtle, but gains strength in numbers."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter to be unlocked",
        "Interrupts Enchantress' channeling abilities upon cast",
        "Sproink disjoints projectiles upon cast",
        "Upon cast, Enchantress leaps in an arc with a height of 150 and 180° away from the direction Enchantress is facing\n Leaps at a speed of 1250 for up to 0.4 seconds, or until touching the ground again\n Can leap over other units and over impassable terrain\n This means the leap distance and duration can be reduced\/increased by jumping up\/down a ramp or impassable terrain",
        "During Sproink, Enchantress can attack, cast abilities, and use items",
        "0.2 seconds after cast, Enchantress performs instant attacks on the furthest 3 enemies within the search radius\n This means if the leap gets interrupted before that, the instant attacks do not happen\n The instant attacks are also not performed if  Impetus is not learned, or when she is disarmed\n The instant attacks apply Impetus based on its current level on their targets, they do not cost any mana, and are applied even if Impetus is currently not castable\n These instant attacks can proc any attack modifiers and on-hit effects normally\n They do not have True Strike\n Fully ignores  Couriers",
        "With Enchantress' base attack range and Sproink's attack range buffer, the ability has a search radius of 775\n Searches for enemies all around her, meaning it may target enemies behind Enchantress as well",
        "For  melee units, if the enemy target is farther than 350 range more than the attacker's range, the attack will always miss"
      ],
      "item_behaviour": [],
      "description": "Leaps backward, and dodges incoming projectiles, and launches an Impetus attack on the 3 furthest enemy units within Enchantress' attack range + 200.",
      "hot_key": "D",
      "params": [
        "Cast Animation:  0+0",
        "Leap Distance: 500",
        "Leap Duration: 0.4",
        "Impetus Attacks Range Buffer:  200",
        "Number of Impetus Attacks: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Enchantress_Sproink.mp3\/revision\/latest?cb=20191216013606",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies",
        "Damage: Instant Attack"
      ],
      "mana": "4",
      "aghanim": null,
      "name": "Sproink",
      "cooldown": "50",
      "legacy_key": "F",
      "story": "Sproink is as Sproink does."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Provides True Sight over the target, while all creeps (including lane, neutral and ancient creeps), regardless of its faction that are within the radius get taunted, forcing them to attack the affected target\n Creep-heroes can be targeted, but they are not affected by the taunt\n Treats illusions as heroes\n Has the same taunt priority with  Berserker's Call,   Life Break and  Winter's Curse, but lower than  Duel",
        "Creeps that enter the search radius after the cast are also taunted for its remaining duration\n Does not affect or check for spell immune, invulnerable, or hidden enemies, wards or buildings",
        "The search radius is centered around the affected target's current location and follows the target at all times",
        "Three wisps appear above the affected target, while a single wisp appears on the taunted creep, visible to everyone",
        "The taunt is based on an aura, with an infinite linger duration\n The debuff gets cleared when the debuff on the primary target expires, or when the target dies\n This means the taunt sticks on the affected units, and getting moved outside the radius does not free the unit from the taunt\n This also means the taunt sticks even if the debuff got removed on the primary target due to no enemies being within the area",
        "Little Friends has the lowest priority in the group of kill credit manipulation effects\n All damage dealt to the affected target from creeps during the taunt duration is neither sourced to Little Friends, nor credited to Enchantress\n The hidden debuff is responsible for giving the kill credit to Enchantress\n The kill credit is still given to Enchantress if the creep's attack projectile lands the kill upon the ability's duration expiring",
        "However, the following conditions do not credit Enchantress with the kill credit\n When combined with other higher priority kill credit manipulation effects (e.g\n  Reaper's Scythe and\/or  Winter's Curse)\n When the affected target dies to  Ice Blast's kill threshold\n When  Meepo or its  Meepo Clones is instantly killed due to either the Prime or any one of its clones dying, including being denied, during the stun duration\n When the affected target is brought into   Supernova and the  Phoenix Sun is destroyed or denied\n When affected by   Wraith Delay"
      ],
      "item_behaviour": [],
      "description": "All creeps, ally, enemy and neutral within a radius will gain bonus movement and attack speed and attack Enchantress' chosen target for 6 seconds.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range:  600",
        "Search Radius: 1200",
        "Taunt Move Speed Bonus: 100%",
        "Taunt Attack Speed Bonus: 100",
        "Duration: 6"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Units"
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Little Friends",
      "cooldown": "75",
      "legacy_key": "L",
      "story": null
    },
    {
      "notes": [
        "Untouchable is triggered whenever a unit, including vulnearble wards, starts an attack on Enchantress, regardless of distance\n This means it does not matter if the attack successfully hits or not, the slow is still applied\n Does not work against buildings, allies, or invulnerable units",
        "When the attack was fully executed, then the slow debuff lasts as long as the remaining backswing duration of the attack\n Canceling the attack backswing does not affect this duration, so it is not possible to reset the attack speed by canceling it\n When switching attack targets, the debuff persists, but does not apply the slow against the new target\n The debuff persists until the attack against the new target finishes or gets canceled\n This means it is possible to skip the backswing-based slow duration by issuing an attack order (A) on a new target within attack range between each attack\n This also means, the debuff does not affect the idle animation in attack animation after the backswing",
        "The attack speed slow duration is not affected by status resistance"
      ],
      "item_behaviour": [],
      "description": "Enchantress beguiles her enemies, slowing their attacks when she is attacked.",
      "hot_key": "R",
      "params": [
        "Attack Speed Slow: 120\/160\/200 ( 185\/225\/265)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Enchantress_Untouchable.mp3\/revision\/latest?cb=20191216013607",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Untouchable",
      "cooldown": null,
      "legacy_key": "N",
      "story": "After attacking Aiushtha, most opponents are overwhelmed with guilt having attacked such a natural beauty."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.7,
    "attrStrength": 17.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 2.1,
    "attrAgility": 19.0
  },
  "description": "Enchants neutral creeps to do her bidding. \"Sproink!\" Carefree and pure of heart, Aiushtha wanders the forests, listening to the stories of its inhabitants. Nature's Attendants flutter around her, lively sprites that heal critters big and small. When necessary, she Enchants woodland creatures to do her bidding. A perfect image of Untouchable innocence, hunters hesitate to make even the slightest move against Aiushtha. This reluctance is seldom reciprocated. Threats against her Little Friends embolden the Enchantress to break her gentle demeanor, giving her the Impetus to bring those who disturb the peace to a swift and final justice.  Support Jungler Pusher Durable Disabler ★★☆",
  "trivia": [
    "Unlike most heroes, Enchantress's attack projectiles actually use the model of her equipped cosmetic weapon.",
    "Enchantress' alternate\/fun name in DotA was Bambi, referencing the classic Disney animated film of the same name.",
    "Enchantress' phrases Link▶️ \"Light of foot, light of heart!\", Link▶️ \"With skipping grace\", and Link▶️ \"Oh do not run too fast for I will but bespeak thy grave and die\" derive from Andrew Marvell's poem \"The Nymph Complaining for the Death of her Fawn\".",
    "Enchantress' line Link▶️ \"I guess the good do die young.\" is a reference to the 1977 song by Billy Joel \"Only the Good die young\".",
    "The line Link▶️ \"Ready or not, here I come!\" is a reference to the traditional announcement at the start of the childhood game of Hide and Seek, and possibly a reference to the song Ready or Not Here I Come (Can't Hide from Love) originally created by the Delfonics."
  ],
  "history": "Aiushtha appears to be an innocent, carefree creature of the woods, and while this is certainly true, it is hardly the sum of her story. She well understands the suffering of the natural world. She has wandered far, and fared through forests bright and drear, in every clime and every season, gathering friends, sharing news, bringing laughter and healing wherever she goes. For in worlds wracked by war, forests are leveled for the building of ships and siege engines; and even in places of peace, the woods are stripped for the building of homes, and as fuel for countless hearths. Aiushtha hears the pleas of the small creatures, the furtive folk who need green shade and a leafy canopy to thrive. She lends her ears to those who have no other listeners. She carries their stories from the wood to the world, believing that her own good cheer is a kind of enchantment, that can itself fulfill the promise of a verdant future.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+6.5% Impetus Damage",
        "talent_left": "+20 Nature's Attendants Heal"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+65 Untouchable Slow",
        "talent_left": "Enchant Affects Ancients"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+45 Damage",
        "talent_left": "+5 Nature's Attendants Wisps"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+10% Magic Resistance",
        "talent_left": "+30 Movement Speed during Nature's Attendants"
      }
    ],
    "notes": [
      "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Enchantress's magic resistance to 32.5%.",
      "Increases Enchantress's magic resistance to 32.5%.",
      "This attack damage talent is added as bonus attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
      "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
    ]
  }
}