{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Число воинов: 2",
        "Число лучников: 2",
        "Длительность: 75",
        "Доп. здоровье: 100%",
        "Доп. урон от атаки: 75%"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца.",
        "Призванные существа всегда появляются перед заклинателем.",
        "Повторное использование предмета заменит существ из предыдущего применения, неважно под чьим они контролем. Однако, повторное применение со второго Book of the Dead (украденного у врага, или скопированного Tempest Double) создаст новых существ.",
        "Однако, повторное применение со второго Book of the Dead (украденного у врага, или скопированного Tempest Double) создаст новых существ.",
        "Призываемые существа не могут попасть под действие Helm of the Dominator или Helm of the Overlord, а воин — под действие Hand of Midas. Однако, их можно выбрать любым другим перенимающим или мгновенно убивающим заклинанием (например, Holy Persuasion или Devour).",
        "Однако, их можно выбрать любым другим перенимающим или мгновенно убивающим заклинанием (например, Holy Persuasion или Devour)."
      ],
      "mana": "0",
      "abilityName": "Greater Demonic Summoning",
      "cooldown": "80",
      "description": "Призывает 4 существ от Necronomicon 3-го уровня, которые живут 75 секунд и имеют на 100% больше здоровья и на 75% больше урона.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Сжигание маны за удар: 50",
        "Сожженой маны в урон: 50%"
      ],
      "notes": [
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "В среднем усиливает урон воина Некрономикона на 15\/20\/25, если у юнита достаточно маны для выжигания.",
        "Сначала сжигает ману, затем наносит урон.",
        "Действует на союзных существ при атаке.",
        "Складывается с другими источниками сожжения маны."
      ],
      "mana": null,
      "abilityName": "Mana Break",
      "cooldown": null,
      "description": "Каждая атака сжигает ману цели и наносит ей урон, равный доле от сожжённой маны.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Урон: 800"
      ],
      "notes": [
        "Не влияет на союзных существ, поэтому воина можно добить без получения урона.",
        "Расстояние между воином Некрономикона и его убийцей не важно.",
        "При убийстве воина сначала даются золото и опыт, а затем наносится урон.",
        "Не влияет на варды и постройки."
      ],
      "mana": null,
      "abilityName": "Last Will",
      "cooldown": null,
      "description": "Наносит урон убийце воина Некрономикона.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1000",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Доступна только для воина Некрономикона 3-го уровня.",
        "Раскрытие невидимости дается на всю область, независимо от текущего обзора воина. Эффект беспрепятственен.",
        "True Sight — это аура, влияющая на врагов. Её дебафф задерживается на 0,5 сек.",
        "Не может обнаружить существ под эффектом Shadow Dance, Smoke of Deceit и мины Techies под эффектом улучшенной Aghanim's Scepter Minefield Sign."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Раскрывает невидимых существ.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cc\/Necronomicon_Archer_Purge.mp3\/revision\/latest?cb=20191227200433",
      "effects": [
        "Анимация применения: 0,3+0,47",
        "Дальности применения: 600",
        "Замедление скорости передвижения: 100%",
        "Длительность замедления: 4"
      ],
      "notes": [
        "Доступна только на 3-ем уровне лучника Некрономикона.",
        "При использовании применяет к цели базовое развеивание.",
        "Purge сначала применяет развеивание, затем — замедление.",
        "Замедление уменьшается с интервалом в 0,8 секунды, замедляя на 100%\/80%\/60%\/40%\/20% и меняясь каждые 0,8 секунды.",
        "Можно применить к неуязвимым существам."
      ],
      "mana": null,
      "abilityName": "Purge",
      "cooldown": null,
      "description": "Снимает положительные эффекты с противников и замедляет их передвижение.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Book of the Dead",
  "description": "Записи о последнем суде. Одну страницу кто-то вырвал.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}