{
  "abilities": [
    {
      "notes": [
        "The pulses travel at a speed of 400",
        "Affects invisible units and units in Fog of War\n Does not affect invulnerable and hidden units\n Fully affects allied  Couriers",
        "Death Pulse heals Necrophos for the following values while  Ghost Shroud is active on each level: Level 1: 61.6\/89.6\/117.6\/145.6 ( 97.44\/125.44\/153.44\/181.44) Level 2: 63.8\/92.8\/121.8\/150.8 ( 100.92\/129.92\/158.92\/187.92) Level 3: 66\/96\/126\/156 ( 104.4\/134.4\/164.4\/194.4) Level 4: 68.2\/99.2\/130.2\/161.2 ( 107.88\/138.88\/169.88\/200.88)"
      ],
      "item_behaviour": [],
      "description": "Necrophos releases a wave of death around him, dealing damage to enemy units and healing allied units.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0+0.77",
        "Search Radius: 500",
        "Projectile Speed: 400",
        "Damage: 100\/160\/220\/280",
        "Heal: 55\/80\/105\/130 ( 87\/112\/137\/162)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Necrophos_Death_Pulse.mp3\/revision\/latest?cb=20191216020945",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies \/ Allies",
        "Damage: Magical"
      ],
      "mana": "8\/7\/6\/5 (TagTalent 5.5\/4.5\/3.5\/2.5)",
      "aghanim": null,
      "name": "Death Pulse",
      "cooldown": "100\/130\/160\/190",
      "legacy_key": "D",
      "story": "Poor souls who succumb to Rotund'jere's plagues are recycled for future use."
    },
    {
      "notes": [
        "Interrupts Necrophos' channeling abilities upon cast",
        "Turns Necrophos ethereal, disarming him, rendering him attack immune and granting 100% physical damage resistance",
        "Reduces Necrophos' total magic resistance to 6.25%",
        "The magic resistance reduction of multiple ethereal effects does not stack, the one with higher value takes priority",
        "Applies heal amplification, health regen amplification, mana restore amplification, and mana regen amplification\n Does not apply lifesteal amplification or spell lifesteal amplification",
        "The movement speed slow is provided by an aura and its debuff lingers for 0.5 seconds"
      ],
      "item_behaviour": [],
      "description": "Necrophos slips into the realm that separates the living from the dead. Unable to attack or be attacked, he emits an aura that slows enemies around him. He takes additional magic damage in this form, but his restorative powers are amplified.",
      "hot_key": "W",
      "params": [
        "Cast Animation:  0+0",
        "Slow Radius: 750",
        "Enemy Move Speed Slow: 12%\/16%\/20%\/24% ( 36%\/40%\/44%\/48%)",
        "Self Restoration Amplification: 45%\/55%\/65%\/75% ( 60%\/70%\/80%\/90%)",
        "Self Magic Resistance Reduction: 25%",
        "Aura Linger Duration: 0.5",
        "Duration: 3\/3.5\/4\/4.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Necrophos_Ghost_Shroud.mp3\/revision\/latest?cb=20191216020946",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies"
      ],
      "mana": "28\/24\/20\/16 (TagTalent 22\/18\/14\/10)",
      "aghanim": null,
      "name": "Ghost Shroud",
      "cooldown": "50",
      "legacy_key": "T",
      "story": "Rotund'jere uses the souls of his victims as bridge from life to afterlife."
    },
    {
      "notes": [
        "The debuff from Heartstopper Aura lingers for 0.5 seconds",
        "The health loss from Heartstopper Aura is direct HP Removal, so it does not trigger any on-damage effects",
        "The damage has the no-spell-amplification flag, preventing its damage from being amplified with spell damage amplification\n However, its damage can be further increased by magic resistance reduction instead",
        "Deals 0.12%\/0.24%\/0.36%\/0.48% ( 0.22%\/0.34%\/0.46%\/0.58%) of the affected unit's max health as damage in 0.2-second intervals, starting 0.2 seconds upon learning ability",
        "The status debuff icon on enemies only shows up when the affected unit has vision over Necrophos\n However, the floating damage numbers are always visible",
        "Does not affect ancient creeps",
        "Grants Necrophos one regeneration stack per last hit he makes, including denying allied units and destroying buildings, except from killing illusions and the  Tempest Double\n All stacks work fully independently from each other\n They do not refresh each other but share a status buff\n The number of current stacks is visible on the buff\n Each stack can regenerate up to 32\/40\/48\/56 ( 40\/50\/60\/70) health and mana for its entire duration\n Hero kills grant 6 stacks at once, which can regenerate up to 192\/240\/288\/336 (240\/300\/360\/420) health and mana for its entire duration",
        "With level 4  Ghost Shroud and level 4 Heartstopper Aura, one stack can regenerate up to 79.63 ( 98.35) health and mana for its entire duration\n For the total of health and mana regenerated per level, please refer to the chart below",
        "SCEPTER NOTES Heartstopper Aura deals 0.24%\/0.48%\/0.72%\/0.96% ( 0.44%\/0.68%\/0.92%\/1.16%) of the affected unit's max health as damage in 0.2-second intervals during  Ghost Shroud\n In total, it deals 1.2%\/2.4%\/3.6%\/4.8% ( 2.2%\/3.4%\/4.6%\/5.8%) of max health as damage per second, as long as Necrophos is affected by Ghost Shroud\n The ability values are immediately update upon acquiring or dropping <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter",
        "TALENT NOTES The regen reduction  talent only adds health regeneration reduction to Heartstopper Aura, but not heal reduction, lifesteal reduction, or spell lifesteal reduction\n The max health lost per second increasing  talent does not upgrade the damage for already affected units until they lose the debuff and then get affected again"
      ],
      "item_behaviour": [],
      "description": "Necrophos stills the hearts of his opponents, causing nearby enemy units to lose a percentage of their max health over time. Passively provides regen for 8 seconds for each unit Necrophos kills.",
      "hot_key": "E",
      "params": [
        "Radius: 800",
        "Max Health Lost per Second: 0.6%\/1.2%\/1.8%\/2.4% ( 1.1%\/1.7%\/2.3%\/2.9%)",
        "Ghost Shroud Damage Multiplier: 1 ( 2)",
        "Stacks per Hero Kill: 6",
        "Stacks per Non-Hero Kill: 1",
        "Health Regen Bonus per Stack: 4\/5\/6\/7",
        "Mana Regen Bonus per Stack: 4\/5\/6\/7",
        "Stack Duration: 8 ( 10)",
        "Aura Linger Duration: 0.5",
        "Health Regen Reduction:  32%"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Aura",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Heartstopper Aura",
      "cooldown": null,
      "legacy_key": "I",
      "story": "Those who come within a short distance of the Necrophos can feel pestilence and plague in the air."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Cannot be cast on self",
        "The projectile travels at a speed of 900",
        "Death Seeker first applies its debuff, then releases the Death Pulse",
        "Turns the target ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance\n Reduces most enemy heroes' total magic resistance to 6.25%\n Stacks multiplicatively with other sources of magic resistance",
        "The magic resistance reduction of multiple ethereal effects does not stack, the one with higher value takes priority",
        "The released  Death Pulse is based on its current level\n Death Pulse's notes fully apply\n If Death Pulse is not learned, no projectile is released on cast, wasting the mana and cooldown\n If the target is invulnerable or hidden on impact, the Death Pulse is not released\n The Death Pulse effectively deals 125\/200\/275\/350 damage against the targeted enemy\n SPELL STEAL  Death Pulse released is based on  Necrophos' current ability level when acquired\n SOULBIND Launch projectile to the primary target first, then the secondary target"
      ],
      "item_behaviour": [],
      "description": "Spawns a fast moving large Death Pulse towards the target enemy or ally, causing the target to become ethereal. Reduces enemy magic resistance. Spreads towards nearby enemies and allies after impact.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.2+0.67",
        "Cast Range:  900",
        "Projectile Speed: 900",
        "Enemy Magic Resistance Reduction: 25%",
        "Duration: 2.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Necrophos_Death_Seeker.mp3\/revision\/latest?cb=20210101213914",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies \/ Enemies"
      ],
      "mana": "16",
      "aghanim": null,
      "name": "Death Seeker",
      "cooldown": "125",
      "legacy_key": "C",
      "story": null
    },
    {
      "notes": [
        "The damage is calculated and dealt to the target at the end of the stun duration\n The stun duration is unaffected by status resistance",
        "Deals enough damage (before reductions) to kill the target when it is at 41%\/44%\/47% of max health\n Shares one instance of 0 damage when triggering damage shared sources (e.g\n  Fatal Bonds)\n SHARD NOTES With  Death Seeker, Reaper's Scythe deals enough damage to kill the target when it is at 51%\/56%\/59% of max health",
        "Reaper's Scythe has the highest priority in the group of kill credit manipulation effects\n All damage dealt to the affected target, including from allies, during the stun duration is sourced to Reaper's Scythe, and credited to Necrophos\n This means when combined with other kill credit manipulation effects (e.g\n  Winter's Curse), the kill credit is still given to Necrophos",
        "However, the following conditions do not credit Necrophos with the kill credit: When  Spirit Bear is instantly killed due to its owner dying while affected by Reaper's Scythe, without the   Summon Spirit Bear upgrade\n When the affected target is brought into   Supernova during the stun duration\n When the affected target is swallowed by   Dismember during the stun duration and is not  Ejected when the damage is dealt\n When the affected target is affected by a reflected  Omnislash or  Swiftslash\n In the case of Swiftslash, it must still be occuring when the damage is dealt\n When  Meepo or its  Meepo Clones is instantly killed due to either the Prime or any one of its clones dying, including being denied, during the stun duration",
        "Grants Necrophos a stack as long as he was credited for the kill\n Grants a stack even if the dying hero has Reincarnation, or killing illusions and creep-heroes, but not the  Tempest Double\n The number of stacks gained can be seen on the status buff icon\n The current health and mana regeneration bonus can be seen in its description\n The health and mana regeneration bonuses granted are not retroactive\n All stacks retain their values from when it was first acquired"
      ],
      "item_behaviour": [],
      "description": "Stuns the target enemy hero, then deals damage based on how much life it is missing. If Necrophos kills an enemy this way, he'll permanently gain Health and Mana Regen. Any kill under this effect is credited to Necrophos.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.45+1.5",
        "Cast Range:  600 ( 700)",
        "Damage per Missing Health: 0.7\/0.8\/0.9",
        "Health Regen Bonus per Kill: 2\/4\/6",
        "Mana Regen Bonus per Kill: 1\/2\/3",
        "Stun Duration: 1.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a9\/Necrophos_Reaper%27s_Scythe.mp3\/revision\/latest?cb=20191216020948",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Heroes",
        "Damage: Magical"
      ],
      "mana": "110",
      "aghanim": null,
      "name": "Reaper's Scythe",
      "cooldown": "250\/375\/500",
      "legacy_key": "R",
      "story": "The amount of death and suffering in the air increases the power of the Necrophos's plague magic."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 18.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.7,
    "attrAgilityInc": 1.3,
    "attrAgility": 12.0
  },
  "description": "Damages enemies and heals allies simultaneously. Sentenced to a slow death by plague, the corrupt cardinal Rotund'jere instead found himself infected, but miraculously immune. Proclaiming himself the Necrophos, he set out to spread disease far and wide. Cloaked in a Ghost Shroud, the cardinal's ethereal presence chills his surroundings, while those who wander too close, seemingly Seeking Death, are struck by waves of Deadly Pulses. The most afflicted are often the first to die. Once his very presence has slowly Stopped their Hearts, he culls the infirm with a single swing of the Reaper's Scythe, permanently boosting his own regeneration. Wherever Necrophos goes, enemies wither as allies thrive.  Carry Nuker Durable Disabler ★☆☆",
  "trivia": [
    "Necrophos's response, Link▶️ \"My name is lesion!\" probably has to do with the Bible passage Mark 5:9, that reads in the NIV, \"Then Jesus asked him, 'What is your name?' 'My name is Legion,' he replied, 'for we are many.' \"",
    "Necrophos's response, Link▶️ \"You reap what you sow.\" might be from the Bible's passage Galatians 6:7 \"Do not be deceived, God cannot be mocked. You reap what you sow.\"",
    "Necrophos's response Link▶️ \"Red Death.\" may be a reference to the Edgar Allen Poe short story of the same name.",
    "Necrophos' response Link▶️ \"Die young and leave a purulent corpse.\" is a reference to the James Dean quote: \"Live fast, die young, leave a good looking corpse.\"",
    "Necrophos's alternate\/fun name was \"A Phoe Gyi\", which means \"an old man\" in the Burmese language. It also sounds similar to 'a fogey', which is an elderly, normally grumpy individual.",
    "Necrophos's original title in DotA was \"Necrophiliac\"; his designer altered the name to \"Necrolyte\" (a portmanteau of nekros (νεκρός), the Greek word for corpse, and acolyte, a religious attendant) upon realizing its implied sexual connotation. In the November 21, 2013 Patch, Necrolyte's name was changed to Necrophos, likely to avoid copyright issues with Blizzard. As phos (φῶς) is the Greek word for light, it is a pun on the homonym of \"Necrolight\" of his former name. In the same update, extra filters were added to Necrophos' voice, along with a 10% higher pitch, to make him sound more distinct from Warlock. However, (most likely) a typo caused his voice to be played at 10% pitch, instead at the desired 110% pitch, causing his voice to be much deeper and slower than intended.",
    "In the November 21, 2013 Patch, Necrolyte's name was changed to Necrophos, likely to avoid copyright issues with Blizzard. As phos (φῶς) is the Greek word for light, it is a pun on the homonym of \"Necrolight\" of his former name.",
    "In the same update, extra filters were added to Necrophos' voice, along with a 10% higher pitch, to make him sound more distinct from Warlock. However, (most likely) a typo caused his voice to be played at 10% pitch, instead at the desired 110% pitch, causing his voice to be much deeper and slower than intended."
  ],
  "history": "In a time of great plague, an obscure monk of dark inclinations, one Rotund'jere, found himself promoted to the rank of Cardinal by the swift death of all his superiors. While others of the order went out to succor the ill, the newly ordained cardinal secluded himself within the Cathedral of Rumusque, busily scheming to acquire the property of dying nobles, promising them spiritual rewards if they signed over their terrestrial domains. As the plague receded to a few stubborn pockets, his behavior came to the attention of the greater order, which found him guilty of heresy and sentenced him to serve in the plague ward, ensorcelled with spells that would ensure him a slow and lingering illness. But they had not counted on his natural immunity. Rotund'jere caught the pox, but instead of dying, found it feeding his power, transforming him into a veritable plague-mage, a Pope of Pestilence. Proclaiming himself the Necrophos, he travels the world, spreading plague wherever he goes, and growing in terrible power with every village his pestilential presence obliterates.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+0.5% Heartstopper Aura",
        "talent_left": "-2.5s Death Pulse Cooldown"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+15% Ghost Shroud Self Restoration Amp",
        "talent_left": "+32% Heartstopper Regen Reduction"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+24% Ghost Shroud Slow",
        "talent_left": "+32 Death Pulse Heal"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+100 Reaper's Scythe Cast Range",
        "talent_left": "+2s Heartstopper Aura Stack Duration"
      }
    ]
  }
}