{"abilities":[{"effects":["Default Cast Range: 800","Buffer Cast Range: 1050","Fade Time: 0.6","Magic Resistance Bonus: 45%","Duration: 5"],"notes":["Does not interrupt the user's channeling spells upon cast, neither when cast on self, nor when cast on allies.","If the target is more than 1050 range away, the caster moves to the target until it is within 800 range before casting. If a cast order is given on a target which is within 1050 range already, the caster does not need to move closer and casts it right away.","When casting on allies, the user does not have to face the targeted ally to cast it. Does not interrupt the target's channeling spells.","Places a buff on an allied hero. As long as this buff stays on it, the hero keeps on turning invisible.","The fade time is reset and invisibility is lost upon reaching the cast point of spells or items or upon performing an attack.","While invisible, the unit can pick up or drop items without having to go through the fade time again.","While invisible, the unit is phased, meaning other units can walk through it without getting blocked.","The magic resistance is only applied when fully invisible. It is not applied during the fade time.","Increases most heroes' total magic resistance to 58.75%, assuming basic 25% magic resistance and no other sources of magic resistance. Increases Visage's total magic resistance to 50.5%, assuming his basic 10% magic resistance and no other sources of magic resistance."],"elements":["Ability Target Unit","Affects Allies"],"name":"Glimmer","description":"After a 0.6 second delay, grants invisibility and 45% magic resistance to you or a target allied unit for 5 seconds. Can be cast while channelling."}],"cost":"1950","description":"The stolen cape of a master illusionist.","further":["Shadow_Amulet","Cloak"],"tips":["Assuming no sources of magic resistance other than the wearer's Glimmer Cape itself and base magic resistance, the Glimmer active ability reduces the amount of magic damage taken to 35.06% if used on the wearer and 41.25% if used on an ally (42.08% and 49.5% on Visage).","You can use the glimmer cape while teleporting away. This helps the wearer against disables which will interrupt the channeling."],"attrs":["Active Glimmer","Bonus +20 Attack speed +15% Magic resistance","Disassemble? No","Alert allies? No"],"info":["The magic resistance stacks multiplicatively with other sources of magic resistance.","Increases most heroes' total magic resistance to 36.25%, assuming basic 25% magic resistance and no other sources of magic resistance. Together with the active, this is further increased to 64.94%.","Increases Visage's total magic resistance to 23.5%, assuming his basic 10% magic resistance and no other sources of magic resistance. Together with the active, this is further increased to 57.93%."]}