{"abilities":[{"effects":["Стандартная дальность применения: 800","Дальность применения баффа: 1050","Время до невидимости: 0,6","Бонус к сопротивлению магии: 45%","Длительность: 5"],"notes":["Не прерывает большинство произносимых заклинаний при использовании, ни когда применяется на себя, ни на союзников.","Если цель находится на расстоянии, превышающее 1050 единиц, то владелец предмета будет двигаться в сторону цели до достижения между ними расстояния в 800. Если приказ на применение был дан на цель, находящуюся в пределах 1050 единиц, то владельцу не нужно будет перемещаться и он использует предмет сразу же.","Заклинатель не поворачивается при использовании на союзников. Не прерывает произносимые заклинания цели.","Применяет положительный эффект на союзных героев. Пока эффект будет оставаться на них, они будут оставаться невидимыми.","Атака, применение заклинаний или использование предметов во время до невидимости обновит его.","В невидимости герой может поворачиваться, поднимать и выкидывать предметы без повторного времени до невидимости.","В невидимости юнит получает способность к сквозному движению, что позволяет другим юнитам проходить через цель без столкновения с ней.","Сопротивление магии накладывается только при полной невидимости. Не накладывается во время ухода в невидимость.","Увеличивает общее сопротивление магии большинства героев до 58.75%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления. Увеличивает общее сопротивление магии Visage до 58.75%, учитывая его базовое сопротивление в 25% и не учитывая другие источники сопротивления."],"elements":["Способность Направленная на юнита","Действует на Союзников"],"description":"С задержкой в 0,6 сек. накладывает на героя или выбранного союзника невидимость и увеличивает сопротивление магии на 45%. Действует 5 сек. Не останавливает прерываемые способности."}],"cost":"1950","description":"Украденная накидка великого иллюзиониста.","further":["Shadow_Amulet","Cloak"],"attrs":["Активируемая Glimmer","Бонус +20 к скорости атаки +15% к сопротивлению магии","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Сочетается по закону убывающей полезности с другими источниками сопротивления магии.","Увеличивает общее сопротивление магии большинства героев до 36.25%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления.","Увеличивает общее сопротивление магии Visage до 36.25%, учитывая его базовое сопротивление в 25% и не учитывая другие источники сопротивления."]}