{
  "abilities": [
    {
      "notes": [
        "Жуки появляются в радиусе 300 единиц от Weaver (в случайном месте) и движутся вперед со скоростью в 750 единиц, достигая за 4 сек\n максимальной дистанции\n  Жуков нельзя атаковать в рое, пока они не зацепятся за цели\n Жуки дают летающий обзор, пока движутся по прямой или прикреплены к существам\n У жуков наивысший приоритет для цели автоатаки — как и у  фантома\n Жуки цепляются за существ на расстоянии до 3400 единиц (складывается из радиуса появления, дистанции прохождения и радиуса цепляния)",
        "Если вражеское существо находится в радиусе 100 единиц от жуков, один из них цепляется за цель, если на ней его ещё нет\n В зацепленном состоянии жуки всегда находятся в 64 единицах перед существом\n Несколько применений не могут действовать на одно и то же существо одновременно\n Жуки могут цепляться за неуязвимых существ, но не за невидимых или спрятанных\n Жук и его зацеплённая цель взаимодействуют следующим образом: Если цель стала невидимой после зацепления, то, если на цель не действует раскрытие невидимости, жук мгновенно умирает\n Однако с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, жуки могут цепляться за невидимых существ (игнорируя невосприимчивость к раскрытию невидимости), даруя на цели эффект раскрытия невидимости\n Если цель жука спряталась после его зацепления, то жук все равно останется\n Если жуки находятся под действием  Chronosphere, то они мгновенно умирают\n Если жуки мгновенно умирают, их смерть никому не засчитывается",
        "Жук атакует цель каждые 1,15\/1\/0,85\/0,7 сек\n сразу после зацепления, атакуя 14\/17\/19\/23 раз\n Источником урона является сам Weaver, а не жуки\n Фактически жуки не атакуют цели, а применяют к ним заклинание\n Из-за этого на урон влияют усиление урона заклинаний и вампиризм заклинаний\n Наносит до 252\/340\/418\/552 урона каждому задетому врагу (до уменьшений)",
        "Снижение брони срабатывает с тем же интервалом, что и урон, но применяется до нанесения урона\n Снижение брони привязано к жукам и не связано с уроном\n Жуки продолжают снижать броню существам в призрачной форме, но не неуязвимым целям\n Снижает броню до 14\/17\/19\/23 ( 21\/25,5\/28,5\/34,5) единиц каждому существу",
        "В каждом интервале жуки сначала снижают броню, а затем наносят урон"
      ],
      "item_behaviour": [],
      "description": "Герой выпускает рой из 12 жуков, которые цепляются за врагов на своём пути. Жуки наносят урон и снижают броню цели до тех пор, пока не умрут.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 3000",
        "Макс\n дистанция прохождения: 3000",
        "Радиус появления жуков: 300",
        "Радиус зацепления жуков: 100",
        "Число жуков: 12",
        "Атак не-героев для убийства: 6\/6\/8\/8 ( 8\/8\/10\/10)",
        "Атак героев для убийства: 3\/3\/4\/4 ( 4\/4\/5\/5)",
        "Интервал урона: 1,15\/1\/0,85\/0,7",
        "Урона за интервал: 18\/20\/22\/24",
        "Снижение брони за срабатывание: 1 ( 1,5)",
        "Длительность: 16"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Weaver_The_Swarm_1.mp3\/revision\/latest?cb=20191216030509",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": "44\/36\/28\/20",
      "aghanim": null,
      "name": "The Swarm",
      "cooldown": "110",
      "legacy_key": "R",
      "story": "Скитскур разрывает материю пространства и времени, пропуская через прореху молодых жуков, что помогут в битве."
    },
    {
      "notes": [
        "При использовании Shukuchi не прерывает произносимые заклинания Weaver",
        "При применении невидимость позволяет избегать снаряды, если враги не обладают раскрытием невидимости",
        "За применение наносит урон каждому существу лишь один раз",
        "Во время ухода в невидимость Weaver может использовать способности и предметы и совершать атаки без выхода из невидимости",
        "Невидимость прерывается при достижении анимации применения заклинаниями или предметами или атаке цели\n При промахе невидимость не прерывается\n Weaver может поднимать или выкидывать предметы без выхода из невидимости",
        "Также на время дает Weaver ускорение и сквозное передвижение, поэтому его нельзя замедлить\n В отличии от других заклинаний невидимости, позволяющих проходить сквозь существ, Shukuchi дает возможность Weaver мгновенно проходить через них без ожидания полной невидимости",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Получение дающего заряды Shukuchi  таланта мгновенно даёт 1 дополнительный заряд",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Shukuchi накладывает 6-секундную метку на всех задетых противников"
      ],
      "item_behaviour": [],
      "description": "Герой уходит из зоны видимости, что позволяет ему передвигаться с максимальной скоростью и наносить урон врагам, через которых он проходит.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0,25",
        "Радиус урона: 175",
        "Урон: 100\/125\/150\/175 ( 150\/175\/200\/225)",
        "Скорость ускорения: 550",
        "Длительность: 4",
        "Длительность метки:  6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Weaver_Shukuchi.mp3\/revision\/latest?cb=20191216030508",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "15\/12\/9\/6 (TagTalent 0)",
      "aghanim": null,
      "name": "Shukuchi",
      "cooldown": "15\/12\/9\/6",
      "legacy_key": "C",
      "story": "Когда ткачи плели материю мироздания, маленькие пространственно-временные туннели позволяли им скользить сквозь время, чтобы лучше выполнять свою работу."
    },
    {
      "notes": [
        "Когда Geminate Attack изучена в первый раз, по умолчанию будет включено Автоприменение\n Несмотря на то что Geminate Attack является активной способностью, она сработает во время действия безмолвия, если включено Автоприменение",
        "Позволяет Weaver совершить 1 ( 2) мгновенные атаки по цели спустя 425 сек\n после основной\n Атака может активировать любые модификаторы атаки или любые эффекты, срабатывающие при атаке\n У атак нет эффекта True Strike, но они игнорируют обезоруживание\n Мгновенные атаки не выводят из невидимости от  Smoke of Deceit",
        "Дополнительный урон применяется только к дополнительным атакам\n Для атаки Weaver должен быть жив\n Нет ограничения по дальности атаки Geminate Attack\n Даже если основная атака убила цель до срабатывания дополнительной, дополнительные удары выберут в качестве цели мертвое существо",
        "Действует на вражеские постройки, курьера и варды, за исключением предмета  Варды",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Атаки от Geminate Attack выбирают каждое вражеское существо, находящееся под действием метки от  Shukuchi в радиусе 1200 от цели\n Срабатывает на врагов, отмеченных как Weaver, так и союзников (например, созданных с помощью  Morph)\n В отличии от повторных атак по основной цели, эти не активируют модификаторы атаки или эффекты, срабатывающие при атаке\n Вспомогательные атаки запускаются так же, как и атаки по основной цели"
      ],
      "item_behaviour": [],
      "description": "Позволяет герою совершить несколько атак одновременно.",
      "hot_key": "E",
      "params": [
        "Дальность применения:  425",
        "Задержка: 0,25",
        "Число доп\n атак: 1 ( 2)",
        "Доп\n урон: 15\/30\/45\/60 ( 105\/120\/135\/150)",
        "Радиус поиска отмеченных целей:  1200"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Weaver_Geminate_Attack.mp3\/revision\/latest?cb=20191216030516",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Мгновенная атака"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Geminate Attack",
      "cooldown": null,
      "legacy_key": "K",
      "story": "В какой-то мере Скитскурр существует вне понятия времени, отчего его действия видят — и чувствуют — совсем не единожды."
    },
    {
      "notes": [
        "Weaver получает приказ на отмену действий после возвращения, из-за этого остаточная анимация Time Lapse автоматически отменяется\n При этом ⇧ Shift-очередь команд не отменяется",
        "Time Lapse позволяет избегать снаряды и применяет сильное развеивание\n Влияет только на местоположение, здоровье, ману и дебаффы Weaver\n Баффы не снимаются",
        "Возвращает уровень здоровья героя или союзной цели на то, что было 5 секунд назад\n Time Lapse не наносит урон Weaver, а манипулирует его здоровьем, поэтому способность не взаимодействует с любыми эффектами, реагирующими на урон\n При использовании сразу после возрождения здоровье, мана и местоположение героя устанавливаются на те значения, которое были до его смерти\n То есть Time Lapse не убивает применившего, если способность использовали сразу после возрождения",
        "С <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter Time Lapse превращается в направляемое на существо заклинание, которым можно выбирать союзных героев\n ↓↓ Двойное нажатие автоматически выбирает себя\n Целью способности могут быть только герои, включая клонов и иллюзии, но не крипов-героев\n Не отдает приказ на отмену действий, поэтому произносимые способности не прерываются\n Остаточная анимация есть только при применении на союзника, в то время как при применении на себя она автоматически отменяется\n При использовании на недавно возрожденного союзника его здоровье, мана и местоположение не возвращается к тем, что были до смерти\n То есть союзника после возрождения нельзя отправить обратно к месту смерти, в отличии от Weaver"
      ],
      "item_behaviour": [],
      "description": "Герой перемещается в положение, где он был пять секунд назад, возвращая уровень здоровья и маны на прежний уровень. Не действует на перезарядку способностей и предметов, а также на золото и опыт.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,53",
        "Возвращаемое время: 5",
        "Дальность применения:  500"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Weaver_Time_Lapse.mp3\/revision\/latest?cb=20191216030512",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя "
      ],
      "mana": "70\/55\/40 (TagTalent 40)",
      "aghanim": null,
      "name": "Time Lapse",
      "cooldown": "150\/75\/0",
      "legacy_key": "T",
      "story": "Если Скитскур считает, что текущая реальность не удовлетворяет его желаниям, он просто уползает назад во времени, чтобы исправить огрехи."
    },
    {
      "notes": [
        "Добавляет к атакам Weaver эффект сжигания маны, позволяя ему выжигать ману цели и наносить урон, основанный на сожженой мане",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки\n От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим\n На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение",
        "В среднем увеличивает урон Weaver на 16, если у существа достаточно маны для выжигания\n В среднем увеличивает урон иллюзий Weaver на 8, если у существа достаточно маны для выжигания",
        "Сначала выжигает ману, затем наносит урон",
        "Не действует при атаке союзных существ",
        "Сочетается с другими источниками сжигания маны"
      ],
      "item_behaviour": [],
      "description": "Для этой способности нет описания.",
      "hot_key": "?",
      "params": [
        "Сжигает маны за удар: 20",
        "Иллюзии сжигают ману за удар: 10",
        "Урон от сожженной маны: 80%"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Выжигание маны",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 16.0,
    "attrIntelligence": 20.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 3.1,
    "attrAgility": 17.0
  },
  "description": "Обращает время вспять, чтобы вернуть свои здоровье и местоположение Weaver сбегает от врагов лишь для того, чтобы напасть вновь. Он способен на время стать невидимым или вовсе ускользнуть от смерти, вернув своё местоположение и состояние здоровья на несколько секунд назад. Его изворотливость и армия жуков позволяют доставлять врагам массу неприятностей.  Керри Побег ★★☆",
  "history": "Вселенная, словно ткань или материя, постоянно нуждается в уходе. Множество ткачей, подобных Weaver, неустанно следят за состоянием вселенной, укрепляя связи в ней и не давая мирам разорваться почти в буквальном смысле. Ткачи защищают материю от порождений тьмы, которые разгрызают её и стремятся взрастить своё потомство в незащищённых местах. Ткач Weaver по имени Скитскур был мастером своего дела. В его владениях был один из постоянно рассыпающихся участков вселенной, и Скитскур из раза в раз восстанавливал его, выполняя свою работу лучше, чем кто бы то ни было. Но его очень раздражало, что вся созидательная работа осталась в прошлом. Скитскур начал болеть идеей о том, чтобы соткать свой собственный мир. И он решился попробовать. Разорвав старую материю, Weaver впервые начал создавать что-то новое, а не восстанавливать истрёпанное. Заподозрив в его действиях бунт, мгновенно появились Великие стражи, которые, не церемонясь, отрезали Скитскура от космического гобелена, но оставили в живых. Это было большой ошибкой. Weaver наконец-таки свободен и для свершения его грандиозного плана необходимо совсем немного — всего-навсего разорвать этот мир по швам."
}