{
  "abilities": [
    {
      "effects": [
        "Время до невидимости: 0.3",
        "Урон: 175",
        "Бонус к скорости передвижения: 20%",
        "Длительность: 14"
      ],
      "notes": [
        "Активация предмета не прерывает произнесение заклинаний.",
        "Дополнительный урон напрямую добавляется к урону от атаки, так что его можно уменьшить с Enfeeble или Static Link. Но его нельзя усилить с помощью Empower или Руна двойного урона. Урон учитывается вампиризмом, прорубанием, уроном по области ( Elder Dragon Form) и Psi Blades, но не критическими ударами.",
        "За время до невидимости, заклинатель может использовать заклинания, использовать предметы и атаковать без отмены невидимости. Эти атаки наносят 175 урона по цели.",
        "Дополнительный урон не наносится при атаке вардов и строений из невидимости.",
        "Невидимость теряется при достижении времени применения заклинаний или при завершении атаки (для героев с дальним типом атаки при запуске снаряда). Это значит что если атака промахнется, невидимость все равно будет утрачена.",
        "Позволяет заклинателю проходить сквозь других юнитов, включая варды, но не строения.",
        "Заклинатель может поднимать и выкладывать предметы без потери невидимости.",
        "Имеет общую перезарядку с Silver Edge."
      ],
      "elements": [
        "Способность Ненаправленная",
        "Действует на Себя \/ Врагов",
        "Урон Физический"
      ],
      "name": "Shadow Walk",
      "description": "Делает героя невидимым на 14 сек. или до момента, когда он совершит атаку или применит способность. Также увеличивает скорость передвижения на 20% и позволяет проходить сквозь существ. Атака, прерывающая невидимость, дополнительно нанесёт 175 физического урона."
    }
  ],
  "contains": [
    "Claymore",
    "Shadow_Amulet"
  ],
  "cost": "2800",
  "description": "Клинок павшего короля позволяет вам передвигаться незамеченным и наносить удар из тени.",
  "further": [
    "Silver_Edge"
  ],
  "attrs": [
    "Активируемая Shadow Walk",
    "Бонус +30 к скорости атаки +22 к урону",
    "Можно разобрать? Нет",
    "Можно сообщать? Нет"
  ]
}