{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "The agility talent effectively grants Nyx Assassin 13.33 armor, 80 attack speed, and 80 main attack damage."
      ],
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Vendetta Unobstructed Pathing",
          "talentRight": "+80 Agility"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+130 Impale Damage",
          "talentRight": "+0.6s Spiked Carapace Stun Duration"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+20 Movement Speed",
          "talentRight": "+250 Health"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+0.25 Impale Stun Duration",
          "talentRight": "+8% Spell Amplification"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Nyx_Assassin_Impale.mp3\/revision\/latest?cb=20191216021116",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The spikes travel at a speed of 1600.",
        "With the travel distance and radius, Impale can hit units up to 825 range away.",
        "Hit units are knocked up 350 range for the initial 0.5 seconds of the stun.",
        "While in the air, other units may pass below hit airborne units.",
        "When Impale hits invisible units, the visual effects below the hit unit are still visible.",
        "The damage is applied upon landing, not upon getting hit.",
        "While Burrowed, Impale's cast range and the spikes travel distance increase to 1225. Therefore, Impale now can hit units up to 1350 range away. The cooldown is also reduced to 7 seconds.",
        "Therefore, Impale now can hit units up to 1350 range away.",
        "The cooldown is also reduced to 7 seconds."
      ],
      "mana": "105\/120\/135\/150",
      "item_behaviour": [],
      "name": "Impale",
      "cooldown": "14 (TagTalent 7)",
      "description": "Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: 700 (TagAghanim 1225)",
        "Spikes Travel Distance: 700 (TagAghanim 1225)",
        "Spikes Radius: 125",
        "Damage: 100\/160\/220\/280 (TagTalent 230\/290\/350\/410)",
        "Stun Duration: 1.4\/1.8\/2.2\/2.6 (TagTalent 1.65\/2.05\/2.45\/2.85)",
        "Attempts to damage if already hit enemies turn spell immune before landing."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Nyx_Assassin_Mana_Burn.mp3\/revision\/latest?cb=20191216021105",
      "effects": [
        "Ability Target Unit",
        "Affects Enemy Heroes",
        "Damage Magical"
      ],
      "notes": [
        "Applies the damage first, and then the mana loss.",
        "Effectively burns 29%\/33%\/38%\/42% of the target's maximum mana pool if it has no flat mana bonus.",
        "Despite dealing the damage first, the damage is based on how much mana the target actually lost from Mana Burn. This means, when cast on an enemy who has 5 mana left, it also deals only 5 damage (before reductions).",
        "This means, when cast on an enemy who has 5 mana left, it also deals only 5 damage (before reductions).",
        "Can be cast on creep-heroes, but has no effect on them, since they have no intelligence points, wasting mana and cooldown.",
        "While Burrowed, Mana Burn's cast range increases to 1050."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Mana Burn",
      "cooldown": "28\/20\/12\/4",
      "description": "Destroys the target hero's mana equal to a multiplier of its Intelligence, and deals damage equal to the mana burned.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.4+0",
        "Cast Range: 600 (TagAghanim 1050)",
        "Intelligence as Mana Burned: 350%\/400%\/450%\/500%",
        "Mana Burned as Damage: 100%"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Nyx_Assassin_Spiked_Carapace_1.mp3\/revision\/latest?cb=20191216021107",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Source Type (TagAghanimNo-reflection)"
      ],
      "notes": [
        "Spiked Carapace interrupts Nyx Assassin's channeling abilities upon cast.",
        "Can be cast during Vendetta, without breaking the invisibility. Breaks the invisibility of other sources.",
        "The buff from multiple casts of Spiked Carapace does not stack but gets refreshed instead.",
        "Only reflects player based damage directly towards the damage dealer. A unit can only be affected once per buff. Reflects incoming damage before all manipulations. However, damage manipulation on the enemy still affects the damage normally. Reflects the same damage type as received. Reflected physical damage is affected by damage block as well. Reflected damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.",
        "Reflects incoming damage before all manipulations. However, damage manipulation on the enemy still affects the damage normally.",
        "Reflects the same damage type as received.",
        "Reflected physical damage is affected by damage block as well.",
        "Reflected damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.",
        "Fully ignores self-inflicted damage, and damage flagged as HP Removal.",
        "Reflected damage cannot be amplified with outgoing spell damage amplification and cannot spell lifesteal. Can be amplified by incoming spell damage amplification.",
        "Can be amplified by incoming spell damage amplification.",
        "Spiked Carapace has a global range and affects units through the Fog of War or invisibility.",
        "Spiked Carapace first applies the debuff, then the reflected damage.",
        "Spiked Carapace fully negates and reflects after all reductions, causing several on-damage effects to not trigger.",
        "Has a higher priority than Aphotic Shield, but lower than False Promise. It will still reflect and stun when combined with False Promise.",
        "Although the damage dealt to enemies is equal to the amount of damage blocked, the effects work independently from each other. This means Spiked Carapace always blocks one damage instance, even when the source is spell immune or invulnerable.",
        "This means Spiked Carapace always blocks one damage instance, even when the source is spell immune or invulnerable.",
        "Does not work against wards, buildings and allied units.",
        "While Burrowed, casting Spiked Carapace immediately applies its stun to all enemies within 300 radius. Since Spiked Carapace has no base damage, hit units are not damaged upon cast. Nyx Assassin still receives the cast buff normally, which can still reflect damage and stun enemies. However, the buff does not affect enemy units which have been hit by the stun upon cast. They can normally damage Nyx.",
        "Since Spiked Carapace has no base damage, hit units are not damaged upon cast.",
        "Nyx Assassin still receives the cast buff normally, which can still reflect damage and stun enemies.",
        "However, the buff does not affect enemy units which have been hit by the stun upon cast. They can normally damage Nyx."
      ],
      "mana": "40",
      "item_behaviour": [],
      "name": "Spiked Carapace",
      "cooldown": "25\/20\/15\/10",
      "description": "When activated while above ground, Spiked Carapace reflects and negates damage dealt to Nyx Assassin (max once from each source), as well as stunning the source of the damage. Activating Spiked Carapace will not break Vendetta invisibility. While Burrowed, Spiked Carapace instantly stuns nearby enemies when cast.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Damage Reflected: 100%",
        "Carapace Duration: 2",
        "Stun Duration: 0.6\/1.2\/1.8\/2.4 (TagTalent 1.2\/1.8\/2.4\/3)",
        "Stun Radius: 300"
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Nyx_Assassin_Burrow.mp3\/revision\/latest?cb=20191216021114",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "While burrowed, Nyx Assassin is invisible, disarmed, and rooted, so that he cannot attack, move, or use blink-based abilities.",
        "While burrowed, Impale and Mana Burn can be cast without having to face the targeted point or unit. Other targeted abilities and items still require facing.",
        "Other targeted abilities and items still require facing.",
        "Applies generic incoming damage reduction on Nyx Assassin while burrowed. Stacks additively with other sources of generic incoming damage manipulation. The reduction affects all damage Nyx Assassin takes that is not flagged as HP removal.",
        "The reduction affects all damage Nyx Assassin takes that is not flagged as HP removal.",
        "Can regenerate up to 60% of Nyx Assassin's max health and mana in one minute.",
        "Burrow lasts until the Unburrow sub-ability or Vendetta is used, or until death.",
        "Nyx Assassin can still be moved by abilities while burrowed, without getting unburrowed.",
        "Losing Aghanim's Scepter instantly unburrows Nyx."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Burrow",
      "cooldown": null,
      "description": "Nyx Assassin buries himself beneath the battlefield over a short duration. Once burrowed, Spiked Carapace instantly stuns nearby enemies when cast, the range of Mana Burn and Impale is increased, and Impale's cooldown is decreased. While burrowed, Nyx Assassin is stationary, unable to attack, and invisible. Nyx gains damage reduction from all damage sources.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 1.5+0.1",
        "Fade Time: 0",
        "Max Health\/Mana Regen Bonus: 1%",
        "Incoming Damage Reduction: 50%",
        "Impale Cast\/Travel Range Increase: 525",
        "Impale Cooldown Reduction: 7",
        "Mana Burn Cast Range Increase: 450",
        "Spiked Carapace Stun Radius: 300"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7c\/Nyx_Assassin_Unburrow_1.mp3\/revision\/latest?cb=20191216021109",
      "effects": [
        "Ability No Target"
      ],
      "notes": [
        "Replaces Burrow until the sub-ability is used, Vendetta is used or Nyx's death.",
        "Interrupts Nyx Assassin's channeling abilities upon cast.",
        "Instantly reverts all bonuses provided by Burrow.",
        "Uses a different sound when unburrowing inside the river."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Unburrow",
      "cooldown": null,
      "description": "Emerge from the burrow.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4d\/Nyx_Assassin_Vendetta.mp3\/revision\/latest?cb=20191216021112",
      "effects": [
        "Ability No Target",
        "Affects Self \/ Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Vendetta does not interrupt Nyx Assassin's channeling abilities upon cast.",
        "The attack out of Vendetta cannot miss.",
        "The attack first applies the Vendetta damage, then the debuff, then the attack damage.",
        "The bonus damage is dealt in a separate damage instance, and counts as spell damage. This means it is not affected or considered by anything that works with attack damage. This also means that it fully works with spell damage amplification and spell lifesteal.",
        "This means it is not affected or considered by anything that works with attack damage.",
        "This also means that it fully works with spell damage amplification and spell lifesteal.",
        "The damage and the debuff are not applied when attacking wards or buildings.",
        "The invisibility is broken upon reaching the cast point of abilities or items, or upon landing an attack. Nyx can pick up, drop or attack items and runes without breaking the invisibility.",
        "Nyx can pick up, drop or attack items and runes without breaking the invisibility.",
        "Vendetta allows Nyx to phase through other units, including wards, but not through buildings.",
        "The Unobstructed Pathing talent does not upgrade the current instance of Vendetta. Fully grants unobstructed movement for its duration, allowing to path through cliffs and trees.",
        "Fully grants unobstructed movement for its duration, allowing to path through cliffs and trees.",
        "With Aghanim's Shard, the debuff reduces most heroes' total magic resistance to 10%."
      ],
      "mana": "180\/240\/300",
      "item_behaviour": [],
      "name": "Vendetta",
      "cooldown": "90\/75\/60",
      "description": "Allows Nyx Assassin to become invisible and gain a speed bonus. If Nyx Assassin attacks to break the invisibility, massive bonus damage is dealt with the attack.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Fade Time: 0",
        "Damage: 300\/450\/600",
        "Self Move Speed Bonus: 16%\/18%\/20% (TagTalent 41%\/43%\/45%)",
        "Self Attack Animation Speed Bonus: 50%",
        "Vendetta Duration: 40\/50\/60",
        "Enemy Magic Resistance Reduction: 20%",
        "Magic Resistance Reduction Duration: 4",
        "Grants a new ability: Burrow.",
        "Causes Nyx's Vendetta attack to reduce enemy magic resistance by 20% for 4 seconds. Also increases Vendetta movement speed by 25%."
      ],
      "legacy_key": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 17.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 2.5,
    "attrAgility": 18.0
  },
  "description": "Nyx Assassin, is a melee agility hero who is feared as one of the most effective gankers and solo-killers in the game. With his powerful burst damage nukes, Nyx Assassin specializes in disabling and killing lone and fragile enemies with little to no warning. He possesses an area nuke and stun ability in Impale, allowing him to disable enemies in a straight line in front of him while dealing damage. His Mana Burn ability can destroy a significant fraction of a target hero's mana pool while dealing the same amount as damage, making him the bane of weak intelligence heroes with lots of mana but very little health. Should the enemy attempt to attack him, Nyx Assassin can dissuade them with Spiked Carapace, stunning any heroes that attack him while reflecting their damage back at them. His ultimate, Vendetta, turns Nyx invisible, allowing him to deal tremendous pure damage to the next target that he strikes out of invisibility. Stalking from the shadows, Nyx Assassin can strike without warning and lay low his foes before they realize that their death is upon them.",
  "history": "Deep in the Archive of Ultimyr, shelved between scholarly treatises on dragon cladistics and books of untranslatable spells, there is an ancient tome of entomological curiosities. Compiled by scholars, the book describes the telepathic talents of the zealot scarab, a strange species of social insect with abilities unique to all the seven planes. Unlike most grubs of his colony, Nyx Assassin did not arise from metamorphosis with the plodding thoughts and blunted appendages common to the worker caste of his kind. For his was a special transformation, guided by the grace of Nyx. He was the chosen one, selected from the many and anointed with an extract of the queen goddess herself. Not all survive the dark blessing of the queen's chamber, but he emerged with a penetrating mind, and dagger-like claws–his razor sharp mandibles raking the air while his thoughts projected directly into the minds of those around him. Of all zealot scarabs, he alone was selected for the highest calling. After his metamorphosis, he was reborn, by grace of Nyx, with abilities which shaped him for one thing and one thing only: to kill in the name of his goddess.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Vendetta Unobstructed Pathing",
      "talentRight": "+80 Agility"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+130 Impale Damage",
      "talentRight": "+0.6s Spiked Carapace Stun Duration"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+20 Movement Speed",
      "talentRight": "+250 Health"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+0.25 Impale Stun Duration",
      "talentRight": "+8% Spell Amplification"
    }
  ]
}