{
  "abilities": [
    {
      "notes": [
        "Gush's projectile travels at a speed of 2500",
        "Gush first applies the debuff, then the damage",
        "Successive debuffs do not update the armor reduction value but refresh its duration",
        "SCEPTER NOTES Additionally gains ground-targeting functionality\n Releases a 260 radius wave, instead of a single target projectile\n The wave always travels its full distance\n When unit-targeted, the wave is released toward its direction upon cast\n However, it does not home in on the target\n The wave travels at a speed of 1500, taking 1.47 seconds to travel the full distance\n With the travel distance and radius, the wave can hit units up to 2460 range away\n The wave fully hits invisible and enemies inside the Fog of War\n Provides 200 radius ground vision around each hit enemy for 2 seconds\n However, the wave itself does not provide any vision\n The second sound is used by the wave"
      ],
      "item_behaviour": [],
      "description": "Summons a gush of water to damage an enemy unit, reducing their movement speed and armor. Lasts 4.5 seconds.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.6",
        "Cast Range:  700 ( 2200)",
        "Damage: 110\/160\/210\/260 ( 230\/280\/330\/380)",
        "Armor Reduction: 3\/4\/5\/6",
        "Move Speed Slow: 40% ( 50%)",
        "Debuff Duration: 4.5",
        "Wave Travel Distance:  2200",
        "Wave Radius:  260"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/40\/Tidehunter_Gush_1.mp3\/revision\/latest?cb=20191216025132",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "12 (TagTalent 7)",
      "aghanim": null,
      "name": "Gush",
      "cooldown": "100\/105\/110\/115",
      "legacy_key": "G",
      "story": "During his championship of the Sunken Isles, Leviathan gained mastery over the open sea."
    },
    {
      "notes": [
        "Upon reaching the damage threshold, it applies a strong dispel on Tidehunter\n The dispel proc is indicated by a sound effect and water particles on Tidehunter's skin\n When Kraken Shell is procced by an ability that first deals its damage and then applies its debuff (e.g\n  Storm Hammer), Tidehunter is dispelled before the ability's debuff is applied",
        "Kraken Shell has an ensured Damage Block\n Therefore, Damage Block with a lower value (e.g\n the  Damage Block (Melee) innate ability) will not proc, since the higher damage block value takes priority\n The passive damage block is always active and it is independent of the damage threshold for the dispel proc\n Does not work against damage from wards sources (e.g\n  Death Ward etc.)\n Does not reduce physical damage from abilities, except for these abilities",
        "Only damage from player-controlled sources (after reductions) is counted towards the debuff removal",
        "The damage threshold counter for proccing the dispel resets when Tidehunter does not take player-based damage for 7 seconds"
      ],
      "item_behaviour": [],
      "description": "Thickens Tidehunter's hide to passively block a portion of any incoming physical attack damage. The hide also removes negative status effects if the damage taken crosses a threshold. Does not stack with items that provide Damage Block.",
      "hot_key": "W",
      "params": [
        "Proc Chance: 100%",
        "Damage Block: 16\/34\/52\/70 ( 56\/74\/92\/110)",
        "Damage Threshold: 600\/550\/500\/450",
        "Threshold Reset Timer: 7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Tidehunter_Kraken_Shell.mp3\/revision\/latest?cb=20191216025135",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Kraken Shell",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Claddish navymen tell tales of a mighty sea-faring beast that suffered spear and sword but continued to lay waste to the fleet."
    },
    {
      "notes": [
        "Causes Tidehunter to perform instant attacks on all hit enemies within the radius\n Affects ancient creeps, but not wards and  Roshan\n Does not affect buildings, unless the Anchor Smash affect buildings  talent is learned\n These instant attacks can proc any attack modifiers and on-hit effects normally, with cleave and the passive Anchor Smash procs being an exception\n They have True Strike, but ignore disarms",
        "Reduces the main attack damage of affected units\n Bonus attack damage is not reduced",
        "Anchor Smash first applies the debuff, then the instant attack",
        "TALENT NOTES Grants Anchor Smash a 50% chance to passively proc on regular attacks\n These procs do not trigger the cooldown and work while on cooldown, and do not cost mana\n They do not proc on-cast effects either\n The procs use pseudo-random distribution\n The affected target(s) effectively takes 2 attacks' worth of damage, plus the attack damage bonus, since Anchor Smash deals damage based on Tidehunter's attack damage\n Adds an average of 50% current total attack damage + 20\/42.5\/65\/87.5 ( 45\/67.5\/90\/112.5) damage to every attack"
      ],
      "item_behaviour": [],
      "description": "Tidehunter swings his mighty anchor to attack and deal bonus damage to nearby enemies and reduce their attack damage.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0.4+0.3",
        "Radius: 375",
        "Instant Attack Damage Bonus: 40\/85\/130\/175 ( 90\/135\/180\/225)",
        "Attack Damage Reduction: 30%\/40%\/50%\/60% ( 55%\/65%\/75%\/85%)",
        "Duration: 6",
        "Proc Chance:  50%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Tidehunter_Anchor_Smash.mp3\/revision\/latest?cb=20191216025130",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Instant Attack"
      ],
      "mana": "7\/6\/5\/4",
      "aghanim": null,
      "name": "Anchor Smash",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "C",
      "story": "Stolen from one of Admiral Kunkka's flagships, Leviathan's heavy anchor proves useful as a melee weapon."
    },
    {
      "notes": [
        "Requires <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard to be unlocked",
        "Does not require  Ravage to be leveled to be unlocked, once Aghanim's Shard is acquired\n However, it relies on Ravage to work, since it directly uses its values\n This means when Ravage is not learned, Tendrils of the Deep does nothing upon cast\n The tendrils does not home to the target in any way",
        "Units within 150 radius upon cast are hit instantly\n With the travel distance and effect width, it can hit units up to 1087.5 range away\n The tendrils travel at a speed of 725 and takes exactly 1.09 seconds to travel the full distance\n It can be avoided by teleporting (e.g\n <span image=\"items\/blink_dagger\/full.webp\">[Blink Dagger]<\/span> Blink) towards Tidehunter over the tendrils shortly after cast",
        "Other Ravage notes fully apply\n SPELL STEAL Ability values are based on  Tidehunter's current  Ravage level when acquired"
      ],
      "item_behaviour": [],
      "description": "Tidehunter unleashes a targeted slew of tentacles that damage and stun enemies within reach. The tentacles deal 50% of Ravage's damage and stun, with a range 75% of Ravage's radius.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range: Global",
        "Max Travel Distance: 937.5",
        "Effect Width: 150",
        "Damage: 125\/175\/225",
        "Stun Duration: 1.2\/1.3\/1.4 ( 1.7\/1.8\/1.9)"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "20",
      "aghanim": null,
      "name": "Tendrils of the Deep",
      "cooldown": "80",
      "legacy_key": "D",
      "story": null
    },
    {
      "notes": [
        "The tentacles travel at a speed of 725",
        "Hit units are knocked up 350 range for the initial 0.5 seconds of the stun",
        "While in the air, other units may pass below the affected units",
        "The tentacle that hits the target is larger\n This visual effect can also be seen in the Fog of War\n When Ravage hits invisible and untargetable units, the visual effects below the hit unit are still visible",
        "The damage is applied upon landing, not upon getting hit\n The damage is applied instantly if the stun is dispelled while in the air",
        "Ravage's effect is caused by a 250 units wide ring, which expands around the cast location at the given speed\n This means units within 250 radius upon cast are hit instantly\n The ring takes exactly 1.38 seconds to cover the remaining distance\n It can be avoided by teleporting (e.g\n <span image=\"items\/blink_dagger\/full.webp\">[Blink Dagger]<\/span> Blink) towards Tidehunter over the ring shortly after cast"
      ],
      "item_behaviour": [],
      "description": "Slams the ground, causing tentacles to erupt in all directions, damaging and stunning all nearby enemy units.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.57",
        "Max Effect Radius: 1250",
        "Effect Width: 250",
        "Projectile Speed: 725",
        "Damage: 250\/350\/450",
        "Stun Duration: 2.4\/2.6\/2.8 ( 3.4\/3.6\/3.8)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Tidehunter_Ravage_1.mp3\/revision\/latest?cb=20191216025128",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "150",
      "aghanim": null,
      "name": "Ravage",
      "cooldown": "150\/225\/325",
      "legacy_key": "V",
      "story": "Calling to the abyssal god Maelrawn has resulted in entire armadas being lost at sea."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 27.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.7,
    "attrAgilityInc": 1.5,
    "attrAgility": 15.0
  },
  "description": "Durable hero who shrugs off enemy damage. Tired of undersea politics, Leviathan rises from the waves to stalk the shallows for victims. Travelers who cross him are blasted with a Gush of foamy brine, impairing their movement as the Tidehunter's Tendrils lumber after them on land. Wielding a souvenir stolen from a hated rival, Leviathan pulverizes armor and flesh alike with a hefty Anchor Smash. Spears and arrows bend against his Kraken Shell, allowing no chance for interruption as the Tidehunter summons his abyssal god to Ravage enemies in a sea of flailing tentacles.  Initiator Durable Disabler Nuker Carry ★☆☆",
  "trivia": [
    "The name Leviathan is derived from a sea monster in the Bible. It is also used to refer to any large sea monster or creature.",
    "Previous designs of Tidehunter had him use a large hook as a weapon. This was later replaced by an anchor based on community feedback for several reasons: To match the theme of Anchor Smash. To add a reference to the model Tidehunter uses in Warcraft 3 DotA (which also uses a giant anchor as weapon). To add another connection between Tidehunter and Kunkka (the anchor is supposedly stolen from one of Kunkka's flagship, as written in the lore of Anchor Smash).",
    "To match the theme of Anchor Smash.",
    "To add a reference to the model Tidehunter uses in Warcraft 3 DotA (which also uses a giant anchor as weapon).",
    "To add another connection between Tidehunter and Kunkka (the anchor is supposedly stolen from one of Kunkka's flagship, as written in the lore of Anchor Smash).",
    "Tidehunter's line Link▶️ \"Ha ha ha! Women and children and Kunkka first.\" is a reference to the Birkenhead Drill, a historical protocol where women and children's lives would be saved first in the case of a life threatening situation, typically the sinking of a ship.",
    "Tidehunter's line Link▶️ \"I sleep with the fishes.\" is a reference to The Godfather, from the line \"Luca Brasi sleeps with the fishes.\""
  ],
  "history": "The Tidehunter known as Leviathan was once the champion of the Sunken Isles, but his motives are as mysterious as those of his people. We all know the importance of the Drylanders' shipping lanes, how empires may rise and fall according to who controls the open water. Far less is known of the submarine lanes, and how the warring tribes of the Meranthic Diaspora have carved out habitations through endless undersea skirmishes. In the fragile treaties between the Mer and Men, we can glimpse the extent of the drowned empires, but their politics appear complex and opaque. It would seem that Leviathan tired of such petty strife, and set off on his own, loyal only to his abyssal god, Maelrawn the Tentacular. He stalks the shallows now in search of men or meranths who stray into his path, and with a particular loathing for Admiral Kunkka, who has long been his nemesis for reasons lost in the deepest trenches of the sea.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+1s Lua error in Module:Ability_ID at line 61: Could not find Cargo data for \"Ravage\". Stun",
        "talent_left": "50% chance of Anchor Smash on attack"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+40 Kraken Shell Damage Block",
        "talent_left": "Anchor Smash Affect Buildings"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+120 Gush Damage",
        "talent_left": "-25% Anchor Smash Damage Reduction"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+10% Gush Slow",
        "talent_left": "+50 Anchor Smash Damage"
      }
    ]
  }
}