{"abilities":[{"spell":"An icy blast followed by a wave of fire launches out in a path in front of Jakiro. The ice slows enemies, while the fire delivers damage over time.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["Targeting a unit causes the breaths to be released towards the unit's position.","Both the icy and fiery wave travel at a speed of 1050, taking 0.71 seconds to travel the full distance.","The fiery breath is released 0.3 seconds after the icy breath is released. This means it is possible for enemies to be hit by only one of the breaths, by getting in or out of range of the second breath. Jakiro cannot move until both waves are released, but can use items and spells and turn a little bit between the first and the second breath.","Can hit units up to 1025 range away (travel distance + end radius).","The complete area of both breaths is shaped like a cone.","Deals 10\/20\/30\/40 ( 30\/40\/50\/60) damage in 0.5 second intervals, starting 0.5 second after the damaging debuff is placed, resulting in 10 instances.","Can deal up to 100\/200\/300\/400 ( 300\/400\/500\/600) damage to a single unit (before reductions)."],"mana":"135\/140\/155\/170","elements":["Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"10","name":"Dual Breath","description":["Cast Animation: 0.55+1.27","Cast Range: 550","Starting Radius: 225","Travel Distance: 750","End Radius: 275","Move Speed Slow: 28%\/32%\/36%\/40%","Attack Speed Slow: 28\/32\/36\/40","Damage per Second: 20\/40\/60\/80 ( 60\/80\/100\/120)","Duration: 5"],"hot_key":"Q","legacy_key":"D"},{"spell":"Creates a path of ice that stuns and damages enemies that touch it.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Despite the visual effects, the path's effects do not have to travel, and are instantly applied after the 0.5 second delay.","The Ice Path starts 12 range in front of Jakiro and has a length of 1200. It can hit units up to 1362 range away (starting distance + path length + path radius). It can also hit units 138 range behind Jakiro, due to its radius and starting position.","Enemy units which come within 150 radius of the path while it is up get stunned and damaged by it.","The stun lasts as long as the remaining duration of the path itself.","The ice first applies the debuff, then the damage.","The path grants 150 range flying vision along the path for its duration."],"mana":"90","elements":["Does not pierce spell immunity."],"cooldown":"12\/11\/10\/9","name":"Ice Path","description":["Cast Animation: 0.65+0.8","Cast Range: 1200","Path Distance: 1200","Path Radius: 150","Effect Delay: 0.5","Damage: 50","Path Duration: 1\/1.5\/2\/2.5 ( 2.25\/2.75\/3.25\/3.75)"],"hot_key":"W","legacy_key":"T"},{"spell":"Jakiro burns his enemies in an area of effect with fire added to his attack, while slowing their attacks.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Magical"],"notes":["Casting Liquid Fire manually uses the 600 cast range. Attacking normally with Liquid Fire on autocast uses Jakiro's default 400 attack range.","When the attack misses or is disjointed, it still applies Liquid Fire around and on the target. However, when the target turns spell immune or invulnerable before impact, Liquid Fire is not applied at all.","Successive casts of Liquid Fire do not stack, but refresh the debuff instead.","The attack first applies the debuff, then its own damage.","Fully affects buildings, including the attack speed slow. Does not affect wards.","Deals 6\/8\/10\/12 damage in 0.5 second intervals (before reductions), starting 0.5 second after the debuff is applied, resulting in 10 damage instances.","Can deal up to 60\/80\/100\/120 damage to a single target (before reductions).","When off cooldown, the fire head's mouth drools fire (visible to everyone) and Jakiro starts using his fire head for attack animations until Liquid Fire is used."],"mana":"0","elements":["Cannot be used by illusions.","Can be disjointed.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"20\/15\/10\/4","name":"Liquid Fire","description":["Cast Range: 600 ( 640)","Radius: 300","Attack Speed Slow: 30\/40\/50\/60 ( 90\/100\/110\/120)","Damage per Second: 12\/16\/20\/24","Duration: 5"],"hot_key":"E","legacy_key":"Q"},{"spell":"Jakiro exhales a wide line of lasting flames, which deals damage per second to any enemy units caught in the fire.","effects":["Ability Target Point","Affects Enemies","Damage Magical ( Pure)"],"notes":["Instantly applies its effects over the whole distance. Does not have any travel time.","The fire starts 234 range in front of Jakiro and has a length of 1166 ( 1566). It can hit units up to 1660 ( 2060) range away (starting distance + path length + path radius). It can also hit units 26 range behind Jakiro, due to its radius and starting position.","Places a debuff on enemies within the area in 0.5 second intervals, starting 0.5 seconds after cast.","The debuff does not stack. When standing inside the fire, its duration gets refreshed. The debuff deals 50\/70\/90 ( 62.5\/87.5\/112.5) damage in 0.5 second intervals, starting 0.5 seconds after being placed, resulting in 4 damage instances. This results in a maximum of 23 ( 63) damage instances when standing within the area the full duration.","One instance of the debuff can deal up to 200\/280\/360 ( 250\/350\/450) damage (before reductions).","Can deal up to 1150\/1610\/2070 ( 3937.5\/5512.5\/7087.5) damage to a single unit (before reductions).","Multiple overlapping Macropyres do not stack. They refresh the same debuff on enemies.","The path destroys trees within 260 range along the path upon cast.","Aghanim's Scepter changes Macropyre's sound effect. This changed sound effect is audible through the Fog of War."],"mana":"220\/330\/440","elements":["Pierces spell immunity."],"cooldown":"60","name":"Macropyre","description":["Cast Animation: 0.55+1.07","Cast Range: 1400 ( 1800)","Path Distance: 1400 ( 1800)","Path Radius: 260","Damage per Second: 100\/140\/180 ( 125\/175\/225)","Damage Linger Duration: 2","Path Duration: 10 ( 30)"],"hot_key":"R","legacy_key":"R"}],"bio":"Even among magical beasts, a twin-headed dragon is a freak. Equal parts ice and fire, cunning and rage, the creature known as Jakiro glides over charred and ice-bound battlefields, laying waste to any who would bear arms against it. Pyrexae dragon clutches always contain two fledglings. Famous for their viciousness even from the first moments of life, newly hatched dragons of this species will try to kill their sibling while still in the nest. Only the strongest survive. In this way is the strength of the Pyrexae line ensured. By some accident of nature, the freak Jakiro hatches from a single egg, combining in a single individual the full range of abilities found within the diverse Pyrexae species. Trapped within the armature of its monstrous body, the powers of ice and fire combine, and now no enemy is safe.","talentsTips":["The attack range talent also affects the cast range of Liquid Fire.","Gold granted from the talent is unreliable gold."],"trivia":["Jakiro's fun\/alternate name was Double Dragon, referring to the video game franchise developed by Technos Japan.","This line \"Burninated.\" is a reference to Trogdor the Burninator, a character that first appeared in episode 58 of the \"Strong Bad e-mail\" show on the website HomestarRunner.com."],"talents":["+1.25s Ice Path Duration:Macropyre Pure and Pierces Immunity","+150 Gold\/Min:-60 Liquid Fire Attack Speed","+40 Dual Breath Burn Damage:+40% XP Gain","+8% Spell Amplification:+300 Attack Range"],"desc":"Jakiro the Twin Head Dragon is a ranged intelligence hero who utilizes the powers of ice and fire with powerful linear area spells. He can freeze enemies in place with Ice Path, or slow them down with Dual Breath. He is capable of dealing heavy damage throughout the game by locking enemies inside his Macropyre, and provides great pushing power with Liquid Fire."}