{"abilities":[{"spell":"Поток льда, за которым следует волна огня. Лед замедляет врагов, тогда как огонь наносит им урон с течением времени.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Выбор юнита в качестве цели направит дыхание в сторону этого юнита.","Ледяная и огненная волна движется со скоростью в 1050 единиц, для прохождения всего пути нужно 0.71 секунды.","Огненное дыхание выходит спустя 0,3 секунды после выпуска ледяного. Возможен вариант, что враги получат урон только от одной волны, если выйдут из зоны поражения в промежутке между первой и второй волной. Jakiro не может двигаться, пока не выпустит волны, но в промежутке между ними может использовать предметы, способности и немного поворачиваться.","Поражает юнитов на расстоянии до 1025 единиц (складывается из дальности волны и конечного радиуса).","Зона общего поражения выглядит как конус.","Наносит 10\/20\/30\/40 ( 30\/40\/50\/60) единиц урона с промежутком в 0,5 секунды, начиная наносить урон с задержкой в 0,5 секунды после применения негативного эффекта, действуя 10 раз.","Может нанести до 100\/200\/300\/400 ( 300\/400\/500\/600) единиц урона (до учета сопротивления)."],"mana":"135\/140\/155\/170","elements":["Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"10","name":"Dual Breath","description":["Анимация применения: 0,55+1,27","Дальность применения: 550","Начальный радиус: 225","Дальность волны: 750","Конечный радиус: 275","Замедление передвижения: 28%\/32%\/36%\/40%","Замедление скорости атаки: 28\/32\/36\/40","Урон в секунду: 20\/40\/60\/80 ( 60\/80\/100\/120)","Длительность: 5"],"hot_key":"Q","legacy_key":"D"},{"spell":"Создает ледяную дорожку, которая оглушает и наносит урон врагам, прикоснувшимся к ней.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Несмотря на визуальный эффект, сама дорожка не движется, а эффект от неё срабатывает спустя 0,5 секунды.","Ice Path начинается в 12 единицах от Jakiro и имеет длину в 1200 единиц. Может поразить юнитов на расстоянии в 1362 единиц (складывается из начального расстояния от Jakiro, длины дорожки и ее ширины). Также может задеть юнитов в 138 единицах позади Jakiro за счет его радиуса и начальной точки появления способности.","Вражеские юниты, оказавшиеся в радиусе 150 единиц дорожки, оглушаются и получают урон.","Оглушение длится столько же, сколько существует дорожка.","Дорожка дает в радиусе 150 единиц летающего обзора по всей её длине всё время действия."],"mana":"90","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"12\/11\/10\/9","name":"Ice Path","description":["Анимация применения: 0,65+0,8","Дальность применения: 1200","Длина дорожки: 1200","Радиус дорожки: 150","Задержка: 0.5","Урон: 50","Длительность дорожки: 1\/1.5\/2\/2.5 ( 2.25\/2.75\/3.25\/3.75)"],"hot_key":"W","legacy_key":"T"},{"spell":"Герой наполняет свою атаку жидким пламенем, поджигая цель и всех врагов вокруг нее. Жертвы получают периодический урон и медленнее атакуют.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Магический"],"notes":["Применение Liquid Fire вручную использует дальность применения в 600 единиц. Обычные атаки с автоприменением Liquid Fire используют стандартную дальность атаки Jakiro в 400 единиц.","Если атака промахнулась или её избежали, то она все равно применит Liquid Fire на цель и юнитов вокруг. Но, если цель получила иммунитет к заклинаниям или стала неуязвимой до попадания снаряда, то Liquid Fire применяться не будет.","Несколько применений Liquid Fire не складываются, но обновляют время действия негативных эффектов.","Способность действует на строения, замедляя их скорость атаки. Не работает на варды.","Наносит 6\/8\/10\/12 единиц урона с интервалом в 0,5 секунду (до учета сопротивления), начиная наносить урон с задержкой в 0,5 секунд после применения, работает 10 раз.","Может нанести до 60\/80\/100\/120 единиц урона в одиночную цель (до учета сопротивления).","При завершении перезарядки, рот огненной головы наполняется огнем (видимым для всех) и Jakiro начинает использовать огненную голову для анимации атаки до следущего применения Liquid Fire."],"mana":"0","elements":["Не может использоваться иллюзиями.","Можно избежать.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"20\/15\/10\/4","name":"Liquid Fire","description":["Дальность применения: 600 ( 900)","Радиус: 300","Замедление скорости атаки: 30\/40\/50\/60 ( 90\/100\/110\/120)","Периодический урон: 12\/16\/20\/24","Длительность: 5"],"hot_key":"E","legacy_key":"Q"},{"spell":"Jakiro извергает широкую линию жидкого пламени, которое держится некоторое время и ежесекундно наносит урон вражеским юнитам. Улучшается с Aghanim's Scepter.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический ( Чистый)"],"notes":["Мгновенно применяет способность по всей площади. Не имеет анимации растекания.","Огонь начинается в 234 единицах впереди Jakiro и имеет длину в 1166 ( 1566) единиц. Может поражать юнитов на расстоянии до 1660 ( 2060) единиц (складывается из начального расстояния, длины дорожки и её ширины). Также поражает врагов в 26 единицах позади позади Jakiro за счет его радиуса и начальной точки появления способности.","Накладывает на врагов в области действия дебафф с интервалом в 0,5 секунды спустя 0,5 секунды после применения.","Дебаффы не складываются. Если враг вновь оказался в области действия, его длительность обновляется. Дебафф наносит 50\/70\/90 ( 62.5\/87.5\/112.5) единиц урона с интервалом в 0,5 секунды (до учета сопротивления) спустя 0,5 секунды после применения, нанося урон до 4 раз. В итоге максимальное число нанесений урона равно 23 ( 63), если цель оставалась в огне всю длительность.","Одно применение дебаффа может нанести до 200\/280\/360 ( 250\/350\/450) урона (до учета снижений).","Может нанести до 1150\/1610\/2070 ( 3937.5\/5512.5\/7087.5) единиц урона одному юниту (до учета снижений).","Несколько накладывающихся друг на друга Macropyre не складываются. Они обновляют общий дебафф на врагах.","При применении линия разрушает деревья в радиусе 260 единиц по всей длине.","Aghanim's Scepter меняет звуковой эффект Macropyre. Измененный звук слышен через туман войны."],"mana":"220\/330\/440","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"60","name":"Macropyre","description":["Анимация применения: 0,55+1,07","Дальность применения: 1400 ( 1800)","Длина: 1400 ( 1800)","Радиус: 260","Урон в секунду: 100\/140\/180 ( 125\/175\/225)","Длительность задержки урона: 2","Длительность: 10 ( 30)"],"hot_key":"R","legacy_key":"R"}],"bio":"Даже среди магических существ двуглавый дракон считается уродом. Поровну вмещающий в себя лед и пламя, коварство и ярость, он парит над обугленными и замороженными полями битв и изничтожает любого, кто осмелится бросить ему вызов. Яйца пироксианских драконов вмещают двух детенышей. Знаменитые своим злобным нравом с первых мгновений жизни, едва вылупившиеся детёныши пытаются убить друг друга ещё в гнезде. Выживает сильнейший. Так из поколения в поколение сохраняется сила пироксианского вида. Но по ошибке природы из одного яйца вылупился двуглавый уродец, объединив в одном теле все сильные стороны пироксианского древа. Запрятанные под мощной чешуёй силы льда и огня объединяются, и от них не спастись никому.","talentsTips":["Талант на дальность атаки также действует на дальность применения Liquid Fire.","Золото с таланта является ненадёжным."],"talents":["+1,25 сек. действия Ice Path:Macropyre наносит чистый урон сквозь иммунитет к заклинаниям","+150 золота в минуту:-60 к скорости атаки от Liquid Fire","+40 к урону в секунду от Dual Breath:+40% к получаемому опыту","+8% к урону от способностей:+300 к дальности атаки"],"desc":"Jakiro — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Герой своими способностями может быстро нанести немалый урон в начале и середине игры. Способностью Dual Breath герой сначала испускает ледяное дыхание, которое замедляет противника, а затем огненное, которое в свою очередь наносит урон. Способность Ice Path позволяет создавать ледяную дорожку впереди себя, замораживая всех противников, попавших в лед. Liquid Fire - способность, которая добавляет к атакам героя дополнительный урон от огня, который будет сжигать некоторое время пораженных врагов. Главной способностью, Macropyre, герой испускает огненный путь, который сжигает всех, кто находится в нем, нанося периодический урон врагам."}