{"abilities":[{"spell":"Drives a unit into a bloodthirsty rage during which a unit deals, and takes, increased damage. Units affected by Bloodrage will be healed for a percentage of the max health of any units they kill. Units affected by Bloodrage when killed will heal a percentage of their max health to their killer. If you do not get the last hit, but are within 300 AoE of the dying hero, you will take 50% of the heal.","effects":["Ability Target Unit","Affects Allies \/ Enemies"],"notes":["Bloodrage amplifies all three damage types the bloodraged unit deals and takes, including self-inflicted damage and damage dealt by allies.","Does not amplify outgoing damage when it has the no-reflection flag.","The heal is based on the dying unit's maximum health, and not on the health of the unit that gets healed.","Bloodrage does not heal upon killing illusions, Tempest Doubles, Roshan, wards, or buildings.","Denying allies while bloodraged, or denying bloodraged allies heals the killing unit.","Suiciding heroes still heal buffed allied units when within the radius, but for halved values.","When a bloodraged unit attacks another bloodraged unit, the damage is overall amplified by 23.2%\/34.52%\/46.32%\/58.6%, and in case of kill, the heal value is doubled.","Does not amplify damage dealt by abilities that use an independent source of damage (e.g. Proximity Mines, Death Ward).","Successive casts with different levels on a same target only refresh the duration, but do not update the damage amplification and heal percentage.","The disable help function prevents an allied Bloodseeker from casting this ability on you."],"mana":"0","elements":["Blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"9\/8\/7\/6","name":"Bloodrage","description":["Cast Animation: 0.2+0.6","Cast Range: 800","Enemy Death Heal Radius: 300","Outgoing Damage Amplification: 12%\/18%\/24%\/30%","Incoming Damage Amplification: 10%\/14%\/18%\/22%","Max Health as Heal: 13%\/17%\/21%\/25%","Duration: 9\/10\/11\/12"],"hot_key":"Q","legacy_key":"D"},{"spell":"Bloodseeker baptizes an area in sacred blood. After 2.9 seconds the ritual completes, causing any enemies caught in the area to take damage and become silenced.","effects":["Ability Target Area","Affects Enemies","Damage Pure"],"notes":["The affected area is visible to enemies.","Applies a silence within the targeted area after the 2.6-second delay.","Blood Rite first applies the damage, then the debuff.","With max level Bloodrage on Bloodseeker, Blood Rite deals 162.5\/227.5\/292.5\/357.5 ( 260\/325\/390\/455) damage (before reductions).","With max level Bloodrage applied on both Bloodseeker and the enemy unit, it deals 211.25\/295.75\/380.25\/464.75 ( 338\/422.5\/507\/591.5) damage (before reductions).","Choosing the damage upgrading talent immediately upgrades all of Bloodseeker's currently active Blood Rite casts when chosen during the delay.","Grants 600 radius ground vision at the center of the affected area for 6 seconds after cast."],"mana":"70\/80\/90\/100","elements":["Does not pierce spell immunity."],"cooldown":"12 ( 6)","name":"Blood Rite","description":["Cast Animation: 0.3+0.63","Cast Range: 1500","Effect Radius: 600","Effect Delay: 2.6","Damage: 125\/175\/225\/275 ( 200\/250\/300\/350)","Silence Duration: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"B"},{"spell":"Bloodseeker is invigorated by the wounds of his enemies, gaining bonus movement speed and attack speed whenever an enemy hero's health falls below 75%, with the bonuses increasing as their health falls further. If an enemy hero's health falls below 25%, he will also gain vision and True Sight of that hero. Bonuses stack per hero.","effects":["Ability Passive","Affects Self \/ Enemies"],"notes":["Learning Thirst removes the 550 movement speed cap for Bloodseeker.","The first stack is applied when an enemy hero is below 75% health and the last when below 26%.","Grants 0.6\/0.9\/1.2\/1.5 attack speed and 0.24%\/0.48%\/0.72%\/0.96% ( 0.6%\/0.84%\/1.08%\/1.32%) movement speed for each percent of missing health between 75% and 25%. However, since the HUD does not show decimals, attack speed increases by 1 for every missing 1.67%\/1.11%\/0.83%\/0.67% health, and movement speed by 1% for every missing 4.17%\/2.08%\/1.39%\/1.04% ( 1.67%\/1.19%\/0.93%\/0.76%) health.","When an enemy hero drops below 25% health, Thirst provides True Sight over the target and makes both their hero model and minimap icon visible through the Fog of War.","When enemies are revealed by Thirst, a debuff and particle effects are placed on them, which is visible to everyone.","Bloodseeker himself also gets a status buff and particle effects and speaks certain lines, making it clear that an enemy is currently being revealed by Thirst.","Thirst is not triggered by enemy illusions, but is triggered by hero clones.","Is not triggered by hidden enemy heroes, but does react on invulnerable ones.","The bonuses linger for 4 seconds if the enemy dies. However, it does not linger, and disappears immediately if the enemy has Aegis of the Immortal or Reincarnation. The bonuses are always the maximum values, despite the health percentage the enemy had right before the killing blow.","This is how much attack speed and movement speed Bloodseeker gains from Thirst with a certain amount of heroes being below 25% of their maximum health: 1 Hero: 30\/45\/60\/75 attack speed and 12%\/24%\/36%\/48% ( 30%\/42%\/54%\/66%) movement speed 2 Heroes: 60\/90\/120\/150 attack speed and 24%\/48%\/72%\/96% ( 60%\/84%\/108%\/132%) movement speed 3 Heroes: 90\/135\/180\/225 attack speed and 36%\/72%\/108%\/144% ( 90%\/126%\/162%\/198%) movement speed 4 Heroes: 120\/180\/240\/300 attack speed and 48%\/96%\/144%\/192% ( 120%\/168%\/216%\/264%) movement speed 5 Heroes: 150\/225\/300\/375 attack speed and 60%\/120%\/180%\/240% ( 150%\/210%\/270%\/330%) movement speed"],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Thirst","description":["Radius: Global","Thirst Health Threshold: 75%","Visibility Health Threshold: 25%","Max Attack Speed Bonus per Hero: 30\/45\/60\/75","Max Move Speed Bonus per Hero: 12%\/24%\/36%\/48% ( 30%\/42%\/54%\/66%)"],"hot_key":"E","legacy_key":"T"},{"spell":"Causes an enemy unit's skin to rupture. If the unit moves, it takes damage based on the distance moved. The damage is dealt through spell immunity.","effects":["Ability Target Unit","Affects Enemies","Damage Pure"],"notes":["Checks the distance the affected unit moved every 0.25 seconds, starting immediately upon cast, resulting in 1.3030303030303 checks. If the unit's position changed between checks, it takes damage based on the distance. If the unit did not move, or moved a distance greater than 1300 between a check, no damage is applied. If the unit is invulnerable as a check occurs, the value is set nil, so that it does not take damage on the next check, regardless of distance.","This is how much damage Rupture deals (before reductions) when the affected unit travels certain distances: 300 Distance: 90\/135\/180 damage 600 Distance: 180\/270\/360 damage 900 Distance: 270\/405\/540 damage 1200 Distance: 360\/540\/720 damage 1500 Distance: 450\/675\/900 damage","Multiple casts on the same target do not stack, but refresh the duration instead.","Despite the sounds, affected units take no damage when moving upwards (with e.g. Torrent or Impale).","Can be cast on, but cannot damage couriers."],"mana":"200\/225\/250","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"70 ( 0.25)","name":"Rupture","description":["Cast Animation: 0.4+0.53","Cast Range: 800 ( 1400)","Moved Distance as Damage: 30%\/45%\/60%","Duration: 10\/11\/12","Number of Charges: 0 ( 2)","Charge Replenish Time: 0 ( 40)"],"hot_key":"R","legacy_key":"R"}],"bio":"Strygwyr the Bloodseeker is a ritually sanctioned hunter, Hound of the Flayed Twins, sent down from the mist-shrouded peaks of Xhacatocatl in search of blood. The Flayed Ones require oceanic amounts of blood to keep them sated and placated, and would soon drain their mountain empire of its populace if the priests of the high plateaus did not appease them. Strygwyr therefore goes out in search of carnage. The vital energy of any blood he lets, flows immediately to the Twins through the sacred markings on his weapons and armor. Over the years, he has come to embody the energy of a vicious hound; in battle he is savage as a jackal. Beneath the Mask of the Bloodseeker, in the rush of bloody quenching, it is said that you can sometime see the features of the Flayers taking direct possession of their Hound.","talentsTips":["The armor talent does not benefit illusions.","The health talent increases maximum health capacity, and keeps the current health percentage.","The lifesteal talent stacks additively with other sources of lifesteal."],"trivia":["With Thirst, Bloodseeker is the only hero which can reach the game's absolute movement speed limit of 10,000 movement speed. However, this is not achievable in a normal match.","This part of Blood Rite's sound effect makes use of this Bloodseeker voice response.","Despite the character having an Aztec or Incan motif, Strygwyr likely a Welsh-influenced rendering of the Romanian word 'strigoi', meaning poltergeist, often used in folklore in reference to vampires.","Bloodseeker's Thirst trigger response \"Blood is in the air.\" is most likely a reference to the song \"Love is in the air\".","Bloodseeker's respawning response \"Don't be negative… be positive!\" is a reference to the blood types B-Positive and B-Negative.","Bloodseeker's Rupture kill response \"Lie down… have a cookie.\" is a reference to blood donation procedures where patients lie down and are given sweet treats to compensate for the sugar loss.","Bloodseeker's battle begin response \"I love the smell of serum in the morning.\" is a reference to a quote of the movie Apocalypse Now where Lieutenant Colonel Bill Kilgore says \"I love the smell of napalm in the Morning.\"","Bloodseeker's death response \"Sangre…sagrada.\" is spanish for \"Sacred\/Holy blood\"."],"talents":["+18 Max Thirst MS:-6s Blood Rite Cooldown","25% Lifesteal:+600 Rupture Cast Range","+75 Blood Rite Damage:+275 Health","+6 Armor:+25 Attack Speed"],"desc":"Strygwyr, the Bloodseeker, is a melee agility hero imbued with dreadful powers to fuel violence and rip enemies apart in the heat of close combat."}