{"abilities":[{"spell":"Пробуждает в существе жажду крови, из-за которой оно наносит и получает повышенный урон. Совершив убийство, цель излечится на часть от максимального здоровья жертвы. Если существо под действием способности погибнет, то излечит убийцу на часть от своего максимального здоровья. Если герой не добил цель, но был в радиусе 300 от неё, он получит 50% от лечения.","effects":["Способность Направленная на юнита","Действует на Союзников \/ Врагов"],"notes":["Bloodrage усиливает все три типа урона, наносимого и получаемого юнитом под действием способности, включая урон, наносимый себе и урон, наносимый союзниками.","Не усиливает исходящий урон, если он исходит от неотражаемых способностей.","Лечение основывается на максимальном здоровье убитого юнита, а не на здоровье юнита, который получил лечение.","Bloodrage не излечивает при убийстве иллюзий, Tempest Double, Рошана, вардов или строений.","Добивание союзников при действующем на себя Bloodrage или добивание союзников под действием Bloodrage излечит того юнита, который совершил добивание.","Поскольку на 3 уровне способности перезарядка становится короче, чем длительность, к этому моменту можно получить двух юнитов под действием способности одновременно.","Когда один юнит под действием Bloodrage атакует другого юнита под действием способности, в целом урон увеличивается на 21%\/32.25%\/44%\/56.25%.","Не усиливает урон, наносимый способностями, которые используют независимые источники урона (к примеру, Proximity Mines, Death Ward).","Функция \"Без помощи\" не позволяет использовать эту способность союзному Bloodseeker на вашего героя."],"mana":"0","elements":["Блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"9\/8\/7\/6","name":"Bloodrage","description":["Анимация применения: 0,2+0,6","Дальность применения: 800","Радиус лечения от смерти героя: 300","Увеличение урона: 10%\/15%\/20%\/25%","Лечения за убийство: 16%\/19%\/22%\/25%","Длительность: 9\/10\/11\/12"],"hot_key":"Q","legacy_key":"D"},{"spell":"Bloodseeker окропляет выбранную область святой кровью. Через 3 секунды ритуал завершается, нанося противникам урон и запрещая произносить заклинания.","effects":["Способность Направленная на область","Действует на Врагов","Урон Чистый"],"notes":["Область действия видна врагам.","Применяет безмолвие в выбранной области спустя 2.6-секундной задержки.","С максимальным уровнем Bloodrage, применённым на Bloodseeker, Blood Rite нанесет 156.25\/218.75\/281.25\/343.75 ( 250\/312.5\/375\/437.5) единиц урона (до учета сопротивления).","С максимальным уровнем Bloodrage, применённым и на Bloodseeker, и на вражеского юнита, способность нанесет 195.3125\/273.4375\/351.5625\/429.6875 ( 312.5\/390.625\/468.75\/546.875) единиц урона (до учета сопротивления).","Выбор таланта на дополнительный урон способности немедленно улучшит все активные применяемые Blood Rite Bloodseeker, если талант был выбран в момент задержки срабатывания.","Дает наземный обзор в радиусе 600 единиц в центре действия способности, который сохраняется еще 6 секунд после применения."],"mana":"100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"18\/16\/14\/12 ( 12\/10\/8\/6)","name":"Blood Rite","description":["Анимация применения: 0,3+0,63","Дальность применения: 1500","Область действия: 600","Задержка срабатывания: 2.6","Урон: 125\/175\/225\/275 ( 200\/250\/300\/350)","Длительность безмолвия: 3\/4\/5\/6"],"hot_key":"W","legacy_key":"B"},{"spell":"Герой чувствует ранения противников, получая дополнительные скорость передвижения и атаки, когда здоровье вражеского героя становится меньше 75%. Чем ниже уровень здоровья, тем сильнее эффект. Если здоровье вражеского героя упадёт ниже 25%, его станет видно в любой точке карты, даже если он невидим. Бонусы от разных противников складываются.","effects":["Способность Пассивная","Действует на Себя \/ Врагов"],"notes":["Изучение Thirst убирает порог скорости передвижения для Bloodseeker.","Первый заряд применяется, когда здоровье вражеского героя опускается ниже 75%, а последний - когда здоровье опускается ниже 26%.","Дает 0.6\/0.9\/1.2\/1.5 скорости атаки и 0.24%\/0.48%\/0.72%\/0.96% ( 0.6%\/0.84%\/1.08%\/1.32%) скорости передвижения за каждый процент потеряного здоровья между 75% и 25%. Но поскольку интерфейс не отображает десятичные дроби, скорость атаки увеличивается на 1 за каждые 1.67%\/1.11%\/0.83%\/0.67% потерянного здоровья, а скорость передвижения — на 1% за каждые 2%\/1%\/1%\/1% ( 1.67%\/1.19%\/0.93%\/0.76%) потерянного здоровья.","Когда здоровье вражеского героя падает ниже 25%, Thirst применяет к нему True Sight и делает его видимым сквозь туман войны.","Когда враги раскрываются с помощью Thirst, к ним применяется дебафф и эффект частиц, которые видны всем.","Bloodseeker также получает иконку в статус-баре, эффекты частиц и проговаривает определенные фразы, давая понять, что враг в данный момент обнаружен Thirst.","Thirst не активируется от вражеских иллюзий, но активируется от клонов героев.","Способность не активируется от спрятанных вражеских героев, но активируется от неуязвимых героев.","Бонусы остаются еще 4 секунды после смерти врага. Но при этом они не остаются и мгновенно исчезают, если у врага был Aegis of the Immortal или Reincarnation. Бонусы всегда с максимальными значениями, несмотря на процент здоровья, которое было у врага перед смертью.","Здесь указано, сколько дополнительно скорости атаки и передвижения Bloodseeker получает от Thirst при определенном количестве героев с здоровьем, меньше 25% от их максимального: 1 герой: 30\/45\/60\/75 доп. скорости атаки и 12%\/24%\/36%\/48% ( 30%\/42%\/54%\/66%) скорости передвижения. 2 героя: 60\/90\/120\/150 доп. скорости атаки и 24%\/48%\/72%\/96% ( 60%\/84%\/108%\/132%) скорости передвижения. 3 героя: 90\/135\/180\/225 доп. скорости атаки и 36%\/72%\/108%\/144% ( 90%\/126%\/162%\/198%) скорости передвижения. 4 героя: 120\/180\/240\/300 доп. скорости атаки и 48%\/96%\/144%\/192% ( 120%\/168%\/216%\/264%) скорости передвижения. 5 героев: 150\/225\/300\/375 доп. скорости атаки и 60%\/120%\/180%\/240% ( 150%\/210%\/270%\/330%) скорости передвижения."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Thirst","description":["Дальность: Глобальная","Порог здоровья для включения: 75%","Порог здоровья для видимости: 25%","Максимальный бонус скорости за каждого героя: 30\/45\/60\/75","Доп. скорость передвижения за героя: 12%\/24%\/36%\/48% ( 30%\/42%\/54%\/66%)"],"hot_key":"E","legacy_key":"T"},{"spell":"Разрывает кожу врага. Если он будет передвигаться, то за каждые 100 единиц будет получать урон, зависящий от его максимального запаса здоровья. Урон проходит сквозь невосприимчивость к магии и не может убить.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Чистый"],"notes":["Проверяет расстояние, пройденное юнитом под действием ультимейта, каждые 0,25 секунды сразу же после применения, проверяя 33\/41\/49 раз. Если позиция юнита изменится между проверками, он получит урон, основываясь на расстоянии. Для нанесения урона нет минимально требуемого расстояния. Даже незначительное перемещение наносит урон. Если юнит стал неуязвимым в тот момент, как произошла проверка, её значение устанавливается равным нулю, поэтому юнит не получит урон при следующей проверке независимо от преодаленного расстояния.","Здесь указано, сколько урона нанесет Rupture (до учета сопротивления) юниту, если он переместиться на определенное расстояние: Расстояние в 300 единиц: 21% от текущего здоровья Расстояние в 600 единиц: 38% от текущего здоровья Расстояние в 900 единиц: 51% от текущего здоровья Расстояние в 1200 единиц: 62% от текущего здоровья Расстояние в 1500 единиц: 70% от текущего здоровья","Выбор таланта на усиление урона не применится к уже действующим дебаффам от Rupture Bloodseeker.","Несколько применений способности на одну и ту же цель не складываются, но обновляют длительность.","Вопреки звуку, юниты под действием Rupture не получают урона, когда подбрасываются(к примеру, с помощью Torrent или Impale).","Можно применить на курьеров, но им урон не наносится."],"mana":"200\/225\/250","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"70\/60\/50 ( 0)","name":"Rupture","description":["Анимация применения: 0,4+0,53","Дальность применения: 700\/800\/900 ( 1300\/1400\/1500)","Урон в виде текущего здоровья за 100 единиц расстояния: 8%","Длительность: 8\/10\/12","Количество зарядов: 0 ( 2)","Время восстановление заряда: 0 ( 40)"],"hot_key":"R","legacy_key":"R"}],"bio":"Стригвир — прошедший ритуалы охотник; гончая Бескожих близнецов, отправленная с туманных вершин Ксакатокатля на поиски крови. Чтоб насытить близнецов, нужны поистине океаны жизненных соков, и горная империя уж давно бы опустела, не сумей жрецы с верхних плато задобрить богов. Посему Стригвир рыщет по миру в поисках кровавых битв. Жизненная энергия любой пролитой им крови тут же передаётся Бескожим близнецам через священные знаки на его оружии и броне. Прошли многие годы, а Стригвир всё ещё неустанен, как бешеный пёс, и свиреп в бою, как ненасытный шакал. Говорят, что в кровопролитном бою под его маской можно разглядеть черты самих близнецов, лично направляющих свою гончую.","talentsTips":["Талант на броню не дается иллюзиям.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на вампиризм аддитивно сочетается с другими источниками вампиризма."],"talents":["+18% к макс. скорости передвижения за героя от Thirst:-6 сек. перезарядки Blood Rite","25% вампиризма:+600 к дальности применения Rupture","+75 к урону от Blood Rite:+275 к здоровью","+6 к броне:+25 к скорости атаки"],"tips":["Покупка Quelling Blade в начале игры позволит получить максимум выгоды от Bloodrage, облегчив добивание крипов.","Когда активна способность Thirst, с героя снимается ограничение по скорости передвижения. Бонусы к скорости передвижения суммируются за каждого вражеского героя, имеющего малое количество здоровья. Способность не дает полного обзора вражеского героя. Отображается только модель и его здоровье.","Если пораженное существо способностью Rupture пройдет расстояние больше чем 1300 за 0.25 секунды, оно не получит урона.","Force Staff позволяет толкать цель, пораженную Rupture, отнимая ей 120\\240\\360 здоровья. Противникам, обладающим способностями телепортации, также будет нанесен урон, если они будут телепортироваться на некоторое расстояние (Например: Blink героя Anti-Mage или Blink героя Queen of Pain). Однако, противник может спастись свитком телепортации ( Town Portal Scroll), не получив при этом никакого урона.","Крипы, убитые предметом Radiance также восстанавливают здоровье, при помощи Bloodrage. Это решает проблемы с лечением и быстрым прокачиванием. Но копить на него с самого начала игры смысла нет, только если золото девать некуда.","Bloodseeker очень уязвим к ганкам. Старайтесь ганкать сами и видеть как можно больше территории на карте.","При ганках последовательность действий достаточно просто — накинуть Rupture, использовать Bloodrage (на себя или на врага по ситуации) и бить вручную. Если после всего этого у цели осталось меньше 30% здоровья, ее будет видно и Bloodseeker со своей скоростью ее легко догонит и добьет.","В некоторых ситуациях Bloodseeker может выступать как лесник или Support-герой. В первом случае упор делается на Blood Rite и Bloodrage, во второй работает только в том случае, если в команде много героев, полагающихся исключительно на физические атаки (например, Sniper или Wraith King)"],"desc":"%"}