{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Black_King_Bar_Avatar.mp3\/revision\/latest?cb=20191227195352",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Interrupts the user's channeling spells upon cast.",
        "Applies spell immunity for the duration and a basic dispel upon cast.",
        "During Avatar, the hero cannot be affected by Ghost Scepter or Ghost Shroud. Their buffs get removed immediately.",
        "Causes the user's model size to increase by 30% for its duration. This has no impact on its collision size.",
        "The duration of Avatar is bound to the hero. Rebuying Black King Bar does not reset it.",
        "For more details, including a list of spells which are not blocked, see Spell immunity."
      ],
      "mana": "0",
      "abilityName": "Avatar",
      "cooldown": "70",
      "description": "Grants Spell Immunity Duration decreases with each use.",
      "params": [
        "Duration: 10\/9\/8\/7\/6\/5"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 200 health, 1 health regen and 34 attack damage.",
    "For agility heroes, it grants 200 health, 1 health regen and 24 attack damage.",
    "For intelligence heroes, it grants 200 health, 1 health regen and 24 attack damage."
  ],
  "cost": "4050",
  "lore": null,
  "consistFrom": [
    "Ogre Axe",
    "Mithril Hammer",
    "Recipe"
  ],
  "boughtFrom": "Armor",
  "name": "Black King Bar",
  "description": "A powerful staff imbued with the strength of giants.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 Strength",
    "+24 Attack Damage"
  ],
  "tips": [
    "When facing a lot of magical damage or many disables, a Black King Bar alone can provide enough survivability, allowing carry heroes to focus on damage items after having Black King Bar. Vice versa, Black King Bar is not effective against physical damage, or spell immunity piercing spells, so other items for survivability should be considered (e.g. armor items against physical damage, or escape items against some spells).",
    "Vice versa, Black King Bar is not effective against physical damage, or spell immunity piercing spells, so other items for survivability should be considered (e.g. armor items against physical damage, or escape items against some spells).",
    "Black King Bar applies a basic dispel on cast allowing to clear out most negative status debuffs. Instead of casting it hastily to engage at first sight, a reactive activation against a debuff will be more beneficial."
  ]
}