{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Големы получают +80% к сопротивлению магии",
          "talentRight": "+20 к броне голема"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+25 к урону\/лечению от Shadow Word",
          "talentRight": "При смерти призывается голем"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-5 сек. перезарядки Shadow Word",
          "talentRight": "+40 урона в секунду от Upheaval"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+50 к скорости передвижения големов",
          "talentRight": "+3% к урону от Fatal Bonds"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fa\/Warlock_Fatal_Bonds_1.mp3\/revision\/latest?cb=20191216030434",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов"
      ],
      "notes": [
        "У отскоков Fatal Bonds нет задержки: все цели связываются одновременно.",
        "Приоритетными целями для связывания являются ближайшие существа, ещё не находящиеся под действием дебаффа. То есть при повторном использовании способность выберет врагов, не задетых первым применением, но если поблизости таких не будет, то связь сложится с предыдущим применением.",
        "То есть при повторном использовании способность выберет врагов, не задетых первым применением, но если поблизости таких не будет, то связь сложится с предыдущим применением.",
        "Может связывать существ в тумане войны, но не невидимых существ.",
        "Не применяется и не действует на Рошана.",
        "Распределяемый урон имеет тот же тип, что и его источник. То есть физический урон распространяется как физический, магический урон как магический, а чистый урон как чистый. Из-за этого распределяемый урон взаимодействует с каждым эффектом, реагирующим на урон (например, отключение Blink Dagger). Также на него влияет манипуляция уроном, например, усиление урона заклинаний Warlock.",
        "То есть физический урон распространяется как физический, магический урон как магический, а чистый урон как чистый.",
        "Из-за этого распределяемый урон взаимодействует с каждым эффектом, реагирующим на урон (например, отключение Blink Dagger).",
        "Также на него влияет манипуляция уроном, например, усиление урона заклинаний Warlock.",
        "Урон от Fatal Bonds имеет отметку \"неотражаемый\", что предотвращает взаимодействие урона с другими источниками урона с такой же отметкой.",
        "Распределяет урон до того, как он будет уменьшен или усилен любым способом на получающей его цели. Например, когда Abaddon получает урон под эффектом от Borrowed Time, связь по-прежнему распространяет урон до того, как способность превратит его в лечение. Также это относится к иллюзиям. При атаке связанной иллюзии, урон распространится до того, как он будет увеличен для иллюзии. Это касается и излишнего урона. Например, если существо с 10 единицами здоровья получает 1000 урона, то связь распределит процент от 1000 по всем связанным.",
        "Например, когда Abaddon получает урон под эффектом от Borrowed Time, связь по-прежнему распространяет урон до того, как способность превратит его в лечение.",
        "Также это относится к иллюзиям. При атаке связанной иллюзии, урон распространится до того, как он будет увеличен для иллюзии.",
        "Это касается и излишнего урона. Например, если существо с 10 единицами здоровья получает 1000 урона, то связь распределит процент от 1000 по всем связанным.",
        "Не распределяет отнимающий здоровье урон.",
        "Расстояние между связанными не важно. Где бы они не находились, существа будут распространять и получать урон.",
        "Источником распространяемого урона всегда является Warlock. Если существо умрёт от нанесенного Fatal Bonds урона, то убийство засчитается Warlock.",
        "Урон, распределенный Fatal Bonds, не провоцирует существ. Связанные нейтральные крипы не будут реагировать на урон.",
        "Увеличивает общий урон от каждого источника на 7,8125E-9% (TagTalent 6,3564708873633E-9%) при максимальном числе связанных существ.",
        "Последовательные использования Fatal Bonds сочетаются и действуют независимо друг от друга."
      ],
      "mana": "140",
      "hotKey": "Q",
      "cooldown": "36\/30\/24\/18",
      "description": "Соединяет несколько врагов магической связью, в результате чего часть урона, полученного любым из них, наносится и остальным.",
      "spellName": "Fatal Bonds",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: 1000",
        "Радиус отскока: 700",
        "Число отскоков: 6",
        "Распределяемый урон: 12%\/16%\/20%\/24% (TagTalent 15%\/19%\/23%\/27%)",
        "Длительность: 25",
        "Нельзя применить к врагам с иммунитетом к заклинаниям. Не связывает врагов с иммунитетом. Связь наносит урон, если дебафф был размещен до иммунитета (TagTalentпри этом магический урон снижается до 0).",
        "Блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Древнее заклятие, которое объединяет жизненные силы различных существ в единую сущность."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5e\/Warlock_Shadow_Word_1.mp3\/revision\/latest?cb=20191216030441",
      "effects": [
        "Способность Направленная на существо (TagAghanim Направленная на область)",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Наносит урон или лечит с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 12 раз.",
        "Наносит до 180\/300\/420\/540 (TagTalent 480\/600\/720\/840) урона цели (до уменьшений) или же исцеляет на то же значение союзника.",
        "Последующие использования Shadow Word сочетаются и действуют независимо друг от друга на цели.",
        "Первый звук проигрывается, если цель — союзник, вторая - когда целью является враг.",
        "Можно применить на союзных курьеров.",
        "Aghanim's Shard превращает Shadow Word в заклинание, направленное на область, поэтому им больше нельзя выбирать существ напрямую. Применение на себя всё еще выбирает Warlock, делая его центром области.",
        "Применение на себя всё еще выбирает Warlock, делая его центром области."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "W",
      "cooldown": "14 (TagTalent 9)",
      "description": "Герой шепчет заклинание, постепенно излечивая союзника или нанося урон врагу.",
      "spellName": "Shadow Word",
      "params": [
        "Анимация применения: 0,4+0,76",
        "Дальность применения: 450\/550\/650\/750",
        "Урон в секунду: 15\/25\/35\/45 (TagTalent 40\/50\/60\/70)",
        "Лечение в секунду: 15\/25\/35\/45 (TagTalent 40\/50\/60\/70)",
        "Длительность: 12",
        "Радиус: 450",
        "Изменение скорости передвижения: 10%",
        "Способность применяется по области радиусом 450. Увеличивает скорость передвижения на 450, если цель — союзник, и уменьшает скорость передвижения на 450, если цель — враг.",
        "Можно применить к союзникам с иммунитетом к заклинаниям. Нельзя применить к врагам с иммунитетом. Пытается нанести урон, если дебафф был применен до иммунитета и не был развеян.",
        "Блокируется в качестве заклинания, направленного на существо. Не блокируется при превращении в заклинание, направленное на область."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Тайные искусства Демнока могут найти множество применений — будь то мощные исцеляющие чары либо губительное проклятье."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Warlock_Upheaval.mp3\/revision\/latest?cb=20191216030444",
      "effects": [
        "Способность Направленная на область \/ Произносимая",
        "Действует на Врагов"
      ],
      "notes": [
        "Сила замедления зависит от длительности произнесения, а не от того, как долго существо провело в затронутой области.",
        "Процент замедления увеличивается на 6%\/8,5%\/11%\/13,5% каждые 0,5 секунды спустя 0,5 секунды после применения.",
        "Для максимального замедления в 40%\/60%\/80%\/100% требуется 3,33\/3,53\/3,64\/3,7 сек.",
        "Дебафф замедления применяется или обновляется с теми же интервалами."
      ],
      "mana": "70\/90\/110\/130",
      "hotKey": "E",
      "cooldown": "50\/46\/42\/38",
      "description": "Мощный замедляющий поток энергии, со временем становящийся сильнее. Действует до 10\/12\/14\/16 секунд. Эффект сохраняется в течение 3 секунд после того, как враг покинул зону действия или заклинание прервалось.",
      "spellName": "Upheaval",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 1200",
        "Радиус: 500\/550\/600\/650",
        "Макс. длительность: 10\/12\/14\/16",
        "Замедление скорости передвижения в секунду: 12%\/17%\/22%\/27%",
        "Максимальное замедление: 40%\/60%\/80%\/100%",
        "Длительность замедления: 3",
        "Урон в секунду: 40",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Дэмнок управляет пространством и временем, ослабляя целые армии."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/ff\/Warlock_Chaotic_Offering_1.mp3\/revision\/latest?cb=20191216030434",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Големы всегда призываются в центре выбранной области.",
        "Големы - это древние крипы-герои, поэтому некоторые способности взаимодействуют с ними иначе. Для более подробной информации перейдите по ссылкам.",
        "С Aghanim's Scepter Chaotic Offering призывает второго голема спустя 0,2 секунды после первого. Это увеличивает общую длительность оглушения до 60,2 секунды.",
        "Это увеличивает общую длительность оглушения до 60,2 секунды.",
        "При появлении големы уничтожают все деревья в радиусе 600 вокруг себя.",
        "Визуальный эффект и звуки во время задержки видны и слышны для всех.",
        "Также играет звуковой эффект во время анимации применения, который также слышен для всех.",
        "С выбранным талантом 20-го уровня в месте смерти Warlock призывается один голем. Характеристики этого голема зависят от текущего уровня Chaotic Offering. Также к нему применяются таланты 25 уровня, в зависимости от того, какой был выбран. Aghanim's Scepter не влияет на характеристики этого голема и не вызывает при смерти Warlock 2 големов. Голем не призывается при смерти Warlock с Aegis of the Immortal в инвентаре. В отличии от обычного применения голем от таланта вызывается мгновенно при смерти Warlock. Оглушение по области от Chaotic Offering также применяется вокруг Warlock.",
        "Характеристики этого голема зависят от текущего уровня Chaotic Offering. Также к нему применяются таланты 25 уровня, в зависимости от того, какой был выбран.",
        "Aghanim's Scepter не влияет на характеристики этого голема и не вызывает при смерти Warlock 2 големов.",
        "Голем не призывается при смерти Warlock с Aegis of the Immortal в инвентаре.",
        "В отличии от обычного применения голем от таланта вызывается мгновенно при смерти Warlock. Оглушение по области от Chaotic Offering также применяется вокруг Warlock."
      ],
      "mana": "250\/375\/500",
      "hotKey": "R",
      "cooldown": "170",
      "description": "Вызывает из недр земли голема, оглушающего врагов на 1 секунду. Голем живёт сек., получает меньше урона от заклинаний, обжигает всех врагов вокруг и имеет уникальный эффект атаки.",
      "spellName": "Chaotic Offering",
      "params": [
        "Анимация применения: 0,5+0,7",
        "Дальность применения: 1200",
        "Радиус оглушения: 600",
        "Задержка: 0,5",
        "Число големов: 1 (TagAghanim 2)",
        "Длительность оглушения: 1",
        "Длительность жизни големов: 60",
        "Интервал появления големов: 0,2",
        "Призывает 2 более слабых големов, за убийство которых дают меньше золота."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Дэмнок выпускает из своего дредвудского посоха плененного духа, который разрушает вражеские ряды."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Не срабатывает на постройки и варды.",
        "Не наносит урон существам в призрачной форме и с иммунитетом к атакам.",
        "Радиус закреплен за атакуемой целью.",
        "Урон также наносится цели атаки, а не только ближайшим существам."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Наносит дополнительный урон врагам вокруг цели атаки.",
      "spellName": "Flaming Fists",
      "params": [
        "Радиус: 300",
        "Урон: 40\/50\/60"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Permanent Immolation — это аура. Её дебафф задерживается на 0,5 секунды.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа.",
        "Permanent Immolation от нескольких големов складывается."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Обжигает противников рядом с големом, нанося им периодический урон.",
      "spellName": "Permanent Immolation",
      "params": [
        "Радиус: 300",
        "Урон в секунду: 30\/50\/70",
        "Длительность задержки ауры: 0,5",
        "Пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 26.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 1.0,
    "attrAgility": 10.0
  },
  "description": "Warlock — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Он имеет четыре способности, каждая из которых является активной. Первая способность, Fatal Bonds, соединяет несколько врагов магической связью, в результате чего 25% от урона, полученного любым из них, наносится и остальным. Второй способностью, Shadow Word, Warlock излечивает дружественных существ или наносит урон вражеским на протяжении некоторого времени. Третьей способностью, Upheaval, герой замедляет врагов потоком энергии, со временем становящийся сильнее. Ультимативной способностью, Chaotic Offering, Warlock вызывает из пучин Warlock Golem, оглушающего врагов на 1 секунду. Время жизни голема — 60 секунд, он получает меньше урона от заклинаний и при атаке накладывает на жертву Permanent Immolation и Flaming Fists. Если изучить талант на 25 уровне то у големов также будет и иммунитет к заклинаниям. Улучшение с Aghanim's Scepter позволяет призывать двух големов со сниженными параметрами до 75% и наградой за убийство на 50%.",
  "history": "Будучи ректором и главой отдела реликвий в скрытых архивах Ультимирской академии, Дэмнок Лэнник неустанно искал затерянные, редкие и запретные тома. Ни проклятые храмы, ни коварные пещерные ходы — ничто не заставило бы Дэмнока свернуть с тропы, стоило ему прознать, что, быть может, в конце пути он найдет хотя бы жалкий кусочек свитка с древними знаниями. И так часто приходилось ему сталкиваться с сущностями, оставленными защищать эти древние знания, что он наконец посчитал необходимым изучить таинства магии. С такой же одержимостью принялся Дэмнок за учение, с какой отправлялся в опаснейшие походы за записями — и превзошёл всех чернокнижников Ультимирской академии за время, которого остальным хватило бы, лишь чтобы изучить самые основы. В последнюю очередь он вырезал себе посох из дредвудского дерева и заточил в него духа из Глубин Ада. И, ожидая дня, когда он найдёт последнюю затерянную книгу заклинаний, Дэмнок приступил к своему собственному произведению — Чёрному гримуару. Сомнений нет: он будет весьма поучительным.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Големы получают +80% к сопротивлению магии",
      "talentRight": "+20 к броне голема"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+25 к урону\/лечению от Shadow Word",
      "talentRight": "При смерти призывается голем"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-5 сек. перезарядки Shadow Word",
      "talentRight": "+40 урона в секунду от Upheaval"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+50 к скорости передвижения големов",
      "talentRight": "+3% к урону от Fatal Bonds"
    }
  ]
}