{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+5 зарядов Shrapnel",
          "talentRight": "+100 к дальности атаки"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+24 к урону в секунду от Shrapnel",
          "talentRight": "+28 к дальности отбрасывания целей от Headshot"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+14% к замедлению от Shrapnel",
          "talentRight": "+30 к скорости атаки"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к урону",
          "talentRight": "-15% перезарядки заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8a\/Sniper_Shrapnel.mp3\/revision\/latest?cb=20191216024011",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При изучении Shrapnel Sniper сразу получает все 3 заряда. Выбор таланта на дополнительные заряды также сразу дает 5 зарядов.",
        "Выбор таланта на дополнительные заряды также сразу дает 5 зарядов.",
        "Shrapnel начинает наносить урон, замедлять и давать обзор после небольшой задержки.",
        "Дает летающий обзор в радиусе 450 единиц в выбранной области.",
        "Урон и замедление предоставлены аурой. Её дебафф задерживается на 0.5 секунды. Несколько источников ауры не складываются.",
        "Наносит урон с интервалом в 1 секунду сразу после размещения дебаффа, нанося урон до 11 раз.",
        "Наносит до 220\/385\/550\/715 (TagTalent 484\/649\/814\/979) урона одному существу (до уменьшений).",
        "Не действует на строения."
      ],
      "mana": "50",
      "hotKey": "Q",
      "cooldown": "0",
      "description": "Использует заряд шрапнели, покрывая указанную область дождем из разрывной дроби. Противники под ней получают урон и замедляются. Раскрывает туман войны в области действия. Заряд способности восстанавливается каждые 40 секунд.",
      "spellName": "Shrapnel",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 1800",
        "Радиус: 450",
        "Задержка: 1,2",
        "Урон в секунду: 20\/35\/50\/65 (TagTalent 44\/59\/74\/89)",
        "Замедление скорости передвижения: 15%\/20%\/25%\/30% (TagTalent 29%\/34%\/39%\/44%)",
        "Длительность задержки ауры: 0.5",
        "Длительность: 10",
        "Число зарядов: 3 (TagTalent 8)",
        "Время восстановления заряда: 40 (TagTalent 34)",
        "Замедление остается и пытается нанести урон, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Универсальная винтовка Кардела способна стрелять зажигательными патронами, особенно эффективными в условиях позиционной войны."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов \/ Союзников",
        "Урон Физический"
      ],
      "notes": [
        "Headshot может промахнуться.",
        "Сработавшая атака сначала применяет дебаффы, затем наносит урон.",
        "Дополнительный урон наносится одним источником вместе с атакой и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "В среднем увеличивает урон Sniper на 8\/20\/32\/44.",
        "Не срабатывает при атаке вардов и строений, но срабатывает на союзников.",
        "Headshot использует псевдослучайное распределение.",
        "При выборе таланта на отбрасывание, сработавшая способность применяет принудительное движение к цели, отталкивая её от Sniper. Отбрасывание не прерывает произносимые заклинания. Отбрасывание не применится на существ, уже находящихся под действием других источников принудительного движения. Отбрасывает существ со скоростью в 100 (380) единиц.",
        "Отбрасывание не прерывает произносимые заклинания.",
        "Отбрасывание не применится на существ, уже находящихся под действием других источников принудительного движения.",
        "Отбрасывает существ со скоростью в 100 (380) единиц."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Герой стреляет точнее, отчего каждая его атака может нанести дополнительный урон и немного оттолкнуть врага.",
      "spellName": "Headshot",
      "params": [
        "Шанс срабатывания: 40%",
        "Урон: 20\/50\/80\/110",
        "Замедление скорости передвижения: 100%",
        "Замедление скорости атаки: 100",
        "Дальность отбрасывания: 10 (TagTalent 38)",
        "Длительность замедления: 0.5",
        "Длительность отбрасывания: 0.1",
        "Урон проходит сквозь иммунитет к заклинаниям, замедление и отбрасывание — нет. Замедление и отбрасывание остаются, если дебаффы были применены до иммунитета и не были развеяны."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Охотясь на горных тварей, юный Кардел научился идеально отслеживать траекторию передвижения врагов."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Ненаправленная \/ Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Sniper.",
        "При применении Sniper получает бафф, удваивающий дальность атаки от Take Aim.",
        "У баффа нет установленной длительности. Он активен до совершения атаки или смерти заклинателя.",
        "Перезарядка начинается после потери баффа любым путем, а не после применения.",
        "Пассивно увеличивает общую дальность атаки Sniper до 650\/750\/850\/950 (TagTalent 750\/850\/950\/1050). При активации следующая атака поражает цель на расстоянии до 750\/950\/1150\/1350 (TagTalent 850\/1050\/1250\/1450)",
        "При активации следующая атака поражает цель на расстоянии до 750\/950\/1150\/1350 (TagTalent 850\/1050\/1250\/1450)"
      ],
      "mana": "30",
      "hotKey": "E",
      "cooldown": "9\/8\/7\/6 (TagTalent 7,65\/6,8\/5,95\/5,1)",
      "description": "Увеличивает дальность атак героя. Применение удвоит бонус для следующей атаки, после которой способность начнёт перезаряжаться.",
      "spellName": "Take Aim",
      "params": [
        "Анимация применения: 0+0",
        "Пассивная доп. дальность атаки: 100\/200\/300\/400",
        "Активная доп. дальность атаки: 100\/200\/300\/400",
        "Число атак при активации: 1",
        "Истощение отключает пассивную дальность атаки. Бонус от активации продолжает действовать."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Кардел всегда старается держаться от опасности как можно дальше, при этом не забывая о своей задаче: стрелять точно в цель."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/58\/Sniper_Assassinate_1.mp3\/revision\/latest?cb=20191216024003",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Снаряд летит со скоростью 2500.",
        "Assassinate сначала наносит урон, затем применяет дебафф оглушения.",
        "Хотя длительность оглушения равна 0,01 сек., но фактически она равна 0.033 из-за ограничения скорости тиков сервера.",
        "Assassinate размещает дебафф на цель как только Sniper начинает применение. Дебафф длится либо 4 секунды, либо до попадания снаряда, либо же до отмены применения. Дебафф дает общий обзор на выбранное существо. Не дает обзора при выборе нейтральных крипов. Дебафф дает эффект True Sight на цель. То есть, Assassinate нельзя отменить или избежать, уйдя в невидимость без иммунитета к True Sight. Дебафф виден всем. При этом прицел над целью виден только союзникам.",
        "Дебафф длится либо 4 секунды, либо до попадания снаряда, либо же до отмены применения.",
        "Дебафф дает общий обзор на выбранное существо. Не дает обзора при выборе нейтральных крипов.",
        "Дебафф дает эффект True Sight на цель. То есть, Assassinate нельзя отменить или избежать, уйдя в невидимость без иммунитета к True Sight.",
        "Дебафф виден всем. При этом прицел над целью виден только союзникам.",
        "Может напрямую выбирать целью неуязвимых существ и не отменится, если цель стала неуязвимой во время применения. Дебафф, дающий обзор, не накладывается при выборе неуязвимого существа, но остается, если оно стало неуязвимым во время применения. Снаряд не сработает на цель, если она останется неуязвимой на момент попадания.",
        "Дебафф, дающий обзор, не накладывается при выборе неуязвимого существа, но остается, если оно стало неуязвимым во время применения.",
        "Снаряд не сработает на цель, если она останется неуязвимой на момент попадания.",
        "Не может выбрать целью скрытых существ и отменится, если цель стала скрытой.",
        "Начальный звук подготовки оружия в момент применения слышен только Sniper."
      ],
      "mana": "175\/225\/275",
      "hotKey": "R",
      "cooldown": "20\/15\/10 (TagTalent 17\/12,75\/8,5)",
      "description": "Герой с огромного расстояния целится во вражеское существо и после небольшой задержки совершает сокрушительный выстрел, ненадолго оглушающий цель.",
      "spellName": "Assassinate",
      "params": [
        "Анимация применения: 2+1,37 (TagAghanim 0,5+3,04)",
        "Дальность применения: 3000",
        "Урон: 320\/485\/650",
        "Длительность оглушения: 0,01 (TagAghanim 1\/1,25\/1,5)",
        "Макс. длительность баффа обзора: 4",
        "Способность применяется быстрее и оглушает жертву.",
        "Блокируется при попадании, но дает обзор и True Sight на цель.",
        "Нельзя избежать с помощью невидимости без иммунитета к True Sight, так как дебафф применяется в начале применения."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Чтобы осуществить пророчество и вернуться в родной город, Кардел должен быть уверен, что следующий выстрел будет столь же метким, как и тот, что он совершил в далёкий день своего испытания."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.7,
    "attrStrength": 19.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 2.6,
    "attrAgilityInc": 3.4,
    "attrAgility": 21.0
  },
  "description": "Sniper — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Shrapnel, использует заряд шрапнели, покрывая указанную область дождем из разрывной дроби. Противники под ним замедляются и получают урон. Раскрывает туман войны в области действия. Пассивная способность, Headshot, дает шанс нанести дополнительный урон и ненадолго замедлить противника. Активируемая способность, Take Aim, пасивно увеличивает дальность стрельбы. При активации удваивает бонус дальности атаки. Ультимативной способностью, Assassinate, Sniper целится во вражеского юнита и через несколько секунд совершает сокрушительный выстрел, который наносит урон с огромной дистанции. Способность кратковременно оглушает цель.",
  "history": "Кардел Остроглаз родился глубоко в горах Кноллена, где смышлёнцы с незапамятных времен жили охотой на странных существ-скалолазов, обитавших над деревней — отстреливая их издали и собирая упавшие с высоких утёсов туши. Наш герой был одним из лучших стрелков своего народа — ружьё словно было продолжением его руки, а выстрел — её прикосновением. В день инициации, когда Кардел должен был стать полноправным членом деревни, его ждало древнее испытание: убить животное на одном из утёсов одним выстрелом со дна долины. Промах лишил бы стрелка всякой чести. Под взглядами всей деревни Кардел выстрелил. Зверь был убит, толпа взревела. Но чуть только тушу нашли, ликования стихли: старейшины обнаружили, что пуля попала прямо в средний глаз зверя и застряла в жвалах. Этот зловещий знак был описан в тёмном пророчестве, предрекавшем стрелку славу, но обрекая его на изгнание. Один точный выстрел вынудил Кардела расстаться со своим народом — и никто не примет его обратно, пока он не выполнит пророчество, добившись легендарного величия на поле боя.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+5 зарядов Shrapnel",
      "talentRight": "+100 к дальности атаки"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+24 к урону в секунду от Shrapnel",
      "talentRight": "+28 к дальности отбрасывания целей от Headshot"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+14% к замедлению от Shrapnel",
      "talentRight": "+30 к скорости атаки"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к урону",
      "talentRight": "-15% перезарядки заклинаний"
    }
  ]
}