{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Faceless Void: 160 здоровья и 0,8 регенерации здоровья.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+140 к радиусу Chronosphere",
          "talentRight": "+20% к универсальному уклонению от Backtrack"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-1,75s Time Walk",
          "talentRight": "+40 к скорости атаки"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+275 к дальности применения Time Walk",
          "talentRight": "+55 к урону от Time Lock"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8 к силе",
          "talentRight": "+12 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Time_Walk.mp3\/revision\/latest?cb=20141204165833",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя (TagAghanim Врагов)"
      ],
      "notes": [
        "Во время рывка Faceless Void движется со скоростью 3000.",
        "Во время действия этой способности Faceless Void неуязвим.",
        "Не даёт возможность избежать снаряда.",
        "Не перемещает на полную дистанцию при выборе точки, находящейся ближе, чем максимальная дистанция.",
        "При использовании отменяет любой урон, полученный Faceless Void за последние 2 секунды, возвращая здоровье. Также учитывается урон, нанесенный союзниками.",
        "Так как это эффект лечения, то на него действует манипуляция лечением.",
        "Отменяет только 3 типа урона. Лечение и отнимание здоровья не отменяются. То есть нельзя отменить Sunder, False Promise, Soul Ring и Armlet of Mordiggian.",
        "То есть нельзя отменить Sunder, False Promise, Soul Ring и Armlet of Mordiggian.",
        "Не влияет на баффы и дебаффы, перезарядки и ману.",
        "С Aghanim's Scepter применяет Time Lock в радиусе действия на всех врагов в конечной точке. Не совершает мгновенные атаки для активации Time Lock. Вместо этого на врагов накладывается модификатор, который активирует способность. Развеивание дебаффа не убирает оглушение от Time Lock, но предотвращает мгновенную атаку от способности.",
        "Не совершает мгновенные атаки для активации Time Lock. Вместо этого на врагов накладывается модификатор, который активирует способность.",
        "Развеивание дебаффа не убирает оглушение от Time Lock, но предотвращает мгновенную атаку от способности."
      ],
      "mana": "40",
      "hotKey": "Q",
      "cooldown": "24\/18\/12\/6 (TagTalent 22,25\/16,25\/10,25\/4,25)",
      "description": "Совершает рывок к указанной точке и восстанавливает здоровье, потерянное за последние 2 секунды.",
      "spellName": "Time Walk",
      "params": [
        "Анимация применения: 0,3+0,2",
        "Дальность применения: Глобальная",
        "Дальность перемещения: 675 (TagTalent 950)",
        "Радиус применения Time Lock: 0 (TagAghanim 250)",
        "Время отмены урона: 2",
        "Применяет способность Time Lock на всех существ в точке окончания прыжка.",
        "Не применяет Time Lock к врагам с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Дарктеррор разрывает ткань времени, проходя через Класзурем и мгновенно возвращаясь назад."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3d\/Time_Dilation.mp3\/revision\/latest?cb=20151218155509",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов"
      ],
      "notes": [
        "Действует на невидимых существ и существ в тумане войны, но не на неуязвимых или спрятанных.",
        "Под действием дебаффа заставляет перезаряжаться вражеские способности на 75% дольше.",
        "Не влияет на время перезарядки предметов. Влияет на перезарядку пассивных способностей.",
        "Не влияет на время восстановления способностей, имеющих заряды. Если был использован последний заряд способности и её иконка показала перезарядку, то дебафф будет наложен. Заморозка этой перезарядки означает, что таймер восстановления заряда и время перезарядки рассинхронизируются, поэтому способность остается на перезарядке даже после того как заряд появится.",
        "Если был использован последний заряд способности и её иконка показала перезарядку, то дебафф будет наложен.",
        "Заморозка этой перезарядки означает, что таймер восстановления заряда и время перезарядки рассинхронизируются, поэтому способность остается на перезарядке даже после того как заряд появится.",
        "У замедления нет лимита по зарядам. Каждая способность на перезарядке добавляет заряд. Также учитывает перезарядку скрытых способностей, такие как неактивные заклинания у Invoker, Battle Cry, Morph или способности, даваемые Aghanim's Scepter. Украденные Rubick способности, которые имеют перезарядку, но которые уже заменены или время действия которых закончилось, в счёт не идут, поскольку они не скрываются, а убираются.",
        "Также учитывает перезарядку скрытых способностей, такие как неактивные заклинания у Invoker, Battle Cry, Morph или способности, даваемые Aghanim's Scepter.",
        "Украденные Rubick способности, которые имеют перезарядку, но которые уже заменены или время действия которых закончилось, в счёт не идут, поскольку они не скрываются, а убираются.",
        "Дебафф замедления непрерывно проверяет все перезарядки и мгновенно адаптирует под них свое значение замедления.",
        "Перезарядка способностей может быть сброшена (TagTalent Refresher Orb) под эффектом от Time Dilation.",
        "Несколько использований Time Dilation не складываются, но обновляют длительность."
      ],
      "mana": "75",
      "hotKey": "W",
      "cooldown": "40\/34\/28\/22",
      "description": "Накладывает на окружающих врагов временнóе поле, продлевая перезарядку их способностей на 8\/10\/12\/14 секунд. Жертвы передвигаются и атакуют на 10% медленнее за каждую поражённую способность.",
      "spellName": "Time Dilation",
      "params": [
        "Анимация применения: 0,1+0,77",
        "Радиус: 775",
        "Замедление перезарядки: 75%",
        "Замедление за способность: 10%",
        "Длительность: 8\/10\/12\/14",
        "Эффекты остаются, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Для тех, кто сражается с Дарктеррором, каждый миг тянется вечность."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический \/ Мгновенная атака"
      ],
      "notes": [
        "Не сочетается с остальными источниками оглушающего удара. Оглушение от Skull Basher и Abyssal Blade отключено для Faceless Void.",
        "Сработавшая атака сначала применяет дебафф, а затем наносит урон.",
        "Time Lock действует на союзных существ, но не на варды и строения.",
        "При срабатывании применяется оглушающий дебафф. Спустя 0,33 секунды наносится вторая атаки и урон. Урон наносится отдельным источником и считается уроном заклинания. Он не добавляется к основному урону. То есть на него действует вампиризм и усиление урона заклинаний, но не вампиризм, критический или прорубающий удар. Вторая атака — мгновенная, также активирующая модификаторы атаки. То есть она также может активировать свою же способность. Сначала применяет мгновенную атаку, затем урон Time Lock.",
        "Урон наносится отдельным источником и считается уроном заклинания. Он не добавляется к основному урону.",
        "То есть на него действует вампиризм и усиление урона заклинаний, но не вампиризм, критический или прорубающий удар.",
        "Вторая атака — мгновенная, также активирующая модификаторы атаки. То есть она также может активировать свою же способность.",
        "Сначала применяет мгновенную атаку, затем урон Time Lock.",
        "Несмотря на визуальный эффект, угол второй атаки продолжает основываться на позиции Faceless Void, поэтому прорубание поражает те цели, что находится герой, а не возникает иллюзия.",
        "В среднем добавляет к каждой атаке 12%\/16%\/20%\/24% + 2,4\/4\/6\/8,4 (TagTalent 9\/12,8\/17\/21,6) единиц магического урона.",
        "Time Lock использует псевдослучайное распределение."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Атака может остановить время для вражеского существа, отчего оно получает ещё один удар.",
      "spellName": "Time Lock",
      "params": [
        "Шанс срабатывания: 12%\/16%\/20%\/24%",
        "Доп. урон: 20\/25\/30\/35 (TagTalent 75\/80\/85\/90)",
        "Задержка второй атаки: 0,33",
        "Длительность на героях: 0,65",
        "Длительность на не-героях: 2"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Удары Дарктеррора способны выбить противника в другое измерение."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5f\/Chronosphere.mp3\/revision\/latest?cb=20140506095322",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Союзников"
      ],
      "notes": [
        "Chronosphere действует на всех существ, которые не находятся под контролем Faceless Void, включая строения, варды и союзников.",
        "Не действует на курьеров, спрятанных существ и неуязвимых героев. На всех остальных неуязвимых существ способность действует.",
        "Мгновенно разрушает Homing Missiles и жуков от The Swarm.",
        "Мгновенно возвращает зацепившихся Phantom's Embrace к заклинателю и замораживает запущенных фантомов.",
        "В Chronosphere на Faceless Void и подконтрольных ему существ действует ускорение (и их нельзя замедлить ниже установленного значения) и они могут проходить сквозь других существ.",
        "Иллюзии Faceless Void (подконтрольные ему, созданные союзниками или противниками) никогда не обезвреживаются любой Chronosphere.",
        "При этом скорость передвижения и возможность проходить сквозь существ дается только использовавшему способность.",
        "Дает летающий обзор и эффект True Sight в области действия на всю длительность.",
        "Затронутые существа оглушаются. Когда остальные существа входят в область, они также оглушаются на оставшуюся длительность.",
        "Отменяет большинство источников принудительного движения при применении обезвреживающего дебаффа к существу.",
        "Существ можно вытащить из Chronosphere некоторыми заклинаниями. Force Staff, Hurricane Pike, Snowball и Geomagnetic Grip этого сделать не могут.",
        "Вопреки визуальным эффектам область действия — цилиндр, а не сфера."
      ],
      "mana": "150\/225\/300",
      "hotKey": "R",
      "cooldown": "160",
      "description": "Создает прореху в пространстве и времени, заключая всех врагов в сферу и сильно увеличивая свою скорость передвижения внутри нее. Только Faceless Void и подконтрольные ему существа остаются нетронутыми ее силой. Раскрывает невидимость внутри сферы.",
      "spellName": "Chronosphere",
      "params": [
        "Анимация применения: 0,35+0,7",
        "Дальность применения: 600",
        "Радиус: 450 (TagTalent 590)",
        "Скорость передвижения в сфере: 1000",
        "Длительность: 4\/4,5\/5",
        "Иммунитет Faceless Void к Chronosphere не отключается истощением."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Когда открывается проход в Класзурем, все бедняги, оказавшиеся в проходе, вряд ли могут выбраться из него."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Дает Faceless Void шанс полностью избежать урона.",
        "Backtrack относится к группе эффектов, отрицающих урон. Способность не относится к уклонению. То есть она лишь отрицает урон, а не уклоняется от любых побочных эффектов (например оглушений) от заклинаний или атак. При срабатывании Backtrack на атаки с эффектом сжигания маны избегается лишь урон, а мана все равно сжигается. Также это означает, что атаки с эффектом True Strike и точность не мешают Backtrack избегать урона. У уклонения приоритет выше, чем у Backtrack. При срабатывании уклонения Backtrack на эту атаку не срабатывает.",
        "То есть она лишь отрицает урон, а не уклоняется от любых побочных эффектов (например оглушений) от заклинаний или атак.",
        "При срабатывании Backtrack на атаки с эффектом сжигания маны избегается лишь урон, а мана все равно сжигается.",
        "Также это означает, что атаки с эффектом True Strike и точность не мешают Backtrack избегать урона.",
        "У уклонения приоритет выше, чем у Backtrack. При срабатывании уклонения Backtrack на эту атаку не срабатывает.",
        "У Backtrack третий высочайший приоритет в группе эффектов, отрицающих урон. То есть в комбинации с Aphotic Shield или Living Armor Bactrack отрицает урон, в то время, как способности этого не делают.",
        "То есть в комбинации с Aphotic Shield или Living Armor Bactrack отрицает урон, в то время, как способности этого не делают.",
        "Вместе с всеми эффектами, манипулирующими уроном, Bactrack может отрицать все 3 типа урона. В среднем усиливает эффективное здоровье Faceless Void на 25%.",
        "В среднем усиливает эффективное здоровье Faceless Void на 25%.",
        "Игнорирует урон, помеченный как отнимающий здоровье.",
        "Backtrack использует псевдослучайное распределение."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Шанс срабатывания: 20%",
      "spellName": "Backtrack",
      "params": [
        "Шанс срабатывания: 20%"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 22.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.0,
    "attrAgility": 23.0
  },
  "description": "Faceless Void — это герой с ближним типом атаки, основной характеристикой которого является ловкость. Его первая способность, Time Walk, совершает рывок к указанной точке, давая Вам возможность легко заходить и выходить из сражений и вернуть полученный недавно урон. С помощью Time Dilation, Увеличивает перезарядку способностей противника, также понижает скорость их атаки и передвижения. Пассивная способность, Time Lock, дает шанс оглушить противника нанося при этом дополнительный урон. Ультимативная способность, Chronosphere, позволяет создавать сферу, которая останавливает всех существ внутри, раскрывает невидимость противников и сильно увеличивает скорость передвижения героя внутри.",
  "history": "Безликий ужас Faceless Void по имени Дарктеррор — гость из Класзурема — другой реальности, расположенной вне времени. До сих пор непонятно, зачем такое могущественное существо принимает участие в боях в нашем мире. Возможно, какие-то события, происходящие в этом плане, способны повлиять на великую войну за камни Немезиды. Время ничего не значит для Дарктеррора, поэтому он без проблем способен обратить его во вред врагам или на помощь себе и союзникам. Его уникальные способности не способны полностью раскрыться в нашем мире, однако Void черпает силы прямо из космоса, что делает его крайне опасным противником в бою.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+140 к радиусу Chronosphere",
      "talentRight": "+20% к универсальному уклонению от Backtrack"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-1,75s Time Walk",
      "talentRight": "+40 к скорости атаки"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+275 к дальности применения Time Walk",
      "talentRight": "+55 к урону от Time Lock"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8 к силе",
      "talentRight": "+12 к урону"
    }
  ]
}