{
  "abilities": [
    {
      "notes": [
        "Hoof Stomp first applies the debuff, then the damage"
      ],
      "item_behaviour": [],
      "description": "Slams the ground, stunning and damaging nearby enemy units.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.5+0.3",
        "Radius: 350",
        "Damage: 120\/180\/240\/300",
        "Stun Duration: 2\/2.2\/2.4\/2.6 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 3\/3.2\/3.4\/3.6)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Centaur_Warrunner_Hoof_Stomp.mp3\/revision\/latest?cb=20191216011917",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "18\/16\/14\/12",
      "aghanim": null,
      "name": "Hoof Stomp",
      "cooldown": "100\/110\/120\/130",
      "legacy_key": "F",
      "story": "When the mighty hoof of the Warrunner touches soil, the tremors are felt far and wide."
    },
    {
      "notes": [
        "The damage radius is centered around the target, not around Centaur",
        "Double Edge first apply the movement speed slow, the self Strength bonus, then damage the enemies within the area at a random order, and then the self-damage. Deals magical damage to the targets and self. The self-damage is never lethal, so it cannot be used to deny oneself",
        "SHARD NOTES The  strength bonus is only granted when hitting heroes and clones, excluding illusions and creep-heroes. Each hit enemy hero increases its stack count and refreshes the duration of the entire stack. Increases the total amount of strength (base and bonus) by 15%\/30%\/45%\/60%\/75% with each amount of stacks. Since Double Edge first applies the strength stacks before the damage, the strength as damage multiplier effectively increases to the following values per stack upon cast: Level 1: 69%\/78%\/87%\/96%\/105% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 115%\/130%\/145%\/160%\/175%) Level 2: 92%\/104%\/116%\/128%\/140% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 138%\/156%\/174%\/192%\/210%) Level 3: 115%\/130%\/145%\/160%\/175% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 161%\/182%\/203%\/224%\/245%) Level 4: 138%\/156%\/174%\/192%\/210% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 184%\/208%\/232%\/256%\/280%)",
        "SHARD NOTES Effectively increases Centaur Warrunner's health by 20, health regeneration by 0.1 and 1 main attack damage per point of strength. Upon updating the strength values, Centaur Warrunner's current health stays the same. These increased stats are removed upon the buff expiring or upon death. He does not keep the current health percentage either. This health increase does not count as a heal, so it is unaffected by amplifications. Therefore, the health increase is not considered by  Ice Blast's percentage health kill threshold and  False Promise's delayed health amplification"
      ],
      "item_behaviour": [],
      "description": "Centaur strikes a mighty blow at melee range, damaging both himself and a small area around the target. Deals extra damage based on your strength. Centaur cannot die from Double Edge.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  150",
        "Damage Radius: 220",
        "Base Damage: 120\/180\/240\/300",
        "Strength as Damage: 60%\/80%\/100%\/120% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 100%\/120%\/140%\/160%)",
        "Max Stacks:  5",
        "Strength Bonus per Stack:  15%",
        "Move Speed Slow:  25%",
        "Slow Duration:  2",
        "Buff Duration:  15"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6d\/Centaur_Warrunner_Double_Edge.mp3\/revision\/latest?cb=20191216011916",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Double Edge",
      "cooldown": null,
      "legacy_key": "D",
      "story": "In the spurs of combat, Bradwarden's vicious strikes sometimes cause self-inflicted collateral damage."
    },
    {
      "notes": [
        "Retaliate only triggers when a unit lands an attack, regardless of distance. This means it cannot trigger on missed attacks",
        "The Retaliate damage is always dealt right before the attacker's damage is dealt to its target",
        "Can proc on the secondary attacks from other instant attacks. Except from the following instant attacks that cannot proc attack modifiers:  Split Shot (without the Split Shot uses modifiers <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent) and  Flak Cannon. Cannot proc on attacks from wards and  Undying Zombies. Cannot proc on spell damage",
        "Fully works against buildings and allied units, resulting in a deny if the damage kills the ally. Deals 7.5\/12.5\/17.5\/22.5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 30\/35\/40\/45) + 10%\/13%\/16%\/19%  strength as damage per triggered instance (before reductions) to buildings",
        "Retaliate is an aura by default, but it affects Centaur Warrunner only, until the <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent is learned. The buff is not visible on self. Retaliate damage is based on the strength of the target that is attacked, not on Centaur Warrunner's. The aura's buff lingers for 0.5 seconds. TALENT NOTES Upon learning the Retaliate aura <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent, the aura starts affecting heroes, clones and creep-heroes. Illusions and other units are not affected. Affects invulnerable allies, but not hidden allies. Retaliate damage is still sourced to Centaur Warrunner, and not to the ally bestowing the aura"
      ],
      "item_behaviour": [],
      "description": "Centaur counters all attacks, dealing damage back to the attacker. Returns a fixed amount plus a percentage based on your strength. Deals half damage to towers.",
      "hot_key": "E",
      "params": [
        "Base Retaliate Damage: 15\/25\/35\/45 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 60\/70\/80\/90)",
        "Strength as Bonus Retaliate Damage: 20%\/26%\/32%\/38%",
        "Building Damage Percentage: 50%",
        "Aura Linger Duration: 0.5",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Aura Radius:  1200"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Centaur_Warrunner_Retaliate_1.mp3\/revision\/latest?cb=20191216011907",
      "effects": [
        "Ability: Passive",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Retaliate",
      "cooldown": null,
      "legacy_key": "R",
      "story": "Bradwarden has no need to parry his opponent's attacks; his armor-like hide does it for him."
    },
    {
      "notes": [
        "Requires  Aghanim's Scepter to be unlocked",
        "The ally hero is moved onto the cart, in an arc with a height of ≈100, and varying lengths. The mount always takes 0.5 seconds. The maximum distance between the mounted ally and Centaur is 240. The ally hero is rooted during the mount duration",
        "While hitching, the ally hero on the cart is ≈80 distance above the ground. If the target is already a flying unit or has flying movement hitching, its total z-axis will be equal to the cart height and the ascending height",
        "While hitching, the ally hero is phased, attack immune, and unselectable. Any attack or ability targeting the mounted hero which is already in its attack or cast animation gets canceled. Due to this, the ally hero (or ↓↓ Double-tapping) cannot target themselves with any of their own items either. Does not prevent Spell Reflection from reflecting abilities back at the mounted hero",
        "Due to the unselectability, almost every ability treats the ally hero as if they were invisible, except the following abilities:  Heat-Seeking Missile,  Cinder Brew,  Eternal Chains,  Concussive Shot,  Wrath of Nature,  Omnislash,  Mana Drain,  Exorcism, and  Thundergod's Wrath. Unlike with invisibility,  Beetles,  Phantoms and  Undying Zombies do not instantly die when the hero is mounted onto the cart",
        "If Centaur Warrunner teleports a distance greater than 600, the cart disappears and the ally hero is unmounted. Hitch A Ride has the highest priority in the group position changing effect abilities, making only the following abilities able to unmount the ally: Teleport sources (e.g.  Blink),  Walrus PUNCH!,  Walrus Kick,  Pulverize and  Will-O-Wisp. If the ally hero gets teleported any distance (even at 0 range), the cart disappears. The cart also disappears when either Centaur or the mounted ally hero dies. However, the cart does not disappear when Centaur is hidden"
      ],
      "item_behaviour": [],
      "description": "Centaur tosses an ally into a cart hitched behind him. While in the cart, the ally can still cast and attack normally, but cannot move independently or be targeted by opponents. Non-targeted effects can still affect the hitched ally. Increases the attack range of melee heroes by 200.",
      "hot_key": "D",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range:  300",
        "Melee Attack Range Bonus: 200",
        "Break Distance: 600",
        "Duration: 8"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allied Heroes"
      ],
      "mana": "45",
      "aghanim": null,
      "name": "Hitch A Ride",
      "cooldown": "75",
      "legacy_key": "V",
      "story": "The needs of Bradwarden's ample pride pale greatly in the face of his demand for victory."
    },
    {
      "notes": [
        "Interrupts Centaur Warrunner's channeling abilities upon cast",
        "Affects every player-controlled allied unit, except for the following units:  Couriers, wards, buildings and  Haunt-based illusions",
        "Affected allies become phased and hasted, meaning they cannot be slowed below the hasted value. Affects invulnerable and hidden units as well",
        "Checks Centaur Warrunner's current  strength whenever trampling an enemy, so it adapts immediately. However, the strength as damage multiplier is set upon cast and does not adapt upon leveling up the ability. The strength as damage multiplier is not capped at 0 strength, meaning if the Centaur has negative strength, it deals 0 damage per second. Fully procs on-damage effects (e.g.  Corrosive Skin) when the caster has 0 strength, except for abilities that have a minimum damage threshold (e.g.  Gravekeeper's Cloak)",
        "Stampede first applies the damage, then the debuff",
        "The damage is sourced to each buffed ally, meaning certain on-damage effects (e.g.  Blade Mail) react to the buffed ally rather than to Centaur Warrunner",
        "The sound effect is Global and can be heard by enemies even through the Fog of War"
      ],
      "item_behaviour": [],
      "description": "Centaur leads all allies into a vicious charge causing them to move through units at max speed and slow any enemy units they trample. Trampled enemies take damage based on Centaur Warrunner's strength. Each enemy can be trampled once.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0+0",
        "Effect Radius: 105",
        "Strength as Damage: 200%\/250%\/300%",
        "Haste Speed: 550",
        "Move Speed Slow: 100%",
        "Debuff Duration: 3",
        "Stampede Duration: 3.5\/4\/4.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Centaur_Warrunner_Stampede_1.mp3\/revision\/latest?cb=20191216011910",
      "effects": [
        "Ability: No Target",
        "Affects: Allies \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "100 (TagTalent 75)",
      "aghanim": null,
      "name": "Stampede",
      "cooldown": "150\/200\/250",
      "legacy_key": "T",
      "story": "The great belt of Omexe, which labels Bradwarden as the greatest warrior of his kind, incites his fellow gladiators to follow him into barbarous combat."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.0,
    "attrStrength": 27.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.0,
    "attrAgility": 15.0
  },
  "description": "Reflects damage back to his attackers. Some write to express their being, others paint or sing. But for the centaurs of Druud, there is no higher art than the art of killing. And in that, none was more accomplished than Bradwarden. With skills acquired in the arena, the Warrunner punishes his opponents and instantly Retaliates their every attack, disregarding harm to himself as he metes out a fearsome Double Edge. Ever in search of a worthy opponent, Bradwarden rouses his allies, and sometimes Hitching them on his back for a ride, to charge down enemies in a wild Stampede, quickening the pace of the carnage. Once battle is joined, the Centaur Warrunner Stomps and tramples surrounding foes, stunning them just long enough for his battleaxe to sink in.  Durable Initiator Disabler Nuker Escape ★☆☆",
  "trivia": [
    "In DotA, Bradwarden's hero title was Centaur Warchief.",
    "Bradwarden is the name of a centaur in the first DemonWars Saga trilogy by R.A. Salvatore.",
    "Hoof Stomp's animation originally consisted of Centaur Warrunner slamming the ground with the shaft of his axe. This was later changed after community requests that the animation reflects the ability name."
  ],
  "history": "It's said that a centaur's road is paved with the corpses of the fallen. For the one called Warrunner, it has been a long road indeed. To outsiders, the four-legged clans of Druud are often mistaken for simple, brutish creatures. Their language has no written form; their culture lacks pictographic traditions, structured music, formalized religion. For centaurs, combat is the perfect articulation of thought, the highest expression of self. If killing is an art among centaurs, then Bradwarden the Warrunner is their greatest artist. He rose to dominance on the proving grounds of Omexe, an ancient arena where centaur clans have for millennia gathered to perform their gladiatorial rites. As his fame spread, spectators came from far and wide to see the great centaur in action. Always the first to step into the arena, and the last to leave, he composes a masterpiece in each guttering spray, each thrust of blood-slickened blade-length. It is the poetry of blood on steel, flung in complex patterns across the pale sands of the killing floor. Warrunner defeated warrior after warrior, until the arena boomed with the cheering of his name, and he found himself alone, the uncontested champion of his kind. The great belt of Omexe was bestowed, wrapped around his broad torso, but in his victory, the death-artist found only emptiness. For what is a warrior without a challenge? The great centaur galloped out of Omexe that day with a new goal. To his people, Warrunner is the greatest warrior to ever step into the arena. Now he has set out to prove he is the greatest fighter who has ever lived.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Gains Retaliate Aura",
        "talent_left": "+1s Hoof Stomp Duration"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+45 Retaliate Damage",
        "talent_left": "-25s Stampede Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+15 Strength",
        "talent_left": "+40% Double Edge Strength Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+5 Health Regen",
        "talent_left": "+20 Movement Speed"
      }
    ],
    "notes": [
      "The strength talent effectively grants Centaur Warrunner 300 health, 1.5 health regeneration, and 15 main attack damage bonus."
    ]
  }
}