{
  "abilities": [
    {
      "notes": [
        "Sticky Napalm можно использовать, не поворачиваясь к выбранной области",
        "Применяется на всех врагов в области применения\n Покидание или возвращение в область применения после использования не даст никакого эффекта",
        "Дает летающий обзор в радиусе 450 в выбранной точке на 2 секунды",
        "Каждое повторное применение обновляет длительность зарядов и добавляет дополнительный",
        "Дебафф замедляет и наносит урон\n Также показывается, сколько зарядов Sticky Napalm уже действует на цель\n Над существами под действием способности отображается число, показывающее количество зарядов\n Число видно только Batrider и его союзникам, но для этого нужен обзор на цель",
        "При максимальном количестве эффектов Sticky Napalm может нанести цели до 60\/120\/180\/240 урона и уменьшить скорость передвижения до 20%\/40%\/60%\/80%\n Скорость поворота не изменяется за стак",
        "Вначале применяется дополнительный урон за эффект, потом урон от попадания и затем уменьшается скорость передвижения",
        "Может нанести до 60\/120\/180\/240 ( 160\/220\/280\/340) единиц урона при максимальном количестве эффектов (до учета сопротивления)\n Крипы и крипы-герои получают только 50% от обычного урона\n Может нанести до 30\/60\/90\/120 ( 80\/110\/140\/170) единиц урона крипам и крипам-героям при максимальном количестве эффектов",
        "Увеличивает весь урон, который наносит герой, за исключением урона от  Orb of Venom,  Orb of Corrosion,  Urn of Shadows, <span image=\"items\/spirit_vessel\/full.webp\">[Spirit Vessel]<\/span> Spirit Vessel,  Radiance,  Cloak of Flames и неотражаемых способностей",
        "Batrider должен сам наносить урон, другие существа под его контролем не активируют срабатывание Sticky Napalm",
        "Sticky Napalm наносит урон как отдельный источник сразу после урона, активировавшего срабатывание способности",
        "ПРИМЕЧАНИЯ К AGHANIM'S SHARD Каждая вторая атака по герою или крипу применит к цели один эффект Sticky Napalm",
        "Не учитываются атаки по союзникам, вардам или зданиям",
        "Пассивные применения Sticky Napalm не зависят от времени восстановления и не требуют маны"
      ],
      "item_behaviour": [],
      "description": "Выплескивает в выбранную область вязкое масло, которое увеличивает урон от всех атак и способностей героя. Масло замедляет передвижение и поворот врагов. Эффект от масла складывается до 10 раз. Дополнительный урон по древним крипам уменьшается вдвое.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 550",
        "Радиус: 375 ( 425)",
        "Максимально эффектов: 10",
        "Доп\n урон за эффект: 6\/12\/18\/24",
        "Урон от попадания: 6\/12\/18\/24 ( 16\/22\/28\/34)",
        "Процент урона по крипам: 50%",
        "Замедление передвижения за эффект: 2%\/4%\/6%\/8%",
        "Замедление скорости поворота: 10%\/30%\/50%\/70%",
        "Длительность эффекта: 6",
        "Необходимо атак:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Batrider_Sticky_Napalm.mp3\/revision\/latest?cb=20191216011155",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "3",
      "aghanim": null,
      "name": "Sticky Napalm",
      "cooldown": "20",
      "legacy_key": "C",
      "story": "Не удивляйтесь, если услышите, как Batrider хихикает, увеличивая горючесть противников."
    },
    {
      "notes": [
        "Flamebreak летит со скоростью 1200 единиц, пока не достигнет точки применения",
        "Летящий наряд дает летающий обзор в 175 единиц\n Обзор не задерживается",
        "Отбрасывает существ со скоростью 714,29\n Расстояние отбрасывания всегда равно 250, неважно, насколько далеко существо от центра\n Также подбрасывает врагов на 100 единиц вверх, образуя небольшую дугу",
        "Враги не обезвреживаются при отбрасывании\n Они могут свободно поворачиваться, атаковать, использовать заклинания и предметы\n Произносимые заклинания не прерываются\n Способность может толкать существ на непроходимую местность\n Любое дерево, стоящее на пути отброшенного юнита, разрушается",
        "Накладывает дебафф на цели при попадании снаряда, наносящий урон спустя 1 секунду после применения с интервалом в 1 секунду, срабатывая 2\/4\/6\/8 раз",
        "Может нанести до 60\/120\/180\/240 единиц урона (до уменьшений)",
        "Не действует на  Рошана",
        "Flamebreak сначала применяет эффект Sticky Napalm, потом урон от взрыва, потом дебаф, а затем отталкивание",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ выбор зарядов Flamebreak  мгновенно дает 1 дополнительный заряд\n Талант Flamebreak применяет Sticky Napalm  мгновенно накладывает 2 эффект  Sticky Napalm в зависимости от его текущего уровня и радиуса действия при попадании снаряда\n Если Sticky Napalm не вкачан, эффект применяться не будет"
      ],
      "item_behaviour": [],
      "description": "Кидает бутылку горючей смеси, которая взрывается в указанном месте и отталкивает всех врагов в области действия, после чего им наносится периодический урон.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 1300",
        "Радиус эффекта: 500",
        "Урон от взрыва: 30\/60\/90\/120",
        "Урон в секунду: 15",
        "Расстояние отбрасывания: 250 ( 300)",
        "Длительность отбрасывания: 0,35",
        "Длительность урона: 2\/4\/6\/8",
        "Число зарядов:  2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Batrider_Flamebreak_1.mp3\/revision\/latest?cb=20191216011159",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "18\/17\/16\/15 (TagTalent 0)",
      "aghanim": null,
      "name": "Flamebreak",
      "cooldown": "18\/17\/16\/15",
      "legacy_key": "R",
      "story": "Бутылка с горячей смесью — любимое оружие наездника."
    },
    {
      "notes": [
        "Применение Firefly прерывает произнесение заклинаний Batrider",
        "Временно дает Batrider летающий обзор, позволяя ему преодолевать непроходимые территории, существ, постройки и деревья\n Увеличивает дальность обзора Batrider в дневное и ночное время до  1650\/1700\/1750\/1800 и  850\/900\/950\/1000 соответственно",
        "Огненный след от способности действует 15 ( 19,5) секунд, то есть при завершении действия весь огонь сразу пропадет",
        "Урон наносится каждому вражескому существу в радиусе 200, если оно пройдет по огненной дорожке",
        "Наносит 10\/17,5\/25\/32,5 урона с интервалом в 0,4 или 0,5 секунды спустя 0,1 секунды после применения; первый интервал составляет 0,4 секунды, следующие - 0,5 секунду, срабатывая 31 ( 40) раз\n Может нанести до 310\/542,5\/775\/1007,5 ( 400\/700\/1000\/1300), если цель остается в огненной дорожке всё время действия способности",
        "Пока действует Firefly, деревья в радиусе 100 единиц вокруг Batrider разрушаются",
        "Несколько применений огненных дорожек складываются\n Каждое применение создает отдельную дорожку",
        "Огненный след остается на все время действия способности даже после смерти героя\n Бафф виден в интерфейсе, но теперь он отвечает только за поджигание огненной дорожкой\n То есть при возрождении до завершения длительности бафф не позволит Batrider летать или вновь оставлять за собой огненный след",
        "Не действует на  Рошана\n ПРИМЕЧАНИЯ К SPELL STEAL \/ ПРИМЕЧАНИЯ К MORPH Эффекты от способности сохраняются после утраты способности"
      ],
      "item_behaviour": [],
      "description": "Герой поднимается в воздух, оставляя за собой огненный след. Огонь наносит урон врагам и уничтожает деревья. Во время полёта герой имеет свободное передвижение и обзор.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Радиус урона: 200",
        "Урон в секунду: 20\/35\/50\/65",
        "Доп\n скорость передвижения: 3%\/6%\/9%\/12%",
        "Доп\n обзор: 50\/100\/150\/200",
        "Длительность: 15 ( 19,5)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a6\/Batrider_Firefly.mp3\/revision\/latest?cb=20191216011158",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "52\/46\/40\/34",
      "aghanim": null,
      "name": "Firefly",
      "cooldown": "125",
      "legacy_key": "E",
      "story": "Большинство противников, попав в джунгли Йама Раскав, начинают прорубаться сквозь заросли в надежде найти беглеца. Batrider же предпочитает просто уничтожить лес, а заодно и врагов в нем."
    },
    {
      "notes": [
        "Flaming Lasso полностью обезвреживает цель на время действия способности",
        "Batrider обезврежен, пока действует Flaming Lasso\n Обезвреживание действует секунды или до разрыва лассо, в зависимости от того, что случится быстрее\n ПРИМЕЧАНИЯ К AGHANIM'S SHARD Batrider не будет обезврежен во время действия Flaming Lasso",
        "Тащит выбранного юнита на расстоянии 300 единиц позади Batrider\n Вопреки описанию, может затащить цель на непроходимую территорию",
        "Если Batrider телепортируется на расстояние, превышающее 425 единиц, лассо порвется",
        "Если цель телепортируют на любое расстояние, равное или превышающее 0, лассо порвется",
        "Flaming Lasso прерывает другие способности и эффекты, использующие эффект принудительного движения, только телепортация может разорвать лассо",
        "Flaming Lasso также перестает действовать в случае, если Batrider или цель умирают\n Также лассо будет разорвано при эффектах страха, гипноза или при оспользовании способностей  Pulverize,  Dismember и  Walrus Kick",
        "Наносит урон с интервалом в 1 секунду сразу после применения, нанося урон до 2\/3\/3 раз\n Может нанести до 70\/165\/225 урона цели (до учета снижений)",
        "Нельзя применить, но может передвигать неуязвимых и скрытых существ",
        "Можно применить на  Рошана, но на него не сработает ни обезвреживание, ни перемещение ( урон от  так же не наносится); при этом Batrider будет обезврежен",
        "Можно связать несколько существ в одно и то же время (используя, к примеру, <span image=\"items\/refresher_orb\/full.webp\">[Refresher Orb]<\/span> Refresher Orb)",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER привязывает ближайшего союзного для цели героя (включая крипов-героев и иллюзии) к изначальной цели на расстоянии  единиц\n Не действует на юнитов-не-героев\n Вторичная цель привязывается к первичной, двигаясь за ней на том же расстоянии, что и первичная цель за Batrider\n То есть, вторичная цель находится в 600 единицах позади Batrider\n Второе лассо не зависит от состояния первого\n При разрыве первого лассо первичная цель может свободно перемещать привязанную к ней вторичную цель"
      ],
      "item_behaviour": [],
      "description": "Захватывает врага в огненное лассо, не давая ему атаковать, двигаться или использовать способности. Жертву можно перетаскивать за собой, однако нельзя затянуть на непроходимую территорию. Телепортация разорвёт лассо.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 175",
        "Дальность разрыва: 425",
        "Урон в секунду: 35\/55\/75",
        "Длительность: 2,5\/3\/3,5",
        "Радиус поиска вторичной цели:  600"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/50\/Batrider_Flaming_Lasso.mp3\/revision\/latest?cb=20191216011151",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "120\/115\/110 (TagTalent 110\/105\/100)",
      "aghanim": null,
      "name": "Flaming Lasso",
      "cooldown": "150\/175\/200",
      "legacy_key": "F",
      "story": "Немногие осмеливаются прокатиться на летучей мыши, потому что Batrider предлагает сделать это бесплатно."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 28.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 1.8,
    "attrAgility": 15.0
  },
  "description": "Может утащить врага от его команды, накинув на него лассо Когда большая часть людей посчитала бы ужасающим испытанием похищение себя огромной летучей мышью, то один особенный паренек нашел бы это захватывающим. В поиске возможности повторить тот волнующий полет он вошел в джунгли Йама Раскав и покинул их, известный уже как Batrider. Оседлав своего свирепого питомца, он орошает цели Sticky Napalm, усиливая их горючесть перед тем, как поджечь землю с помощью Firefly. Наездник швыряет бутыль с горючей смесью, отбрасывая противника Flamebreak. Хочешь прокатиться? Это можно устроить. Batrider видит героев свысока и сбрасывает на них Flaming Lasso, чтобы поймать и преподать такой урок, который они не скоро позабудут.  Инициация Лес Контроль Побег ★★☆",
  "history": "Среди тварей, обитающих в джунглях Йама Раскав, никогда не было согласия. Проявишь слабость — жди скорой смерти от клювов или когтей, жвал или копыт... Говорят, давным-давно, когда наш герой ещё был простым пареньком и выкорчёвывал сорняки с семейного поля, его схватила огромная и до ужаса голодная летучая мышь. Но добыча оказалась не из робких: вырвавшись из лап хищника, парень взобрался на спину зверя и зарубил его своими инструментами. Выбравшись из кровавых ошметков, опьянённый полётом мальчик осознал, что нашёл свое призвание. Он рос и каждое лето выходил на то же поле, частенько лез в кусты в поиске тех самых ощущений, что встретил на пороге смерти от падения или от острых клыков. Годы шли, но пламя в его душе разгоралось только сильнее. Он исследовал заросли, с каждым походом забираясь всё глубже и глубже, пока, наконец, не нашел путь к пещерам — самому сердцу враждебных земель. Легенда гласит, что той знойной ночью всадник взял с собой лишь веревку, бутылку жидкой отваги и пылающую решимость — и, желая снова почувствовать небеса, нырнул во тьму..."
}