{
  "abilities": [
    {
      "notes": [
        "The health talent increases maximum health capacity, and keeps the current health percentage.",
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Global Call Down",
          "talentRight": "3 Homing Missile Charges"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+16 Rocket Barrage Damage",
          "talentRight": "+30 Movement Speed"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-40s Call Down Cooldown",
          "talentRight": "+0.4s Homing Missile Stun Duration"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+200 Health",
          "talentRight": "+16 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/13\/Gyrocopter_Rocket_Barrage.mp3\/revision\/latest?cb=20191216014024",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Rocket Barrage interrupts Gyrocopter's channeling abilities upon cast.",
        "Despite the visual effects, the damage is dealt instantly, rather than on each rocket's impact.",
        "Rocket Barrage cannot hit invisible units or units in the Fog of War.",
        "Gyrocopter can act freely during Rocket Barrage.",
        "Does not fire rockets while Gyrocopter is hidden.",
        "Deals damage in 0.1-second intervals, resulting in 30 damage instances. With Aghanim's Shard, it can hit up to 2 enemies at once on each interval, increasing the total possible damage instances to 80 .",
        "With Aghanim's Shard, it can hit up to 2 enemies at once on each interval, increasing the total possible damage instances to 80 .",
        "Can deal a total of 210\/360\/510\/660 (TagTalent 690\/840\/990\/1140) damage (before reductions), assuming all rockets hit. With Aghanim's Shard, it can deal a total of 280\/480\/680\/880 (TagTalent 920\/1120\/1320\/1520) damage to a single unit, and 560\/960\/1360\/1760 (TagTalent 1840\/2240\/2640\/3040) in total.",
        "With Aghanim's Shard, it can deal a total of 280\/480\/680\/880 (TagTalent 920\/1120\/1320\/1520) damage to a single unit, and 560\/960\/1360\/1760 (TagTalent 1840\/2240\/2640\/3040) in total."
      ],
      "mana": "90",
      "hotKey": "Q",
      "cooldown": "7\/6.5\/6\/5.5",
      "description": "Launches a salvo of rockets at nearby enemy units in a radius around the Gyrocopter. Lasts 3 seconds.",
      "spellName": "Rocket Barrage",
      "params": [
        "Cast Animation: 0+0",
        "Search Radius: 400",
        "Number of Targets: 1 (TagTalent 2)",
        "Rockets per Second: 10",
        "Damage per Rocket: 7\/12\/17\/22 (TagTalent 23\/28\/33\/38)",
        "Barrage Duration: 3 (TagTalent 4)",
        "Rocket Barrage hits an extra target and increases duration by 1 second."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Aurel's new craft has an increased payload for rockets, enhancing their rapid-fire capabilities."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/43\/Gyrocopter_Homing_Missile_1.mp3\/revision\/latest?cb=20200917220359",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "When cast, a stationary missile is placed 150 range in front of Gyrocopter, which begins to move 2.5 seconds later.",
        "Homing Missile's initial speed is 500 and increases by 20 per second, growing by 1 movement speed every 0.05 seconds. The speed acceleration is not capped, and continues to increase until it hits the target or is destroyed.",
        "The speed acceleration is not capped, and continues to increase until it hits the target or is destroyed.",
        "If the missile's target dies, it automatically switches to the nearest valid target within 700 range of the previous target.",
        "Only attacks from heroes, illusions (counting as heroes), towers, and the fountains (counting as towers) can damage the missile.",
        "The rocket first applies the debuff, then the damage.",
        "The cross-hair over the target is visible to allies only.",
        "Although the ability grants no vision or True Sight over the target, the missile follows and hits invisible units.",
        "If the missile hits its target, its 400 range flying vision stays at the location for 3.5 seconds.",
        "The missile can be targeted by Force Staff, Hurricane Pike and Psychic Headband, pushing the rocket forwards (or backwards). The missile cannot impact the target during the Forced Movement, and passes through, reorients, and continues to chase the target.",
        "The missile cannot impact the target during the Forced Movement, and passes through, reorients, and continues to chase the target.",
        "When the missile gets affected by Chronosphere it gets instantly destroyed."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "W",
      "cooldown": "26\/21\/16\/11 (TagTalent 0)",
      "description": "Fires a homing missile to seek the targeted enemy unit. The missile gains speed over time, dealing damage and stunning when it impacts the target. Enemy units can destroy the missile before it reaches its target.",
      "spellName": "Homing Missile",
      "params": [
        "Cast Animation: 0+0",
        "Cast Range: 1050",
        "Hero Attacks to Destroy: 3",
        "Tower Attacks to Destroy: 6",
        "Damage: 100\/175\/250\/325",
        "Stun Duration: 2.25\/2.5\/2.75\/3 (TagTalent 2.65\/2.9\/3.15\/3.4)",
        "Number of Charges: 3",
        "Charge Replenish Time: 26\/21\/16\/11",
        "Blocked upon impact."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "The biggest missile Aurel could possibly attach to his craft, The Bomb™ has carefully calculated aerodynamics and explosives for maximum impact."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Gyrocopter_Flak_Cannon_1.mp3\/revision\/latest?cb=20191216014016",
      "effects": [
        "Ability No Target (TagAghanim Passive)",
        "Affects Enemies",
        "Damage Instant Attack"
      ],
      "notes": [
        "Flak Cannon interrupts Gyrocopter's channeling abilities upon cast.",
        "Causes Gyrocopter to perform instant attacks on all nearby enemies whenever he launches an attack projectile. The instant attacks do not trigger attack modifiers or any on-hit effects. They do not have True Strike. The projectiles from the instant attacks travel at a speed of 800.",
        "The instant attacks do not trigger attack modifiers or any on-hit effects. They do not have True Strike.",
        "The projectiles from the instant attacks travel at a speed of 800.",
        "The flaks have no count limit. All valid nearby targets get targeted. The primary attack target is not affected by Flak Cannon. It is only hit by the primary attack. Does not target Couriers, wards, buildings, invisible units, or units inside the Fog of War. However, attacking couriers, wards, buildings, or allied units still causes flaks to hit all valid targets within the radius.",
        "The primary attack target is not affected by Flak Cannon. It is only hit by the primary attack.",
        "Does not target Couriers, wards, buildings, invisible units, or units inside the Fog of War.",
        "However, attacking couriers, wards, buildings, or allied units still causes flaks to hit all valid targets within the radius.",
        "The visual effect above Gyrocopter and number of attacks left on the buff icon are visible to everyone.",
        "With Aghanim's Scepter, Gyrocopter performs instant attacks on the furthest enemy within 700 range of him. These instant attacks can trigger any attack modifiers and on-hit effects normally, except for Flak Cannon itself. They do not have True Strike, but ignore disarms. Does not target wards, couriers, and attack immune enemies, but does target buildings. Only targets units Gyrocopter has vision over. The Side Gunner does not attack when Gyrocopter is hidden or invisible. However, the gunner ignores fade times and fade delays of abilities. It only does not attack when fully invisible. Flak Cannon does not need to be learned to unlock the Side Gunner. Side Gunner is only available to Gyrocopter. Other heroes such as Morphling and Rubick who get hold on Flak Cannon cannot unlock Side Gunner. In Ability Draft, the Side Gunner is available for anyone who drafts Flak Cannon, but the ability needs to be learned to work.",
        "These instant attacks can trigger any attack modifiers and on-hit effects normally, except for Flak Cannon itself. They do not have True Strike, but ignore disarms.",
        "Does not target wards, couriers, and attack immune enemies, but does target buildings. Only targets units Gyrocopter has vision over.",
        "The Side Gunner does not attack when Gyrocopter is hidden or invisible.",
        "However, the gunner ignores fade times and fade delays of abilities. It only does not attack when fully invisible.",
        "Flak Cannon does not need to be learned to unlock the Side Gunner.",
        "Side Gunner is only available to Gyrocopter. Other heroes such as Morphling and Rubick who get hold on Flak Cannon cannot unlock Side Gunner.",
        "In Ability Draft, the Side Gunner is available for anyone who drafts Flak Cannon, but the ability needs to be learned to work."
      ],
      "mana": "50",
      "hotKey": "E",
      "cooldown": "24\/22\/20\/18",
      "description": "Gyrocopter's attacks hit all enemy units in an area around it for a limited number of attacks. Only the main target of attacks will receive attack bonuses such as Critical Strike. Lasts seconds or until the attacks are used.",
      "spellName": "Flak Cannon",
      "params": [
        "Cast Animation: 0+0",
        "Flak Search Radius: 1250",
        "Number of Attacks: 3\/4\/5\/6",
        "Flak Duration: 10",
        "Side Gunner Range: 700",
        "Side Gunner Attack Interval: 1.2",
        "Adds a Side Gunner that at random attacks enemy units near Gyrocopter. Prioritizes furthest unit away within its range.",
        "Side Gunner is disabled by Break."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "This newly revamped Gyrocopter has attached enough armaments to assault in a 360 degree radius."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/29\/Gyrocopter_Call_Down.mp3\/revision\/latest?cb=20191216014015",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The first missile impacts 2 seconds and the second missile impacts 4 seconds after cast.",
        "Provides 300 radius flying vision at the targeted area for 4 seconds upon cast.",
        "Can deal a total of 350\/525\/700 damage (before reductions), assuming both missiles hit.",
        "The rockets first applies their debuffs, then their damage.",
        "The big red area indicator is visible to allies only. The sound effects are audible and the missiles visible to everyone."
      ],
      "mana": "125",
      "hotKey": "R",
      "cooldown": "90 (TagTalent 50)",
      "description": "Call down an aerial missile strike on enemy units in a target area. After 2 seconds, two missiles arrive in succession, with 2 seconds between them.",
      "spellName": "Call Down",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 1000 (TagTalent Global)",
        "Effect Radius: 600",
        "Delay per Rocket: 2",
        "Missile One Damage: 150\/250\/350",
        "Missile One Move Speed Slow: 30%",
        "Missile One Slow Duration: 2",
        "Missile Two Damage: 200\/275\/350",
        "Missile Two Move Speed Slow: 60%",
        "Missile Two Slow Duration: 4",
        "Slow persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "'Bombs away!'"
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.1,
    "attrAgilityInc": 3.6,
    "attrAgility": 26.0
  },
  "description": "Aurel, the Gyrocopter, is a ranged agility hero, capable of outputting a lot of single target and area of effect damage at a multitude of ranges. Early game Gyrocopter is a strong ganker, with Rocket Barrage able to output a lot of damage in a short amount of time if he and his target are alone. His second ability, Homing Missile, is a long range projectile that forces opponents to either stop and engage to take out the missile, or run to a safe location before being stunned. Thanks to his third ability, Flak Cannon, he is also an excellent pusher, and with it can farm up big items in the midgame as his spells start to fall off in damage. Flak Cannon also allows him to hit everyone in a teamfight with his attacks, and with enough damage items he can inflict a lot of damage to the entire enemy team. Call Down is a useful ultimate with a low cooldown, providing a large area slow and nuke making it great for team fights. With the right items, he can also transition into a carry role.",
  "history": "After serving through a lifetime of wars, upheaval, riots, and revolutions, the brass figured Aurel had seen enough. But in addition to a few trinkets and his considerable pension, the erstwhile engineer left with something far more interesting: a long-forgotten, incomplete schematic for a Gyrocopter, the world's first manned, non-magical flying device. Retiring to the tropical obscurity of the Ash Archipelago with little else but time and money, he set to work building the device. As the years wore on and the remains of failed prototypes began to pile up, he began to wonder if mechanical flight was even possible. A decade and a day after his retirement, on a sunny afternoon with a southerly breeze, Aurel sat in his latest attempt bristling with indignation and expectant failure. With a grunt of effort he pulled the ignition cord and covered his head, waiting for the inevitable explosion. However to his great surprise he began to lift and, following a few panicked adjustments, stabilize. Within an hour, he was ducking and weaving with the breeze, level with the gulls, and Aurel found himself filled with the breathless wonder of flight. As dusk settled in he set a course back to his workshop, but no sooner had he turned his craft when a cannonball tore through his tailfin. Disentangling himself from the wreckage, he swam toward the nearest piece of land in sight, and cursed to see the ship responsible for the cannonball collecting the debris. Days later, when Aurel returned to his workshop, he set to work on yet another gyrocopter, this one capable of carrying a much heavier, more dangerous payload.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Global Call Down",
      "talentRight": "3 Homing Missile Charges"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+16 Rocket Barrage Damage",
      "talentRight": "+30 Movement Speed"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-40s Call Down Cooldown",
      "talentRight": "+0.4s Homing Missile Stun Duration"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+200 Health",
      "talentRight": "+16 Damage"
    }
  ]
}