{
  "abilities": [
    {
      "notes": [
        "Топоры или летят со скоростью 1200 или долетают до цели за одну секунду, смотря что быстрее. Работает также при возвращении. При возвращении скорость топоров периодически обновляется, основываясь на расстоянии до Beastmaster и оставшемся времени полета. Таким образом в полете топоры находятся до двух секунд, до одной секунды в каждом направлении",
        "Топоры разлетаются в стороны друг от друга на расстояние 450 перед тем как начнут сближаться, летя в сторону цели. Минимальная дистанция полета топоров — 450, поэтому при выборе точки, находящейся на расстоянии меньшем, чем 450 единиц, топоры все равно пересекутся на расстоянии в 450 Оба топора летят по дуге, таким образом топор, выпущенный из правой руки героя, возвращается в левую руку и наоборот. Топоры разрушают деревья в радиусе 175 вокруг каждого. Каждый топор имеет летающий обзор в радиусе 350. Этот обзор не задерживается",
        "Топоры сначала применяют дебафф, затем наносят урон. То есть они также увеличивают свой урон. Использует один дебафф на пораженных целях для всех зарядов. Иконка дебаффа отражает количество зарядов. Поскольку топоры действуют отдельно друг от друга, то один из топоров всегда наносит больше урона, если в юнита попали оба топора. Повторное поражение одного и того же юнита обновит длительность всех зарядов",
        "Накладывает общее увеличение входящего урона на цель. Сочетается аддитивно с другими источниками увеличения общего входящего урона. Увеличивает весь урон, который не отмечен как отнимающий здоровье, от Beastmaster и его подконтрольных существ, но не от его союзников",
        "Существо может быть задето каждым топором лишь единожды, таким образом максимальный возможный урон одного топора (до учета сопротивлений и усилений) — 42,4\/75,6\/110\/145,6 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 43,4\/77,35\/112,5\/148,85)",
        "Не действует на  курьеров",
        "Изучение соответствующего таланта мгновенно обновляет значение урона всех топоров героя, находящихся в полете"
      ],
      "item_behaviour": [],
      "description": "Герой швыряет топоры, которые прорубают деревья и противников на своём пути и возвращаются обратно. Каждый топор задевает одного врага лишь единожды и увеличивает урон, получаемый от героя и его существ.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: 1500",
        "Радиус: 175",
        "Дистанция полета топоров: 1500",
        "Расстояние разлета топоров: 450",
        "Урон каждого топора: 40\/70\/100\/130",
        "Доп. урон за эффект: 6%\/8%\/10%\/12% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 8,5%\/10,5%\/12,5%\/14,5%)",
        "Длительность эффекта: 12"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/84\/Beastmaster_Wild_Axes_1.mp3\/revision\/latest?cb=20191216011217",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "8 (TagTalent 3)",
      "aghanim": null,
      "name": "Wild Axes",
      "cooldown": "65",
      "legacy_key": "W",
      "story": "Учась в одиночку выживать в дикой природе, Каррох приноровился использовать два томагавка, одинаково хорошо справляясь и с деревьями, и с врагами."
    },
    {
      "notes": [
        "Не убивает предыдущего призванного  кабана, если способность используют до его исчезновения",
        "Кабан призывается в случайной точке около Beastmaster на расстоянии 100 единиц"
      ],
      "item_behaviour": [],
      "description": "Герой призывает на поле битвы кабана-помощника..",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Число кабанов: 1",
        "Длительность жизни: 60"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/40\/Beastmaster_Call_of_the_Wild_Boar.mp3\/revision\/latest?cb=20191216011213",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "mana": "42\/38\/34\/30",
      "aghanim": null,
      "name": "Call of the Wild (кабан)",
      "cooldown": "60\/65\/70\/75",
      "legacy_key": "D",
      "story": "Подружившись в детстве с удивительным зверем, Каррох научился взывать к помощи животных."
    },
    {
      "notes": [
        "Не убивает предыдущего призванного  ястреба, если способность используют до его исчезновения",
        "Ястреб призывается в случайной точке около Beastmaster на расстоянии 300 единиц. Он сразу невидим без какой-либо задержки",
        "Ястреба нельзя контролировать. После призыва он автоматически летит к выбранной области и там зависает",
        "Если перемещение ястреба прервали (например, оглушением, оцепенением и т.д.), то после завершения эффекта он продолжит свой полет",
        "Провокация и гипноз заставляют ястреба остановиться, но после завершения эффекта он продолжит свой полет. Также юнит игнорирует эффект страха",
        "Ястреб не блокирует нейтральные лагеря",
        "При улучшении с  Aghanim's Shard способности можно направить на вражеское существо. Если была применена на существо, то ястреб летит к месту, где оно находилось на момент призыва, будто способность направлена на точку. Ястреб не меняется траекторию полёта. Если в любой момент во время полёта ястреб обнаружит существо, на которое он был применён, то он начнёт применять Dive Bomb к нему. Если ястреб уже начал применять Dive Bomb, но цель вышла из зоны его действия и на ней остался обзор, то он полетит в её сторону, чтобы попробовать применить способность еще раз. Таким образом можно изменить его траекторию полёта. Если ястреб уже начал применять Dive Bomb, но был потерян обзор на цель (невидимость или уход в туман войны, то ястреб полетит в точку, куда был призван. Ястреб может пытаться применить Dive Bomb неограниченное число раз. Как только ястреб долетит до точки, куда он изначально был призван, он больше не будет пытаться применить Dive Bomb к изначальной цели, но его можно будет применить вручную",
        "Если автоприменение Вкл, то все ястребы будут мгновенно и автоматически применять  Dive Bomb на первую увиденную цель в радиусе действия, учитывая все примечания выше и вне зависимости от того, находится ли ястреб в полёте или уже долетел до точки назначения",
        "Приобретение  Aghanim's Shard не дарует способность  Dive Bomb уже призванным ястребам"
      ],
      "item_behaviour": [],
      "description": "Герой отправляет невидимого ястреба разведать территорию.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,67",
        "Дальность применения: Глоабальная",
        "Число ястребов: 2",
        "Длительность жизни: 60"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/27\/Beastmaster_Call_of_the_Wild_Hawk.mp3\/revision\/latest?cb=20191216011215",
      "effects": [
        "Способность: Направленная на область"
      ],
      "mana": "60\/50\/40\/30 (TagTalent 50\/40\/30\/20)",
      "aghanim": null,
      "name": "Call of the Wild (ястреб)",
      "cooldown": "30",
      "legacy_key": "E",
      "story": "Подружившись в детстве с удивительным зверем, Каррох научился взывать к помощи животных."
    },
    {
      "notes": [
        "Действует на всех призываемых существ, иллюзии и неуязвимых юнитов",
        "Эффект ауры задерживается на 0,5 секунды"
      ],
      "item_behaviour": [],
      "description": "Высвобождает животную ярость союзников, увеличивая скорость их атак.",
      "hot_key": "E",
      "params": [
        "Радиус: 1200",
        "Доп. скорость атаки: 10\/20\/30\/40 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 20\/30\/40\/50)",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Союзников"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Inner Beast",
      "cooldown": null,
      "legacy_key": "B",
      "story": "Способность пробуждать внутреннюю мощь других существ проявилась у Карроха ещё в тот день, когда король Слома сгинул в лапах своего зверинца."
    },
    {
      "notes": [
        "Требуется  Aghanim's Scepter для разблокировки",
        "Интервалы ударов изначально более долгие, они сокращаются к концу времени применения",
        "Не наносит урон древним крипам",
        "Считает крипов-героев за крипов",
        "За всю длительность Drums of Slom может нанести до 1540 урона одному существу (до учёта сопротивлений)",
        "Лечение зависит от фактического нанесённого урона после учёта всех усилений и ослаблений. Лечение подконтрольных существ происходит только в том случае, если они находятся в радиусе действия способности. Может излечить на 385 единиц здоровья за каждого героя в радиусе (и 77 за каждого крипа в радиусе)"
      ],
      "item_behaviour": [],
      "description": "Герой всё быстрее бьёт в свой барабан. Каждый удар наносит урон врагам вокруг и излечивает владельца способности и существ под его контролем на долю от наносимого урона. Герой не может бить в барабаны, если он обезмолвлен или оглушён.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+?",
        "Радиус: 600",
        "Макс. число срабатываний: 14",
        "Урон за удар: 110",
        "Лечение от урона героям: 25%",
        "Лечение от урона крипам: 5%",
        "Макс. длительность: 6"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "mana": "40",
      "aghanim": null,
      "name": "Drums of Slom",
      "cooldown": "100",
      "legacy_key": "V",
      "story": "Ярость природы безвременна, и посвящённым в её секреты несложно пробудить эхо гнева, возликовавшего при крахе Слома."
    },
    {
      "notes": [
        "Откидываются только вражеские юниты. На  Рошана отталкивание не работает. Юниты под воздействием откидывания полностью обезврежены. Primal Roar можно использовать на курьера для оглушения, но он не получит урона. Курьеры также подвергаются откидыванию",
        "Раскидывает существ по сторонам со скоростью 450, на расстояние до 450, получая в итоге откидывание на 1 сек. Откинутые существа смотрят в направлении, откуда их толкнули. Откидываемые существа ломают деревья вокруг себя по пути следования",
        "Откидывание и замедление имеют динамический радиус действия, основанный на расстоянии между Beastmaster и основной целью. За каждые 2 единицы расстояния между Beastmaster и целью, радиус действия откидывания увеличивается на 1. Когда цель находится на расстоянии 600, откидываются юниты, находящиеся на расстоянии до 300 за целью и Beastmaster. Ширина откидывания всегда равна 300, так что площадь, на которой действует эффект, всегда в форме стадиона",
        "Учитывая динамическую дальность, замедление\/откидывание могут попасть по существам на расстоянии до 900",
        "Если враг стоит ровно между Beastmaster и целью Primal Roar, его не откидывает в сторону. Тем не менее, замедление и урон по-прежнему накладываются, и цель оказывается обезврежена на время откидывания",
        "На основную цель сначала накладывается дебафф, затем наносится урон. Вторичные цели сначала получают урон, затем — дебафф",
        "Дополнительная скорость передвижения действует только на Beastmaster и его подконтрольных юнитов"
      ],
      "item_behaviour": [],
      "description": "Герой издаёт громогласный рык, который оглушает цель и раскидывает всех противников на пути к ней. Все задетые враги получают урон, а у отлетевших в стороны врагов снижается скорость атаки и передвижения. Также на 3\/3,5\/4 секунды скорость передвижения героя и его существ увеличивается на 40%.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,5+0,63",
        "Дальность применения: 600",
        "Радиус доп. скорости: 900",
        "Ширина рыка: 300",
        "Дальность откидывания: 450",
        "Длительность откидывания: 1",
        "Урон: 150\/225\/300",
        "Замедление скорости передвижения: 60%",
        "Замедление скорости атаки: 60",
        "Длительность замедления: 3\/3,5\/4",
        "Доп. скорость передвижения союзникам: 40%",
        "Длительность ускорения союзников: 3\/3,5\/4",
        "Длительность оглушения: 3\/3,5\/4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cd\/Beastmaster_Primal_Roar.mp3\/revision\/latest?cb=20191216011216",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "100\/80\/60 (TagTalent 70\/50\/30)",
      "aghanim": null,
      "name": "Primal Roar",
      "cooldown": "150\/175\/200",
      "legacy_key": "R",
      "story": "Beastmaster научился сливать все свои первобытные инстинкты в оглушающий вопль, сеющий смятение в рядах противника."
    },
    {
      "notes": [
        "Действует на всех существ под контролем Beastmaster, включая самого героя",
        "Аура действует на неуязвимых и спрятанных существ",
        "Аура увеличивает максимальный запас здоровья и сохраняет текущий процент здоровья",
        "Увеличивает скорость передвижения Beastmaster до 330",
        "Аура работает, пока Beastmaster мертв"
      ],
      "item_behaviour": [],
      "description": "Для этой способности нет описания.",
      "hot_key": "?",
      "params": [
        "Радиус: Глобальный",
        "Бонус к скорости передвижения: 25",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Move Speed Aura",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Действует на всех существ под контролем Beastmaster, включая самого героя",
        "Аура действует на неуязвимых и спрятанных существ",
        "Аура увеличивает максимальный запас здоровья и сохраняет текущий процент здоровья",
        "Аура работает, пока Beastmaster мертв"
      ],
      "item_behaviour": [],
      "description": "Для этой способности нет описания.",
      "hot_key": "?",
      "params": [
        "Радиус: Глобальный",
        "Бонус к здоровью: 250",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Health Aura",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Увеличение уровня не повлияет на уже призванных кабанов",
        "Атаки сначала наносят урон, затем применяют негативный эффект",
        "Удачные атаки не накапливают замедление, длительность обновляется"
      ],
      "item_behaviour": [],
      "description": "Впрыскивает яд, замедляющий атаку и скорость врага.",
      "hot_key": "?",
      "params": [
        "Замедление передвижения: 10%\/18%\/26%\/34%",
        "Замедление атаки: 10\/20\/30\/40",
        "Длительность замедления: 3"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Poison",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Требует  Aghanim's Shard для разблокировки. Получение Aghanim's Shard не даёт эту способность уже призванным ястребам",
        "Как только начинается применение на ястреба устанавливается модификатор раскрытия, который длится до конца пикирования",
        "Модификатор раскрытия невидимости накладывается на ястреба в момент начала применения заклинания и заканчивается при окончании пикирования или при остановке применения",
        "Ястреб всегда летит по дуге 0,4 секунды, поэтому его скорость варьируется. Скорость не адаптируется мгновенно при изменении расстояния, скорее, она медленно увеличивается или уменьшается",
        "Использует принудительное движение для перемещения ястреба. Это значит, что полёт можно прервать другим принудительным передвижением. При прерывании ястреб не умрёт. Пикирование нельзя остановить каким-либо другим образом, он игнорирует другие обезвреживания",
        "Ястреб сначала наносит урон, потом накладывает оцепенение, затем умирает. Смерть ястреба нельзя предотвратить",
        "Может быть применена на  курьеров"
      ],
      "item_behaviour": [],
      "description": "Ястреб раскрывает свою невидимость на 1 сек., затем пикирует в выбранного врага, наносит ему урон, накладывает на него оцепенение и погибает.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 1+0",
        "Дальность применения: 900",
        "Урон: 250",
        "Длительность оцепенения: 2,5",
        "Длительность пикирования: 0,4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Beastmaster_Hawk_Dive_Bomb_1.mp3\/revision\/latest?cb=20210626132907",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Dive Bomb",
      "cooldown": "0",
      "legacy_key": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 23.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 1.6,
    "attrAgility": 18.0
  },
  "description": "Призывает зверей к себе на помощь Выросший в королевстве Слома Каррох с юных лет научился разговаривать с животными. Используя свой уникальный талант, он призывает на помощь изрыгающих яд кабанов и зорких ястребов. В дополнение к своим компаньонам, Каррох обучился метанию топоров, срубающих деревья и врагов прежде, чем они вернутся ему в руки. Beastmaster пробуждает внутреннюю мощь своих союзников, увеличивая их скорость атаки. Стоит только противнику предпринять попытку к бегству, так оглушительный рёв Карроха немедленно ошеломляет его и расчищает путь к скорой погибели врага.  Инициация Контроль Стойкость Быстрый урон ★★☆",
  "history": "Детство Карроха прошло несладко. Мать его умерла при родах. Отца, кузнеца при последнем короле Слома, растоптали насмерть, когда ребенку было пять лет. Тогда Карроха поселили в королевский зверинец, где он рос среди животных: львов, обезьян, оленей-падунов и других, менее известных существ, в которых не всякий верил. На седьмой год жизни парня королевский лазутчик привел во дворец новую тварь. Её подтащили к королю, закованную в цепи, и та заговорила, хоть и не двигала ртом. Просила она одно: свободы. Король лишь рассмеялся и приказал зверю выступать ему на потеху, а когда тот отказался, огрел его своим Диким скипетром и приказал отправить тварь в темницу. Следующие месяцы мальчик тайком проносил к существу еду и лекарства, но они лишь слегка отодвигали полное истощение. Без слов зверь говорил с мальчиком, и со временем их связь усилилась настолько, что Каррох понял — он может поддерживать разговор. Более того, он научился общаться со всеми обитателями королевского зверинца. В ночь, когда зверь умер, мальчик впал в ярость. Он повел чудищ войной на прислужников короля, отперев клетки и выпустив зверей на дворцовые земли. В погроме насмерть растерзали и самого короля. Пока царила неразбериха, Каррох освободил одного из королевских оленей, и тот поклонился в ответ, а затем, с Каррохом на спине, перемахнул через высокие стены дворца, унося того из проклятого места. Теперь повелитель зверей Каррох по прозвищу Beastmaster уже взрослый мужчина, но он не потерял способности говорить с дикими зверьми. Сирота из королевского зверинца превратился в неукротимого воина природы."
}