{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6f\/Vengeful_Spirit_Magic_Missile_1.mp3\/revision\/latest?cb=20191216030141",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The projectile travels at a speed of 1350.",
        "Magic Missile first applies the debuff, then the damage.",
        "SHARD NOTES Magic Missile's projectile now bounces on another unit, prioritizing heroes, within a 650 (TagTalent 775) radius. The bounce distance can be further increased by other cast range bonuses. Can bounce to invisible, untargetable, and units in the Fog of War. Can never hit the same unit twice per cast. If the current target turns invulnerable or hidden, it does not bounce upon reaching them. All bounces together can deal up to 180\/360\/540\/720 (TagTalent 580\/760\/940\/1120) damage (before reductions).",
        "The bounce distance can be further increased by other cast range bonuses.",
        "Can bounce to invisible, untargetable, and units in the Fog of War.",
        "Can never hit the same unit twice per cast.",
        "If the current target turns invulnerable or hidden, it does not bounce upon reaching them.",
        "All bounces together can deal up to 180\/360\/540\/720 (TagTalent 580\/760\/940\/1120) damage (before reductions).",
        "TALENT NOTES Fully affects Couriers upon learning the Magic Missile pierces spell immunity talent."
      ],
      "mana": "12\/11\/10\/9 (TagTalent 10\/9\/8\/7)",
      "item_behaviour": [],
      "name": "Magic Missile",
      "cooldown": "100\/110\/120\/130",
      "description": "Fires a magic missile at an enemy unit, stunning and dealing damage.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  650 ( 775)",
        "Number of Targets: 1 ( 2)",
        "Damage: 90\/180\/270\/360 ( 290\/380\/470\/560)",
        "Stun Duration: 1.4\/1.5\/1.6\/1.7",
        "Bounce Distance: 650 ( 775)"
      ],
      "legacy_key": "C",
      "story": "A simple Skywrath technique, the magic missile is Shendel's primary tool for vengeance."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6c\/Vengeful_Spirit_Wave_of_Terror.mp3\/revision\/latest?cb=20191216030144",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "The wave travels at a speed of 2000, taking 0.7 seconds to travel the full distance.",
        "With the travel distance and effect radius, Wave of Terror can hit units up to 1725 range away.",
        "The wave provides 350radius flying vision as it travels, which lasts for 4 seconds. This vision starts 100 range away from Vengeful Spirit. With the travel distance and vision radius, the vision reaches up to 1850 range away.",
        "This vision starts 100 range away from Vengeful Spirit. With the travel distance and vision radius, the vision reaches up to 1850 range away.",
        "Although affected targets only recieve one debuff, successive cast do not stack, but update its ability values and refresh its duration.",
        "The wave first applies the debuff, then the damage.",
        "Does not affect Couriers."
      ],
      "mana": "16\/14\/12\/10",
      "item_behaviour": [],
      "name": "Wave of Terror",
      "cooldown": "25\/30\/35\/40",
      "description": "Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the path ahead.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  1400",
        "Wave Travel Distance:  1400",
        "Effect Radius: 325",
        "Damage: 85\/100\/115\/130",
        "Armor Reduction: 3\/4\/5\/6 ( 5\/6\/7\/8)",
        "Duration: 8"
      ],
      "legacy_key": "E",
      "story": "Shendel's haunting voice hints at her approaching vindication."
    },
    {
      "audioUrl": "",
      "effects": [
        "Ability: Aura",
        "Affects: Allies "
      ],
      "notes": [
        "The aura's buff lingers for 0.5 seconds.",
        "Grants flat bonus attack damage based on the affected unit's main attack damage. Does not further increase bonus attack damage.",
        "The aura affects invulnerable, but not hidden allies.",
        "SCEPTER NOTES Vengeance Aura now creates 1 strong illusion 108 range away either north, east, south or west at Vengeful Spirit's death location, including with Reincarnation. It spawns with full mana, health, and all abilities off-cooldown, regardless of their cooldown status on Vengeful Spirit. It can cast abilities, but not item abilities. The Vengeance Illusion's duration is set equal to Vengeful Spirit's respawn time upon creation. The BUYBACK next respawn time increase does not further increase the illusion's duration. The illusion disappears once Vengeful Spirit respawns, or when it reaches the normal death duration.",
        "It spawns with full mana, health, and all abilities off-cooldown, regardless of their cooldown status on Vengeful Spirit.",
        "It can cast abilities, but not item abilities.",
        "The Vengeance Illusion's duration is set equal to Vengeful Spirit's respawn time upon creation. The BUYBACK next respawn time increase does not further increase the illusion's duration. The illusion disappears once Vengeful Spirit respawns, or when it reaches the normal death duration.",
        "The BUYBACK next respawn time increase does not further increase the illusion's duration.",
        "The illusion disappears once Vengeful Spirit respawns, or when it reaches the normal death duration.",
        "The created illusion is visually distinguishable from the real Vengeful Spirit for the enemies. This illusion uses the hero health bar instead of the regular unit health bar like other illusions. The Vengeance Illusion neither have gold, nor experience bounty. This illusion cannot be Enchanted. It gets slowed instead.",
        "This illusion uses the hero health bar instead of the regular unit health bar like other illusions.",
        "The Vengeance Illusion neither have gold, nor experience bounty.",
        "This illusion cannot be Enchanted. It gets slowed instead.",
        "SCEPTER NOTES Vengeful Spirit now can gain experience even while dead. While dead, she is periodically moved along with the Vengeance Illusion, allowing her to gain experience around the illusion. However, these effects require the illusion to be alive. If the Vengeance Illusion dies, she neither is moved along nor can gain experience. This also allows her to respawn at the illusion's location, instead of at the fountain. Upon respawn, Vengeful Spirit's facing angle same as the last Vengeance Illusion facing angle, and she is fully affected by the Fountain Invulnerability Buff.",
        "While dead, she is periodically moved along with the Vengeance Illusion, allowing her to gain experience around the illusion.",
        "However, these effects require the illusion to be alive. If the Vengeance Illusion dies, she neither is moved along nor can gain experience.",
        "This also allows her to respawn at the illusion's location, instead of at the fountain.",
        "Upon respawn, Vengeful Spirit's facing angle same as the last Vengeance Illusion facing angle, and she is fully affected by the Fountain Invulnerability Buff."
      ],
      "mana": null,
      "item_behaviour": [],
      "name": "Vengeance Aura",
      "cooldown": null,
      "description": "Vengeful Spirit's presence increases the damage of nearby friendly heroes.",
      "hot_key": "E",
      "params": [
        "Radius: 1200",
        "Attack Damage Bonus: 11%\/18%\/25%\/32% ( 27%\/34%\/41%\/48%)",
        "Aura Linger Duration: 0.5",
        "Number of Illusions on Death: 1",
        "Illusion Damage Dealt: 100%",
        "Illusion Damage Taken: 100%",
        "Illusion Move Speed Bonus: 12%"
      ],
      "legacy_key": "D",
      "story": "Although they may not share her undying passion for revenge, allies do draw on her fanaticism in combat."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/ab\/Vengeful_Spirit_Nether_Swap.mp3\/revision\/latest?cb=20191216030143",
      "effects": [
        "Ability: Target Unit",
        "Affects: Heroes",
        "Damage: Magical"
      ],
      "notes": [
        "The target is given a stop command as soon as it is swapped back, effectively canceling channeling abilities.",
        "Does not disjoint projectiles upon swapping, neither for the caster nor for the target.",
        "Destroys trees within 300 radius around Vengeful Spirit and the target.",
        "Can be cast on allies without damaging them.",
        "Can be cast on illusions, Spirit Bear and on invulnerable units. Cannote be cast on hidden units. Cannot be cast on allies who have ☐ Disabled Help from Vengeful Spirit.",
        "Cannote be cast on hidden units.",
        "Cannot be cast on allies who have ☐ Disabled Help from Vengeful Spirit.",
        "Vengeful Spirit always gains the buff, no matter if she targets an ally or an enemy. Applies generic incoming damage reduction on allies. Stacks additively with other sources of generic incoming damage manipulation. The reduction affects all damage the allies take that is not flagged as HP removal.",
        "Applies generic incoming damage reduction on allies. Stacks additively with other sources of generic incoming damage manipulation.",
        "The reduction affects all damage the allies take that is not flagged as HP removal.",
        "SOULBIND Swaps position with the secondary target upon casting on the primary target. Vengeful Spirit first swaps position with the primary target, then the primary target swaps with the secondary target, then the secondary target swaps with Vengeful Spirit."
      ],
      "mana": "50\/40\/30 (TagTalent 35\/25\/15)",
      "item_behaviour": [],
      "name": "Nether Swap",
      "cooldown": "100\/150\/200",
      "description": "Instantaneously swaps positions with a target Hero, friend or enemy. Nether Swap interrupts channeling abilities on the target. Enemy Swapped units take damage. Allied swapped units receive less damage for a short duration.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.4+0",
        "Cast Range:  800\/950\/1100",
        "Damage: 50 ( 200)",
        "Ally\/Self Incoming Damage Reduction: 30%\/40%\/50%",
        "Damage Reduction Duration: 3"
      ],
      "legacy_key": "W",
      "story": "Martyrdom is a small price to pay for vengeance."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 19.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 3.2,
    "attrAgility": 20.0
  },
  "description": "Can swap herself with any nearby hero. Robbed of her wings and rightful place in the Ghastly Eyrie, Shendelzare appealed to the goddess Scree'auk to grant her the dark energies that would complete her vengeance. With a Wave of Terror, the fallen princess heralds her arrival, unnerving foes close enough to hear her anguished cry. Like her airborne brethren, the Vengeful Spirit makes liberal use of Magic Missle, a simple Skywrath spell for stunning adversaries. Seeking martyrdom, Shendelzare instantly Displaces herself with a target of her choosing, gladly sacrificing herself as she swaps positions with a besieged ally, or a fleeing enemy. The worthy who fight alongside Shendelzare are emboldened by her Vengeance, a fanaticism that intensifies their blows and persists even beyond her death, as the Vengeful Spirit's presence is felt at all times.  Support Initiator Disabler Nuker Escape ★☆☆",
  "trivia": [
    "Magic Missile is one of the first and most iconic offensive spells available for arcane spellcaster classes in the famed pen-and-paper RPG series, Dungeons & Dragons.",
    "Previous designs of Vengeful Spirit showed her with a mask that looked similar to her Vengeance Aura ability icon.",
    "Vengeful Spirit's fun name, \"820\", is a tribute to former professional DotA player 820.",
    "In DotA 1, she was the sister of Mortred, the Phantom Assassin, and her name was Shendelzare Silkwood. In Dota 2, her lore was changed so that she became affiliated with the Skywrath, thus switching her affiliations to Dragonus, the Skywrath Mage.",
    "In the transition to Dota 2, her aura's name was changed from Command Aura to Vengeance Aura."
  ],
  "history": "Even the most contented Skywrath is an ill-tempered creature, naturally inclined to seek revenge for the slightest insult. But Vengeful Spirit is the essence of vengeance. Once a proud and savage Skywrath scion, Shendelzare was first in succession for the Ghastly Eyrie until a sister's treachery robbed her of her birthright. Snared in an assassin's net, Shendelzare tore free only at the cost of her wings, limping away in the ultimate humiliation: On foot. With her wings broken, she knew the Skywrath would never accept her as ruler; and in the highest roost of the Eyrie, inaccessible except by winged flight, her sister was untouchable. Unwilling to live as a flightless cripple, and desiring revenge far more than earthly power, the fallen princess drove a bargain with the goddess Scree'auk: She surrendered her broken body for an imperishable form of spirit energy, driven by vengeance, capable of doing great damage in the material plane. She may spend eternity flightless, but she will have her revenge.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+16% Vengeance Aura Base Damage Bonus",
        "talent_left": "Magic Missile Pierces Spell Immunity"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+200 Magic Missile Damage",
        "talent_left": "-15s Nether Swap Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-2 Wave of Terror Armor",
        "talent_left": "-2s Magic Missile Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+150 Nether Swap Damage",
        "talent_left": "+125 Magic Missile Cast Range"
      }
    ]
  }
}