{
  "abilities": [
    {
      "notes": [
        "Талант на урон зомби добавляется непосредственно к базовому, а не к дополнительному урону от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-2 сек. перезарядки Decay",
          "talentRight": "Воскрешение с перезарядкой в 300 секунд"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+4 к атакам для уничтожения надгробия",
          "talentRight": "Призыв надгробия после смерти"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+40 сек. действия Decay",
          "talentRight": "+25 к урону зомби от Tombstone"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+5 здоровья в секунду",
          "talentRight": "+125 к дальности заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Undying_Decay_1.mp3\/revision\/latest?cb=20200523111740",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Несколько применений Decay складываются как у целей, так и у самого Undying.",
        "Не может снизить силу героя ниже 0, но Undying всегда получает всю силу за каждого задетого героя.",
        "Крадет силу до нанесения урона. Потеря силы целью не сохраняет процентное соотношение текущего здоровья к максимальному, но мгновенно отнимает 20 единиц здоровья за силу от текущего запаса здоровья. Сила, полученная Undying, также не сохраняет процентное соотношение текущего здоровья к максимальному, но мгновенно добавляет 20 единиц здоровья за силу к текущему запасу здоровья. Всего увеличивает\/уменьшает текущее здоровье Undying\/врагов на 80 (TagTalent 200). Получаемое здоровье не считается за лечение, поэтому на него не действует усиления и его не учитывают эффекты от Ice Blast и False Promise.",
        "Потеря силы целью не сохраняет процентное соотношение текущего здоровья к максимальному, но мгновенно отнимает 20 единиц здоровья за силу от текущего запаса здоровья.",
        "Сила, полученная Undying, также не сохраняет процентное соотношение текущего здоровья к максимальному, но мгновенно добавляет 20 единиц здоровья за силу к текущему запасу здоровья.",
        "Всего увеличивает\/уменьшает текущее здоровье Undying\/врагов на 80 (TagTalent 200).",
        "Получаемое здоровье не считается за лечение, поэтому на него не действует усиления и его не учитывают эффекты от Ice Blast и False Promise.",
        "Герои, чей базовый атрибут не относится к силе, теряют 80 (TagTalent 200) единиц здоровья, 0.4 (TagTalent 1) регенерации здоровья и 0.32% (TagTalent 0.8%) сопротивления магии. И наоборот, увеличивает урон, здоровье, его регенерацию и сопротивление магии Undying на те же значения за применение.",
        "И наоборот, увеличивает урон, здоровье, его регенерацию и сопротивление магии Undying на те же значения за применение.",
        "Не крадет силу у иллюзий, но крадет у клонов героя.",
        "Если в области применения несколько клонов Meepo, то только один из них (каждый раз выбирается случайно) теряет силу. То же самое распространяется на Arc Warden и его Tempest Double. Урон все равно наносится всем Meepo и Arc Warden.",
        "То же самое распространяется на Arc Warden и его Tempest Double.",
        "Урон все равно наносится всем Meepo и Arc Warden.",
        "Каждый бафф Decay увеличивает модель героя на 2%. Эффект не влияет на размер столкновения.",
        "Вопреки визуальным эффектам украденная сила передается мгновенно.",
        "При получении\/выкладывании Aghanim's Scepter все заряды украденной силы мгновенно адаптируются. При обновлении силы текущее здоровье Undying остается прежним. При этом задетые враги сохраняют свое соотношение текущег здоровья к максимальному. Их здоровье обновляется только при повторном получении\/потере максимального запаса здоровья, а не мгновенно.",
        "При обновлении силы текущее здоровье Undying остается прежним.",
        "При этом задетые враги сохраняют свое соотношение текущег здоровья к максимальному. Их здоровье обновляется только при повторном получении\/потере максимального запаса здоровья, а не мгновенно.",
        "Если Undying умирает, он теряет всю украденную силу, но эта сила не возвращается к врагам - и наоборот."
      ],
      "mana": "70\/85\/100\/115",
      "hotKey": "Q",
      "cooldown": "10\/8\/6\/4 (TagTalent 8\/6\/4\/2)",
      "description": "Наносит урон вражеским героям в указанной области и передаёт часть их силы владельцу способности.",
      "spellName": "Decay",
      "params": [
        "Анимация применения: 0,45+0",
        "Дальность применения: 650 (TagTalent 775)",
        "Радиус: 325",
        "Урон: 20\/50\/80\/110",
        "Крадет силы: 4 (TagAghanim 10)",
        "Длительность: 45 (TagTalent 85)",
        "Увеличивает число отнимаемой силы.",
        "Потеря силы остается, если дебафф был применен до иммунитета к заклинаниям.",
        "На иллюзиях Undying или затронутых врагов не видно отображения эффектов похищенной силы. Иллюзии сохраняют изначальное значение силы героев."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Живые просто заимствуют силу у мертвецов."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/89\/Undying_Soul_Rip.mp3\/revision\/latest?cb=20191216025942",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников",
        "Урон Магический"
      ],
      "notes": [
        "Можно применить на надгробие от Tombstone, но не на других существ-вардов.",
        "При использовании на союзное надгробие всегда восстанавливает фиксированное значение здоровья независимо от числа ближайших существ.",
        "Может выбрать вражеское надгробие, но не наносит ему урона и не лечит.",
        "Нельзя использовать на Undying Zombie.",
        "Радиус поиска цели в 1300 единиц закреплен за Undying, а не за целью.",
        "Существа в области выбираются случайно и у них отнимается по 22\/29\/36\/43 здоровья (это отнимающий здоровье урон). Потеря здоровья никогда не будет смертельной.",
        "Не учитывает Undying, цель, варды, строения, невидимых врагов и существ в тумане войны.",
        "Союзники с иммунитетом к заклинаниям учитываются, включая зомби от Tombstone.",
        "Существа, для убийства которых нужно определенное число атак, не теряют здоровье при учете Soul Rip.",
        "Если в пределах радиуса поиска не будет подходящих существ, то урон или лечение будет равно нулю.",
        "Значения урона или лечения сначала складываются, а затем наносятся одним источником.",
        "Soul Rip наносит или излечивает до 176\/261\/360\/473 здоровья (до уменьшений)."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "W",
      "cooldown": "24\/18\/12\/6",
      "description": "Герой вырывает жизненные силы из всех существ рядом с целью, излечивая союзника или нанося урон противнику. Также этой способностью можно лечить надгробие от способности Tombstone.",
      "spellName": "Soul Rip",
      "params": [
        "Анимация применения: 0,35+0",
        "Дальность применения: 750 (TagTalent 875)",
        "Радиус: 1300",
        "Урон\/лечение за существо: 22\/29\/36\/43",
        "Максимально существ: 8\/9\/10\/11",
        "Лечение надгробия от Tombstone: 4\/8\/12\/16",
        "Можно применить на союзников с иммунитетом к заклинаниям и они учитываются при подсчете урона\/лечения. Нельзя применить к врагам с иммунитетом; они не учитываются при подсчете урона\/лечения.",
        "Существа учитываются при расчёте урона и все равно теряют здоровье."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Если рядом глашатай смерти, даже союзники чувствуют отчаяние."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/be\/Undying_Tombstone_1.mp3\/revision\/latest?cb=20191216025944",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов"
      ],
      "notes": [
        "При применении разрушает деревья в радиусе 300 вокруг надгробия.",
        "Зомби не появляются около невидимых существ или существ в тумане войны.",
        "Зомби не появляются около вардов, строений, курьеров, спрятанных существ и зомби от вражеского надробия.",
        "Зомби неподконтрольны и лишь атакуют заданную цель. При этом их можно ускорить с помощью союзных заклинаний или аур. Исключением является Howl - способность не действует на зомби.",
        "Исключением является Howl - способность не действует на зомби.",
        "Первая волна зомби появляется сразу после поднятия надгробия, создавая до 8\/9\/10\/12 волн.",
        "Если цель стала невидимой, то вызванный ею зомби умирает спустя 0,1 секунды.",
        "Если цель умерла, то вызванный ею зомби мгновенно умирает, если только целью не был Meepo. В случае смерти клонов Meepo зомби будут просто стоять до исчезновения надгробия.",
        "В случае смерти клонов Meepo зомби будут просто стоять до исчезновения надгробия.",
        "Если цель скрылась в тумане войны, то вызванный ею зомби будет следовать за ней.",
        "Если время существования надгробия истекло или его разрушили, то все зомби мгновенно умрут.",
        "Иллюзии и крипы-герои при атаке надгробия считаются за крипов, поэтому им нужно нанести 16\/20\/24\/28 (TagTalent 32\/36\/40\/44) атак, вместо 4\/5\/6\/7 (TagTalent 8\/9\/10\/11) как героям.",
        "Иллюзии и крипы-герои при атаке зомби считаются за крипов, поэтому им нужно нанести 2 атак вместо 1.",
        "При выборе таланта при смерти Undying призывается Tombstone текущего уровня. Появление этого надгробия не связано с текущей перезарядкой и не требует маны. Надгробие появляется даже если у героя есть воскрешение. Надгробие существует всю свою длительность, не связано с таймером воскрешения Undying и не исчезает при его возрождении.",
        "Появление этого надгробия не связано с текущей перезарядкой и не требует маны.",
        "Надгробие появляется даже если у героя есть воскрешение.",
        "Надгробие существует всю свою длительность, не связано с таймером воскрешения Undying и не исчезает при его возрождении."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "E",
      "cooldown": "85\/80\/75\/70",
      "description": "Поднимает в указанной точке надгробный камень, который периодически призывает зомби рядом с каждым врагом в области действия. Зомби замедляют цель своих атак, а если её здоровье падает ниже определённого уровня, то скорость атаки и передвижения зомби увеличивается.",
      "spellName": "Tombstone",
      "params": [
        "Анимация применения: 0,45+0",
        "Дальность применения: 600 (TagTalent 725)",
        "Радиус появления зомби: 1200",
        "Интервал появления зомби: 4\/3.5\/3\/2.5",
        "Атак героя для разрушения Tombstone: 4\/5\/6\/7 (TagTalent 8\/9\/10\/11)",
        "Атак не-героя для разрушения Tombstone: 16\/20\/24\/28 (TagTalent 32\/36\/40\/44)",
        "Атак героя\/вышки для убийства зомби: 1",
        "Других атак для убийства зомби: 2",
        "Длительность: 30",
        "Уже призванные зомби не умирают, если их цель получила иммунитет к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Панихида взывает к падшим братьям и направляет их в бой во имя Мёртвого бога."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Undying_Flesh_Golem_1.mp3\/revision\/latest?cb=20191216025939",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "При использовании Flesh Golem прерывает произносимые заклинания Undying.",
        "Увеличивает общую силу, включая дополнительную.",
        "Периодически проверяет силу Undying и мгновенно адаптирует бонус.",
        "Увеличивает базовую скорость передвижения Undying до 330.",
        "Несколько атак по одной и той же цели не складываются, но обновляют длительность.",
        "Увеличивает все 3 типа урона, включая наносимый себе или союзниками урон.",
        "Flesh Golem отменяется при смерти."
      ],
      "mana": "100\/125\/150",
      "hotKey": "R",
      "cooldown": "125",
      "description": "Герой превращается в ужасающего голема из плоти. Голем имеет увеличенную силу, а его атаки замедляют жертв и увеличивают получаемый ими урон.",
      "spellName": "Flesh Golem",
      "params": [
        "Анимация применения: 0+0",
        "Доп. сила: 40%\/50%\/60%",
        "Доп. скорость передвижения: 30",
        "Замедление скорости передвижения: 40%\/45%\/50%",
        "Увеличение урона от дебаффа: 25%\/30%\/35%",
        "Длительность дебаффа: 6",
        "Длительность: 40",
        "Иллюзии появляются с полной длительностью этой способности, независимо от того, сколько осталось до конца у Undying."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Плоть свежих мертвецов усиливает чуму глашатая смерти."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/63\/Undying_Reincarnation.mp3\/revision\/latest?cb=20200523111743",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Способность дается при выборе правого таланта 25 уровня. Она отображается в виде постоянного баффа в интерфейсе.",
        "Активацию Воскрешения нельзя предотвратить. Если Undying умирает, то способность используется.",
        "Если у Undying есть Aegis of the Immortal, то талант сработает первым если готов к активации.",
        "Возрождает героя с полным запасом здоровья и маны. Заклинания и предметы не обновляются.",
        "В момент задержки дает наземный обзор на месте смерти радиусом 1800\/800 единиц.",
        "На перезарядку нельзя ничем повлиять."
      ],
      "mana": "0",
      "hotKey": null,
      "cooldown": "300",
      "description": "Задержка: 5",
      "spellName": "Воскрешение",
      "params": [
        "Задержка: 5"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов"
      ],
      "notes": [
        "Замедление от нескольких атак и зомби полностью складываются.",
        "Каждый заряд длится 2,5 секунды. Они не обновляют длительность друг друга.",
        "Текущее количество зарядов можно увидеть в иконке дебаффа (число видно в иконке)",
        "Здоровье цели проверяется с интервалом в 0,5 секунды. Если здоровье их цели ниже нужного порога, помещается эффект Deathlust Frenzy.",
        "Эффект длится 2,5 секунды, но постоянно обновляется до тех пор, пока здоровье цели находится ниже нужного порога.",
        "Не действует на Гаргулий."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Процентная граница здоровья для усиления зомби: 40%",
      "spellName": "Deathlust",
      "params": [
        "Процентная граница здоровья для усиления зомби: 40%",
        "Доп. скорость передвижения за границу: 35%\/40%\/45%\/50%",
        "Доп. скорость атаки за границу: 50\/60\/70\/80",
        "Замедление передвижения: 7%",
        "Длительность замедления: 2,5"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "У Tombstone также есть эта способность.",
        "Иконка баффа использует иную иконку иммунитета к заклинаниям."
      ],
      "mana": null,
      "hotKey": null,
      "cooldown": null,
      "description": "Доп. сопротивление магии: 100%",
      "spellName": "Иммунитет к заклинаниям",
      "params": [
        "Доп. сопротивление магии: 100%"
      ],
      "itemBehaviour": [],
      "legacyKey": null,
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 27.0,
    "attrIntelligenceInc": 2.8,
    "attrAgilityInc": 0.8,
    "attrAgility": 10.0
  },
  "description": "Undying, всемогущий Дёрдж — это герой с ближним типом атаки, основным атрибутом которого является сила. Герой специализируется как танк и хорошо умеет проявлять себя в битвах. Decay — способность для частого применения. Она наносит урон вражеским героям в указанной области и забирает себе часть их силы. Улучшение с Aghanim's Scepter увеличивает забираемую у противников силу. Soul Rip лечит союзника или наносит урон врагу. Лечение и урон зависит от количества героев, стоящих рядом с Дёрджем. Эта способность хорошо показывает себя в связке с третьей способностью, Tombstone, которая призывает надгробный камень в указанной точке. Периодически он призывает зомби рядом с каждым врагом в определенной области вокруг себя. А это означает, что от большого количества возрастёт значение урона (или лечения) от Soul Rip. Также, зомби обладают способностью Deathlust, которая замедляет их цели при атаках, а также, если здоровье цели падает ниже определенного уровня, способность увеличивает скорость атаки и передвижения зомби. Помимо всего прочего, надгробие хорошо раскрывает свою роль при осаде башен. Ультимативной способностью Flesh Golem Дёрдж превращается в ужасающего голема из плоти, излучающего чумную ауру. Эта аура замедляет всех врагов в радиусе и увеличивает урон, который они получают: чем ближе враг к Undying, тем сильнее урон и замедление. Когда зараженное чумой существо умирает, Undying исцеляется на процент от максимального здоровья жертвы. Из всего вышеперечисленного можно сделать вывод, что Дёрдж может легко сохранять свою жизнь и жизнь союзников, попутно унося вражеские. Обладая мощными способностями, которые позволяют выступать герою в больших схватках, Undying может жить всю игру напролёт.",
  "history": "Как давно он потерял имя? Запустелые руины его разума больше не знают. Он смутно припоминает доспехи, знамена и угрюмых собратьев, скачущих бок о бок. Он помнит битву: боль и страх, когда бледные руки сорвали его с седла. Он помнит ужас: его вместе с соратниками бросили в бездонный зёв Мёртвого бога, где их ждало лишь небытие в объятиях погребальной песни. В глубокой тьме их покинуло время. Их покинули мысли. Их покинул разум. Но не голод. Брат поднял на брата ломаные зубы и ногти. И началось: сначала далёкая, едва слышимая нота, за ней другая, затем еще одна, и были они неизбежны и нескончаемы. Хор постепенно вырос в сплошную стену звука, вытеснившую все мысли. Песнь панихиды поглотила воина, и он простёр свои руки к Мёртвому богу, приняв свою участь. Но ей была отнюдь не смерть. Мёртвый бог требовал войны. В чреве великой бездны воин получил новое предназначение: нести по земле погребальную песнь, поднимая мертвецов против ещё живых существ. Ему суждено было стать глашатаем Мертвого бога. Его новая цель — восстать, пасть и восстать вновь, лишь бы песнь смерти не прекращалась ни на миг.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-2 сек. перезарядки Decay",
      "talentRight": "Воскрешение с перезарядкой в 300 секунд"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+4 к атакам для уничтожения надгробия",
      "talentRight": "Призыв надгробия после смерти"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+40 сек. действия Decay",
      "talentRight": "+25 к урону зомби от Tombstone"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+5 здоровья в секунду",
      "talentRight": "+125 к дальности заклинаний"
    }
  ]
}