{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Количество дополнительных целей: 2"
      ],
      "notes": [
        "Принуждает владельца совершать мгновенные атаки по 2 ближайшим противникам при запуске снаряда. Это значит, что все снаряды выпускаются в одно время с основной атакой. Не имеет значения, промахнётся ли основная цель. Дополнительные снаряды летят с той же скоростью, что и основной снаряд. Это значит, что их скорость может быть увеличена при помощи бонусов к скорости снарядов. Эти мгновенные атаки не могут спровоцировать срабатывание модификаторов атаки или эффектов, срабатывающих при ударе. Они не обладают True Strike. Они взаимодействуют с типом брони и блокируются блокировкой урона, как обычные атаки",
        "Это значит, что все снаряды выпускаются в одно время с основной атакой. Не имеет значения, промахнётся ли основная цель.",
        "Дополнительные снаряды летят с той же скоростью, что и основной снаряд.",
        "Это значит, что их скорость может быть увеличена при помощи бонусов к скорости снарядов.",
        "Эти мгновенные атаки не могут спровоцировать срабатывание модификаторов атаки или эффектов, срабатывающих при ударе. Они не обладают True Strike.",
        "Они взаимодействуют с типом брони и блокируются блокировкой урона, как обычные атаки",
        "Радиус поиска целей Crackshot равен дальности атаки владельца предмета и может быть увеличен при помощи бонусов к дальности атаки. Не выбирает в качестве цели варды, постройки, невидимых или невосприимчивых к атакам существ или врагов, находящихся в тумане войны, но может выбрать курьеров. Однако если основная атака будет направлена на варды или постройки, то вторичные атаки сработают на доступные цели в радиусе поиска. Вторичные атаки не выпускаются при атаке союзников.",
        "Не выбирает в качестве цели варды, постройки, невидимых или невосприимчивых к атакам существ или врагов, находящихся в тумане войны, но может выбрать курьеров.",
        "Однако если основная атака будет направлена на варды или постройки, то вторичные атаки сработают на доступные цели в радиусе поиска.",
        "Вторичные атаки не выпускаются при атаке союзников.",
        "Не сочетается со Split Shot."
      ],
      "mana": "0",
      "abilityName": "Crackshot",
      "cooldown": "12",
      "description": "Только дальний бой. Следующая атака будет совершена по ещё 2 целям в радиусе атаки. На дополнительные цели не могут сработать эффекты атаки.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Specialist's Array",
  "description": "Впечатляющий набор всевозможных улучшений для оружия, созданных праздным умом стареющего убийцы.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}