{
  "abilities": [
    {
      "notes": [
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Death Prophet's magic resistance to 34%.",
        "Increases Death Prophet's magic resistance to 34%.",
        "This attack damage talent is added as raw attack damage. Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "Does not benefit illusions and is not affected by most percentage-based damage increasing or reducing effects.",
        "The health talent increases maximum health capacity, and keeps the current health percentage."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+8 Exorcism Spirits",
          "talentRight": "-20s Spirit Siphon Replenish Time"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+400 Health",
          "talentRight": "-20% Spirit Siphon Move Speed Slow"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-2s Crypt Swarm Cooldown",
          "talentRight": "+1% Max Health Spirit Siphon"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+12% Magic Resistance",
          "talentRight": "+30 Damage"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/18\/Death_Prophet_Crypt_Swarm_1.mp3\/revision\/latest?cb=20191216012416",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "When targeting a unit, the Crypt Swarm is released towards its current location upon cast.",
        "Crypt Swarm travels at a speed of 1100, taking 0.74 seconds to travel the full distance.",
        "With the travel distance and end radius, Crypt Swarm can hit units up to 1110 range away. The complete area is shaped like a cone.",
        "The complete area is shaped like a cone."
      ],
      "mana": "80\/95\/110\/125",
      "hotKey": "Q",
      "cooldown": "8\/7\/6\/5 (TagTalent 6\/5\/4\/3)",
      "description": "Sends a swarm of winged beasts to savage enemy units in front of Death Prophet.",
      "spellName": "Crypt Swarm",
      "params": [
        "Cast Animation: 0.2+0.5",
        "Cast Range: 600",
        "Starting Radius: 110",
        "Travel Distance: 810",
        "End Radius: 300",
        "Damage: 75\/150\/225\/300"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Krobelus' many trips to the grave gather a flock of the damned."
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Target Area",
        "Affects Enemies"
      ],
      "notes": [
        "The projectile travels at a speed of 1000.",
        "Applies a debuff on enemies within the area upon projectile impact, entering or leaving the area afterwards has no effect."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "W",
      "cooldown": "15\/14\/13\/12",
      "description": "Fires a projectile that prevents enemy units in a target area from casting spells.",
      "spellName": "Silence",
      "params": [
        "Cast Animation: 0.2+0.9",
        "Cast Range: 900",
        "Radius: 425",
        "Duration: 3\/4\/5\/6",
        "Silence persists if debuff was placed before spell immunity and when not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Peering into the veil of her opponent's demise, Krobelus sees a silent future."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Death_Prophet_Spirit_Siphon.mp3\/revision\/latest?cb=20191216012412",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Magical"
      ],
      "notes": [
        "Upon learning, Death Prophet instantly gains charges. However, leveling it up further does not instantly grant the other charges.",
        "The link breaks only when the target gets out of range or dies.",
        "The health restored on Death Prophet is independent from the actual amount of damage dealt. This means even if the target takes no damage at all, Death Prophet still gets healed.",
        "This means even if the target takes no damage at all, Death Prophet still gets healed.",
        "Drains 3.5 + 0.25%\/0.625%\/1%\/1.375% (TagTalent 0.5%\/0.875%\/1.25%\/1.625%) of the enemy's max health in 0.25-second intervals, starting 0.25 seconds after cast, resulting in 24 instances. Can drain up to 84 + 6%\/15%\/24%\/33% (TagTalent 12%\/21%\/30%\/39%) of the enemy's max health when the link lasts its full duration (before reductions). The max health drain talent does not increase the draining of any currently active Spirit Siphon links.",
        "Can drain up to 84 + 6%\/15%\/24%\/33% (TagTalent 12%\/21%\/30%\/39%) of the enemy's max health when the link lasts its full duration (before reductions).",
        "The max health drain talent does not increase the draining of any currently active Spirit Siphon links.",
        "Cannot be cast on units which already are affected by Spirit Siphon. Cannot be cast on Roshan.",
        "Cannot be cast on Roshan.",
        "Does not provide vision over the target. However, the link does not break upon losing vision. When losing vision over the target, the link visually draws to the location where the target was seen last time.",
        "When losing vision over the target, the link visually draws to the location where the target was seen last time.",
        "The movement slow adding talent immediately updates all currently active Spirit Siphon links.",
        "With Aghanim's Shard, Spirit Siphon applies fear on the target on the 4th second of the link's duration. The fear relies on the link buff on Death Prophet, not on the debuff on the target, so even if the debuff gets dispelled, the fear is still applied. Cannot apply the fear if the target is invulnerable, hidden, or spell immune on the 4th second. Spirit Siphon's fear makes affected enemies run away from the caster, rather than make them run towards their team's fountain.",
        "The fear relies on the link buff on Death Prophet, not on the debuff on the target, so even if the debuff gets dispelled, the fear is still applied.",
        "Cannot apply the fear if the target is invulnerable, hidden, or spell immune on the 4th second.",
        "Spirit Siphon's fear makes affected enemies run away from the caster, rather than make them run towards their team's fountain."
      ],
      "mana": "80",
      "hotKey": "E",
      "cooldown": "0",
      "description": "Creates a spirit link between Death Prophet and an enemy unit, draining 14 + 1%\/2.5%\/4%\/5.5% Max HP per second from the enemy.",
      "spellName": "Spirit Siphon",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range: 500",
        "Link Break Distance: 750",
        "Base Health Drain per Second: 14",
        "Max Health Drain per Second: 1%\/2.5%\/4%\/5.5% (TagTalent 2%\/3.5%\/5%\/6.5%)",
        "Drain Duration: 6",
        "Number of Charges: 1\/2\/3\/4 (TagTalent 2\/3\/4\/5)",
        "Charge Replenish Time: 36\/34\/32\/30 (TagTalent 16\/14\/12\/10)",
        "Move Speed Slow: 20%",
        "Drain Time Required to Fear: 4",
        "Fear Duration: 2",
        "Increases Spirit Siphon charges by 1 and causes enemies to be feared for 4 seconds if they are siphoned for seconds consecutively."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Krobelus willingly shows others the path she alone cannot follow."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Death_Prophet_Exorcism_1.mp3\/revision\/latest?cb=20191216012408",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self",
        "Damage Physical"
      ],
      "notes": [
        "The spirits are spawned from Death Prophet in 0.35-second intervals, starting immediately on cast, taking 2.45\/5.25\/8.05 (TagTalent 5.25\/8.05\/10.85) seconds for all spirits to be released.",
        "The spirits are not units and cannot be interacted with, or affected by anything in any way.",
        "Spirits move at a speed of 525, roam around and automatically attack nearby enemies within the 700 radius around Death Prophet. They can only turn by moving in approximately 150 radius arcs.",
        "They can only turn by moving in approximately 150 radius arcs.",
        "Spirits choose their target randomly, but prioritize units Death Prophet is attacking currently. Once having chosen a target, a spirit sticks to that target until the target dies, gets out of range, or until Death Prophet starts attacking a new target. A spirit's ongoing chase cannot be canceled. A spirit only stops chasing its target after reaching it, or when the distance gets greater than 1900. Although chasing for much further, the spirits cannot damage units which are 1200 range away from Death Prophet. After each attack, the spirits need to return to Death Prophet before being able to attack again.",
        "Once having chosen a target, a spirit sticks to that target until the target dies, gets out of range, or until Death Prophet starts attacking a new target.",
        "A spirit's ongoing chase cannot be canceled. A spirit only stops chasing its target after reaching it, or when the distance gets greater than 1900.",
        "Although chasing for much further, the spirits cannot damage units which are 1200 range away from Death Prophet.",
        "After each attack, the spirits need to return to Death Prophet before being able to attack again.",
        "The spirits can attack every attackable enemy unit, including buildings, wards, and units inside the Fog of War, but not invisible units. Spirits do not choose invulnerable or ethereal units as their attack targets, but will continue to attack the target if it turns invulnerable or ethereal after being acquired as a target.",
        "Spirits do not choose invulnerable or ethereal units as their attack targets, but will continue to attack the target if it turns invulnerable or ethereal after being acquired as a target.",
        "The spirits do not actually attack their targets, but rather Exorcism simply deals damage to the targets upon reaching them. This means the damage is affected by spell lifesteal and spell damage amplification, does not trigger any on-attack effects, and ignores evasion and damage block.",
        "This means the damage is affected by spell lifesteal and spell damage amplification, does not trigger any on-attack effects, and ignores evasion and damage block.",
        "When a spirit gets 2000 range away from Death Prophet, it disappears and then respawns from Death Prophet. Reappearing spirits are still bound to the spawn interval, so when multiple spirits disappear, they do not reappear simultaneously on Death Prophet.",
        "Reappearing spirits are still bound to the spawn interval, so when multiple spirits disappear, they do not reappear simultaneously on Death Prophet.",
        "The spirits heal Death Prophet upon returning once Exorcism's duration is up. They do not heal her upon returning after each attack. The heal amount per spirit is based on their damage value, and not on how much damage they actually dealt. This means upon having fully returned, a spirit heals Death Prophet by 14.75-16 for each attack it did, regardless of how much damage the enemies actually took.",
        "The heal amount per spirit is based on their damage value, and not on how much damage they actually dealt.",
        "This means upon having fully returned, a spirit heals Death Prophet by 14.75-16 for each attack it did, regardless of how much damage the enemies actually took.",
        "Recasting Exorcism causes the previous cast to end prematurely, making the spirits start returning to Death Prophet and heal her.",
        "The Aghanim's Scepter upgrade works specifically only with Death Prophet's basic abilities, Crypt Swarm, Silence, and Spirit Siphon. A spirit is spawned for every enemy hit by Crypt Swarm and Silence, for every Spirit Siphon target, and for enemies (including buildings, excluding wards) hit by Death Prophet's regular attacks. If Spirit Siphon is blocked with Spell Block, or if her attack is evaded or disjointed, no spirit spawns. For Rubick, this means it only works for his attacks, or with a properly timed Crypt Swarm, stealing Exorcism while the projectile still travels. For Ability Draft, this means spirits do not spawn for any other drafted abilities. The spirits spawned behave like the spirits from a regular cast, meaning they still use the max distances, and have the same move behaviors. These spirits deal 88.5-96 damage, and therefore also heal for 22.13-24 health upon returning. These spirits can chase their targets for up to 20 seconds before giving up and returning to Death Prophet.",
        "A spirit is spawned for every enemy hit by Crypt Swarm and Silence, for every Spirit Siphon target, and for enemies (including buildings, excluding wards) hit by Death Prophet's regular attacks.",
        "If Spirit Siphon is blocked with Spell Block, or if her attack is evaded or disjointed, no spirit spawns.",
        "For Rubick, this means it only works for his attacks, or with a properly timed Crypt Swarm, stealing Exorcism while the projectile still travels.",
        "For Ability Draft, this means spirits do not spawn for any other drafted abilities.",
        "The spirits spawned behave like the spirits from a regular cast, meaning they still use the max distances, and have the same move behaviors.",
        "These spirits deal 88.5-96 damage, and therefore also heal for 22.13-24 health upon returning.",
        "These spirits can chase their targets for up to 20 seconds before giving up and returning to Death Prophet."
      ],
      "mana": "250\/350\/450",
      "hotKey": "R",
      "cooldown": "150",
      "description": "Unleashes evil spirits to drain the life of nearby enemy units and structures. At the end of the spell's duration, Death Prophet is healed in proportion to the damage dealt. Lasts 35 seconds.",
      "spellName": "Exorcism",
      "params": [
        "Cast Animation: 0.5+0.77",
        "Spirits Acquisition Radius: 700",
        "Max Attack Radius: 1200",
        "Spirits Spawn Interval: 0.35",
        "Number of Spirits: 8\/16\/24 (TagTalent 16\/24\/32)",
        "Spirits Min Damage: 59",
        "Spirits Max Damage: 64",
        "Life Drain: 25%",
        "Self Move Speed Bonus: 16%\/18%\/20%",
        "Exorcism Duration: 35",
        "Passive Spirit Damage Multiplier: 1 (TagAghanim 1.5)",
        "Passive Spirit Move Speed Slow: 100%",
        "Passive Spirit Slow Duration: 0.3",
        "Passive Spirit Max Duration: 20",
        "Whenever an enemy is affected by your spells or when you attack an enemy, a ghost will fly out, slow and hit the enemy for bonus its usual damage then return to you with life.",
        "The slow pierces spell immunity as well."
      ],
      "itemBehaviour": [],
      "legacyKey": "X",
      "story": "Over time, the banshee remnants of her previous lives return to haunt the present."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.1,
    "attrStrength": 21.0,
    "attrIntelligence": 24.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.4,
    "attrAgility": 14.0
  },
  "description": "Krobelus, the Death Prophet, is a ranged intelligence hero who excels at pushing lanes. She is often played in the mid lane, since her Crypt Swarm gives her strong magic damage that can be spammed to her heart's content. As she levels her ultimate, Exorcism, Death Prophet can deal a huge amount of damage to towers and heroes alike, while healing at the end of the duration. If Exorcism's own heal isn't enough, she still has Spirit Siphon which drains health based on the target's health and can even be used on multiple targets at the same time. Finally, her Silence gives her a powerful tool to disable enemy casters and heroes that rely on escape abilities. Because she can deal large amounts of damage over time with her ultimate and Crypt Swarm, Death Prophet is mostly built as a tank, to ensure she can continue to stay in the fight.",
  "history": "Krobelus was a Death Prophet—which is one way of saying she told fortunes for the wealthiest of those who wished to look beyond the veil. But after years of inquiring on behalf of others, she began to seek clues on her own fate. When death refused to yield its secrets, she tried to buy them with her life. But the ultimate price proved insufficient. Death disgorged her again and again, always holding back its deepest mysteries. Her jealousy grew. Others could die for eternity—why not she? Why must she alone be cast back on the shores of life with such tiresome regularity? Why was she not worthy of the one thing all other living creatures took for granted? Still, she would not be discouraged. Each time she returned from the grave, she brought a bit of death back with her. Wraiths followed her like fragments of her shattered soul; her blood grew thin and ectoplasmic; the feasting creatures of twilight took her for their kin.. She gave a little of her life with every demise, and it began to seem as if her end was in sight. With her dedication to death redoubled, and no client other than herself, Krobelus threw herself ever more fervently into death's abyss, intent on fulfilling the one prophecy that eluded her: That someday the Death Prophet would return from death no more.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+8 Exorcism Spirits",
      "talentRight": "-20s Spirit Siphon Replenish Time"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+400 Health",
      "talentRight": "-20% Spirit Siphon Move Speed Slow"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-2s Crypt Swarm Cooldown",
      "talentRight": "+1% Max Health Spirit Siphon"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+12% Magic Resistance",
      "talentRight": "+30 Damage"
    }
  ]
}