{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ed\/Drum_of_Endurance.mp3\/revision\/latest?cb=20141214195702",
      "effects": [
        "Радиус: 1200",
        "Доп. скорость передвижения: 13%",
        "Доп. скорость атаки: 45",
        "Длительность: 6",
        "Количество зарядов: 8"
      ],
      "notes": [
        "Не прерывает произносимые способности заклинателя при применении.",
        "Drum of Endurance не восполняет заряды, то есть количество использований этой способности ограничено. Количество зарядов привязано к предмету, а не к игроку, то есть каждый купленный барабан имеет свои собственные заряды. Не переносит текущее количество зарядов при улучшении в Boots of Bearing, ботинки всегда начинают с максимальным количеством зарядов.",
        "Количество зарядов привязано к предмету, а не к игроку, то есть каждый купленный барабан имеет свои собственные заряды.",
        "Не переносит текущее количество зарядов при улучшении в Boots of Bearing, ботинки всегда начинают с максимальным количеством зарядов.",
        "Применение Endurance без зарядов отправит предмет на перезарядку без любых других эффектов.",
        "Несколько применений Endurance не складывают бафф, но обновляют длительность.",
        "Оба баффа от Drum of Endurance и Boots of Bearing не складываются, существо под действием одного не может попасть под действие другого. Это значит, что если существо уже имеет бафф от Drum of Endurance, то применение Boots of Bearing не заменит бафф и не обновит его, и наоборот.",
        "Это значит, что если существо уже имеет бафф от Drum of Endurance, то применение Boots of Bearing не заменит бафф и не обновит его, и наоборот.",
        "Действует только на подконтрольных игроку существ, включая неуязвимых существ, исключая варды.",
        "Не делит перезарядку с Boots of Bearing."
      ],
      "mana": "0",
      "abilityName": "Endurance",
      "cooldown": "30",
      "description": "Даёт +45 к скорости атаки и +13% к скорости передвижения союзников на 6 секунд. Изначальное число зарядов: 8.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Доп. скорость передвижения: 20",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Несколько источников Swiftness Aura не складываются. Это включает ауру от Boots of Bearing.",
        "Полностью сочетается с другими бонусами к скорости передвижения.",
        "Не действует на неуязвимых существ.",
        "Эффект ауры задерживается на 0,5 сек."
      ],
      "mana": null,
      "abilityName": "Swiftness Aura",
      "cooldown": null,
      "description": "Увеличивает союзникам вокруг скорость передвижения на 20.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1700",
  "lore": null,
  "consistFrom": [
    "Robe of the Magi",
    "Belt of Strength",
    "Wind Lace",
    "Recipe"
  ],
  "name": "Drum of Endurance",
  "description": "Реликвия, в неспокойные времена зачаровывающая тела воинов вокруг, дабы те двигались скорее.",
  "trivia": null,
  "upgradeIn": [
    "Boots of Bearing"
  ],
  "tips": null
}