{"abilities":[{"effects":["Радиус: 1200","Поглощение магического урона: 400","Длительность: 12"],"notes":["При использовании прерывает произносимые заклинания владельца.","Действует на всех союзных юнитов, включая строения, но исключая варды. Действует на неуязвимых, но не спрятанных союзников.","Блокирует урон до учета любых сопротивлений, за исключением действия иммунитета к заклинаниям, так как в этот момент способность никакой магический урон не блокирует.","Повторное использование обновит бафф и сбросит счетчик поглощенного урона барьера.","Не сочетается с другими магическими барьерами. Если на юнита будет активировано несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно.","Блокирует только магический урон от заклинаний и атак. Не блокирует физический или чистый урон.","Не делит перезарядку с Hood of Defiance."],"elements":["Способность Ненаправленная","Действует на Союзников"],"description":"Создаёт на владельце и окружающих его союзниках барьер, блокирующий 400 магического урона. Действует 12 сек."},{"effects":["Радиус: 1200","Доп. регенерация здоровья: 3","Доп. сопротивление магии: 10%","Длительность задержки ауры: 0,5"],"notes":["Сочетается с другими источниками фиксированной регенерации здоровья, за исключением Insight Aura от нескольких Pipe of Insight.","Увеличивает общее сопротивление магии большинства героев до 32.5%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления. Увеличивает общее сопротивление магии Visage до 19%, учитывая его базовое сопротивление в 10","Не действует на варды, строения и неуязвимых юнитов.","Бафф ауры задерживается на 0,5 секунды."],"elements":["Способность Аура","Действует на Союзников"],"description":"Действует на союзников вокруг. Увеличивает их восстановление здоровья на 3 и сопротивление магии на 10%."}],"cost":"3025","description":"Могущественный артефакт таинственного происхождения. Он создает барьеры против магических сил.","trivia":["При переносе предмета из DotA в Dota 2, его название было упрощено с Khadgar's Pipe of Insight до Pipe of Insight. Khadgar - имя мага из игры Warcraft II.","Косметический предмет для Dazzle - Pipe of Dezun - основан на предмете Pipe of Insight."],"further":["Hood_of_Defiance","Headdress","Рецепт"],"attrs":["Активируемая Barrier","Пассивная Insight Aura","Бонус +2 к силе +2 к ловкости +2 к интеллекту +8 к регенерации здоровья +30% к сопротивлению магии","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Сочетается по закону убывающей полезности с другими источниками сопротивления магии."]}