{
  "abilities": [
    {
      "notes": [
        "Талант на дальность применения не влияет на максимальную дальность Ether Shock.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+30 к урону Wards",
          "talentRight": "+340 к урону от Ether Shock"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+1 атака на уничтожение варда Serpent Ward",
          "talentRight": "+2 сек. действия Shackles"
        },
        {
          "talentLvl": "15",
          "talentLeft": "-4,5 сек. к перезарядке Hex",
          "talentRight": "+100 к дальности заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+140 к суммарному урону от Shackles",
          "talentRight": "+175 к здоровью"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Shadow_Shaman_Ether_Shock.mp3\/revision\/latest?cb=20191216023116",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Поражает существ на расстоянии до 1000 единиц (складывается из начального радиуса, дальности применения и конечного радиуса).",
        "Область поражения имеет форму конуса, расходящегося от Shadow Shaman.",
        "Начальный радиус начинается от самого Shadow Shaman, а не от позиции основной цели.",
        "Способность выбирает цели не случайно, а исходя от близости к основной цели и их доступности в зоне конуса.",
        "Все молнии наносят до 140\/600\/1300\/2240 (TagTalent 480\/1620\/3000\/4620) единиц урона (до уменьшений).",
        "Назначение модификатора неизвестно."
      ],
      "mana": "100\/120\/140\/160",
      "hotKey": "Q",
      "cooldown": "14\/12\/10\/8",
      "description": "Создаёт конус бесплотной энергии, который бьёт по нескольким вражеским существам.",
      "spellName": "Ether Shock",
      "params": [
        "Анимация применения: 0,3+1,23",
        "Дальность применения: 600 (TagTalent 700)",
        "Начальный радиус: 200",
        "Максимальная дистанция: 500",
        "Конечный радиус: 300",
        "Число целей: 1\/3\/5\/7",
        "Урон: 140\/200\/260\/320 (TagTalent 480\/540\/600\/660)",
        "Блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Когда-то красочные молнии Расты впечатляли зрителей. Но не повезёт тем, на кого эти молнии направлены."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/13\/Shadow_Shaman_Hex_1.mp3\/revision\/latest?cb=20191216023108",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Мгновенное убийство"
      ],
      "notes": [
        "Применяет к цели проклятие, приравнивая её базовую скорость передвижения к 100, обезмолвивая, заглушая и обезоруживая её. При этом на скорость передвижения цели все еще влияют бонусы от предметов и способностей.",
        "При этом на скорость передвижения цели все еще влияют бонусы от предметов и способностей.",
        "Поскольку проклятие меняет базовую скорость передвижения, а не применяет к цели замедление, то все эффекты, влияющие на скорость, рассчитывают бонус, исходя из начальной скорости в 100 единиц.",
        "Мгновенно уничтожает иллюзии.",
        "Проклятие Shadow Shaman превращает цель в курицу. Косметические предметы Lamb to the Slaughter и Golden Lamb to the Slaughter меняют модель на овцу.",
        "Косметические предметы Lamb to the Slaughter и Golden Lamb to the Slaughter меняют модель на овцу."
      ],
      "mana": "70\/110\/150\/190",
      "hotKey": "W",
      "cooldown": "13 (TagTalent 8,5)",
      "description": "Превращает врага в безобидную зверюшку, лишая его возможности атаковать или применять способности.",
      "spellName": "Hex",
      "params": [
        "Анимация применения: 0+1,13",
        "Дальность применения: 500 (TagTalent 600)",
        "Скорость движения цели: 100",
        "Длительность: 1,25\/2\/2,75\/3,5",
        "Эффект остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "Раста часто заканчивал представление, превращая себя в курицу. Теперь он может унизить таким образом кого пожелает."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Shadow_Shaman_Shackles.mp3\/revision\/latest?cb=20191216023113",
      "effects": [
        "Способность Направленная на существо \/ Произносимая",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Оглушение действует до тех пор, пока способность применяется.",
        "Дает эффект True Sight на цель, если на момент применения она не была невидима или не уходила в невидимость.",
        "Если цель получила неуязвимость или её спрятали, то произнесение мгновенно завершается.",
        "Наносит урон с интервалом в 0,1 секунды сразу после начала применения, срабатывая 28\/35\/43\/50 (TagTalent 48\/55\/63\/70) раз. Урон за тик рассчитывается как максимальный урон, поделенный на базовую длительность в 2.75\/3.5\/4.25\/5 сек., а затем на 10. Бонус от таланта не учитывается. В результате получается 2,182\/4,571\/6,118\/7,2 (TagTalent 3,818\/7,171\/9,059\/10,08) урона за тик (21,82\/45,71\/61,18\/72 (TagTalent 38,18\/71,71\/90,59\/100,8) урона в секунду). В итоге, всего способность нанесет (до уменьшений): 61,09\/160\/263,06\/360 (TagTalent 106,91\/251\/389,53\/504). С талантом на дополнительную длительность способность нанесет 104,73\/251,43\/385,41\/504 (TagTalent 183,27\/394,43\/570,71\/705,6).",
        "Урон за тик рассчитывается как максимальный урон, поделенный на базовую длительность в 2.75\/3.5\/4.25\/5 сек., а затем на 10. Бонус от таланта не учитывается.",
        "В результате получается 2,182\/4,571\/6,118\/7,2 (TagTalent 3,818\/7,171\/9,059\/10,08) урона за тик (21,82\/45,71\/61,18\/72 (TagTalent 38,18\/71,71\/90,59\/100,8) урона в секунду).",
        "В итоге, всего способность нанесет (до уменьшений): 61,09\/160\/263,06\/360 (TagTalent 106,91\/251\/389,53\/504).",
        "С талантом на дополнительную длительность способность нанесет 104,73\/251,43\/385,41\/504 (TagTalent 183,27\/394,43\/570,71\/705,6).",
        "В отличии от других направленных заклинаний длительность обзора для заклинателя равна длительность произнесения (даже если способность прервали), а не 2 секундам.",
        "С Aghanim's Shard призывает Serpent Ward текущего уровня на расстоянии 100 единиц от цели на севере, западе, юге и востоке. Варды смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности. При создании варды получают приказ на атаку цели, но игрок может ими управлять. Эти тотемы так же получают улучшение от Aghanim's Scepter. Если Mass Serpent Ward не изучена, то тотемы не призываются.",
        "Варды смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности.",
        "При создании варды получают приказ на атаку цели, но игрок может ими управлять.",
        "Эти тотемы так же получают улучшение от Aghanim's Scepter.",
        "Если Mass Serpent Ward не изучена, то тотемы не призываются."
      ],
      "mana": "140\/150\/160\/170",
      "hotKey": "E",
      "cooldown": "16\/14\/12\/10",
      "description": "Связывает врага магическими путами, не позволяющими передвигаться или атаковать, а также наносящими периодический урон.",
      "spellName": "Shackles",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 400 (TagTalent 500) (TagTalent 550, 650)",
        "Макс. длительность: 2.75\/3.5\/4.25\/5 (TagTalent 4,75\/5,5\/6,25\/7)",
        "Общий урон: 60\/160\/260\/360 (TagTalent 105\/251\/385\/504)",
        "Число Serpent Ward: 0 (TagTalent 4)",
        "Время жизни вардов: 0 (TagTalent 7)",
        "Увеличивает дальность применения способности на 150 и создаёт змеиных тотема рядом с жертвой. Тотемы живут 7 секунд.",
        "Эффект мгновенно завершается, если дебафф был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Заклинание самообороны, познанное Растой после гибели его учителя на Кровоточащих холмах."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Shadow_Shaman_Mass_Serpent_Ward.mp3\/revision\/latest?cb=20191216023109",
      "effects": [
        "Способность Направленная на точку",
        "Урон Физический Мгновенная атака"
      ],
      "notes": [
        "Размещает Serpent Ward каждые 36 градусов круга радиусом в 150 единиц, вызывая 10 вардов. Варды создают непроходимый барьер, поэтому враги не могут из него выбраться без наличия сквозного прохождения. Для выхода или входа в круг достаточно разрушить один вард. Варды смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности.",
        "Варды создают непроходимый барьер, поэтому враги не могут из него выбраться без наличия сквозного прохождения.",
        "Для выхода или входа в круг достаточно разрушить один вард.",
        "Варды смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности.",
        "Варды автоматически атакуют врагов в пределах дальности атаки, используя стандартные правила автоатаки. Можно задать цель для атаки, используя принудительную атаку правой кнопкой мыши по цели в радиусе дальности атаки. Также можно отдать приказ вардам на прекращение атаки (работает лишь при выключенной опции автоатаки в настройках).",
        "Можно задать цель для атаки, используя принудительную атаку правой кнопкой мыши по цели в радиусе дальности атаки.",
        "Также можно отдать приказ вардам на прекращение атаки (работает лишь при выключенной опции автоатаки в настройках).",
        "Приоритет атаки тотемов ниже, чем у других существ и героев, поэтому башни и крипы будут их атаковать в последнюю очередь.",
        "Урон от Serpent Ward не снижается блокировкой урона.",
        "Aghanim's Scepter позволяет вардам совершать мгновенные атаки по одному врагу при запуске снаряда. То есть дополнительный снаряд выпускается одновременно со снарядом основной атаки. При этом не важно, промахнулась ли атака по главной цели или нет, дополнительный снаряд все равно будет запущен. Снаряд от дополнительной атаки летит с той же скоростью, что и снаряд от основной атаки, и его можно избежать так же, как и обычную атаку. В отличии от других мгновенных атак, атаки Serpent Ward не активируют эффекты, срабатывающие при атаке. При этом на атаки влияют разные типы брони и уклонение. Не выбирает дополнительной целью варды, невидимых существ, существ с иммунитетом к атакам или в Тумане войны. Выбирает целью строения. Вторичная цель выбирается случайно без какого-либо приоритета.",
        "То есть дополнительный снаряд выпускается одновременно со снарядом основной атаки.",
        "При этом не важно, промахнулась ли атака по главной цели или нет, дополнительный снаряд все равно будет запущен.",
        "Снаряд от дополнительной атаки летит с той же скоростью, что и снаряд от основной атаки, и его можно избежать так же, как и обычную атаку.",
        "В отличии от других мгновенных атак, атаки Serpent Ward не активируют эффекты, срабатывающие при атаке.",
        "При этом на атаки влияют разные типы брони и уклонение.",
        "Не выбирает дополнительной целью варды, невидимых существ, существ с иммунитетом к атакам или в Тумане войны. Выбирает целью строения.",
        "Вторичная цель выбирается случайно без какого-либо приоритета."
      ],
      "mana": "200\/350\/600",
      "hotKey": "R",
      "cooldown": "120",
      "description": "Призывает 10 невосприимчивых к магии змеиных тотемов, атакующих врагов и постройки.",
      "spellName": "Mass Serpent Ward",
      "params": [
        "Анимация применения: 0,3+0,97",
        "Дальность применения: 550 (TagTalent 650)",
        "Радиус появления: 150",
        "Число вардов: 10",
        "Атак для уничтожения: 2 (TagTalent 3)",
        "Радиус разделенного урона: 0 (TagAghanim 875)",
        "Доп. целей для атаки: 0 (TagAghanim 1)",
        "Время жизни вардов: 45",
        "Увеличивает дальность атаки тотемов и позволяет им атаковать две цели одновременно, нанося каждой из них полный урон."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Заклинание змей было важным элементом в выступлениях Расты. Теперь же змеи беспрекословно выполняют его приказы."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 23.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Shadow Shaman — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Благодаря своим способностям, герой может легко обездвиживать противников и наносить немалое количество урона. Способностью Ether Shock герой бьёт молнией по нескольким противникам, нанося им урон. Способностью Hex герой проклинает врага, превращая его в курицу, при этом у противника снижается скорость передвижения и он становится полностью недееспособным. Shackles дает возможность герою удерживать противника сетью, полностью его обездвиживая и нанося периодический урон. Способностью Mass Serpent Ward герой вызывает 10 змеек-стражей, которые атакуют противников и строения.",
  "history": "Рождённый на Кровоточащих холмах, юный Раста жил впроголодь, пока его не подобрал странствующий шарлатан. За два медяка старый пройдоха мог предсказать судьбу. За три — кастрировать свинью. За пять — совершить обрезание. За хорошие харчи он мог облачиться в шкуру шамана и зачитать проклятия из древних книг, насылая их на ваших врагов. А чудной юнец, наполовину холмовой тролль, наполовину… что-то ещё, работал помощником и придавал налёт экзотики услугам старого ловкача. Всегда на шаг впереди облапошенных покупателей, на один город впереди взбешённых преследователей, эти двое путешествовали по гиблым землям до тех пор, пока шарлатан не понял, что его юный напарник на самом деле способен на то, чем сам старик только дурил зрителей. Его подопечный имел дар, который очень ценили клиенты. И вот юный Раста стал развлекать толпу, и прозвали его тогда шаманом теней. Напарники продолжили странствовать по городам, колдуя за деньги, а молва о кудеснике всё росла и росла. В конце концов странников настигло шарлатанское прошлое: их подкараулила толпа обманутых покупателей. Шарлатана убили, и впервые в жизни Раста использовал свою силу во зло, перебив всех нападавших. Он похоронил своего любимого учителя и теперь использует свою силу против любого, кто посягнёт на его жизнь.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+30 к урону Wards",
      "talentRight": "+340 к урону от Ether Shock"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+1 атака на уничтожение варда Serpent Ward",
      "talentRight": "+2 сек. действия Shackles"
    },
    {
      "talentLvl": "15",
      "talentLeft": "-4,5 сек. к перезарядке Hex",
      "talentRight": "+100 к дальности заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+140 к суммарному урону от Shackles",
      "talentRight": "+175 к здоровью"
    }
  ]
}