{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Mars_Spear_of_Mars_1.mp3\/revision\/latest?cb=20191216020055",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "notes": [
        "Spear of Mars automatically toggles Bulwark Off during its cast point.",
        "The spear travels at a speed of 1400, taking 0.64\/0.71\/0.79\/0.86 seconds to reach max distance when no hero(es) are impaled.",
        "The spear starts traveling exactly on Mars' location and forwards up to 900\/1000\/1100\/1200 range. Although within the spear's search radius, it does not hit enemies behind Mars upon cast. With the travel distance and search radius, it can hit units up to 1025\/1125\/1225\/1325 range away.",
        "Although within the spear's search radius, it does not hit enemies behind Mars upon cast.",
        "With the travel distance and search radius, it can hit units up to 1025\/1125\/1225\/1325 range away.",
        "A spear may only damage and drag 1 (TagTalent 2) hero(es) along with it, and are stuned during the drag. Treat creep-heroes as creeps. Dragged hero(es) are made to face toward the direction the spear came from. If the hero dies or gets freed from the spear, it cannot impale a new hero. SHARD NOTES This number of impaled units restriction is still limited to 2 heroes upon the upgrade. The affected hero(es) are stunned when impaled onto the following objects: Arena Of Blood All types of trees. All buildings of different factions, except item shops. All cliffs, including the edge of the map, and pathing blockers. Does not impale affected hero(es) onto terrain decorations (e.g. The walls at the borders of both faction's bases, the random statues on the map, and the arches at stairs).",
        "Treat creep-heroes as creeps.",
        "Dragged hero(es) are made to face toward the direction the spear came from.",
        "If the hero dies or gets freed from the spear, it cannot impale a new hero. SHARD NOTES This number of impaled units restriction is still limited to 2 heroes upon the upgrade.",
        "SHARD NOTES This number of impaled units restriction is still limited to 2 heroes upon the upgrade.",
        "The affected hero(es) are stunned when impaled onto the following objects: Arena Of Blood All types of trees. All buildings of different factions, except item shops. All cliffs, including the edge of the map, and pathing blockers.",
        "Arena Of Blood",
        "All types of trees.",
        "All buildings of different factions, except item shops.",
        "All cliffs, including the edge of the map, and pathing blockers.",
        "Does not impale affected hero(es) onto terrain decorations (e.g. The walls at the borders of both faction's bases, the random statues on the map, and the arches at stairs).",
        "Provides True Sight over the impaled target(s). True Sight is not applied while dragging the affected target(s) along with the spear.",
        "Upon losing the impale stun debuff, trees within a 100 radius around the affected hero(es) are destroyed.",
        "Other units, as well as secondary heroes, are damaged and knocked back instead. The knockback direction is based on the angle between the hit unit and the spear. The knockback does not disable units. They can still turn, attack and use items. Does not interrupt the affected enemies' channeling abilities. Destroys trees enemies come in contact with during the knockback.",
        "The knockback direction is based on the angle between the hit unit and the spear.",
        "The knockback does not disable units. They can still turn, attack and use items. Does not interrupt the affected enemies' channeling abilities.",
        "Destroys trees enemies come in contact with during the knockback.",
        "The spear flies through and cannot collide with invulnerable or hidden units.",
        "The spear provides 300 radius flying vision as it travels. When not impaling a hero to an object, the vision lingers at the final location for 1 second. When impaling a hero to an object, the vision lingers based on the default stun duration.",
        "When not impaling a hero to an object, the vision lingers at the final location for 1 second.",
        "When impaling a hero to an object, the vision lingers based on the default stun duration.",
        "SHARD NOTES Spear of Mars' now leaves behind a fire trail as it travels. The fire lasts 10 seconds from the moment it is created, with the fire created at the starting location disappearing earlier than the fire created at the ending location. The fire places a debuff on enemies within the area in 0.5-second intervals, starting 0.5 seconds after the fire was created. The debuff deals 17.5 damage in 0.5-second intervals, starting 0.5 seconds after being placed, resulting in 4 damage instances. This results in a maximum of 24 damage instances when standing within the area the full duration. One instance of the debuff can deal up to 70 damage (before reductions). The entire fire trail can deal up to 420 damage to a single unit. Multiple overlapping fire trails do not stack but refresh the same debuff on enemies.",
        "The fire lasts 10 seconds from the moment it is created, with the fire created at the starting location disappearing earlier than the fire created at the ending location.",
        "The fire places a debuff on enemies within the area in 0.5-second intervals, starting 0.5 seconds after the fire was created.",
        "The debuff deals 17.5 damage in 0.5-second intervals, starting 0.5 seconds after being placed, resulting in 4 damage instances.",
        "This results in a maximum of 24 damage instances when standing within the area the full duration.",
        "One instance of the debuff can deal up to 70 damage (before reductions).",
        "The entire fire trail can deal up to 420 damage to a single unit.",
        "Multiple overlapping fire trails do not stack but refresh the same debuff on enemies."
      ],
      "mana": "15\/14\/13\/12",
      "item_behaviour": [],
      "name": "Spear of Mars",
      "cooldown": "100\/110\/120\/130",
      "description": "Mars throws his legendary Spear with deadly precision, damaging each enemy unit it strikes. The first enemy hero it hits is skewered on the spear, pushing it back. If a skewered hero hits a tree, building, or cliff, they will be impaled to it and stunned.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.25+1.03",
        "Cast Range: Global",
        "Max Travel Distance:  900\/1000\/1100\/1200",
        "Spear Collision Size: 125",
        "Spear Damage: 100\/175\/250\/325 ( 200\/275\/350\/425)",
        "Knockback Distance: 75",
        "Knockback Duration: 0.25",
        "Number of Impaled Units: 1 ( 2)",
        "Impale Stun Duration: 1.4\/1.8\/2.2\/2.6 ( 2.2\/2.6\/3\/3.4)",
        "Fire Trail Radius: 200",
        "Fire Damage per Second: 35",
        "Fire Move Speed Slow: 20%",
        "Fire Trail Duration: 10",
        "Fire Trail Debuff Duration: 2"
      ],
      "legacy_key": "E",
      "story": "The legendary Spear of Mars still glows with the heat of the forge god's fires."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8d\/Mars_God%27s_Rebuke_1.mp3\/revision\/latest?cb=20191216020052",
      "effects": [
        "Ability: Target Point",
        "Affects: Enemies",
        "Damage: Instant Attack"
      ],
      "notes": [
        "God's Rebuke's effects are instantly applied within its whole area. There is no travel time.",
        "The area is shaped like a circular sector, with a radius of 500 (TagTalent 600) and an angle of 140°. God's Rebuke affects an area based on Mars's current facing angle, not where the ability was targeted. When Bulwark is toggled On, it always launches towards the locked facing direction, since Mars cannot turn towards the targeted point.",
        "God's Rebuke affects an area based on Mars's current facing angle, not where the ability was targeted.",
        "When Bulwark is toggled On, it always launches towards the locked facing direction, since Mars cannot turn towards the targeted point.",
        "Causes Mars to perform an instant attack on all hit enemies. These instant attacks can proc any attack modifiers and on-hit effects normally, with cleave being an exception. They have True Strike, but completely ignore disarms. God's Rebuke has an ensured critical strike, crits with a lower value have no effect if they proc since the higher crit value takes priority. Fully affect enemy Couriers.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally, with cleave being an exception. They have True Strike, but completely ignore disarms.",
        "God's Rebuke has an ensured critical strike, crits with a lower value have no effect if they proc since the higher crit value takes priority.",
        "Fully affect enemy Couriers.",
        "God's Rebuke hero attack damage bonus is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Mars's attack damage for the instant attack. It can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to Mars's attack damage for the instant attack.",
        "It can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "If the affected enemies are not killed, they are knocked back and slowed. The direction is based on the angle between the hit unit and the caster. Units are not disabled during the knockback. They can still turn, attack, cast abilities, and use items. Does not interrupt the enemies' channeling abilities. Does not push heroes affected by the impaling stun of Spear of Mars. Destroys trees enemies come in contact with during the knockback.",
        "Units are not disabled during the knockback. They can still turn, attack, cast abilities, and use items. Does not interrupt the enemies' channeling abilities.",
        "Does not push heroes affected by the impaling stun of Spear of Mars.",
        "Destroys trees enemies come in contact with during the knockback.",
        "God's Rebuke first applies knockback, the movement speed slow, then the instant attack. Both the knockback and movement speed slow debuffs are applied at the same time, so the movement speed slow effectively lasts for 2.2 seconds.",
        "Both the knockback and movement speed slow debuffs are applied at the same time, so the movement speed slow effectively lasts for 2.2 seconds.",
        "TALENT NOTES The distance increasing talent increases both the cast range and the effect radius. However, other cast range bonuses only increase the ability's cast range.",
        "SPELL STEAL This ability's cast point is not modified when acquired."
      ],
      "mana": "16\/14\/12\/10 (TagTalent 12\/10\/8\/6)",
      "item_behaviour": [],
      "name": "God's Rebuke",
      "cooldown": "90",
      "description": "Mars smashes enemies in front of him with his shield, knocking them back and damaging them with a critical hit based on his attack. Bonus damage is added when hitting heroes. Has True Strike.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.2+1.07",
        "Cast Range:  500 ( 600)",
        "Effect Radius: 500 ( 600)",
        "Circle Sector Angle: 140°",
        "Critical Damage: 150%\/190%\/230%\/270% ( 215%\/255%\/295%\/335%)",
        "Hero Attack Damage Bonus: 5\/10\/15\/20",
        "Knockback Distance: 150",
        "Knockback Duration: 0.3",
        "Move Speed Slow: 40%",
        "Slow Duration: 2.5"
      ],
      "legacy_key": "R",
      "story": "There isn't a warrior alive who can stand unmoved by the sting of Mars' rebuke."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f2\/Mars_Bulwark_1.mp3\/revision\/latest?cb=20191216020049",
      "effects": [
        "Ability: Toggle",
        "Affects: Self ",
        "Damage: "
      ],
      "notes": [
        "Does not interrupt Mars' channeling abilities upon toggling On \/ Off.",
        "Applies generic incoming damage reduction on Mars. Stacks additively with other sources of generic incoming damage manipulation. The reduction follows the same targeting rules as damage block does, reacting mainly on attack damage. However, this means it also reacts on abilities that react on damage block and is bypassed by some sources of instant attacks. Increases Mars' effective health by 67%\/100%\/150%\/233% (TagTalent 108%\/163%\/257%\/456%) and 25%\/33%\/43%\/54% (TagTalent 35%\/45%\/56%\/69%) when taking front damage and side damage respectively.",
        "The reduction follows the same targeting rules as damage block does, reacting mainly on attack damage.",
        "However, this means it also reacts on abilities that react on damage block and is bypassed by some sources of instant attacks.",
        "Increases Mars' effective health by 67%\/100%\/150%\/233% (TagTalent 108%\/163%\/257%\/456%) and 25%\/33%\/43%\/54% (TagTalent 35%\/45%\/56%\/69%) when taking front damage and side damage respectively.",
        "Checks the damage source's current position and Mars' facing angle when the attack connects, not when the attack is released.",
        "Bulwark damage reduction occurs after damage block. Although both Bulwark and damage block use the same visuals when showing how much damage was blocked, the damage reduced is independent of each other.",
        "Although both Bulwark and damage block use the same visuals when showing how much damage was blocked, the damage reduced is independent of each other.",
        "Plays a visual effect and a sound whenever damage is blocked. The default hit sound does not play. When blocking hero damage from the front, a bigger visual effect and the default sound are played. When blocking hero damage from the sides, or creep damage from the front, a smaller visual effect and a smaller sound are played. When blocking creep damage from the sides, no effects or sounds are played.",
        "When blocking hero damage from the front, a bigger visual effect and the default sound are played.",
        "When blocking hero damage from the sides, or creep damage from the front, a smaller visual effect and a smaller sound are played.",
        "When blocking creep damage from the sides, no effects or sounds are played.",
        "While toggled On, Mars is disarmed and slowed, and has his facing direction locked. He can still cast abilities and items and move normally, but no longer requires facing the target to do so. Automatically toggles Off when Spear of Mars is cast. Any attack projectile within 900 range of Mars, and within the front and side angles of Bulwark has a 70% chance to get redirected to him. The ally being attacked has to be 900 range behind Mars. The redirect happens immediately upon projectile launch. Instead of targeting the intended attack target, it targets Mars instead. Does not redirect projectiles when Mars turns invulnerable, hidden and ethereal.",
        "He can still cast abilities and items and move normally, but no longer requires facing the target to do so.",
        "Automatically toggles Off when Spear of Mars is cast.",
        "Any attack projectile within 900 range of Mars, and within the front and side angles of Bulwark has a 70% chance to get redirected to him.",
        "The ally being attacked has to be 900 range behind Mars.",
        "The redirect happens immediately upon projectile launch. Instead of targeting the intended attack target, it targets Mars instead.",
        "Does not redirect projectiles when Mars turns invulnerable, hidden and ethereal.",
        "Goes on a 0.2-second cooldown upon toggling Off.",
        "SCEPTER NOTES Toggling On now spawns 5 soldiers, with the first soldier located exactly in front of Mars, and the others are offset by 30° to either side, forming an arc. Each soldier attacks enemies within 250 range around them. However, they do not attack enemies within 150 range of Mars. This results in a total area shaped like a horseshoe. Each soldier can attack only one random enemy at a time, there are no priorities. The soldiers' attacks first apply the damage, then the movement speed slow. Soldiers are invulnerable, phased and have unobstructed pathing. Although invulnerable, they are considered as units, and can still interact with the following abilities\/mechanics: Hookshot, Shadow Wave damage\/heal count, blocking neutral creeps from spawning and etc.",
        "Each soldier attacks enemies within 250 range around them.",
        "However, they do not attack enemies within 150 range of Mars. This results in a total area shaped like a horseshoe.",
        "Each soldier can attack only one random enemy at a time, there are no priorities.",
        "The soldiers' attacks first apply the damage, then the movement speed slow.",
        "Soldiers are invulnerable, phased and have unobstructed pathing. Although invulnerable, they are considered as units, and can still interact with the following abilities\/mechanics: Hookshot, Shadow Wave damage\/heal count, blocking neutral creeps from spawning and etc.",
        "SCEPTER NOTES The soldiers always attack together, the attacks are synchronized in 1-second intervals, even if not all of them have a target. The attack interval timer only counts down while Bulwark is toggled On. For example, if Bulwark is toggled off 0.4 seconds after their last attack, the next time it is toggled on, they still have to wait 0.6 seconds before they can attack again. Although the soldiers are performing the instant attacks, the damage is sourced to Mars. These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike. Fully affect enemy Couriers. Instant attacks are not performed when Mars is stunned, disarmed, cycloned, slept, feared or while prevented from acting. Other disables (e.g. silence and root) do not disable the instant attacks. Acquiring Aghanim's Scepter while Bulwark is toggled On does not update the current instance.",
        "The attack interval timer only counts down while Bulwark is toggled On.",
        "For example, if Bulwark is toggled off 0.4 seconds after their last attack, the next time it is toggled on, they still have to wait 0.6 seconds before they can attack again.",
        "Although the soldiers are performing the instant attacks, the damage is sourced to Mars.",
        "These instant attacks can proc any attack modifiers and on-hit effects normally. They do not have True Strike.",
        "Fully affect enemy Couriers.",
        "Instant attacks are not performed when Mars is stunned, disarmed, cycloned, slept, feared or while prevented from acting. Other disables (e.g. silence and root) do not disable the instant attacks.",
        "Other disables (e.g. silence and root) do not disable the instant attacks.",
        "Acquiring Aghanim's Scepter while Bulwark is toggled On does not update the current instance."
      ],
      "mana": "0.2",
      "item_behaviour": [],
      "name": "Bulwark",
      "cooldown": "0",
      "description": "Mars wields his massive shield to block a portion of each physical attack when hit from the front or sides. Can be toggled, removing Mars's ability to attack, and locking the direction he is facing. When active, reduces movement speed and re-directs 70% of the attack projectiles aimed at Mars's allies towards Mars instead.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0",
        "Front Angle: 140°",
        "Side Angle: 240°",
        "Front Damage Reduction: 40%\/50%\/60%\/70% ( 52%\/62%\/72%\/82%)",
        "Side Damage Reduction: 20%\/25%\/30%\/35% ( 26%\/31%\/36%\/41%)",
        "Active Projectile Redirect Chance: 70% ( 100%)",
        "Active Projectile Redirect Range: 900",
        "Active Self Move Speed Slow: 18%",
        "Instant Attack Interval: 1",
        "Instant Attack Damage Bonus: 75",
        "Number of Soldiers: 5",
        "Soldiers Distance: 200",
        "Soldiers Attack Range: 250",
        "Enemy Move Speed Slow: 30%",
        "Slow Duration: 1"
      ],
      "legacy_key": "W",
      "story": "Only the very foolish dare to fight fair with the god of war."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a4\/Mars_Arena_of_Blood_1.mp3\/revision\/latest?cb=20191216020059",
      "effects": [
        "Ability: Target Area",
        "Affects: Enemies ",
        "Damage: Magical"
      ],
      "notes": [
        "The effect delay is not included in the arena's duration. The actual duration starts right after the -second effect delay.",
        "Inside the arena, enemies without flying movement coming within 160 range of the wall get damaged. If not killed by the damage, the enemy is knocked back towards the arena center. Units are not disabled during the knockback. They can still turn, attack, cast abilities, and use items. Does not interrupt the affected enemy's channeling abilities. Hero(es) impaled by Spear of Mars are stunned and not knocked back. Destroys trees within 100 radius that enemies come in contact with during the knockback.",
        "If not killed by the damage, the enemy is knocked back towards the arena center.",
        "Units are not disabled during the knockback. They can still turn, attack, cast abilities, and use items. Does not interrupt the affected enemy's channeling abilities.",
        "Hero(es) impaled by Spear of Mars are stunned and not knocked back.",
        "Destroys trees within 100 radius that enemies come in contact with during the knockback.",
        "A unit may only be damaged and knocked back once every 1 second.",
        "Stops enemies without flying movement by slowing them with a movement speed slow aura. The aura has a radius of 750 and is centered on the field. This means units with flying movement can enter and leave the arena freely at any time. The slow gets exponentially stronger towards the walls, which has a 550 radius. This effectively causes enemy units touching the walls to come to halt. The slow is only present when facing toward the walls. Units at the walls facing away from it are not slowed. The slow aura's effect lingers for 0.5 seconds, resulting in an effective duration of 5.5\/6.5\/7.5 seconds. Since the slow is fluctuating a lot, it is not displayed in the HUD.",
        "This means units with flying movement can enter and leave the arena freely at any time.",
        "The slow gets exponentially stronger towards the walls, which has a 550 radius.",
        "This effectively causes enemy units touching the walls to come to halt.",
        "The slow is only present when facing toward the walls. Units at the walls facing away from it are not slowed.",
        "The slow aura's effect lingers for 0.5 seconds, resulting in an effective duration of 5.5\/6.5\/7.5 seconds.",
        "Since the slow is fluctuating a lot, it is not displayed in the HUD.",
        "Besides preventing enemies from walking in or out of the area, the following movement abilities are unable to pass the walls either: Skewer, Sun Ray Movement, God's Rebuke, Force Staff and Hurricane Pike. Other horizontal movement sources can move units through the walls freely. However, the knockback from inside the arena still triggers and can cancel forced movement.",
        "Skewer, Sun Ray Movement, God's Rebuke, Force Staff and Hurricane Pike.",
        "Other horizontal movement sources can move units through the walls freely.",
        "However, the knockback from inside the arena still triggers and can cancel forced movement.",
        "Any attack projectile from an enemy gets blocked upon coming within 100 range of the walls. This includes all attack-based projectiles, including those coming from instant attacks. However, it does not block spell-based projectiles (e.g. Death Ward). These blocked projectiles count as completely negated so that no on-attack effects can trigger (e.g. Retaliate). This means ranged enemies outside the arena cannot attack units inside of it and vice versa. Melee units can attack freely, if they have enough attack range. Projectiles from abilities are completely unaffected as well.",
        "This includes all attack-based projectiles, including those coming from instant attacks.",
        "However, it does not block spell-based projectiles (e.g. Death Ward).",
        "These blocked projectiles count as completely negated so that no on-attack effects can trigger (e.g. Retaliate).",
        "This means ranged enemies outside the arena cannot attack units inside of it and vice versa.",
        "Melee units can attack freely, if they have enough attack range. Projectiles from abilities are completely unaffected as well.",
        "Provides 550 range flying vision at the center of the area for 5\/6\/7 seconds upon cast.",
        "After the effect delay, trees within 550 range of the wall gets destroyed. This means it effectively destroys trees within a 1100 radius.",
        "This means it effectively destroys trees within a 1100 radius.",
        "TALENT NOTES The ally health regeneration talent is provided by an aura within the arena, which lingers for 0.5 seconds. With the arena's duration and its aura linger duration, it can regenerate up to 990\/1170\/1350 health over its full duration. Neither affects buildings nor wards, and neither invulnerable nor hidden units. The health regeneration bonus fully affect Couriers.",
        "With the arena's duration and its aura linger duration, it can regenerate up to 990\/1170\/1350 health over its full duration.",
        "Neither affects buildings nor wards, and neither invulnerable nor hidden units.",
        "The health regeneration bonus fully affect Couriers."
      ],
      "mana": "90",
      "item_behaviour": [],
      "name": "Arena Of Blood",
      "cooldown": "150\/200\/250",
      "description": "After a short formation time, Mars summons an arena lined with the undead warriors of the Ash Legion, who block enemy attacks and movement. Enemy heroes near the inside edge of the arena will be attacked by spears, dealing damage and knocking them back.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.2+0.97",
        "Cast Range:  400",
        "Arena Radius: 550",
        "Wall Width: 100",
        "Effect Delay: 0.3",
        "Spear Trigger Distance: 160",
        "Spear Damage: 75\/150\/225",
        "Spear Attack Interval: 1",
        "Spear Knockback Distance: 160",
        "Spear Knockback Duration: 0.2",
        "Arena Duration: 5\/6\/7",
        "Aura Linger Duration: 0.5",
        "<span image=\"images\\Talent\"><\/span> Ally Health Regen Bonus: 180"
      ],
      "legacy_key": "B",
      "story": "The long-dead members of the Ash Legion, assembled from the finest warriors to ever test the might of Mars, still revel in the thrill of combat, gladly beholden to the hand that fell them for as long as he so commands."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 23.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 1.7,
    "attrAgility": 20.0
  },
  "description": "Traps his foes in an inescapable arena. The warrior deity Mars thrives in the heart of strife, guarded by the bulk of a deadly shield, an impenetrable Bulwark that guards against all assault. Using divine strength, he skewers enemies with his Legendary Spear, and Rebukes attackers back with his shield. He revels in facing opponents in an Arena of Blood, ringed with loyal undead spearmen of the Ash Legion — who guarantee that no one escapes and that whatever odds he's facing, the god of war can dictate the terms of battle knowing the crowd is forever on his side.  Carry Initiator Disabler Durable ★☆☆",
  "trivia": [
    "Despite being Zeus' son, Mars is named after the Roman god of war, instead of the Greek equivalent, Ares, who is the son of the Greek god Zeus. However, lines from Mars ( Link▶️ \"I don't answer to that name anymore, you old fool.\") and Zeus themselves ( Link▶️ \"Change your name all you want, you can't fool me.\") hint that Mars has changed his previous name of Ares, possibly to avoid association with his father. He also refers to himself as \"Mars Ultor\". In real life, this is the same name given to the Roman god Mars by the emperor Caesar Augustus when he created a cult of the same name. Mars Ultor means \"Mars the Avenger\" in Latin. Mars' Immortal Off-hand item, God's Mercy, references elements from the Greek Myth as well, namely Perseus and Medusa. Perseus (who is another one of the Greek god Zeus' sons) uses a polished shield to act as a mirror to approach and behead the sleeping Medusa without looking directly at her eyes, thereby avoiding her infamous stone gaze. Perseus also used Medusa's head as a weapon to turn King Atlas into stone.",
    "However, lines from Mars ( Link▶️ \"I don't answer to that name anymore, you old fool.\") and Zeus themselves ( Link▶️ \"Change your name all you want, you can't fool me.\") hint that Mars has changed his previous name of Ares, possibly to avoid association with his father.",
    "He also refers to himself as \"Mars Ultor\". In real life, this is the same name given to the Roman god Mars by the emperor Caesar Augustus when he created a cult of the same name. Mars Ultor means \"Mars the Avenger\" in Latin.",
    "Mars' Immortal Off-hand item, God's Mercy, references elements from the Greek Myth as well, namely Perseus and Medusa. Perseus (who is another one of the Greek god Zeus' sons) uses a polished shield to act as a mirror to approach and behead the sleeping Medusa without looking directly at her eyes, thereby avoiding her infamous stone gaze. Perseus also used Medusa's head as a weapon to turn King Atlas into stone.",
    "Mars carries a Greek-style Boeotian shield, but its decorative thunderbolts are more common on Roman shields.",
    "Link▶️ Arena Of Blood's sound comes from the Mars movement of Gustav Holst's musical suite, The Planets. Mars also Link▶️ hums the music when ordered to move or after killing an enemy in the Arena of Blood.",
    "Mars' response on pinning an enemy against the walls of Arena of Blood ( Link▶️ \"Are you not entertained?!\") is a reference to a scene from the film Gladiator.",
    "Mars' death response ( Link▶️ \"What is this madness?!\") and Dota Plus chat wheel line ( Link▶️ \"THIS IS DOOOOTAAAAA!\") are references to the famous \"THIS IS SPARTA!\" scene from the film 300",
    "Mars' rare killing response ( Link▶️ \"Mars the Impaler!\") is a reference to Vlad the Impaler, the Wallachian Voivode who was the inspiration behind Bram Stoker's Count Dracula.",
    "Mars' rare Arena of Blood cast response ( Link▶️ \"WITNESS MEEEE!\") is a reference to a War Boy's suicide attack using grenade-tipped spears from the film Mad Max: Fury Road.",
    "Files related to Mars were leaked on January 03, 2018, but were deleted later that day. The leaked abilities were called Spear Wall\/Spear and Phalanx\/Phalanx Cancel."
  ],
  "history": "Mars, first son of Heaven, spent a long existence waging endless war, and saw countless more crusades waged beneath the banner of his old name. Wars of conquest and of vengeance. Just and unjust... Always cruel. So much like his father, Mars indulged his basest impulses--with inclinations much more monstrous than those of Zeus--and he inflicted suffering untold. But as the epochs vanished behind him, the selfish ways of his father--the ways of many amongst his godly kin, they who judged him despicable--eventually began to ring hollow. War for its own sake was no longer enough to satisfy his desires. For the first time in his ageless days, the god of war began to question to what ends he swung his glorious spear. As the Fates would have it, his solution came easily: he must wage war for a larger purpose, and inspire more than mere savagery and sorrow at the sight of his crest. He must at last lay claim to the mantle of leadership that is his birthright, for the time has come to burn down the pantheon of the old age and build a just new empire atop the ashes of his kin. Only then might he find satisfaction, and make the glory of Mars evident to all.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "God's Rebuke +65% Crit",
        "talent_left": "Arena Of Blood Grants Team +180 HP Regen"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+12%\/+6% Bulwark Front\/Side damage reduction",
        "talent_left": "+0.8s Spear of Mars Stun"
      },
      {
        "talent_lvl": "15",
        "talent_right": "-4s God's Rebuke Cooldown",
        "talent_left": "+100 Spear of Mars Damage"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+100 God's Rebuke Distance",
        "talent_left": "+30% Bulwark Active Redirect Chance"
      }
    ]
  }
}