{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2b\/Eternal_Shroud_Shroud.mp3\/revision\/latest?cb=20210120233507",
      "effects": [
        "Поглощает магического урона: 400",
        "Длительность: 12"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания владельца.",
        "Блокирует урон до любых уменьшений, кроме Mana Shield.",
        "Блокирует только магический урон, исходящий от способностей и атак. Не блокирует физический или чистый урон.",
        "Количество восстанавливаемой маны равно количеству заблокированного урона. Полностью затрагивается манипуляцией восстановлением маны.",
        "Повторное использование обновит бафф и сбросит счетчик поглощенного урона.",
        "Не сочетается с другими магическими барьерами. Если на существе будут активны несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно. При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Если на существе будут активны несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно.",
        "При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Не делит перезарядку с Pipe of Insight или Hood of Defiance."
      ],
      "mana": "50",
      "abilityName": "Shroud",
      "cooldown": "45",
      "description": "Создаёт щит, блокирующий до магического урона. Получаемый магический урон превращается в ману. Действует сек.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3300",
  "lore": null,
  "consistFrom": [
    "Voodoo Mask",
    "Hood of Defiance",
    "Recipe"
  ],
  "name": "Eternal Shroud",
  "description": "Этот безупречный капюшон поглощает раздор, чтобы наполнить владельца силами.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}