{
  "abilities": [
    {
      "notes": [
        "Thunder Clap сначала применяет дебафф, затем наносит урон",
        "Повышение уровня способности, когда противники уже находятся под её воздействием, не обновит текущие показатели замедления"
      ],
      "item_behaviour": [],
      "description": "Сотрясает землю, нанося урон всем врагам в области действия, а также замедляя их атаки и передвижение.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,4",
        "Радиус: 400 ( 600)",
        "Урон: 90\/160\/230\/300",
        "Замедление скорости передвижения: 25%\/35%\/45%\/55%",
        "Замедление скорости атаки: 25\/35\/45\/55",
        "Длительность замедления: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Brewmaster_Thunder_Clap_1.mp3\/revision\/latest?cb=20191216011406",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "13",
      "aghanim": null,
      "name": "Thunder Clap",
      "cooldown": "90\/100\/110\/120",
      "legacy_key": "C",
      "story": "Коли Магникс бьёт своей крепкой бочкой оземь — значит, быть веселью."
    },
    {
      "notes": [
        "Снаряд Cinder Brew летит со скоростью 1600",
        "Несмотря на визуальный эффект, при достижении снарядом центра области Cinder Brew не применяется ко всем существам одновременно\n Вместо этого запускаются индивидуальные снаряды к каждому врагу в выбранной области\n Эти снаряды невидимы и их можно избежать\n Это значит, что Cinder Brew выбирает цели при применении, а не при достижении выбранной области\n Это также значит, что враги, вошедшие в область после применения, не будут подвергнуты эффектам заклинания, а враги, покинувшие её, будут всё еще под его воздействием",
        "Когда враги под действием дебаффа Cinder Brew получают любой урон от заклинаний (всех 3-х типов), то длительность дебаффа горения увеличивается на 3 и начинает наноситься урон\n Дебафф загорается лишь один раз\n Замедление продолжается после поджога\n Не взаимодействует с заклинаниями, наносящими отнимающий здоровье урон (например,  Poison Attack,  Heartstopper Aura и другие)",
        "Интервал урона основан на длительности дебаффа, поэтому он всегда срабатывает 8 раз\n Каждый интервал наносит 10\/20\/30\/40 ( 13\/26\/39\/52) урона",
        "Повторное применение на те же цели обновит длительность, но не сложит эффекты и не улучшит дебафф до текущего уровня способности\n Обновление на уже горящих целях обновит дебафф горения и не сбросит горение\n Интервал урона не обновляется при поджоге\n Значение интервалов фиксированное, поэтому способность продолжит наносить урон до завершения дебаффа",
        "Выбор  таланта «Горение от Cinder Brew накладывает страх» даёт способности возможность применить страх на противника, если тот загорелся\n Страх от Cinder Brew заставляет противников бежать к своему фонтану"
      ],
      "item_behaviour": [],
      "description": "Обливает себя и врагов в указанной области алкоголем, отчего они передвигаются медленнее и загораются, получив урон от любого заклинания. Время действия на загоревшегося врага продлевается на 3 сек. Под эффектом этой способности усиливаются стойки от способности Drunken Brawler.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 850",
        "Радиус: 400",
        "Замедление скорости передвижения: 24%\/28%\/32%\/36%",
        "Суммарный урон от горения: 80\/160\/240\/320 ( 104\/208\/312\/416)",
        "Длительность: 5 ( 6,5)",
        "Увеличение длительности горения: 3",
        "Длительность страха:  1,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Brewmaster_Cinder_Brew_1.mp3\/revision\/latest?cb=20191216011409",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов \/ Себя"
      ],
      "mana": "20\/17\/14\/11",
      "aghanim": null,
      "name": "Cinder Brew",
      "cooldown": "50\/60\/70\/80",
      "legacy_key": "D",
      "story": "Орден Ойо знает, как решить любую проблему — еще по одной!"
    },
    {
      "notes": [
        "При смене стоек прерывает произносимые заклинания Brewmaster",
        "Стойки меняются в следующей последовательности: Стойка бойца земли ➜ Стойка бойца шторма ➜ Стойка бойца огня ➜  Стойка бойца пустоты ➜ Стойка бойца земли",
        "Стойка бойца земли Даёт 3\/9\/15\/21 к броне и 15%\/30%\/45%\/60% к сопротивлению магии под действием  Cinder Brew\n Увеличивает общее сопротивление магии Brewmaster до 28,75%\/32,5%\/36,25%\/40%\n При действии Cinder Brew увеличивает общее сопротивление магии Brewmaster до 36,25%\/47,5%\/58,75%\/70%\n Сочетается с другими бонусами к сопротивлению магии по закону убывающей полезности",
        "Стойка бойца шторма Даёт 45%\/60%\/75%\/90% к уклонению и 15%\/30%\/45%\/60% к скорости передвижения под действием Cinder Brew\n Увеличивает выживаемость Brewmaster против атак на 18%\/25%\/33%\/43%\n При действии Cinder Brew увеличивает выживаемость Brewmaster против атак на 82%\/150%\/300%\/900%\n Сочетается с другими бонусами к уклонению по закону убывающей полезности\n Уклонение от Drunken Brawler использует псевдослучайное распределение",
        "Стойка бойца огня Даёт возможность нанести критический удар с шансом в 72% под действием Cinder Brew\n В среднем увеличивает урон от атак на 10,8%\/14,4%\/18%\/21,6%\n При действии Cinder Brew в среднем увеличивает урон от атак на 32,4%\/43,2%\/54%\/64,8%\n Выпадение критического удара определяется при начале атаке, а не при её попадании\n При срабатывании критической атаки Brewmaster использует особую анимацию критической атаки, а частицы эффекта появляются на его оружии\n Шансы срабатывания от нескольких источников критического удара сочетается\n Если два или больше источника критического удара срабатывают одновременно, то источник с наибольшим критическим уроном имеет приоритет\n Критический удар от Drunken Brawler использует псевдослучайное распределение",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Drunken Brawler добавляется  Стойка бойца пустоты\n Даёт 60% к сопротивлению эффектам и замедляет скорость передвижения атакуемых противников на 75% под действием  Cinder Brew\n Модификатор замедления на протифнике постоянно проверяет наличие эффекта Cinder Brew на Brewmaster и мгновенно обновляет значения\n Замедление от нескольких успешных атак не сочетается, но обновляет длительность\n Атака сначала наносит урон, затем применяет дебафф\n Работает против любых существ, включая варды, постройки и союзников\n Сочетается с другими источниками сопротивления эффектов по закону убывающей полезности",
        "Выбор  таланта «Воины получают эффекты Drunken Brawler» даёт каждому воину соответствующую ему стойку  Drunken Brawler текущего уровня"
      ],
      "item_behaviour": [],
      "description": "Герой может менять стойку в зависимости от элементов, которыми он управляет, и получать за это пассивные бонусы, усиливающиеся под действием способности Cinder Brew. Стойка бойца земли — даёт +1\/3\/5\/7 к броне и +5%\/10%\/15%\/20% к сопротивлению магии. Под эффектом Cinder Brew бонусы умножаются на 3. Стойка бойца шторма — даёт +15%\/20%\/25%\/30% к уклонению и +5%\/7%\/9%\/11% к скорости передвижения. Под эффектом Cinder Brew бонусы умножаются на 3. Стойка бойца огня — даёт шанс в 24% нанести критической атакой 145%\/160%\/175%\/190% урона. Под эффектом Cinder Brew шанс умножается на 3.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Бонус к броне от стойки бойца земли: 1\/3\/5\/7",
        "Бонус к сопротивлению магии от стойки бойца земли: 5%\/10%\/15%\/20%",
        "Бонус к уклонению от стойки бойца шторма: 15%\/20%\/25%\/30%",
        "Бонус к скорости передвижения от стойки бойца шторма: 5%\/7%\/9%\/11%",
        "Шанс критической атаки от стойки бойца огня: 24%",
        "Критической урон от стойки бойца огня: 145%\/160%\/175%\/190%",
        "Множитель от Cinder Brew: 3 ( 4)",
        "Бонус у сопротивлению эффектам от стойки бойца пустоты:  20%",
        "Замедление скорости передвижения от стойки бойца пустоты:  25%",
        "Длительность замедления от стойки бойца пустоты:  2"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9c\/Brewmaster_Drunken_Brawler_2.mp3\/revision\/latest?cb=20191216011348",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Drunken Brawler",
      "cooldown": "0",
      "legacy_key": "B",
      "story": "Получив титул Хмелевара ордена Ойо, Мангикс также доказал всем, что он мастер опьянения."
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter для разблокировки",
        "Призывает воина в зависимости от текущей стойки  Drunken Brawler, показатели которого основываются на текущем уровне\n  Primal Split\n Если одна из этих двух способностей не изучена, то при применении ничего не случится, а способность потратит ману и уйдёт на перезарядку\n Иконка способности также меняется при смене стойки Drunken Brawler\n Воин появляется на расстоянии 100 перед Brewmaster и смотрит в ту же сторону, что и герой",
        "Показатели уже призванного воина не обновляются при повышении уровня способности или получения",
        "Использование Primal Companion заменяет всех существующих воинов от предыдущего использования, создавая нового, основанного на текущем уровне Primal Split",
        "Воина нельзя перепризвать, если он получал атаку, основанную на геройском уроне, в последние секунды\n Не имеет минимального порога\n Урон проверяется до любых уменьшений, поэтому даже полностью заблокированная атака или атака, наносящая 0 урона, предотвратит возможность перепризыва",
        "Перезарядка способностей воинов сохраняется и не обновляется при перепризыве воинов любыми способами (например,  Primal Split)"
      ],
      "item_behaviour": [],
      "description": "Создаёт одного из воинов в зависимости от текущей стойки Drunken Brawler. Все способности воина перезаряжаются на 100% медленнее. Если воин окажется на расстоянии более 1600 от владельца, то не сможет применять способности и будет замедлен на 50%. Нового воина нельзя призвать, если существующий получал урон от врагов в последние 3 сек. Если воин умрёт, способность уйдёт на перезарядку в 70 сек. Одновременно может существовать только один воин. Он исчезнет, если применить способность Primal Split.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,3+0,03",
        "Штрафное расстояние: 1600",
        "Число воинов: 1",
        "Штрафное замедление скорости передвижения воинов: 50%",
        "Замедление перезарядки воинов: 100%",
        "Длительность: Постоянная"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "20\/70",
      "aghanim": null,
      "name": "Primal Companion",
      "cooldown": "50",
      "legacy_key": "V",
      "story": "Мангикс смутно припоминает размышления старого учителя о том, что раздобыть товарища всяко лучше, чем пить в одиночку. Но не то чтобы Хмелевар строго придерживается этого принципа."
    },
    {
      "notes": [
        "Brewmaster становится неуязвимым и исчезает во время применения заклинания и его длительности\n Не накладывает никакой формы развеивания",
        "Применение Primal Split перезаряжает все способности воинов",
        "Взаимодействия с Brewmaster во время действия Primal Split зависят от живого воина с самым высоким приоритетом\n Приоритет воинов от самого главного:  Воин земли ➜  Воин шторма ➜  Воин огня ➜   Воин пустоты\n Пока способность активна, Brewmaster периодически перемещается туда, где находится с самым высоким приоритетом\n Из этого следует еще несколько моментов: Когда Primal Split заканчивается, Brewmaster появляется на месте выжившего воина с самым высоким приоритетом\n Каждая аура, которая имеется у героя (включая  Gem of True Sight и  Radiance), работает в радиусе вокруг живого воина с самым высоким приоритетом Эффекты, реагирующие на присутствие героя ( Smoke of Deceit,  Marksmanship,  Blur) реагируют только на присутствие воина с самым высоким приоритетом\n Эффекты телепортации ( Holy Persuasion или  Relocate) заставляют периодическое перемещение Brewmaster прерваться, и в таком случае вышенаписанные примечания больше неприменимы",
        "Воины всегда появляются в одном и том же построении, образуя правильный треугольник ( квадрат), вписанный в окружность с радиусом в 100 единиц\n Все воины будут смотреть в ту же сторону, куда смотрел Brewmaster перед применением способности\n  Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster\n  Воин шторма всегда появляется на расстоянии в 50 позади и 86,603 левее Brewmaster,  Воин огня всегда появляется на расстоянии в 50 позади и 86,603 правее Brewmaster\n При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard воины будут появляться в построении, образуя квадрат, вписанный в окружность с радиусом ~141 единицу\n  Воин земли всегда появляется на расстоянии в 100 единиц перед тем местом, где стоял Brewmaster\n  Воин шторма всегда появляется на расстоянии в 100 единиц слева от того места, где стоял Brewmaster\n  Воин огня всегда появляется на расстоянии в 100 единиц справа от того места, где стоял Brewmaster\n  Воин пустоты всегда появляется на расстоянии в 100 единиц позади того места, где стоял Brewmaster",
        "Призванные воины — это древние крипы-герои, поэтому определенные заклинания взаимодействуют с ними иначе\n Для подробностей взаимодействия перейдите к соответствующим статьям",
        "Модификатор Void Strike на  воине пустоты не даёт никакого эффекта и не накладывает эффекты от атаки Brewmaster при атаке воина пустоты",
        "Перезарядка способностей воинов сохраняется и не обновляется при перепризыве воинов любыми способами (например,  Drunken Brawler)"
      ],
      "item_behaviour": [],
      "description": "Разделяет героя на трёх выносливых воинов-элементалей. Если хотя бы один из них доживёт до окончания действия способности, герой вернётся в свою прежнюю форму.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,65+0",
        "Время разделения: 0,6",
        "Длительность: 16\/18\/20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/bf\/Brewmaster_Primal_Split_1.mp3\/revision\/latest?cb=20210424152727",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя",
        "Урон: Мгновенное убийство"
      ],
      "mana": "140\/130\/120",
      "aghanim": null,
      "name": "Primal Split",
      "cooldown": "125\/150\/175",
      "legacy_key": "R",
      "story": "Не ясно, осознает ли Мангикс свою могучую связь с природой, ибо она чаще всего проявляется во время пьянки."
    },
    {
      "notes": [
        "Булыжник летит со скоростью 800",
        "Булыжник сначала применяет дебафф, затем наносит урон"
      ],
      "item_behaviour": [],
      "description": "Бросает булыжник, который наносит урон врагу и оглушает его.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,25+0,8",
        "Дальность применения: 800",
        "Урон: 50\/100\/150",
        "Длительность оглушения: 2",
        "Перезарядка у воина Primal Companion:  10"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Brewmaster_Earth_Hurl_Boulder_1.mp3\/revision\/latest?cb=20191216011351",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Hurl Boulder",
      "cooldown": null,
      "legacy_key": "D",
      "story": null
    },
    {
      "notes": null,
      "item_behaviour": [],
      "description": "Существо невосприимчиво к магии.",
      "hot_key": "?",
      "params": [],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Spell Immunity",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Бонусный урон от атаки по постройкам считается бонусным условным уроном от атаки\n Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он всё ещё учитывается и напрямую добавляется к урону от атаки воина земли\n Его можно уменьшить только прямыми снижениями (например, блокировкой урона)\n Так как урон считается бонусным уроном от атаки, то на него не влияют процентные бонусы или снижения урона от атаки"
      ],
      "item_behaviour": [],
      "description": "Существо наносит дополнительный урон постройкам.",
      "hot_key": "?",
      "params": [
        "Доп\n урон постройкам: 90\/180\/270"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Врагов",
        "Урон: Физический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Demolish",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Накладывает базовое развеивание на всех существ в радиусе действия",
        "Всегда развеивает  Cyclone воина шторма независимо от того, на врага или союзника действует способность\n Кроме того, способность следует стандартным правилам развеивания, снимая дебаффы с союзников и баффы с врагов",
        "Урон наносится существам, созданным способностями, включая иллюзии, но исключая клонов\n Не наносит урон  духу-медведю или  воинам Primal Split, но наносит урон  гаргулиям и  големам чернокнижника",
        "Действует на неуязвимых, но не на спрятанных существ"
      ],
      "item_behaviour": [],
      "description": "Очищает указанную область, нанося урон призванным существам и рассеивая большинство положительных и отрицательных эффектов. Тип развеивания: нормальное.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+0,93",
        "Дальность применения: 500",
        "Радиус: 600",
        "Урон призванным существам: 1000",
        "Перезарядка у воина Primal Companion:  8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a7\/Brewmaster_Storm_Dispel_Magic.mp3\/revision\/latest?cb=20191216011403",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "mana": "4",
      "aghanim": null,
      "name": "Dispel Magic",
      "cooldown": "75",
      "legacy_key": "D",
      "story": null
    },
    {
      "notes": [
        "Накладывает эффект урагана на цель при применении, то есть цель становится неуязвимой и полностью обезвреживается\n Не развеивает баффы цели",
        "Поднятые существа теряют свой размер столкновения на длительность, позволяя другим существам пройти под ними",
        "Можно применить на  Рошана, но это только прервет его на долю секунды и не повлияет на него"
      ],
      "item_behaviour": [],
      "description": "Закручивает врага в торнадо, временно поднимающее его над полем битвы.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,4+0,67",
        "Дальность применения: 600",
        "Длительность на героях: 6",
        "Длительность на крипах: 20",
        "Перезарядка у воина Primal Companion:  16"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8d\/Brewmaster_Storm_Cyclone.mp3\/revision\/latest?cb=20191216011402",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "8",
      "aghanim": null,
      "name": "Cyclone",
      "cooldown": "150",
      "legacy_key": "C",
      "story": null
    },
    {
      "notes": [
        "Не прерывает прерываемые способности при применении",
        "Во время задержки невидимости воин шторма может использовать способности и атаковать не выходя из невидимости\n И атака во времени до невидимости и атака снимающая невидимость наносят цели 140\/200\/260 бонусного условного урона от атаки\n Бонусный урон от атаки не применяется при атаке построек, но применяется против вардов\n Хотя значения бонусного урона от атаки не отображаются в интерфейсе, он всё ещё учитывается и напрямую добавляется к урону от атаки воина шторма\n Урон учитывается критическим ударом, вампиризмом и прорубанием и может быть уменьшен только прямыми снижениями (например, блокировкой урона)\n Так как урон считается бонусным уроном от атаки, то на него не влияют процентные бонусы или снижения урона от атаки",
        "Невидимость теряется, как только используется заклинание или выпущен снаряд атаки\n Таким образом, даже если атака промахнется, невидимость все равно будет утеряна",
        "Позволяет воину шторма проходить сквозь других существ, включая варды, но не постройки"
      ],
      "item_behaviour": [],
      "description": "Даёт временную невидимость. Пока воин невидим, он передвигается значительно быстрее. Атака, раскрывающая невидимость, нанесёт дополнительный урон.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0,6",
        "Доп\n скорость передвижения: 50%",
        "Урон: 140\/200\/260",
        "Длительность: 20",
        "Перезарядка у воина Primal Companion:  10"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/94\/Brewmaster_Storm_Wind_Walk.mp3\/revision\/latest?cb=20191216011405",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя \/ Врагов",
        "Урон: Физический"
      ],
      "mana": "5",
      "aghanim": null,
      "name": "Wind Walk",
      "cooldown": "75",
      "legacy_key": "W",
      "story": null
    },
    {
      "notes": [
        "Permanent Immolation это аура\n Эффект задерживается на 0,5 сек",
        "Наносит 12,5\/25\/37,5 урона в 0,5-секундных интервалах, начиная с 0,5 сек\n с момента наложения дебаффа",
        "Может нанести до 412,5\/925\/1537,5 урона одному существу (до снижений), если оно оставалось в пределах действия всю длительность"
      ],
      "item_behaviour": [],
      "description": "Обжигает врагов неподалёку.",
      "hot_key": "?",
      "params": [
        "Радиус: 220",
        "Урон в секунду: 25\/50\/75",
        "Длительность задержки ауры: 0,5"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Аура",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Permanent Immolation",
      "cooldown": null,
      "legacy_key": "",
      "story": null
    },
    {
      "notes": [
        "Несмотря на визуальные эффекты, мгновенно достигает всех врагов в радиусе поражения"
      ],
      "item_behaviour": [],
      "description": "Замедляет врагов вокруг и накладывает на них бессилие.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,15+0,95",
        "Радиус: 500",
        "Замедление скорости передвижения: 20%\/30%\/40%",
        "Длительность: 2,5",
        "Перезарядка у воина Primal Companion:  24"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b8\/Brewmaster_Void_Astral_Pulse.mp3\/revision\/latest?cb=20201223213602",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов"
      ],
      "mana": "12",
      "aghanim": null,
      "name": "Astral Pulse",
      "cooldown": "0",
      "legacy_key": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 23.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.0,
    "attrAgility": 19.0
  },
  "description": "Разделяется на трёх духов-элементалей с уникальными способностями. Грозный воитель Brewmaster способен изменить ход сражения, обернувшись тремя духами стихий с уникальными способностями, а в своей изначальной форме он погружает врагов в хмельной хаос замедляющими хлопками и могучими взмахами посоха.  Керри Инициация Стойкость Контроль Быстрый урон ★★★",
  "history": "Глубоко в Скулящих горах, в долине под Разрушенным городом древний орден Ойо веками упражнялся в ритуалах священного забытья, соединяясь с миром духов в грандиозных хмельных праздниках. Рождённый плотской матерью от отца-небожителя, молодой Мангикс стал первым, кто совместил в себе способности обоих родителей. Он занимался с величайшими эстетами Ордена, со временем заполучив прилежной нетрезвостью право соревноваться за титул Хмелевара — самого почётного звания во всей спиртотворческой касте мыслителей. Девять дней Мангикс сражался и пил до последнего — оба процесса были одинаково важны, — стараясь одолеть и перепить старшего мастера. Девять ночей они шатались и крутились, спотыкались и наносили удар за ударом — и так до тех пор, пока воин постарше наконец не свалился на землю в пьяном ступоре, а его соперника не нарекли новым Хмелеваром. Теперь новый, молодой Хмелевар взывает к силе прародителей ордена Ойо, дабы те благословили его посох. К своим предкам-небожителям он обращается, когда пользуется магией. И, подобно всем предыдущим Хмелеварам, его отправили в странствие с единственной целью: найти просвещение на дне кружки и разрешить древнюю духовную загадку; надумать ту самую мысль, что вновь воссоединит духовный и материальный миры."
}