{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Axe до 34%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+100 к урону в секунду от Battle Hunger",
          "talentRight": "+100 к радиусу Berserker's Call"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+20 здоровья в секунду",
          "talentRight": "+150 к здоровью для убийства у Culling Blade"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+30 к урону от Counter Helix",
          "talentRight": "+25 к скорости передвижения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+12% к сопротивлению магии",
          "talentRight": "+1,5 маны в секунду"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Berserker%27s_Call.mp3\/revision\/latest?cb=20150711193622",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя"
      ],
      "notes": [
        "Затронутые существа не могут использовать способности и предметы и вынуждены атаковать Axe. Юниты будут следовать и атаковать Axe вне зависимости от дистанции, обзора, препятствий и статуса. Затронутые существа все так же могут быть подвержены другим обезвреживаниям и не получают свободного передвижения.",
        "Юниты будут следовать и атаковать Axe вне зависимости от дистанции, обзора, препятствий и статуса.",
        "Затронутые существа все так же могут быть подвержены другим обезвреживаниям и не получают свободного передвижения.",
        "Если Axe станет невидимым во время провокации, затронутые существа начнут атаковать ближайшего к ним врага. Если рядом врагов нет, то они останутся на месте. В это время они могут получить один приказ, исполнением которого они займутся. Этот приказ уже не может быть отменен. Приказ может любым, включая использование способности или предмета, передвижение или атаку. После этого приказа юнит больше не может ничего делать и стоит на месте пока провокация не закончится. Правда если Axe снова станет видимым, существа вновь начнут его атаковать.",
        "Если рядом врагов нет, то они останутся на месте. В это время они могут получить один приказ, исполнением которого они займутся. Этот приказ уже не может быть отменен.",
        "Приказ может любым, включая использование способности или предмета, передвижение или атаку.",
        "После этого приказа юнит больше не может ничего делать и стоит на месте пока провокация не закончится. Правда если Axe снова станет видимым, существа вновь начнут его атаковать.",
        "Провокация имеет одинаковый приоритет с Winter's Curse, но меньший чем Duel. Одинаковый приоритет означает, что затронутые существа будут атаковать цель, которая первая использовала провокацию, и переключатся на другую цель, как только первая провокация завершилась.",
        "Одинаковый приоритет означает, что затронутые существа будут атаковать цель, которая первая использовала провокацию, и переключатся на другую цель, как только первая провокация завершилась.",
        "У провокации приоритет выше, чем у страха, при этом страх не дает существу атаковать цель.",
        "Действует на невидимых существ и существ в тумане войны. Не действует на башни, варды, неуязвимых и спрятанных юнитов.",
        "Повторное применение способности на цель, уже находящуюся под её действием, обновляет длительность.",
        "Если Axe умрет, эффект провокации мгновенно закончится.",
        "Не действует на первую волну линейных крипов до встречи с волной противника.",
        "С улучшением от Aghanim's Scepter, также применяет Battle Hunger на всех задетых врагов."
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "Q",
      "cooldown": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "description": "Герой бросает вызов ближайшим врагам, заставляя их атаковать его, а также получает бонус к броне на время действия способности.",
      "spellName": "Berserker's Call",
      "params": [
        "Анимация применения: 0,4+0,5",
        "Радиус: 300 (TagTalent 400)",
        "Дополнительная броня: 30",
        "Длительность: 2\/2,4\/2,8\/3,2",
        "Применяет на жертв эффект способности Battle Hunger. Уменьшает перезарядку способности на 3 секунды."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/dd\/Battle_Hunger.mp3\/revision\/latest?cb=20141127225902",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Уменьшает скорость передвижения крипов на 6%\/6,5%\/7%\/7,5% (и броню на 3,5). Считает крипов-героев за крипов.",
        "У способности присутствует скрытый статус, который всегда активен, но не виден игроку. Он не показывается до тех пор, пока количество эффектов равно 0. Этот статус дарует 1 эффект за каждого поражённого крипа (считает крипов-героев за крипов), и 2 эффекта за каждого поражённого героя. Каждый эффект дарует герою 6%\/6,5%\/7%\/7,5% скорости передвижения (и 3,5 брони). Это означает, что каждый задетый вражеский герой дарует вашему герою 12%\/13%\/14%\/15% скорости передвижения (и 7 брони). У этого статуса нет лимита эффектов.",
        "Этот статус дарует 1 эффект за каждого поражённого крипа (считает крипов-героев за крипов), и 2 эффекта за каждого поражённого героя.",
        "Каждый эффект дарует герою 6%\/6,5%\/7%\/7,5% скорости передвижения (и 3,5 брони).",
        "Это означает, что каждый задетый вражеский герой дарует вашему герою 12%\/13%\/14%\/15% скорости передвижения (и 7 брони).",
        "У этого статуса нет лимита эффектов.",
        "Повторное использование способности на одну и ту же цель только обновит длительность эффекта, никак не взаимодействуя иначе.",
        "Наносит урон каждую секунду спустя 1 секунду после применения, срабатывая до 12 раз.",
        "Может нанести до 192\/288\/384\/480 (TagTalent 1392\/1488\/1584\/1680) урона, (без учета снижений).",
        "Негативный эффект может быть снять при убийстве любого юнита, если он не является иллюзией, в любом случае. Также снимает негативный эффект при уничтожении постройки, варда и при добивании союзника. Чтобы избавиться от негативного эффекта, подверженные существа должны совершить убийство сами. Призываемые существа или иллюзии под контролем того же игрока не избавляют от эффекта, если они совершат убийство. Использование способностей Devour, Demonic Conversion или способности Hand of Midas так же убирает негативный эффект.",
        "Чтобы избавиться от негативного эффекта, подверженные существа должны совершить убийство сами. Призываемые существа или иллюзии под контролем того же игрока не избавляют от эффекта, если они совершат убийство.",
        "Использование способностей Devour, Demonic Conversion или способности Hand of Midas так же убирает негативный эффект.",
        "Повышение уровня способности не повысит урон от уже наложенного эффекта. Однако изучение таланта, повышающего урон способности, мгновенно обновляет значение урона на всех активных эффектах.",
        "Однако изучение таланта, повышающего урон способности, мгновенно обновляет значение урона на всех активных эффектах."
      ],
      "mana": "50\/60\/70\/80",
      "hotKey": "W",
      "cooldown": "20\/15\/10\/5",
      "description": "Приводит врага в бешенство, замедляя его и нанося ему урон, пока он кого-нибудь не убьёт или действие способности не закончится. Герой получает бонус к скорости передвижения за каждое существо под воздействием этой способности, но от крипов бонус в два раза меньше.",
      "spellName": "Battle Hunger",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 700\/775\/850\/925",
        "Урон в секунду: 16\/24\/32\/40 (TagTalent 116\/124\/132\/140)",
        "Замедление скорости передвижения: 12%\/13%\/14%\/15%",
        "Дополнительная скорость герою: 12%\/13%\/14%\/15%",
        "Множитель за крипов: 0,5",
        "Длительность: 12",
        "Снижение брони цели: 7",
        "Дополнительная броня за героя: 7",
        "Уменьшает броню жертв на , а владелец способности получает брони за каждого героя под её действием (TagAghanimвдвое меньше за крипов).",
        "Замедление сохраняется, и способность пытается нанести урон, если эффект был наложен до иммунитета к заклинаниям и не был развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Counter_Helix.mp3\/revision\/latest?cb=20141127225921",
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Срабатывает только когда вражеское существо успешно завершает атаку на Axe вне зависимости от расстояния. Таким образом не срабатывает, если атака промахнется.",
        "Не срабатывает при вторичных атаках от Moon Glaives, Death Ward, Split Shot и Flak Cannon.",
        "Срабатывает при вторичных атаках от других мгновенных атак.",
        "Не срабатывает при атаках строений, вардов и союзников.",
        "Несмотря на визуальные эффекты, урон в радиусе наносится моментально.",
        "Counter Helix использует псевдослучайное распределение.",
        "Counter Helix использует нестандартную перезарядку. Ее время не показывается на иконке способности и не подвергается эффектам манипуляции временем перезарядки.",
        "С улучшением от Aghanim's Shard, герой накладывает на врагов эффект, уменьшающий их урон от атак. Этот эффект может складываться до 5 раз. Максимальное снижение урона от атак — 100%. Наложение нового эффекта обновит длительность предыдущих. Снижение урона действует весь урон от атак, включая основной и дополнительный и исключая модификаторы атаки.",
        "Этот эффект может складываться до 5 раз. Максимальное снижение урона от атак — 100%.",
        "Наложение нового эффекта обновит длительность предыдущих.",
        "Снижение урона действует весь урон от атак, включая основной и дополнительный и исключая модификаторы атаки."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой отвечает на удары противников, нанося чистый урон всем врагам вокруг себя.",
      "spellName": "Counter Helix",
      "params": [
        "Радиус: 275",
        "Шанс контратаки: 17%\/18%\/19%\/20% (TagTalent 27%\/28%\/29%\/30%)",
        "Урон: 60\/100\/140\/180 (TagTalent 90\/130\/170\/210) (TagTalent 5%)",
        "Снижение урона от атак: 20%",
        "Длительность снижения: 6",
        "Каждое срабатывание Counter Helix применяет на жертв складывающийся эффект, уменьшающий их урон от атак на 20%. Также увеличивает шанс контратаки на 5%.",
        "Если истощение было наложено атакой, то способность может сработать до отключения способности.",
        "Иллюзии героя имеют данную способность."
      ],
      "itemBehaviour": [],
      "legacyKey": "X",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/58\/Culling_Blade_fail.mp3\/revision\/latest?cb=20150928211930",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов \/ Союзников",
        "Урон Магический \/ Мгновенное убийство"
      ],
      "notes": [
        "Если уровень здоровья цели выше порога способности, наносится только обычный урон (магический) и проигрывается другой звук. Даже если цель умрет от этого урона (возможно с эффектами манипуляции урона), другие эффекты Culling Blade не накладываются.",
        "Даже если цель умрет от этого урона (возможно с эффектами манипуляции урона), другие эффекты Culling Blade не накладываются.",
        "Когда уровень здоровья цели ниже порога, происходит следующее: Наносится количество урона, равное количеству здоровья цели, в форме чистого урона (с пометкой отнимающий здоровье). Герой и близстоящие союзники получают бонус к скорости передвижения. Если целью был герой, клон или иллюзия, то перезарядка способности сбрасывается.",
        "Наносится количество урона, равное количеству здоровья цели, в форме чистого урона (с пометкой отнимающий здоровье).",
        "Герой и близстоящие союзники получают бонус к скорости передвижения.",
        "Если целью был герой, клон или иллюзия, то перезарядка способности сбрасывается.",
        "Уровень здоровья цели проверяется в момент окончания времени применения, так что если уровень здоровья поднялся выше порога за это время, мгновенного убийства не будет.",
        "Если уровень здоровья цели ниже порога, Culling Blade может разрубить цель под действием Shallow Grave, False Promise, Borrowed Time и Battle Trance, но не в форме призраков от Reincarnation.",
        "Скрытый статус Culling Blade Jungle Weapon Gesture используется предметом Fists of Axe Unleashed и является ответственным за звук и анимацию."
      ],
      "mana": "60\/120\/180",
      "hotKey": "R",
      "cooldown": "75\/65\/55",
      "description": "Герой кидается на ослабшего противника, мгновенно убивая цель, если у неё низкий уровень здоровья. В ином случае удар нанесёт лишь небольшой урон. Герой и его союзники поблизости получат дополнительную скорость, а способность мгновенно восстановится, если ей убить вражеского героя.",
      "spellName": "Culling Blade",
      "params": [
        "Анимация применения: 0,3+0,5",
        "Дальность применения: 150",
        "Радиус ускорения: 900",
        "Урон: 150\/250\/300",
        "Порог здоровья для убийства: 250\/350\/450 (TagTalent 400\/500\/600)",
        "Доп. скорость передвижения: 30%",
        "Доп. скорость атаки: 30",
        "Длительность ускорения: 6"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.4,
    "attrStrength": 25.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 2.2,
    "attrAgility": 20.0
  },
  "description": "Axe, или Могул Хан – это герой с ближним типом атаки, основным атрибутом которого является сила. Герой известен тем, что создает хаос в битве и процветает за счет этого. Axe обычно используется как инициатор, так как его мощные обезвреживания могут нарушить построение врага и дать его команде возможности для вступления в бой. Стиль боя требует, чтобы он подошел близко к врагам, так как Axe может заставить их атаковать его с помощью Berserker's Call, не позволяя вступление в бой против его союзников и предоставляя герою огромное количество бонусной брони. Как только он привлечет внимание врага, Axe может противостоять тем, кто наносит ему удары, с помощью отлично охватывающей Counter Helix, которая рубит всех врагов на расстоянии ближнего боя чистым уроном. У героя также есть длительные периодический урон и замедление скорости передвижения целей в виде Battle Hunger, которые могут мешать врагам или заставлять их вступать в битву, в то же время увеличивая скорость передвижения Axe. Наконец, у него есть возможность безоговорочно удалять ослабленных врагов с поля битвы, если они находятся ниже определенного порога здоровья, используя Culling Blade и одновременно увеличивая скорость передвижения и атаки своих союзников. Axe это кровожадный и неукротимый воин, присутствие которого на поле боя ощущается как другом, так и врагом. Герой привлекает внимание врага, куда бы он ни направился.",
  "history": "Ещё будучи рядовым бугаем в армии Красного тумана, Могул Хан положил глаз на генеральский титул. Битву за битвой он самыми кровавыми способами доказывал собственное превосходство. Облегчало подъём в чинах и то, что без тени сомнения он мог обезглавить старшего по званию. В семилетней кампании на Тысячеболотье Могул Хан отличился в кровопролитных бойнях, и звезда его славы засияла еще ярче, но число соратников неизменно сокращалось. В ночь безоговорочной победы он провозгласил себя генералом Красного тумана, присвоив себе заодно и титул верховного военачальника. Однако теперь в его отряде не значилось ни одного воина. Множество бойцов было повержено врагом, но и от его топора погибло достаточно. Стоит ли говорить, что большинство солдат теперь ни за что не переманить под его знамена? Но Могул Хана это совсем не смущает, ведь он знает: один в поле воин.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+100 к урону в секунду от Battle Hunger",
      "talentRight": "+100 к радиусу Berserker's Call"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+20 здоровья в секунду",
      "talentRight": "+150 к здоровью для убийства у Culling Blade"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+30 к урону от Counter Helix",
      "talentRight": "+25 к скорости передвижения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+12% к сопротивлению магии",
      "talentRight": "+1,5 маны в секунду"
    }
  ]
}