{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/88\/Tumbler%27s_Toy_Vault.mp3\/revision\/latest?cb=20210829215114",
      "effects": [
        "Дальность толчка: 300",
        "Перезарядка при получении урона: 3"
      ],
      "notes": [
        "При применении прерывает произносимые способности заклинателя.",
        "Толкает со скоростью в 1300 единиц за 0,23 секунды.",
        "Всегда толкает в направлении взгляда использовавшего. Закрепляет угол взгляда использовавшего во время толчка.",
        "Может толкать через других существ и непроходимый ландшафт.",
        "Во время толчка, использовавший предмет может атаковать, использовать предметы и применять способности, кроме повторного применения Vault. Тем не менее, использовавший не может поворачиваться, так что направленные способности и предметы можно применять только в направлении взгляда.",
        "Тем не менее, использовавший не может поворачиваться, так что направленные способности и предметы можно применять только в направлении взгляда.",
        "Урон свыше 0 от игрока (включая союзников, исключая себя) или Рошана устанавливает перезарядку Tumbler's Toy на 3 секунды. Перезарядка от урона срабатывает всегда, даже если предмет был выброшен на землю или ещё не выпал из нейтрального крипа. Так как это перезарядка, а не отключение, то Tumbler's Toy можно перезарядить при помощи Refresher Orb, Refresher Shard и Rearm. Однако, на перезарядку не влияют процентные уменьшения перезарядки. Не уходит на перезарядку от урона с пометкой «отнимающий здоровье».",
        "Перезарядка от урона срабатывает всегда, даже если предмет был выброшен на землю или ещё не выпал из нейтрального крипа.",
        "Так как это перезарядка, а не отключение, то Tumbler's Toy можно перезарядить при помощи Refresher Orb, Refresher Shard и Rearm.",
        "Однако, на перезарядку не влияют процентные уменьшения перезарядки.",
        "Не уходит на перезарядку от урона с пометкой «отнимающий здоровье»."
      ],
      "mana": "0",
      "abilityName": "Vault",
      "cooldown": "15",
      "description": "Толкает владельца вперёд на 300 единиц. Нельзя использовать, если в последние 3 секунды владелец получал урон от игрока.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Tumbler's Toy",
  "description": "Античная безделушка, найденная в руинах ярмарки Озенья.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}