{
  "abilities": [
    {
      "notes": [
        "The armor talent does not benefit illusions."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+1s Hoof Stomp Duration",
          "talentRight": "Gains Retaliate Aura"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-20s Stampede Cooldown",
          "talentRight": "+50 Retaliate Damage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+40% Double Edge Strength Damage",
          "talentRight": "+5 Armor"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 Movement Speed",
          "talentRight": "+5 Health Regen"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Centaur_Warrunner_Hoof_Stomp.mp3\/revision\/latest?cb=20191216011917",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Hoof Stomp first applies the debuff, then the damage."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "Q",
      "cooldown": "18\/16\/14\/12",
      "description": "Slams the ground, stunning and damaging nearby enemy units.",
      "spellName": "Hoof Stomp",
      "params": [
        "Cast Animation: 0.5+0.3",
        "Radius: 330",
        "Damage: 100\/150\/200\/250",
        "Stun Duration: 1.6\/1.9\/2.2\/2.5 (TagTalent 2.6\/2.9\/3.2\/3.5)"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "When the mighty hoof of the Warrunner touches soil, the tremors are felt far and wide."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6d\/Centaur_Warrunner_Double_Edge.mp3\/revision\/latest?cb=20191216011916",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self",
        "Damage Magical"
      ],
      "notes": [
        "Double Edge deals magical damage to the targets and to the caster.",
        "The damage radius is centered around the target, not around Centaur.",
        "Double Edge first damages the enemies within the area (at a random order), and then the caster.",
        "The self-inflicted damage is never lethal, so it cannot be used to deny oneself.",
        "With Aghanim's Shard, the strength bonus is only gained when hitting heroes (including clones, excluding illusions and creep-heroes). Each hit enemy hero increases its stack count and refreshes the duration of the entire stack. Increases the total amount of strength (base and bonus) by 15%\/30%\/45%\/60%\/75% with each amount of stacks. Double Edge first applies the slow debuff before applying its damage. The strength buff is applied after the first enemy got debuffed and damaged, and before the remaining enemies. However, Double Edge's damage is set upon cast, before any of its effects are applied, so that the strength bonus does not affect the damage.",
        "Each hit enemy hero increases its stack count and refreshes the duration of the entire stack.",
        "Increases the total amount of strength (base and bonus) by 15%\/30%\/45%\/60%\/75% with each amount of stacks.",
        "Double Edge first applies the slow debuff before applying its damage.",
        "The strength buff is applied after the first enemy got debuffed and damaged, and before the remaining enemies.",
        "However, Double Edge's damage is set upon cast, before any of its effects are applied, so that the strength bonus does not affect the damage."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Centaur strikes a mighty blow at melee range, damaging both himself and a small area around the target. Deals extra damage based on your strength. Centaur cannot die from Double Edge.",
      "spellName": "Double Edge",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range: 150",
        "Damage Radius: 190",
        "Base Damage: 120\/180\/240\/300",
        "Strength as Damage: 60%\/80%\/100%\/120% (TagTalent 100%\/120%\/140%\/160%)",
        "Max Stacks: 5",
        "Strength Bonus per Stack: 15%",
        "Move Speed Slow: 25%",
        "Slow Duration: 2",
        "Buff Duration: 15",
        "Causes Double Edge to increase Centaur's strength by 15% per hero hit for 15 seconds. Duration refreshes per stack. Max 5 stacks. Slows enemies by 25% for 2 seconds.",
        "Blocked fully only when primary target. When blocked, Centaur Warrunner takes no damage either."
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": "In the spurs of combat, Bradwarden's vicious strikes sometimes cause self-inflicted collateral damage."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/45\/Centaur_Warrunner_Retaliate_1.mp3\/revision\/latest?cb=20191216011907",
      "effects": [
        "Ability Passive (TagAghanim Aura)",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Retaliate only triggers when a unit lands an attack, regardless of distance. This means it cannot trigger on missed attacks.",
        "The Retaliate damage is always dealt right before the attacker's damage is dealt to its target.",
        "Secondary attacks from Moon Glaives, Split Shot and Flak Cannon do not trigger Retaliate before choosing the aura talent. However, the secondary attacks from other instant attacks do trigger Retaliate.",
        "However, the secondary attacks from other instant attacks do trigger Retaliate.",
        "Does not proc on the attacks from wards and Undying Zombies. Procs on the attacks of buildings.",
        "Fully works against allied units, resulting in a deny if the damage kills the ally.",
        "Retaliate is an aura by default, but affects Centaur Warrunner only, until the talent is chosen. The buff is not visible on self. With the level 25 talent, the aura starts affecting heroes and creep-heroes. Other units are not affected. Affects invulnerable allies, but not hidden allies. The aura's buff lingers for 0.5 seconds.",
        "With the level 25 talent, the aura starts affecting heroes and creep-heroes. Other units are not affected.",
        "Affects invulnerable allies, but not hidden allies.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Centaur counters all attacks, dealing damage back to the attacker. Returns a fixed amount plus a percentage based on your strength. Deals half damage to towers.",
      "spellName": "Retaliate",
      "params": [
        "Base Retaliate Damage: 15\/30\/45\/60 (TagTalent 65\/80\/95\/110)",
        "Strength as Bonus Retaliate Damage: 20%\/26%\/32%\/38%",
        "Aura Linger Duration: 0.5",
        "Aura Radius: 1200",
        "If Break is applied by an attack, Retaliate first triggers on that attack before getting disabled.",
        "Retaliate does not work for illusions. Illusions bestow the Retaliate aura."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Bradwarden has no need to parry his opponent's attacks; his armor-like hide does it for him."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f3\/Centaur_Warrunner_Stampede_1.mp3\/revision\/latest?cb=20191216011910",
      "effects": [
        "Ability No Target",
        "Affects Allies \/ Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Interrupts Centaur Warrunner's channeling abilities upon cast.",
        "Affects every player-controlled allied unit, except for Couriers, wards, buildings, and Haunt-based illusions.",
        "Affected allies become phased and hasted, meaning they cannot be slowed below the hasted value.",
        "Checks Centaur Warrunner's strength whenever trampling an enemy, so it adapts immediately. However, the strength as damage multiplier is set on cast and does not adapt when leveling the ability while its active.",
        "However, the strength as damage multiplier is set on cast and does not adapt when leveling the ability while its active.",
        "Stampede first applies the damage, then the debuff.",
        "The damage is sourced to each buffed ally, meaning certain on-damage effects react to the buffed ally rather than to Centaur Warrunner (e.g. Blade Mail).",
        "The sound effect is global and can be heard by enemies even through the Fog of War.",
        "With Aghanim's Scepter, Stampede provides unobstructed movement that allows allies to walk over cliffs and causes them to destroy trees around them for the duration. Does not destroy trees around allies who have the perch modifier from Tree Dance, meaning allies sitting on trees do not get their trees destroyed by themselves. It also applies generic incoming damage reduction on the allies. Stacks additively with other sources of generic incoming damage manipulation. The reduction affects all damage the allies take that is not flagged as HP removal.",
        "Does not destroy trees around allies who have the perch modifier from Tree Dance, meaning allies sitting on trees do not get their trees destroyed by themselves.",
        "It also applies generic incoming damage reduction on the allies. Stacks additively with other sources of generic incoming damage manipulation.",
        "The reduction affects all damage the allies take that is not flagged as HP removal."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "100 (TagTalent 80)",
      "description": "Centaur leads all allies into a vicious charge causing them to move through units at max speed and stop any enemy units they trample. Trampled enemies take damage based on Centaur Warrunner's strength. Each enemy can be trampled once.",
      "spellName": "Stampede",
      "params": [
        "Cast Animation: 0+0",
        "Damage & Slow Radius: 105",
        "Strength as Damage: 175%\/250%\/325%",
        "Haste Speed: 550",
        "Move Speed Slow: 100%",
        "Slow Duration: 2.5",
        "Stampede Duration: 3.5\/4\/4.5 (TagAghanim 4.5\/5\/5.5)",
        "Ally Incoming Damage Reduction: 40%",
        "Heroes affected by Stampede take reduced damage, and are able to run through obstructions, including trees and up cliffs. Increases duration by 1 second.",
        "Affects spell immune allies. Does not affect spell immune enemies. Slow persists if debuff was placed before spell immunity and was not dispelled."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "The great belt of Omexe, which labels Bradwarden as the greatest warrior of his kind, incites his fellow gladiators to follow him into barbarous combat."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 4.6,
    "attrStrength": 27.0,
    "attrIntelligence": 15.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.0,
    "attrAgility": 15.0
  },
  "description": "Bradwarden, the Centaur Warrunner, is a melee strength hero whose natural place in combat is right in the center of battle. His abilities stop enemies around him in their tracks and inflict heavy damage, making him an excellent initiator. He is also a powerful tank, having the highest strength gain in the game.",
  "history": "It's said that a centaur's road is paved with the corpses of the fallen. For the one called Warrunner, it has been a long road indeed. To outsiders, the four-legged clans of Druud are often mistaken for simple, brutish creatures. Their language has no written form; their culture lacks pictographic traditions, structured music, formalized religion. For centaurs, combat is the perfect articulation of thought, the highest expression of self. If killing is an art among centaurs, then Bradwarden the Warrunner is their greatest artist. He rose to dominance on the proving grounds of Omexe, an ancient arena where centaur clans have for millennia gathered to perform their gladiatorial rites. As his fame spread, spectators came from far and wide to see the great centaur in action. Always the first to step into the arena, and the last to leave, he composes a masterpiece in each guttering spray, each thrust of blood-slickened blade-length. It is the poetry of blood on steel, flung in complex patterns across the pale sands of the killing floor. Warrunner defeated warrior after warrior, until the arena boomed with the cheering of his name, and he found himself alone, the uncontested champion of his kind. The great belt of Omexe was bestowed, wrapped around his broad torso, but in his victory, the death-artist found only emptiness. For what is a warrior without a challenge? The great centaur galloped out of Omexe that day with a new goal. To his people, Warrunner is the greatest warrior to ever step into the arena. Now he has set out to prove he is the greatest fighter who has ever lived.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+1s Hoof Stomp Duration",
      "talentRight": "Gains Retaliate Aura"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-20s Stampede Cooldown",
      "talentRight": "+50 Retaliate Damage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+40% Double Edge Strength Damage",
      "talentRight": "+5 Armor"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 Movement Speed",
      "talentRight": "+5 Health Regen"
    }
  ]
}