{"abilities":[{"spell":"Weaver выпускает рой из 12 жуков, которые цепляются за любого врага на своем пути, атакуя и снижая его броню до тех пор, пока не будут убиты.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Физический"],"notes":["The Swarm движется со скоростью в 600 единиц, достигая за 5 секунд максимальной дистанции.","Жуков нельзя атаковать в рое, пока они не зацепятся за цели.","У жуков наивысший приоритет для цели автоатаки — как и у фантома Grimstroke.","Жуки появляются в радиусе 300 единиц от Weaver (в случайном месте) и движутся вперед роем.","Когда вражеский юнит находится в радиусе 100 единиц от жуков, один из них цепляется за юнита, если на нем его ещё нет. То есть несколько применений не могут действовать на одного и того же юнита одновременно. Жуки могут цепляться за неуязвимых юнитов, но не за невидимых или спрятанных. Если цель жука спряталась после его зацепления, то жук все равно останется. Если цель жука стала невидимой после его зацепления, то жук мгновенно умрет (смерть никому не зачтется), если только юнит не находится под действием True Sight. Когда жуки находятся под действием Chronosphere, то они мгновенно умирают и их смерть никому не засчитывается.","Жуки могут цепляться за юнитов на расстоянии до 3400 единиц (складывается из радиуса появления, дистанции прохождения и радиуса цепляния).","В зацепленном состоянии жуки всегда находятся в 64 единицах перед юнитом.","Жуки не атакуют цели, а применяют к ним заклинание, наносящее урон с установленным интервалом. То есть источником урона является сам Weaver, поэтому на урон действует усиление урона заклинаний и вампиризм заклинаний.","Снижение брони применяется отдельно от урона. Жуки продолжают снижать урон целям в призрачной форме, но не неуязвимым целям. Снижение брони применяется непосредственно жуками, поэтому оно исчезает вместе с их смертью.","Жук атакует цель каждые 1.25\/1.1\/0.95\/0.8 секунды сразу после зацепления за юнита, атакуя 13\/15\/17\/21 раз.","Снижение брони применяется с тем же интервалом, что и урон, но применяется до нанесения урона.","The Swarm может нанести до 182\/240\/306\/420 единиц урона каждому задетому врагу (до учета сопротивления).","Может снизить до 13\/15\/17\/21 ( 19.5\/22.5\/25.5\/31.5) единиц брони каждому юниту.","Урон от The Swarm может быть снижен блокировкой урона, но способность игнорирует уклонение.","Жуки дают летающий обзор, пока движутся по прямой и когда зацеплены за юнита."],"mana":"110","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"44\/36\/28\/20","name":"The Swarm","description":["Анимация применения: 0,3+0","Дальность применения: 3000","Дистанция прохождения: 3000","Радиус появления жуков: 300","Радиус цепляния жуков: 100","Количество жуков: 12","Ударов героев для убийства: 4 ( 6)","Ударов не-героев для убийства: 8 ( 12)","Интервал урона: 1.25\/1.1\/0.95\/0.8","Урона за интервал: 14\/16\/18\/20","Снижение брони за атаку: 1 ( 1.5)","Длительность: 16"],"hot_key":"Q","legacy_key":"R"},{"spell":"Weaver уходит из зоны видимости, что позволяет ему проходить через юнитов с увеличенной скоростью, игнорируя ограничения на ее максимум. Врагам, через которых он проходит, наносится урон.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["При использовании Shukuchi не прерывает произносимые способности Weaver.","Невидимость позволяет избегать снаряды, если враги не обладают эффектом True Sight.","Наносит урон каждому юниту только единожды.","Применяет к Weaver ускорение, поэтому его нельзя замедлить ниже установленного значения.","Во время ухода в невидимость Weaver может использовать способности и предметы и начинать атаки без выхода из невидимости.","Невидимость прерывается при достижении точки применения заклинаниями или предметами или атакой цели.","Позволяет Weaver проходить сквозь других юнитов, включая варды, но исключая строения.","В отличии от других способностей невидимости, позволяющих проходить сквозь юнитов, Shukuchi дает возможность Weaver мгновенно проходить через них без ожидания завершения ухода в невидимость.","Weaver может поднимать или выкидывать предметы без выхода из невидимости.","Если талант 25-го уровня был выбран пока действует Shukuchi, то дополнительная скорость передвижение применится мгновенно."],"mana":"70","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"12\/10\/8\/6","name":"Shukuchi","description":["Анимация применения: 0+0","Время до невидимости: 0,25","Радиус урона: 175","Урон: 100\/125\/150\/175 ( 114\/139\/164\/189)","Дополнительная скорость передвижения: 225 ( 425)","Длительность: 4"],"hot_key":"W","legacy_key":"C"},{"spell":"Позволяет Weaver атаковать противника дважды.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Позволяет Weaver совершить мгновенную атаку по цели спустя 0,25 секунды после попадания атаки. То есть дополнительная атака - это обычная атака, использующая скорость полета снаряда от атаки Weaver в 900 единиц. Также на неё могут сработать, как и на обычную атаку, любые модификаторы атаки или любые эффекты, срабатывающие при атаке. Если Weaver ослеплен, дополнительная атака может промахнутся, кроме случая, когда у него есть эффект точности. Также удары могут промахнутся из-за уклонения. Мгновенные атаки Geminate Attack не выводят из невидимости от Smoke of Deceit.","Дополнительная атака автоматически запускается спустя 0,25 секунды после попадания основной атаки. Не имеет значения, промахнулась ли основная атака или нет. Для второй атаки нет лимита по дальности. Если цель удалилась достаточно далеко до запуска дополнительной атаки, то она все равно запустится. Даже если основная атака убила цель до срабатывания дополнительной, вторая атака выберет в качестве цели мертвого юнита.","Работает на вражеские строения, курьера и варды, за исключением Варды."],"mana":"0","elements":["Не может использоваться иллюзиями.","Можно избежать.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"9\/7\/5\/3","name":"Geminate Attack","description":["Задержка: 0,25","Количество дополнительных атак: 1 ( 2)","Доп. урон: 10\/25\/40\/55"],"hot_key":"E","legacy_key":"K"},{"spell":"Герой возвращается в положение, в котором он был пять секунд назад, возвращая уровень здоровья и маны на былой уровень. Не действует на перезарядку способностей и предметов, а также золото и опыт.","effects":["Способность Ненаправленная ( Направленная на юнита)","Действует на Себя ( Союзных героев)"],"notes":["При использовании Time Lapse позволяет избегать снаряды и применяет сильное развеивание.","Weaver получает приказ на отмену действий после возвращения. При этом очередь команд не отменяется.","Влияет только на местоположение, здоровье, ману и дебаффы Weaver. Баффы не снимаются.","Не важно, насколько долго на Weaver действовали дебаффы, они полностью снимутся, если их можно снять.","Time Lapse не наносит урон Weaver, а совершает манипуляции с его здоровьем. Также способность не взаимодействует с любыми эффектами, срабатывающими от урона.","При использовании сразу после возрождения здоровье, мана и местоположение героя устанавливаются на тот уровень, который был до его смерти. То есть Time Lapse не убивает применившего, если способность использовали сразу после возрождения.","С Aghanim's Scepter Time Lapse становится заклинанием, направленным на юнитов, которым можно выбирать союзных героев. Двойное нажатие на способность с Aghanim's Scepter автоматически применит её к Weaver. Применяет к союзной цели сильное развеивание и позволяет избежать снаряды. Не приказывает цели отменять её действия, поэтому произносимые способности не прерываются. Поэтому у улучшенной способности есть время после применения. При использовании на союзника, который только возродился, его здоровье, мана и местоположение не возвращается к тем, что были до смерти. То есть союзника нельзя отправить, в отличии от Weaver, обратно к месту смерти после возрождения."],"mana":"150\/75\/0","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"70\/55\/40 ( 16)","name":"Time Lapse","description":["Анимация применения: 0,3+0 ( 0,3+0,53)","Дальность применения: 0 ( 1000)","Возвращаемое время: 5"],"hot_key":"R","legacy_key":"T"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Добавляет к атакам Weaver эффект сжигания маны, позволяя её атакам выжигать ману цели и наносить урон, основанный на сожженой мане.","Урон добавляется к урону от атак Weaver.","Weaver может получать лечение от вампиризма с урона, наносимого сжиганием маны, но этот урон не может быть критическим.","Урон можно снизить с помощью Enfeeble или Static Link. При этом его нельзя увеличить с помощью Empower или Руна двойного урона.","В среднем усиливает урон Weaver на 16, если у юнита достаточно маны для выжигания. В среднем усиливает урон иллюзий Weaver на 8, если у юнита достаточно маны для выжигания.","Сначала выжигает ману, затем наносит урон.","Не работает при атаке союзных юнитов.","Полностью сочитается с другими источниками сжигания маны."],"mana":"0","elements":["Может использоваться иллюзиями.","Не отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Сожжение маны","description":["Сжигает маны за удар: 20","Иллюзии сжигают ману за удар: 10","Урон от сожженной маны: 80%"]}],"bio":"Ткани мироздания требуется постоянный уход, дабы она не износилась; ибо стоит ей порваться, разойдутся по швам целые миры. Для того и существуют ткачи: они укрепляют материю и зашивают прорехи в узоре реальности — а ещё защищают её от существ, что разгрызают ткань и откладывают в ней яйца, дабы молодняк поглотил вселенную, коли наблюдатели отвлекутся хоть ненадолго. Ткач по имени Скитскурр, мастер своего дела, следил за небольшим участком мироздания и не давал ему растянуться и износиться. Но такой труд не приносил радости. Ему не давало покоя, что вселенная уже давно сплетена; долг ткачей был исполнен, и они двинулись дальше. Скитскурр хотел не поддерживать миры, а плести их в своё удовольствие, и потому стал аккуратно изменять свои владения. Но процесс создания оказался слишком захватывающим, и действия Скитскурра стали слишком смелыми: он стал тянуть нити против узора, что выстроили другие ткачи. Тут же явились стражи и отсекли неугодный мир от космического гобелена, а прореху зашили. Скитскурр оказался совсем один, вдали от своего рода, и такое наказание стало бы страшной пыткой для любого ткача. Но он возрадовался, ведь наконец обрёл свободу. Теперь он мог творить лишь для себя, мог начать что-то новое. В его лапках было всё, что нужно для создания собственного бытия, и ему осталось лишь разорвать наш мир по швам.","talentsTips":["Талант на силу в общем даёт Weaver: 280 здоровья, 1,4 регенерации здоровья и 1,12% сопротивления магии."],"trivia":["Оригинальное имя Weaver было Nerubian Weaver, расы Неруба из вселенной Warcraft, и звали его Ануб'сэран. Также, во вселенной Warcraft, бывший предводитель расы Неруба - Ануб'арак. Ануб'арак в Dota 2 - Nyx Assassin. В оригинальной DotA его звали \"Nerubian Assassin\". Его также называют Король-Предатель (назван так выжившими нерубами).","Иконка Time Lapse возможно является отсылкой к постеру фильма \"Чужой 3\""],"talents":["+1 атака от Geminate Attack:+200 к скорости передвижения от Shukuchi","+2 атаки для убийства жука от The Swarm:-0,5 снижения брони от The Swarm","+14 к силе:+20 к сожжению маны","+35% к получаемому опыту:+75 урона от Shukuchi"],"desc":"Weaver — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Первой способностью, The Swarm, Weaver выпускает рой из жуков, которые цепляются за любого врага на своем пути, атакуя и снижая его броню до тех пор, пока не будут убиты. Вторая способность, Shukuchi, делает героя невидимым, что позволяет ему проходить через юнитов на максимальной скорости. Врагам, через которых он проходит, наносится урон. Пассивная способность, Geminate Attack, позволяет Weaver атаковать цель дважды. Ультимативная способность, Time Lapse, возвращается в положение, в котором он был пять секунд назад, восстанавливая уровень здоровья и маны на былой уровень. Не действует на перезарядку, золото и опыт. Улучшение с Aghanim's Scepter уменьшает время перезарядки и позволяет использовать Time Lapse на союзников."}