{
  "abilities": [
    {
      "notes": [
        "Снаряд летит со скоростью 1300",
        "Наносит чистый урон по себе и магический по врагам",
        "Урон по себе наносится сразу в момент использования способности и он несмертелен, поэтому Abaddon не может добить себя\n Наносит себе 55\/80\/105\/130 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 80\/105\/130\/155) урона",
        "Если союзник станет неуязвимым или исчезнет до попадания снаряда, то все равно получит лечение",
        "<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> Талант на дополнительный урон и лечение мгновенно улучшит все летящие снаряды Mist Coil Abaddon",
        "<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> Талант 25-го уровня добавляет способности радиус действия в 400\n Перекрестие указателя все равно должно выделять вражеское существо\n При применении Abaddon выпускает снаряды к каждому союзнику и врагу в радиусе, но не к себе\n Эти снаряды считаются за обычное применение, поэтому их также можно избежать\n Также способность выбирает невидимых существ и существ в тумане войны\n При этом невидимые цели мгновенно избегают снарядов\n Урон, наносимый себе, не зависит от количества целей\n Не действует на Mist Coil, выпущенные при помощи <span image=\"images\/Borrowed_Time.webp\">[Borrowed Time]<\/span> Borrowed Time, улучшенного <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Mist Coil сначала наносит урон от способности, затем наносит урон от атаки\n Все эффекты атак срабатывают на данную атаку\n При выборе <span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> таланта, дающего применение по области, атаки будут наноситься по всем поражённым Mist Coil врагам\n Не наносит атаки союзникам"
      ],
      "item_behaviour": [],
      "description": "Ценой собственного здоровья выпускает смертельный туман, который наносит урон врагу или лечит союзника.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,25+0,4",
        "Дальность применения: 575",
        "Урон по себе: 50%",
        "Урон: 110\/160\/210\/260 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 160\/210\/260\/310)",
        "Лечение: 110\/160\/210\/260 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 160\/210\/260\/310)",
        "<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> Радиус:  400"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/68\/Abaddon_Mist_Coil_1.mp3\/revision\/latest?cb=20191216010529",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Магический"
      ],
      "mana": "5,5",
      "aghanim": null,
      "name": "Mist Coil",
      "cooldown": "50",
      "legacy_key": "D",
      "story": "Дыхание лорда Аверно преисполнено загадочными испарениями купели, подчиняющимися его воле."
    },
    {
      "notes": [
        "Применяет сильное развеивание на цель при использовании\n ↓↓ Двойное нажатие автоматически выбирает себя",
        "Способность полностью отрицает урон (после всех уменьшений), предотвращая срабатывание некоторых эффектов урона",
        "Aphotic Shield имеет второй низший приоритет среди способностей, отрицающих урон\n Например, в сочетании с <span image=\"images\/Borrowed_Time.webp\">[Borrowed Time]<\/span> Borrowed Time или <span image=\"images\/Refraction.webp\">[Refraction]<\/span> Refraction, щит не поглощает урона, пока другие эффекты не пропадут",
        "Не наносит урона невидимым существам и существам в тумане войны\n Щит всегда взрывается и наносит урон по области при потере любым путем баффа «Aphotic Shield»",
        "Урон по области не связан с количеством поглощенного урона\n Щит всегда наносит 110\/140\/170\/200 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 210\/240\/270\/300) урона",
        "<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> Талант на дополнительное здоровье щита не влияет на уже примененные щиты Abaddon\n Вопреки описанию таланта увеличивает как здоровье щита, так и урон от него",
        "Несколько применений на одно существо не складываются\n При повторном применении предыдущий щит уничтожается (нанося урон по области) и накладывается новый"
      ],
      "item_behaviour": [],
      "description": "Окружает союзника щитом из темной энергии, который поглощает некоторое количество урона, прежде чем исчезнуть. При уничтожении щит взрывается и наносит весь поглощенный урон ближайшим врагам. Снимает некоторые негативные эффекты и оглушение при применении.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,3+0,33",
        "Дальность применения: 550",
        "Радиус взрыва: 675",
        "Поглощение урона: 110\/140\/170\/200 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 210\/240\/270\/300)",
        "Урон по области: 110\/140\/170\/200 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 210\/240\/270\/300)",
        "Длительность: 15"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/05\/Abaddon_Aphotic_Shield_1.mp3\/revision\/latest?cb=20191216010532",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Союзников \/ Врагов",
        "Урон: Магический"
      ],
      "mana": "12\/10\/8\/6",
      "aghanim": null,
      "name": "Aphotic Shield",
      "cooldown": "85\/100\/115\/130",
      "legacy_key": "T",
      "story": "Сила чёрного тумана поглощает удары так же, как он сам поглощает дневной свет."
    },
    {
      "notes": [
        "Каждая успешная атака по вражескому существу не под действием чар накладывает базовый дебафф или увеличивает его счётчик",
        "Длительность базового дебаффа обновляется с каждым ударом\n То есть все 4 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 3\/\/\/) удара не нужно совершать за 5 сек",
        "Когда счётчик базового дебаффа достигает 4 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 3\/\/\/), то дебафф исчезает и заменяется на дебафф чар",
        "Любой союзный герой, атакующий зачарованное существо, получает бафф ускорения\n Бафф дается при успешном попадании атаки по цели\n То есть, промахнувшиеся атаки баффа не дают; герои дальнего боя получат бафф только при попадании снаряда\n Бафф действует только при атаке проклятых целей\n При смене цели бафф исчезает",
        "Бафф дается только союзным героям, иллюзиям и клонам\n Существа не-герои баффа не получают\n Считает крипов-героев за крипов",
        "Дебаффы можно применить к постройкам, но не к вардам или союзным существам"
      ],
      "item_behaviour": [],
      "description": "Атаки героя замедляют передвижение жертвы. Если атаковать врага 4 раза, на него сработает замораживающее проклятие: оно накладывает безмолвие и замедление, а все атакующие этого врага существа получают дополнительную скорость атаки.",
      "hot_key": "E",
      "params": [
        "Ударов нужно: 4 (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 3)",
        "Базовое замедление скорости передвижения: 10%\/15%\/20%\/25% ( 20%\/25%\/30%\/35%)",
        "Замедление скорости передвижения: 15%\/30%\/45%\/60% (<span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> 30%\/45%\/60%\/75%)",
        "Скорость атаки от чар: 40\/60\/80\/100",
        "Длительность базового эффекта: 5",
        "Длительность чар: 4,5",
        "Длительность баффа ускорения: 4"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/22\/Abaddon_Curse_of_Avernus.mp3\/revision\/latest?cb=20191216010528",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Союзников \/ Врагов"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Curse of Avernus",
      "cooldown": null,
      "legacy_key": "F",
      "story": "Крещёные в купели черпают из неё силы, но остальных дары Аверно смертельно изнуряют."
    },
    {
      "notes": [
        "При использовании прерывает произносимые способности Abaddon\n Не прерывает произнесение при пассивном срабатывании",
        "Способность можно применить, даже когда герой оглушен, спит, спрятан или на него действует ураган, провокации или принудительное движение",
        "Нельзя применить, но может пассивно активироваться, когда герой обезмолвлен, проклят или не может получать приказы\n Также способность нельзя поставить в ⇧ Shift-очередь",
        "Применяет сильное развеивание на Abaddon при использовании или пассивном срабатывании",
        "Активируется автоматически, если полученный урон (без отметки \"отнимающий здоровье\") опускает уровень здоровья Abaddon ниже 400 или наносится, если здоровье уже ниже 400\n Урон наносится до активации Borrowed Time: если наносимый урон превышает текущее здоровье Abaddon, то герой умрет, не активировав способность\n То есть, способность не спасает Abaddon от моментально убивающих эффектов, таких как <span image=\"images\/Culling_Blade.webp\">[Culling Blade]<\/span> Culling Blade и <span image=\"images\/Ice_Blast.webp\">[Ice Blast]<\/span> Ice Blast",
        "Borrowed Time полностью отрицает урон (после всех уменьшений), предотвращая срабатывание некоторых эффектов урона",
        "Borrowed Time превращает урон в лечение после учета всех уменьшений",
        "Borrowed Time имеет наивысший приоритет среди способностей, отрицающих урон\n Таким образом, в сочетании с другими подобными способностями (например, <span image=\"images\/Aphotic_Shield.webp\">[Aphotic Shield]<\/span> Aphotic Shield или <span image=\"images\/False_Promise.webp\">[False Promise]<\/span> False Promise), Borrowed Time поглощает урон, в то время как другие - нет\n В случае с False Promise, Borrowed Time сначала превращает урон в лечение, которое только после этого регистрируется способностью False Promise как лечение, а не урон",
        "Как и другие эффекты, манипулирующие уроном, Borrowed Time отрицает и превращает в лечение только 3 типа урона, но не урон с отметкой \"отнимающий здоровье\"\n Единственные исключения: <span image=\"images\/Heartstopper_Aura.webp\">[Heartstopper Aura]<\/span> Heartstopper Aura и <span image=\"images\/False_Promise.webp\">[False Promise]<\/span> False Promise, урон от которых превращается в лечение\n Тем не менее, Borrowed Time не активируется пассивно от урона этих способностей",
        "С <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter Borrowed Time дает ауру радиусом 1200, чей бафф задерживается на 0,5 сек\n Накладывает на союзников в радиусе действия бафф, учитывающий получаемый ими урон после всех уменьшений\n Проверяет полученный урон с каждым источником\n То есть на один источник урона выпускается только один снаряд независимо от того, насколько урон был большим\n Если полученный урон превышает порог в 525, то из счетчика это значение вычитается и выпускается Mist Coil\n Поскольку значение порога вычитается из счетчика, то остатки урона не пропадают и учитываются для следующего срабатывания\n То есть 1575 урона, нанесенного одним источником (в три раза больше порога), активируют только 1 Mist Coil, но следующие два источника урона гарантированно активируют срабатывание\n Способность игнорирует отнимающий здоровье урон\n У счетчика урона нет таймера сброса\n Он сбрасывается только потерей баффа союзником между источниками урона\n Выпущенные Mist Coil расходуют здоровье как и при обычном использовании, но не тратят ману и не связаны с перезарядкой\n Снаряды связаны с текущим уровнем Mist Coil, поэтому без изученной способности выпускаться не будут\n Аура не действует на неуязвимых или спрятанных существ\n <span image=\"images\/Talent_tree_symbol.webp\">[Talent tree symbol]<\/span> Талант 25-го, дающий применение Mist Coil по области, не действует на Mist Coil, выпущенные при помощи Borrowed Time"
      ],
      "item_behaviour": [],
      "description": "Обращает весь получаемый урон в лечение. Применение снимает большинство отрицательных эффектов. Если способность готова, то она сработает автоматически, как только здоровье владельца упадёт ниже 400.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Порог здоровья: 400",
        "Длительность: 4\/5\/6 ( 7\/8\/9)",
        "Радиус:  1200",
        "Порог здоровья для срабатывания Mist Coil:  525",
        "Длительность задержки ауры:  0,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8e\/Abaddon_Borrowed_Time.mp3\/revision\/latest?cb=20191216010527",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя "
      ],
      "mana": "60\/50\/40 (TagTalent 52\/42\/32)",
      "aghanim": null,
      "name": "Borrowed Time",
      "cooldown": "0",
      "legacy_key": "B",
      "story": "Эта сила, самая противоестественная из всех даров купели Аверно, бросает вызов пониманию смертных. Что должно ранить — лечит, а что должно убить — даёт свежие силы."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 22.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 2.0,
    "attrAgilityInc": 1.5,
    "attrAgility": 23.0
  },
  "description": "Защищает союзников или себя самого. Abaddon, проведя несчетное число дней подле Купели Аверно, впитал глубоко — глубже, чем любой другой отпрыск его рода, те пророческие пары, что источает купель. Теперь же, обладая сверхъестественными силами, Abaddon выпускает смертоносные Mist Coils дабы ранить врагов или исцелить союзников. Темный туман окутывает его соратников, формируя Aphotic Shield, который впитывает любые повреждения, после чего, разрываясь, ранит окружающих противников. Его меч проклинает врагов Curse of Avernus, спутывая их движения темным туманом, позволяя союзникам с большей скоростью атаковать недруга. Но самый главный подарок Купели раскрывается лишь в пылу битвы. Одаренный Borrowed Time, Abaddon врывается в строй врага и сеет в нем ужас, ведь каждый полученный им удар лишь придает лорду сил. Все, что должно было ранить Лорда Аверно, лишь делает его более грозным соперником.  Поддержка Керри Стойкость ★☆☆",
  "history": "Род Аверно питает купель — разлом в земной тверди, который испускает загадочную энергию на протяжении поколений. Каждого новорожденного семьи окунают в этот темный туман, даруя тем самым связь с их землей и ее загадочной силой. Дети растут с непреклонной верой в защиту семейных ценностей и традиций земли, но на самом деле они охраняют саму купель, истинные намерения которой неизвестны. Когда новорожденный Abaddon проходил обряд крещения, что-то пошло не так. В глазах малыша сверкнула искра разума, испугавшая всех присутствовавших и заставившая жрецов шептаться. Его растили, дабы он пошел по пути всех отпрысков рода: война и защита родины во главе армии. Но сам Abaddon уделял этому не так много внимания. Пока другие тренировались в обращении с оружием, он медитировал у купели. Он глубоко вдыхал темный туман, учась быть единым с той силой, что протекала глубоко под землей его дома. В конечном счете он стал порождением черного тумана. Род Аверно неодобрительно отнесся к такому решению, обвиняя его в пренебрежении обязанностями. Но все эти обвинения прекратились, когда Abaddon вступил в свою первую битву и показал ту обретенную власть над жизнью и смертью, о которой другие члены рода не могли и мечтать."
}