{
  "abilities": [
    {
      "notes": [
        "Уменьшает весь урон от атаки жертвы, в том числе дополнительный урон",
        "Применяет уменьшение лечения, уменьшение восстановления, уменьшение вампиризма и уменьшение магическог вампиризма на цель",
        "Уменьшает дальность применения заклинаний жертвы в процентном виде\n Сочетается аддитивно с другими источниками уменьшения",
        "Несколько применений на одну цель не усилят эффект, но обновят длительность"
      ],
      "item_behaviour": [],
      "description": "Снижает урон от атак, восстановление здоровья и дальность применения заклинаний.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 800\/900\/1000\/1100",
        "Снижение урона от атак: 45%\/50%\/55%\/60%",
        "Уменьшение лечения и восстановления: 45%\/50%\/55%\/60%",
        "Уменьшение дальности применений заклинаний: 30% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 50%)",
        "Длительность: 8\/9\/10\/11"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a1\/Bane_Enfeeble.mp3\/revision\/latest?cb=20191216011114",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов"
      ],
      "mana": "28\/21\/14\/7",
      "aghanim": null,
      "name": "Enfeeble",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "T",
      "story": "Каждый отголосок страха, сотканного Атропосом, делает жертв уязвимыми пред магией и неизведанными силами."
    },
    {
      "notes": [
        "Наносит урон до лечения",
        "Лечение зависит от фактически полученного врагом урона\n Само лечение может быть усилено при помощи манипуляции лечением",
        "Несмотря на визуальный эффект, лечение и урон проходят одновременно\n ПРИМЕЧАНИЯ К AGHANIM'S SHARD Добавляет способности радиус 550\n Центр действия способности всё ещё направлен на существо\n Может задеть невидимых существ и врагов в тумане войны\n От вторичных целей может вылечиться на 18,75\/37,5\/56,25\/75 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 68,75\/87,5\/106,25\/125) за каждое существо"
      ],
      "item_behaviour": [],
      "description": "Высасывает жизненную энергию врага, нанося ему урон и восстанавливая здоровье героя.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 625",
        "Урон: 75\/150\/225\/300 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 275\/350\/425\/500)",
        "Лечение за урон по основной цели: 100%",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Радиус:  550",
        "<span image=\"images\/aghanim's_shard_symbol.webp\">[picture:aghanim's_shard_symbol]<\/span> Лечение за урон по вторичной цели:  25%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/72\/Bane_Brain_Sap.mp3\/revision\/latest?cb=20191216011113",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Чистый"
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "aghanim": null,
      "name": "Brain Sap",
      "cooldown": "100\/120\/140\/160",
      "legacy_key": "B",
      "story": "Атропос не знает большего счастья, чем пожинать плоды устрашения."
    },
    {
      "notes": [
        "↓↓ Двойное нажатие автоматически применить способность на владельца\n Применяет сон на затронутых существ, не давая им действовать",
        "Nightmare дает цели эффект неуязвимости на 4\/5\/6\/7 секунду, предотвращая пробуждение затронутого существа",
        "Nightmare снижает обзор вражеских существ до 200",
        "Наносит урон и излечивает владельца каждую 1 секунду, начиная спустя 1 секунду после наложения сна, в результате срабатывая 4\/5\/6\/7 раз\n Может нанести до 20\/75\/150\/245 урона вражеской цели при стандартной длительности сна (до учёта сопротивлений)",
        "Цель пробудится при атаке существ по ней (включая ручное использование активных модификаторов атаки) или при получении урона",
        "Цель не проснется при получении урона от определенных источников и в нескольких редких состояниях: Урон нанесён <span image=\"images\/sleight_of_fist.webp\">[picture:sleight_of_fist]<\/span> Sleight of Fist, <span image=\"images\/flak_cannon.webp\">[picture:flak_cannon]<\/span> Автоматическая турель или <span image=\"images\/stifling_dagger.webp\">[picture:stifling_dagger]<\/span> Stifling Dagger\n Любая атака от активного модификатора атаки, который действует как дебафф (например, <span image=\"images\/burning_spear.webp\">[picture:burning_spear]<\/span> Burning Spear) или атака по области (например, <span image=\"images\/tidebringer.webp\">[picture:tidebringer]<\/span> Tidebringer)\n Нанесён отнимающий здоровье урон\n Любой урон, нанесенный уже запущенной дальней атакой, если снаряд ударил после момента неуязвимости\n Вражеские цели не просыпаются от урона, наносимого самим Nightmare",
        "При пробуждении от атаки Nightmare переходит на атакующее существо при начале атаки, а не при её попадании",
        "Переход Nightmare на новую цель обновляет длительность способности, включая неуязвимость на 4\/5\/6\/7 секунду",
        "Nightmare не может перейти на невосприимчивое к магии существо, варды и строения, их атаки лишь пробудят цель",
        "Bane и его иллюзии могут атаковать существ под действием Nightmare как обычно — без перенесения Nightmare на себя или пробуждения цели\n Это встроенная способность Bane\n Это распространяется только на урон от атаки, другие источники урона всё равно разбудят цели (например, срабатывания <span image=\"items\/maelstrom\/full.webp\">[picture:maelstrom]<\/span> Chain Lightning)",
        "Существа под Nightmare никогда не считаются целью автоатаки независимо от настроек\n Для атаки по ним требуется дать команду на принудительную атаку\n Это значит, что спящие существа никогда не будут атакованы линейными крипами, нейтральными крипами, башнями и фонтанами\n Также они не учитываются как цели для вторичных атак (например, <span image=\"images\/moon_glaives.webp\">[picture:moon_glaives]<\/span> Moon Glaives)\n Подконтрольные игроку существа могут применить атаку на союзное существо под Nightmare, чтобы перенести способность на себя\n ПРИМЕЧАНИЯ К ТАЛАНТАМ <span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Талант, позволяющий урону от Nightmare лечить владельца также лечит Bane на весь нанесённый им урон\n Атаки по цели также излечивают Bane на значения нанесённого урона\n Сочетается аддитивно с другими источниками вампиризма\n Не излечивает вампиризмом от вардов, построек и союзных существ",
        "Пока на существ действует Nightmare, эта способность у Bane заменяется на подспособность <span image=\"images\/nightmare_end.webp\">[picture:nightmare_end]<\/span> Nightmare End, которая может их пробудить",
        "Статус неуязвимость от Nightmare отображается стандартной иконкой <span image=\"images\/invulnerability.png\">[picture:invulnerability]<\/span> неуязвимости, а не иконкой способности"
      ],
      "item_behaviour": [],
      "description": "Погружает вражеского или союзного героя в сон, прерываемый уроном. Если пробудить спящее существо атакой, эффект передастся атакующему. Владелец способности может беспрепятственно атаковать спящие цели. При применении на врага наносит ему чистый урон каждую секунду.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,4+0,57",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 425\/500\/575\/650",
        "Урон в секунду: 5\/15\/25\/35",
        "Длительность сна: 4\/5\/6\/7",
        "Длительность неуязвимости: 1",
        "<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> Лечение от урона:  100%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1d\/Bane_Nightmare.mp3\/revision\/latest?cb=20191216011117",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Союзников",
        "Урон: Чистый"
      ],
      "mana": "24\/21\/18\/15 (TagTalent 21\/18\/15\/12)",
      "aghanim": null,
      "name": "Nightmare",
      "cooldown": "165",
      "legacy_key": "E",
      "story": "Умение, украденное у богини Никташи, погружает жертву в бренный сон."
    },
    {
      "notes": [
        "Заменяет <span image=\"images\/nightmare.webp\">[picture:nightmare]<\/span> Nightmare, пока не закончится дебафф от способности Bane",
        "При применении не прерывает произносимые заклинания Bane",
        "Может пробудить в любой момент действия Nightmare, даже в 4\/5\/6\/7 секунду неуязвимости",
        "Пробуждает всех существ под действием Nightmare",
        "Можно использовать при оглушении, урагане, провокации, исчезновении или при принудительном движении",
        "Нельзя использовать при безмолвии, проклятии или в обезвреженном состоянии\n Bane не может поставить эту способность в ⇧ Shift-очередь\n ПРИМЕЧАНИЯ К SPELL STEAL Не даёт <span image=\"images\/nightmare.webp\">[picture:nightmare]<\/span> Nightmare, если эта подспособность была последней применённой способностью"
      ],
      "item_behaviour": [],
      "description": "Заканчивает действие всех Nightmare.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0+0"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Переключаемая"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Nightmare End",
      "cooldown": "0",
      "legacy_key": "E",
      "story": null
    },
    {
      "notes": [
        "Дает эффект True Sight на цель, пока применяется способность",
        "Если цель получила неуязвимость или её спрятали, то произнесение мгновенно прервется",
        "Наносит 35\/55\/75 единиц урона и вытягивает 2,5% маны с интервалом в 0,5 секунды сразу после начала применения способности, срабатывая 10\/11\/12 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 20\/21\/22) раза\n Может нанести до 350\/605\/900 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 700\/1155\/1650) единиц урона (до уменьшений)\n Может вытянуть до 25%\/27,5%\/30% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 50%\/52,5%\/55%) максимального запаса маны",
        "С каждым тиком сначала наносит урон, а затем вытягивает ману",
        "Выбор таланта на длительность Fiend's Grip не увеличивает длительность уже применяемой способности",
        "В отличии от других направленных способностей, обзор заклинателя от Fiend's Grip действует до завершения произнесения (даже если его прервали), а не лишь 2 секунды",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Теперь всякий раз при применении Fiend's Grip появляется 2 иллюзии\n Иллюзии всегда появляется справа и слева от Bane на расстоянии 400 и смотрят в направлении цели\n Иллюзия может применять способности, она мгновенно использует Fiend's Grip на ту же цель, что и Bane, без анимации применения\n Технически иллюзия является контролируемой, ей можно отдать любой приказ, кроме использования предметов\n Однако это прервёт Fiend's Grip, поэтому иллюзия мгновенно умрёт\n Fiend's Grip иллюзии накладывает модификатор, отличный от эффекта настоящего героя\n Этот модификатор только оглушает цель, если на ней находится эффект настоящего героя\n Однако если эффект героя спадёт, то модификатор иллюзии будет наносить урон и высасывать ману\n По этой причине урон и высасывание маны зависит от характеристик иллюзии, а не Bane\n Предметы и таланты на увеличение урона заклинаний не будут работать на иллюзии\n Иллюзия появляется при каждом использовании способности\n Если Bane прервёт заклинание и еще раз применит, то создастся новая иллюзия\n Урон от нескольких иллюзий по одной цели не сочетаются\n Иллюзия живёт не более 20 секунд\n Иллюзия не будет появляться, если цель отразит заклинание\n ПРИМЕЧАНИЯ К SOULBIND Преждевременное окончание произнесения отменит только Fiend's Grip на изначально выбранном враге и не затронет произнесение на другую цель, даже с исчезновением дебаффа привязки"
      ],
      "item_behaviour": [],
      "description": "Захватывает врага, оглушая его и нанося большой периодический урон. Также жертва каждые 0,5 сек. теряет долю от максимального запаса маны, передавая её владельцу способности.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,2+0",
        "Дальность применения: <span image=\"images\/cast_range_symbol.png\">[picture:cast_range_symbol]<\/span> 625",
        "Макс\n длительность: 5\/5,5\/6 (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 10\/10,5\/11)",
        "Урон в секунду: 70\/110\/150",
        "Кража маны в секунду: 5% (<span image=\"images\/talent_tree_symbol.webp\">[picture:talent_tree_symbol]<\/span> 10%)",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Число иллюзий:  2",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Урон по иллюзии:  200%",
        "<span image=\"images\/aghanim's_scepter_symbol.webp\">[picture:aghanim's_scepter_symbol]<\/span> Длительность иллюзии:  20"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f6\/Bane_Fiend%27s_Grip.mp3\/revision\/latest?cb=20191216011115",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Чистый"
      ],
      "mana": "120\/110\/100 (TagTalent 75\/65\/55)",
      "aghanim": null,
      "name": "Fiend's Grip",
      "cooldown": "200\/300\/400",
      "legacy_key": "F",
      "story": "Жертвы Атропоса растерзываются на куски созданиями из собственных кошмаров."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 22.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.5,
    "attrAgilityInc": 2.5,
    "attrAgility": 22.0
  },
  "description": "Выводит врагов из строя, усыпляя их Сотворенный из крови богини Никташи, Атропос - мистическое воплощение чистого страха. Сущий ужас - Enfeeble - ослабляет его врагов, истощая их атаки. Элементаль Bane с помощью Nightmare погружает геров в сны, насылая им тревожнейшие кошмары, и питается их жизненными силами за счет Brain Sap. Некоторым не суждено проснутся. Пойманные в Fiend's Grip жертвы Bane могут лишь метаться среди воображаемых призраков, в то как время страх душит жизнь в их телах.  Поддержка Контроль Быстрый урон Стойкость ★★☆",
  "history": "Когда сами боги видят кошмарные сны, их приносит элементаль ужасов. Имя ему — Атропос, порождение ночных кошмаров богини Никташи. Сны не смогли сдержать страшную силу, и, вырвавшись из дрём матери, Атропос выкормился на её бессмертии и соткал себе туманную форму из её чернильной крови. Он — средоточие страха, и смертным, что слышат его голос, он нашёптывает их самые мрачные тайны. Атропос взывает к глубочайшим страхам в сердцах героев. Не спасёт жертву и бдение: неиссякаемая чёрная кровь элементаля обволакивает врагов кошмарной дрёмой, словно смола. Завидев на поле боя Атропоса, любой герой помнит: темноты нужно бояться."
}