{"abilities":[{"spell":"Calls down waves of fire that damage enemy units in the target area, burning for additional damage over time.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The visual and audio effects at the targeted area during the cast time are visible and audible to allies only.","Creates waves in 1 second intervals, starting immediately upon cast, resulting in the effect lasting 5 seconds.","Despite the visual effects, the damage of the waves is applied instantly, and not upon landing.","The burn debuff deals damage in 1 second intervals, starting immediately as the debuff is applied, resulting in 3 instances.","The burn debuff does not stack per interval. Each interval refreshes its duration, resulting in 8 possible burn damage instances.","On each wave, Firestorm first applies the damage, then the debuff.","Does not place the burn debuff on ancient creeps, but does apply the wave damage.","Can deal up to 150\/240\/330\/420 ( 258\/348\/438\/528) + 8%\/16%\/24%\/32% of max health as damage (before reductions) when all waves hit and the debuff is not dispelled.","When the talent is chosen, Firestorm fully affects buildings, but deals less damage to them. Deals 6.25\/10\/13.75\/17.5 damage per wave to buildings. The burn debuff is placed as well, dealing 0.25%\/0.5%\/0.75%\/1% of max health as damage per second. Can deal up to 37.5\/60\/82.5\/105 ( 64.5\/87\/109.5\/132) + 2%\/4%\/6%\/8% of max health as damage (before reductions) when all waves hit and the debuff is not dispelled."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"12","name":"Firestorm","description":["Cast Animation: 0.6+0.47","Cast Range: 750 ( 900)","Effect Radius: 400","Number of Waves: 6","Wave Interval: 1","Damage per Wave: 25\/40\/55\/70 ( 43\/58\/73\/88)","Max Health as Damage per Second: 1%\/2%\/3%\/4%","Building Damage Percentage: 0% ( 25%)","Burn Duration: 2"],"hot_key":"Q","legacy_key":"F"},{"spell":"A deadly pit is conjured at the target location; any unit that enters will be rooted. Each enemy unit within the pit are affected every 3.6 seconds.","effects":["Ability Target Area","Affects Enemies"],"notes":["The visual and audio effects at the targeted area during the cast time are visible and audible to allies only.","Roots the targets, preventing them from moving and casting certain mobility spells. Provides True Sight over the targets.","The root is applied periodically on every enemy within the area. However, the Buff Placer modifier prevents them from being continuously rooted for the whole duration. This hidden modifier is applied on every unit within the area which does not have the modifier yet. The modifier lasts for 3.6 seconds. So whenever the modifier expires, enemies get instantly rooted again and then receive the hidden modifier again. This means that Pit of Malice does not root every unit within the area in set intervals. Each unit is rooted every 3.6 seconds based on when they entered the area. The hidden modifier does not disappear upon leaving the area. This means quickly leaving and re-entering does not result in an instant-root. All Pits share the same modifier, meaning they do not stack - once rooted, the unit becomes immune to all other pits until the modifier wears off.","Fully affects invisible units and units inside the Fog of War.","Can root a unit up to 4 times if it stays within the area for the full duration, resulting in a total root time of 3.6\/4.8\/6\/7.2 ( 6.8\/8\/9.2\/10.4) seconds.","Creates a distinct visual effect around, and plays a distinct sound on affected heroes and illusions, but not around other affected units."],"mana":"80\/100\/120\/140","elements":["Does not pierce spell immunity."],"cooldown":"22\/20\/18\/16","name":"Pit of Malice","description":["Cast Animation: 0.45+0.6","Cast Range: 750 ( 900)","Effect Radius: 400","Root Interval: 3.6","Root Duration: 0.9\/1.2\/1.5\/1.8 ( 1.7\/2\/2.3\/2.6)","Pit Duration: 12"],"hot_key":"W","legacy_key":"T"},{"spell":"Nearby enemy units are weakened, losing a portion of their base damage. If an enemy hero dies while under this effect, Underlord gains bonus damage.","effects":["Ability Aura","Affects Enemies \/ Self"],"notes":["Only reduces base damage and that given by the primary attribute of affected units. Raw bonus damage is not reduced.","The aura's debuff lingers for 0.5 seconds.","It does not matter how an enemy dies, Underlord always gets the damage as long as it was affected by the debuff.","Each damage increment per dying unit lasts for the set duration. Gaining more damage does not refresh the duration of the previous increments.","The damage bonuses persist through Underlord's death.","A status buff icon appears whenever Underlord gains damage from the aura. The buff shows how much damage the aura currently grants. Underlord's weapon also glows stronger with green particle effects the more damage stacks he has.","Does not gain attack damage from dying illusions, couriers, buildings, wards, Tempest Doubles and Undying Zombies.","When there are multiple Meepos within range, only one of them grants Underlord damage when they die.","Treats creep-heroes as creeps, gaining only the creep value when creep-heroes die within range.","The aura affects invulnerable units, but not hidden units.","The attack damage reduction does not affect enemies which have no vision over Underlord. However, Underlord still gains damage from enemies within the aura's range, despite the debuff not being present.","Aghanim's Scepter adds a new aura to the ability, which affects allied heroes (including illusions and clones) and creep-heroes. This aura grants allies attack damage, based on how much attack damage Underlord currently gathered through dying units, reduced by 50%. Only counts the temporary attack damage bonus. The permanent attack damage bonus is not shared with allies. The aura has the same radius as the attack damage reducing aura, and lingers for 0.5 seconds as well. This aura is only present when Underlord has damage charges. When having no charges, the aura is not bestowed, so no buff appears on allies. The aura does not affect Underlord himself, but does affect his illusions when near him. Does not affect invulnerable or hidden allies.","Level 15 talent does not retroactively adapt already received stacks. Only stacks gained after choosing the talent are affected."],"mana":"0","elements":["Can be used by illusions.","Partially disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Atrophy Aura","description":["Radius: 1200","Attack Damage Reduction: 5%\/15%\/25%\/35%","Permanent Attack Damage Bonus per Hero Death: 2\/3\/4\/5 ( 9\/10\/11\/12)","Temporary Attack Damage Bonus per Hero Death: 30\/35\/40\/45","Temporary Attack Damage Bonus per Non-Hero Death: 5","Attack Damage Bonus Duration: 30\/40\/50\/60 ( 70\/80\/90\/100)","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"R"},{"spell":"Opens a dark rift at the targeted friendly unit's or building's position. After a short delay, Underlord and all nearby friendly heroes are teleported to that unit's location. Dark Rift can be cancelled at anytime during the cast. If it is cancelled in this way or the target unit dies before the spell becomes active, Dark Rift goes into cooldown.","effects":["Ability Target Point \/ Target Unit","Affects Allied Heroes"],"notes":["Upon cast, Dark Rift is replaced by Cancel Dark Rift for its duration.","Double-clicking the ability automatically targets the team's fountain.","Can be cast on any allied unit which is not a hero (or illusion) or a ward. Can target creep-heroes.","Can target and teleport to invulnerable units. Cannot target hidden units, but the teleport still happens if the target turns hidden after being targeted.","When targeting the ground, it searches for the nearest valid target on the map and teleports towards it.","The visual effects around Underlord and on the teleport target are visible to everyone.","The targeted unit's priority is lowered, meaning it is attacked as the last auto attack target by other units.","Disjoints projectiles upon teleporting for everyone who gets teleported.","Can only teleport heroes (including illusions and clones) and creep-heroes. Can teleport them even while invulnerable or hidden.","When Underlord or the teleport target dies during the delay, the spell is canceled. The spell is not canceled when the targeted creep changes ownership."],"mana":"100\/200\/300","elements":["Pierces spell immunity."],"cooldown":"130\/115\/100","name":"Dark Rift","description":["Cast Animation: 0.6+0.47","Cast Range: Global","Radius: 600","Teleport Delay: 6\/5\/4"],"hot_key":"R","legacy_key":"D"},{"spell":"Stop the teleport.","effects":["Ability No Target"],"notes":["Replaces Dark Rift until the teleport finishes or this spell is cast.","Interrupts Underlord's channeling spells upon cast."],"mana":"0","elements":[],"cooldown":"0","name":"Cancel Dark Rift","description":["Cast Animation: 0+1.07"],"hot_key":"R","legacy_key":"D"}],"bio":"Neither myth nor song exist to tell of their coming. Deep below the surface of the world lay unknown wonders and horrors. Down and down again, well beneath the slithering magma fields and simmering roots of dormant volcanoes stands the obsidian city of Aziyog, its incomparable stonework spanning an endless cavern. Within honeycomb walls mortared with the bones of countless slaves lies the domain of the Abyssal Horde, and their brutal underlord Vrogros. Armed by the monstrous forgemasters of his kind and well-practiced in the arts of the Dark Rift, Vrogros is able to conjure forth flame and crippling malice through the twist between worlds. He seeks always to expand his holdings, destroying or enslaving all he encounters. Yet the lands offered by the subterranean realm are few, and so his sights have turned upward. By his command the first waves of abyssal invaders have already marched through the rift, a few doomed legions meant merely to test the might of nations above. Now, as his full force readies itself for unending conquest, Vrogros himself steps into a sunlit world to announce his coming reign. Those who face the Underlord will bow and pay tribute, or be crushed where they stand.","trivia":["Underlord is named Azgalor, the Pit Lord in DotA. His title, Pit Lord, was changed to avoid possible copyright infringements with Blizzard Entertainment, since the Pit Lords are a race of demons in the Warcraft universe. His name, Azgalor, was also changed for the same reason. Azgalor was a character from the Warcraft universe as well, who served one of the main antagonists of the Warcraft universe as a well known commander. According to the Bastion Announcer, \"Pyre Lord\" was also a proposed name for Underlord. Up until the June 23, 2016 Patch, Underlord's title was \"Abyssal Underlord\". While the rationale of dropping \"Abyssal\" is unclear, it may have been to prevent confusion with the shorthand terminology of Abyssal Blade.","Underlord had been developed since 2012; he already had a beta model, placeholder ability icons and fully finished and working abilities. He could also be spawned in lobbies with cheats enabled for a short while before it was disabled. This suggests that his release was originally planned much earlier (as a comparison, all other heroes were released shortly after their files were added to the game), but was delayed for reasons unknown.","Before his release, Underlord was showcased at the All-Star match of The International 2016, played by N0tail. He originally picked Sand King​, but a bit after the start of the game, SirActionSlacks replaced his pick by Underlord.","The line Underlord says after killing Bane, \"You have my permission to die.\", is a reference to the famous line \"When Gotham is ashes, you have my permission to die\", said by the villain Bane from the movie The Dark Knight Rises.","Underlord's line when casting Dark Rift, \"Hold on to your butts!\", was spoken by Samuel L. Jackson's character Ray Arnold in the movie Jurassic Park (1993).","Underlord was the final DotA hero ported over, before Dota 2 began to feature original heroes."],"talents":["25% Firestorm Building Damage:+0.8s Pit of Malice Root","+25 Health Regen:+70 Attack Speed","+7 Atrophy Permanent Bonus Damage:+150 Cast Range","+30 Movement Speed:+18 Firestorm Wave Damage"],"desc":"Underlord 25 + 3.3 12 + 1.6 17 + 2.3 Level Base 1 15 25 Health 200 700 1620 2280 Health regen 0 2.5 7.12 10.42 Magic res. 25% 26.5% 29.27% 31.25% Mana 75 279 663 939 Mana regen 0 0.85 2.46 3.61 Spell dmg 0% 1.19% 3.44% 5.05% Armor 3 4.92 8.5 11.06 Att\/sec 0.59 0.66 0.79 0.88 Move sp amp. 0% 0.6% 1.72% 2.52% Damage 37‒43 62‒68 108‒114 141‒147 Movement speed 295 Attack speed 100 Turn rate 0.6 Vision range 1800\/800 Attack range 150 Projectile speed Instant Attack animation 0.45+0.7 Base attack time 1.7 Damage block 8 Collision size 24 Legs 2  Gib type Default"}