{"abilities":[{"spell":"Обрушивает на указанную область волны пламени, наносящие урон врагам. Жертвы также получают периодический урон, зависящий от их максимального запаса здоровья.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Визуальные и звуковые эффекты на области применения во время произнесения видны и слышны только союзникам.","Создает волны с интервалом в 1 секунду сразу после применения, всего вызывая 5 волн.","Вопреки визуальным эффектам, урон волн применяется мгновенно, а не по приземлению.","Урон от горения наносится с интервалом в 1 секунду сразу после применения дебаффа, нанося урон 3 раза.","Эффект горения не складывается за каждый интервал. Каждый интервал обновляет длительность, в результате получается 8 возможных интервалов горения.","С каждой волной Firestorm сначала наносит урон, затем применяет дебафф.","Не применяет дебафф горения на древних крипов, но наносит урон от волн.","Может нанести до 150\/240\/330\/420 ( 258\/348\/438\/528) + 8%\/16%\/24%\/32% , если юнита поразили все волны, а дебафф не был развеян.","При выборе таланта Firestorm действует на строения, но наносит им меньше урона. Наносит строениям 6.25\/10\/13.75\/17.5 единиц урона за волну. Также применяется дебафф горения, наносящий 0.25%\/0.5%\/0.75%\/1% от максимального здоровья в виде урона в секунду. Может нанести до 37.5\/60\/82.5\/105 ( 64.5\/87\/109.5\/132) + 2%\/4%\/6%\/8% от максимального здоровья (до учета сопротивлений), если строение поразили все волны, а дебафф не был развеян."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"12","name":"Firestorm","description":["Анимация применения: 0,6+0,47","Дальность применения: 750 ( 850)","Радиус: 400","Количество волн: 6","Интервал волн: 1","Урон от волны: 25\/40\/55\/70 ( 43\/58\/73\/88)","Урон от горения: 1%\/2%\/3%\/4%","Процент урона по строениям: 0% ( 25%)","Длительность горения: 2"],"hot_key":"Q","legacy_key":"F"},{"spell":"Создаёт разлом в выбранной области. Любое попавшее в него существо цепенеет. Срабатывает на каждое вражеское существо лишь раз в 3.6 сек.","effects":["Способность Направленная на область","Действует на Врагов"],"notes":["Визуальные эффекты и звуки на области применения во время произнесения видны и слышны только союзникам.","Применяет к целям оцепенение, предотвращая их передвижение, атаки и использование определенных заклинаний для передвижения. Дает эффект True Sight на цели.","Периодически применяет оцепенение на каждого врага в области. При этом модификатор \"Buff Placer\" предотвращает преждевременное оцепенение. Этот модификатор применяется к любому юниту в области, на которого еще не воздействовал. Модификатор длится 3.6 секунды. При завершении действия к врагам мгновенно применяется оцепенение и скрытый модификатор. То есть Pit of Malice не применяет оцепенение к каждому юниту с установленным интервалом. Оцепенение действует на юнита каждые 3.6 секунды с момента попадания в область. Скрытый модификатор не пропадает при покидании области. То есть быстрое покидание, а затем возвращение в область не применит оцепенение мгновенно.","Действует на невидимых юнитов и юнитов в тумане войны.","Может опутывать юнита до 4 раз, если он оставался в области всю длительность, достигая длительность оцепенения до 3.6\/4.8\/6\/7.2 ( 6.8\/8\/9.2\/10.4) секунд.","Создает опутывающий визуальный эффект вокруг затронутых героев и иллюзий, но не вокруг других затронутых юнитов."],"mana":"100\/115\/130\/145","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"32\/28\/24\/20","name":"Pit of Malice","description":["Анимация применения: 0,45+0,6","Дальность применения: 750 ( 850)","Радиус эффекта: 375","Интервал оцепенения: 3.6","Длительность оцепенения: 0.9\/1.2\/1.5\/1.8 ( 1.7\/2\/2.3\/2.6)","Длительность разлома: 12"],"hot_key":"W","legacy_key":"T"},{"spell":"Уменьшает урон всех вражеских существ неподалёку. Если жертва способности погибнет, герой временно получит дополнительный урон.","effects":["Способность Аура","Действует на Врагов \/ Себя"],"notes":["Уменьшает только базовый урон и урон, даваемый основным атрибутом затронутого юнита. Прямой бонусный урон не уменьшается.","Эффект ауры задерживается на 30\/40\/50\/60 секунд.","Не важно как умрет враг, Underlord всегда получает урон, пока цель затронута негативным эффектом.","Каждое увеличение урона за умершего юнита длится определенное время. Получение большего урона не обновляет длительность предыдущих увеличений.","Дополнительный урон не исчезает при смерти Underlord.","Иконка статуса эффекта появляется когда Underlord получает урон от ауры. Эффект показывает сколько урона дает аура. Оружие Underlord также начинает светиться сильнее c зелеными искрами, чем больше урона он получил.","Не получает дополнительный урон от смерти иллюзий, курьеров, строений, вардов, Tempest Double и Undying Zombie.","Когда в радиусе несколько Meepo, только один из них даст урон Underlord когда умрет.","Считает крипов-героев за крипов.","Аура влияет на неуязвимых, но не на спрятанных юнитов.","Снижение урона не действует на врагов, если у них нет обзора на Underlord. При этом Underlord продолжает получать урон от врагов в радиусе ауры, даже если дебафф не отображается.","Aghanim's Scepter добавляет к способности новую ауру, действующую на союзных героев (включая иллюзии и клонов) и крипов-героев. Аура дает союзникам дополнительный урон, зависящий от того, сколько урона получил Underlord от умерших юнитов, но уменьшенный на 50%. У ауры тот же радиус, что и ауры уменьшения урона, и она задерживается на 30\/40\/50\/60 секунды. Аура отображается только если у Underlord есть заряды. Если их нет, то аура не распространяется и не отображается на союзниках. Аура не действует на Underlord, но действует на его иллюзии. Не действует на неуязвимых или спрятанных союзниках."],"mana":"0","elements":["Может использоваться иллюзиями.","Частично отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Atrophy Aura","description":["Радиус: 1200","Снижение урона: 7%\/18%\/29%\/40%","Постоянный бонус к урону: 2\/3\/4\/5","Доп. урон за смерть героя: 30\/35\/40\/45 ( 45\/50\/55\/60)","Доп. урон за смерть не-героя: 5","Длительность: 30\/40\/50\/60 ( 70\/80\/90\/100)","Длительность задержки ауры: 0.5"],"hot_key":"E","legacy_key":"R"},{"spell":"Открывает тёмную брешь возле выбранного союзного существа. После небольшой задержки владелец способности и все союзные герои вокруг него телепортируются к этой бреши. Способность начнёт перезаряжаться, даже если отменить её или если цель телепортации умрёт.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Союзных героев"],"notes":["При применении Dark Rift заменяется на Cancel Dark Rift, пока действует задержка.","Двойное нажатие по способности автоматически применит ее на союзный фонтан.","Можно применить на любых союзных юнитов которые не являются героями ( иллюзиями или вардами). Можно применять на крипов-героев.","Можно взять в цель и телепортироваться к неуязвимым юнитам. Нельзя выбрать целью спрятанных юнитов, но телепортация всё равно произойдет, если цель станет спрятанной после выбора.","Если применить на землю, будет выбрана ближайшая к месту применения возможная цель.","Визуальные эффекты вокруг Underlord и на цели телепортации видны всем.","Цель, на которую применяется Dark Rift, имеет низкий приоритет для атаки (как при Boots of Travel).","Каждый, кто телепортируется с помощью способности, может избежать снарядов.","Можно телепортировать только героев (включая иллюзии и клонов) и крипов-героев. Можно телепортировать их даже если они неуязвимы или спрятанны.","Когда Underlord или цель телепортации умирают во время задержки, заклинание отменяется. Заклинание не отменяется если крип, на которого оно нацелено, изменит владельца."],"mana":"100\/200\/300","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"130\/120\/110","name":"Dark Rift","description":["Анимация применения: 0,6+0,47","Дальность применения: Глобальная","Радиус: 600","Задержка: 6\/5\/4"],"hot_key":"R","legacy_key":"D"},{"spell":"Отменяет телепортацию.","effects":["Способность Ненаправленная"],"notes":["Заменяет Dark Rift до завершения телепортации или применения этого заклинания.","При применении прерывает произносимые заклинания Underlord."],"mana":"0","elements":[],"cooldown":"0","name":"Cancel Dark Rift","description":["Анимация применения: 0+1,07"],"hot_key":"R","legacy_key":"D"}],"bio":"Сей рок не предрекала ни одна песнь, ни одна легенда. Глубоко под поверхностью внешнего мира лежат неведомые чудеса и ужасы. Закованный в земной тверди, далеко под беспокойными лавовыми полями и подножиями спящих вулканов раскинулся обсидиановый город Азийог, бесподобная каменная кладка которого простирается по безграничной пещере. В ячеистых стенах, построенных на костях бесчисленных рабов, лежат территории Орды бездны и её жестокого владыки, Врогроша. Вооружённый лучшими кузнецами своего вида и обученный управлять самим пространством, в непрерывной жажде власти он несет пламя и отчаяние в каждый мир, уничтожая или порабощая всё встреченное. Тем не менее, подземный мир невелик, и потому Врогрош обратил свой взор ко внешним просторам. Одним своим словом он обрек на погибель легионы своих разведчиков, отправив тех на растерзание обитателям поверхности, дабы оценить их мощь. Теперь же, готовый продолжить завоевание, Врогрош лично ступит на освещённую солнцем землю и провозгласит своё грядущее правление. Те же, кто встретятся ему, падут ниц и выплатят дань — или умрут на месте.","trivia":["Pit Lord был переименован в Underlord основываясь на репликах Комментатора Bastion. Это было сделано для избежания нарушения авторских прав компании Blizzard, так как Pit Lords - раса демонов во вселенной \"Diablo\", а также \"Warcraft\".","Странно, но на данный момент, Underlord - является единственным, хорошо \"проработанным\", персонажем. Когда скорость передвижения Врогроша становится выше 400 единиц, его анимация ходьбы изменяется, при передвижении он начинает слегка подпрыгивать. Эта анимация немного схожа с анимацией бега при подбирании Руны \"Ускорение\". Большинство героев имеют другую анимацию передвижения только тогда, когда они подбирают вышеназванную руну. У других героев, когда их скорость передвижения превышает 390, анимация ходьбы не изменяется, а наоборот, ускоряется. Это хорошо заметно с героем Bloodseeker с его пассивным умением Thirst."],"talents":["Firestorm наносит 25% урона постройкам:+0,8 сек. оцепенения от Pit of Malice","+25 здоровья в секунду:+70 к скорости атаки","+15 к урону за героя от Atrophy Aura:+100 к дальности способностей","+25 к скорости передвижения:+18 к урону волны от Firestorm"],"desc":"%"}