{"abilities":[{"effects":["Radius: 1200","Damage Block Chance: 100%","Blocked Damage: 60","Armor Bonus: 2","Buff Duration: 12","Stack Limit Duration: 45"],"notes":["Interrupts the user's channeling spells upon cast.","Affects heroes, illusions and buildings. Affects them even while invulnerable or while hidden. Does not affect creep-heroes.","Does not affect units that have been affected by Guard in the last 45 seconds. A status buff icon on affected units shows how much time is left for it to be able to get affected again. The stack limit duration equals the cooldown (after all reductions), minus one. The duration is set upon cast and cannot be altered afterwards. Resetting the item's cooldown does not affect the stack limit duration.","Guard bonus armor does not stack with the armor gained from Mekansm and Buckler active abilities.","Does not work against wards ( Plague Ward, Mass Serpent Ward, Death Ward, Burning Army).","Does not reduce physical damage from spells, except from Moon Glaives and The Swarm.","For more details, see Damage Block."],"elements":["Ability No Target","Affects Allied Heroes"],"description":"For 12 seconds, grant nearby allied heroes and buildings +2 armor, and a 100% chance to block 60 damage from each incoming attack. Units may only be affected by Guard once every 45 seconds."},{"effects":["Proc Chance: 50%","Blocked Damage (Melee): 70","Blocked Damage (Ranged): 35"],"notes":["Does not work against wards ( Plague Ward, Mass Serpent Ward, Death Ward).","Does not reduce physical damage from spells, except from Moon Glaives and The Swarm.","Damage Block uses pseudo-random distribution.","For more details, see Damage Block."],"elements":["Ability Passive","Affects Self"],"description":"Grants a 50% chance to block 70 damage from incoming attacks on melee heroes, and 35 damage on ranged."}],"cost":"3700","description":"A cuirass originally built to protect against the dreaded Year Beast.","trivia":["The icon for this item is based on the armor worn by Ember Spirit on an old concept artwork."],"further":["Vanguard","Buckler","Recipe"],"tips":["The high damage block of Crimson Guard's active is good against illusions because their low damage is heavily reduced or negated completely.","Similarly, it is good against small summons such as Undying's zombies, Broodmother's spiderlings, or Nature's Prophet's treants to name a few.","Crimson Guard is effective against armor reduction as the damage block takes effect before the damage reduction of armor. This means that if incoming damage is actually going to be amplified due to negative armor, a large portion of it can be blocked before it is amplified.","The damage block and armor reduces a lot the damage returned by an enemy Blade Mail."],"attrs":["Active Guard","Passive Damage Block","Bonus +2 Strength +2 Agility +2 Intelligence +250 Health +7 Health regeneration +5 Armor","Disassemble? No","Alert allies? Yes"],"info":["For strength heroes, it grants 290 health, 7.2 health regen, 0.16% magic resistance, 5.32 armor, 2 attack speed, 0.1% movement speed, 24 mana, 0.1 mana regen, 0.14% spell damage and 2 attack damage.","For agility heroes, it grants 290 health, 7.2 health regen, 0.16% magic resistance, 5.32 armor, 2 attack speed, 0.1% movement speed, 24 mana, 0.1 mana regen, 0.14% spell damage and 2 attack damage.","For intelligence heroes, it grants 290 health, 7.2 health regen, 0.16% magic resistance, 5.32 armor, 2 attack speed, 0.1% movement speed, 24 mana, 0.1 mana regen, 0.14% spell damage and 2 attack damage."]}