{"abilities":[{"effects":["Радиус: 1200","Заблокированный урон: 60","Дополнительная броня: 2","Длительность: 12","Длительность запрета за складывание: 45"],"notes":["При использовании прерывает произносимые заклинания.","Влияет на героев, иллюзии and строения. Влияет на них, даже если они неуязвимы или спрятаны. Не влияет на крипов-героев.","Не влияет на героев, если они находились под эффектом Guard последние 45 секунд. В панели эффектов можно посмотреть время окончания эффекта для его повторной активации.","Бонус к броне не суммируется с броней, даваемой активными способностями Mekansm и Buckler.","Не работает против вардов ( Plague Ward, Mass Serpent Ward, Death Ward).","Не блокирует физический урон от способностей, кроме Moon Glaives и The Swarm.","Для более подробной информации смотрите статью Блокировка урона."],"elements":["Способность Ненаправленная","Действует на Союзных героев"],"name":"Guard","description":"Дает героям поблизости 2 брони и шанс 100% заблокировать 50 урона от каждой атаки. Длится 12 секунд."},{"effects":["Шанс блокировки: 50%","Заблокированный урон (ближний бой): 70","Заблокированный урон (дальний бой): 35"],"notes":["Crimson Guard не блокирует урон от Plague Wards, Serpent Wards, Death Ward, или Exorcism.","Не блокирует физический урон от способностей, кроме Moon Glaives и The Swarm.","Damage Block использует псевдослучайное распределение.","Для более подробной информации смотрите статью Блокировка урона."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Damage Block","description":"Дает владельцу шанс заблокировать урон от каждой атаки в зависимости от типа атаки вашего героя."}],"cost":"3700","description":"Кираса, изначально выкованная, чтобы защищать от ужасающего Годня.","further":["Vanguard","Buckler","Рецепт"],"attrs":["Активируемая Guard","Пассивная Damage Block","Бонус +2 к силе +2 к ловкости +2 к интеллекту +250 к здоровью +8 к регенерации здоровья +5 к броне","Можно разобрать? Нет","Можно сообщать? Да"],"info":["Для героев силы, даёт 290 здоровья, 8,2 регенерации здоровья, 0,16% сопротивления магии, 5,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.","Для героев ловкости, даёт 290 здоровья, 8,2 регенерации здоровья, 0,16% сопротивления магии, 5,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.","Для героев интеллекта, даёт 290 здоровья, 8,2 регенерации здоровья, 0,16% сопротивления магии, 5,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки."]}