{"abilities":[{"effects":["Радиус: 1200","Шанс заблокировать урон: 100%","Блокируемый урон: 60","Длительность баффа: 12","Длительность до повторного использования: -1"],"notes":["При использовании прерывает произносимые заклинания.","Действует на героев, иллюзии и строения. Действует на них, даже если они неуязвимы или спрятаны. Не действует на крипов-героев.","Не действует на героев, если они находились под эффектом Guard последние -1 секунд. В панели эффектов можно посмотреть время окончания эффекта для его повторной активации.","Не работает против вардов ( Plague Ward, Mass Serpent Ward, Death Ward, Burning Army).","Не блокирует физический урон от способностей, кроме Moon Glaives и The Swarm.","Для более подробной информации смотрите статью Блокировка урона."],"elements":["Способность Ненаправленная","Действует на Союзных героев"],"name":"Guard","description":"Дает героям поблизости 2 брони и шанс 100% заблокировать 50 урона от каждой атаки. Длится 12 секунд."},{"effects":["Шанс блокировки: 50%","Заблокированный урон (ближний бой): 70","Заблокированный урон (дальний бой): 35"],"notes":["Crimson Guard не блокирует урон от вардов ( Plague Ward, Mass Serpent Ward, Death Ward).","Не блокирует физический урон от способностей, кроме Moon Glaives и The Swarm.","Damage Block использует псевдослучайное распределение.","Для более подробной информации смотрите статью Блокировка урона."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Damage Block","description":"Дает владельцу шанс заблокировать урон от каждой атаки в зависимости от типа атаки вашего героя."}],"cost":"3800","description":"Кираса, изначально выкованная, чтобы защищать от ужасающего Годня.","further":["Vanguard","Helm_of_Iron_Will","Рецепт"],"attrs":["Активная Guard","Пассивная Damage Block","Бонус +3 к силе +3 к ловкости +3 к интеллекту +250 к здоровью +10,5 к регенерации здоровья +6 к броне","Можно разобрать? Нет","Можно сообщать? Да"],"info":["Для героев силы, даёт 310 здоровья, 10,8 регенерации здоровья, 0,24% сопротивления магии, 6,48 брони, 3 скорости атаки, 0,15% скорости передвижения, 36 маны, 0,15 регенерации маны, 0,21% урона от способностей и 3 урона от атаки.","Для героев ловкости, даёт 310 здоровья, 10,8 регенерации здоровья, 0,24% сопротивления магии, 6,48 брони, 3 скорости атаки, 0,15% скорости передвижения, 36 маны, 0,15 регенерации маны, 0,21% урона от способностей и 3 урона от атаки.","Для героев интеллекта, даёт 310 здоровья, 10,8 регенерации здоровья, 0,24% сопротивления магии, 6,48 брони, 3 скорости атаки, 0,15% скорости передвижения, 36 маны, 0,15 регенерации маны, 0,21% урона от способностей и 3 урона от атаки."]}