{"abilities":[{"effects":["Радиус: 900","Заблокированный урон: 60","Дополнительная броня: 2","Длительность: 12","Длительность запрета за складывание: 46"],"notes":["Interrupts the user's channeling spells upon cast.","Affects heroes, illusions and buildings. Affects them even while invulnerable or while hidden. Does not affect creep-heroes.","Does not affect heroes that have been affected by Guard in the last 46 seconds. A status buff icon on affected units shows how much time is left for it to be able to get affected again.","Guard bonus armor does not stack with the armor gained from Mekansm and Buckler active abilities.","Does not work against wards ( Plague Ward, Mass Serpent Ward, Death Ward).","Does not reduce physical damage from spells, except from Moon Glaives and The Swarm.","For more details, see Damage Block."],"elements":["Способность Ненаправленная","Действует на Союзных героев"],"name":"Guard","description":"Дает героям поблизости 2 брони и шанс 100% заблокировать 50 урона от каждой атаки. Длится 10 секунд."},{"effects":["Шанс блокировки: 50%","Заблокированный урон (ближний бой): 70","Заблокированный урон (дальний бой): 35"],"notes":["Crimson Guard не блокирует урон от Plague Wards, Serpent Wards, Death Ward, или Exorcism.","Does not reduce physical damage from spells, except from Moon Glaives and The Swarm.","Damage Block uses pseudo-random distribution.","For more details, see Damage Block."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Damage Block","description":"Дает владельцу шанс заблокировать урон от каждой атаки в зависимости от типа атаки вашего героя."}],"cost":"1550","description":"Кираса, изначально выкованная, чтобы защищать от ужасающего Годня.","further":["Vanguard","Buckler","Рецепт"],"attrs":["Активируемая Guard","Пассивная Damage Block","Бонус +2 к силе +2 к ловкости +2 к интеллекту +250 к здоровью +8 к регенерации здоровья +5 к броне","Можно разобрать? Нет","Можно сообщать? Да"],"info":["Для героев силы, даёт 290 здоровья, 8,2 регенерации здоровья, 0,16% сопротивления магии, 5,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.","Для героев ловкости, даёт 290 здоровья, 8,2 регенерации здоровья, 0,16% сопротивления магии, 5,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки.","Для героев интеллекта, даёт 290 здоровья, 8,2 регенерации здоровья, 0,16% сопротивления магии, 5,32 брони, 2 скорости атаки, 0,1% скорости передвижения, 24 маны, 0,1 регенерации маны, 0,14% урона от способностей и 2 урона от атаки."]}