{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Shadow_Amulet_Fade.mp3\/revision\/latest?cb=20191227195530",
      "effects": [
        "Дальность применения: 600",
        "Время до невидимости: 1,25",
        "Длительность: 15"
      ],
      "notes": [
        "Не прерывает произнесение заклинания у игрока при применении, ни при использовании на себя, ни при использовании на союзников. Владельцу не нужно поворачиваться к цели, чтобы использовать Shadow Amulet. ↓↓ Двойное нажатие автоматически выберет себя.",
        "Владельцу не нужно поворачиваться к цели, чтобы использовать Shadow Amulet.",
        "↓↓ Двойное нажатие автоматически выберет себя.",
        "Можно применить на иллюзии и крипов-героев.",
        "Во время ухода в невидимость, существо всё ещё может использовать способности, предметы и совершать атаки. В отличие от других источников невидимости, автоматические начатые атаки не прерываются во время ухода в невидимость.",
        "В отличие от других источников невидимости, автоматические начатые атаки не прерываются во время ухода в невидимость.",
        "После ухода в невидимость, существо останавливается и перестаёт атаковать, но не прекращает применять заклинание.",
        "Во время невидимости, существо может поворачиваться, подбирать и выкладывать предметы без потери невидимости. Существо становится сквозным, поэтому другие существа могут проходить сквозь него, не сталкиваясь с ним.",
        "Существо становится сквозным, поэтому другие существа могут проходить сквозь него, не сталкиваясь с ним.",
        "Невидимость пропадает, если окончилось время применения заклинания, при выполнении атаки или принудительном движении, кроме тех случаев, когда движение происходит только вверх."
      ],
      "mana": "0",
      "abilityName": "Fade",
      "cooldown": "7\/0",
      "description": "Накладывает на героя или выбранного союзника невидимость, которая действует, пока цель стоит на месте. Цель входит в невидимость за 1,25 сек. и мгновенно выходит из неё при передвижении. Не начинает перезаряжаться, если применить на себя.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1000",
  "lore": null,
  "consistFrom": null,
  "name": "Shadow Amulet",
  "description": "Маленький талисман, затеняющий взор ваших врагов, но требующий абсолютной неподвижности.",
  "trivia": null,
  "upgradeIn": [
    "Glimmer Cape",
    "Shadow Blade"
  ],
  "tips": null
}