{
  "abilities": [
    {
      "notes": [
        "Замедление и бонус к скорости не связаны друг с другом\n Grave Chill не вытягивает скорость буквально\n То есть скорость передвижения Visage увеличивается на 15%\/20%\/25%\/30%, когда скорость цели снижается на 15%\/20%\/25%\/30%; каждый показатель основывается на собственном значении скорости передвижения\n То же самое относится и к скорости атаки\n Скорость атаки Visage увеличивается на 25\/40\/55\/70, когда скорость атаки цели снижается на 25\/40\/55\/70\n Также потеря баффа или дебаффа одним существом не означает их потерю у другого",
        "Также Grave Chill даёт бафф  гаргульям в радиусе 900 от Visage\n Бафф для гаргулий - не аура\n Он даётся в виде отдельного баффа для каждой гаргульи\n То есть после применения гаргульи могут удаляться от Visage и при этом сохранять бафф\n При развеивании баффа с Visage у гаргулий он не исчезает, но его можно развеять с них по отдельности\n Даёт бафф неуязвимым существам, поэтому гаргульи в форме  Stone Form также его получают\n Бафф не даётся другим подконтрольным Visage существам"
      ],
      "item_behaviour": [],
      "description": "Крадёт скорость передвижения и атаки цели, прибавляя эти показатели себе и гаргульям неподалёку.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 625",
        "Радиус поиска гаргулий: 900",
        "Изменение скорости передвижения: 15%\/20%\/25%\/30%",
        "Изменение скорости атаки: 25\/40\/55\/70",
        "Длительность: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Visage_Grave_Chill.mp3\/revision\/latest?cb=20191216030319",
      "effects": [
        "Способность: Направленная на существо"
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "aghanim": null,
      "name": "Grave Chill",
      "cooldown": "100",
      "legacy_key": "G",
      "story": "Тепло солнечного света никогда не просачивалось в тёмные и холодные коридоры Узкого Лабиринта."
    },
    {
      "notes": [
        "Снаряд летит со скоростью в 1000",
        "Каждый момент получения героями в радиусе 1800 урона сохраняется 6 сек\n или до использования способности\n Когда общее количество учтенного урона превышает порог, то к способности добавляется заряд\n Для получения максимального числа зарядов требуется за 6 сек\n зафиксировать 0,5 единиц урона",
        "Учитываются все 3 типа урона между 2 – 3000 (до учёта сопротивлений)\n Учитывает только урон, наносимый игроками (включая их призываемых существ и клонов) или  Рошаном\n Учитывает только урон, полученный героями (включая клонов, но исключая иллюзии и крипов-героев)\n Не учитывает наносимый себе урон, урон меньше 2 единиц или превышающий 3000 единиц (после уменьшений)",
        "Текущее число зарядов отображается в виде желтых делений над Visage\n Они видны только Visage и его союзникам",
        "Визуальное оформление снаряда также отображает число зарядов, раскрывая примерное количество наносимого урона\n При использовании Soul Assumption её урон фиксируется, а заряды считаются потраченными при запуске снаряда",
        "С 0\/1\/2\/3\/4\/5\/6 зарядами Soul Assumption наносит до 20\/90\/160\/230\/300\/370\/440 ( 20\/110\/200\/290\/380\/470\/560) урона по цели (до уменьшений)",
        "При выборе увеличивающего число целей  таланта заклинание запускает второй снаряд в случайную видимую подходящую цель в радиусе применения\n Радиус поиска основывается на дальности применения плюс доп\n дальность, в итоге выбирая цель на расстоянии до 1300 единиц\n Не может запустить второй снаряд в основную цель, поэтому, если поблизости нет других целей, ничего не произойдет\n У героев и иллюзий приоритет выше, чем у остальных существ\n Считает крипов-героев за крипов\n Поскольку талант использует дальность применения заклинания, то эффекты, увеличивающие дальность применения, так же влияют на дальность второго снаряда"
      ],
      "item_behaviour": [],
      "description": "Способность получает заряд каждый раз, когда нанесённый героям неподалёку урон превышает 100. Наносит выбранной цели урон, зависящий от числа зарядов.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,57",
        "Дальность применения: 1000",
        "Радиус сбора зарядов: 1800",
        "Число целей: 1 ( 2)",
        "Урон для заряда: 100",
        "Максимально зарядов: 3\/4\/5\/6",
        "Базовый урон: 20",
        "Урон за заряд: 70 ( 90)",
        "Срок действия заряда: 6",
        "Доп\n расстояние для поиска вторичной цели:  300"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/54\/Visage_Soul_Assumption_1.mp3\/revision\/latest?cb=20191216030321",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "4",
      "aghanim": null,
      "name": "Soul Assumption",
      "cooldown": "135",
      "legacy_key": "C",
      "story": "Собранные души мертвых вырываются, чтобы забрать к себе в стаю ещё одну."
    },
    {
      "notes": [
        "Уменьшение урона снижает урон от всех трех типов урона за исключением урона, отмеченного как отнимающий здоровье",
        "Реагирует только на источник урона, превышающий 80% (после все прочих уменьшений)\n Урон ниже этого значения способностью игнорируется",
        "Реагирует только на урон, наносимый игроками, за исключением наносимого себе",
        "Чтобы узнать, как сильно снижает урон Gravekeeper Cloak на каждом уровне при разном количестве слоёв, смотрите таблицу ниже",
        "Аура влияет на всех  гаргулий под контролем Visage\n Она даёт им уменьшение урона в зависимости от текущего числа зарядов у Visage и не имеет ограничения максимального умньшения\n В отличии от уменьшения урона для героя оно не имеет минимального порога урона\n Действует на неуязвимых, но не на спрятанных гаргулий",
        "Бафф ауры задерживается на 0,5 секунды",
        "<span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard превращает Gravekeeper's Cloak в активную способность, сохраняющую пассивные компоненты\n Использует все значения Stone Form от  Summon Familiars текущего уровня, за исключением регенерации здоровья\n Во время задержки эффекта на Visage действует оцепенение, запрещая ему двигаться\n Во время задержки герой может поворачиваться, атаковать и использовать заклинания и предметы\n После задержки регенерация здоровья Visage значительно увеличивается, сам герой становится неуязвимым и обезвреживается\n Увеличивает регенерацию здоровья Visage на 4.17% на всю длительность\n Оглушение и урон по области так же применяются сразу после задержки\n Область оглушения и урона определяются при приземлении, а не при применении\n При приземлении деревья вокруг разрушаются\n Сначала применяет дебафф, затем наносит урон\n Если Visage умирает во время задержки, то урон и оглушение по области не применяются, но визуальные эффекты все равно появляются\n Длительность отображается желтыми цифрами над Visage; они видны только заклинателю",
        "Дающий броню  талант увеличивает броню только на своё значение, а не за каждый слой\n Даже если слои закончатся, способность продолжит давать броню"
      ],
      "item_behaviour": [],
      "description": "Герой создаёт на себе слоистый защитный барьер. Если герой получает урон от игрока, один слой исчезает и восстанавливается спустя определённое время.",
      "hot_key": "E",
      "params": [
        "Радиус ауры: 900",
        "Максимум слоев: 4",
        "Уменьшение урона за слой: 8%\/12%\/16%\/20%",
        "Макс\n уменьшение урона: 80%",
        "Мин\n порог урона: 40",
        "Время восстановления слоя: 6\/5\/4\/3",
        "Длительность задержки ауры: 0,5",
        "Восстановление здоровья:  25%",
        "Бонус к броне:  10"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя ",
        "Урон: "
      ],
      "mana": "65",
      "aghanim": null,
      "name": "Gravekeeper's Cloak",
      "cooldown": "125",
      "legacy_key": "V",
      "story": "Прочная чешуя гаргульи разделяет свойства камня и призрака, делая её практически невосприимчивой к мечу и магии."
    },
    {
      "notes": [
        "При применении Stone Form не прерывает произносимые заклинания Visage",
        "Способность неактивна, если ни у одной из  гаргулий нет готовой к применению  Stone Form\n Способность уходит на перезарядку, равную наименьшему значению перезарядки Stone Form у гаргулий\n Перезарядка ничем не уменьшается; она периодически проверяет наличие готовой к применению Stone Form\n То есть при повторном призыве гаргулий вспомогательная способность будет мгновенно готова",
        "При использовании отдает приказ ближайшей гаргульи автоматически использовать Stone Form\n Если гаргулья оглушена, обезмолвлена, спрятана, находится под действием сна гипноза, страха или провокации, то она не может использовать Stone Form",
        "Несмотря на то, что при ручном использовании Stone Form гаргулий реагируют эффекты, срабатывающие от применения, на способность героя эти эффекты не распространаются, поскольку она — вспомогательная",
        "Можно использовать при оглушении, сне, исчезновении, действии урагана или принудительного движения",
        "Нельзя использовать при безмолвии, проклятии или действии эффектов, предотвращающих действия\n Нельзя поставить в очередь действий"
      ],
      "item_behaviour": [],
      "description": "После небольшой задержки гаргулья обращается в камень и падает на землю, оглушая врагов в небольшой области и нанося им урон. По приземлении она становится неуязвимой и очень быстро восстанавливает здоровье. Через 6 сек. гаргулья возвращается в обычное состояние.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Stone Form",
      "cooldown": "0",
      "legacy_key": "F",
      "story": null
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter для разблокировки",
        "При применении не прерывает произносимые заклинания Visage",
        "Действует только на Visage и его  гаргулий, но не других подконтрольных существ\n При этом гаргульям необязательно находиться рядом — способность действует везде",
        "Невидимость пропадает, если завершилась анимация применения заклинаний или атака попала во врага\n То есть, при промахнувшейся атаке невидимость не теряется\n Visage может поднимать, выкидывать и атаковать предметы без выхода из невидимости",
        "Даёт Visage сквозное передвижение, позволяя везде перемещаться\n У гаргулий эта возможность есть по умолчанию\n Не даёт герою летающий обзор",
        "Дополнительный урон даётся при потере баффа невидимости любым путем\n Урон так же даётся самим баффом невидимости, поэтому первая атака из неё будет с учетом бонуса\n Увеличивает только базовый урон и урон, даваемый основным атрибутом затронутых существ\n Дополнительный урон не увеличивается"
      ],
      "item_behaviour": [],
      "description": "Герой и его гаргульи взлетают, становятся невидимым и передвигаются на 20% быстрее. Прервав невидимость заклинанием или атакой, герой и гаргульи наносят на 25% больше в течение 4 секунд. Длительность 35 секунд.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0",
        "Время до невидимости: 0",
        "Доп\n скорость передвижения: 20%",
        "Доп\n урон: 25%",
        "Длительность доп\n урона: 4",
        "Длительность невидимости: 35"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d9\/Visage_Silent_as_the_Grave.mp3\/revision\/latest?cb=20210103162730",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Себя"
      ],
      "mana": "45",
      "aghanim": null,
      "name": "Silent as the Grave",
      "cooldown": "100",
      "legacy_key": "E",
      "story": null
    },
    {
      "notes": [
        "При применении Summon Familiars прерывает произносимые заклинания Visage",
        "Урон, здоровье и броня гаргулий обновляются только при повторном призыве, а не при повышении уровня способности\n Уровень  Stone Form обновляется только при повторном призыве\n Использование способности заменяет существующих гаргулий вновь призванными",
        "Гаргульи призываются в 200 единицах перед Visage с расстоянием между ними в 120 единиц\n Visage считается за центр расположения\n Гаргульи летают\n Гаргульи — древние крипы-герои, поэтому некоторые заклинания взаимодействуют с ними иначе",
        "Гаргульи по умолчанию имеют скрытый модификатор, который управляет бонусами от  талантов для них\n По этой причине увеличивающие урон от атаки и скорость передвижения  таланты немедленно применяются к существующим гаргульям\n  Снижение брони от разных источников полностью сочетается\n Visage и все гаргульи могут суммарно снизить броню противника на 3 ( 4)"
      ],
      "item_behaviour": [],
      "description": "Призывает двух слепых гаргулий, которые будут сражаться на стороне героя. Гаргульи имеют способность Stone Form, которая позволяет им превратиться в камень, оглушая врагов при приземлении. В каменной форме гаргульи неуязвимы и быстро восстанавливают здоровье. За убийство гаргулий враг получает значительную награду.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Число гаргулий: 2 ( 3)",
        "Длительность жизни гаргулей: Бесконечно"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Visage_Summon_Familiars.mp3\/revision\/latest?cb=20191216030324",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "mana": "130\/120\/110",
      "aghanim": null,
      "name": "Summon Familiars",
      "cooldown": "150",
      "legacy_key": "T",
      "story": "Стражи Узкого лабиринта, приспешники Некро'лика, неустанно следят за его владениями."
    },
    {
      "notes": [
        "Гаргулья находится в оцепенении во время задержки эффекта в 0,55 сек\n Она может поворачиваться, атаковать и применять способности во время задержки эффекта",
        "Stone Form сперва применяет дебафф, а затем — урон",
        "После задержки эффекта, гаргулья становится неуязвимой и обезвреженной\n Наносит 60\/100\/140 урона в области и оглушает на 1\/1,25\/1,5 сек., а также восстанавливает до 900\/1050\/1200 здоровья за всю длительность\n Если гаргулья умирает во время задержки эффекта, то урон в области и оглушение не применяются, но визуальные эффекты всё ещё появляются\n Длительность отображается в виде желтого числа над гаргульей\n Это число видимо только для Visage",
        "Место урона и оглушения определяется после приземления, а не после применении\n После приземления, в радиусе 375 уничтожаются деревья"
      ],
      "item_behaviour": [],
      "description": "После небольшой задержки ближайшая гаргулья обращается в камень и падает на землю, оглушая врагов в небольшой области и нанося им урон. По приземлении она становится неуязвимой и очень быстро восстанавливает здоровье. Через 6 сек. гаргулья возвращается в обычное состояние.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус эффекта: 375",
        "Задержка эффекта: 0,55",
        "Доп\n восстановление здоровья: 150\/175\/200",
        "Урон: 60\/100\/140",
        "Длительность оглушения: 1\/1,25\/1,5",
        "Длительность окаменения: 6"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Visage_Familiar_Stone_Form_1.mp3\/revision\/latest?cb=20191216030317",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "14",
      "aghanim": null,
      "name": "Stone Form",
      "cooldown": "0",
      "legacy_key": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 1.3,
    "attrAgility": 11.0
  },
  "description": "Разведывает территорию и нападает своими гаргульями Разведывая смертоносными гаргульями поле боя, Visage покрывает себя бронёй и ищет битвы. Оказавшись рядом со схваткой, он обращает страдания тех, кто получает урон, в мощные заряды энергии и сокрушает ими врагов.  Поддержка Быстрый урон Стойкость Контроль Осада ★★★",
  "history": "Над входом в Узкий лабиринт восседают жуткие фигуры насмешливых гаргулий, и путь навеки попавших в этот мир лежит под их пристальным взглядом. Звери и птицы, люди и чудища — все существа, что умирают или проникают в мир иной, обязательно минуют их пост. Отделённый от тела дух, решив однажды пройти сквозь смертную завесу, уже не может вернуться обратно. Но если случается так, что силой или хитростью некая беспокойная душа покидает ад или небеса, то ужасающая гаргулья — воплощённая форма вечного духа по имени Некро'лик — отправляется за беглецом, чтобы вернуть его. Беспощадный и безупречный, неподвластный смерти и усталости, каменный страж без сожаления и остановки преследует добычу, охотно уничтожая любого, кто приютит беглеца. Тот, кто следит за порядком в загробном мире, не знает покоя, и хотя мертвых иногда воскрешают, он найдёт и вернёт каждого на своё место."
}