{
  "abilities": [
    {
      "notes": [
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на ловкость в общем даёт Ursa: 2 брони, 12 скорости атаки и 12 урона от атаки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+3 к числу атак от Overpower",
          "talentRight": "+480 к радиусу Earthshock"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+12 к урону от Fury Swipes",
          "talentRight": "+1,2 сек. действия Enrage"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+300 к здоровью",
          "talentRight": "+12 к ловкости"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+1,5 маны в секунду",
          "talentRight": "+20 сек. действия Fury Swipes"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Ursa_Earthshock.mp3\/revision\/latest?cb=20191216030125",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При применении Earthshock прерывает произносимые заклинания Ursa.",
        "При применении Ursa прыгает вперед на 250 единиц по дуге высотой 83. Пока герой в воздухе, под ним могут проходить другие существа.",
        "Прыгает со скоростью в 1000 в течение 0,25 секунды.",
        "Может перепрыгивать через существ и непроходимую территорию.",
        "Во время прыжка Ursa может атаковать, использовать заклинания и предметы и поворачиваться.",
        "Earthshock применяется при потере баффа прыжка; т.е. если прыжок прервали (даже смертью), то способность применится в текущем местоположении Ursa.",
        "Earthshock сначала применяет дебафф, затем наносит урон."
      ],
      "mana": "85",
      "hotKey": "Q",
      "cooldown": "11\/10\/9\/8 (TagTalent 9,8\/8,8\/7,8\/6,8)",
      "description": "Герой прыгает вперёд на расстояние в 250 и бьёт по земле, нанося урон всем врагам вокруг и замедляя их на 4 сек.",
      "spellName": "Earthshock",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 385 (TagTalent 865)",
        "Дальность прыжка: 250",
        "Урон: 75\/125\/175\/225",
        "Замедление скорости передвижения: 10%\/25%\/40%\/55%",
        "Длительность замедления: 4",
        "Длительность прыжка: 0,25",
        "Замедление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Прыжок мгновенно прерывается при получении оцепенения. При применении под действием оцепения способность мгновенно применится в текущей точке."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Как земля содрогается под весом его могучих медвежьих шагов, так и противники начинают дрожать при его виде."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Ursa_Overpower.mp3\/revision\/latest?cb=20191216030123",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Не дает максимальную скорость атаки. Даваемая скорость атаки может сведена на нет сильным замедлением.",
        "Заряды тратятся при совершении атаки вне зависимости от результата. То есть промахнувшиеся атаки также расходуют заряды.",
        "В списке бафов можно увидеть число оставшихся атак.",
        "Несколько применений не складываются, но обновляют число зарядов."
      ],
      "mana": "40\/50\/60\/70",
      "hotKey": "W",
      "cooldown": "15\/13\/11\/9",
      "description": "Используя свой боевой опыт, герой увеличивает скорость нескольких следующих атак.",
      "spellName": "Overpower",
      "params": [
        "Анимация применения: 0,3+0",
        "Доп. скорость атаки: 400",
        "Число атак: 3\/4\/5\/6 (TagTalent 6\/7\/8\/9)",
        "Длительность: 20"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "Внушительный размер обманчив — Ульфсаар чрезвычайно ловок."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Физический"
      ],
      "notes": [
        "Каждая атака с Fury Swipes сначала добавляет один эффект, а затем наносит урон, основанный на количестве зарядов. То есть дополнительный урон применяется даже при первой атаке.",
        "То есть дополнительный урон применяется даже при первой атаке.",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, может быть прорубающим, но не может быть критическим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, может быть прорубающим, но не может быть критическим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "Каждая успешная атака обновляет все эффекты. Промахнувшиеся атаки не применяют бафф и не добавляют\/обновляют эффекты.",
        "В списке баффов атакованных существ можно увидеть число зарядов.",
        "Не действует на строения, варды и союзных существ при атаке.",
        "Талант на увеличение длительности эффектов не влияет на длительность зарядов на Рошане."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Когти героя всё глубже впиваются в плоть врага, нанося увеличенный урон с каждой последующей атакой. Дополнительный урон будет потерян, если не атаковать цель в течение 8\/12\/16\/20 секунд.",
      "spellName": "Fury Swipes",
      "params": [
        "Доп. урон за атаку: 9\/18\/27\/36 (TagTalent 21\/30\/39\/48)",
        "Длительность: 8\/12\/16\/20 (TagTalent 28\/32\/36\/40)",
        "Длительность на Рошане: 10",
        "Предотвращает появление новых эффектов. Уже существующие продолжают давать дополнительный урон."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "В природе раненые редко выживают после атак голодных хищников."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5a\/Ursa_Enrage.mp3\/revision\/latest?cb=20191216030122",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "При использовании Enrage прерывает произносимые заклинания Ursa.",
        "При использовании применяет к Ursa сильное развеивание.",
        "80% снижение урона уменьшает все 3 типа урона.",
        "Не снижает урон от способностей, отнимающих здоровье.",
        "Сопротивление эффектам сочетается по закону убывающей полезности с другими источниками сопротивления.",
        "При улучшении Aghanim's Scepter Enrage можно применить при действии оглушения, урагана, сна, провокации, исчезновения или принудительного движения. Способность нельзя использовать при безмолвии, проклятии или предотвращении действий. При этом её нельзя поставить в очередь действий.",
        "Способность нельзя использовать при безмолвии, проклятии или предотвращении действий. При этом её нельзя поставить в очередь действий.",
        "Перекрашивает модель Ursa в пылающий красный и увеличивает её размер на 20% (не влияет на её размер столкновения)."
      ],
      "mana": null,
      "hotKey": "R",
      "cooldown": null,
      "description": "Приводит героя в бешенство, отчего он получает сопротивление эффектам и урону. Снимает все отрицательные эффекты.",
      "spellName": "Enrage",
      "params": [
        "Анимация применения: 0+0",
        "Снижение получаемого урона: 80%",
        "Доп. сопротивление эффектам: 50%",
        "Длительность: 4\/4,5\/5 (TagTalent 5,2\/5,7\/6,2)",
        "Уменьшает время перезарядки и позволяет применять эту способность, даже когда герой выведен из строя."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Ульфсаар отдается своему древнему духу, приобретая невиданную свирепость."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 24.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 2.4,
    "attrAgility": 18.0
  },
  "description": "Ursa — это герой с ближним типом атаки, основной характеристикой которого является Ловкость. Первой способностью, Earthshock, Ursa бьет о землю, нанося урон всем вражеским юнитам неподалеку и замедляя их. Второй способностью, Overpower, Ursa увеличивает скорость атаки на несколько следующих атак. Пассивная способность, Fury Swipes, позволяет наносить Ursa увеличенный урон с каждой последующей атакой. Дополнительный урон будет потерян, если цель не будет атакована некоторое время. Ультимативная способность, Enrage, увеличивая урон от Fury Swipes и получая на 80% меньше урона. Снимает все негативные эффекты.",
  "history": "Воин Ульфсаар — сильнейший член медвежьего племени, стоящий горой за свои земли и свой народ. Долгими зимами, пока матери спали и нянчили своих детёнышей, на страже стояли самцы — ревнители древних обычаев. Едва заслышав о надвигающейся угрозе, Ульфсаар направился за границы родной чащи, дабы выследить и уничтожить источник зла, пока то не навредило его народу. Ульфсаар — гордый зверь с сильным духом, крайне надёжный товарищ и невероятно стойкий защитник.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+3 к числу атак от Overpower",
      "talentRight": "+480 к радиусу Earthshock"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+12 к урону от Fury Swipes",
      "talentRight": "+1,2 сек. действия Enrage"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+300 к здоровью",
      "talentRight": "+12 к ловкости"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+1,5 маны в секунду",
      "talentRight": "+20 сек. действия Fury Swipes"
    }
  ]
}