{
  "abilities": [
    {
      "notes": [
        "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
        "Талант на сопротивление магии увеличивает сопротивление магии Elder Titan до 36,25%.",
        "Рассечение имеет начальный радиус 150, расстояние 650 и конечный радиус 360. Для дополнительной информации, смотрите рассекающий удар.",
        "Рассечение от талантов не отключается истощением."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+450 к урону для пробуждения от Echo Stomp",
          "talentRight": "-60 сек. перезарядки Earth Splitter"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 к урону от Echo Stomp",
          "talentRight": "+100% к прорубанию"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25 к урону за героя от Astral Spirit",
          "talentRight": "+15% к сопротивлению магии"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+20 к скорости атаки",
          "talentRight": "+15 к скорости передвижения"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/67\/Echo_Stomp.mp3\/revision\/latest?cb=20150615110411",
      "effects": [
        "Способность Ненаправленная \/ Произносимая (TagAghanim Авто-применяемая)",
        "Действует на Врагов",
        "Урон Физический \/ Магический"
      ],
      "notes": [
        "Применяет сон ко всем затронутым юнитам, предотвращая их действия до пробуждения.",
        "Если юнит попадет под два типа урона от способности, то получит 140\/200\/260\/320 (TagTalent 340\/400\/460\/520) единиц урона (до уменьшений).",
        "Способность сначала наносит урон, затем применяет дебафф.",
        "Когда Astral Spirit призван, способность синхронно используется духом и героем. Сон срабатывает на всех существ как вокруг героя, так и вокруг духа. Даже если существо попало под действие способности героя и духа одновременно, длительность сна не увеличится. Если дух не призван, оба типа урона - магический и физический - будут нанесены вокруг Elder Titan.",
        "Сон срабатывает на всех существ как вокруг героя, так и вокруг духа. Даже если существо попало под действие способности героя и духа одновременно, длительность сна не увеличится.",
        "Если дух не призван, оба типа урона - магический и физический - будут нанесены вокруг Elder Titan.",
        "Astral Spirit обладает идентичной способностью (с отличающейся иконкой). Приказав духу использовать ее, Elder Titan так же использует Echo Stomp. Если указать духу использовать способность пока Elder Titan оглушен, способность начнет перезарядку, однако ничего не произойдет. Тем не менее, использовав Echo Stomp после оглушения, дух выполнит свою часть заклинания, даже если она все еще перезаряжается. Если Elder Titan применяет Echo Stomp, пока Astral Spirit остановлен (например, Chronosphere), дух все равно выполнит свою часть заклинания. Echo Stomp нельзя отменить приказом \"стоп\" духу. Во время анимации способности дух не может действовать.",
        "Если указать духу использовать способность пока Elder Titan оглушен, способность начнет перезарядку, однако ничего не произойдет.",
        "Тем не менее, использовав Echo Stomp после оглушения, дух выполнит свою часть заклинания, даже если она все еще перезаряжается.",
        "Если Elder Titan применяет Echo Stomp, пока Astral Spirit остановлен (например, Chronosphere), дух все равно выполнит свою часть заклинания.",
        "Echo Stomp нельзя отменить приказом \"стоп\" духу. Во время анимации способности дух не может действовать.",
        "Затронутые существа не могут проснутся в первые 0,2 секунды сна. После базового оглушения существа смогут проснутся только после получения 50\/100\/150\/200 суммарного урона. Начинает сразу учитывать урон во время базового оглушения. Учитывает урон после всех сопротивлений. То есть если существо получит достаточно урона во время 0,2, то мгновенно пробудится во время получения следующего урона. Не учитывает урон от Astral Spirit, но учитывает урон от Earth Splitter.",
        "После базового оглушения существа смогут проснутся только после получения 50\/100\/150\/200 суммарного урона.",
        "Начинает сразу учитывать урон во время базового оглушения. Учитывает урон после всех сопротивлений.",
        "То есть если существо получит достаточно урона во время 0,2, то мгновенно пробудится во время получения следующего урона.",
        "Не учитывает урон от Astral Spirit, но учитывает урон от Earth Splitter.",
        "Усыпленные существа никогда не будут целью для автоатаки вне зависимости от настроек. Для их атаки необходимо напрямую отдать команду. То есть этих существ никогда не будут атаковать линейные и нейтральные крипы, башни и фонтан. Игроки все равно могут атаковать усыпленных юнитов.",
        "То есть этих существ никогда не будут атаковать линейные и нейтральные крипы, башни и фонтан.",
        "Игроки все равно могут атаковать усыпленных юнитов.",
        "При успешном произнесении и включении автоприменения, герой телепортируется на текущее место Astral Spirit. После телепортации Elder Titan смотрит в ту же сторону, куда он смотрел до неё. Если дух не был призван, то ничего не произойдёт. После телепортации героя, дух мгновенно вернётся к Elder Titan, дав ему все бонусы. Нельзя избежать снаряды с помощью телепортации.",
        "После телепортации Elder Titan смотрит в ту же сторону, куда он смотрел до неё.",
        "Если дух не был призван, то ничего не произойдёт.",
        "После телепортации героя, дух мгновенно вернётся к Elder Titan, дав ему все бонусы.",
        "Нельзя избежать снаряды с помощью телепортации."
      ],
      "mana": "85\/90\/95\/100",
      "hotKey": "Q",
      "cooldown": "14\/13\/12\/11",
      "description": "Герой и его дух сотрясают землю, нанося окружающим противникам урон и усыпляя их. Герой наносит этой способностью физический урон, а его дух — магический.",
      "spellName": "Echo Stomp",
      "params": [
        "Анимация применения: 0,4+0",
        "Время применения: 1,3",
        "Радиус: 500",
        "Физический урон: 70\/100\/130\/160 (TagTalent 170\/200\/230\/260)",
        "Магический урон: 70\/100\/130\/160 (TagTalent 170\/200\/230\/260)",
        "Урон для пробуждения: 50\/100\/150\/200 (TagTalent 500\/550\/600\/650)",
        "Длительность базового оглушения: 0,2",
        "Длительность сна: 2\/3\/4\/5",
        "Позволяет включить автоматическое применение Echo Stomp. Если оно включено, после применения способности герой перенесётся на место духа Astral Spirit.",
        "Оцепенение не предотвращает телепортацию."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Мощь созидания до сих пор отражается эхом в топоте титана."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Astral_Spirit.mp3\/revision\/latest?cb=20141126135128",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Дух находится под контролем Elder Titan до конца действия способности.",
        "Остальные игроки не могут выбрать духа, поэтому его нельзя использовать для блокировки выбора существ за ним.",
        "Духа нельзя задержать никаким заклинанием (в том числе Meat Hook, Sacred Arrow, Hookshot).",
        "Скорость передвижения духа приравнивается к скорости Elder Titan на момент призыва и не адаптируется при её изменении.",
        "С изученным Natural Order вокруг духа всегда распространяется дебафф ауры, усиливая наносимый духом урон.",
        "Astral Spirit сливается с Elder Titan как только оказывается в 100 единицах от него, позволяя возвращать духа, просто пройдя сквозь него.",
        "Использование Echo Stomp при возвращении духа заставит его остановится и начать произнесение его части заклинания. Дух продолжит возвращение при завершении применения.",
        "При возврате духа Elder Titan получает бафф Ancestral Spirit Buff, которые дает герою урон, скорость передвижении и броню на основе числа задетых врагов. Не учитывает иллюзии и курьеров. Считает крипов-героев за крипов. Если при повторном применении бафф еще действует, то при возвращении духа он обновит длительность, но не значение. Если дух не задел врагов, то бафф не применяется, а уже действующий - не обновляет длительность. Талант 25-го уровня также дает баффу эффект иммунитета к заклинаниям. Не применяет к герою развеивание.",
        "Не учитывает иллюзии и курьеров. Считает крипов-героев за крипов.",
        "Если при повторном применении бафф еще действует, то при возвращении духа он обновит длительность, но не значение.",
        "Если дух не задел врагов, то бафф не применяется, а уже действующий - не обновляет длительность.",
        "Талант 25-го уровня также дает баффу эффект иммунитета к заклинаниям. Не применяет к герою развеивание.",
        "Astral Spirit не блокирует лагери нейтральных крипов.",
        "С Aghanim's Scepter Elder Titan получает иммунитет к заклинаниям и базовое развеивание при возвращении духа. За каждого пораженного героя (включая клонов, исключая иллюзии и крипов-героев) длительность иммунитета увеличивается на 2 секунды. Если на героя действует бафф от предыдущего применения, то длительность увеличивается на 2 за каждого вражеского героя, задетого новым применением.",
        "За каждого пораженного героя (включая клонов, исключая иллюзии и крипов-героев) длительность иммунитета увеличивается на 2 секунды.",
        "Если на героя действует бафф от предыдущего применения, то длительность увеличивается на 2 за каждого вражеского героя, задетого новым применением.",
        "Здесь указано, сколько урона, скорости передвижения и брони даст Astral Spirit после поражения определенного числа героев:",
        "1 герой: 20\/40\/60\/80 (TagTalent 45\/65\/85\/105) урона, 1,5\/3\/4,5\/6 брони и 7% скорости передвижения",
        "2 героя: 40\/80\/120\/160 (TagTalent 90\/130\/170\/210) урона, 3\/6\/9\/12 брони и 14% скорости передвижения",
        "3 героя: 60\/120\/180\/240 (TagTalent 135\/195\/255\/315) урона, 4,5\/9\/13,5\/18 брони и 21% скорости передвижения",
        "4 героя: 80\/160\/240\/320 (TagTalent 180\/260\/340\/420) урона, 6\/12\/18\/24 брони и 28% скорости передвижения",
        "5 героев: 100\/200\/300\/400 (TagTalent 225\/325\/425\/525) урона, 7,5\/15\/22,5\/30 брони и 35% скорости передвижения"
      ],
      "mana": "80\/90\/100\/110",
      "hotKey": "W",
      "cooldown": "23\/21\/19\/17",
      "description": "Герой призывает астрального духа, который наносит урон каждому врагу, сквозь которого проходит. При воссоединении с владельцем дух дарует ему дополнительные урон, броню и скорость передвижения за каждого задетого им врага. Духом можно управлять, и он обладает способностями Echo Stomp, Return Spirit и Natural Order.",
      "spellName": "Astral Spirit",
      "params": [
        "Анимация применения: 0,4+0",
        "Дальность применения: 1200",
        "Радиус урона: 275",
        "Урон: 50",
        "Доп. скорость передвижения за крипа: 1%",
        "Доп. скорость передвижения за героя: 7%",
        "Граница доп. скорости передвижения: 40%",
        "Доп. урон за крипа: 3\/7\/11\/15",
        "Доп. урон за героя: 20\/40\/60\/80 (TagTalent 45\/65\/85\/105)",
        "Доп. броня за крипа: 0,5",
        "Доп. броня за героя: 1,5\/3\/4,5\/6",
        "Длительность духа: 8",
        "Длительность эффекта: 10",
        "Длительность иммунитета к заклинаниям за героя: 0 (TagAghanim 2)",
        "Помимо других эффектов дух даёт 2 сек. невосприимчивости к магии за каждого задетого вражеского героя.",
        "Не пытается нанести урон врагам с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Так же, как и четыре предвечных, титан существует во всех мирах одновременно, и может призывать другие свои сущности, когда ему это нужно."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/50\/Return_Astral_Spirit.mp3\/revision\/latest?cb=20141126135256",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Заменяет Astral Spirit до объединения духа с Elder Titan или до смерти героя.",
        "* При использовании Return Astral Spirit не прерывает произносимые способности Elder Titan.",
        "У Astral Spirit также есть эта способность.",
        "Сам Elder Titan не может использовать способность при обезвреживании, но Astral Spirit при обезвреженном герое - может",
        "Дух возвращается со скоростью 900."
      ],
      "mana": null,
      "hotKey": "W",
      "cooldown": null,
      "description": "Возвращает духа обратно к герою.",
      "spellName": "Return Astral Spirit",
      "params": [
        "Анимация применения: 0+0"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Врагов"
      ],
      "notes": [
        "Снижение брони действует только на базовую броню и броню, даваемую ловкостью. Дополнительная броня игнорируется.",
        "Снижение сопротивления магии действует только на базовое сопротивление. Дополнительное сопротивление магии игнорируется. То есть для героев с базовым сопротивлением магии в 25% способность снижает его на 10%\/15%\/20%\/25% - до 15%\/10%\/5%\/0%.",
        "То есть для героев с базовым сопротивлением магии в 25% способность снижает его на 10%\/15%\/20%\/25% - до 15%\/10%\/5%\/0%.",
        "Адаптирует снижение брони с интервалом в 0,5 секунды, базируясь на том, как меняется броня затронутых существ от потери или получения ловкости.",
        "С призванным Astral Spirit уменьшение сопротивления магии распространяется вокруг духа, а снижение брони - вокруг Elder Titan. Если дух не призван или Astral Spirit не изучена, то оба дебаффа распространяются вокруг Elder Titan.",
        "Если дух не призван или Astral Spirit не изучена, то оба дебаффа распространяются вокруг Elder Titan.",
        "Дебафф от ауры задерживается на 1 секунду. При этом, если Astral Spirit была использована, то враги вокруг Elder Titan, не попавшие в радиус действия ауры духа, мгновенно потеряют дебафф уменьшения сопротивления магии.",
        "При этом, если Astral Spirit была использована, то враги вокруг Elder Titan, не попавшие в радиус действия ауры духа, мгновенно потеряют дебафф уменьшения сопротивления магии."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Приводит сущность врагов к начальному небытию, снижая их базовый показатель брони и сопротивление магическому урону. Броню уменьшает сам герой, а сопротивление магии — дух от способности Astral Spirit.",
      "spellName": "Natural Order",
      "params": [
        "Радиус: 350",
        "Снижение базовой брони: 40%\/60%\/80%\/100%",
        "Снижение базового сопротивления магии: 40%\/60%\/80%\/100%",
        "Длительность задержки ауры: 1",
        "Поскольку Elder Titan распространяет только снижение брони, то отключается только эта аура. Уменьшение сопротивления магии продолжает действовать.",
        "В отличии от Astral Spirit, иллюзии применяют оба эффекта ауры."
      ],
      "itemBehaviour": [],
      "legacyKey": "N",
      "story": "Титан приводит все к первородному состоянию."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/dd\/Earth_Splitter.mp3\/revision\/latest?cb=20141126135205",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Физический \/ Магический"
      ],
      "notes": [
        "Наносит 15%\/20%\/25% от максимального здоровья задетых существ в виде магического урона, а затем 15%\/20%\/25% - в виде физического.",
        "Трещина распространяется со скоростью 910.",
        "Может поражать существ на расстоянии до 2415 единиц (складывается из длины трещины и радиуса).",
        "Также задевает существ на расстоянии 315 единиц позади места применения заклинания Elder Titan.",
        "Визуально трещина достигает длины до 2600 единиц, но эффекты заканчивают действие на 2100 единицах.",
        "Earth Splitter сначала применяет дебафф, затем наносит урон.",
        "Затронутые существа мгновенно притягиваются к трещине в момент взрыва.",
        "Притягивание прерывает произносимые заклинания.",
        "При притягивании отдается команда \"стоп\", поэтому текущие приказы на движение, атаки и использование заклинаний отменяются.",
        "Не действует на древних крипов."
      ],
      "mana": "125\/175\/225",
      "hotKey": "R",
      "cooldown": "100 (TagTalent 40)",
      "description": "Герой раскалывает землю, посылая трещину в выбранном направлении. Через 3 секунды разлом схлопывается, замедляя всех попавшихся врагов и нанося урон, зависящий от их максимального показателя здоровья. Половина урона будет физической, половина — магической.",
      "spellName": "Earth Splitter",
      "params": [
        "Анимация применения: 0,4+0,73",
        "Дальность применения: 2400",
        "Задержка: 3,14",
        "Ширина трещины: 315",
        "Длина трещины: 2100",
        "Урон от макс. здоровья: 30%\/40%\/50%",
        "Замедление скорости передвижения: 30%\/40%\/50%",
        "Длительность замедления: 3\/4\/5"
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Титан разрывает порознь всё, что когда-то создал."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.0,
    "attrStrength": 26.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 1.6,
    "attrAgilityInc": 1.8,
    "attrAgility": 14.0
  },
  "description": "Elder Titan — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Echo Stomp, сотрясают землю, нанося урон и оглушая врага до бессознательного состояния. Этой способностью Elder Titan наносит физический урон, в то время как его дух наносит магический урон. Вторая способность, Astral Spirit, призывает астрального духа, который наносит урон каждому врагу, сквозь которого он проходит. При воссоединении с Титаном дух дарует ему дополнительный урон и скорость передвижения за каждого раненного им врага. Дух также обладает способностями Echo Stomp, Return Astral Spirit и Natural Order. Духа можно вернуть к Elder Titan, использовав Return Astral Spirit. Пассивная способность, Natural Order, понижает все показатели до их начального уровня, снижая базовый показатель брони и сопротивление магическому урону ближайших врагов. Ультимативная способность, Earth Splitter, раскалывает землю впереди Elder Titan. После трех секунд трещина взрывается, замедляя всех врагов, которые попали в область действия способности, и нанося им урон в зависимости от их максимального показателя здоровья.",
  "history": "Вы наверняка задавались вопросом: как этот мир стал таким, какой он есть? Почему среди всех миров именно этот такой странной формы, населен такими разношерстными пестрыми существами со столь богатой культурой и историей? «Ответ, — раздается шепот, — знают Титаны». Они существовали с начала времен, и если даже не созерцали создание сущего, то с рождения помнят его эхо. Клейменные самыми ранними силами вселенной, они не желали ничего иного, кроме как продолжать созидание самостоятельно. Они решили изменять материю по своему разумению: ударяя, нагревая, изгибая и разрывая ее. И когда материя стала для них слишком простой, они стали изменять сами себя и друг друга. Обостряя ум и перековывая дух, они достигли небывалого могущества. Новой целью стала переделка самой реальности. Но тут они иногда совершали ошибки — большие амбиции давали знать свое. Тот, кого зовут Elder Titan, был большим выдумщиком, постигшим искусство творения. Оттачивая мастерство, он случайно поколебал то, что уже было нельзя восстановить. Он провалился в изломанный мир — осколок собственной души. Там, среди зубчатых разломов, треснутых равнин, и других осколков, провалившихся через трещины раннего мира, он и пребывал. Именно поэтому мир, каким мы его знаем, напоминает горстку выживших в кораблекрушении, про которое все давно забыли. Забыли все, кроме одного, который винит себя. Целую вечность он безустанно ищет способ всё исправить, собрать воедино свою расколотую душу, часть которой может быть в каждом из нас. Именно его мы зовем Elder Titan.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+450 к урону для пробуждения от Echo Stomp",
      "talentRight": "-60 сек. перезарядки Earth Splitter"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 к урону от Echo Stomp",
      "talentRight": "+100% к прорубанию"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25 к урону за героя от Astral Spirit",
      "talentRight": "+15% к сопротивлению магии"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+20 к скорости атаки",
      "talentRight": "+15 к скорости передвижения"
    }
  ]
}