{
  "abilities": [
    {
      "notes": [
        "Талант на броню не дается иллюзиям.",
        "Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.",
        "Талант на сопротивление магии мультипликативно складывается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Batrider до 47,5%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−35 сек. перезарядки Flaming Lasso",
          "talentRight": "+6,5 сек. действия Firefly"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+30 к скорости передвижения",
          "talentRight": "+20% к сопротивлению магии"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+250 к здоровью",
          "talentRight": "+5 к доп. урону от Sticky Napalm"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+6 к броне",
          "talentRight": "+5% к урону от заклинаний"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cf\/Batrider_Sticky_Napalm.mp3\/revision\/latest?cb=20191216011155",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Sticky Napalm можно использовать, не поворачиваясь к выбранной области.",
        "Применяется на всех врагов в области применения. Покидание или возвращение в область применения после использования не даст никакого эффекта.",
        "Каждое повторное применение обновляет длительность зарядов и добавляет дополнительный.",
        "Дебафф замедляет и наносит урон. Также показывается, сколько зарядов Sticky Napalm уже действует на цель. Над существами под действием способности отображается число, показывающее количество зарядов. Число видно только Batrider и его союзникам, но союзникам для этого нужен обзор на цель.",
        "Над существами под действием способности отображается число, показывающее количество зарядов. Число видно только Batrider и его союзникам, но союзникам для этого нужен обзор на цель.",
        "Может снизить скорость передвижения до 20%\/40%\/60%\/80%.",
        "Может нанести до 70\/140\/210\/280 (TagTalent 120\/190\/260\/330) единиц урона при максимальном количестве эффектов (до учета сопротивления). Крипы и крипы-герои получают только 50% от обычного урона. Может нанести до 35\/70\/105\/140 (TagTalent 60\/95\/130\/165) единиц урона крипам и крипам-героям при максимальном количестве эффектов",
        "Крипы и крипы-герои получают только 50% от обычного урона.",
        "Может нанести до 35\/70\/105\/140 (TagTalent 60\/95\/130\/165) единиц урона крипам и крипам-героям при максимальном количестве эффектов",
        "Увеличивает весь урон, который наносит герой, за исключением урона от Orb of Venom, Orb of Corrosion, Urn of Shadows, Spirit Vessel, Radiance, Cloak of Flames и неотражаемых способностей.",
        "Batrider должен сам наносить урон, другие существа под его контролем не активируют срабатывание Sticky Napalm.",
        "Sticky Napalm наносит урон как отдельный источник сразу после урона, активировавшего срабатывание способности.",
        "Дает летающий обзор в радиусе 400 в выбранной точке на 2 секунды."
      ],
      "mana": "20",
      "hotKey": "Q",
      "cooldown": "3",
      "description": "Выплескивает в выбранную область вязкое масло, которое увеличивает урон от всех атак и способностей героя. Масло замедляет передвижение и поворот врагов. Эффект от масла складывается до 10 раз. Дополнительный урон по древним крипам уменьшается вдвое.",
      "spellName": "Sticky Napalm",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 550\/600\/650\/700",
        "Радиус: 375\/400\/425\/450",
        "Максимально эффектов: 10",
        "Доп. урон за эффект: 7\/14\/21\/28 (TagTalent 12\/19\/26\/33)",
        "Процент урона по крипам: 50%",
        "Замедление передвижения за эффект: 2%\/4%\/6%\/8%",
        "Замедление скорости поворота: 10%\/30%\/50%\/70%",
        "Длительность: 7",
        "Замедление и урон срабатывает, если дебафф был применен до иммунитета к заклинаниям и не был ранее развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ea\/Batrider_Flamebreak_1.mp3\/revision\/latest?cb=20191216011159",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Flamebreak летит со скоростью 1200 единиц, пока не достигнет точки применения.",
        "Летящий наряд дает летающий обзор в 175 единиц. Обзор не задерживается.",
        "Отбрасывает существ со скоростью 857,14285714286. Расстояние отбрасывания всегда равно 300, неважно, насколько далеко существо от центра.",
        "Враги не обезвреживаются при отбрасывании. Они могут свободно поворачиваться, атаковать, использовать заклинания и предметы. Произносимые заклинания не прерываются.",
        "Способность может толкать существ на непроходимую местность. Любое дерево, стоящее на пути отброшенного юнита, разрушается.",
        "Накладывает дебафф на цели при попадании снаряда, наносящий урон спустя 1 секунду после применения с интервалом в 1 секунду, срабатывая 2\/4\/6\/8 раз.",
        "Может нанести до 60\/120\/180\/240 единиц урона (до уменьшений).",
        "Эффект горения при нескольких применениях Flamebreak складывается.",
        "Выбор таланта на увеличение длительности горения не обновляет длительность уже примененного эффекта Flamebreak.",
        "Не действует на Рошана.",
        "Получение Aghanim's Shard мгновенно даёт персонажу 1 дополнительный заряд. Примечания Sticky Napalm полностью применимы. Если способность не изучена, то эффект не будет накладываться. Сначала применяет Sticky Napalm, затем Flamebreak.",
        "Примечания Sticky Napalm полностью применимы. Если способность не изучена, то эффект не будет накладываться.",
        "Сначала применяет Sticky Napalm, затем Flamebreak."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "W",
      "cooldown": "18\/17\/16\/15 (TagTalent 0)",
      "description": "Кидает бутылку горючей смеси, которая взрывается в указанном месте и отталкивает всех врагов в области действия, после чего им наносится периодический урон.",
      "spellName": "Flamebreak",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 1300",
        "Радиус эффекта: 500",
        "Урон от взрыва: 30\/60\/90\/120",
        "Урон в секунду: 15",
        "Расстояние отбрасывания: 300",
        "Длительность отбрасывания: 0,35",
        "Длительность урона: 2\/4\/6\/8",
        "Число зарядов: 2",
        "Время восстановления: 18\/17\/16\/15",
        "Перезарядка заменяется 2 зарядами. Попадание накладывает на жертв 1 эффект способности Sticky Napalm.",
        "Урон наносится, если дебафф был применен до иммунитета к магии и не был ранее развеян."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4c\/Firefly.mp3\/revision\/latest?cb=20141212165712",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов \/ Себя",
        "Урон Магический"
      ],
      "notes": [
        "Применение Firefly прерывает произнесение заклинаний Batrider.",
        "Временно дает Batrider возможность летать, позволяя ему преодолевать непроходимые территории, существ, постройки и деревья.",
        "Огненный след от способности действует 15 (TagTalent 21,5) секунд, то есть при завершении действия весь огонь сразу пропадет.",
        "Урон наносится каждому вражескому существу в радиусе 200, если оно пройдет по огненной дорожке.",
        "Наносит 10\/17,5\/25\/32,5 урона с интервалом в 0,4 или 0,5 секунды спустя 0,1 секунды после применения; первый интервал составляет 0,4 секунды, следующие - 0,5 секунду, срабатывая 31 (TagTalent 44) раз.",
        "Может нанести до 310\/542,5\/775\/1007,5 (TagTalent 440\/770\/1100\/1430), если цель остается в огненной дорожке всё время действия способности.",
        "Пока действует Firefly, деревья в радиусе 100 единиц вокруг Batrider разрушаются.",
        "Несколько применений огненных дорожек складываются. Каждое применение создает отдельную дорожку.",
        "Огненный след остается на все время действия способности даже после смерти героя. Бафф виден в интерфейсе, но теперь он отвечает только за поджигание огненной дорожкой. То есть при возрождении до завершения длительности бафф не позволит Batrider летать или вновь оставлять за собой огненный след.",
        "Бафф виден в интерфейсе, но теперь он отвечает только за поджигание огненной дорожкой.",
        "То есть при возрождении до завершения длительности бафф не позволит Batrider летать или вновь оставлять за собой огненный след.",
        "При полете с помощью Firefly Batrider не получает урона от сработавших Proximity Mines.",
        "Выбор таланта на увеличение длительности не действует на уже существующие огненный дорожки.",
        "Не действует на Рошана."
      ],
      "mana": "100",
      "hotKey": "E",
      "cooldown": "52\/46\/40\/34",
      "description": "Герой поднимается в воздух, оставляя за собой огненный след. Огонь наносит урон врагам и уничтожает деревья. Во время полёта герой имеет свободное передвижение и обзор.",
      "spellName": "Firefly",
      "params": [
        "Анимация применения: 0+0",
        "Радиус урона: 200",
        "Урон в секунду: 20\/35\/50\/65",
        "Доп. скорость передвижения: 3%\/6%\/9%\/12%",
        "Доп. обзор: 100\/200\/300\/400",
        "Длительность: 15 (TagTalent 21,5)",
        "Иллюзии, созданные во время Firefly, не будут летать."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f0\/Flaming_Lasso.mp3\/revision\/latest?cb=20141212165758",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Flaming Lasso обезвреживает цель на всё время действия.",
        "Тащит выбранного юнита на расстоянии 300 единиц позади Batrider. Вопреки описанию, может затащить цель на непроходимую территорию.",
        "Если Batrider телепортируется на расстояние, превышающее 3\/3,5\/4 единиц, лассо порвется.",
        "Если цель телепортируют на любое расстояние, равное или превышающее 0 единиц, лассо порвется.",
        "Flaming Lasso прерывается другими способностям, дающие эффект принудительного движения, поэтому только телепортация может разорвать лассо.",
        "Flaming Lasso также перестает действовать в случае, если Batrider или цель умирают. Использование Dismember и Walrus Kick на цель лассо также разрывает его.",
        "Batrider обезврежен, пока действует Flaming Lasso. Обезвреживание действует секунды или до разрыва лассо, в зависимости от того, что случится быстрее.",
        "Наносит урон с интервалом в 1 секунду сразу после применения, нанося урон до 3\/3\/4 раз. Может нанести до 105\/165\/300 урона цели (до учета снижений).",
        "Может нанести до 105\/165\/300 урона цели (до учета снижений).",
        "Нельзя применить, но может передвигать неуязвимых и скрытых существ.",
        "Можно применить на Рошана, но на него не сработает ни обезвреживание, ни перемещение (TagTalent урон от так же не наносится); при этом Batrider будет обезврежен.",
        "Можно связать несколько существ в одно и то же время (используя, к примеру, Refresher Orb).",
        "Aghanim's Scepter привязывает ближайшего союзного для цели героя (включая крипов-героев и иллюзии) к изначальной цели на расстоянии единиц. Не действует на юнитов-не-героев. Вторичная цель привязывается к первичной, двигаясь за ней на том же расстоянии, что и первичная цель за Batrider. То есть, вторичная цель находится в 600 единицах позади Batrider. Второе лассо не зависит от состояния первого. При разрыве первого лассо первичная цель можно свободно перемещать привязанную к ней вторичную цель.",
        "Вторичная цель привязывается к первичной, двигаясь за ней на том же расстоянии, что и первичная цель за Batrider.",
        "То есть, вторичная цель находится в 600 единицах позади Batrider.",
        "Второе лассо не зависит от состояния первого. При разрыве первого лассо первичная цель можно свободно перемещать привязанную к ней вторичную цель."
      ],
      "mana": "225",
      "hotKey": "R",
      "cooldown": "120\/115\/110 (TagTalent 85\/80\/75)",
      "description": "Захватывает врага в огненное лассо, не давая ему атаковать, двигаться или использовать способности. Жертву можно перетаскивать за собой, однако нельзя затянуть на непроходимую территорию. Телепортация разорвёт лассо.",
      "spellName": "Flaming Lasso",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Дальность применения: 175",
        "Дальность разрыва: 425",
        "Урон в секунду: 35\/55\/75",
        "Длительность: 3\/3,5\/4",
        "Радиус поиска вторичной цели: 600",
        "Помимо основной цели, лассо захватывает ближайшего к ней вражеского героя в определённом радиусе. Вторая цель будет привязана к первой.",
        "Блокируется только при применении на основную цель. При блокировании обезвреживание также не применяется."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.9,
    "attrStrength": 28.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 1.8,
    "attrAgility": 15.0
  },
  "description": "Batrider — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Первая способность Sticky Napalm позволяет Batrider выплескивать на землю вязкое масло, которое увеличивает урон от всех атак и способностей Batrider. Масло замедляет скорость передвижения и поворота врагов. Эффект от масел складывается до 10 раз, продолжая увеличивать урон. Второй способностью Flamebreak герой кидает бутылку с коктейлем, которая взрывается, достигнув указанного места, отталкивая и ненадолго оглушая всех врагов в области действия, после чего им наносится периодический урон. Третья способность Firefly поднимает в воздух Batrider, оставляя за собой огненный след. Огонь уничтожает деревья и наносит урон врагам. Во время полета Batrider имеет свободное передвижение и обзор. Ультимативная способность Flaming Lasso захватывает вражеского героя в огненное лассо, не давая ему атаковать, двигаться и использовать способности. Batrider может перетаскивать жертву по своему усмотрению, однако не может затянуть ее на непроходимую территорию. Телепортация или использование Blink Dagger прервет заклинание.",
  "history": "Среди тварей, обитающих в джунглях Йама Раскав, никогда не было согласия. Проявишь слабость — жди скорой смерти от клювов или когтей, жвал или копыт... Говорят, давным-давно, когда наш герой ещё был простым пареньком и выкорчёвывал сорняки с семейного поля, его схватила огромная и до ужаса голодная летучая мышь. Но добыча оказалась не из робких: вырвавшись из лап хищника, парень взобрался на спину зверя и зарубил его своими инструментами. Выбравшись из кровавых ошметков, опьянённый полётом мальчик осознал, что нашёл свое призвание. Он рос и каждое лето выходил на то же поле, частенько лез в кусты в поиске тех самых ощущений, что встретил на пороге смерти от падения или от острых клыков. Годы шли, но пламя в его душе разгоралось только сильнее. Он исследовал заросли, с каждым походом забираясь всё глубже и глубже, пока, наконец, не нашел путь к пещерам — самому сердцу враждебных земель. Легенда гласит, что той знойной ночью всадник взял с собой лишь веревку, бутылку жидкой отваги и пылающую решимость — и, желая снова почувствовать небеса, нырнул во тьму...",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−35 сек. перезарядки Flaming Lasso",
      "talentRight": "+6,5 сек. действия Firefly"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+30 к скорости передвижения",
      "talentRight": "+20% к сопротивлению магии"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+250 к здоровью",
      "talentRight": "+5 к доп. урону от Sticky Napalm"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+6 к броне",
      "talentRight": "+5% к урону от заклинаний"
    }
  ]
}