{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6e\/Pipe_of_Insight.mp3\/revision\/latest?cb=20141214195933",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Союзников"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания владельца.",
        "Действует на всех союзных существ, включая строения, но исключая варды. Действует на неуязвимых, но не спрятанных союзников.",
        "Блокирует урон до любых уменьшений, за исключением действия иммунитета к заклинаниям, так как в этот момент барьер не блокирует магический урон.",
        "Повторное использование обновит бафф и сбросит счетчик поглощенного урона.",
        "Не сочетается с другими магическими барьерами. Если на существо будет активировано несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно. При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Если на существо будет активировано несколько барьеров, то каждый из них будет впитывать одинаковое количество урона одновременно.",
        "При этом, если источник урон превышает прочность каждого из барьеров, то урон будет заблокирован с учетом общей прочности.",
        "Блокирует только магический урон от заклинаний и атак. Не блокирует физический или чистый урон.",
        "Не делит перезарядку с Hood of Defiance."
      ],
      "mana": "100",
      "abilityName": "Barrier",
      "cooldown": "60",
      "description": "Создаёт на владельце и окружающих его союзниках барьер, блокирующий 400 магического урона. Действует 12 сек.",
      "params": [
        "Радиус: 1200",
        "Поглощение магического урона: 400",
        "Длительность: 12"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Аура",
        "Действует на Союзников"
      ],
      "notes": [
        "Сочетается с другими источниками фиксированной регенерации здоровья, за исключением Insight Aura от нескольких Pipe of Insight.",
        "Увеличивает общее сопротивление магии героев до 32,5%, учитывая базовое сопротивление в 25% и не учитывая другие источники сопротивления. С пассивным бонусом значение для владельца увеличивается до 52.75%.",
        "С пассивным бонусом значение для владельца увеличивается до 52.75%.",
        "Восстанавливает до 120 здоровья в минуту.",
        "Не действует на варды, строения и неуязвимых существ.",
        "Бафф ауры задерживается на 0,5 секунды."
      ],
      "mana": null,
      "abilityName": "Insight Aura",
      "cooldown": null,
      "description": "Действует на союзников вокруг. Увеличивает их восстановление здоровья на 2 и сопротивление магии на 10%.",
      "params": [
        "Радиус: 1200",
        "Доп. восстановление здоровья: 2",
        "Доп. сопротивление магии: 10%",
        "Длительность задержки ауры: 0,5",
        "Иллюзии распространяют ауру, но не получают сопротивления магии от неё."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Сопротивление магии сочетается по закону убывающей полезности с другими источниками сопротивления.",
    "Увеличивает сопротивление магии героев до 47.5%, учитывая базовое сопротивление в 25% и не учитывая другие источники.",
    "Вместе с аурой предмет дает 10,5 регенерации здоровья владельцу."
  ],
  "cost": "3475",
  "lore": null,
  "consistFrom": [
    "Hood of Defiance",
    "Headdress",
    "Recipe"
  ],
  "boughtFrom": "Поддержка",
  "name": "Pipe of Insight",
  "description": "Могущественный артефакт таинственного происхождения. Он создаёт барьеры, защищающие от магических сил.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+8,5 к регенерации здоровья",
    "+30% к сопротивлению магии"
  ],
  "tips": null
}