{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Stormcrafter_Active.mp3\/revision\/latest?cb=20210120232107",
      "effects": [
        "Cyclone Radius: 24",
        "Duration: 0.75"
      ],
      "notes": [
        "Whirlwind applies a cyclone effect on the caster, turning them invulnerable and fully disabled.",
        "The duration of Whirlwind is not affected by status resistance.",
        "Applies a basic dispel on the caster upon cast.",
        "Whirlwind first applies the invulnerability, then the dispel.",
        "While cycloned, the caster unit is moved upwards and has no collision. However, a pathing blocker is created at the base of the Whirlwind within a 24 radius."
      ],
      "mana": "50",
      "abilityName": "Whirlwind",
      "cooldown": "25",
      "description": "Cyclones your hero for 0.75 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fb\/Stormcrafter_Passive.mp3\/revision\/latest?cb=20210410154936",
      "effects": [
        "Search Radius: 700",
        "Strike Recharge Time: 3",
        "Damage: 200",
        "Move Speed Slow: 40%",
        "Slow Duration: 0.3"
      ],
      "notes": [
        "The target is choosen randomly within the area. There are no priorities.",
        "Does not target invisible units or units inside the Fog of War.",
        "If the owner is invisible and not affected by True Sight, the passive does not trigger.",
        "The bolt first applies the debuff, then the damage.",
        "If no valid targets are within range, the effect waits until a valid target comes within range, striking them immediately.",
        "Does not work for clones."
      ],
      "mana": null,
      "abilityName": "Bottled Lightning",
      "cooldown": null,
      "description": "Zaps an enemy within 700 range, dealing 200 damage and a 40% slow for 0.3 seconds. Strikes every 3 seconds.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Stormcrafter",
  "description": "The accidental byproduct of a spell conjured to entrap a lesser god.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Dodges incoming projectiles such as Wraithfire Blast or Concussive Shot with precise timing.",
    "To dispel debuffs such as Global Silence."
  ]
}