{"abilities":[{"spell":"Intensifies Viper's venom, adding an effect to his normal attack that applies a stacking movement speed slow and magic resistance deduction while dealing damage over time. Stacks up to 5 times.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Magical"],"notes":["Uses Viper's 575 ( 700) attack range when using autocast. Manually casting it uses the 600\/640\/680\/720 ( 725\/765\/805\/845) cast range.","Poison Attack places one debuff on the target. Following attacks increase its stack count. A number on the icon reveals the amount of stacks. The number is visible to everyone. Each attack resets the duration of the entire stack.","This is how much movement speed and magic resistance Poison Attack reduces with certain amount of stacks on each level: Level 1: 6%\/12%\/18%\/24%\/30% movement speed and 3%\/6%\/9%\/12%\/15% magic resistance. Level 2: 8%\/16%\/24%\/32%\/40% movement speed and 5%\/10%\/15%\/20%\/25% magic resistance. Level 3: 10%\/20%\/30%\/40%\/50% movement speed and 7%\/14%\/21%\/28%\/35% magic resistance. Level 4: 12%\/24%\/36%\/48%\/60% movement speed and 9%\/18%\/27%\/36%\/45% magic resistance.","Deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 4 damage instances.","This is how much damage per second and total damage Poison Attack deals with certain amount of stacks on each level: Level 1: 4\/8\/12\/16\/20 damage per second and 16\/32\/48\/64\/80 total damage. Level 2: 8\/16\/24\/32\/40 damage per second and 32\/64\/96\/128\/160 total damage. Level 3: 12\/24\/36\/48\/60 damage per second and 48\/96\/144\/192\/240 total damage. Level 4: 16\/32\/48\/64\/80 damage per second and 64\/128\/192\/256\/320 total damage.","The attacks first apply the debuff, then their own damage.","The level 25 talent allows Poison Attack to target buildings, damaging and slowing them."],"mana":"25","elements":["Can be disjointed.","Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"0","name":"Poison Attack","description":["Cast Range: 600\/640\/680\/720 ( 725\/765\/805\/845)","Damage per Second per Stack: 4\/8\/12\/16","Movement Speed Slow per Stack: 6%\/8%\/10%\/12%","Magic Resistance Reduction per Stack: 3%\/5%\/7%\/9%","Max Stacks: 5","Duration: 4"],"hot_key":"Q","legacy_key":"C"},{"spell":"Viper releases a Nethertoxin at the targeted area. Units in that area take an increasing damage over time based on how long they remain in it. Disables passives of affected units.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["Nethertoxin's projectile travels at a speed of 2000.","All effects of Nethertoxin (including the damage) are provided by an aura. Its debuff lingers for 0.5 seconds.","Deals damage in 0.5-second intervals, starting 0.5 second after receiving the debuff, resulting in up to 17 instances.","The damage increases by 2.81\/3.75\/4.69\/5.63 for each 0.5 seconds spent within the area, resulting in the following values per instance. Level 1: 7.5 \/ 10.31 \/ 13.13 \/ 15.94 \/ 18.75 \/ 21.56 \/ 24.38 \/ 27.19 \/ 30  \/ 30 \/ 30 \/ 30 \/ 30 \/ 30 \/ 30 \/ 30 \/ 30 Level 2: 10 \/ 13.75 \/ 17.5 \/ 21.25 \/ 25 \/ 28.75 \/ 32.5 \/ 36.25 \/ 40  \/ 40 \/ 40 \/ 40 \/ 40 \/ 40 \/ 40 \/ 40 \/ 40 Level 3: 12.5 \/ 17.19 \/ 21.88 \/ 26.56 \/ 31.25 \/ 35.94 \/ 40.63 \/ 45.31 \/ 50  \/ 50 \/ 50 \/ 50 \/ 50 \/ 50 \/ 50 \/ 50 \/ 50 Level 4: 15 \/ 20.63 \/ 26.25 \/ 31.88 \/ 37.5 \/ 43.13 \/ 48.75 \/ 54.38 \/ 60  \/ 60 \/ 60 \/ 60 \/ 60 \/ 60 \/ 60 \/ 60 \/ 60","Can deal up to 408.75\/545\/681.25\/817.5 damage, considering the enemy stays within the area for the whole duration.","The damage value for an enemy resets whenever the enemy leaves the area and enters it again. It does not count accumulated time spent within the area.","Multiple instances of Nethertoxin's debuff do not stack.","When leveling up the ability, the damage on already affected units do not update. However, if an enemy receives the debuff after leveling it up, that enemy receives the new damage values. Choosing the talent which adds the silence immediately updates all already existing debuffs."],"mana":"70\/80\/90\/100","elements":["Does not pierce spell immunity."],"cooldown":"14","name":"Nethertoxin","description":["Cast Animation: 0.2+0.5","Cast Range: 900","Radius: 400","Minimum Damage per Second: 15\/20\/25\/30","Maximum Damage per Second: 60\/80\/100\/120","Max Damage Duration: 4","Damage Interval: 0.5","Aura linger duration: 0.5","Duration: 8"],"hot_key":"W","legacy_key":"R"},{"spell":"Viper exudes an infectious toxin that damages and slows the attack speed of any enemy that damages it in a 1400 radius. The acid exudate also increases Viper's resistance to magic.","effects":["Ability Passive","Affects Self \/ Enemies","Damage Magical"],"notes":["Magic resistance stacks multiplicatively with other sources of magic resistance.","Increases Viper's total magic resistance to 33%\/36%\/40%\/44% ( 37%\/41%\/45%\/48%), assuming his basic 25% magic resistance and no other sources of magic resistance.","The damage and slow debuff is applied to whoever damages Viper within 1400 range of him.","Corrosive Skin's damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.","Only reacts on the 3 damage types. Does not react on damage flagged as HP Removal.","Damage dealt by abilities that use an independent source of damage (e.g. Proximity Mines, Death Ward) does not trigger Corrosive Skin on the caster.","Deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 4 damage instances.","Can deal a total of 32\/64\/96\/128 ( 56\/88\/120\/152) damage (before reductions).","Successive procs of Corrosive Skin on the same target do not stack, only the debuff gets refreshed.","Does not affect buildings, wards or invulnerable units."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Corrosive Skin","description":["Max Proc Distance: 1400","Magic Resistance Bonus: 10%\/15%\/20%\/25% ( 16%\/21%\/26%\/31%)","Damage per Second: 8\/16\/24\/32 ( 14\/22\/30\/38)","Attack Speed Slow: 8\/16\/24\/32 ( 14\/22\/30\/38)","Duration: 4"],"hot_key":"E","legacy_key":"E"},{"spell":"Viper slows the targeted enemy unit's movement and attack speed while also dealing poison damage over time. The slowing effect reduces over the duration of the poison.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Viper Strike's projectile travels at a speed of 1200.","The slow decreases over time. Hit units regain 0.3%\/0.4%\/0.5% of their movement speed and 0.267\/0.4\/0.533 attack speed on each server tick. This translates to 8%\/12%\/16% movement speed and 8\/12\/16 attack speed regained per second.","Deals damage in 1 second intervals, starting immediately as the debuff is applied, resulting in 5 damage instances.","Can deal up to 300\/500\/725 ( 800\/1000\/1225) damage (before reductions).","Successive casts of Viper Strike on the same target do not stack, only the debuff gets refreshed.","The particle effects on Viper's wings during the cast time are visible to everyone, showing that the spell is being cast."],"mana":"125\/175\/250 ( 125)","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"50\/40\/30 ( 10)","name":"Viper Strike","description":["Cast Animation: 0.3+0.53","Cast Range: 500 ( 900)","Damage per Second: 60\/100\/145 ( 160\/200\/245)","Move Speed Slow: 40%\/60%\/80%","Attack Speed Slow: 40\/60\/80","Duration: 5"],"hot_key":"R","legacy_key":"V"}],"bio":"The malevolent familiar of a sadistic wizard who captured and hoped to tame him, Viper was curiously glad to have been sprung from the sealed and unchanging subterranean Nether Reaches where his race had lived for millions of years, after tectonic slippage had sealed off the Netherdrakes in luminous caverns. Viper spent some time appearing to submit to the wizard's enchainments, hoping to learn what he could of the dark magics the mage practiced. But he soon realized that few spells were as deadly as the toxins that were his birthright. Exuding an acid that swiftly ate away the bars of his cage, the Netherdrake slipped free of his confines, spit poison in the old spellcaster's eyes, and soared out to let the world know that it had a new master.","talentsTips":["The attack range talent also affects the cast range of Poison Attack.","The spell lifesteal talent stacks additively with other sources of spell lifesteal.","The spell lifesteal talent heals for 1.6% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects."],"trivia":["Viper's response \"Holy shit, it's me!\" is a reference to a scene of the movie Top Gun. Gyrocopter makes a similar, yet more accurate response upon meeting him as an ally.","Viper's Chinese name is 冥界亚龙 (Míngjiè Yàlóng), a literal translation of \"Netherdrake\". However, Viper Strike's translation still uses the word \"Viper\" (蝮蛇, fùshé)."],"talents":["Poison Attack Affects Buildings:Nethertoxin Silences","+90 Damage:+100 Viper Strike DPS","+6 Corrosive Skin Stats:+125 Attack Range","8% Spell Lifesteal:+25 Attack Speed"],"desc":"Viper, the Netherdrake, is a ranged agility hero who functions as an excellent nuker, ganker and carry due to his assortment of low-cooldown spells and debilitating attacks. His modus operandi is to whittle away his opponents' vitality over long stretches of time while they fail to inflict fatal damage. To that end Viper wields magic-based abilities focused on inhibiting speed and defenses. He infects his quarry with Poison Attack, a seemingly innocuous liquid that rapidly burns away more health as they became sicker, while drowning them in noxious pools which block their innate powers. Meanwhile Corrosive Skin fortifies him against magic damage and poisons those who dare strike him. For impervious foes he reserves his most powerful venom, Viper Strike, as a surprise gift. A slow tank that dominates the early stages of a game, Viper depends on consolidating that advantage before opponents can afford to exploit his weaknesses."}