{"abilities":[{"spell":"Добавляет к обычной атаке героя яд, уменьшающий скорость атаки и передвижения врага и наносящий ему периодический урон в зависимости от уровня его здоровья.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Магический"],"notes":["Ручное использование Poison Attack использует дальность применения в 600\/640\/680\/720 ( 125.00000191483) единиц. Обычные атаки с включенным авто-применением Poison Attack используют дальность атаки Viper в 575 ( 700) единиц.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 4 раз.","Повторное применение способности на ту же цель складывается до 5 раз и обновляет длительность.","Талант на 20 уровне позволяет использовать в качестве целей строения, нанося им урон и замедляя их атаки."],"mana":"20","elements":["Можно избежать.","Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"6\/4\/2\/0","name":"Poison Attack","description":["Дальность применения: 600\/640\/680\/720 ( 125.00000191483)","Урон в секунду: 4\/8\/12\/16","Замедление скорости передвижения: 6%\/8%\/10%\/12%","Уменьшает сопротивление к магии: 3%\/5%\/7%\/9%","Длительность: 4","Максимум эффектов: 5"],"hot_key":"Q","legacy_key":"C"},{"spell":"Герой покрывает землю особым ядом. Противники в отравленной области получают периодический урон и имеют пониженное сопротивление магии, а их пассивные способности перестают работать.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Снаряд от Nethertoxin летит со скоростью в 2000 единиц.","Все эффекты Nethertoxin (включая урон) предоставляются в виде ауры. Дебафф задерживается на 0,5 секунды. Урон не зависит от ауры.","Снижает общее сопротивление магии героев до 17.5%\/13.75%\/10%\/6.25%, учитывая базовое сопротивление в 0.25 и исключая другие источники.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после получения дебаффа, срабатывая до 8 раз.","Может нанести до 240\/360\/480\/600 единиц урона в одного юнита (до учета сопротивления).","Дебафф от нескольких примененных Nethertoxin не складывается.","При изучении нового уровня способности, снижение сопротивления магии и урон, уже действующие на юнитов, не обновляются до нового значения. При этом, если враг получает дебафф после поднятия уровня способности, этот враг получит уже новое значение урона и снижения сопротивления. Выбор таланта, добавляющего эффект безмолвия, мгновенно обновляет все действующие дебаффы."],"mana":"70\/80\/90\/100","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"6","name":"Nethertoxin","description":["Анимация применения: 0,2+0,5","Дальность применения: 900","Радиус: 380","Урон в секунду: 30\/45\/60\/75","Уменьшение сопротивления магии: 10%\/15%\/20%\/25%","Длительность задержки ауры: 0,5","Длительность: 8"],"hot_key":"W","legacy_key":"R"},{"spell":"Viper источает клейкий яд, который замедляет врага и наносит ему урон, если тот наносит урон Viper и находится на расстоянии до 1400 единиц от него. Кроме того, Viper получает дополнительную сопротивляемость к заклинаниям.","effects":["Способность Пассивная","Действует на Себя \/ Врагов","Урон Магический"],"notes":["Сочетается с другими источниками сопротивления магии.","Усиливает общее базовое сопротивление магии героя до 32.5%\/36.25%\/40%\/43.75%( 37%\/40.75%\/44.5%\/48.25%).","Урон и дебафф замедления применяется, когда кто-либо наносит урон в радиусе 1400 единиц от Viper.","Урон от Corrosive Skin относится к неотражаемым способностям, предотвращая взаимодействие урона от него с остальными источниками урона от таких же способностей.","Реагирует только на 3 типа урона. Не реагирует на урон, отмеченный как отнимающий здоровье.","Урон, наносимый способностями, которые используют независимые источники урона (к примеру, Proximity Mines, Death Ward), не активирует Corrosive Skin на владельца способностей.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после размещения дебаффа, срабатывая 4 раз.","Может нанести в общей сложности до 32\/64\/96\/128 ( 56\/88\/120\/152) единиц урона (до учета сопротивления).","Несколько срабатываний на одну и ту же цель не складываются, только обновляют действие дебаффа.","Не работает на строения, варды или неуязвимых юнитов."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Corrosive Skin","description":["Радиус: 1400","Сопротивление магии: 10%\/15%\/20%\/25% ( 16%\/21%\/26%\/31%)","Урон в секунду: 8\/16\/24\/32 ( 14\/22\/30\/38)","Замедление скорости атаки: 8\/16\/24\/32 ( 14\/22\/30\/38)","Длительность: 4"],"hot_key":"E","legacy_key":"E"},{"spell":"Viper замедляет скорость атаки и передвижения выбранного врага, при этом нанося ему периодический урон. Скорость врага постепенно восстанавливается в течение действия яда.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Снаряд от Viper Strike летит со скоростью в 1200 единиц.","Замедление уменьшается со временем. Пораженным юнитам возвращается 0.3%\/0.4%\/0.5% от их скорости передвижения и 0.267\/0.4\/0.533 от скорости атаки при каждом срабатывании. Это означает, что в секунду возвращается 8%\/12%\/16% от скорости передвижения и 8\/12\/16 от скорости атаки.","Наносит урон с интервалом в 1 секунду сразу после размещения дебаффа, срабатывая 5 раз.","Может нанести до 300\/500\/725 ( 800\/1000\/1225) единиц урона (до учета сопротивления).","Несколько применений Viper Strike на одну и ту же цель не складываются, но обновляют время действия дебаффа.","Эффект частиц на крыльях Viper в момент применения способности виден всем, показывая, что способность будет применена."],"mana":"125\/175\/250 ( 125)","elements":["Можно избежать.","Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"50\/40\/30 ( 10)","name":"Viper Strike","description":["Анимация применения: 0,3+0,53","Дальность применения: 500 ( 900)","Урон в секунду: 60\/100\/145 ( 160\/200\/245)","Замедление скорости передвижения: 40%\/60%\/80%","Замедление скорости атаки: 40\/60\/80","Длительность: 5"],"hot_key":"R","legacy_key":"V"}],"bio":"В тихом свете Нижних пределов, отрезанных от внешнего мира тектоническим сдвигом, многие миллионы лет обитала раса низших драконов. Один из них, особенно злобный и любопытный, был только рад покинуть опостылевшие пещеры, попавшись в руки наивному магу-изуверу. Змий притворялся верным питомцем колдуна, надеясь постичь его тёмную магию — но вскоре понял, что родная отрава жалит куда злее многих заклинаний. Драконья кислота легко справилась с прутьями клетки. Вырвавшись из заточения, ядовитым плевком ослепил он старого заклинателя и упорхнул на волю, дабы явить миру нового владыку.","talentsTips":["Талант на дальность атаки также влияет на дальность применения Poison Attack.","Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.","Талант вампиризма заклинаний лечит на 5% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение."],"trivia":["Реплика \"Holy shit, it's me!\" это отсылка к сцене из фильма Top Gun. Gyrocopter, дает более точный ответ при встрече с Viper если он союзник.","По одной из реплик Pugna можно понять, что он маг, который упомянут в истории Viper."],"talents":["+160 к урону:Nethertoxin запрещает применять способности","Poison Attack действует на постройки:+100 к урону в секунду от Viper Strike","+6 к урону в секунду от Corrosive Skin Stats:+125 к дальности атаки","+8% к вампиризму способностями:+25 к скорости атаки"],"desc":"Viper — это герой с дальним типом атаки, основной характеристикой которого является ловкость. Первая способность, Poison Attack, усиливает яд Viper, добавляя к его обычной атаке уникальный модификатор атаки в виде периодического урона и уменьшения скорости атаки и передвижения врага. Вторая способность, Nethertoxin, покрывает территорию ядом, наносящим периодический урон и отключающим пассивные способности попавших в него героев. Третья пассивная способность, Corrosive Skin, источает клейкий яд, который замедляет врага и наносит ему урон, если тот наносит урон Viper. Кроме того, Viper получает дополнительную сопротивляемость к заклинаниям. Ультимативная способность, Viper Strike, замедляет скорость атаки и передвижения выбранного врага, при этом нанося ему периодический урон. Скорость врага постепенно восстанавливается в течение действия яда. Улучшение с Aghanim's Scepter уменьшает расход маны и время перезарядки и увеличивает дальность применения."}