{"abilities":[{"effects":["Cast Range: 600\/650\/700\/750\/800","Effect Delay: 0","Damage: 400\/500\/600\/700\/800"],"notes":["Places a debuff on the target, which applies the damage upon expiring. The debuff lasts 0 seconds. Due to server tick rates, the debuff effectively lasts 0.033 seconds. A true 0 second duration for modifiers is not possible. This means the damage can be avoided by being invulnerable, hidden or spell immune as the debuff expires.","Instantly kills illusions, regardless of any status effects, except for Shallow Grave."],"elements":["Ability Target Unit","Affects Enemies","Damage Magical \/ Instant Kill"],"description":"Emits a powerful burst of magical damage upon a targeted enemy unit. Upgradable."}],"contains":["Staff_of_Wizardry","Crown","Recipe"],"cost":"2700","description":"","trivia":["Dagon is the name of an ancient Mesopotamian god. Dagon's active ability, Energy Burst, may be a reference to the Bible's Samson where he prayed to the Abrahamic god for power to destroy his enemies at Dagon's Temple.","Nyx Assassin's cosmetic item, Nyx Assassin's Dagon, is based on Dagon."],"further":["Dagon_2"],"tips":["Most heroes have 25% magic resistance by default, causing Energy Burst to deal 300\/375\/450\/525\/600 damage to them, considering no other sources of reduction or amplification.","Powerful against high armored enemies, damage block and evasion."],"attrs":["Active Energy Burst","Bonus +5 Strength +5 Agility +18\/21\/24\/27\/30 Intelligence","Disassemble? No","Alert allies? No"],"info":["For strength heroes, it grants 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 216\/252\/288\/324\/360 mana, 0.9\/1.05\/1.2\/1.35\/1.5 mana regen, 1.26%\/1.47%\/1.68%\/1.89%\/2.1% spell damage and 5 attack damage.","For agility heroes, it grants 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 216\/252\/288\/324\/360 mana, 0.9\/1.05\/1.2\/1.35\/1.5 mana regen, 1.26%\/1.47%\/1.68%\/1.89%\/2.1% spell damage and 5 attack damage.","For intelligence heroes, it grants 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 216\/252\/288\/324\/360 mana, 0.9\/1.05\/1.2\/1.35\/1.5 mana regen, 1.26%\/1.47%\/1.68%\/1.89%\/2.1% spell damage and 18\/21\/24\/27\/30 attack damage.","Upgrading the item improves its stats and the damage, range and cooldown of Energy Burst. Can be upgraded four times.","The total gold cost for each level is 2700\/3950\/5200\/6450\/7700."]}