{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/41\/Abyssal_Blade_Overwhelm.mp3\/revision\/latest?cb=20210414122317",
      "effects": [
        "Cast Range: 150",
        "Stun Duration: 2"
      ],
      "notes": [
        "Upon cast, the caster is ordered to attack the target.",
        "The effect is instant despite the visual effects.",
        "Triggers Bash's cooldown upon cast.",
        "Can be cast on Couriers."
      ],
      "mana": "75",
      "abilityName": "Overwhelm",
      "cooldown": "35",
      "description": "Stuns a target enemy unit for 2 seconds. Pierces Spell Immunity.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Abyssal_Blade_Bash.mp3\/revision\/latest?cb=20191227195343",
      "effects": [
        "Proc Chance (TagAghanimMelee): 25%",
        "Proc Chance (TagAghanimRanged): 10%",
        "Damage: 120",
        "Stun Duration: 1.5"
      ],
      "notes": [
        "Does not stack with the bash of Skull Basher and other Abyssal Blades. Does not stack with Bash of the Deep, Greater Bash and Time Lock either. If any of these are present, Bash cannot proc.",
        "Does not stack with Bash of the Deep, Greater Bash and Time Lock either. If any of these are present, Bash cannot proc.",
        "For multiple items with the bash ability, only the one that has been continuously the longest in the inventory works.",
        "The proccing attack first applies the debuff, then the damage.",
        "The bonus damage is considered as a conditional attack damage bonus. Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to the wielder's attack damage. The attack damage bonus values are not considered by critical strike and cleave. However, it is considered by lifesteal, and it can be reduced only by flat reductions (e.g. damage block). Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Although the attack damage bonus values are not displayed in the HUD, it is still considered and directly added to the wielder's attack damage.",
        "The attack damage bonus values are not considered by critical strike and cleave.",
        "However, it is considered by lifesteal, and it can be reduced only by flat reductions (e.g. damage block).",
        "Since it is considered bonus attack damage, it is not affected by percentage-based attack damage bonuses or reductions.",
        "Adds an average of 30 and 12 damage to every attack for melee and ranged heroes respectively.",
        "Does not work against wards and buildings, but works against allied units. Clones cannot use Bash.",
        "Clones cannot use Bash.",
        "Bash uses pseudo-random distribution.",
        "Goes on cooldown when Overwhelm is cast.",
        "Bash uses a custom cooldown system. It is neither displayed on the item icon when procced, nor is affected by cooldown manipulation."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": null,
      "description": "Grants melee heroes a 25% chance on hit to stun the target for 1.5 seconds and deal 120 bonus physical damage. Bash chance for ranged heroes is 10%.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Proc Chance: 60%",
        "Blocked Damage (TagAghanimMelee): 70",
        "Blocked Damage (TagAghanimRanged): 35"
      ],
      "notes": [
        "Does not work against damage from wards sources (e.g. Death Ward etc.).",
        "Does not reduce physical damage from abilities, except for these spells.",
        "Stacks with all other sources of Damage Block.",
        "Damage Block uses pseudo-random distribution."
      ],
      "mana": null,
      "abilityName": "Damage Block",
      "cooldown": null,
      "description": "Grants a 60% chance to block 70 damage from incoming attacks on melee heroes, and 35 damage on ranged.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "200 health and 1 health regeneration.",
    "10 main attack damage to heroes."
  ],
  "cost": "6250",
  "lore": null,
  "consistFrom": [
    "Skull Basher",
    "Vanguard",
    "Recipe"
  ],
  "name": "Abyssal Blade",
  "description": "The lost blade of the Commander of the Abyss, this edge cuts into an enemy's soul.",
  "trivia": null,
  "upgradeIn": null,
  "tips": [
    "Use Overwhelm to interrupt the enemy heroes' channeling such as Town Portal Scroll or any channeled abilities like Freezing Field.",
    "Although sometimes optional, it is best to buy items that grant attack speed which procs Bash more.",
    "Since the Bash pierces spell immunity, it is best used when facing heroes with spell immunity (e.g. Juggernaut or Lifestealer). The active ability also has a guaranteed 2-seconds stun that also pierces spell immunity.",
    "Be careful when facing heroes with skills\/items that applies strong dispel (e.g. Aphotic Shield or Dark Pact), it is best to use abilities with silence or mute to compensate this."
  ]
}