{"abilities":[{"spell":"Slams the ground, stunning and damaging nearby enemy units.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["The stomp first applies the debuff, then the damage."],"mana":"115\/120\/125\/130","elements":["Does not pierce spell immunity."],"cooldown":"22\/19\/16\/13","name":"Hoof Stomp","description":["Cast Animation: 0.5+0.3","Radius: 315","Damage: 80\/110\/140\/170","Stun Duration: 2\/2.25\/2.5\/2.75 ( 3.5\/3.75\/4\/4.25)"],"hot_key":"Q","legacy_key":"F"},{"spell":"Centaur strikes a mighty blow at melee range, damaging both himself and a small area around the target. Deals extra damage based on your strength. Centaur cannot die from Double Edge.","effects":["Ability Target Unit","Affects Enemies \/ Self","Damage Magical"],"notes":["Double Edge deals magical damage to the targets and to the caster.","The damage radius is centered around the target, not around Centaur.","The self-inflicted damage is never lethal, so it cannot be used to deny oneself."],"mana":"0","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"5","name":"Double Edge","description":["Cast Animation: 0.4+0.43","Cast Range: 150","Damage Radius: 190","Base Damage: 120\/180\/240\/300","Strength as Damage: 60%\/80%\/100%\/120% ( 110%\/130%\/150%\/170%)"],"hot_key":"W","legacy_key":"D"},{"spell":"Centaur counters all attacks, dealing damage back to the attacker. Each time Centaur gets attacked by a hero or a tower, he gains a charge counter. Can be cast to consume all charges, granting you a percentage base damage increase for 20 seconds.","effects":["Ability No Target ( Aura)","Affects Enemies \/ Self","Damage Physical"],"notes":["Interrupts Centaur Warrunner's channeling spells upon cast.","Retaliate only triggers when a unit lands an attack, regardless of distance. This means it cannot trigger on missed attacks.","The Retaliate damage is always dealt right before the attacker's damage is dealt to its target.","Secondary attacks from Moon Glaives, Split Shot before choosing talent and Flak Cannon do not trigger Retaliate. However, the secondary attacks from other instant attacks do trigger Retaliate.","Does not proc on the attacks of wards and Undying Zombies. Procs on the attacks of buildings.","Fully works against allied units, resulting in a deny if the damage kills the ally.","Gains stacks only from tower and hero attacks. This includes illusions and clones, but excludes creep-heroes. A status buff becomes visible when having a stack, which shows how many stacks there are. The counter goes invisible when going back to 0 stacks. Upon cast, all stacks get removed and the damage buff gets added, with a damage bonus based on the amount of stacks you had. While this damage buff is present, new stacks cannot be gained.","The damage bonus only increases base damage and that given by the primary attribute. Raw bonus damage is not increased.","This is how much damage the buff grants with a certain amount of stacks on each level: Level 1: 6% \/ 12% \/ 18% \/ 24% \/ 30% \/ 36% \/ 42% \/ 48% \/ 54% \/ 60% \/ 66% \/ 72% \/ 78% attack damage Level 2: 8% \/ 16% \/ 24% \/ 32% \/ 40% \/ 48% \/ 56% \/ 64% \/ 72% \/ 80% \/ 88% \/ 96% \/ 104% attack damage Level 3: 10% \/ 20% \/ 30% \/ 40% \/ 50% \/ 60% \/ 70% \/ 80% \/ 90% \/ 100% \/ 110% \/ 120% \/ 130% attack damage Level 4: 12% \/ 24% \/ 36% \/ 48% \/ 60% \/ 72% \/ 84% \/ 96% \/ 108% \/ 120% \/ 132% \/ 144% \/ 156% attack damage","Retaliate is an aura by default, but affects only self until the talent is chosen. The buff is not visible on self. Once the talent is chosen, the aura only affects heroes and creep-heroes. Other units are not affected. The aura's buff lingers for 0.5 seconds."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"55\/50\/45\/40","name":"Retaliate","description":["Cast Animation: 0+0","Aura Radius: 0 ( 1200)","Retaliate Damage: 16\/32\/48\/64 ( 96\/112\/128\/144)","Attack Damage Bonus per Stack: 6%\/8%\/10%\/12%","Max Stacks: 13","Active Duration: 20","Aura Linger Duration: 0.5"],"hot_key":"E","legacy_key":"R"},{"spell":"Centaur leads all allies into a vicious charge causing them to move through units at max speed and stop any enemy units they trample. Trampled enemies take damage based on Centaur Warrunner's strength. Each enemy can be trampled once.","effects":["Ability No Target","Affects Allies \/ Enemies","Damage Magical"],"notes":["Interrupts Centaur Warrunner's channeling spells upon cast.","Affects every player-controlled allied unit, except for couriers, wards, buildings, and Haunt illusions.","Affected allies become phased and hasted, meaning they cannot be slowed below the set value.","Checks Centaur's strength whenever trampling an enemy, so it adapts immediately. However, the strength multiplier is set on cast and does not adapt when leveling the spell while active.","Stampede first applies the damage, then the debuff.","The damage is sourced to each buffed ally, meaning certain on-damage effects react to the buffed ally rather than to Centaur Warrunner (e.g. Blade Mail).","The damage reduction reduces all 3 damage types.","The sound effect is global and can be heard by enemies even through the Fog of War.","Aghanim's Scepter allows allies to walk over cliffs and causes them to destroy trees around them for the duration. Does not destroy trees around allies who have the perch modifier from Tree Dance, meaning allies sitting on trees do not get their trees destroyed by themselves."],"mana":"150\/200\/250","elements":["Partially pierces spell immunity."],"cooldown":"110\/100\/90","name":"Stampede","description":["Cast Animation: 0+0","Damage & Slow Radius: 105","Strength as Damage: 100%\/200%\/300%","Allies Incoming Damage Reduction: 0 ( 40%)","Haste Speed: 550","Move Speed Slow: 100%","Slow Duration: 2.3","Stampede Duration: 4"],"hot_key":"R","legacy_key":"T"}],"bio":"It's said that a centaur's road is paved with the corpses of the fallen. For the one called Warrunner, it has been a long road indeed. To outsiders, the four-legged clans of Druud are often mistaken for simple, brutish creatures. Their language has no written form; their culture lacks pictographic traditions, structured music, formalized religion. For centaurs, combat is the perfect articulation of thought, the highest expression of self. If killing is an art among centaurs, then Bradwarden the Warrunner is their greatest artist. He rose to dominance on the proving grounds of Omexe, an ancient arena where centaur clans have for millennia gathered to perform their gladiatorial rites. As his fame spread, spectators came from far and wide to see the great centaur in action. Always the first to step into the arena, and the last to leave, he composes a masterpiece in each guttering spray, each thrust of blood-slickened blade-length. It is the poetry of blood on steel, flung in complex patterns across the pale sands of the killing floor. Warrunner defeated warrior after warrior, until the arena boomed with the cheering of his name, and he found himself alone, the uncontested champion of his kind. The great belt of Omexe was bestowed, wrapped around his broad torso, but in his victory, the death-artist found only emptiness. For what is a warrior without a challenge? The great centaur galloped out of Omexe that day with a new goal. To his people, Warrunner is the greatest warrior to ever step into the arena. Now he has set out to prove he is the greatest fighter who has ever lived.","talentsTips":["The evasion talent stacks multiplicatively with other sources of evasion.","This attack damage talent is added as base attack damage, so it does benefit illusions, and is affected by every percentage-based damage increasing or reducing effects.","The strength talent effectively grants Centaur Warrunner 400 health, 2 health regen, 1.6% magic resistance and 20 attack damage."],"trivia":["In DotA, Bradwarden's hero title was Centaur Warchief.","Bradwarden is the name of a centaur in the first DemonWars Saga trilogy by R.A. Salvatore.","Hoof Stomp's animation originally consisted of Centaur Warrunner slamming the ground with the shaft of his axe. This was later changed after community requests that the animation reflects the ability name."],"talents":["+1.5s Hoof Stomp Duration:Gains Retaliate Aura","+20 Strength:+80 Retaliate Damage","+50% Double Edge Strength Damage:+30 Base Damage","+20 Movement Speed:10% Evasion"],"desc":"Centaur Warrunner 27 + 4.6 15 + 1 15 + 1.6 Level Base 1 15 25 Health 200 740 2020 2940 Health regen 0 2.7 9.14 13.74 Magic res. 25% 26.62% 30.48% 33.24% Mana 75 255 519 711 Mana regen 0 0.75 1.87 2.67 Spell dmg 0% 1.05% 2.62% 3.74% Armor 0 2.4 4.64 6.24 Att\/sec 0.59 0.68 0.76 0.82 Move sp amp. 0% 0.75% 1.45% 1.95% Damage 36‒38 63‒65 127‒129 173‒175 Movement speed 300 Attack speed 100 Turn rate 0.5 Vision range 1800\/800 Attack range 150 Projectile speed Instant Attack animation 0.3+0.3 Base attack time 1.7 Collision size 24 Legs 4  Gib type Default"}