{"abilities":[{"spell":"Герой бьёт о землю, оглушая противников неподалёку и нанося им урон.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["Способность сначала применяет дебафф, затем наносит урон."],"mana":"115\/120\/125\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"13","name":"Hoof Stomp","description":["Анимация применения: 0,5+0,3","Радиус: 315","Урон: 80\/110\/140\/170","Длительность оглушения: 2\/2.25\/2.5\/2.75 ( 3.5\/3.75\/4\/4.25)"],"hot_key":"Q","legacy_key":"F"},{"spell":"Герой совершает сокрушительный удар, нанося урон себе, цели и всем врагам неподалёку от неё. Урон этой способности частично зависит от силы владельца, и он не может погибнуть от её применения.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Double Edge наносит магический урон как цели, так и самому заклинателю.","Центром радиуса урона является сама цель, а не Centaur Warrunner.","Урон, наносимый себе, не может быть смертельным, поэтому его нельзя использовать для добивания себя."],"mana":"0","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"5","name":"Double Edge","description":["Анимация применения: 0,4+0,43","Дальность применения: 150","Радиус урона: 190","Базовый урон: 175\/250\/325\/400","Дополнительный урон от силы:: 60%\/80%\/100%\/120% ( 110%\/130%\/150%\/170%)"],"hot_key":"W","legacy_key":"D"},{"spell":"Каждый удар по герою наносит урон и атакующему. Способность получает один эффект от каждой атаки героя или башни. Её можно применить, потратив все эффекты и получив дополнительный базовый урон на 20 сек.","effects":["Способность Ненаправленная \/ Пассивная","Действует на Врагов \/ Себя","Урон Физический"],"notes":["При применении прерывает произносимые заклинания Centaur Warrunner.","Retaliate срабатывает только при попадании атаки по Centaur Warrunner вне зависимости от расстояния. То есть способность не срабатывает на промахнувшиеся атаки.","Сначала возвращаемый урон наносится атакующему, и только после этого - самому Centaur Warrunner.","Вторичные атаки от Moon Glaives, Split Shot до выбора героем таланта и Flak Cannon не активируют Retaliate . При этом вторичные атаки от других источников мгновенных атак способность активируют.","Не срабатывает от атак вардов и Undying Zombie. Срабатывает от атак строений.","Действует на союзных юнитов: если союзник умрет от возвращаемого урона - это будет засчитано за добивание.","Получает заряды только от атак башен и героев. Учитывает атаки иллюзий и клонов, но не крипов-героев. Бафф состояния становится видимым при наличии зарядов, показывая их количество. Счетчик вновь становится невидимым, когда заряды заканчиваются. При применении все заряды исчезают, а герой получает бафф урона, дающий дополнительный урон на основе имевшихся зарядов.","Бонус увеличивает только базовый урон и урон, даваемый основным атрибутом. Дополнительный урон не увеличивается.","Здесь указано, сколько урона бафф дает с определенным количеством зарядов на каждом уровне способности: Уровень 1: 6% \/ 12% \/ 18% \/ 24% \/ 30% \/ 36% \/ 42% \/ 48% \/ 54% \/ 60% \/ 66% \/ 72% \/ 78% урона от атаки Уровень 2: 9% \/ 18% \/ 27% \/ 36% \/ 45% \/ 54% \/ 63% \/ 72% \/ 81% \/ 90% \/ 99% \/ 108% \/ 117% урона от атаки Уровень 3: 12% \/ 24% \/ 36% \/ 48% \/ 60% \/ 72% \/ 84% \/ 96% \/ 108% \/ 120% \/ 132% \/ 144% \/ 156% урона от атаки Уровень 4: 15% \/ 30% \/ 45% \/ 60% \/ 75% \/ 90% \/ 105% \/ 120% \/ 135% \/ 150% \/ 165% \/ 180% \/ 195% урона от атаки","Изначально Retaliate - это аура, но она распространяется только на владельца до выбора соответствующего таланта. Бафф не отображается на владельце. При выборе таланта аура начинает распространятся только на героев и крипов-героев. Бафф от ауры задерживается на 0,5 секунды."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"55\/50\/45\/40","name":"Retaliate","description":["Радиус ауры: 0 ( 1200)","Возвращаемый урон: 16\/32\/48\/64 ( 86\/102\/118\/134)","Доп. урон за заряд: 6%\/9%\/12%\/15%","Макс. зарядов: 13","Длительность активации: 20","Длительность задержки ауры: 0,5"],"hot_key":"E","legacy_key":"R"},{"spell":"Герой ведёт союзников в яростное наступление. Они проходят сквозь существ на максимальной скорости и втаптывают в землю всех врагов на пути, останавливая их и нанося им урон, зависящий от силы владельца способности. Каждого врага можно втоптать в землю лишь один раз.","effects":["Способность Ненаправленная","Действует на Союзников \/ Врагов","Урон Магический"],"notes":["При использовании прерывает произносимые заклинания Centaur Warrunner.","Действует на каждого подконтрольного игрокам союзного юнита, исключая курьеров, варды, строения и иллюзии Haunt.","Затронутые союзники получают эффект сквозного движения и ускорение, поэтому их нельзя замедлить ниже установленного значения.","Урон от силы рассчитывается при каждом отдельном прохождении через врага, поэтому он мгновенно адаптируется при изменении силы Centaur Warrunner. Тем не менее, множитель урона фиксируется до окончания действия и не изменится, если увеличить уровень Stampede.","Stampede сначала наносит урон, затем применяет дебафф.","Звуковой эффект является глобальным и может быть услышан врагами даже сквозь туман войны.","При улучшении Aghanim's Scepter позволяет союзникам проходить по возвышенностям и разрушать деревья, пока действует способность. Не разрушает деревья вокруг союзников, на которых действует модификатор от Tree Dance.","Уменьшение урона действует на все 3 типа урона."],"mana":"150","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"110\/100\/90","name":"Stampede","description":["Анимация применения: 0+0","Радиус урона\/замедления: 105","Множитель урона за силу: 100%\/200%\/300%","Уменьшение получаемого союзниками урона: 0 ( 40%)","Скорость ускорения: 550","Замедление скорости передвижения: 100%","Длительность замедления: 1.8","Длительность: 4"],"hot_key":"R","legacy_key":"T"}],"bio":"Говорят, что жизненный путь кентавра вымощен телами павших. И для кентавра по имени Warrunner этот путь был действительно длинным. Многие чужестранцы ошибочно принимают четырёхногих воинов из кланов Друуда за простоватых громил. У их языка нет письменной формы, культура бедна на графические символы; в музыке нет четкой структуры, а в религии — строгих правил и догм. Для кентавров лучшее выражение их мыслей и чувств — это битва. И если убийство среди кентавров считается искусством, то самый талантливый из их творцов — Брэдводен. Свою несокрушимую мощь он взрастил на землях Омекса, на древней арене, где тысячелетиями кланы кентавров собирались, чтобы провести гладиаторские церемонии. И чем дальше распространялась слава о нём, тем больше зрителей со всего света прибывало, чтобы увидеть великого кентавра в действии. Всегда выходя на арену первым и уходя последним, он создавал шедевры каждым брызгом крови, каждым взмахом окровавленного лезвия. Такова поэзия крови и стали, сложный узор на бледных песках бойни. Warrunner побеждал одного воина за другим до тех пор, пока арена не взрывалась выкриками его имени, и он не становился единственным, несравненным чемпионом. Ему был вручен великий пояс Омекса, но в победе ощущалась лишь пустота. Каков же воин без постоянного вызова? Великий кентавр ускакал из Омекса в тот же день с новой целью. Для своего народа Warrunner — это величайший воин, который ступал на арену. Теперь Warrunner стремится доказать, что он — величайший воин во всей истории.","talentsTips":["Талант на уклонение мультипликативно сочетается с другими источниками уклонения.","Этот талант добавляет урон от атаки в базовый урон от атаки, так что он даётся иллюзиям, и также попадает под действие всех эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на силу в общем даёт Centaur Warrunner: 400 здоровья, 2 регенерации здоровья, 1.6% сопротивления магии и 20 урона от атаки."],"trivia":["В DotA, имя героя было Centaur Warchief.","Имя Bradwarden (Брэдварден) является отсылкой к имени кентавра в первой трилогии \"Войны демонов\" (Demon Wars) произведении писателя Роберта Сальваторе."],"talents":["+1,5 сек. оглушения Hoof Stomp:Retaliate становится аурой","+20 к силе:+70 к урону от Retaliate","+50% к урону от силы у Double Edge:+30 к базовому урону","+20 к скорости передвижения:+10% к уклонению"],"desc":"Centaur Warrunner — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Hoof Stomp, сотрясает землю, оглушая ближайших вражеских юнитов и нанося им урон. Вторая способность, Double Edge, наносит сокрушительный удар, нанося урон себе, жертве и всем в небольшом радиусе от нее. Пассивная способность, Return, наносит атакующему Centaur Warrunner врагу урон в процентах от своей силы. Ультимативная способность, Stampede, вводит Centaur Warrunner и всех его союзников в яростную атаку, что позволяет им проходить сквозь врагов на максимальной скорости, при этом останавливая их. Урон зависит от силы Centaur Warrunner. Каждый враг может получить урон от этой способности только один раз. Улучшение с Aghanim's Scepter уменьшает получаемый урон под действием Stampede, а также дает возможность проходить сквозь препятствия, в том числе деревья и уступы."}