{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7d\/Tango_Devour.mp3\/revision\/latest?cb=20191227195540",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Деревья \/ Себя"
      ],
      "notes": [
        "Когда применяется на дерево, то Tango уничтожает его и увеличивает регенерацию здоровья владельца. При использовании на посаженые деревья от Iron Branch, Ironwood Tree, Mango Tree, Woodland Striders или Sprout, длительность лечения удваивается. Один заряд Tango может восстановить до 115 (230 при использовании на посаженое дерево) здоровья за всю длительность. Все 3 заряда Tango могут восстановить до 345 (690 при использовании на посаженое дерево) здоровья. Последовательные применения на одно и то же дерево не складываются, но обновляют длительность.",
        "При использовании на посаженые деревья от Iron Branch, Ironwood Tree, Mango Tree, Woodland Striders или Sprout, длительность лечения удваивается.",
        "Один заряд Tango может восстановить до 115 (230 при использовании на посаженое дерево) здоровья за всю длительность.",
        "Все 3 заряда Tango могут восстановить до 345 (690 при использовании на посаженое дерево) здоровья.",
        "Последовательные применения на одно и то же дерево не складываются, но обновляют длительность.",
        "При использовании на союзного героя, Tango создаёт Tango (не свой) в инвентаре выбранного союзника, а не исцеляет его. Если инвентарь выбранного союзника заполнен, то предмет падает на землю. Также можно использовать на крипов-героев, при этом только Spirit Bear получает заряд Tango (не свой), с другими крипами-героями ничего не происходит. Также можно использовать на клона Meepo и Tempest Double, но без какого-либо эффекта. Нельзя использовать на иллюзии.",
        "Если инвентарь выбранного союзника заполнен, то предмет падает на землю.",
        "Также можно использовать на крипов-героев, при этом только Spirit Bear получает заряд Tango (не свой), с другими крипами-героями ничего не происходит.",
        "Также можно использовать на клона Meepo и Tempest Double, но без какого-либо эффекта.",
        "Нельзя использовать на иллюзии."
      ],
      "mana": null,
      "abilityName": "Devour",
      "cooldown": "0",
      "description": "Съедает дерево, увеличивая восстановление здоровья на 7. Действует 16 сек. Если съесть деревце от Iron Branch, то восстановится в два раза больше здоровья. Изначально имеет 3 заряда. Можно применить на союзного героя, чтобы дать ему один Tango.",
      "params": [
        "Дальность применения (Дерево\/Союзник): 165",
        "Доп. регенерация здоровья: 7.1875",
        "Длительность (Обычное дерево): 16",
        "Длительность (Посаженое дерево): 32"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Складываются друг с другом в инвентаре, без ограничения. Стоимость продажи зависит от количества Tango в ячейке.",
    "Набор Tango нельзя передавать. Однако, можно дать союзникам Tango (не свой), применив его на них.",
    "Стоимость продажи предмета зависит от количества оставшихся зарядов. Один заряд имеет стоимость продажи в 15 золота."
  ],
  "cost": "90",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Расходуемые",
  "name": "Tango",
  "description": "Натуральная пища для выживания на поле боя.",
  "trivia": [
    "В DotA, Tango называлось «Ancient Tango of Essifation».",
    "Активируемая способность Tango называлась «Eat a Tree or Ward» до обновления от 19 июня 2017."
  ],
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Tango — очень эффективный ресурс на начальной стадии игры для восстановления здоровья, так как он не рассеивается при получении урона. Когда бой кажется равным или не в вашу сторону, при использовании Tango вы можете изменить ситуацию в вашу пользу.",
    "Хотя один заряд Tango исцеляет гораздо меньше здоровья и делает это медленнее, чем Healing Salve, всё же один набор Tango восстанавливает немного больше здоровья за потраченное золото. Кроме того, он не рассеивается полученным уроном и имеет способность уничтожать деревья, что делает его более универсальным, чем Healing Salve. Поэтому, если вам не требуется быстрого и большого исцеления, Tango будет более ценным предметом.",
    "Так как использование Tango на дереве разрушает дерево, его можно использовать для создания дополнительных путей между некоторыми деревьями, что облегчает побег или преследование врага. Иногда стоит использовать Tango именно для этой цели.",
    "В отличие от других исцеляющих расходников, союзнику можно отдать один заряд Tango. Это позволит ему использовать Tango (не свой), находясь на другой линии. Если отдать 1 или 2 заряда Tango союзному герою средней линии, то это даст некоторое преимущество команде для достижения победы в игре.",
    "При использовании Tango на дереве, можно получить преимущество над определёнными героями. Например, если уничтожить дерево, на котором находится Monkey King, то он упадёт с него и будет долго находится в оглушении. Nature's Prophet не сможет безопасно телепортироваться, если вы уничтожите дерево от Sprout, которое скрывает его от вас в тумане войны."
  ]
}