{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d2\/Silencer_Arcane_Curse_1.mp3\/revision\/latest?cb=20191216023209",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Всякий раз, когда существо под действием способности использует заклинание, длительность увеличивается на 2 сек. У данного эффекта нет лимита на число накоплений. Если цель заклинания получит эффект безмолвия, время длительности (но не урон и замедление) будет приостановлено до окончания эффекта Игнорирует переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице.",
        "Если цель заклинания получит эффект безмолвия, время длительности (но не урон и замедление) будет приостановлено до окончания эффекта",
        "Игнорирует переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице.",
        "Несколько применений складываются, всегда накладывая отдельные дебаффы.",
        "Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 6 (+2 за примененную способность) раз. Наносит до 96\/144\/192\/240 (+32\/48\/64\/80 за примененную способность) (TagTalent 168\/216\/264\/312, +56\/72\/88\/104 за примененную способность) урона одному существу (до уменьшений).",
        "Наносит до 96\/144\/192\/240 (+32\/48\/64\/80 за примененную способность) (TagTalent 168\/216\/264\/312, +56\/72\/88\/104 за примененную способность) урона одному существу (до уменьшений).",
        "Звуковой эффект, проигрывающийся за каждое нанесение урона способностью, слышен только игроку, чье существо находится под действием дебаффа."
      ],
      "mana": "20\/18\/16\/14",
      "item_behaviour": [],
      "name": "Arcane Curse",
      "cooldown": "130\/135\/140\/145",
      "description": "Проклинает вражеских героев в выбранной области, нанося им периодический урон и замедляя их скорость передвижения. Каждая применённая жертвой способность увеличивает длительность эффекта. Замедление и урон удваиваются, если цель обезмолвлена.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+0,37",
        "Дальность применения: 1000",
        "Радиус: 425",
        "Урон в секунду: 16\/24\/32\/40 ( 28\/36\/44\/52)",
        "Замедление скорости передвижения: 9%\/12%\/15%\/18% ( 9,8%\/12,8%\/15,8%\/18,8%)",
        "Начальная длительность: 6",
        "Добавочная длительность: 2",
        "Множитель эффекта при безмолвии: 1,5"
      ],
      "legacy_key": "C",
      "story": "Недостаток заклинаний у Нортрома беспокоит не столько его самого, сколько его врагов."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c6\/Silencer_Glaives_of_Wisdom_1.mp3\/revision\/latest?cb=20191216023203",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Чистый"
      ],
      "notes": [
        "Дальность применения Glaves of Wisdom рассчитывается от дальности атаки заклинателя. Дальность может быть увеличена иными бонусами к дальности атаки. Но на неё не действует бонусы к дальности применения. Талант на дополнительную дальность атаки увеличивает дальность применения до 610.",
        "Дальность может быть увеличена иными бонусами к дальности атаки. Но на неё не действует бонусы к дальности применения.",
        "Талант на дополнительную дальность атаки увеличивает дальность применения до 610.",
        "Дополнительный урон наносится отдельным источником и считается за урон от заклинаний. То есть на урон не влияет и его не учитывают эффекты, взаимодействующие с уроном от атаки. Также на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "То есть на урон не влияет и его не учитывают эффекты, взаимодействующие с уроном от атаки.",
        "Также на урон действует усиление урона заклинаний и вампиризм заклинаний.",
        "Урон Glaives of Wisdom наносится до урона от атаки, но его нанесение всё еще зависит от попадания атаки по цели.",
        "Проверяет показатель интеллекта Silencer при поражении цели снарядом. Увеличение\/потеря интеллекта в момент, пока снаряд летит, влияет на его урон. Крадет интеллект до нанесения урона и, соответственно, увеличивает урон Glaives of Wisdom.",
        "Крадет интеллект до нанесения урона и, соответственно, увеличивает урон Glaives of Wisdom.",
        "Увеличивает показатели Silencer и, сответственно, уменьшает их для цели на следующие значения: 12\/12\/24\/36 маны и 0,05\/0,05\/0,1\/0,15 регенерации маны (и 1\/1\/2\/3 урона, если главный атрибут цели — интеллект) за атаку. Каждая атака накладывает скрытый модификатор в качестве баффа\/дебаффа как на цель, так и на Silencer. То есть их длительность не связана друг с другом. Модификаторы-счетчики на цели и Silencer показывают число потерянного\/полученного интеллекта. Также уменьшает текущую ману цели на 12 за украденный интеллект вместо сохранения текущего соотношения. Silencer, в отличии от целей, сохраняет соотношение текущей маны при получении и потере интеллекта. Не может довести базовый показатель вражеского интеллекта до отрицательных значений, но Silencer всегда получает интеллект независимо от его количества у цели. Не может украсть интеллект у иллюзий или клонов Meepo, но крадет его у Tempest Double.",
        "Каждая атака накладывает скрытый модификатор в качестве баффа\/дебаффа как на цель, так и на Silencer. То есть их длительность не связана друг с другом.",
        "Модификаторы-счетчики на цели и Silencer показывают число потерянного\/полученного интеллекта.",
        "Также уменьшает текущую ману цели на 12 за украденный интеллект вместо сохранения текущего соотношения. Silencer, в отличии от целей, сохраняет соотношение текущей маны при получении и потере интеллекта.",
        "Silencer, в отличии от целей, сохраняет соотношение текущей маны при получении и потере интеллекта.",
        "Не может довести базовый показатель вражеского интеллекта до отрицательных значений, но Silencer всегда получает интеллект независимо от его количества у цели.",
        "Не может украсть интеллект у иллюзий или клонов Meepo, но крадет его у Tempest Double.",
        "Интеллект умершего героя возвращается к обычному значению, а Silencer сохраняет полученнный на длительность дебаффа. То есть похищенный интеллект (и бонусы от него) возвращаются к нормальным значениям либо при завершении дебаффа, либо смерти цели.",
        "То есть похищенный интеллект (и бонусы от него) возвращаются к нормальным значениям либо при завершении дебаффа, либо смерти цели.",
        "Украденный интеллект напрямую забирается из базового интеллекта врага и добавляется к базовому интеллекту Silencer. Неважно, как именно умрет вражеский герой в пределах радиуса, Silencer всегда получает его интеллект. Также Silencer всегда получает интеллект, если он нанесет урон, повлекший смерть вражеского героя, независимо от расстояния. Но при этом для получения заряда Silencer должен быть жив на момент смерти цели. Не крадет интеллект у иллюзий или клонов героев. При убийстве Meepo интеллект дается только за главного. Не может довести базовый показатель вражеского интеллекта до отрицательных значений. Также Silencer не получает интеллект от героев, у которых показатель интеллекта уже равен 1. Увеличивает показатели Silencer и, сответственно, уменьшает их для цели на следующие значения: 24\/48 маны и 0.1\/0.2 регенерации маны (и 2\/4 урона, если главный атрибут цели — интеллект). Постоянный бонус к интеллекту не пересчитывается: Glaives of Wisdom не получает накопления за убийства и смерти, произошедшие до её изучения.",
        "Неважно, как именно умрет вражеский герой в пределах радиуса, Silencer всегда получает его интеллект.",
        "Также Silencer всегда получает интеллект, если он нанесет урон, повлекший смерть вражеского героя, независимо от расстояния.",
        "Но при этом для получения заряда Silencer должен быть жив на момент смерти цели.",
        "Не крадет интеллект у иллюзий или клонов героев. При убийстве Meepo интеллект дается только за главного.",
        "Не может довести базовый показатель вражеского интеллекта до отрицательных значений. Также Silencer не получает интеллект от героев, у которых показатель интеллекта уже равен 1.",
        "Увеличивает показатели Silencer и, сответственно, уменьшает их для цели на следующие значения: 24\/48 маны и 0.1\/0.2 регенерации маны (и 2\/4 урона, если главный атрибут цели — интеллект).",
        "Постоянный бонус к интеллекту не пересчитывается: Glaives of Wisdom не получает накопления за убийства и смерти, произошедшие до её изучения.",
        "С Aghanim's Shard глефа отскакивает в ближайшее вражеское существо в радиусе 600 от атакуемой цели. Отскочившие глефы летят со скоростью 900 (базируясь на скорости снаряда заклинателя). Не совершает мгновенные атаки. Отскок — часть заклинания. То есть на него не реагируют любые модификаторы атаки или эффекты, срабатывающие при атаке и он игнорирует уклонение. При этом на него действует блокировка урона. Этот урон считается за урон от заклинаний; при этом он игнорирует усиление урона заклинаний и от него не идет вампиризм заклинаний.",
        "Отскочившие глефы летят со скоростью 900 (базируясь на скорости снаряда заклинателя).",
        "Не совершает мгновенные атаки. Отскок — часть заклинания.",
        "То есть на него не реагируют любые модификаторы атаки или эффекты, срабатывающие при атаке и он игнорирует уклонение. При этом на него действует блокировка урона.",
        "Этот урон считается за урон от заклинаний; при этом он игнорирует усиление урона заклинаний и от него не идет вампиризм заклинаний.",
        "Урон отскока рассчитывается от урона изначальной атаки и его значение определяется во время начала атаки. То есть на него влияет критический удар и Quell, поскольку они включаются в изначальный расчет урона. Также неважно, сколько фактически урона нанесет атака цели, поскольку это рассчитывается при попадании снаряда. При этом дополнительный урон от других источников (например, срабатывание Javelin) не учитывается, поскольку он наносится после урона атаки. Глефа всё так же наносит отдельно урон, зависящий от интеллекта, и крадет интеллект, если цель — герой.",
        "То есть на него влияет критический удар и Quell, поскольку они включаются в изначальный расчет урона.",
        "Также неважно, сколько фактически урона нанесет атака цели, поскольку это рассчитывается при попадании снаряда.",
        "При этом дополнительный урон от других источников (например, срабатывание Javelin) не учитывается, поскольку он наносится после урона атаки.",
        "Глефа всё так же наносит отдельно урон, зависящий от интеллекта, и крадет интеллект, если цель — герой."
      ],
      "mana": "0",
      "item_behaviour": [],
      "name": "Glaives of Wisdom",
      "cooldown": "15",
      "description": "Герой наполняет глефы своей мудростью, отчего они наносят дополнительный урон, зависящий от интеллекта владельца, и временно крадут интеллект цели с каждой атакой.",
      "hot_key": "W",
      "params": [
        "Дальность применения: 600 ( 610)",
        "Радиус кражи: 925",
        "Постоянный бонус к интеллекту: 2 ( 4)",
        "Интеллекта в урон: 15%\/35%\/55%\/75% ( 15,003333333333%\/35,003333333333%\/55,003333333333%\/75,003333333333%)",
        "Похищение интеллекта: 1\/1\/2\/3",
        "Длительность похищения: 15\/20\/25\/30",
        "Радиус отскока: 600",
        "Число отскоков: 1",
        "Урон отскока от атаки: 50%"
      ],
      "legacy_key": "W",
      "story": "Пусть Нортром не силён в традиционных заклинаниях, селекция придала ему непостижимую мудрость, которую он и применяет в физическом бою."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/56\/Silencer_Last_Word.mp3\/revision\/latest?cb=20191216023207",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Когда цель использует заклинание в течение 4 сек. начального дебаффа, она получает урон, затем — безмолвие, а уже затем применяет своё заклинание. Поскольку способность считается примененной, безмолвие не мешает её применению. Хотя безмолвие срабатывает первым, эффекты заклинания уже поставлены в очередь. При этом смерть цели может остановить заклинание; в случае, если урона от Last Word будет достаточно для убийства цели, применение не сработает. Также заклинания, отрицающие урон (например, Refraction) и заклинания, дающие иммунитет к заклинаниям не блокируют этот урон.",
        "Поскольку способность считается примененной, безмолвие не мешает её применению. Хотя безмолвие срабатывает первым, эффекты заклинания уже поставлены в очередь.",
        "При этом смерть цели может остановить заклинание; в случае, если урона от Last Word будет достаточно для убийства цели, применение не сработает.",
        "Также заклинания, отрицающие урон (например, Refraction) и заклинания, дающие иммунитет к заклинаниям не блокируют этот урон.",
        "Не реагирует на переключаемые способности, активные модификаторы атаки и способности, перечисленные в этой таблице. Реагирует на произносимые заклинания, но сначала ждет окончания произнесения. Last Word срабатывает на Phase Shift, но применяет безмолвие только в случае досрочной отмены игроком.",
        "Реагирует на произносимые заклинания, но сначала ждет окончания произнесения.",
        "Last Word срабатывает на Phase Shift, но применяет безмолвие только в случае досрочной отмены игроком.",
        "Когда базовый дебафф истечет, он нанесет урон и обезмолвит цель. Если у цели нет интеллекта, она получит только базовый урон. Last Word сначала применяет дебаффы, затем наносит урон. Дает общий обзор на все 3\/4\/5\/6 сек. действия базового дебаффа.",
        "Если у цели нет интеллекта, она получит только базовый урон.",
        "Last Word сначала применяет дебаффы, затем наносит урон.",
        "Дает общий обзор на все 3\/4\/5\/6 сек. действия базового дебаффа.",
        "С Aghanim's Scepter Last Word становится направленной на область способностью с радиусом 500; ей больше нельзя выбрать существо напрямую."
      ],
      "mana": "22\/18\/14\/10",
      "item_behaviour": [],
      "name": "Last Word",
      "cooldown": "100\/105\/110\/115",
      "description": "Зачаровывает цель, отчего она через некоторое время получит урон и будет обезмолвлена. Также даёт обзор по цели. Чары сработают раньше, если жертва применит способность. Наносит дополнительный урон, зависящий от разницы в интеллекте с целью.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0,47",
        "Дальность применения: 900",
        "Базовый урон: 120\/160\/200\/240",
        "Множитель разницы в интеллекте: 1,5\/2\/2,5\/3 ( Ошибка Lua в Модуль:Calculate на строке 39: in expression \"1,5+\".)",
        "Базовая длительность дебаффа: 4",
        "Длительность безмолвия: 3\/4\/5\/6",
        "Радиус: 500"
      ],
      "legacy_key": "T",
      "story": "Нортром гарантирует, что магические слова, произнесенные его врагами, станут последними."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/14\/Silencer_Global_Silence_1.mp3\/revision\/latest?cb=20191216023205",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Врагов"
      ],
      "notes": [
        "Безмолвие действует на невосприимчивых к магии, невидимых и неуязвимых крипов, призванных существ и героев. Не действует на спрятанных существ.",
        "Звуковой эффект от Global Silence, проигрывающийся каждому вражескому герою, имеет наивысший приоритет среди всех звуков в игре. То есть способность сильно заглушает остальные игровые звуки для врагов, делая его практически единственным звуком, который они будут слышать на протяжении длительности безмолвия.",
        "То есть способность сильно заглушает остальные игровые звуки для врагов, делая его практически единственным звуком, который они будут слышать на протяжении длительности безмолвия."
      ],
      "mana": "130\/115\/100 (TagTalent 120\/105\/90)",
      "item_behaviour": [],
      "name": "Global Silence",
      "cooldown": "300\/450\/600",
      "description": "Герой заглушает все звуки на поле боя, не давая врагам применять способности.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,37",
        "Радиус: Глобальный",
        "Длительность: 4,5\/5,25\/6"
      ],
      "legacy_key": "E",
      "story": "Удар по земле — и звуки магии утихают: Нортром исполняет своё предназначение."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.2,
    "attrStrength": 19.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 2.9,
    "attrAgilityInc": 2.4,
    "attrAgility": 22.0
  },
  "description": "Last Word запрещает использовать предметы 2 отскока у атак с Glaives of Wisdom Эффект от Arcane Curse нельзя развеять +10% к урону от Glaives of Wisdom +0,8 к множителю интеллекта у Last Word −25 сек. перезарядки Global Silence +20 к скорости атаки +12 к урону от Arcane Curse",
  "history": "Часть седьмого и последнего поколения тщательно спланированной селекции, Нортром выведен древним орденом Эол Драйас, дабы стать величайшим из магов, что видел свет. Он был тем, о ком гласило пророчество: кульминацией двухсот лет осторожного скрещивания, магом-бойцом, что принёс бы славу ордену и погибель заклятым врагам его, рыцарям Покрова. Он рос вместе с другими молодыми магами в военном городке, сокрытом среди холмов Хажадальских пустошей, и наставники ждали, когда способности Нортрома проявят себя. Остальные ученики уже оттачивали мастерство обращения с огнём, льдом или чарами, а Нортром оставался молчаливым и бездарным, неспособным даже наложить сглаз. День финальных испытаний близился, но он так и не нашёл своего призвания. С отвращением наставники ругали его, а дети осмеивали. «Ты не маг», — провозгласил глава ордена. И всё же Нортром не отступил. Он явился в день экзамена и дерзко предстал перед молодыми магами, что насмехались над ним. И тогда его наставники получили ценный урок: отсутствие магии может быть лучшим из всех её видов. Юные маги не могли произнести ни слова, а Нортром одерживал победу в одном поединке за другим, покуда не остался на поле сражения один. Пророчество было исполнено. Именно он — величайший маг ордена Эол Драйас."
}