{
  "abilities": [
    {
      "notes": [
        "The strength talent effectively grants Anti-Mage 180 health and 0.9 health regeneration."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-50s Mana Void Cooldown",
          "talentRight": "+20% Counterspell Magic Resistance"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+250 Blink Cast Range",
          "talentRight": "+0.1 Mana Void Damage Multiplier"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+0.7s Mana Void Stun",
          "talentRight": "+0.6% Max Mana Mana Burn"
        },
        {
          "talentLvl": "10",
          "talentLeft": "-1s Blink Cooldown",
          "talentRight": "+9 Strength"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2f\/Anti-Mage_Mana_Break.mp3\/revision\/latest?cb=20191216010736",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Deals 14\/20\/26\/32 extra damage + 0.5%\/0.9%\/1.3%\/1.7% (TagTalent 0.8%\/1.2%\/1.6%\/2%) of the target's max mana as damage (before reductions). The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of and cleave, but it is not considered by crit. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well.",
        "It can be lifestealed off of and cleave, but it is not considered by crit.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Illusions burn a reduced amount of 14\/20\/26\/32 mana + 0.5%\/0.9%\/1.3%\/1.7% max mana per hit. Illusions also deal a reduced amount of bonus damage; 7\/10\/13\/16 extra damage + 0.25%\/0.45%\/0.65%\/0.85% (TagTalent 0.4%\/0.6%\/0.8%\/1%) of the target's max mana as damage (before reductions)",
        "Illusions also deal a reduced amount of bonus damage; 7\/10\/13\/16 extra damage + 0.25%\/0.45%\/0.65%\/0.85% (TagTalent 0.4%\/0.6%\/0.8%\/1%) of the target's max mana as damage (before reductions)",
        "Applies the mana loss first, and then the damage.",
        "Does not work against allied units when attacking them.",
        "Does not stack with Diffusal Blade's Manabreak."
      ],
      "mana": null,
      "hotKey": "Q",
      "cooldown": null,
      "description": "Burns an opponent's mana on each attack. Mana Break deals 50% of the mana burned as damage to the target. Mana Break has 50% effect if caused by illusions.",
      "spellName": "Mana Break",
      "params": [
        "Mana Burned per Hit: 28\/40\/52\/64",
        "Max Mana Burned per Hit: 1%\/1.8%\/2.6%\/3.4% (TagTalent 1.6%\/2.4%\/3.2%\/4%)",
        "Burned Mana as Damage: 50%",
        "Illusion Percentage: 50%",
        "Values are halved for illusions."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Anti-Mage_Blink_1.mp3\/revision\/latest?cb=20191216010740",
      "effects": [
        "Ability Target Point",
        "Affects Self"
      ],
      "notes": [
        "Blink disjoints projectiles upon cast.",
        "Does not blink for the full distance when targeting closer than the max distance. When targeting beyond the max blink distance, Anti-Mage blinks for the max distance towards the targeted point.",
        "When targeting beyond the max blink distance, Anti-Mage blinks for the max distance towards the targeted point."
      ],
      "mana": "60",
      "hotKey": "W",
      "cooldown": "15\/12\/9\/6 (TagTalent 14\/11\/8\/5)",
      "description": "Short distance teleportation that allows Anti-Mage to move in and out of combat.",
      "spellName": "Blink",
      "params": [
        "Cast Animation: 0.4+0.53",
        "Cast Range: Global",
        "Max Blink Distance: 925\/1000\/1075\/1150 (TagTalent 1175\/1250\/1325\/1400)",
        "Grants a new ability: Blink Fragment."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Anti-Mage_Counterspell_1.mp3\/revision\/latest?cb=20191216010734",
      "effects": [
        "Ability No Target",
        "Affects Self"
      ],
      "notes": [
        "Interrupts Anti-Mage's channeling abilities on cast.",
        "Stacks multiplicatively with other sources of magic resistance.",
        "Increases Anti-Mage's total magic resistance to 36.25%\/43.75%\/51.25%\/58.75% (TagTalent 51.25%\/58.75%\/66.25%\/73.75%).",
        "Linken's Sphere, Lotus Orb, and Mirror Shield do not trigger for Anti-Mage while Counterspell is active.",
        "Unlike other sources of spell reflection, Counterspell does not reflect Phantom Strike and Blink Strike. They do get blocked still.",
        "With Aghanim's Shard, Counterspell provides two auras. Both auras linger for 0.5 seconds. The first aura has a radius of 900 and reduces enemy spell damage by 10%. The second aura has a radius of 300 and increases the spell damage reduction of the first aura to 30%. Applies generic outgoing damage reduction on enemies within range. Stacks additively with other sources of generic outgoing damage manipulation. The reduction affects only spell damage enemies deal that is not flagged as HP removal. Attack damage is not reduced.",
        "The first aura has a radius of 900 and reduces enemy spell damage by 10%.",
        "The second aura has a radius of 300 and increases the spell damage reduction of the first aura to 30%.",
        "Applies generic outgoing damage reduction on enemies within range. Stacks additively with other sources of generic outgoing damage manipulation.",
        "The reduction affects only spell damage enemies deal that is not flagged as HP removal. Attack damage is not reduced."
      ],
      "mana": "45\/50\/55\/60",
      "hotKey": "E",
      "cooldown": "15\/11\/7\/3",
      "description": "Passively grants you magic resistance. Can be activated to create an anti-magic shell around you that sends any targeted spells back towards enemies instead of affecting you.",
      "spellName": "Counterspell",
      "params": [
        "Cast Animation: 0+0",
        "Magic Resistance Bonus: 15%\/25%\/35%\/45% (TagTalent 35%\/45%\/55%\/65%)",
        "Shell Duration: 1.2",
        "Aura Far Radius: 900",
        "Aura Close Radius: 300",
        "Far Outgoing Spell Damage Reduction: 10%",
        "Close Additional Outgoing Spell Damage Reduction: 20%",
        "Aura Linger Duration: 0.5",
        "Counterspell passively grants a 900 radius aura that reduces enemy spell damage by 10%. Reduces spell damage by an additional 20% to enemies within 300 range",
        "The passive magic resistance bonus and the Spell Weakness aura are disabled.",
        "Illusions do not get the passive magic resistance bonus. Illusions provide the Spell Weakness aura."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a3\/Anti-Mage_Blink_Fragment_1.mp3\/revision\/latest?cb=20201220204524",
      "effects": [
        "Ability Target Point \/ Target Unit",
        "Affects Enemies"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "The illusion is created facing the same direction as the caster, along with Blink's particles and sounds.",
        "The illusion cannot act, so it is completely uncontrollable.",
        "The illusion is not invulnerable, and can be attacked and killed normally.",
        "When targeting an enemy, the illusion attacks that enemy.",
        "When targeting the ground, the illusion relies on ◉ Standard auto-attack rules. The illusion ignores the player's auto-attack settings and is always in auto-attack mode. When no enemies are nearby, the illusion just idles in place, only moving when getting aggroed.",
        "The illusion ignores the player's auto-attack settings and is always in auto-attack mode.",
        "When no enemies are nearby, the illusion just idles in place, only moving when getting aggroed.",
        "The illusion is permanently phased.",
        "Counterspell is cast simultaneously by the illusion whenever Anti-Mage casts it."
      ],
      "mana": "50",
      "hotKey": "D",
      "cooldown": "0",
      "description": "Blinks an illusion at the target enemy or location and attack them for 7 seconds. Counterspell is replicated on the Blink Fragment illusion. Has 3 Charges",
      "spellName": "Blink Fragment",
      "params": [
        "Cast Animation: 0.2+0.84",
        "Cast Range: 925\/1000\/1075\/1150 (TagTalent 1175\/1250\/1325\/1400)",
        "Illusion Damage Dealt: 75%",
        "Illusion Damage Taken: 200%",
        "Illusion Duration: 7",
        "Number of Charges: 3",
        "Charge Replenish Time: 25",
        "Cannot be cast on spell immune units."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Anti-Mage_Mana_Void.mp3\/revision\/latest?cb=20191216010737",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The targeting reticule must be centered over an enemy unit.",
        "The damage is calculated based on the primary target's mana, but applied to all enemies within the radius.",
        "Mana Void first applies the debuff, then the damage.",
        "Only the primary target gets stunned.",
        "Can be cast on units without a mana pool, applying the mini-stun only.",
        "Plays a sound effect during the cast time, which is audible to everyone."
      ],
      "mana": "100\/200\/300",
      "hotKey": "R",
      "cooldown": "70 (TagTalent 20)",
      "description": "For each point of mana missing by the target unit, damage is dealt to it and surrounding enemies. The main target is also mini-stunned.",
      "spellName": "Mana Void",
      "params": [
        "Cast Animation: 0.3+0.63",
        "Cast Range: 600",
        "Radius: 500",
        "Damage per Missing Mana: 0.8\/0.95\/1.1 (TagTalent 0.9\/1.05\/1.2)",
        "Stun Duration: 0.3 (TagTalent 1)",
        "Blocked fully only when primary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.6,
    "attrStrength": 23.0,
    "attrIntelligence": 12.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 2.8,
    "attrAgility": 24.0
  },
  "description": "Anti-Mage, is a fast melee agility hero with an emphasis on disrupting and killing high-mana enemies. He has notably high agility and low base attack time, giving him high damage and scaling with his basic attacks. His signature ability is Mana Break, a passive attack modifier that makes him a huge threat to mana-reliant heroes, mainly Intelligence-based casters. In addition to granting substantial bonus damage on each attack, its mana burn sets enemies up to be devastated by his ultimate ability, Mana Void. Blink is a highly versatile ability that allows Anti-Mage to instantly teleport short distances, thereby allowing him to escape, chase, and even farm with ease. Combined with his high base movement speed, this makes Anti-Mage a highly mobile hero at all points in the game. Counterspell greatly increases Anti-Mage's magic resistance, allowing him to sustain more damage from enemy casters. Finally, Mana Void finishes off targets after their mana has been burned, inflicting heavy damage to both the target and enemies surrounding the target. The damage Mana Void can potentially deal scales extremely well into the late game, as enemies' mana pools only grow larger over time. His naturally fast basic attacks combined with his powerful abilities make him extremely dangerous in the late game, allowing him to devastate enemies with ease if he is allowed to farm as a hard carry.",
  "history": "The monks of Turstarkuri watched the rugged valleys below their mountain monastery as wave after wave of invaders swept through the lower kingdoms. Ascetic and pragmatic, in their remote monastic eyrie they remained aloof from mundane strife, wrapped in meditation that knew no gods or elements of magic. Then came the Legion of the Dead God, crusaders with a sinister mandate to replace all local worship with their Unliving Lord's poisonous nihilosophy. From a landscape that had known nothing but blood and battle for a thousand years, they tore the souls and bones of countless fallen legions and pitched them against Turstarkuri. The monastery stood scarcely a fortnight against the assault, and the few monks who bothered to surface from their meditations believed the invaders were but demonic visions sent to distract them from meditation. They died where they sat on their silken cushions. Only one youth survived--a pilgrim who had come as an acolyte, seeking wisdom, but had yet to be admitted to the monastery. He watched in horror as the monks to whom he had served tea and nettles were first slaughtered, then raised to join the ranks of the Dead God's priesthood. With nothing but a few of Turstarkuri's prized dogmatic scrolls, he crept away to the comparative safety of other lands, swearing to obliterate not only the Dead God's magic users--but to put an end to magic altogether.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-50s Mana Void Cooldown",
      "talentRight": "+20% Counterspell Magic Resistance"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+250 Blink Cast Range",
      "talentRight": "+0.1 Mana Void Damage Multiplier"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+0.7s Mana Void Stun",
      "talentRight": "+0.6% Max Mana Mana Burn"
    },
    {
      "talentLvl": "10",
      "talentLeft": "-1s Blink Cooldown",
      "talentRight": "+9 Strength"
    }
  ]
}