{"abilities":[{"spell":"Focuses Enigma's power on a target, causing it to take damage and become repeatedly stunned for multiple instances. An instance strikes every 2 seconds.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["The first instance occurs upon cast, and then every 2 seconds.","Can deal up to 90\/150\/210\/270 ( 240\/400\/560\/720) damage (before reductions).","On each tick, Malefice first applies the damage, then the stun.","Multiple instances of Malefice do not stack, but refresh the duration instead. It continues ticking with the tick rate of the first cast."],"mana":"100\/120\/140\/160","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"18\/17\/16\/15 ( 15.3\/14.45\/13.6\/12.75)","name":"Malefice","description":["Cast Animation: 0.3+0.6","Cast Range: 600","Number of Instances: 3 ( 8)","Instance Interval: 2","Damage per Instance: 30\/50\/70\/90","Stun Duration per Instance: 0.4\/0.6\/0.8\/1","Malefice Duration: 4 ( 14)"],"hot_key":"Q","legacy_key":"F"},{"spell":"Transforms a creep into three fragments of Enigma himself. These eidolons are all under Enigma's control, and repeated successful attacks cause them to multiply. When this happens, the eidolons have their health restored.","effects":["Ability Target Unit","Affects Enemy Units \/ Allied Units","Damage Pure (HP Removal)"],"notes":["Demonic Conversion kills the target unit, granting the gold and experience bounty, or resulting in a deny when cast on allied units.","Attacking buildings or allied units does not count towards the number of attacks required to multiply, but attacking wards does. The attack is counted upon projectile launch, not upon hit, therefore, it does not matter whether the attack actually hits the target or not. Eidolons multiply upon their 7th attack projectile launch, regardless of whether the attack is a valid one (such as a building).","When multiplying, the Eidolon's health is refreshed. Their duration is not refreshed. However, the splitting Eidolon's duration gets increased by 2 seconds.","Eidolons can only multiply once. Eidolons which spawned through multiplication, cannot multiply.","Cannot be cast on ancient creeps, wards, creep-heroes, Necronomicon summons, Centaur Conquerors, Satyr Tormenters, Wildwing Rippers, Dark Troll Summoners, and Hellbear Smashers."],"mana":"140\/150\/160\/170","elements":["Not disabled by Break.","Not blocked by Linken's Sphere.","Partially pierces spell immunity."],"cooldown":"35 ( 29.75)","name":"Demonic Conversion","description":["Cast Animation: 0.3+0.7","Cast Range: 700","Number of Eidolons: 3 ( 10)","Attacks to Multiply: 6","Duration: 35"],"hot_key":"W","legacy_key":"C"},{"spell":"Steeps an area in dark resonance, damaging enemy units based on their max HP.","effects":["Ability Target Area","Affects Enemies","Damage Pure"],"notes":["Midnight Pulse deals damage in 1 second intervals, starting 1 second after cast, resulting in 9\/10\/11\/12 instances.","Can deal up to 31.5%\/40%\/49.5%\/60% of the affected units' maximum health as damage (before reductions).","Does not affect ancient creeps and wards.","Successive casts of Midnight Pulse work fully independently from each other.","Destroys trees within 550 radius at the target location upon cast."],"mana":"50\/80\/110\/140","elements":["Pierces spell immunity."],"cooldown":"50\/45\/40\/35 ( 42.5\/38.25\/34\/29.75)","name":"Midnight Pulse","description":["Cast Animation: 0.1+0","Cast Range: 700","Radius: 550","Max Health as Damage: 3.5%\/4%\/4.5%\/5%","Duration: 9\/10\/11\/12"],"hot_key":"E","legacy_key":"D"},{"spell":"Summons a vortex that sucks in nearby enemy units. Enemies affected by Black Hole cannot move, attack, or cast spells.","effects":["Ability Target Area \/ Channeled","Affects Enemies","Damage Pure"],"notes":["Fully disables all caught enemies and silences them.","Spirals affected units counterclockwise towards the center at a speed of 30, resulting in a maximum possible distance of 120. The closer the units are to the center, the stronger they get pulled to the center, with almost no pull, but only rotation at max distance.","Can pull affected units over impassable terrain and through trees without destroying them.","Units inside Black Hole can be pulled out by various spells. Force Staff, Hurricane Pike, Snowball and Geomagnetic Grip cannot move units out of Black Hole.","The pull and disable are provided by an aura, which lingers for 0.5 seconds, or until the channeling stops, whichever is shorter.","Deals damage in 1 second intervals, starting 1 second after cast, resulting in 4 instances.","Can deal up to 200\/400\/600 ( + 14%\/16%\/18%\/20% of maximum health) damage (before reductions).","Does not affect wards or buildings. Fully affects couriers.","The Aghanim's Scepter does not actually cause Midnight Pulse to be cast when using Black Hole, it just adds its damage to Black Hole: The extra damage is equal to the current level of Midnight Pulse, so if not learned, Black Hole deals no extra damage. The extra damage is dealt in separate instances, in the same intervals as Black Hole's damage, resulting in 8 total instances together with Black Hole's regular damage. The extra damage is dealt across the whole radius of Black Hole and lasts for the duration of Black Hole. The extra damage stacks with any previously cast Midnight Pulse and deals pure damage. Unlike the Midnight Pulse skill, the upgrade's pulse damage hits ancient creeps. Also unlike Midnight Pulse, it does not destroy trees in the area upon cast.","Provides 800 range ground vision at the targeted point for 4 seconds upon cast."],"mana":"300\/400\/500","elements":["Pierces spell immunity."],"cooldown":"200\/180\/160 ( 170\/153\/136)","name":"Black Hole","description":["Cast Animation: 0.3+0","Cast Range: 275","Max Channel Time: 4","Effect Radius: 420","Damage per Second: 50\/100\/150","Aura Linger Duration: 0.5"],"hot_key":"R","legacy_key":"B"}],"bio":"Nothing is known of Enigma’s background. There are only stories and legends, most of them apocryphal, passed down through the ages. In truth, Enigma is a mystery for whom the only true biography is description: he is a universal force, a consumer of worlds. He is a being of the void, at times corporeal, other times ethereal. A beast between the planes. There are stories that say he was once a great alchemist who tried to unlock the secrets of the universe and was cursed for his arrogance. Other legends tell that he is an ancient being of strange gravity, the abyss personified—a twisted voice from out the original darkness, before the first light in the universe. And there are older legends that say he is the first collapsed star, a black hole grown complicated and sentient—his motivations unknowable, his power inexorable, a force of destruction unleashed upon existence itself.","talentsTips":["The magic resistance talent stacks multiplicatively with other sources of magic resistance.","The magic resistance talent increases Enigma's magic resistance to 36.25%.","Gold granted from the talent is unreliable gold.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Many of Enigma's responses are references to Friedrich Nietzsche's works; the line, \"I stare also into you.\" references a passage in Beyond Good and Evil, where it is stated that \"And when you gaze long into an abyss the abyss also gazes into you\".","Enigma's rival line towards Faceless Void \"Even time may fail in the face of gravity.'\" is a reference to the time dilating effect of gravity.","Many of Enigma's responses are also references to concepts in cosmology (the Big Bang, gravity wells, redshifts, and black holes) or particle physics (path integrals, universal constants).","In DotA, Enigma's hero name was Darchrow. In the transition to Dota 2, his name was removed, most likely to emphasize his hero title.","Enigma, Chaos Knight, Keeper of the Light, and Io together represent the four fundamental forces of the universe with Enigma representing the gravitational force. This is reflected in several of Enigma's responses to these heroes. \"The Fundamentals unite.\"","The term \"eidolon\" comes from ancient greek literature, where it refers to a human-like phantom, the shade of one who died."],"talents":["+7 Demonic Conversion Eidolons:+5 Malefice Instance","+60 Eidolon Damage:+500 Health","+150 Gold\/Min:15% Cooldown Reduction","+15% Magic Resistance:+25 Movement Speed"],"desc":"Enigma is a ranged intelligence hero who uses his abilities to cripple his enemies, supported by a seemingly inexhaustible army of creeps. His fearsome abilities can bind entire teams under his might. Enigma is also a formidable jungler and pusher owing to his ability to create creeps."}