{"abilities":[{"spell":"Концентрирует энергию Enigma на цели, в результате чего та получает урон с течением времени и каждые 2 секунды оглушается.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Первое оглушение срабатывает при применении, затем через каждые 2 секунды.","Может нанести до 90\/150\/210\/270 ( 240\/400\/560\/720) единиц урона (до учета сопротивления).","При каждом срабатывании Malefice сначала наносит урон, затем оглушает.","Несколько применений Malefice не складываются, но обновляют длительность. Способность продолжает срабатывать с интервалами первого применения."],"mana":"100\/120\/140\/160","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"18\/17\/16\/15 ( 15.3\/14.45\/13.6\/12.75)","name":"Malefice","description":["Анимация применения: 0,3+0,6","Дальность применения: 600","Количество оглушений: 3 ( 8)","Интервал: 2","Урон за оглушение: 30\/50\/70\/90","Длительность оглушения за интервал: 0.4\/0.6\/0.8\/1","Длительность: 4 ( 14)"],"hot_key":"Q","legacy_key":"F"},{"spell":"Превращает крипа в три фрагмента самого Enigma. Эйдолоны находятся под контролем Enigma, а несколько успешных атак позволят им размножиться. Когда это происходит, они полностью восстанавливают здоровье.","effects":["Способность Направленная на юнита","Действует на Вражеских существ \/ Союзных существ","Урон Чистый (Отнимающий здоровье)"],"notes":["Demonic Conversion убивает выбранного юнита, давая золото и опыт, или добивает, если способность применена на союзных юнитов.","Атака строений или союзных юнитов не учитывается в качестве атак для размножения, но атака вардов - учитывается. Атака засчитывается при запуске снаряда, а не при его попадании. Эйдолоны размножаются после запуска 7-го снаряда от атаки, не принимая во внимание, была ли атакована подходящая цель или нет (например, строение).","При размножении здоровье эйдолонов обновляется. Их длительность не обновляется. При этом время жизни разделившихся эйдолонов увеличивается на 2 секунды.","Эйдолоны могут размножиться лишь один раз. Эйдолоны, появляющиеся после размножения, делиться не могут.","Нельзя использовать на древних крипов, варды, крипов-героев, призванных существ Necronomicon, кентавра-захватчика, сатира-мучителя, дикокрыла-потрошителя, тролля-некроманта и медведемона-крушителя."],"mana":"140\/150\/160\/170","elements":["Не отключается истощением.","Не блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"35 ( 29.75)","name":"Demonic Conversion","description":["Анимация применения: 0,3+0,7","Дальность применения: 700","Количество эйдолонов: 3 ( 10)","Атак для размножения: 6","Длительность: 35"],"hot_key":"W","legacy_key":"C"},{"spell":"Пропитывает местность темным резонансом, которая наносит врагам урон, зависящий от их максимального здоровья.","effects":["Способность Направленная на область","Действует на Врагов","Урон Магический"],"notes":["Midnight Pulse наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 9\/10\/11\/12 раз.","Может нанести до 42.75%\/55%\/68.75%\/84% от максимального запаса здоровья затронутых юнитов в виде урона (до учета сопротивления).","Не действует на древних крипов и варды.","Каждое применение Midnight Pulse действует отдельно от других.","При использовании разрушает деревья в радиусе 550 единиц в выбранной области."],"mana":"50\/80\/110\/140","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"50\/45\/40\/35 ( 42.5\/38.25\/34\/29.75)","name":"Midnight Pulse","description":["Анимация применения: 0,1+0","Дальность применения: 700","Радиус: 550","Урон от макс. здоровья в секунду: 4.75%\/5.5%\/6.25%\/7%","Длительность: 9\/10\/11\/12"],"hot_key":"E","legacy_key":"D"},{"spell":"Призывает воронку, засасывающую всех врагов, находящихся вблизи. При этом противники не могут двигаться, атаковать и применять заклинания.","effects":["Способность Направленная на область \/ Произносимая","Действует на Врагов","Урон Чистый"],"notes":["Полностью обезвреживает всех пойманных врагов и применяет к ним безмолвие.","Затягивает задетых юнитов против часовой стрелки к центру со скоростью в 30 единиц, в результате чего юниты могут преодолеть расстояние до 120 единиц. Чем ближе юниты к центру, тем сильнее они к нему притягиваются; уже находящиеся в центре практически не притягиваются, но продолжают движение по максимальной дистанции.","Может затягивать юнитов на непроходимую территорию и сквозь деревья без их разрушения.","Юнитов под действием Black Hole можно вытянуть из него с помощью определенных заклинаний. Force Staff, Hurricane Pike, Snowball и Geomagnetic Grip не могут переместить юнитов из Black Hole.","Притягивание и обезвреживание предоставлены в виде ауры, которая задерживается на 0.5 секунды или до отмены произнесения, в зависимости от того, что произойдет раньше.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 4 раз.","Может нанести до 200\/400\/600 ( + 19%\/22%\/25%\/28% от максимального здоровья) единиц урона (до учета сопротивления).","Не действует на варды или строения. Действует на курьеров.","Улучшение Aghanim's Scepter не применяет Midnight Pulse при использовании Black Hole, а просто добавляет урон к Black Hole: Дополнительный урон равен текущему уровню Midnight Pulse, поэтому если способность не изучена, то дополнительный урон наноситься Black Hole не будет. Дополнительный урон наносится отдельным источником с тем же интервалом, что и урон Black Hole; вместе с базовым уроном Black Hole урон наносится 8 раз. Дополнительный урон наносится в том же радиусе и с той же длительностью, что и Black Hole. Дополнительный урон складывается с любым предыдущим применением Midnight Pulse и наносит чистый урон. В отличии от заклинания Midnight Pulse, урон от улучшения поражает древних крипов. И, в отличии от отдельной способности, улучшение при использовании не разрушает деревья в области применения.","Дает наземный обзор в радиусе 800 единиц на 4 секунды в выбранной точке."],"mana":"300\/400\/500","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"200\/180\/160 ( 170\/153\/136)","name":"Black Hole","description":["Анимация применения: 0,3+0","Дальность применения: 275","Макс. длительность: 4","Радиус: 420","Урон в секунду: 50\/100\/150","Длительность задержки ауры: 0.5"],"hot_key":"R","legacy_key":"B"}],"bio":"О происхождении этой сущности неизвестно ровным счётом ничего. С древних времен остались лишь истории и легенды, и большинство из них даже не похожи на правду. По сути, это существо — великая загадка, и известно об нём лишь одно: оно — вселенская сила, поглотитель миров. Оно — дитя пустоты, иногда материальное, иногда — бесплотное. Чудище, живущее вне измерений. Одни говорят, что раньше оно было великим алхимиком, пытавшимся раскрыть секреты вселенной, но проклятым за свою заносчивость. Другие называют его непостижимым древним существом, самой бездной, неясным голосом первозданной тьмы, в которой зиждился первый свет. А самые старые легенды гласят, что это первая взорвавшаяся звезда, разумная чёрная дыра — безжалостное существо c туманными намерениями и разрушительной силой, низвергнувшееся на этот мир.","talentsTips":["Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.","Талант на сопротивление магии увеличивает сопротивление магии Enigma до 175%.","Золото с таланта является ненадёжным.","Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["Многие реплики Enigma являются отсылками к трудам Фридриха Ницше; реплика, \"I stare also into you.(с англ. Я тоже смотрю в тебя.)\" - это отсылка к произведению По ту сторону добра и зла, где говорится \"И если ты долго смотришь в бездну, то бездна тоже смотрит в тебя.\".","Многие реплики героя также ссылаются на понятия в космологии (большого взрыва, гравитационных полей, красные смещения и черные дыры) или физики элементарных частиц (интегралы по траекториям, универсальных констант) и так далее.","В DotA, имя Enigma было Darchrow. При переносе в Dota 2, его имя было вырезано, скорее всего чтобы подчеркнуть название героя.","Enigma, Io, Keeper of the Light и Chaos Knight вместе представляют четыре фундаментальные силы,где Enigma представляет собой силу гравитации. Это видно в репликах Enigma к этим героям. \"The Fundamentals unite.\"","Термин \"эйдолон\" пришел из древнегреческой литературы как фантомы,подобные человеку. Это души погибших людей.","Фраза Enigma при убийстве Faceless Void \"Even time may fail in face of gravity.\" - это отсылка к эффекту релятивистского замедления времени.","Реплики героя, в особенности перед смертью, дают нам представление о мировоззрении героя - Нигилизме. Нигилизм отрицает существование разума, сознания как такового. В каком-то смысле нигилисты признают \"финальную гармонию\" в смерти. Можно предположить, что в мире Dota этот герой наиболее желает своей кончины, и скорее всего она настигнет его гораздо быстрее, нежели чем остальных."],"talents":["+7 эйдолонов от Demonic Conversion:+5 срабатываний у Malefice","+60 к урону эйдолонов:+500 к здоровью","+150 золота в минуту:-15% перезарядки способностей","+15% к сопротивлению магии:+200 к дальности атаки эйдолонов"],"desc":"Enigma (от др.-греч. αἴνιγμα — загадка) — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность, Malefice, концентрирует энергию Enigma на цели, в результате чего та получает урон с течением времени и каждые 2 секунды оглушается. Вторая способность, Demonic Conversion, превращает крипа в три фрагмента самого Enigma. Эйдолоны находятся под контролем Enigma, а несколько успешных атак позволят им размножиться. Третья способность, Midnight Pulse, пропитывает местность темным резонансом, которая наносит врагам урон, зависящий от их максимального здоровья. Ультимативная способность, Black Hole, призывает воронку, засасывающую всех врагов, находящихся вблизи. При этом противники не могут двигаться, атаковать и применять заклинания. Улучшение с Aghanim's Scepter добавляет урон от Midnight Pulse к Black Hole."}