{"abilities":[{"spell":"Оборачивает численное преимущество врага против него самого, нанося урон противникам в выбранной области. Каждое задетое существо увеличивает урон от способности и дарует её владельцу дополнительную скорость передвижения. Иллюзии и призванные существа получают дополнительный урон в виде доли от их текущего здоровья.","effects":["Способность Направленная на область","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Процентный урон по призванным существам наносится до базового и дополнительного только юнитам, созданными способностями. К ним относятся иллюзии, но не крипы-герои и клоны.","Дополнительный урон считает крипов-героев и иллюзии за крипов.","Игнорирует курьеров, неуязвимых и спрятанных юнитов.","Начальная часть звука заклинания проигрывается во время анимации применения и слышна всем.","Бафф от нескольких применений Overwhelming Odds не складывается, но обновляется. Значение скорости обновляется при каждом применении, учитывая количество пораженных целей."],"mana":"100\/110\/120\/130","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"15","name":"Overwhelming Odds","description":["Анимация применения: 0,3+0","Дальность применения: 1000","Радиус: 330","Базовый урон: 40\/60\/80\/100","Урон за крипа: 14\/16\/18\/20","Урон за героя: 30\/60\/90\/120 ( 80\/110\/140\/170)","Текущее здоровье в урон по призваным существам: 25%","Бонус к скорости передвижения за крипа: 3%","Бонус к скорости передвижения за героя: 9%","Длительность ускорения: 7"],"hot_key":"Q","legacy_key":"W"},{"spell":"Снимает все отрицательные эффекты с союзной цели и ненадолго увеличивает её скорость атаки и восстановление здоровья.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Союзников"],"notes":["При использовании применяет сильное развеивание к цели.","Восстанавливает здоровье в виде регенерации, восстанавливая 3\/4\/5\/6 единиц здоровья с интервалом в 0,1 секунды.","Восстанавливает до 150\/200\/250\/300 единиц здоровья."],"mana":"110","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/15\/14\/13","name":"Press the Attack","description":["Анимация применения: 0,2+0,93","Дальность применения: 700","Радиус: 0 ( 350)","Регенерация здоровья: 30\/40\/50\/60","Дополнительная скорость атаки: 65\/90\/115\/140","Длительность: 5"],"hot_key":"W","legacy_key":"T"},{"spell":"Может мгновенно ответить на вражескую атаку контрударом с дополнительным вампиризмом.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Срабатывает только при начале атаке по Legion Commander независимо от расстояния. То есть отмененная или промахнувшаяся атака также может активировать способность.","Срабатывает при атаках от любых юнитов, независимо от принадлежноси к команде или типа юнита (включая варды и строения).","При срабатывании Legion Commander получает бафф, дающий 1000 к скорости атаки и вампиризм. Бафф длится 1 секунду или до попадания атаки - в зависимости от того, что произойдет раньше. Промахнувшиеся атаки не учитываются.","Если способность срабатывает при атаке героем кого-либо, то Тресдин совершит мгновенную атаку по текущей атакуемой цели. Эта мгновенная атака не мешает текущей и не использует анимацию. При мгновенной атаке могут сработать любые модификаторы атаки или эффекты, срабатывающие при атаке. То есть мгновенная атака также мгновенно использует 1000 к скорости атаки и вампиризм. Если Legion Commander ослеплена, то удар может промахнутся, кроме случая, когда у неё есть эффект True Strike. Также удар может промахнутся из-за уклонения.","Сочетается аддитивно с другими источниками вампиризма.","Вампиризм не действует при атаке вардов, строений и союзных юнитов.","Moment of Courage использует псевдослучайное распределение."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"2,3\/1,8\/1,3\/0,8","name":"Moment of Courage","description":["Шанс: 25% ( 35%)","Вампиризм: 55%\/65%\/75%\/85%"],"hot_key":"E","legacy_key":"E"},{"spell":"Вызывает выбранного вражеского героя на дуэль, в которой соперники вынуждены атаковать друг друга небольшой промежуток времени. Они не могут применять способности или использовать предметы. Если один из героев погибнет на дуэли, победитель получит постоянный бонус к урону.","effects":["Способность Направленная на юнита","Действует на Вражеских героев \/ Себя"],"notes":["Дуэль закончится, если участники разойдутся на расстояние в 2000 единиц.","Дает эффект True Sight на заклинателя и выбранную им цель для обеих команд, делая героев видимыми на время дуэли даже если кто-либо из них становится невидимым.","Применяет безмолвие и заглушение как к Legion Commander, так и к цели.","Проигравшим в дуэли считается тот герой, который умер, находясь под действием эффекта. Никто из героев не считается победителем, если они оба остались живы после завершения дуэли.","Участнику дуэли необязательно быть тем, кто совершит смертельный удар по другому для победы. Как союзники, так и противники могут вмешиваться в её ход.","Неважно, как именно умрут участники дуэли - от врагов, союзников или нейтральных крипов - победитель в большинстве случаев получает дополнительный урон. Победитель получает урон в случае добивания проигравшего. Если Legion Commander мгновенно умирает от Ice Blast, то участник дуэли дополнительный урон не получает. При этом смерть цели от Ice Blast урон Legion Commander дает. Цель Duel не получит дополнительный урон, если находилась под действием Astral Imprisonment. При этом Legion Commander под действием эффекта урон получит. Meepo и его клоны дают урон, если убили именно выбранного целью дуэли. Смерть остальных Meepo урона не дает.","У провокации Duel самый высокий приоритет среди других источников. У провокации по умолчанию приоритет выше, чем у страха, но при этом страх предотвращает атаки юнита во время провокации.","Использование Force Staff, Hurricane Pike или Geomagnetic Grip на дуэлянтов не даст никакого эффекта, потратит ману и запустит перезарядку.","Если юнит проиграл дуэль, но у него есть Aegis of the Immortal или на него действует Reincarnation (включая улучшение способности от Aghanim's Scepter), то победитель все равно получает дополнительный урон.","Если использовать Assimilate или улучшенную Aghanim's Scepter Supernova на цель дуэли или она попадет под действие Shadow Dance, то дуэль мгновенно завершится без определения победителя.","Если Legion Commander одержала победу, то к ней автоматически применяется Press the Attack текущего уровня без расхода маны и ухода на перезарядку.","Можно использовать на иллюзии, при этом победа не дает прибавку к урону. Но в случае победы иллюзии она получит дополнительный урон. То же самое действует и на Tempest Double - разница лишь в том, что копия использует полученный урон (всю оставшуюся длительность).","С улучшением от Aghanim's Scepter дуэлянты получают 100% уменьшение входящего урона. Также Legion Commander получает иммунитет к заклинаниям и к ней применяется базовое развеивание."],"mana":"75","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"50","name":"Duel","description":["Анимация применения: 0,3+0","Дальность применения: 150","Доп. урон за победу: 10\/18\/26 ( 50\/58\/66)","Длительность: 4\/4.75\/5.5 ( 6\/7\/8)"],"hot_key":"R","legacy_key":"D"}],"bio":"Они пришли без предупреждения. Внутри городских стен Стоунхолла вдруг раздался ужасный грохот, и из неизведанной тьмы явились бесчисленные твари, несущие пламя и разруху, убивающие и захватывающие матерей и сыновей во имя тёмных целей. Из бывшей когда-то могучей армии Стоунхолла лишь Бронзовый легион под руководством главнокомандующей Тресдин находился рядом и смог ответить на зов помощи. Въехав в город, они начали пробиваться через окровавленные переулки и пылающие рынки, прорубая свой путь к источнику внезапного вторжения — пространственному расколу на главной площади, на краю которого бушевал лидер Орды бездны. Охваченный губительным блеском, он взмахивал своим гигантским клинком, рассекая воинов напополам, и плоть его жертв тут же начинала разлагаться. Тресдин подняла свой окровавленный меч и взглянула на чудовище. Оно обернулось, обнажив в улыбке массу клыков. Забыв о битве, бушующей вокруг, они бросились навстречу друг другу. Отражая один выпад за другим, пара кружилась в смертельном танце, пока солдаты Бронзового легиона терпели сокрушительное поражение. Тресдин сделала выпад, а враг встретил её своим мечом. Сильнейший удар сбоку заставил Тресдин покачнуться, но она собрала свои силы для ответного взмаха. Клинок ударился о клинок, вошел по рукоять в кривую лапу, разорвав её надвое, разбрызгивая ужасающую смесь искр и крови. Подлые твари ошеломленно смотрели на битву, а Тресдин не прекращала бить, вонзая меч всё глубже, прямо к неистово бьющемуся сердцу чудовища. Раздался жуткий вой, донесшийся до самых облаков, и монстр разразился потоком крови и страдания. Адский портал содрогнулся. Сила, питающая его, исчезла так же внезапно, как и появилась. Оставшиеся враги пали под напором стали Стоунхолла. Победу не было смысла праздновать: город лежал в руинах, выживших осталось совсем немного. Пожар продолжал полыхать. Развернув свои знамена, Тресдин собрала уцелевших союзников. В гневе она дала клятву отомстить силам бездны, и обречён будет тот, кто встанет на её пути.","talentsTips":["Талант на силу в общем даёт Legion Commander: 160 здоровья, 0.8 регенерации здоровья, 0.64% сопротивления магии и 8 урона от атаки."],"trivia":["Переход из DotA в Dota 2 изменил пол Legion Commander, однако сам персонаж и названия способностей остались неизменными. Она будет отсылаться на свою старую модель в своих репликах при встрече других персонажей: При встрече героев, ездящих верхом, она будет выражать свою зависть или интерес к ним (\" I like your mount.\"). Ее модель в DotA была на лошади. Она также комментирует усы и бороды героев, когда убивает их или вызывает на дуэль (\" Nice mustache.\"). Ее модель персонажа в DotA имела усы. В DotA, ее персонаж часто выражал свою неприязнь к эльфам (или к любым другим нелюдям.). Это перенесено и в Dota 2, где Legion Commander продолжает выражать свое недоверие другим расам, а не одному какому-либо ее представителю. (rival hero taunts).","Ее реплика, \" You won't win the war by dying for your Ancient. You'll win by making the other dumb, unfed bastard die for theirs!\" Это отсылка к популярной цитате Джорджа С.Паттона : \"Цель войны не в том, чтобы умереть за свою страну, а в том, чтобы заставить других ублюдков умереть за свою!\"","Это единственный герой-женщина в Dota 2 с основной характеристикой Сила.","Данного героя озвучивала актриса Мерле Дэндридж, которая также озвучивала героиню Аликс Вэнс из серии игр Half-Life 2, также разработанной компанией Valve.","Иногда Legion Commander может сказать такую фразу \"War. War always changes.\", что является отсылкой к надписи из Fallout \"War. War never changes.\".","По концепт-артам, можно понять, что клинки от Blades of Voth Domosh должны были принадлежать её оригинальному дизайну. Однако, Valve по каким-то непонятным причинам отказались от этого."],"talents":["Press the Attack по области радиусом 350:+40 к урону за победу в Duel","+10% к шансу срабатывания Moment of Courage:+35 к скорости передвижения","+50 к урону за героя от Overwhelming Odds:+30 к скорости атаки","+25% к получаемому опыту:+8 к силе"],"desc":"Legion Commander — это герой с ближним типом атаки, основной характеристикой которого является сила. Ее первая способность, Overwhelming Odds, оборачивает количественное преимущество врагов против них самих, нанося им урон и даруя вам дополнительную скорость передвижения за каждое существо или героя. Наносит дополнительный урон иллюзиям и призванным существам в виде процента от их текущего здоровья. Вторая способность героя, Press the Attack, снимает все отрицательные эффекты с дружественной цели и добавляет скорость атаки и регенерацию здоровья на короткое время. Пассивная способность, Moment of Courage, будучи атакованной, дает герою пассивный шанс нанести ответный удар и восстановить часть здоровья. Ультимативная способность, Duel, вызывает героя на дуэль на небольшой промежуток времени. Legion Commander и герой не могут использовать способности или предметы. Если один из дуэлянтов умрет во время действия способности, победитель дуэли получит постоянный бонус к урону. При покупке Aghanim's Scepter в дуэли вы невосприимчивы ко всему урону, кроме урона, наносимого врагом-дуэлянтом, а так же получаете магический иммунитет на время дуэли."}