{
  "abilities": [
    {
      "notes": [
        "Inner Fire first applies the damage, then the debuffs",
        "The disarm is applied at the same time as the knockback. Enemies are not disabled during the knockback. They can still turn, cast abilities and use items. Channeling abilities are not interrupted. Can push units over impassable terrain. Destroys trees enemies come in contact with during the knockback. Does not knockback  Roshan, but does damage and disarm him",
        "The knockback is not a set distance. It pushes every enemy so they are 400 range away from Huskar's cast location. So the minimum knockback distance is -100",
        "The knockback duration is always 1, so the speed varies between -100 – 400, depending on the knockback distance",
        "SHARD NOTES Inner Fire loses its cast time and backswing, starts slowing enemies, and heals Huskar based on the damage dealt. Still interrupts Huskar's channeling abilities upon cast. Can be cast while stunned, cycloned, slept, taunted, hidden or during forced movement. It still cannot be cast while silenced, hexed or prevented from acting. Huskar can no longer ⇧ Shift-queue this ability upon acquiring  Aghanim's Shard. The disarm modifier is also responsible for the movement speed slow",
        "SHARD NOTES Always heals for the full amount per instance, regardless of how much damage the target(s) actually takes. Treats illusions and clones as heroes, and creep-heroes as creeps. Heals Huskar for the following values per hit hero: Level 1: 60\/120\/180\/240\/300 health. Level 2: 90\/180\/270\/360\/450 health. Level 3: 120\/240\/360\/480\/600 health. Level 4: 150\/300\/450\/600\/750 health.  Heals for 12\/18\/24\/30 health per creep hit"
      ],
      "item_behaviour": [],
      "description": "In a fiery rage, knocks all nearby enemies away from you to a fixed distance, dealing damage and disarming them.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+0.64 ( 0+0)",
        "Radius: 500",
        "Damage: 120\/180\/240\/300",
        "Max Knockback Distance: 400",
        "Knockback Duration: 1",
        "Debuff Duration: 1.75\/2.5\/3.25\/4 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 2.5\/3.25\/4\/4.75)",
        "Hero Damage as Heal:  50%",
        "Non-Hero Damage as Heal:  10%",
        "Move Speed Slow:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/66\/Huskar_Inner_Fire.mp3\/revision\/latest?cb=20191216014111",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "17\/15\/13\/11 (TagTalent 14\/12\/10\/8)",
      "aghanim": null,
      "name": "Inner Fire",
      "cooldown": "75\/100\/125\/150",
      "legacy_key": "V",
      "story": "Not even Huskar's own flesh can contain the unending expansion of his life force."
    },
    {
      "notes": [
        "The 3% current health as cost counts as setting health",
        "Burning Spear's cast range can only be further increased by attack range bonuses of the same range as the caster. However, it is not affected by cast range bonuses. Uses Huskar's 400 attack range when Autocast is active. Manually casting it uses the 450 cast range",
        "Places two debuffs on the target; with each attack, the first debuff gets refreshed, while the second debuff is stacked. A number on the first debuff's icon shows the number of stacks, visible to everyone. The stacks' durations are independent of each other. Successive casts do not refresh the duration of previous casts. The debuff modifier is only placed once and refreshed with successive casts. The debuff deals damage equal to 5\/10\/15\/20 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 9\/14\/19\/24) times the number of stacks, starting 1 second after the debuff is applied. The damage is decided by the ability's level upon placing the debuff modifier. Therefore, placing new Burning Spear stacks with a higher ability level on targets with old active stacks uses the old damage value",
        "Can deal up to 40\/80\/120\/160 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 72\/112\/152\/192) damage per Burning Spear instance (before reductions)",
        "Cannot be cast on buildings, wards, and allied units",
        "TALENT NOTES Both the damage per second increasing and the pure damage <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talents immediately update all current active Burning Spear stacks"
      ],
      "item_behaviour": [],
      "description": "Huskar sets his spears aflame, dealing damage over time with his regular attack. Multiple attacks will stack additional damage. Each attack drains some of Huskar's health.",
      "hot_key": "W",
      "params": [
        "Cast Range:  450",
        "Current Health as Cost: 3%",
        "Damage per Second: 5\/10\/15\/20 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 9\/14\/19\/24)",
        "Duration: 8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f9\/Huskar_Burning_Spear_1.mp3\/revision\/latest?cb=20191216014116",
      "effects": [
        "Ability: Active Attack Modifier",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Burning Spear",
      "cooldown": "0",
      "legacy_key": "R",
      "story": "The Sacred Warrior ignites his weaponry after marking it with his own blood - causing far greater pain than he himself feels."
    },
    {
      "notes": [
        "Huskar's model size increases the closer he gets to the max bonuses of Berserker's Blood, up to 35%",
        "Although not visible in the HUD due to it not showing enough decimals, each missing point of health grants bonuses",
        "The bonuses grow exponentially, ramping up faster the lower his health is. The benefits ramp up to approximately 50% at 40% health and 75% at 25% health",
        "Increases Huskar's total magic resistance to 32.5%\/36.25%\/40%\/43.75%. Despite the ability tooltip, the Berserker's Blood regeneration <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent does not increase the magic resistance bonus. Stacks multiplicatively with other sources of magic resistance",
        "No bonuses are applied at 100% health and the maximum bonus values are applied when strictly below 10% health",
        "The health percentage is checked periodically and the effects are adapted instantly"
      ],
      "item_behaviour": [],
      "description": "Huskar's injuries feed his power, giving increased attack speed, magic resistance and health regen based on missing health. Health regen is a percentage of your strength.",
      "hot_key": "E",
      "params": [
        "Max Attack Speed Bonus: 160\/210\/260\/310",
        "Max Magic Resistance Bonus: 10%\/15%\/20%\/25%",
        "Strength as Max Health Regen Bonus: 25%\/40%\/55%\/70% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 55%\/70%\/85%\/100%)",
        "Max Bonus Health Threshold: 10%"
      ],
      "audioUrl": "",
      "effects": [
        "Ability: Passive",
        "Affects: Self"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Berserker's Blood",
      "cooldown": null,
      "legacy_key": "B",
      "story": "After losing his birthright, Huskar gained a lethality in physical combat that is only heightened as his own blood is spilled."
    },
    {
      "notes": [
        "Huskar leaps at a speed of 1200. Launches an invisible projectile upon cast, and periodically drags Huskar along with it",
        "Applies a basic dispel on Huskar upon cast",
        "Huskar receives a hidden charge buff, which lasts for 5 seconds or until reaching the target, whichever is shorter. This modifier turns him spell immune, disarms him, forces him to face the target, and is responsible for the leap animation. Since the modifier has a set max duration, it can expire while leaping, continuing the rest of the leap without its effects. Huskar can use items and abilities during the leap. However, the following effects are able to stop the leap: When Huskar is disabled during the leap. Position change effects (e.g.  Blink) or affected by other forced movement sources. When the distance between the target and Huskar becomes greater than 2440 at any time during the leap. However, the projectile itself does not stop. If re-cast before the projectile reaches the target, Life Break's effects are still applied on Huskar and that target",
        "Can be cast on and debuff  Roshan, but does not damage him. Cannot be cast on  Couriers",
        "Deals magical damage to the caster and to the target based on their current health. The self-damage is not lethal, it cannot be used to deny oneself",
        "Life Break first applies the damage on the target, the damage on Huskar, the slow debuff, and then the taunt debuff",
        "When Life Break connects with its target, Huskar is given an attack order on the target, regardless of auto-attack settings",
        "SCEPTER NOTES Life Break now taunts the target upon cast, forcing them to attack Huskar. Does not silence the target, so active attack modifiers with Autocast on are still applied. Has the same taunt priority with  Berserker's Call,  Little Friends and  Winter's Curse, but lower than  Duel. Since the ability upgrade is determined if Huskar has  Aghanim's Scepter equipped, the taunt is applied if Huskar has the item equipped while being dragged by Life Break's projectile. SOULBIND Costs 53.76%\/61.56%\/68.64% of current health to cast. Huskar ends at the secondary target's location"
      ],
      "item_behaviour": [],
      "description": "Huskar draws upon his health to break an enemy's life, leaping at a target to shatter a percentage of that hero's current health, and slowing them. While leaping, Huskar is Spell Immune.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.3+0.5",
        "Cast Range:  550 ( 800)",
        "Current Health as Cost: 32%\/38%\/44%",
        "Target Current Health as Damage: 32%\/38%\/44% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 52%\/58%\/64%)",
        "Move Speed Slow: 60%",
        "Slow Duration: 3\/4\/5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 5\/6\/7)",
        "Max Spell Immunity Duration: 5",
        "Taunt Duration:  3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2d\/Huskar_Life_Break_1.mp3\/revision\/latest?cb=20191216014112",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemies \/ Self",
        "Damage: Magical"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Life Break",
      "cooldown": null,
      "legacy_key": "F",
      "story": "No matter the danger, Huskar thrusts himself into melees that only he can survive."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.3,
    "attrStrength": 20.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 1.5,
    "attrAgility": 10.0
  },
  "description": "Sacrifices his health to deal more damage. Rescued against his will from the Nothl Realm, the revived Huskar found supernatural strength in his own living essence. The Sacred Warrior marks his Spears with blood, setting both weapon and life-force alight before throwing them at his foes. By instantly sacrificing a portion of his health with Life Break, he lunges towards a single target, causing it to lose an even greater portion of its health. With every blow sustained igniting his Inner Fire, the Berserker's Blood redoubled the Sacred Warrior's speed and made him ever more resilient, facing down his opponent in a bloody fervor until he emerged triumphant.  Carry Durable Initiator ★☆☆",
  "trivia": [
    "Huskar's name might be derived from the Old Norse word \"Huskarl\", the title given to the highly-skilled bodyguards of important Norse lords and kings.",
    "His name might also be derived from Huáscar Inca, a leader of the Inca Empire in the 16th century. Huskar's lore also connects him to Dazzle, who is a Shadow Priest (fits in the Native American shaman role).",
    "Before 6.79, you could use a Ghost Scepter and then manually cast Burning Spear on enemies. You would take little magic damage since the magic resistance provided by Berserker's Blood reduced the incoming magic damage significantly, while also being immune to physical damage because of the ethereal state.",
    "In The Lab, a VR game by Valve, there are some Bendie soldiers who wield Huskar's throwing spears in the minigame Longshot, along with other Dota 2 weapons like Axe's war axe, Dragon Knight's sword and Stout Shield."
  ],
  "history": "Emerging from the throes of the sacred Nothl Realm, Huskar opened his eyes to see the prodigal shadow priest Dazzle working a deep incantation over him. Against the ancient rites of the Dezun Order, Huskar's spirit had been saved from eternity, but like all who encounter the Nothl he found himself irrevocably changed. No longer at the mercy of a mortal body, his very lifeblood became a source of incredible power; every drop spilled was returned tenfold with a fierce, burning energy. However this newfound gift infuriated Huskar, for in his rescue from the Nothl, Dazzle had denied him a place among the gods. He had been denied his own holy sacrifice. In time the elders of the order sought to expand their influence and Huskar, they agreed, would be a formidable tool in their campaign. Yet becoming a mere weapon for the order that denied him his birthright only upset him further. As the first embers of war appeared on the horizon, he fled his ancestral home to find new allies, all the while seeking a cause worthy of unleashing the power his total sacrifice could bring.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+20% Life Break Damage",
        "talent_left": "Burning Spears Pure Damage"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+30% Berserker's Blood Regen",
        "talent_left": "-4s Life Break Cooldown"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+4 Burning Spears DPS",
        "talent_left": "15% Lifesteal"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+0.75s Inner Fire Duration",
        "talent_left": "+2s Life Break Slow Duration"
      }
    ],
    "notes": [
      "The lifesteal talent stacks additively with other sources of lifesteal."
    ]
  }
}