{
  "abilities": [
    {
      "notes": [
        "Талант на ману увеличивает максимальный запас маны, и сохраняет текущий процент маны.",
        "Этот талант добавляет урон от атаки в прямой урон от атаки. Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на броню не дается иллюзиям.",
        "Талант на сопротивление магии мультипликативно сочетается с другими источниками сопротивления магии.",
        "Увеличивает сопротивление магии Earthshaker до 26,125%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "-1.5 сек. перезарядки Enchant Totem",
          "talentRight": "+40% к сопротивлению магии"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+320 к длине борозды от Fissure",
          "talentRight": "+40 к урону от эха у Echo Slam"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+7 к броне",
          "talentRight": "+25 к скорости передвижения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+200 к мане",
          "talentRight": "+20 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/5b\/Earthshaker_Fissure_1.mp3\/revision\/latest?cb=20191216013150",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Борозда появляется сразу после применения. У неё нет времени появления.",
        "Борозда создаётся из множества сегментов, которые расположены по прямой перед Earthshaker. Количество сегментов определяет общий диапазон борозды. Сегменты имеют радиус столкновения в 24 единицы и расстояние между друг другом в 8,25 единиц, первый сегмент появляется в 8,25 единицах перед Earthshaker. Фактическая длина борозды зависит от 56,25 (2 * 24 + 8,25) просчитанного радиуса и расстояния между сегментами. Стандартная борозда (или с улучшением от таланта ) состоит из 24 (TagTalent 30) сегментов, а блокировка пути бороздой составляет 1350 (TagTalent 1687.5) диапазона в длину. Каждое существо (кроме вардов и строений), которое находилось на месте появления борозды, будет отодвинуто в сторону.",
        "Сегменты имеют радиус столкновения в 24 единицы и расстояние между друг другом в 8,25 единиц, первый сегмент появляется в 8,25 единицах перед Earthshaker.",
        "Фактическая длина борозды зависит от 56,25 (2 * 24 + 8,25) просчитанного радиуса и расстояния между сегментами.",
        "Стандартная борозда (или с улучшением от таланта ) состоит из 24 (TagTalent 30) сегментов, а блокировка пути бороздой составляет 1350 (TagTalent 1687.5) диапазона в длину.",
        "Каждое существо (кроме вардов и строений), которое находилось на месте появления борозды, будет отодвинуто в сторону.",
        "Оглушение и урон применяются вокруг каждого сегмента. То есть общая область урона\/оглушения состоит из множества накладывающихся друг на друга кругов, а не из единой линии. Существо получает урон\/оглушение только один раз за применение, даже если попало в пересечение радиусов сегментов. Может поражать существ на расстоянии до 1575 (TagTalent 1912.5) единиц перед Earthshaker и в 216.75 позади героя.",
        "Существо получает урон\/оглушение только один раз за применение, даже если попало в пересечение радиусов сегментов.",
        "Может поражать существ на расстоянии до 1575 (TagTalent 1912.5) единиц перед Earthshaker и в 216.75 позади героя.",
        "Борозда сначала применяет оглушение, затем наносит урон.",
        "Летающие существа и существа, которые могут проходить где угодно (TagTalent Spectral Dagger, Charge of Darkness, Spin Web), не блокируются бороздой. Они по прежнему могут быть затронуты ударом. Они также будут отодвинуты в сторону, получат урон и будут оглушены.",
        "Они по прежнему могут быть затронуты ударом. Они также будут отодвинуты в сторону, получат урон и будут оглушены.",
        "Неконтролируемые игроками существа не обходят борозду, а пытаются идти дальше, будто препятствия нет. Существа застревают до тех пор, пока не сменят направление (например, с помощью агра) или, пока не исчезнет борозда.",
        "Существа застревают до тех пор, пока не сменят направление (например, с помощью агра) или, пока не исчезнет борозда.",
        "При улучшении с Aghanim's Shard Earthshaker получает беспрепятственное передвижение, когда передвигается по борозде в пределах 150 единиц от каждого сегмента. Это значит, что он сможет свободно двигаться по борозде, а также в течение 1 секунды после того, как уйдёт с неё. Aftershock применяется возле каждого сегмента борозды, но урон от нескольких сегментов не сочетается. Длительность оглушения от Aftershock составляет 0,3\/0,45\/0,6\/0,75 секунд.",
        "Это значит, что он сможет свободно двигаться по борозде, а также в течение 1 секунды после того, как уйдёт с неё.",
        "Aftershock применяется возле каждого сегмента борозды, но урон от нескольких сегментов не сочетается.",
        "Длительность оглушения от Aftershock составляет 0,3\/0,45\/0,6\/0,75 секунд."
      ],
      "mana": "110\/130\/150\/170",
      "hotKey": "Q",
      "cooldown": "21\/19\/17\/15 (TagTalent 19\/17\/15\/13)",
      "description": "Герой разбивает землю могучим тотемом, оставляя перед собой непроходимую каменную борозду, при этом оглушая стоящих на её пути врагов и нанося им урон.",
      "spellName": "Fissure",
      "params": [
        "Анимация применения: 0,69+0",
        "Дальность применения: 1400 (TagTalent 1720)",
        "Длина борозды: 1400 (TagTalent 1720)",
        "Радиус блокирования пути: 24",
        "Радиус урона\/оглушения: 225",
        "Урон: 110\/160\/210\/260",
        "Длительность оглушения: 1\/1,25\/1,5\/1,75",
        "Длительность борозды: 6,5\/7\/7,5\/8",
        "Радиус беспрепятственного прохождения: 150",
        "Продолжительность беспрепятственного прохождения: 1",
        "Длительность оглушения от Aftershock: 50%",
        "Уменьшает перезарядку на 2 секунды и позволяет ходить по созданной борозде. При применении любой способности вдоль борозды также срабатывает Aftershock с уменьшенной в 2 раза длительностью оглушения.",
        "Отталкивает существ с иммунитетом к заклинаниям и блокирует их прохождение сквозь борозду. Не оглушает и не наносит урон врагам с иммунитетом."
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Силою земли нишианский тотем раскалывает поверхность планеты до её ядра."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/fc\/Earthshaker_Enchant_Totem_1.mp3\/revision\/latest?cb=20191216013148",
      "effects": [
        "Способность Ненаправленная (TagAghanim Направленная на существо \/ Направленная на область)",
        "Действует на Себя"
      ],
      "notes": [
        "Дополнительный урон рассчитывается на основе базового урона и перка основного атрибута. Дополнительный урон не увеличивается.",
        "Усиление от Enchant Totem не даёт эффект True Strike и не расходуется после промахов.",
        "С Aghanim's Scepter способность становится направленной на область. Её можно направить только на землю или себя. Двойное нажатие на способность автоматически наводит её на себя. При применении на себя способность использует базовое время применения в 1,07 секунд без прыжка. При применении на землю способность использует время применения в 0 секунд (перед применением) и в 0,2 секунд (после применения). В это время Earthshaker обезврежен. Длительность прыжка всегда одинакова, поэтому скорость зависит от его расстояния. Высота прыжка всегда равна 950. Во время прыжка Earthshaker обезврежен, не имея возможности двигаться, поворачиваться, атаковать или использовать способности и предметы. Способность считается использованной в начале прыжка. Однако, Aftershock и усиление тотема применяются лишь при приземлении. Aftershock и усиление тотема применяются, даже если Earthshaker был обезврежен или убит в прыжке. Прыжок мгновенно прерывается, если на него срабатывают другие источники принудительного движения. Однако, в данном случае Aftershock или усиление тотема не применяются при приземлении. Применение способности полностью и незамедлительно отменяется только при принудительном движении вверх или телепортации героя другими способностями. Пока Earthshaker находится в воздухе, другие существа могут пройти под ним. Сетка с кругом, при направлении способности, показывает радиус Aftershock, даже если он не изучен.",
        "Двойное нажатие на способность автоматически наводит её на себя.",
        "При применении на себя способность использует базовое время применения в 1,07 секунд без прыжка.",
        "При применении на землю способность использует время применения в 0 секунд (перед применением) и в 0,2 секунд (после применения). В это время Earthshaker обезврежен.",
        "Длительность прыжка всегда одинакова, поэтому скорость зависит от его расстояния. Высота прыжка всегда равна 950.",
        "Во время прыжка Earthshaker обезврежен, не имея возможности двигаться, поворачиваться, атаковать или использовать способности и предметы.",
        "Способность считается использованной в начале прыжка. Однако, Aftershock и усиление тотема применяются лишь при приземлении.",
        "Aftershock и усиление тотема применяются, даже если Earthshaker был обезврежен или убит в прыжке.",
        "Прыжок мгновенно прерывается, если на него срабатывают другие источники принудительного движения.",
        "Однако, в данном случае Aftershock или усиление тотема не применяются при приземлении.",
        "Применение способности полностью и незамедлительно отменяется только при принудительном движении вверх или телепортации героя другими способностями.",
        "Пока Earthshaker находится в воздухе, другие существа могут пройти под ним.",
        "Сетка с кругом, при направлении способности, показывает радиус Aftershock, даже если он не изучен."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "W",
      "cooldown": "5 (TagTalent 3.5)",
      "description": "Заряжает тотем, увеличивая урон от следующей атаки и увеличивая её дальность на 75.",
      "spellName": "Enchant Totem",
      "params": [
        "Анимация применения: 0,69+0,38 (TagAghanim 0+0,2)",
        "Дополнительная дальность атаки: 75",
        "Дополнительный урон: 100%\/200%\/300%\/400%",
        "Длительность: 14",
        "Дальность прыжка со скипетром: 950",
        "Максимальная дальность прыжка: 950",
        "Дополнительный прорубающий урон: 40%",
        "Длительность прыжка: 1",
        "Позволяет прыгнуть в указанную точку в радиусе 950 и применить Enchant Totem в ней. Применение на себя работает как прежде, без прыжка. Атака с эффектом этой способности наносит 40% прорубающего урона.",
        "При оцепенении улучшенная способность применяется только на себя."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Неукротимая мощь Рейгора способна крушить горы."
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Не срабатывает от использования предметов.",
        "Сначала применяет оглушение, затем наносит урон.",
        "Сначала применяется урон и оглушение от Aftershock, затем эффекты использованной способности.",
        "Оглушение от Aftershock не сочетается с оглушением от Fissure. Однако, применяется то оглушение, которое дольше длится."
      ],
      "mana": null,
      "hotKey": "E",
      "cooldown": null,
      "description": "Герой сотрясает землю при каждом применении способности, нанося урон врагам поблизости и оглушая их.",
      "spellName": "Aftershock",
      "params": [
        "Радиус: 300",
        "Урон: 75\/100\/125\/150",
        "Длительность оглушения: 0,6\/0,9\/1,2\/1,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Земля содрогается от могучих шагов Рейгора."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b7\/Earthshaker_Echo_Slam_1.mp3\/revision\/latest?cb=20191216013146",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Использование Echo Slam прерывает произносимые способности Earthshaker.",
        "Каждое существо в радиусе способности распространяет волны эха на врагов в пределах радиуса ударной волны.",
        "Волны эха распространяются со скоростью 600.",
        "Радиус ударной волны сосредоточен вокруг каждого существа, получившего базовый урон. Волны эха распространяются на каждое существо в радиусе 600 за исключением того существа, которое распространило эхо. Волны эха могут распространяться в радиусе 1200 от Earthshaker. Если в радиусе находится лишь один враг, то урон он не получит, так как не сможет распространить волну самому себе.",
        "Волны эха распространяются на каждое существо в радиусе 600 за исключением того существа, которое распространило эхо.",
        "Волны эха могут распространяться в радиусе 1200 от Earthshaker.",
        "Если в радиусе находится лишь один враг, то урон он не получит, так как не сможет распространить волну самому себе.",
        "Поражённые способностью вражеские герои распространяют две волны эха к каждой цели в радиусе, а не только к героям.",
        "Варды и постройки не испускают и не получают урон от ударных волн.",
        "Действует на невидимых существ и существ в тумане войны.",
        "Общее количество урона на определённое количество героев без других существ вблизи (до учёта сопротивлений): 1 герой: 100\/140\/180 (TagTalent 100\/140\/180). 2 героя: 240\/320\/400 (TagTalent 320\/400\/480) за каждого героя, всего 480\/640\/800 (TagTalent 640\/800\/960) урона. 3 героя: 380\/500\/620 (TagTalent 540\/660\/780) за каждого героя, всего 1140\/1500\/1860 (TagTalent 1620\/1980\/2340) урона. 4 героя: 520\/680\/840 (TagTalent 760\/920\/1080) за каждого героя, всего 2080\/2720\/3360 (TagTalent 3040\/3680\/4320) урона. 5 героев: 660\/860\/1060 (TagTalent 980\/1180\/1380) за каждого героя, всего 3300\/4300\/5300 (TagTalent 4900\/5900\/6900) урона.",
        "1 герой: 100\/140\/180 (TagTalent 100\/140\/180).",
        "2 героя: 240\/320\/400 (TagTalent 320\/400\/480) за каждого героя, всего 480\/640\/800 (TagTalent 640\/800\/960) урона.",
        "3 героя: 380\/500\/620 (TagTalent 540\/660\/780) за каждого героя, всего 1140\/1500\/1860 (TagTalent 1620\/1980\/2340) урона.",
        "4 героя: 520\/680\/840 (TagTalent 760\/920\/1080) за каждого героя, всего 2080\/2720\/3360 (TagTalent 3040\/3680\/4320) урона.",
        "5 героев: 660\/860\/1060 (TagTalent 980\/1180\/1380) за каждого героя, всего 3300\/4300\/5300 (TagTalent 4900\/5900\/6900) урона.",
        "Эффект от модификатора задержки применяется на каждого врага, задетого Echo Slam, и используется для [Нужна информация]. Он действует 10,5 секунды.",
        "С надетым Planetfall, на врагах, убитых Echo Slam, отображается модификатор с пользовательским значком убийства."
      ],
      "mana": "145\/205\/265",
      "hotKey": "R",
      "cooldown": "150\/130\/110",
      "description": "По земле распространяются ударные волны, наносящие урон врагам. Каждое попадание по врагу создаёт волновое эхо, которое наносит урон ближайшим врагам. Попадание по герою создаёт двойное эхо.",
      "spellName": "Echo Slam",
      "params": [
        "Анимация применения: 0+1,33",
        "Радиус: 600",
        "Радиус ударной волны: 600",
        "Базовый урон: 100\/140\/180",
        "Урон от эха: 70\/90\/110 (TagTalent 110\/130\/150)",
        "Враги под действием иммунитета к заклинаниям всё равно вызывают ударные волны. Волны не наносят урон врагам с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Одним хлопком Рейгор разламывает тектонические плиты, скручивает горы и сминает недругов."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.7,
    "attrStrength": 22.0,
    "attrIntelligence": 16.0,
    "attrIntelligenceInc": 1.8,
    "attrAgilityInc": 1.4,
    "attrAgility": 12.0
  },
  "description": "Рейгор Каменное Копыто, Earthshaker — герой характеристики сила с ближним типом атаки. Его первая способность, Fissure, бьёт по земле, заставляя землю растрескаться, нанося урон врагам и оставляя непроходимую борозду на некоторое время. Второй способностью, Enchant Totem, герой заряжает тотем, увеличивая урон следующей атаки. Пассивная способность, Aftershock, при использовании героем любой способности сотрясает землю, нанося урон врагам поблизости и оглушая их. Ультимативной способностью, Echo Slam, герой бьёт тотемом по земле, от этого распространяются ударные волны, наносящие урон врагам. Каждое попадание по врагу создаёт волновое эхо, которое наносит урон ближайшим врагам. Способность Enchant Totem с Aghanim's Scepter позволяет прыгнуть в указанную точку в радиусе 900 и мгновенно применить в ней Enchant Totem. Применение на себя работает как раньше, без прыжка.",
  "history": "Словно голем или гаргулья, Рейгор когда-то лежал в земле, но сейчас свободно ступает по ней. В отличие от других, он создал себя своей волей и никому не служит. В беспокойных снах, заключённый глубоко в камне, он узнал, что жизнь проходит над ним. Любопытство пытало его. В сезон землетрясений пик горы Ишай стряхивал с себя рыхлые лавины, меняя течение рек и превращая пологие низины в бездонные разломы. Когда земля наконец перестала содрогаться, из оседающей пыли вышел наш герой, сбрасывая с себя тяжёлые валуны, словно невесомую простыню. Он сделался похожим на смертную тварь и назвался Рейгором Каменное Копыто. В его венах течёт кровь, а в лёгких проходит воздух, и это значит, что теперь он смертен. Но дух его всё ещё един с землёй; он несёт её силу в волшебном тотеме и никогда не расстаётся с ним. И в день, когда Рейгор обратится в пыль, земля с радостью примет своего блудного сына.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "-1.5 сек. перезарядки Enchant Totem",
      "talentRight": "+40% к сопротивлению магии"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+320 к длине борозды от Fissure",
      "talentRight": "+40 к урону от эха у Echo Slam"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+7 к броне",
      "talentRight": "+25 к скорости передвижения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+200 к мане",
      "talentRight": "+20 к урону"
    }
  ]
}