{"abilities":[{"effects":["Effect Delay: 5","Expire Max Health Restored per Second: 20%","Expire Max Mana Restored per Second: 20%","Expire Restore Duration: 5"],"notes":["Reincarnation cannot be prevented in any way. If a hero dies with it, it is used. If the wielder has a Reincarnation ability, the ability triggers first if it is usable.","Revives with full health and mana. Spells and items are not refreshed.","Provides 1800\/800 ground vision at the death location during its delay.","When Roshan reclaims the Aegis, the wielding hero is granted health and mana regeneration for a short duration. Can regenerate up to 100% of the hero's max health and mana over its full duration. The hero's max health and mana are checked periodically and the values adapted instantly.","Damage greater than 0 from any player (including allies, excluding self) or Roshan dispels the effect. Does not get dispelled by damage flagged as HP Removal."],"elements":["Ability Passive","Affects Self"],"description":"Brings you to life with full health and mana 5 seconds after you die, at the location where you died. Reincarnation must be used within 5 minutes or Aegis of the Immortal disappears. If it expires, it will heal you over 5 seconds (dispels on damage)."}],"cost":"N\/A","description":"The Immortal was said to own a shield that protected him from death itself.","trivia":["Aegis was previously an ordinary recipe item that contained three charges. After it was removed, it was then obtainable as a droppable item from Roshan.","In Greek mythology, an aegis that was described as \"ageless and immortal\" was presented to Zeus."],"attrs":["Passive Reincarnation","Disassemble? No","Alert allies? No"],"info":["The Aegis of the Immortal cannot be dropped or sold.","The Aegis disappears when one of the following happens, be it in a player's inventory, or still on the ground where Roshan dropped it: Roshan respawns 8–11 minutes after being slain. The Aegis wielder dies and reincarnates, using up the Aegis. Five minutes pass since the Aegis was picked up by a hero. This means it is impossible for multiple Aegis to exist in a match."]}