{"abilities":[{"effects":["Задержка эффекта: 5","Восстановление здоровья в секунду после исчезновения: 20%","Восстановление маны в секунду после исчезновения: 20%","Длительность восстановления после исчезновения: 5"],"notes":["Reincarnation не может быть прервана. Если герой умирает с предметом, она будет использована. Если носитель имеет способность Reincarnation, она сработает первее, если доступна.","Возрождает с полным запасом здоровья и маны. Заклинания и предметы не обновляются.","Дает 1800\/800 наземного обзора в месте смерти во время задержки.","После исчезновения, восстанавливает в виде регенерации, то есть восстанавливает 2% от максимального запаса здоровья и 2% от максимального запаса маны интервалами по 0.1 секунды.","Максимальный запас маны и здоровья проверяется периодически и значения мгновенно подстраиваются.","Так как способность лечит фиксированными процентами за фиксированную длительность, она не всегда может гарантировать полное восстановление.","Урон свыше 0, от любого игрока (включая союзников и себя) или Рошана, развеет эффект. Не развеивается уроном с тегом отнимающий здоровье.","Полностью сочетается с другими эффектами лечения и регенерации здоровья и маны."],"elements":["Способность Пассивная","Действует на Себя"],"name":"Reincarnation","description":"Возвращает вас к жизни с полными здоровьем и маной через 5 секунд после смерти на том же месте, где вы погибли. Должно быть использовано в течение 5 минут, иначе Aegis of the Immortal исчезнет. Если это случилось, то вы полностью излечитесь за 5 секунд (эффект спадает при получении урона)."}],"cost":"Н\/Д","description":"Легенды гласят, что Бессмертный владел щитом, защищавшим его от самой смерти.","attrs":["Пассивная Reincarnation","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Aegis of the Immortal нельзя выбросить или продать.","Aegis исчезает в двух случаях, будучи в инвентаре игрока или будучи на земле где выпал из Рошана: Рошан возрождается 8-11 минут после смерти. Носитель Aegis умирает и реинкарнирует, используя Aegis. Прошло 5 минут с момента поднятия героем Aegis.","Всё это значит что в одном матче не может быть несколько Aegis of the Immortal одновременно."]}