{
  "abilities": [
    {
      "notes": [
        "Although seeming like a  melee ability, the cast range can be further increased by other cast range bonuses. However, it is not affected by attack range bonuses",
        "Moves the target in an arc over Marci's head, with a height of 150. The throw always takes 0.5 seconds. The target is is fully disabled and prevented from acting during the throw, and always lands 250 range behind Marci, so the throw distance varies based on the target's location. Destroys trees within 275 radius around the target upon landing",
        "The damage and slow are applied upon landing and affect the target as well if it was an enemy. Thrown allies are not affected. Dispose first applies the movement speed slow, then the damage",
        "Slows and applies the area damage around  Roshan but does not move him",
        "The throw can only be interrupted by death or by other forced movement sources. When interrupted, the area damage and stun are applied prematurely at the unit's current location",
        "Cannot be cast on  Courier, wards, buildings, and invulnerable units. Cannot be cast on allies who have ☐ Disabled Help from Marci. Cannot be cast on units affected by  Chronosphere and  Black Hole"
      ],
      "item_behaviour": [],
      "description": "Marci grabs an allied or enemy target and throws it effortlessly behind her, damaging and slowing the unit if it's an enemy. Any enemy units in the landing area will also be damaged and slowed.",
      "hot_key": "Q",
      "params": [
        "Cast Animation: 0.2+1.04",
        "Cast Range:  175",
        "Landing Radius: 275",
        "Throw Distance: 250",
        "Landing Damage: 70\/120\/170\/220 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 130\/180\/230\/280)",
        "Throw Duration: 0.5",
        "Move Speed Slow: 20%\/30%\/40%\/50%",
        "Slow Duration: 3"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9a\/Marci_Dispose_1.mp3\/revision\/latest?cb=20211029201345",
      "effects": [
        "Ability: Target Unit",
        "Affects: Allies \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "16\/14\/12\/10",
      "aghanim": null,
      "name": "Dispose",
      "cooldown": "90",
      "legacy_key": "D",
      "story": "Marci excels at removing obstacles from Princess Mirana's path."
    },
    {
      "notes": [
        "Launches a projectile and periodically drags Marci along with it at a speed of 1700 upon cast. The visual effects around Marci come from that projectile. Can dash over impassable terrain and through trees",
        "If the distance between the target and Marci becomes greater than the sum of the current cast range and 700 at any time, the dash stops. With the cast range and the range limit buffer, Rebound has a maximum leap distance of 1150\/1250\/1350\/1450 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1275\/1375\/1475\/1575). However, the projectile itself does not stop. If re-cast before the projectile reaches the target, it may cause the leap of the new cast to trigger earlier",
        "Upon reaching the target, Marci leaps towards the targeted direction, facing towards that direction. The leap has a minimum and maximum duration of 0.1 ‒ 0.2 seconds, and a height of 200 ‒ 250 respectively",
        "During the dash and the leap, Marci or the targeted ally is fully disabled",
        "The targeted ally gains the movement speed buff once Marci reaches them",
        "Marci does not land at the center of the area of effect. Instead, she lands 64 range away from the center, towards where she leaped from. With the position offset and leap distance, the actual minimum and maximum distance is 386 – 386\/486\/586\/686 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 511\/611\/711\/811). This means the damage and slow radius are always located 64 range in front of Marci upon landing. Destroy trees within 275 radius upon landing",
        "The dash can only be interrupted by death or by other sources of forced movement. However, the leap can only be interrupted by other sources of forced movement. If interrupted at any point, the ability fully cancels",
        "Rebound first applies the landing damage, then the stun within the area",
        "Cannot be cast on  Courier, wards, buildings, and invulnerable units",
        "SHARD NOTES Autocast makes Marci throw the targeted ally, instead of leaping off of them herself. This means Marci stops at the targeted ally's location once reaching them, and the ally leaps towards the targeted direction instead. The leap works the same as it does on Marci. All Rebound's leap notes fully apply. The movement speed buff is applied at the same time while leaping. Therefore, with the leap duration, the buff can last up to 4.9 seconds. The thrown ally's facing direction equals the angle upon being thrown, regardless of the original facing direction. Cannot be cast on allies who have ☐ Disabled Help from Marci"
      ],
      "item_behaviour": [],
      "description": "Vector targeted. Marci bounds to the targeted unit, choosing a direction and distance she will spring away from it. Upon reaching the unit, Marci lunges to her final destination, damaging and stunning enemies in the area. The ally receives 25%\/30%\/35%\/40% bonus movement speed for 5s.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.1+0",
        "Cast Range:  450\/550\/650\/750 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 575\/675\/775\/875)",
        "Min Leap Distance: 450",
        "Max Leap Distance: 450\/550\/650\/750 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 575\/675\/775\/875)",
        "Landing Position Offset: 64",
        "Landing Radius: 275",
        "Landing Damage: 75\/150\/225\/300",
        "Stun Duration: 0.9\/1.3\/1.7\/2.1 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 1.6\/2\/2.4\/2.8)",
        "Ally Move Speed Bonus: 25%\/30%\/35%\/40%",
        "Ally Buff Duration: 5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4a\/Marci_Rebound_1.mp3\/revision\/latest?cb=20211029201355",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self (",
        "Damage: Magical"
      ],
      "mana": "24\/20\/16\/12 (TagTalent 21\/17\/13\/9)",
      "aghanim": null,
      "name": "Rebound",
      "cooldown": "70\/80\/90\/100",
      "legacy_key": "R",
      "story": "With a friendly or brazen boost, Marci can find her way into the midst of any fight."
    },
    {
      "notes": [
        "↓↓ Double-tapping automatically targets self. When cast on self, Sidekick searches for the nearest allied hero within a 700 radius around Marci. If no ally is found, Marci gets the buff normally. The 0.54 cast backswing is only used when targeting an ally. Self-casting has no cast backswing",
        "Can only be cast on, and only searches for allied heroes, including illusions, clones, and creep-heroes. Neither searches for invulnerable nor hidden heroes",
        "Grants regular flat bonus attack damage",
        "Stacks additively with other sources of lifesteal. Cannot lifesteal off of buildings or allied units. Can lifesteal off of wards that do not require a fixed amount of attacks to destroy",
        "TALENT NOTES The <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> talent also applies a basic dispel and grants spell immunity to Marci (and the ally). However, it does not apply spell immunity dispel. Therefore certain debuffs (e.g.  Pounce) only dispellable by spell immunity are not removed. Sidekick first applies the buff, the dispel, then the spell immunity buff"
      ],
      "item_behaviour": [],
      "description": "Marci's loyalty helps ensure survival, imbuing a chosen allied hero and herself with lifesteal and attack damage.",
      "hot_key": "E",
      "params": [
        "Cast Animation: 0+0.54",
        "Cast Range:  700",
        "Ally Search Radius:  700",
        "Attack Damage Bonus: 20\/35\/50\/65",
        "Lifesteal: 30%\/35%\/40%\/45% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 45%\/50%\/55%\/60%)",
        "Buff Duration: 7",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Spell Immunity Duration:  1.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a2\/Marci_Sidekick.mp3\/revision\/latest?cb=20211029201400",
      "effects": [
        "Ability: Target Unit",
        "Affects: Self \/ "
      ],
      "mana": "36\/28\/20\/12",
      "aghanim": null,
      "name": "Sidekick",
      "cooldown": "45\/40\/35\/30",
      "legacy_key": "C",
      "story": "Marci learned at a young age that the best asset in a scrap is a steady companion."
    },
    {
      "notes": [
        "While active, Unleash unlocks maximum attack speed and removes the 700 attack speed cap for Marci. The 700\/975\/1325 attack speed bonus is only gained while having the Flurry buff. An attack charge is consumed whenever an attack is executed (including attacks missed, from instant attack sources, and attacking allies). The number of remaining attacks is visible on the buff icon and on top of Marci. The buff and the visual effects of the ability are visible to everyone. Each attack first applies the 2-second movement speed and base attack speed slow debuff on the target, then deals its damage. This debuff is refreshed with each attack",
        "Upon finishing the Flurry combo, Unleash releases a pulse around the attack target on the last attack and removes the Flurry buff. This pulse deals 50\/100\/150 damage within its radius and silences enemies affected. The attack releasing the pulse first applies pulse debuff, then the pulse damage, then the silence, and then its own attack damage",
        "Upon starting a Flurry combo, all attacks must be executed within 1 second, otherwise, the combo fails and the Flurry buff is lost",
        "Upon losing the Flurry buff in any way, the cooldown debuff is applied. If the flurry combo was executed successfully, Marci's base attack rate is set to a fixed 2 seconds by this debuff afterward. This prevents her from performing attacks for 2 seconds after the last strike. The fixed attack rate resets as the next flurry starts, effectively preventing her from attacking for 1.5 seconds. If the Flurry cooldown was applied by failing the combo, her base attack rate will not be changed and she can attack normally",
        "Once the cooldown debuff expires, she gains the Flurry buff again, with a new set of 3\/4\/5 charges. This repeats indefinitely while Unleash is active, there is no limit to how many Flurry buffs can be gained",
        "SCEPTER NOTES While Unleash is active, Marci's other abilities also unleash pulses in the following conditions: Unleash only works with Marci's abilities. It does not unleash pulses on other abilities.  Dispose releases a pulse at the target's location upon landing.  Rebound releases a pulse at Marci's or around the thrown ally's location upon landing.  Sidekick releases a pulse at Marci's and the ally's location upon cast, releasing 2 pulses. The pulses released by Sidekick do not stack, an enemy within the radius of both pulses is only affected by one of them"
      ],
      "item_behaviour": [],
      "description": "Marci taps a hidden power, gaining Fury charges that allow her to deliver a rapid sequence of strikes. The last strike in every Fury combo creates a damaging pulse around the target that slows movement and attack speed for 50\/100\/150s. In between Fury combos, Marci is unable to attack for 1.5s. Marci gains 15% movement speed when Unleash is cast.",
      "hot_key": "R",
      "params": [
        "Cast Animation: 0.2+0.34",
        "Self Move Speed Bonus: 15% (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 30%)",
        "Attacks per Flurry: 3\/4\/5",
        "Flurry Attack Speed Bonus: 700\/975\/1325",
        "Flurry Time Window: 1",
        "Flurry Cooldown: 1.5",
        "Flurry Target Move Speed Slow: 30%",
        "Flurry Target Base Attack Speed Slow: 60\/80\/100",
        "Flurry Target Debuff Duration: 2",
        "Pulse Radius: 800",
        "Pulse Damage: 50\/100\/150",
        "Duration: 16",
        "<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> Pulse Silence Duration:  1.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e6\/Marci_Unleash_1.mp3\/revision\/latest?cb=20211029201402",
      "effects": [
        "Ability: No Target",
        "Affects: Self \/ Enemies",
        "Damage: Magical"
      ],
      "mana": "100\/80\/60 (TagTalent 80\/60\/40)",
      "aghanim": null,
      "name": "Unleash",
      "cooldown": "100\/125\/150",
      "legacy_key": "E",
      "story": "Though some have sought to understand its origins, Marci rebuffs all attempts to divine the source of her power."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.6,
    "attrStrength": 23.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 1.9,
    "attrAgilityInc": 2.4,
    "attrAgility": 20.0
  },
  "description": "Dashes around pummeling enemies with rapid attacks. Proving that undying loyalty yields unrivaled power, Marci always marches into battle ready to Unleash her fury in defense of her companions. Effortlessly Disposing enemies and lifting allies, throwing them around the battlefield, she happily Rebounds into any brawl, able to grant allies a deadly edge as their Sidekick and unleash a hidden power strong enough to make even gods reconsider the wisdom of a hostile path.  Support Carry Initiator Disabler Escape ★★☆",
  "trivia": [
    "Marci first debuted in the Dota: Dragon's Blood series and her appearance was designed in cooperation with Studio Mir, the producing studio behind the series.",
    "Dispose is named \"Grapple\" within the internal game files.",
    "Rebound is in some instances named \"Companion Run\" within the game files.",
    "Sidekick is in some instances named \"Guardian\" within the game files.",
    "The symbol featured on her Sidekick spell resembles the one emblazoned on the Invoker's Cape of the Dark Magic. It's unknown what this similarity signifies."
  ],
  "history": "Admired by many, Marci's origins are known to nameless few. She travels mostly in the company of the Princess Mirana, but the roots of their friendship are entwined in secrets neither would ever needlessly reveal. To allies, she serves as fierce and honest companion. To enemies, she acts as dauntless deterrence against harming any she deems friend. Though unwise opponents may consider her size unremarkable, Marci possesses an inner power that imbues her strikes with incredible might. She'll decimate those who think to test her, but those who earn her favor will have an unflappable confidant for life.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "+1.5s Unleash Pulse Silence",
        "talent_left": "1.5s Sidekick Spell Immunity"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+0.7s Rebound Stun Duration",
        "talent_left": "+15% Unleash Movement Speed"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+15% Sidekick Lifesteal",
        "talent_left": "-3s Rebound Cooldown"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+125 Rebound Cast\/Jump Range",
        "talent_left": "+60 Dispose Damage"
      }
    ]
  }
}