{
  "abilities": [
    {
      "notes": [
        "Применение Cold Feet помечает цель негативным эффектом и отмечает её текущее местоположение ледяной отметкой",
        "Пока цель находится в пределах 715 ( 915) единиц от отметки, она получает урон от дебаффа и спустя 4 секунды будет оглушена",
        "Если цель отойдет на расстояние, превышающее 715 ( 915) единиц, пока действует дебафф, заклинание перестанет работать и снимет дебафф и отметку\n То есть, при возвращении цели обратно к месту применения, она больше не получит оглушение или урон\n Также учитывает перемещение по вертикали, поэтому достаточное поднятие цели может спровоцировать срабатывание Cold Feet",
        "При использовании Cold Feet на врага, уже находящегося под этим эффектом, ничего не произойдёт",
        "Наносит урон с интервалом в 0,5 секунды, начиная сразу после применения, срабатывая 8 раза\n Может нанести до 120\/200\/280\/360 единиц урона (до учета сопротивления)",
        "Оглушение срабатывает спустя 1 секунду после последнего нанесенного урона",
        "Выбор  таланта на увеличение расстояния разрыва не обновит расстояние для уже действующих эффектов Cold Feet",
        "Выбор  таланта на применение по области делает способность применяемой по области с радиусом 450, её больше нельзя применить напрямую на существо\n Расстояние разрыва различно для всех противников\n Может действовать на невидимых врагов и противников в тумане войны"
      ],
      "item_behaviour": [],
      "description": "Накладывает на врага морозное заклятие, отчего тот получает периодический урон. Эффект развеется, если цель отойдёт достаточно далеко от точки применения способности. В противном случае через 4 секунды цель будет оглушена и приморозится к месту.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения: 700\/800\/900\/1000",
        "Расстояние разрыва: 715 ( 915)",
        "Урон в секунду: 30\/50\/70\/90 ( 70\/90\/110\/130)",
        "Длительность урона: 4",
        "Длительность оглушения: 2\/2,5\/3\/3,5",
        "Радиус:  450"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/85\/Cold_Feet.mp3\/revision\/latest?cb=20161105140817",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "12\/11\/10\/9",
      "aghanim": null,
      "name": "Cold Feet",
      "cooldown": "125",
      "legacy_key": "C",
      "story": "Присутствие Калдра обращает окружающих в морозную пустоту, угрожая запереть их в ледяной темнице навечно."
    },
    {
      "notes": [
        "Все эффекты работают как аура, (включая снижение скорости атаки инанесение урона)\n Аура задерживается на 0,5 секунды",
        "Способность снижает сопротивление магии героев до 13%\/11%\/9%\/6% ( 9%\/7%\/5%\/2%)\n Выбор  таланта на усиление замедления скорости передвижения и снижения сопротивления магии мгновенно обновляет значения для всех существующих Ice Vortex, включая те, которые уже применяют дебафф на противников",
        "Несколько применений Ice Vortex не складываются\n На существо будет действовать только один из них, даже если они все находятся в одном месте",
        "Дает наземный обзор в радиусе 200 единиц в области применения на всё время действия",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard Ice Vortex наносит урон с интервалом в 1 секунду, начиная спустя 1 секунду после наложения дебаффа, срабатывая до 14 раз\n Может нанести до 560 урона (до учета сопротивления) одному существу, если то будет стоять в области действия всё время\n Получение Aghanim's Shard мгновенно обновляет значения для всех существующих Ice Vortex, включая те, которые уже применяют дебафф на противников"
      ],
      "item_behaviour": [],
      "description": "Создает вихрь ледяной энергии, который замедляет скорость передвижения и понижает сопротивление магии в зоне действия в течение 0,5 секунд.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,01+0",
        "Дальность применения: 1500",
        "Радиус: 300",
        "Замедление скорости передвижения: 16%\/19%\/22%\/25% ( 21%\/24%\/27%\/30%)",
        "Снижение сопротивления магии: 16%\/19%\/22%\/25% ( 21%\/24%\/27%\/30%)",
        "Длительность задержки ауры: 0,5",
        "Длительность: 14",
        "Замедление скорости атаки:  16\/19\/22\/25 ( 21\/24\/27\/30)",
        "Урон в секунду:  40"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/3d\/Ice_Vortex.mp3\/revision\/latest?cb=20180510140423",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов",
        "Урон: "
      ],
      "mana": "7\/6\/5\/4 (TagTalent 5\/4\/3\/2)",
      "aghanim": null,
      "name": "Ice Vortex",
      "cooldown": "40\/50\/60\/70",
      "legacy_key": "E",
      "story": "Ледяные, жгучие ветра подчиняются прихоти Калдра, остужая поле битвы."
    },
    {
      "notes": [
        "Дальность применения равна дальности атаки заклинателя плюс дополнительная дальность\n Для Ancient Apparition она равна 735\/795\/855\/915 ( 935\/995\/1055\/1115)\n Дальность применения можно дальше повышать другими источниками увеличения дальности атаки\n Однако её нельзя повысить бонусами к дальности применения",
        "Урон от способности считается как отдельный источник урона и учитывается как урон от заклинаний\n То есть эта атака не учитывается любыми источниками, действующими на урон от атаки\n Также на атаку действуют усиление урона заклинаний и вампиризм заклинаний",
        "Дебаффы от нескольких применений складываются, создавая каждый раз отдельный дебафф",
        "Атака сначала применяет дебафф, затем наносит урон",
        "Chilling Touch не работает против союзных существ, построек и вардов"
      ],
      "item_behaviour": [],
      "description": "Увеличивает дальность следующей атаки. Она наносит значительный магический урон и замедляет жертву.",
      "hot_key": "E",
      "params": [
        "Дополнительная дальность атаки: 60\/120\/180\/240 ( 260\/320\/380\/440)",
        "Урон: 40\/80\/120\/160 ( 120\/160\/200\/240)",
        "Снижение скорости передвижения: 100%",
        "Длительность замедления: 0,7\/0,8\/0,9\/1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/53\/Ancient_Apparition_Chilling_Touch_1.mp3\/revision\/latest?cb=20191216010622",
      "effects": [
        "Способность: Активный модификатор атаки",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "12\/9\/6\/3 (TagTalent 0)",
      "aghanim": null,
      "name": "Chilling Touch",
      "cooldown": "30\/40\/50\/60 ( 15\/20\/25\/30)",
      "legacy_key": "G",
      "story": "Используя вечное знание, Калдр заколдовывает свои атаки холодом."
    },
    {
      "notes": [
        "После использования Ice Blast заменяется навыком  Release\n Выпущенный снаряд летит со скоростью 1500 единиц до применения Release, смерти Ancient Apparition или вылета за пределы карты\n Снаряд безвреден\n Он не наносит урон и не применяет дебафф Снаряд виден только для союзников\n Звуковые эффекты при запуске снаряда также слышат только союзникик",
        "Радиус взрыва начинается с 275 единиц и увеличивается на 50 с каждой секундой полета, пока не достигнет радиуса в 1000 единиц\n Требуется 15 секунд для достижения максимального радиуса взрыва, что равняется 22 500 пройденным единицам",
        "Снаряд дает летающий обзор в радиусе 500 единиц в момент полета",
        "Дебафф работает на героев, клонов и крипов-героев, но не на иллюзии",
        "Дебафф также работает на неуязвимых существ или существ с иммунитетом к магии, но не на спрятанных юнитов",
        "В отличии от дебаффа, урон от взрыва наносится всем вражеским юнитам, включая крипов, но не на постройки и варды",
        "Дебафф блокирует текущий уровень здоровья задетых юнитов, и не дает его восстанавливать каким-либо способом\n Исключениями являются Infest,  True Form,  Supernova, Ошибка Lua в Модуль:Ability_ID на строке 62: Не найдено данных Cargo для \"Soul Catcher\".,  Sunder,  Whirling Death,  Decay,  Time Lapse и  Essence Ring",
        "Существа под действием дебаффа умрут, если значение их здоровья упадет ниже порога процента для убийства\n Дебафф проверяет здоровья существа каждый раз после получения урона, исключая отнимающий здоровье урон\n Убийство приписывается тому источнику урона, чей урон привел показатель здоровья цели ниже требуемого порога\n Однако если урон был нанесен герою собой же, убийство будет засчитано Ancient Apparition\n Имеет приоритет ниже, чем у  Winter's Curse\n Имеет приоритет выше, чем у  Reaper's Scythe",
        "Минимальное здоровье предотвращает смерть от рассыпания на осколки, пока действуют дающие его эффекты\n Неуязвимые существа не могут разбиться",
        "Дебафф наносит урон с интервалом в 1 секунду, начиная спустя 1 секунду после применения дебаффа, действия 10\/11\/12 раз",
        "Дебафф может нанести до 125\/220\/384 единиц урона (до учета сопротивления)\n Вместе с взрывом Ice Blast может нанести до 375\/545\/784 единиц урона (до учета сопротивления)"
      ],
      "item_behaviour": [],
      "description": "Отправляет снаряд в направлении выбранной точки на карте. Повторное применение запускает ледяной шар, который взорвётся там, где находился снаряд на момент активации. Чем дальше он пролетит, тем больше будет радиус взрыва. У врагов, которые оказались в радиусе взрыва или на пути ледяного шара, застывает кровь, отчего они не могут лечиться и восстанавливать здоровье. Если здоровье поражённой цели упадёт ниже определённого уровня, она мгновенно разобьётся на осколки.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,01+1,07",
        "Дальность применения: Глобальная",
        "Радиус шара: 275",
        "Минимальный радиус взрыва: 275",
        "Максимальный радиус взрыва: 1000",
        "Урон от взрыва: 250\/325\/400",
        "Периодический урон: 12,5\/20\/32",
        "Процент здоровья для убийства: 12%\/13%\/14% ( 16%\/17%\/18%)",
        "Длительность: 10\/11\/12"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/ba\/Ancient_Apparition_Ice_Blast_1.mp3\/revision\/latest?cb=20191216010624",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов \/ ",
        "Урон: Магический"
      ],
      "mana": "60\/50\/40",
      "aghanim": null,
      "name": "Ice Blast",
      "cooldown": "175",
      "legacy_key": "T",
      "story": "Ледяные бури прошлых эпох вырываются из холодных конечностей Калдра, обрушиваясь на мир и превращая его жителей в памятники вечного могущества холода."
    },
    {
      "notes": [
        "Заменяет  Ice Blast после его применения",
        "При использовании останавливает полет снаряда и отмечает общую площадь поражения взрывом, который произойдет, когда ледяной шар достигнет своей позиции",
        "Также дает летающий обзор в радиусе 650 единиц в конечной позиции на 4 секунды",
        "Ледяной шар летит со скоростью 750 единиц или достигает конечной точки спустя 1,75 секунды после запуска, в зависимости от того, что произойдет быстрее",
        "Ледяной шар выпускается только при применении Release или при смерти Ancient Apparition, когда снаряд ещё в полете",
        "Шар не вылетит, если снаряд вылетит за пределы карты\n В таком случае способность будет потрачена в никуда",
        "Любое существо, попавшее в радиус полета шара в 275 единиц или под его взрыв, получит дебафф заморозки\n Дебафф начинает истекать только при выходе из зоны поражения Ice Blast\n Если противник войдёт в неё снова, то длительность дебаффа мгновенно обновится",
        "Ледяной шар полностью виден врагам\n Но, в отличии от снаряда, он не отображается на мини-карте",
        "Ледяной шар при полете дает летающий обзор в радиусе 500 единиц, который длится 3 секунды"
      ],
      "item_behaviour": [],
      "description": "Запускает стремительный ледяной шар в выбранное местоположение.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,01+1,1",
        "Минимальная скорость снаряда: 750",
        "Максимальное время полёта: 1,75"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/00\/Ancient_Apparition_Ice_Blast_2.mp3\/revision\/latest?cb=20191216010625",
      "effects": [
        "Способность: Ненаправленная"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Release",
      "cooldown": null,
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 1.9,
    "attrStrength": 20.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.4,
    "attrAgilityInc": 2.2,
    "attrAgility": 20.0
  },
  "description": "Запускает мощный ледяной шар в любую точку на карте Созданная холодом бесконечная пустота, Ancient Apparition, известный также как Калдр, лишь слабая тень истинного себя. Впрочем, его Chilling Touch достаточно, чтобы разбить наикрепчайшую броню. Пойманные в Ice Vortex герои под действием Cold Feet редко уходят далеко. Морозная сфера пролетает через небо, раскрываясь в назначенной области. Спустя секунды Ice Blast выстреливает в очерченную зону. Морозная вспышка - и врагам не остается выбора, как смирится с тем, что их хрупкие тела разлетятся на тысячи осколков...  Поддержка Контроль Быстрый урон ★★☆",
  "history": "Древний дух Калдр — образ, скрытый за пределами времени. Он возник из холодной, бесконечной пустоты, что предшествует вселенной и ждет её конца. Калдр был, Калдр есть, Калдр будет... И та его мощь, что мы видим в нашем мире, — лишь слабое увядшее эхо настоящего, вечного Калдра. Говорят, что чем древнее космос и чем ближе его конец, тем страшнее будет могущество Калдра, и иссякающая вечность принесёт духу молодость и силу. И тогда его ледяная хватка остановит всё сущее, и образ его начнёт источать ужасающее сияние; и он больше не будет всего лишь духом."
}