{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e8\/Helm_of_the_Dominator_Dominate.mp3\/revision\/latest?cb=20191227195434",
      "effects": [
        "Дальность применения: 700",
        "Максимальное число существ: 1",
        "Минимальное базовое здоровье: 1000",
        "Установленная скорость передвижения: 380",
        "Установленная награда за убийство: 100",
        "Бонус к базовому урону от атаки: 25",
        "Бонус к восстановлению здоровья: 12",
        "Бонус к восстановлению маны: 4",
        "Бонус к броне: 4"
      ],
      "notes": [
        "Нельзя подчинить древних крипов, крипов-героев, катапульты, лучников Некрономикона, воинов Некрономикона и Рошана.",
        "Применяет к цели базовое развеивание, которое убирает баффы и дебаффы.",
        "Подчинение нового крипа убьет уже ранее подчинённого.",
        "Число максимально доступных существ для подчинённых связано с игроком. Покупка нового Helm of the Dominator не позволит подчинить дополнительное существо. Владея обеими, Helm of the Dominator и Helm of the Overlord, Helm of the Overlord получает приоритет, позволяя починить 1 существ. Это также работает для скопированного Tempest Double Helm of the Dominator. Когда подчинённый крип изменяет фракцию (например, от влияния Holy Persuasion или Enchant), то он больше не учитывается в максимальное количество существ. При улучшении, продаже или разбитии предмета подчинённый крип умирает. Эта смерть никому не засчитывается, поэтому она никому не даст опыта.",
        "Владея обеими, Helm of the Dominator и Helm of the Overlord, Helm of the Overlord получает приоритет, позволяя починить 1 существ.",
        "Это также работает для скопированного Tempest Double Helm of the Dominator.",
        "Когда подчинённый крип изменяет фракцию (например, от влияния Holy Persuasion или Enchant), то он больше не учитывается в максимальное количество существ.",
        "При улучшении, продаже или разбитии предмета подчинённый крип умирает.",
        "Эта смерть никому не засчитывается, поэтому она никому не даст опыта.",
        "Приравнивает скорость передвижения существа к 380, независимо от его стандартной скорости передвижения.",
        "Устанавливает награду в золоте за существо в 100 , независимо от стандартной награды за него. Базовая награда не дается за убийство существа, только установленная. Получаемый за убийство опыт не меняется.",
        "Базовая награда не дается за убийство существа, только установленная. Получаемый за убийство опыт не меняется.",
        "Если максимальное здоровье существа ниже порога минимального здоровья, то его максимальное и текущее здоровье увеличивается на эту разницу. Это увеличение не считается за лечение. Здоровье существа приравнивается к значению, устанавливаемому способностью.",
        "Это увеличение не считается за лечение. Здоровье существа приравнивается к значению, устанавливаемому способностью.",
        "Добавляет урон от атаки в качестве базового урона, то есть он также попадает под действие всех эффектов, увеличивающих или уменьшающих урон на процентное значение.",
        "Не восстанавливает ману крипа.",
        "Не делит перезарядку с Helm of the Overlord."
      ],
      "mana": "0",
      "abilityName": "Dominate",
      "cooldown": "45",
      "description": "Даёт контроль над нейтральным крипом, не являющимся древним, и увеличивает его скорость передвижения до 380, а запас здоровья — до 1000. Также даёт крипу +25 к базовому урону, +4 к броне, +12 к восстановлению здоровья и +4 к восстановлению маны. Если максимальное здоровье существа больше 1000, оно не изменится. За убийство существа даётся 100 золота.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "120 здоровья и 0,6 восстановления здоровья.",
    "72 маны и 0,3 восстановления маны.",
    "6 скорости атаки и 1 основной брони.",
    "6 основного урона от атаки всем \/ \/ героям."
  ],
  "cost": "2400",
  "lore": null,
  "consistFrom": [
    "Helm of Iron Will",
    "Crown",
    "Recipe"
  ],
  "name": "Helm of the Dominator",
  "description": "Могущественный шлем мертвого некроманта.",
  "trivia": null,
  "upgradeIn": [
    "Helm of the Overlord"
  ],
  "tips": null
}