{
  "abilities": [
    {
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+40% к урону от Stroke of Fate",
          "talentRight": "+150 к радиусу Ink Swell"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+3 к атакам героя для убийства фантома",
          "talentRight": "+800 к дальности Stroke of Fate"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+16% к скорости передвижения от Ink Swell",
          "talentRight": "+15% к урону от заклинаний"
        },
        {
          "talentLvl": "10",
          "talentLeft": "−5 сек. перезарядки Ink Swell",
          "talentRight": "+50 к урону в секунду от Phantom's Embrace"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/20\/Grimstroke_Stroke_of_Fate_1.mp3\/revision\/latest?cb=20191216013954",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Чернила движутся со скоростью в 2400, достигая максимальной дистанции за 0,58 секунды.",
        "Может поражать юнитов на расстоянии до 1560 (TagTalent 2360) единиц (складывается из дистанции прохождения и радиуса).",
        "Чернила появляются в 120 единицах слева от Grimstroke и движутся напрямую к выбранной точке. То есть дистанция прохождения чернил зависит не от направления, куда смотрит заклинатель, а от угла между двумя точками.",
        "То есть дистанция прохождения чернил зависит не от направления, куда смотрит заклинатель, а от угла между двумя точками.",
        "У увеличения урона нет ограничения и оно учитывает любого пораженного чернилами юнита.",
        "Проигрывает начальный звук и частицы при начале применения, которые слышны и видны всем.",
        "Снаряд дает наземный обзор в момент движения в пределах радиуса. Дает наземный обзор в радиусе 160 единиц на месте каждого задетого юнита и в конечной точке снаряда, который длится 2 секунды.",
        "Дает наземный обзор в радиусе 160 единиц на месте каждого задетого юнита и в конечной точке снаряда, который длится 2 секунды."
      ],
      "mana": "100\/110\/120\/130",
      "hotKey": "Q",
      "cooldown": "11\/9\/7\/5",
      "description": "Взмахом кисти герой проводит линию из чернил, нанося урон врагам на её пути и замедляя их. Урон увеличивается с каждым задетым врагом.",
      "spellName": "Stroke of Fate",
      "params": [
        "Анимация применения: 0,8+0,53",
        "Дальность применения: 1400 (TagTalent 2200)",
        "Дистанция волны: 1400 (TagTalent 2200)",
        "Начальный радиус: 120",
        "Конечный радиус: 160",
        "Базовый урон: 120\/180\/240\/300 (TagTalent 168\/252\/336\/420)",
        "Увеличение урона за удар: 16\/24\/32\/40 (TagTalent 22,4\/33,6\/44,8\/56)",
        "Замедление скорости передвижения: 50%\/60%\/70%\/80%",
        "Длительность замедления: 1,5"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Губительная сила чернил, которую вознесённый вычерпал из своего павшего народа, поглотит любого врага на своём пути."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Phantom%27s_Embrace.mp3\/revision\/latest?cb=20180825230302",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Фантом летит со скоростью 750.",
        "С момента запуска фантома можно атаковать, поэтому он может умереть, не долетев до цели. Если цель получила иммунитет к заклинаниям или стала невидима, то летящий фантом мгновенно умирает. Фантом застывает, если попадает в Chronosphere. Он продолжит преследовать цель, как только покинет Chronosphere.",
        "Если цель получила иммунитет к заклинаниям или стала невидима, то летящий фантом мгновенно умирает.",
        "Фантом застывает, если попадает в Chronosphere. Он продолжит преследовать цель, как только покинет Chronosphere.",
        "Фантом цепляется за цель как только оказывается в 130 единицах от неё. Зацепившись, он всегда остается в 130 от цели. Фантом мгновенно умирает, если цель стала невидимой, неуязвимой, получила иммунитет к заклинаниям или спряталась. Если цель умерла до завершения заклинания, то фантом возвращается к заклинателю. Следовательно, для возврата фантома дебафф должен завершится и его не должны развеять. При этом, если фантом оказался в Chronosphere, то мгновенно начнет возвращаться, если его эффект завершился.",
        "Фантом мгновенно умирает, если цель стала невидимой, неуязвимой, получила иммунитет к заклинаниям или спряталась.",
        "Если цель умерла до завершения заклинания, то фантом возвращается к заклинателю.",
        "Следовательно, для возврата фантома дебафф должен завершится и его не должны развеять.",
        "При этом, если фантом оказался в Chronosphere, то мгновенно начнет возвращаться, если его эффект завершился.",
        "При прикреплении фантом обезмолвивает цель и наносит ей урон. Наносит урон с интервалом в 0,5 секунды сразу после достижения цели, срабатывая 10 раз. Может нанести до 130 единиц урона каждому врагу, включая финальный урон при возврате (до учета сопротивлений).",
        "Наносит урон с интервалом в 0,5 секунды сразу после достижения цели, срабатывая 10 раз.",
        "Может нанести до 130 единиц урона каждому врагу, включая финальный урон при возврате (до учета сопротивлений).",
        "Фантом дает общий обзор на цель как при полете к ней, так и зацепившись за неё. Обзор мгновенно прекращается как только юнит отцепится от цели. У самого фантома также есть небольшая дальность обзора, действующая как при полете, так и при зацеплении. При этом данный обзор не действует при возвращении фантома к заклинателю.",
        "У самого фантома также есть небольшая дальность обзора, действующая как при полете, так и при зацеплении.",
        "При этом данный обзор не действует при возвращении фантома к заклинателю.",
        "С фантомом нельзя взаимодействовать при возврате к заклинателю.",
        "Несколько применений складываются, несмотря на то, что применения делят один дебафф. Периодический урон увеличивается за каждый заряд. Применения используют один интервал нанесения урона и наносят общий урон за интервал.",
        "Периодический урон увеличивается за каждый заряд. Применения используют один интервал нанесения урона и наносят общий урон за интервал."
      ],
      "mana": "110\/120\/130\/140",
      "hotKey": "W",
      "cooldown": "32\/28\/24\/20",
      "description": "Призывает фантома, который летит к выбранной цели и сжимает её в своих объятьях, нанося периодический урон и запрещая применять способности. Если фантом продержится на жертве до конца действия, он нанесёт ей большой урон от разрыва и вернётся к владельцу, а время перезарядки способности сбросится.",
      "spellName": "Phantom's Embrace",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: 900 (TagTalent 916)",
        "Атак героев для убийства: 2\/2\/3\/3 (TagTalent 5\/5\/6\/6)",
        "Атак не-героев для убийства: 6\/6\/9\/9 (TagTalent 15\/15\/18\/18)",
        "Урон в секунду: 10\/20\/30\/40",
        "Урон при возврате: 80\/170\/260\/350",
        "Длительность: 5",
        "Получение иммунитета к заклинаниям мгновенно убивает как уже зацепившихся призраков, так и всех летящих к цели.",
        "Блокируется при применении, но не при попадании.",
        "Цели не могут избежать заклинание. Сам Grimstroke может избежать снаряда, в итоге не сбрасывая перезарядку."
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": "Страж нисколько не опечален смертью своего народа. Лишь память о Яови, что была ему ближе всех, вызывает некий отголосок тоски."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9e\/Ink_Swell.mp3\/revision\/latest?cb=20180825230250",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Наносит 5\/7\/9\/11 единиц урона с интервалом в 0,2 секунды сразу после применения дебаффа, срабатывая 15 раз.",
        "Щупальца могут нанести до 75\/105\/135\/165 единиц урона одному юниту до учета сопротивлений.",
        "Урон и оглушение при потере баффа основано на том, сколько раз был нанесен урон одному вражескому герою с помощью щупалец. То есть, для максимального урона и оглушения как минимум один вражеский герой должен получать урон всю длительность способности. Учитывает только непосредственно героев, исключая иллюзии и крипов-героев, но учитывая клонов. Значение фактически нанесенного урона не имеет такого значения, как количество срабатываний. Длительность оглушения увеличивается на 0,07\/0,13\/0,18\/0,23, а урон — на 10,67\/16\/21,33\/26,67 за каждое срабатывание, достигая максимального значения после 15 срабатываний.",
        "То есть, для максимального урона и оглушения как минимум один вражеский герой должен получать урон всю длительность способности.",
        "Учитывает только непосредственно героев, исключая иллюзии и крипов-героев, но учитывая клонов.",
        "Значение фактически нанесенного урона не имеет такого значения, как количество срабатываний.",
        "Длительность оглушения увеличивается на 0,07\/0,13\/0,18\/0,23, а урон — на 10,67\/16\/21,33\/26,67 за каждое срабатывание, достигая максимального значения после 15 срабатываний.",
        "Если дебафф преждевременно теряется, то он применит урон по области и оглушение, основываясь на количестве уже сработавших на этот момент интервалов.",
        "Повторное применение Ink Swell на одну и ту же цель обновит длительность без сбрасывания счетчика урона.",
        "При использовании на себя время после применения увеличено и использует другую анимация."
      ],
      "mana": "120\/130\/140\/150",
      "hotKey": "E",
      "cooldown": "30\/25\/20\/15",
      "description": "Герой покрывает себя или союзника чернилами, которые повышают скорость передвижения и наносят урон противникам вокруг. Через 3 сек. чернила расплёскиваются, оглушая противников и нанося им урон. Длительность оглушения и урон от всплеска зависят от того, как долго чернила действовали на героев.",
      "spellName": "Ink Swell",
      "params": [
        "Анимация применения: 0,15+0,73\/0,86",
        "Дальность применения: 400\/525\/650\/775 (TagTalent 416\/541\/666\/791)",
        "Радиус: 400 (TagTalent 550)",
        "Доп. скорость передвижения: 10%\/12%\/14%\/16%",
        "Урон в секунду: 25\/35\/45\/55",
        "Макс. урон при завершении: 160\/240\/320\/400",
        "Макс. длительность оглушения: 1,1\/1,9\/2,7\/3,5",
        "Длительность: 3",
        "Можно применять на союзников с иммунитетом к заклинаниям. Не действует на врагов с иммунитетом к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Теперь, когда поглощение чернилами больше не угрожает вознесённому, их мощь всегда у него под рукой."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/cb\/Soulbind.mp3\/revision\/latest?cb=20180825230310",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Перекрестие указателя должно выделять вражеского юнита.",
        "Связывает основную цель только с героями (исключая иллюзии, но включая клонов) или крипами-героями. Основная цель может быть иллюзией.",
        "Не связывается с ближайшими невидимыми или неуязвимыми героями.",
        "Чем сильнее цепь растягивается, тем медленнее затронутые герои движутся друг от друга, пока полностью не остановятся. Способность напрямую влияет на их скорость передвижения. Цепь считается полностью растянутой на расстоянии 600 единиц, но может растягиваться до 700 единиц пока не разорвется. Растянуть цепь на расстояние более 600 единиц можно исключительно принудительным движением. Следующие заклинания не могут разорвать цепь: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, Force Staff и Hurricane Pike. Force Staff может разорвать цепь, если оба героя смотрят в разные друг от друга стороны. Все прочие источники принудительного движения, включая заклинания Primal Roar и Blinding Light, могут разорвать связь.",
        "Цепь считается полностью растянутой на расстоянии 600 единиц, но может растягиваться до 700 единиц пока не разорвется.",
        "Растянуть цепь на расстояние более 600 единиц можно исключительно принудительным движением.",
        "Следующие заклинания не могут разорвать цепь: Skewer, Leap, Pounce, Tree Dance, Primal Spring, Toggle Movement, Force Staff и Hurricane Pike.",
        "Force Staff может разорвать цепь, если оба героя смотрят в разные друг от друга стороны.",
        "Все прочие источники принудительного движения, включая заклинания Primal Roar и Blinding Light, могут разорвать связь.",
        "Связывает цель и её союзника друг с другом, предотвращая применение некоторых способностей для перемещения.",
        "Если враги смогли разорвать цепь, то дебафф все равно остается активным на основной цели и мгновенно свяжет цель с ближайшим вражеским героем в радиусе.",
        "В связанном состоянии любое направленное на одиночную цель заклинание применится на второго связанного героя, следуя тем же правилам, что и механика отражения заклинаний, но с некоторыми исключениями. Заклинания, которые не работают: Omnislash, Static Link, Charge of Darkness, Nether Strike, Focus Fire, Shuriken Toss, Paralyzing Cask, Soul Assumption. Источником применения заклинания на связанного героя является заклинатель, поэтому его атрибуты и предметы также применяются к заклинанию.",
        "Заклинания, которые не работают: Omnislash, Static Link, Charge of Darkness, Nether Strike, Focus Fire, Shuriken Toss, Paralyzing Cask, Soul Assumption.",
        "Источником применения заклинания на связанного героя является заклинатель, поэтому его атрибуты и предметы также применяются к заклинанию.",
        "Дает общий обзор на обе цели, очерчивая их силуэты в невидимом состоянии.",
        "На героя может действовать только одна связка. Повторное применение Soulbind на ту же цель или на вторичную обновит длительность на двух героях. Применение Soulbind на третьего героя в пределах уже связанных двух не свяжет его с ними до завершения действия первого применения.",
        "Применение Soulbind на третьего героя в пределах уже связанных двух не свяжет его с ними до завершения действия первого применения.",
        "Некоторые способности дают интересные эффекты при активном Soulbind: Duel действует как обычно, но в ней участвуют оба героя. Если один из героев умирает, то дуэль заканчивается. Даваемый урон не удваивается. При этом, если Legion Commander умирает, то урон дается обоим врагам. Winter's Curse помещает двух юнитов под эффект, но враги атакуют ближайшего союзника. Кроме того, они не смогут нанести урон своему союзнику.",
        "Duel действует как обычно, но в ней участвуют оба героя. Если один из героев умирает, то дуэль заканчивается. Даваемый урон не удваивается. При этом, если Legion Commander умирает, то урон дается обоим врагам.",
        "Winter's Curse помещает двух юнитов под эффект, но враги атакуют ближайшего союзника. Кроме того, они не смогут нанести урон своему союзнику."
      ],
      "mana": "150\/200\/250",
      "hotKey": "R",
      "cooldown": "100\/75\/50",
      "description": "Связывает выбранного вражеского героя с его ближайшим союзником, не позволяя им разойтись слишком далеко друг от друга. Если на одну из жертв применить способность, направленную на существо, она автоматически применится и на вторую. Если связь разорвётся раньше времени, первоначальная цель способности привяжется к ближайшему союзному герою в радиусе действия.",
      "spellName": "Soulbind",
      "params": [
        "Анимация применения: 0,15+0,5",
        "Дальность применения: 700\/800\/900",
        "Радиус захвата: 600",
        "Дистанция разрыва: 700",
        "Длительность: 6\/7\/8",
        "Даёт способность Dark Portrait.",
        "Блокируется только основной целью."
      ],
      "itemBehaviour": [],
      "legacyKey": "B",
      "story": "Вознесённые — избранные сыны Ашкавора, чьи души связаны с душами тех, кого они должны защищать, и потому наделены невероятной мощью. Уничтожив свой народ, с годами последний страж узнал, каким нечестивым может стать ритуал связи…"
    },
    {
      "audioUrl": null,
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев"
      ],
      "notes": [
        "Требует Aghanim's Scepter.",
        "Созданные иллюзии визуально отличимы от реального героя для союзников и врагов.",
        "Иллюзия появляется на расстоянии в 108 единиц от цели. Она может появиться севернее, восточнее, южнее или западнее от цели.",
        "Можно применять на крипов-героев, но так как иллюзии нельзя создать из юнитов не-героев, ничего не случится, но расходуется мана и способность уйдёт на перезарядку."
      ],
      "mana": "200",
      "hotKey": "D",
      "cooldown": "35",
      "description": "Создаёт чернильную иллюзию вражеского героя. Она существует 25 секунд, имеет невосприимчивость к магии и увеличенную на 30% скорость передвижения. Иллюзия получает 350% урона и наносит 150% урона.",
      "spellName": "Dark Portrait",
      "params": [
        "Анимация применения: 0+0,54",
        "Дальность применения: 1200",
        "Количество иллюзий: 1",
        "Урон иллюзии: 150%",
        "Урон по иллюзии: 350%",
        "Доп. скорости передвижения иллюзии: 30%",
        "Длительность иллюзии: 25"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.4,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.8,
    "attrAgilityInc": 1.9,
    "attrAgility": 18.0
  },
  "description": "Grimstroke — это герой с дальним типом атаки и основным атрибутом интеллект, в основном специализирующийся как герой поддержки. Он имеет четыре способности, каждая из которых является активной. Первой способностью, Stroke of Fate, Grimstroke высвобождает линию чернил из своей кисти. Чернила наносят урон, который увеличивается с каждым задетым существом, и замедляют врагов. При помощи второй способности, Phantom's Embrace, герой призывает фантома, который по достижении врага начинает наносить периодический урон и накладывает безмолвие. Если фантома не уничтожить, то по окончании эффекта он нанесёт урон и вернётся к Grimstroke, а время перезарядки способности сбросится. Третьей способностью, Ink Swell, Grimstroke окружает союзника чернилами, отчего он начинает быстрее бежать и наносить периодический урон врагам вокруг. Через 3 секунды они оглушатся и получат урон (оглушение с уроном будут зависеть от времени, которое враги провели в радиусе способности). Ультимейт героя, Soulbind, свяжет вражеского героя с его ближайшим союзником. Они не смогут разойтись друг от друга на слишком большое расстояние. Направленная способность, применённая на одного из связанных героев, автоматически направится и на второго. Если связь разорвать раньше, чем закончится действие способности, то первоначальный герой свяжется с другим ближайшим к нему союзником в радиусе её действия.",
  "history": "Жители Ашкавора столпились вокруг храмовой площади, желая узреть вознесение своего нового стража... Желая быть рядом с ним, когда их и его души свяжутся воедино. Но когда кисть последний раз коснулась рунного камня и связь с новым вознесённым зародилась, каждый — даже тот, кто остался дома — ощутил, что свершилось нечто ужасное. Он же сразу понял причину. Капли сукровицы, что должны были приумножить магические силы чернил, вместо этого отравили их, и теперь мощь связующего заклинания грозила поглотить его. Чернильная скверна заструилась вверх по рунному камню, по кисти — и вскоре захватила руки стража. Она быстро растекалась по телу. Тьма охватила лицо и рот — он уже не мог закричать, даже если бы пожелал. Всю свою жизнь он высчитывал, как заполучить силу выше тех пределов, которым учили наставники... Даже если ради этого он нарушит священный завет о чистоте чернил. Воистину, источник связующей силы открылся ему и направил в его душу такую мощь, которую нельзя и представить. Триумф был совсем близко; осталось только не погибнуть. Страж вобрал в себя силы из созданной связи, оттесняя поток чёрной скверны. Раздался страшный стон — то был общий плач его народа. Некоторые едва держались на ногах. Слабые пали оземь. Многие пытались бежать. А он черпал их жизненные силы ещё и ещё. Но даже они не могли остановить чернильный поток. Лишь когда воздух покинул залитые чернью лёгкие, а тело полностью поглотили чернила, он нашёл выход. Связь с народом Ашкавора — его народом, — должна была черпать их силы только во имя защиты... но протекала и обратно. Собрав оставшиеся силы, и в сей раз движимый не только слепым отвращением, страж пустил поток чернил по священной связи. Понемногу он чувствовал, как поток отступает... И слышал горькие стенания своего народа, окутанного скверной. Когда последняя капля чернил покинула тело стража, его глазам предстал совсем другой мир. Жителей Ашкавора, что он знал, больше не существовало. Все до последней души обратились в кошмарные тени прежних себя — в существ без плоти и крови; существ лишь из вязких, осквернённых чернил.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+40% к урону от Stroke of Fate",
      "talentRight": "+150 к радиусу Ink Swell"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+3 к атакам героя для убийства фантома",
      "talentRight": "+800 к дальности Stroke of Fate"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+16% к скорости передвижения от Ink Swell",
      "talentRight": "+15% к урону от заклинаний"
    },
    {
      "talentLvl": "10",
      "talentLeft": "−5 сек. перезарядки Ink Swell",
      "talentRight": "+50 к урону в секунду от Phantom's Embrace"
    }
  ]
}