{"abilities":[{"effects":["Cast Range: 800","Base Damage: 75","Primary Attribute as Damage: 200%","Enemy Move Speed Slow: 80%","Magic Resistance Reduction: 40%","Duration: 4"],"notes":["Double clicking the item casts it on self.","The projectile travels at a speed of 1275.","Turns the target ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance.","Damage and slow is only applied when targeting an enemy unit.","Checks the caster's primary attribute upon projectile hit.","The blast first applies the ethereal debuff, then the damage, then the slow debuff. This means it effectively amplifies its own damage.","Reduces most heroes' total magic resistance to -5%, assuming basic 25% magic resistance and no other sources of magic resistance.","Ether Blast's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.","Shares cooldown with Ghost Scepter."],"elements":["Ability Target Unit","Affects Allies \/ Enemies","Damage Magical"],"description":"Converts the target unit to ethereal form, rendering them immune to physical damage, but unable to attack and 40% more vulnerable to magic damage. Lasts for 4 seconds on allies and 4 seconds on enemies. Enemy targets are also slowed by 80%, and take 2x your primary attribute + 75 as magical damage."}],"cost":"4700","description":"A flickering blade of a ghastly nature, it is capable of dealing damage in both magical and physical planes.","further":["Eaglesong","Ghost_Scepter"],"tips":["Ethereal Blade can be used in combination with Dagon for massive amounts of burst damage."],"attrs":["Active Ether Blast","Bonus +10 Strength +40 Agility +10 Intelligence","Disassemble? Yes","Alert allies? No"],"info":["For strength heroes, it grants 200 health, 1 health regen, 0.8% magic resistance, 6.4 armor, 40 attack speed, 2% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 10 attack damage.","For agility heroes, it grants 200 health, 1 health regen, 0.8% magic resistance, 6.4 armor, 40 attack speed, 2% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 40 attack damage.","For intelligence heroes, it grants 200 health, 1 health regen, 0.8% magic resistance, 6.4 armor, 40 attack speed, 2% movement speed, 120 mana, 0.5 mana regen, 0.7% spell damage and 10 attack damage."]}