{"abilities":[{"effects":["Дальность применения: 800","Базовый урон: 75","Основного атрибута в урон: 200%","Снижение скорости передвижения: 80%","Снижение сопротивления магии: 40%","Длительность на себе\/союзнике: 4","Длительность на врагах: 4"],"notes":["Урон, нанесенный Ether Blast также усиливается призрачной формой. Юниты в призрачной форме будут получать на 40% больше магического урона и не смогут атаковать, но их также нельзя будет атаковать обычными атаками. Если применить Ether Blast на себя, то вы не получите урон и не будете замедлены. Имеет общее время восстановления с Ghost Scepter."],"elements":["Способность Направленная на юнита","Действует на Союзников \/ Врагов","Урон Магический"],"name":"Ether Blast","description":"Выпускает снаряд, который придает цели бесплотную форму. В этой форме цель не может атаковать, получает увеличенный магический урон, но полностью защищена от физического урона. При применении на противника тот будет замедлен и получит магический урон в размере 2х вашего основного атрибута +75 ед. Использование Town Portal Scroll или Boots of Travel не развеивает бесплотную форму."}],"cost":"4700","description":"Этот мерцающий меч — грозное оружие, способное наносить урон в любом мире, независимо от его физической или магической природы.","further":["Eaglesong","Ghost_Scepter"],"attrs":["Активная Ether Blast","Бонус +10 к силе +40 к ловкости +10 к интеллекту","Можно разобрать? Да","Можно сообщать? Нет"],"info":["Для героев силы, даёт 200 здоровья, 1 регенерации здоровья, 0,8% сопротивления магии, 6,4 брони, 40 скорости атаки, 2% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона от способностей и 10 урона от атаки.","Для героев ловкости, даёт 200 здоровья, 1 регенерации здоровья, 0,8% сопротивления магии, 6,4 брони, 40 скорости атаки, 2% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона от способностей и 40 урона от атаки.","Для героев интеллекта, даёт 200 здоровья, 1 регенерации здоровья, 0,8% сопротивления магии, 6,4 брони, 40 скорости атаки, 2% скорости передвижения, 120 маны, 0,5 регенерации маны, 0,7% урона от способностей и 10 урона от атаки."]}