{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Silver_Edge_Shadow_Walk_1.mp3\/revision\/latest?cb=20191227195534",
      "effects": [
        "Время до невидимости: 0,3",
        "Урон: 175",
        "Доп. скорость передвижения: 25%",
        "Длительность невидимости: 14",
        "Длительность истощения: 4",
        "Критический урон: 160%"
      ],
      "notes": [
        "Атака с действующей Shadow Walk не может промахнуться.",
        "При применении не прерывает произносимые заклинания владельца.",
        "Дополнительный урон наносится вместе с уроном атаки и считается за урон от атаки. От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим. На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "От этого урона идет лечение вампиризмом, но он не может быть критическим или прорубающим.",
        "На урон также не действуют бонусы или уменьшения атаки, основанные на процентах, но он может быть снижен уменьшениями, использующими фиксированное значение.",
        "Дополнительный урон не наносится при атаке вардов и строений из невидимости.",
        "Применяет истощение на цель при атаке из невидимости, отключая её пассивные способности.",
        "Размещает дебафф на цель до совершения атаки, но требует попадания атаки (или снаряда) для применения.",
        "Невидимость теряется после завершения анимации применения заклинаний или после окончания атаки (для дальних героев после запуска снаряда).",
        "В отличии от Shadow Blade Silver Edge не наносит дополнительный урон при атаке, если она поразила цель во время ухода в невидимость.",
        "Позволяет заклинателю проходить сквозь других существ, включая варды, но не строения.",
        "Заклинатель может поднимать и выбрасывать предметы без отмены невидимости.",
        "Делит перезарядку с Shadow Blade."
      ],
      "mana": "75",
      "abilityName": "Shadow Walk",
      "cooldown": "20",
      "description": "Делает героя невидимым на 14 сек. или до момента, когда он совершит атаку или применит способность. Эффект также увеличивает скорость передвижения на 25% и позволяет проходить сквозь существ. Атака, прерывающая невидимость, дополнительно нанесёт 175 физического урона и гарантированный 160% критический удар по цели, отключит пассивные способности жертвы. Длительность эффекта: 4 сек.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Шанс срабатывания: 30%",
        "Критический урон: 160%"
      ],
      "notes": [
        "В среднем увеличивает урон от атаки на 18%.",
        "Шанс срабатывания сочетается с другими источниками критического удара. Если одновременно срабатывают два источника, используется более высокий множитель.",
        "Если одновременно срабатывают два источника, используется более высокий множитель.",
        "Critical Strike использует псевдослучайное распределение.",
        "Не действует на варды, постройки и союзных существ."
      ],
      "mana": null,
      "abilityName": "Critical Strike",
      "cooldown": null,
      "description": "Каждая атака может с вероятностью в 30% нанести 160% урона.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Атрибуты этого предмета дают следующие дополнительные бонусы:",
    "основного урона от атаки ."
  ],
  "cost": "5450",
  "lore": null,
  "consistFrom": [
    "Shadow Blade",
    "Crystalys",
    "Recipe"
  ],
  "name": "Silver Edge",
  "description": "Повергнув несправедливого правителя, этот клинок лишь развязал гражданскую войну.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}