{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Дальность применения: 350"
      ],
      "notes": [
        "Может выбрать любое дерево.",
        "Не делит перезарядку с Quelling Blade или Iron Talon."
      ],
      "mana": null,
      "abilityName": "Chop Tree",
      "cooldown": null,
      "description": "Срубает выбранное дерево.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Доп. урон (TagAghanimближний бой): 15",
        "Доп. урон (TagAghanimдальний бой): 6"
      ],
      "notes": [
        "Сочетается с Quell от Quelling Blade, но не с Quell от нескольких Battle Fury.",
        "При изменении типа атаки владельца на дальний или ближний бой бонус изменяется незамедлительно.",
        "Quell взаимодействует с критическим ударом, прорубанием, уроном соседним целям и вампиризмом.",
        "При атаке крипов Quell позволяет прорубанию, урону соседним целям, Psi Blades и Moon Glaives наносить больше урона каждому пораженному существу.",
        "Не действует на варды, постройки, иллюзии, духа-медведя и союзных существ. Действует на Рошана."
      ],
      "mana": null,
      "abilityName": "Quell",
      "cooldown": null,
      "description": "Увеличивает урон от атак по существам, не являющимися героями, на 15 для героев ближнего боя или на 6 — для дальнего.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0d\/Battle_Fury.mp3\/revision\/latest?cb=20141214001927",
      "effects": [
        "Начальный радиус: 150",
        "Дальность: 650",
        "Конечный радиус: 360",
        "Урон прорубания против героев: 70%",
        "Урон прорубания против крипов: 40%"
      ],
      "notes": [
        "Урон имеет пометку «без вампиризма заклинаниями», что не позволяет лечиться от него с помощью вампиризма заклинаниями.",
        "Урон имеет пометку «не усиливающееся заклинание», что не позволяет его увеличить усилением урона от заклинаний.",
        "Прорубающий урон уменьшается блокировкой урона.",
        "Область поражения представляет собой равнобедренную трапецию, начинающуюся перед атакующим героем.",
        "Сочетается с другими источниками прорубания. Каждый источник действует независимо от других.",
        "Не дает прорубания при атаке вардов, строений или союзных существ. Варды и постройки не попадают под действие прорубания.",
        "Несмотря на визуальные эффекты, прорубающий урон применяется мгновенно по всей области.",
        "Существа дальнего типа атаки не могут пользоваться прорубающим ударом."
      ],
      "mana": null,
      "abilityName": "Cleave",
      "cooldown": null,
      "description": "Атаки героя прорубают жертву, нанося врагам в радиусе 650 вокруг неё физический урон (только в ближнем бою). • Урон героям: 70% • Урон крипам: 40%",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "4100",
  "lore": null,
  "consistFrom": [
    "Broadsword",
    "Claymore",
    "Perseverance",
    "Quelling Blade"
  ],
  "name": "Battle Fury",
  "description": "Владелец этого могучего топора может выкашивать врагов целыми рядами.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}