{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Boots_of_Bearing_Endurance.mp3\/revision\/latest?cb=20220618225121",
      "effects": [
        "Radius: 1200",
        "Move Speed Bonus: 15%",
        "Attack Speed Bonus: 50",
        "Slow Immunity Duration: 1.5",
        "Duration: 6",
        "Number of Charges: 8",
        "Charge Replenish Time: 180"
      ],
      "notes": [
        "Does not interrupt the caster's channeling abilities upon cast. Meepo Clones cannot cast Endurance.",
        "Meepo Clones cannot cast Endurance.",
        "Always starts out with max charges, regardless of how many charges the Drum of Endurance had upon upgrading it. Boots of Bearing must be in the owner's main inventory to replenish charges. Does not gain replenish while in the backpack, on the ground, in the stash, or on Courier.",
        "Boots of Bearing must be in the owner's main inventory to replenish charges.",
        "Does not gain replenish while in the backpack, on the ground, in the stash, or on Courier.",
        "When having multiple Boots of Bearings in the inventory, only the oldest one gains charges. If it is full, the second oldest one starts gaining charges.",
        "Casting Endurance while having no charges puts the item on cooldown without any other effect.",
        "Multiple casts of Endurance do not stack the buff, but refresh the duration instead.",
        "Both Boots of Bearing's and Drum of Endurance's buffs do not stack, a unit that is already affected by one cannot be affected by the other. This means if a unit already has the buff from Boots of Bearing, casting Drum of Endurance does not replace the buff, nor does it refresh it, and vice versa.",
        "This means if a unit already has the buff from Boots of Bearing, casting Drum of Endurance does not replace the buff, nor does it refresh it, and vice versa.",
        "For the initial 1.5 seconds of the buff, the affected unit is fully immune to movement speed slows. Does not work against roots, barriers and movement speed setting effects.",
        "Does not work against roots, barriers and movement speed setting effects.",
        "Only affects player-controlled units, including invulnerable units, excluding wards.",
        "Does not share cooldowns with Drum of Endurance."
      ],
      "mana": "0",
      "abilityName": "Endurance",
      "cooldown": "30",
      "description": "Consumes a charge and gives +50 attack speed, +15% Movement Speed to nearby allies for 6 seconds For the first 1.5 seconds allies are immune to slows. Starts with 8 charges. Gains 1 charge every 3 minutes.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Radius: 1200",
        "Move Speed Bonus: 20",
        "Aura Linger Duration: 0.5"
      ],
      "notes": [
        "Multiple instances of Swiftness Aura do not stack. This includes the aura of Drum of Endurance. Stacks with all other movement speed bonuses.",
        "Stacks with all other movement speed bonuses.",
        "Does not affect invulnerable units.",
        "The aura's buff lingers for 0.5 seconds."
      ],
      "mana": null,
      "abilityName": "Swiftness Aura",
      "cooldown": null,
      "description": "Grants 20 movement speed to allies.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "160 health and 0.8 health regeneration.",
    "96 mana and 0.4 mana regeneration.",
    "8 main attack damage to \/ heroes."
  ],
  "cost": "4075",
  "lore": null,
  "consistFrom": [
    "Tranquil Boots",
    "Drum of Endurance",
    "Recipe"
  ],
  "name": "Boots of Bearing",
  "description": "Resplendent footwear fashioned for the ancient herald that first dared spread the glory of Stonehall beyond the original borders of its nascent claim.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}