{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/ee\/Ninja_Gear_Solitary_Disguise.mp3\/revision\/latest?cb=20191227195714",
      "effects": [
        "Dispel Radius: 1025",
        "Fade Time: 0",
        "Move Speed Bonus: 20%",
        "Duration: 35"
      ],
      "notes": [
        "Interrupts the caster's channeling abilities and any other order upon using, with the exception of regular move orders.",
        "Affected units can cast abilities, pick up and drop items while invisible without breaking it. However, attacking does break it.",
        "When attacking, the invisibility is lost upon reaching the attack point, even when the attack misses.",
        "True Sight cannot detect units affected by Ninja Gear.",
        "Only units affected by Chronosphere, or units that have their unit model revealed by abilities such as Thirst or Track, can be seen while affected by Disguise. See shared vision for the full list of abilities that reveal unit models. The hero that become visible this way are still hidden from the minimap.",
        "See shared vision for the full list of abilities that reveal unit models.",
        "The hero that become visible this way are still hidden from the minimap.",
        "Units affected do not provide vision from shared vision abilities unless they also have their unit model revealed by a different shared vision ability that specifically reveals unit models.",
        "Only affects the caster themselves. Other invulnerable and hidden enemy heroes dispel it.",
        "The effect is only dispelled when approaching enemy heroes (including Meepo Clones, excluding other clones and illusions), towers or fountain. However, upon cast, Disguise does not affect allies who have any enemy clone near them, including clones that otherwise do not dispel it. The effect is also dispelled upon entering the elevated fountain area of the enemy team.",
        "However, upon cast, Disguise does not affect allies who have any enemy clone near them, including clones that otherwise do not dispel it.",
        "The effect is also dispelled upon entering the elevated fountain area of the enemy team."
      ],
      "mana": "0",
      "abilityName": "Solitary Disguise",
      "cooldown": "45",
      "description": "Casts Smoke of Deceit on yourself only.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "25 attack speed and 4.17 main armor.",
    "25 main attack damage to heroes."
  ],
  "cost": null,
  "lore": null,
  "consistFrom": null,
  "name": "Ninja Gear",
  "description": "Valuable equipment recovered by a young explorer sifting through the flotsam and detritus drifting in the void.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}