{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Ракеты от Heat-Seeking Missile оглушают на 0,25 сек.",
          "talentRight": "+80 к урону от Laser"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+150 к поглощению урона у Defense Matrix",
          "talentRight": "+10% к урону от заклинаний"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+1 к числу целей Heat-Seeking Missile",
          "talentRight": "−0,5 сек. применения Keen Conveyance"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+8% к уменьшению расхода и сжигания маны",
          "talentRight": "+2 сек. ослепления от Laser"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/25\/Tinker_Laser.mp3\/revision\/latest?cb=20191216025246",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Во время применения проигрывается звуковой эффект, который слышен всем.",
        "На крипов-героев способность действует столько же, сколько и на крипов.",
        "Лазер сначала наносит урон, затем применяет дебафф.",
        "Ослепление лазера использует псевдослучайное распределение.",
        "При улучшении Aghanim's Scepter способность отскакивает в ближайшего врага в радиусе 1 от текущей цели. У отскока нет задержки, поэтому лазер попадает по всем целям одновременно. Отскакивает только от героев (включая клонов), иллюзий и крипов-героев. Если основная цель окажется обычным крипом\/призванным существом, способность продолжит перескакивать к подходящим целям в радиусе действия. Не отскакивает от невидимых существ или существ в тумане войны.",
        "У отскока нет задержки, поэтому лазер попадает по всем целям одновременно.",
        "Отскакивает только от героев (включая клонов), иллюзий и крипов-героев. Если основная цель окажется обычным крипом\/призванным существом, способность продолжит перескакивать к подходящим целям в радиусе действия.",
        "Не отскакивает от невидимых существ или существ в тумане войны.",
        "С Aghanim's Scepter лазер уменьшает как максимальное здоровье, так и текущее здоровье цели на 1 от их значений. То есть уменьшение текущего здоровья становится меньше с каждым последующим применением, в то время как уменьшение максимального остается постоянным. Поскольку дебафф применяется до нанесения урона, то уменьшение здоровья происходит до урона. При потере дебаффа максимальное здоровье цели возвращается, в то время как текущее — нет.",
        "То есть уменьшение текущего здоровья становится меньше с каждым последующим применением, в то время как уменьшение максимального остается постоянным.",
        "Поскольку дебафф применяется до нанесения урона, то уменьшение здоровья происходит до урона.",
        "При потере дебаффа максимальное здоровье цели возвращается, в то время как текущее — нет.",
        "Несколько применений на одну и ту же цель не складываются. С Aghanim's Scepter повторные применения складываются. C Aghanim's Scepter значение уменьшения размера модели суммируется с каждым применением.",
        "С Aghanim's Scepter повторные применения складываются.",
        "C Aghanim's Scepter значение уменьшения размера модели суммируется с каждым применением."
      ],
      "mana": "110\/130\/150\/170 (TagTalent 101,2\/119,6\/138\/156,4)",
      "item_behaviour": [],
      "name": "Laser",
      "cooldown": "20\/18\/16\/14",
      "description": "Выпускает луч сконцентрированной энергии, который устраняет базовое сопротивление магии цели, а также наносит урон и ослепляет её, заставляя промахиваться всеми физическими атаками.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,4+1",
        "Дальность применения: 650 (TagAghanim 850)",
        "Радиус урона: 250",
        "Урон: 80\/160\/240\/320 (TagTalent 160\/240\/320\/400)",
        "Шанс промаха: 100%",
        "Длительность на героях: 3\/3,5\/4\/4,5 (TagTalent 5\/5,5\/6\/6,5)",
        "Длительность на крипах: 6 (TagTalent 8)",
        "Радиус отскока: 700",
        "Количество отскоков: 1",
        "Уменьшение макс.\/текущ. здоровья и размера модели: 10%",
        "Заменяет лазер на уменьшающий луч. Его дальность применения увеличена на 200, и он уменьшает размер и текущее здоровье цели на 1. Эффекты от нескольких применений складываются. Луч отражается в самого дальнего врага в радиусе вокруг цели (TagAghanimв первую очередь в героев).",
        "Ослепление остается, если дебафф был применен до иммунитета к заклинаниям и не был развеян.",
        "Блокируется только основной целью."
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4e\/Tinker_Heat-Seeking_Missile_1.mp3\/revision\/latest?cb=20191216025258",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Применение Heat-Seeking Missile прерывает произносимые заклинания Tinker.",
        "Ракеты летят со скоростью 700.",
        "При попадании все ракеты наносят до 230\/380\/530\/680 (TagTalent 345\/570\/795\/1020) урона (до уменьшений).",
        "Не считает целями существ вне зоны обзора (в том числе невидимых), неуязвимых или спрятанных.",
        "Считает целями клонов героев и иллюзии.",
        "Если в радиусе действия нет подходящих целей, ракеты вылетают и падают на землю, показывая, что применение способности было неуспешным.",
        "При выборе (TagTalent таланта 25-го уровня ракеты также ненадолго оглушают врагов при попадании. Ракеты сначала наносят урон, затем применяют дебафф.",
        "Ракеты сначала наносят урон, затем применяют дебафф."
      ],
      "mana": "80\/95\/110\/125 (TagTalent 73,6\/87,4\/101,2\/115)",
      "item_behaviour": [],
      "name": "Heat-Seeking Missile",
      "cooldown": "18",
      "description": "Запускает две ракеты в ближайших видимых вражеских героев в радиусе 2500.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+1,2",
        "Радиус поиска: 2500",
        "Число целей: 2 (TagTalent 3)",
        "Урон от ракеты: 115\/190\/265\/340",
        "Длительность оглушения: 0,25",
        "Не считает целью существ с иммунитетом к заклинаниям."
      ],
      "legacy_key": "T",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2e\/Tinker_Defense_Matrix.mp3\/revision\/latest?cb=20210103154706",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Союзников"
      ],
      "notes": [
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Defense Matrix отрицает урон (после всех уменьшений), предотвращая срабатывание определенных эффектов, реагирующих на урон.",
        "Отрицает урон после всех уменьшений, за исключением следующих: Shield Crash, Aphotic Shield, Mischief, Ghostship.",
        "Shield Crash, Aphotic Shield, Mischief, Ghostship.",
        "Несколько щитов не складываются; повторное применение обновляет длительность и сбрасывает счетчик поглощенного урона.",
        "Сопротивление эффектам складывается по закону убывающей полезности с другими источниками сопротивления."
      ],
      "mana": "70\/80\/90\/100 (TagTalent 64,4\/73,6\/82,8\/92)",
      "item_behaviour": [],
      "name": "Defense Matrix",
      "cooldown": "12",
      "description": "Создаёт вокруг союзного существа барьер, который блокирует урона и даёт сопротивление эффектам в . Барьер действует до сек.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,6",
        "Дальность применения: 600",
        "Здоровье щита: 100\/180\/240\/320 (TagTalent 250\/330\/390\/470)",
        "Доп. сопротивление эффектам: 20%\/30%\/40%\/50%",
        "Длительность: 15",
        ""
      ],
      "legacy_key": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/33\/Tinker_March_of_the_Machines.mp3\/revision\/latest?cb=20191216025247",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Требует Aghanim's Shard для разблокировки.",
        "Роботы движутся со скоростью 400 единиц на расстояние 1800 единиц за 4,5 сек.",
        "Область появления роботов радиусом 900 единиц зафиксирована за точкой применения, а не за местоположением Tinker.",
        "Область появления — это линия длиной 1800 единиц, которая начинается в 900 единицах позади точки примения.",
        "Вся площадь области появления роботов представляет собой квадрат со стороной в 1800 единиц.",
        "Роботы появляются с интервалом в 0,0417 сек. в случайных точках по области применения, создавая 24 робота в секунду; всего появляется 144 робота.",
        "Роботы не появляются там, где область появления выходит за границы карты.",
        "Если враг появляется в пределах 50 единиц от робота, то механизм наносит урон в радиусе 150 и исчезает.",
        "Если один враг будет находится в области всю длительность, то в среднем получит до 355,2 урона (до уменьшений).",
        "Если бы каждый взрыв мог задеть цель, то она получила бы до 4320 урона (до уменьшений).",
        "Роботы не взрываются и не наносят урон при столкновении с курьером.",
        "Звук применения способности не слышен врагам, но звук движения роботов им слышен."
      ],
      "mana": "190 (TagTalent 174,8)",
      "item_behaviour": [],
      "name": "March of the Machines",
      "cooldown": "35",
      "description": "Призывает армию механических слуг, атакующих врагов в области вокруг героя.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,53+0,63",
        "Дальность применения: 300",
        "Радиус появления роботов: 900",
        "Радиус столкновения робота: 50",
        "Радиус взрыва робота: 150",
        "Урон от взрыва: 30",
        "Длительность: 6",
        "Роботы не сталкиваются с врагами с иммунитетом к заклинаниям."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/11\/Tinker_Keen_Conveyance_1.mp3\/revision\/latest?cb=20210829210017",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо \/ Произносимая",
        "Действует на Себя"
      ],
      "notes": [
        "Повышение уровня этой способности также автоматически повышает уровень Rearm.",
        "↓↓ Двойное нажатие на способность, при нахождении на расстоянии как минимум в 1500 единиц от фонтана команды, автоматически выберет целью фонтан.",
        "При нацепливании на землю, способность автоматически ищет ближайшую подходящую цель для телепортации. По умолчанию, Keen Conveyance может выбирать в цель лишь постройки. На 2-м уровне может также выбирать крипов, и на 3-м уровне — героев. Не может напрямую взять в цель постройки. Вместо этого способность использует минимальное расстояние телепортации.",
        "По умолчанию, Keen Conveyance может выбирать в цель лишь постройки. На 2-м уровне может также выбирать крипов, и на 3-м уровне — героев.",
        "Не может напрямую взять в цель постройки. Вместо этого способность использует минимальное расстояние телепортации.",
        "Позволяет избежать снаряды при телепортации.",
        "Во время произнесения место назначения телепортации обозначается визуальным эффектом того же цвета, что и игрок, а также проигрывается звук. Звук и визуальные эффекты видны и слышны всем. Визуальный эффект также виден при телепортации к невидимым союзникам.",
        "Звук и визуальные эффекты видны и слышны всем.",
        "Визуальный эффект также виден при телепортации к невидимым союзникам.",
        "Также отмечает точку на мини-карте для союзников. Метка окрашивается в цвет игрока и существует пока произносится способность.",
        "Даёт 200 единиц ночного обзора в точке назначения на всю длительность произнесения, даже если способность была отменена. Обзор задерживается на 1 секунду.",
        "Приоритет атаки выбранного существа понижается, то есть другие существа будут атаковать его в последнюю очередь.",
        "Если выбранное существо умрёт или изменит своего владельца (например от Enchant) во время произнесения, то телепортация отменится, расходуя ману и перезарядку способности. Так как постройки не выбираются в цель напрямую, то разрушение постройки или потеря аванпостов не отменит телепортацию.",
        "Так как постройки не выбираются в цель напрямую, то разрушение постройки или потеря аванпостов не отменит телепортацию."
      ],
      "mana": "75 (TagTalent 69)",
      "item_behaviour": [],
      "name": "Keen Conveyance",
      "cooldown": "80",
      "description": "После подготовки в 4,5\/4\/3,5 сек. герой телепортируется к союзной постройке. Второй уровень способности позволяет телепортироваться к существам, а третий — к героям.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: Глобальная",
        "Мин. расстояние прицеливания к постройке: 70",
        "Макс. расстояние прицеливания к постройке: 800",
        "Макс. расстояние прицеливания к аванпостам: 250",
        "Время произнесения: 4,5\/4\/3,5 (TagTalent 4\/3,5\/3)",
        "Время произнесения к аванпосту: 5 (TagTalent 4,5)",
        "Не позволяет применить способность и отменяет телепортацию, если она уже произносится."
      ],
      "legacy_key": "V",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b9\/Tinker_Rearm_1.mp3\/revision\/latest?cb=20210829210011",
      "effects": [
        "Способность Ненаправленная \/ Произносимая",
        "Действует на Себя"
      ],
      "notes": [
        "Способность не сбрасывает перезарядку следующих предметов: Aeon Disk, Arcane Boots, Black King Bar, Hand of Midas, Helm of the Dominator, Linken's Sphere, Meteor Hammer, Necronomicon, Pipe of Insight, Refresher Orb и Refresher Shard. Не перезаряжает нейтральные предметы. Визуально сбрасывает перезарядку Tranquil Boots, но отсчет восстановления все равно идет. Не восстанавливает заряды предметов (TagTalent Bottle, Drum of Endurance). Перезаряжает только те предметы, которые находятся в инвентаре и ранце Tinker. На предметы в тайнике, в других существах (в том числе курьере) или выброшенные из инвентаря сброс не распространяется. Перезаряжает только предметы, принадлежащие Tinker. На предметы союзников способность не действует. Если прервать произнесение способности, ничего не перезарядится.",
        "Aeon Disk, Arcane Boots, Black King Bar, Hand of Midas, Helm of the Dominator, Linken's Sphere, Meteor Hammer, Necronomicon, Pipe of Insight, Refresher Orb и Refresher Shard.",
        "Не перезаряжает нейтральные предметы.",
        "Визуально сбрасывает перезарядку Tranquil Boots, но отсчет восстановления все равно идет.",
        "Не восстанавливает заряды предметов (TagTalent Bottle, Drum of Endurance).",
        "Перезаряжает только те предметы, которые находятся в инвентаре и ранце Tinker. На предметы в тайнике, в других существах (в том числе курьере) или выброшенные из инвентаря сброс не распространяется.",
        "Перезаряжает только предметы, принадлежащие Tinker. На предметы союзников способность не действует.",
        "Если прервать произнесение способности, ничего не перезарядится.",
        "Перезаряжает Crimson Guard и Mekansm, но не сбрасывает таймер эффектов их способностей. То же правило действует и на Guardian Greaves, но их способность Mend восстанавливает ману.",
        "То же правило действует и на Guardian Greaves, но их способность Mend восстанавливает ману.",
        "Звук использования Rearm становится короче с каждым уровнем, соответствуя длительности применения.",
        "Модификатор Rearm нужен лишь для информирования."
      ],
      "mana": "150\/225\/300 (TagTalent 138\/207\/276)",
      "item_behaviour": [],
      "name": "Rearm",
      "cooldown": "0",
      "description": "Cбрасывает время перезарядки способностей и большинства предметов героя.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0+0",
        "Длительность произнесения: 3,5\/2\/1,25",
        "Дарует новую способность: March of the Machines."
      ],
      "legacy_key": "R",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 18.0,
    "attrIntelligence": 30.0,
    "attrIntelligenceInc": 3.3,
    "attrAgilityInc": 1.2,
    "attrAgility": 13.0
  },
  "description": "Tinker — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Способность Laser позволяет выстрелить из лазерной пушки в противника, нанося мгновенный чистый урон, который не блокируется физической защитой, и ослепляя врагов, заставляя их промахиваться. Способностью Heat-Seeking Missile герой выстреливает ракетами по двум ближайшим вражеским героям. Способность March of the Machines позволяет герою вызвать армию маленьких роботов, которые наносят урон всем, по которым они будут идти, включая вражеских героев и крипов. Благодаря способности Rearm герой перезаряжает все свои способности и большинство предметов для дальнейшего использования.",
  "history": "Карликовый народец, которому принадлежит Боуш, известен своими изобретательностью, хитростью и нелюбовью к магии. Гордятся они, что зарабатывают себе на хлеб исключительно разумом, применяя лишь те силы природы, которым могут найти объяснение. Но даже такая сдержанность может обернуться трагедией — уж Боушу ли не знать. Когда-то он был одним из главных исследователей законов природы, основателем подземной лаборатории всего и вся, расположенной под окутанным туманами Фиолетовым плато. Презирая магов за опасность, которую те представляют для мира, Боуш и его помощники, не ведая об опасности, открыли портал в некий мир за гранью разумения и оказались во власти собственных кошмаров. Чёрный туман покрыл Фиолетовое плато вечной тьмой, откуда теперь доносятся полные ужаса звуки. Только благодаря всяким штуковинам собственного изобретения Боушу удалось бежать. Один он пережил беду Фиолетового плато.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Ракеты от Heat-Seeking Missile оглушают на 0,25 сек.",
      "talentRight": "+80 к урону от Laser"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+150 к поглощению урона у Defense Matrix",
      "talentRight": "+10% к урону от заклинаний"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+1 к числу целей Heat-Seeking Missile",
      "talentRight": "−0,5 сек. применения Keen Conveyance"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+8% к уменьшению расхода и сжигания маны",
      "talentRight": "+2 сек. ослепления от Laser"
    }
  ]
}