{"abilities":[{"spell":"Собирает мощь героя в заряд выжигающей энергии, который накладывает оцепенение на цель и врагов вокруг неё, наносит им урон и снимает с них положительные эффекты. Если целью является союзник, то способность только развеет отрицательные эффекты. Длительность оцепенения врагов равна времени применения способности — до 2,5 сек.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Скорость полета снаряда - 1000.","Если целью заклинания выбран союзник, то эффект от способности все равно применится на ближайших врагов. На союзника будет наложено только развеивание. Также можно применить на владельца способности. Накладывает развеивание на всех врагов в радиусе, тогда как союзник получает развеивание только будучи выбранным. Таким образом, за раз лишь один союзник может быть очищен.","Всегда снимает эффект Fate's Edict с затронутых целей.","Fortune's End сначала применяет развеивание, затем дебафф, а затем урон ( и оглушение).","Можно напрямую применить к неуязвимым существам, даже если урон от способности отрицается неуязвимостью. Не действует на спрятанные цели.","Когда снаряд попадает в неуязвимое, находящееся под иммунитетом к заклинаниям или исчезнувшее существо, то эффект от него все равно применяется ко всем существам в радиусе.","Произнесение не отменяется, если цель получила иммунитет к заклинаниям, стала невидимой или неуязвимой, спряталась или умерла.","Если произнесение прерывается из-за обезвреживания, то снаряд будет выпущен преждевременно.","Урон и эффект развеивания фиксированы, только длительность оцепенения зависит от потраченного на произнесение времени.","Длительность оцепенения начинается с 0,5 секунд и увеличивается на 0,08 ( 0,0857) за каждые 0,1 секунды произнесения, достигая 2,5 ( 3,5) за 2,5 ( 3,5) секунды. Длительность оглушения от Aghanim's Scepter рассчитывается от длительности оцепенения, начиная с минимальной 0,25 и достигая максимальной длительности в 1,25 ( 1,75) секунды.","Fortune's End применяет оцепенение к целям, предотвращая их передвижение и использование способностей для перемещения. Дает эффект True Sight на цель, но только в случае, если цель не невидима или не ушла в невидимость до попадания.","Не может ни выбрать, ни воздействовать на варды и строения.","Создает визуальный эффект на цель во время произнесения способности, показывая, кто был выбран способностью. Этот эффект виден всем.","Звук во время произнесения также слышен всем."],"mana":"100","elements":["Нельзя избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"15\/12\/9\/6","name":"Fortune's End","description":["Анимация применения: 0+0","Дальность применения: 850 ( 1000) ( 1650, 1800)","Радиус эффекта: 300 ( 450)","Макс. время применения: 2,5 ( 3,5)","Урон: 120\/150\/180\/210","Мин. длительность оцепенения: 0,5","Макс. длительность оцепенения: 2,5 ( 3,5)","Длительность оглушения от оцепенения: 0% ( 50%)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Наполняет цель счастьем, обезоруживая ее и даруя сопротивление магии в 3\/3,5\/4\/4,5. Можно применять как на союзников, так и на врагов.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников"],"notes":["Применяет к цели обезоруживание и приравнивает её сопротивление магии к 100%.","Fate's Edict всегда применяет к цели дебафф, независимо от того враг это или союзник. То есть при выборе союзника Fate's Edict можно развеять базовым развеиванием. Но при применении этого заклинания на врага Fate's Edict нельзя развеять ничем, кроме Fortune's End."],"mana":"50","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/13\/10\/7 ( 11\/8\/5\/2)","name":"Fate's Edict","description":["Анимация применения: 0,3+1,1","Дальность применения: 500\/600\/700\/800 ( 650\/750\/850\/950)","Сопротивление магии: 100%","Длительность: 3\/3,5\/4\/4,5"],"hot_key":"W","legacy_key":"F"},{"spell":"Выжигает всю скверну цели, нанося ей огромный урон, а затем со временем восстанавливает ее жизненные силы. Количество восстанавливаемого здоровья больше урона. Можно применять как на союзников, так и на врагов.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["При использовании урон наносится мгновенно, затем действует периодическое лечение. Уроном можно убить врагов, но не союзников.","Лечит с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая 9 раз.","Может вылечить до 99\/198\/297\/396 единиц здоровья (9\/18\/27\/36, если учитывать базовый урон (до уменьшений)) за применение.","Несколько эффектов лечения от Purifying Flames складываются."],"mana":"80\/85\/90\/95","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"2,25 ( 1,25)","name":"Purifying Flames","description":["Анимация применения: 0,3+1,1","Дальность применения: 850 ( 1000)","Урон: 90\/180\/270\/360","Лечение в секунду: 11\/22\/33\/44","Длительность: 9"],"hot_key":"E","legacy_key":"E"},{"spell":"Отсрочивает судьбу союзника, откладывая любое лечение и получение урона до конца действия этой способности. Любое лечение, примененное во время действия этой способности, удваивается. При применении снимает с цели большинство отрицательных эффектов.","effects":["Способность Направленная на юнита","Действует на Союзных героев","Урон Чистый (Отнимающий здоровье)"],"notes":["При использовании применяет к цели сильное развеивание. Можно применять к иллюзиям и крипам-героям.","False Promise отрицает урон после учета всех уменьшений, предотвращая срабатывание эффектов, реагирующих на урон.","У False Promise второй по счету приоритет в группе заклинаний, отрицающих урон. Также способность отрицает эффекты лечения. То есть в комбинации с Aphotic Shield или Living Armor False Promise будет отрицать урон, а перечисленные способности - нет. У способности приоритет ниже, чем у Borrowed Time, означая то, что Borrowed Time сначала переведет урон в лечение, а затем лечение будет заблокировано False Promise.","Как и все эффекты, отрицающие урон, False Promise отрицает и откладывает только 3 типа урона. Способность игнорирует урон, отнимающий здоровье (за исключением Heartstopper Aura).","Не предотвращает срабатывание мгновенно убивающих эффектов таких, как Culling Blade или Ice Blast.","False Promise откладывает не только нанесение урона, но и увеличение здоровья героя с некоторыми исключениями. В отличии от отрицания урона, отрицание эффектов лечения действует до любых усилений или уменьшений (например, Ghost Shroud и Ice Blast). False Promise учитывает непосредственно лечение. Другие способы увеличения здоровья не учитываются, хотя их все еще можно предотвратить (например, здоровье, даваемое силой). Не предотвращает увеличение здоровья героя для следующих заклинаний: Morph Replicate, Supernova, Soul Catcher, Sunder, Whirling Death, Decay, Time Lapse, Armlet of Mordiggian.","В конце длительности цель излечивается (проигрывается первый звук), если лечение превысило урон, или получает урон (проигрывается второй звук), если урона было больше. Все полученное лечение складывается в один источник и удваивается. Затем из суммы лечения вычитается каждый источник урона из очереди. Операция будет повторяться до того, пока урон от всех источников не будет отменен, либо пока не закончится сумма лечения. Если сумма лечения закончилась, то нанесутся все оставшиеся в очереди источники урона. Этот урон отмечен как отнимающий здоровье. При этом, если цель умрет, убийство засчитывается тому, чей урон привел к смерти (это может быть как первый или последний источник, так и любой между ними). Нелетальные источники урона, заблокированные во время действия False Promise остаются нелетальными, когда наносятся в конце действия способности. Если все источники урона были отменены, то оставшееся лечение будет применено общим источником к цели. Это лечение всегда приписывается Oracle.","Несмотря на урон, отнимающий здоровье, Shallow Grave может спасти цель от смерти, а Borrowed Time превратит этот урон в лечение.","Если цель стала неуязвимой при истечении действия False Promise, то отложенное лечение и урон будут нанесены при возвращении существу уязвимости.","Несколько применений на цель не складываются, но обновляют длительность. Заблокированное лечение и урон не сбрасываются.","Если общий урон превышает общее лечение и текущее здоровье цели, то сфера горит красным и испускает огонь, информируя о предстоящем уроне.","Если выбран талант на 20-ом уровне, то способность делает цель невидимой с задержкой в 0,6 секунды. Атака, использование заклинаний или предметов выводят из невидимости и сбрасывают время до невидимости."],"mana":"100\/150\/200","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"115\/80\/45","name":"False Promise","description":["Анимация применения: 0,3+0,97","Дальность применения: 700\/850\/1000 ( 850\/1000\/1150)","Задержка до невидимости: 0 ( 0,6)","Отложенное усиление лечения: 100%","Длительность: 8\/9\/10 ( 10\/11\/12)"],"hot_key":"R","legacy_key":"R"}],"bio":"Веками наследники Великого трона Симурри импортировали оракулов исключительно из Белого инкубатория, что в полых вершинах Гребня фанатиков. Вступительный взнос давался при зачатии эмбриона, а остальное, по доставке к Вратам высеченного короля зрелого, хорошо-тренированного пророка. Бледные предсказательницы выводят всех разрешенных оракулов, рождая и воспитывая их, и своей физической формой оракулы закреплены в мире, общем для большинства из нас. Души же их бродят далеко, едва связанные легчайшими астральными пуповинами. Возращаясь из своих вселенских странствий, пророки вещают огненные слова языками плоти. Симуррийские советники анализируют мистические речи пророков и находят в них видения будущего, дипломатические советы и прочие сверхъестественные надобности, дающие династии Высеченных королей победы при дворе и в бою. И так продолжалось поколениями, заполняя страницы Хроники высеченных королей именами королей-победителей и покоренных ими земель. Так продолжалось до тех пор пока один оракул, по имени Нериф, не прибыл для служения последнему из владык в каменных шлемах. С самого начала пророчества Нерифа были необычны. Казалось, они не предсказывают будущее а вершат его. Странный предсказатель выкаркивал советы когда их никто не просил, и неожиданно симуррийцы оказывались ввязаны в конфликты с новыми врагами. Советники, ощущая угрозу своей власти, быстро осознали в последнем оракуле источник нежелательных свар. Они потребовали его устранения, запросив предсказательниц взять обратно неполноценного пророка и предоставив достойную замену. Но в зловещем сне Нериф описал гибель Инкубатория и через несколько часов пришли вести что страшный обвал погубил древную школу. Опасаясь разделить участь Бледных предсказательниц, советники удалились в свои палаты для совещаний, желая избежать внимания оракула. Но Высеченный король всегда отличался практичностью. Он не полностью доверял своим сверхосторожным Советникам. Оракул такой редкости, думал он, должен быть использован для расширения владений. Исходя из этого, он сместил своих излишне робких советников и приблизил Нерифа. Плохо понимая свойства Нерифа, он попросту заявлял о своих желаниях и вынуждал Нерифа высказать эти желания как предсказания. Сначала все шло хорошо. Последний из Высеченных королей хвалился что взяв себе баловня судьбы он овладел самой судьбой. Следовала бы принять за предупреждение, когда накануне вторжения в земли Неудовлетворимого сатрапа, он пытался выудить у своего оракула предсказание несомненной победы, но Нериф лишь негромко прошептал, «все может быть». Более твердых слов король не смог заставить слететь с его губ. Тем не менее, король был уверен в своем войске. Сатрапия не имела выходов к морю, была слабо вооружена и лишена всех потенциальных союзников. Слова «все может быть» Король понял как то, что с перевесом в военной мощи, его план не несет серьезного риска. Конечно, теперь мы знаем что он должен был понять слова предсказателя более буквально. Даже при тщательном изучении Аннотированных анналов возможного, то что произошло на поле брани у дворца Неудовлетворимого сатрапа почти невозможно представить. Было похоже, что среди резни битва начала раздваиваться. В каждый решающий момент реальность разделялась и распадалась на осколки. Отступающие и падающие бойцы в тоже время держались крепко и смело вступали в бой. Разделилось и сознание солдат, они чувствовали себя и живыми и мертвыми, существующими и несуществующими. Победа и поражение разделились, и то и другое ощущалась одновременно обоими сторонами. Вселенная обратилась в зал зеркал, каждое из них бесконечно разбивающееся. Непосредственным эффектом происходящего стало сумасшествие. Не в силах понять состояние победы и поражения одновременно, сознание Высеченного короля распалось на лоскуты безумства. Наивному сатрапу досталось не меньше. Противоположные реальности продолжали разделяться и разделяться, как эхо они заполняли бесконечные варианты случившегося, каждый населенный непонимающими жителями которые вскоре потеряли способность кормить себя, одеваться, защищаться или размножаться обычным образом. Тем не менее, задолго до того как последствия случившегося полностью проявились, цимуррийские советники схватили Нерифа, связали его, заткнули рот и вышвырнули из своей вселенной на барке способной пересекать измерения, в надежде навсегда оставить его где-то где он не сможет им навредить. Конечно, для них это было слишком поздно. Возможно, для нас тоже.","talentsTips":["Талант на интеллект в общем даёт Oracle: 180 маны, 0,75 регенерации маны, 1,05% урона заклинаний и 15 урона от атаки."],"trivia":["Oracle впервые появился в Dota 2 в комиксе \"The Contract\", опубликованном 14 ноября 2014 в официальном блоге Dota 2.","Майк Шапиро (актер, озвучивавший Оракула) также известен за озвучивание Барни Калхоуна и G-Man'а, двух известных персонажей в серии Half-Life. Реплики Оракула \" Prepare for unforeseen consequences\" и \" Is it really that time again?\" ссылаются на те же реплики G-Man'а в Half-Life2: Episode 2 и Half-Life 2 соответственно; биография и в целом способности персонажа так же являются непрямыми отсылками (вполне вероятно, что G-Man и есть Oracle)","Фраза \" So it goes\" - это ссылка на роман \"Бойня номер пять\" Курта Воннегута. В романе эта фраза использовалась пришельцами, известными как Тральфомадорианцы, которые воспринимали все время одинаково.","Реплика \" First blood! Out of fifty possibilities, that was my preferred\" ссылается на то, что может быть 50 вариантов первой крови (каждый из 10 героев может быть убит любым из 5 вражеских героев). Тем не менее, такие варианты, как, например, падение серверов и отмену игры, не учитываются.","Заклинание Оракула Purifying Flames и его фраза \" I must harm to heal.\" могут непосредственно ссылаться на медицинский принцип \"Primum non nocere\", который означает \"Прежде всего не навреди\".","Фраза \"Ask again later.\" отсылка к ответу Волшебного 8-го шара, игрушке якобы предсказывающей будущее.","Пророчество герою Viper \" V is not for visions of victory, but for a victim of a vicious viper.\" - отсылка к цитате: V значит Vendetta","Пророчество Chaos Knight \" Beware the knight who commandingly demands: do you even rift?\" Отсылка к зарубежному интернет-мему \"Do you even lift?\"","Пророчество герою Lion \" Fear neither witch, nor wardrobe. Tis a demon beast that fingers your demise.\" - отсылка ко второй (первой по порядку написания) книге серии \"Хроники Нарнии\" по названием \"Лев, колдунья и платяной шкаф\".","Пророчество Morphling \" No empathy test can save you from the watery replicant.\" - отсылка к книге \"Мечтают ли андроиды об электроовцах?\", где человекоподобные андроиды, называемые \"репликантами\" могли быть выделены из толпы людей только с помощью теста на эмпатию, называемого тестом \"Войта-Кампфа\".","Пророчество герою Faceless Void \" You ought to read Chronosphere of a Death Foretold. It's a prophetic book\" - отсылка к книге \"Хроника объявленной смерти\" написанной Габриэлем Гарсиа Маркесом.","Пророчество герою Ember Spirit \" I foresee four flames.\" возможно, является отсылкам к тому, что большинство фраз Ember Spirit состоят из четырёх слов, либо к \"самим\" Ember Spirit: одному герою и трём его копиям."],"talents":["+2 сек. к длительности False Promise:-5 сек. к перезарядке Fate's Edict","False Promise дает невидимость:+45 к скорости передвижения","-1 сек. перезарядки Purifying Flames:+150 к дальности способностей","+15 к интеллекту:+1 сек. к макс. длительности Fortune's End"],"desc":"Oracle — это герой, с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность — Fortune's End. С её помощью, герой в течение 2.5 секунд создаёт шар энергии, после чего поражает им главную цель, нанося урон противникам и накладывая эффект очищения. Fate's Edict — способность, которая позволяет Oracle накладывать заклятие на героя, что даёт цели 100% защиту от магического урона, а также лишает её возможности атаковать. Целью для этой способности могут быть как враги, так и союзники, которых можно защитить от магических заклинаний и эффектов врагов. С помощью Purifying Flames, герой наносит существенный урон по противнику или союзнику, однако даёт ему дополнительную регенерацию здоровья. Особая способность — False Promise. С её помощью, Oracle \"задерживает\" весь получаемый героем урон и лечение до окончания заклинания, полученное лечение при этом удваивается."}