{"abilities":[{"spell":"Собирает мощь героя в заряд выжигающей энергии, который накладывает оцепенение на цель и врагов вокруг неё, наносит им урон и снимает с них положительные эффекты. Если целью является союзник, то способность только развеет отрицательные эффекты. Длительность оцепенения врагов равна времени применения способности — до 2.5 сек.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Скорость полета снаряда - 1000.","Если целью заклинания выбран союзник, то эффект от способности все равно применится на ближайших врагов. На союзника будет наложено только развеивание. Также можно применить на владельца способности. Накладывает развеивание на всех врагов в радиусе, тогда как союзник получает развеивание только будучи выбранным в качестве цели способности. Таким образом, лишь один союзник может быть очищен за раз.","Всегда снимает эффект Fate's Edict с затронутых целей.","Развеивание применяется до нанесения урона, т.е. сначала снимаются положительные или отрицательные эффекты и лишь затем наносится урон.","Можно напрямую применить к неуязвимым юнитам, даже если урон от способности отрицается неуязвимостью.","Когда снаряд попадает в неуязвимого, находящегося под иммунитетом к заклинаниям или исчезнувшего юнита, то он все равно применяется ко всем юнитам в радиусе вокруг цели.","Произнесение не отменяется, если цель получила иммунитет к заклинаниям, стала невидимой или неуявимой, спряталась или умерла.","Если произнесение прерывается из-за обезвреживания, то снаряд будет выпущен преждевременно.","Урон и эффект развеивания фиксированы, только длительность оцепенения зависит от потраченного на произнесение времени.","Длительность оцепенения начинается с 0.5 секунд и увеличивается на 0.08 ( 0.0857) за каждые 0,1 секунды произнесения, достигая 2.5 ( 3.5) in 2.5 ( 3.5) секунд.","Fortune's End применяет оцепенение к целям, предотвращая их передвижение и использование способностей для перемещения. Дает эффект True Sight на цель, но только в случае, если цель не невидима или не ушла в невидимость до попадания.","Не может ни выбрать, ни воздействовать на на варды и строения.","Создает визуальный эффект на цель во время произнесения способности, показывая, кто был выбран способностью. Этот эффект виден всем.","Звук во время произнесения также слышен всем."],"mana":"75","elements":["Нельзя избежать.","Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"15\/12\/9\/6","name":"Fortune's End","description":["Анимация применения: 0+0","Дальность применения: 850 ( 1000)","Радиус эффекта: 300","Макс. время применения: 2.5 ( 3.5)","Урон: 120\/150\/180\/210","Мин. длительность оцепенения: 0.5","Макс. длительность оцепенения: 2.5 ( 3.5)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Наполняет цель счастьем, обезоруживая ее и даруя сопротивление магии в 100%. Можно применять как на союзников, так и на врагов.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников"],"notes":["Применяет к цели обезвреживание и делает её сопротивление магии равным 100%.","Fate's Edict всегда применяет к цели дебафф, независимо от того враг это или союзник. То есть при выборе союзника Fate's Edict можно развеять базовым развеиванием. При этом при применении этого заклинания на врага Fate's Edict нельзя развеять ничем, кроме Fortune's End."],"mana":"50","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/13\/10\/7 ( 11\/8\/5\/2)","name":"Fate's Edict","description":["Анимация применения: 0,3+1,1","Дальность применения: 500\/600\/700\/800 ( 650\/750\/850\/950)","Длительность: 3\/3.5\/4\/4.5","Сопротивление магии: 100%"],"hot_key":"W","legacy_key":"F"},{"spell":"Выжигает всю скверну цели, нанося ей огромный урон, а затем со временем восстанавливает ее жизненные силы. Количество восстанавливаемого здоровья больше урона. Можно применять как на союзников, так и на врагов.","effects":["Способность Направленная на юнита","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["При использовании урон наносится мгновенно, затем действует периодическое лечение. Уроном можно убить врагов, но не союзников.","Лечит с интервалом в 1 секунду спустя 1 секнуду после применения, срабатывая 9 раз.","Может вылечить до 99\/198\/297\/396 единиц здоровья (9\/18\/27\/36, если учитывать базовый урон (до учета сопротивления)) за применение.","Несколько эффектов лечения от Purifying Flames складываются."],"mana":"80\/85\/90\/95","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"2,25 ( 1)","name":"Purifying Flames","description":["Анимация применения: 0,3+1,1 ( 0.1+1,3)","Дальность применения: 800 ( 950)","Урон: 90\/180\/270\/360","Лечение в секунду: 11\/22\/33\/44","Длительность: 9"],"hot_key":"E","legacy_key":"E"},{"spell":"Отсрочивает судьбу союзника, откладывая любое лечение и получение урона до конца действия этой способности. Любое лечение, примененное во время действия этой способности, удваивается. При применении снимает с цели большинство отрицательных эффектов.","effects":["Способность Направленная на юнита","Действует на Союзных героев","Урон Чистый (Отнимающий здоровье)"],"notes":["При использовании применяет к цели сильное развеивание. Можно применять к иллюзиям и крипам-героям.","False Promise полностью отрицает урон после учета всех сопротивлений, предотвращая срабатывание эффектов, реагирующих на урон.","У False Promise второй по счету приоритет в группе заклинаний, отрицающих урон. Также способность отрицает эффекты лечения. То есть в комбинации с Aphotic Shield или Living Armor False Promise будет отрицать урон, а перечисленные способности - нет. У способности приоритет ниже, чем у Borrowed Time, означая то, что Borrowed Time сначала переведет урон в лечение, а затем лечение будет заблокировано False Promise.","Как и все эффекты, отрицающие урон, False Promise отрицает и откладывает только 3 типа урона. Способность игнорирует урон, отнимающий здоровье (за исключением Heartstopper Aura).","Не предотвращает мгновенную смерть от способностей Culling Blade, Blast Off!, Ice Blast.","False Promise откладывает не только нанесение урона, но и увеличение здоровья героя с некоторыми исключениями. В отличии от отрицания урона, отрицание эффектов лечения действует до любых усилений или уменьшений (например, Ghost Shroud и Ice Blast). False Promise учитывает непосредственно лечение. Другие способы увеличения здоровья не учитываются, хотя их все еще можно предотвратить (например, здоровье, даваемое силой). Не предотвращает увеличение здоровья героя для следующих заклинаний: Howl, Morph Replicate, Supernova, Sunder, Whirling Death, Decay, Time Lapse, Armlet of Mordiggian, Spirit Vessel.","При завершении длительности цель излечивается (проигрывается первый звук), если лечение превысило урон, или получает урон (проигрывается второй звук), если урона было больше. Все полученное лечение складывается в один источник и удваивается. Затем из суммы лечения вычитается каждый источник урона из очереди. Операция будет повторяться до того, пока урон от всех источников не будет отменен, либо пока не закончится сумма лечения. Если сумма лечения закончилась, то нанесутся все оставшиеся в очереди источники урона. Этот урон отмечен как отнимающий здоровье. При этом, если цель умрет, убийство засчитывается тому, чей урон привел к смерти (это может быть как первый или последний источник, так и любой между ними). Нелетальные источники урона, заблокированные во время действия False Promise остаются нелетальными, когда наносятся в конце действия способности. Если все источники урона были отменены, то оставшееся лечение будет применено общим источником к цели. Это лечение всегда приписывается Oracle.","Несмотря на урон, отнимающий здоровье, Shallow Grave может спасти цель от смерти, а Borrowed Time превратит этот урон в лечение.","Если цель стала неуязвимой при истечении действия False Promise, то отложенное лечение и урон будут нанесены при возвращении юниту уязвимости.","Несколько применений на цель не складываются, но обновляют длительность. Заблокированное лечение и урон не сбрасываются.","Если общий урон превышает общее лечение и текущее здоровье цели, то сфера горит красным и испускает огонь, информируя о предстоящей смерти.","Если выбран талант на 20-ом уровне, то способность делает цель невидимой с задержкой в 0,6 секунды. Атака, использование заклинаний или предметов выводят из невидимости и сбрасывают время до невидимости."],"mana":"100","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"100\/65\/30","name":"False Promise","description":["Анимация применения: 0,3+0,97","Дальность применения: 1000 ( 1150)","Задержка до невидимости: 0 ( 0,6)","Отложенное усиление лечения: 100%","Длительность: 8\/9\/10 ( 10\/11\/12)"],"hot_key":"R","legacy_key":"R"}],"bio":"Веками наследникам Великого трона Симурри поставляли оракулов исключительно из Белого инкубатория, что в полых вершинах Гребня фанатиков. Часть суммы оплачивалась при зачатии эмбриона, а остальное — по доставке к Вратам Камнеглавого короля зрелого обученного пророка. Все одобренные оракулы, рождённые и воспитанные Бледными предсказательницами, прикреплены своей физической формой к миру, в котором живёт большинство из нас. Души же их бродят далеко, едва связанные легчайшими астральными пуповинами. Возвращаясь из своих вселенских странствий, пророки вещают слова из огня языками из плоти. Таинственные речи пророков анализируют симуррийские советники, находя в них видения будущего, дипломатические советы и прочую сверхъестественную информацию, приносящую династии Камнеглавых королей победу в любом бою: будь то придворная борьба или битва на настоящем поле брани. И так продолжалось поколениями, Хроника Камнеглавых королей заполнялись именами королей-победителей и покоренных ими земель. Продолжалось до тех пор, пока один оракул, Нериф, не прибыл для служения последнему из владык в каменных шлемах. С самого начала пророчества Нерифа были необычны. Казалось, что они не предсказывали будущее, но вершили его. Странный предсказатель выдавал советы, когда их никто не просил, и неожиданно симуррийцы оказывались ввязаны в конфликты с новыми врагами. Советники, ощущая угрозу своей власти, быстро осознали, что именно последний оракул был источником нежелательных свар. Они потребовали его устранения, попросили предсказательниц забрать бракованного пророка и предоставить достойную замену. Но в зловещем сне Нериф описал гибель Инкубатория, и через несколько часов пришли вести, что страшный обвал погубил древнюю школу. Опасаясь разделить участь Бледных предсказательниц, советники удалились в свои палаты для совещаний, не желая попадаться оракулу на глаза. Камнеглавый король же всегда отличался практичностью. Он посчитал, что его советники излишне осторожны. Такого редкого оракула, подумал король, нужно использовать для расширения владений. Он сместил своих излишне робких советников и приблизил Нерифа. Плохо понимая, как работают таланты пророка, король попросту заявлял о своих желаниях и уговаривал Нерифа, чтобы тот излагал их как предсказания. Сначала всё шло хорошо. Последний из Камнеглавых королей хвалился, что, овладев любимчиком судьбы, он овладел и самой судьбой. Ему следовало обратить внимание на случай, когда накануне вторжения в земли Ненасытного сатрапа он пытался выудить у своего оракула предсказание несомненной победы, но Нериф лишь негромко прошептал: «Любой исход реален». Более твёрдых слов король не смог заставить слететь с его губ. Тем не менее, правитель был уверен в своём войске. Сатрапия не имела выходов к морю, была слабо вооружена и отделена от всех возможных союзников. Слова «любой исход реален» лишь убедили короля в том, что с перевесом в военной мощи его армии было нечего бояться. Конечно, теперь мы знаем, что он должен был понять слова предсказателя более буквально. Даже при тщательном изучении снабжённых комментариями Анналов возможного то, что произошло на поле брани у дворца Ненасытного сатрапа, почти невозможно представить. Похоже, что прямо во время резни битва начала раздваиваться. В каждый решающий момент реальность разделялась и распадалась на осколки. Бойцы, которые шатались и падали на землю, в то же время крепко держались на ногах и смело вступали в бой. Разделилось и сознание солдат, они чувствовали себя и живыми, и мертвыми, существующими и несуществующими. Победа и поражение разделились, и оба исхода ощущалась одновременно обеими сторонами. Вселенная обратилась в зал зеркал, каждое из них бесконечно разбивалось. Обе стороны немедленно охватило безумие. Не в силах осознать состояние единовременных победы и поражения, сознание Камнеглавого короля распалось на лоскуты сумасшествия. Наивному сатрапу досталось не меньше. Противоположные реальности продолжали разделяться снова и снова, как эхо разносились бесконечные варианты развития истории мира, каждый населенный ошеломлёнными жителями, которые вскоре потеряли способность кормить себя, одеваться, защищаться или размножаться обычным способом. Тем не менее, задолго до того, как все последствия случившегося утихли, опасливые симуррийские советники схватили Нерифа, связали его, заткнули рот и вышвырнули с высокой скоростью из своей вселенной на межпространственной барке в надежде заточить его там, где он не сможет им навредить. Конечно, их конец уже был близок. Возможно, наш тоже.","talentsTips":["Золото с таланта является ненадёжным."],"trivia":["Oracle впервые появился в Dota 2 в комиксе \"The Contract\", опубликованном 14 ноября 2014 в официальном блоге Dota 2.","Майк Шапиро (актер, озвучивавший Оракула) также известен за озвучивание Барни Калхоуна и G-Man'а, двух известных персонажей в серии Half-Life. Реплики Оракула \"Играть Prepare for unforeseen consequences\" и \"Играть Is it really that time again?\" ссылаются на те же реплики G-Man'а в Half-Life2: Episode 2 и Half-Life 2 соответственно; биография и в целом способности персонажа так же являются непрямыми отсылками (вполне вероятно, что G-Man и есть Oracle)","Фраза \"Играть Играть Играть So it goes\" - это ссылка на роман \"Бойня номер пять\" Курта Воннегута. В романе эта фраза использовалась пришельцами, известными как Тральфомадорианцы, которые воспринимали все время одинаково.","Реплика \"Играть First blood! Out of fifty possibilities, that was my preferred\" ссылается на то, что может быть 50 вариантов первой крови (каждый из 10 героев может быть убит любым из 5 вражеских героев). Тем не менее, такие варианты, как, например, падение серверов и отмену игры, не учитываются.","Заклинание Оракула Purifying Flames и его фраза \"Играть I must harm to heal.\" могут непосредственно ссылаться на медицинский принцип \"Primum non nocere\", который означает \"Прежде всего не навреди\".","Фраза Играть \"Ask again later.\" отсылка к ответу Волшебного 8-го шара, игрушке якобы предсказывающей будущее.","Пророчество герою Viper \"Играть V is not for visions of victory, but for a victim of a vicious viper.\" - отсылка к цитате: V значит Vendetta","Пророчество Chaos Knight \"Играть Beware the knight who commandingly demands: do you even rift?\" Отсылка к зарубежному интернет-мему \"Do you even lift?\"","Пророчество герою Lion \"Играть Fear neither witch, nor wardrobe. Tis a demon beast that fingers your demise.\" - отсылка ко второй (первой по порядку написания) книге серии \"Хроники Нарнии\" по названием \"Лев, колдунья и платяной шкаф\".","Пророчество Morphling \"Играть No empathy test can save you from the watery replicant.\" - отсылка к книге \"Мечтают ли андроиды об электроовцах?\", где человекоподобные андроиды, называемые \"репликантами\" могли быть выделены из толпы людей только с помощью теста на эмпатию, называемого тестом \"Войта-Кампфа\".","Пророчество герою Faceless Void \"Играть You ought to read Chronosphere of a Death Foretold. It's a prophetic book\" - отсылка к книге \"Хроника объявленной смерти\" написанной Габриэлем Гарсиа Маркесом.","Пророчество герою Ember Spirit \"Играть I foresee four flames.\" возможно, является отсылкам к тому, что большинство фраз Ember Spirit состоят из четырёх слов, либо к \"самим\" Ember Spirit: одному герою и трём его копиям."],"talents":["+2 сек. к длительности False Promise:-5 сек. к перезарядке Fate's Edict","False Promise дает невидимость:+50 к скорости передвижения","+120 золота в минуту:+150 к дальности способностей","+25% к получаемому опыту:+1 сек. к макс. длительности Fortune's End"],"tips":["Все заклинания Oracle прекрасно сочетаются друг с другом Весь урон от Purifying Flames блокируется 100% сопротивлением к магии от Fate's Edict, делая эту способность отличным источником лечения для союзников. Purifying Flames имеет возможность быть снятой с помощью очищения, так что Fortune's End будет снимать эффект лечения, превращая его в сильный нюк, без лечения для врагов Комбинация способностей False Promise, Fate's Edict и Purifying Flames на одном союзнике вылечат его в общей сложности на 198\/396\/594\/792 здоровья после завершения False Promise, что может, фактически, вернуть ему большую часть его здоровья. Способность Fate's Edict в сочетании с Ghost Scepter, Ethereal Blade или способностью Pugna Decrepify даст цели 100% магического сопротивления и 100% защиты от физического урона. Таким образом, ей будут наносить урон только заклинания с чистым типом урона.","Имея в виду то, что у Oracle самая высокая скорость атаки в игре (Выше только у Alchemist на 2 уровне Chemical Rage, повышающие скорость атаки предметы имеют на нём повышенную эффективность. Однако, из-за специфики героя, собирать на него исключительно такие предметы не эффективно, но некоторые могут быть полезны в определённых игровых ситуациях, синергируясь с его способностями: Ethereal Blade, Mask of Madness, Orchid Malevolence","Запомните, что Fortune's End имеет скорость полёта снаряда, в то время как Purifying Flames наносит урон почти мгновенно. Это значит, что вы можете сначала использовать Fortune's End,и во время полёта снаряда использовать Purifying Flames, чтобы полностью заблокировать эффект лечения от Purifying Flames."],"desc":"Oracle — это герой, с дальним типом атаки, основной характеристикой которого является интеллект. Первая способность — Fortune's End. С её помощью, герой в течение 2.5 секунд создаёт шар энергии, после чего поражает им главную цель, нанося урон противникам и накладывая эффект очищения. Fate's Edict — способность, которая позволяет Oracle накладывать заклятие на героя, что даёт цели 100% защиту от магического урона, а также лишает её возможности атаковать. Целью для этой способности могут быть как враги, так и союзники, которых можно защитить от магических заклинаний и эффектов врагов. С помощью Purifying Flames, герой наносит существенный урон по противнику или союзнику, однако даёт ему дополнительную регенерацию здоровья. Особая способность — False Promise. С её помощью, Oracle \"задерживает\" весь получаемый героем урон и лечение до окончания заклинания, полученное лечение при этом удваивается."}