{
  "abilities": [
    {
      "notes": [
        "The armor talent does not benefit illusions.",
        "The strength talent effectively grants Leshrac 400 health and 2 health regeneration.",
        "The magic resistance talent stacks multiplicatively with other sources of magic resistance. Increases Leshrac's magic resistance to 47.5%.",
        "Increases Leshrac's magic resistance to 47.5%."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "+30% Magic Resistance",
          "talentRight": "+30 Diabolic Edict Explosions"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+40 Pulse Nova Damage",
          "talentRight": "+20 Strength"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+25 Movement Speed",
          "talentRight": "+100 Lightning Storm Damage"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+40 Split Earth Radius",
          "talentRight": "+4 Armor"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c9\/Leshrac_Split_Earth.mp3\/revision\/latest?cb=20191216015216",
      "effects": [
        "Ability Target Area",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Split Earth destroys trees within the affected radius.",
        "Split Earth first applies the debuff, then the damage.",
        "Has no visual or audio indicator during the effect delay.",
        "With Aghanim's Shard, Split Earth applies its effect 4 times at the targeted point. The first instance still happens 0.35 seconds after cast. The following instances happen 5.35\/10.35\/15.35 seconds after cast. The visual effect during the delay between the extra instances is visible to everyone. Each instance has the following radius: Level 1: 150\/225\/300\/375 (TagTalent 190\/265\/340\/415) Level 2: 175\/250\/325\/400 (TagTalent 215\/290\/365\/440) Level 3: 200\/275\/350\/425 (TagTalent 240\/315\/390\/465) Level 4: 225\/300\/375\/450 (TagTalent 265\/340\/415\/490)",
        "The first instance still happens 0.35 seconds after cast. The following instances happen 5.35\/10.35\/15.35 seconds after cast.",
        "The visual effect during the delay between the extra instances is visible to everyone.",
        "Each instance has the following radius: Level 1: 150\/225\/300\/375 (TagTalent 190\/265\/340\/415) Level 2: 175\/250\/325\/400 (TagTalent 215\/290\/365\/440) Level 3: 200\/275\/350\/425 (TagTalent 240\/315\/390\/465) Level 4: 225\/300\/375\/450 (TagTalent 265\/340\/415\/490)",
        "Level 1: 150\/225\/300\/375 (TagTalent 190\/265\/340\/415)",
        "Level 2: 175\/250\/325\/400 (TagTalent 215\/290\/365\/440)",
        "Level 3: 200\/275\/350\/425 (TagTalent 240\/315\/390\/465)",
        "Level 4: 225\/300\/375\/450 (TagTalent 265\/340\/415\/490)",
        ""
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "Q",
      "cooldown": "9",
      "description": "Splits the earth under enemies. Deals damage and stuns for a short duration.",
      "spellName": "Split Earth",
      "params": [
        "Cast Animation: 0.7+0.67",
        "Cast Range: 650",
        "Base Radius: 150\/175\/200\/225 (TagTalent 190\/215\/240\/265)",
        "Number of Instances: 1 (TagTalent 4)",
        "Effect Delay: 0.35",
        "Damage: 120\/180\/240\/300",
        "Stun Duration: 2",
        "Radius Increase per Instance: 75",
        "Radius Increase Interval: 5",
        "Causes Split Earth to repeat in the same location three additional times, with a 5 second delay between each one. Each time the radius increases by 75. Split Earth echo location is visible to both teams."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Twisting nature to his vile will, the shifting earth consumes those unlucky enough to cross Leshrac's path."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/65\/Leshrac_Diabolic_Edict.mp3\/revision\/latest?cb=20191216015221",
      "effects": [
        "Ability No Target",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Diabolic Edict's radius is centered on and follows Leshrac.",
        "Randomly selects nearby valid units for each explosion. There are no priorities. Fully affects invisible units and units in the Fog of War. When no valid targets are nearby, the explosions randomly appear within a square with 500 side length. These random explosions deal no damage.",
        "Fully affects invisible units and units in the Fog of War.",
        "When no valid targets are nearby, the explosions randomly appear within a square with 500 side length. These random explosions deal no damage.",
        "Creates explosions in 0.25 (TagTalent 0.14)-second intervals, starting immediately as the ability is cast, resulting in 40 (TagTalent 70) explosions.",
        "Buildings take 11.2\/28\/44.8\/61.6 damage per explosion (before reductions).",
        "Can deal up to 320\/800\/1280\/1760 (TagTalent 560\/1400\/2240\/3080) damage to a single unit. Can deal up to 448\/1120\/1792\/2464 (TagTalent 784\/1960\/3136\/4312) damage to a single building.",
        "Can deal up to 448\/1120\/1792\/2464 (TagTalent 784\/1960\/3136\/4312) damage to a single building.",
        "When Leshrac dies, the explosions still occur at his location.",
        "Multiple instances of Diabolic Edict fully stack."
      ],
      "mana": "95\/120\/135\/155",
      "hotKey": "W",
      "cooldown": "22",
      "description": "Saturates the area around Leshrac with magical explosions that deal physical damage to enemy units and structures. The fewer units available to attack, the more damage those units will take. Deals 40% more damage to towers. Lasts 10 seconds.",
      "spellName": "Diabolic Edict",
      "params": [
        "Cast Animation: 0.5+0.87",
        "Radius: 500",
        "Number of Explosions: 40 (TagTalent 70)",
        "Unit Damage per Explosion: 8\/20\/32\/44",
        "Building Damage Bonus: 40%",
        "Duration: 10"
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": "Chronoptic energy bursts from one plane to the other, evaporating anything it touches."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/9b\/Leshrac_Lightning_Storm.mp3\/revision\/latest?cb=20191216015222",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The lightning hits the initial target after the 0.25-second effect delay and then jumps to other targets in 0.25-second intervals, so hitting all targets takes 1\/1.5\/2\/2.5 seconds.",
        "Because of the effect delay, the initial lightning can be avoided with spell immunity, invulnerability, or becoming hidden. However, this does not prevent it from jumping.",
        "Does not bounce on invisible units, or units in the Fog of War.",
        "Can never hit the same unit twice per cast.",
        "All jumps together can deal up to 360\/780\/1360\/2100 (TagTalent 760\/1380\/2160\/3100) damage (before reductions).",
        "Lightning Storm first applies the damage, then the debuff.",
        "The lightning storm buff is a hidden buff required for the lightning to jump."
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "E",
      "cooldown": "4",
      "description": "Summons a lightning storm that blasts the target enemy unit, then jumps to nearby enemy units. Struck units are slowed by 75% for a duration.",
      "spellName": "Lightning Storm",
      "params": [
        "Cast Animation: 0.3+1.04",
        "Cast Range: 650",
        "Jump Distance: 475",
        "Number of Jumps: 4\/6\/8\/10",
        "Effect Delay: 0.25",
        "Damage: 90\/130\/170\/210 (TagTalent 190\/230\/270\/310)",
        "Move Speed Slow: 75%",
        "Slow Duration: 0.4\/0.6\/0.8\/1",
        "Attempts to damage if enemy turns spell immune during the delay. Slow persists if debuff was placed before spell immunity and when not dispelled.",
        "Blocked fully only when primary target."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": "The Tormented Soul's mastery of the elements is evident in the massive storms that strike down armies before him."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/75\/Leshrac_Nihilism_1.mp3\/revision\/latest?cb=20210109164935",
      "effects": [
        "Ability No Target",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Requires Aghanim's Scepter to be unlocked.",
        "Interrupts Leshrac's channeling abilities upon cast.",
        "Turns Leshrac and all enemies within the radius ethereal, disarming them, rendering them attack immune, and granting 100% physical damage resistance.",
        "Reduces most heroes' total magic resistance to 2.5%, assuming basic 25% magic resistance and no other sources of magic resistance.",
        "Nihilism's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.",
        "The ethereal effect on enemies is provided by an aura, its debuff lingers for 0.5 seconds.",
        "Multiple casts of Nihilism do not stack."
      ],
      "mana": "75",
      "hotKey": "D",
      "cooldown": "25",
      "description": "Causes all nearby enemies in 450 AoE to turn ethereal, preventing them from attacking, causing them to take 30% more magic damage and be slowed by 30% for 4 seconds. Increases Leshrac's speed rather than reducing it. Does not cause you to take amplified damage.",
      "spellName": "Nihilism",
      "params": [
        "Cast Animation: 0+0",
        "Radius: 450",
        "Enemy Magic Resistance Reduction: 30%",
        "Move Speed Change: 30%",
        "Aura Linger Duration: 0.5",
        "Duration: 4",
        "Can be cast while spell immune. However, the buff gets immediately removed if spell immunity is detected. Does not affect spell immune enemies."
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/af\/Leshrac_Pulse_Nova.mp3\/revision\/latest?cb=20200509130123",
      "effects": [
        "Ability Toggle",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "Pulse Nova does not interrupt Leshrac's channeling abilities upon toggling On \/ Off.",
        "Deals damage and drains mana in 1-second intervals, starting immediately upon activating ability. Activating the ability costs 90 mana. However, when having less than 90 mana and toggling on, it will still deal 1 damage instance and then toggle off.",
        "Activating the ability costs 90 mana.",
        "However, when having less than 90 mana and toggling on, it will still deal 1 damage instance and then toggle off.",
        "Fully affects invisible units and units in the Fog of War.",
        "If toggled On, Pulse Nova continues working even when silenced, disabled, or hidden."
      ],
      "mana": "70",
      "hotKey": "R",
      "cooldown": "1",
      "description": "Creates waves of damaging energy around Leshrac, one per second, to damage nearby enemy units. Drains Leshrac's mana with each pulse.",
      "spellName": "Pulse Nova",
      "params": [
        "Cast Animation: 0+0",
        "Damage Radius: 525",
        "Mana Cost per Second: 20\/40\/60",
        "Damage per Second: 100\/150\/200 (TagTalent 140\/190\/240)",
        "Grants a new ability: Nihilism"
      ],
      "itemBehaviour": [],
      "legacyKey": "V",
      "story": "If necessary, the Tormented Soul can manipulate space time itself, ravaging lesser beings."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.5,
    "attrStrength": 20.0,
    "attrIntelligence": 22.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 2.8,
    "attrAgility": 23.0
  },
  "description": "Leshrac, the Tormented Soul, is a ranged intelligence hero who is known for his ability to put out a tremendous amount of area magical damage. His array of spells makes him a dangerous foe to stand around, as he can disable and nuke down anyone who dares to stand against him. Split Earth is an area stun that, after a delay, will stun all enemies in its radius while dealing damage. Diabolic Edict is a damage-over-time spell that deals physical damage, corroding all enemies near Leshrac. Unlike most other spells, it can also affect buildings, making Leshrac a very powerful tower killer who can push very effectively. Lightning Storm is a targeted nuke that damages and slows enemies as it jumps from foe to foe, easily clearing away creeps. His ultimate, Pulse Nova, deals magical damage in an area around Leshrac while it is active, making short work of nearby enemies. Few can withstand Leshrac's damage output, as all of his spells combined allow him to scour his foes from the battlefield.",
  "history": "Leshrac, Tormented Soul, is an entity torn from the heart of nature, a liminal being that exists half in one plane of existence, half in another. His penetrating intelligence is such that he can never ignore for a moment the agonizing horror at the heart of all creation. Once a great philosopher who sought the meaning of existence, he plumbed the depths of nature with the haunted Chronoptic Crystals, and was forever altered by the hideous mysteries thereby revealed to him. Now the darkest depths of his enlightenment are illumined only by the fitful glare of his arrogance. Like other elemental characters, he is completely at one with nature, but in his case it is a nature lurid and vile. He alone sees the evil truth of reality, and has no use for those who believe the cosmos reserves a special reward for those who practice benevolence.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "+30% Magic Resistance",
      "talentRight": "+30 Diabolic Edict Explosions"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+40 Pulse Nova Damage",
      "talentRight": "+20 Strength"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+25 Movement Speed",
      "talentRight": "+100 Lightning Storm Damage"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+40 Split Earth Radius",
      "talentRight": "+4 Armor"
    }
  ]
}