{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/46\/Refresher_Orb.mp3\/revision\/latest?cb=20141214200918",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Применение прерывает произнесение заклинания.",
        "Перезаряжает только предметы, находящиеся в инвентаре владельца. Предметы в рюкзаке, выброшенные из него или в инвентаре других юнитов Refresher Shard не перезаряжает.",
        "Не перезаряжает предметы союзных героев.",
        "Перезаряжает все способности владельца, включая скрытые или неактивные способности (в том числе заклинания Invoker или Battle Cry). Но при этом не обновляет все заклинания для Rubick. Украденные ранее способности перезаряжаются только при наличии их у Rubick в момент перезарядки.",
        "Но при этом не обновляет все заклинания для Rubick. Украденные ранее способности перезаряжаются только при наличии их у Rubick в момент перезарядки.",
        "Также обновляет все заряды для заклинаний с зарядами.",
        "Не обновляет перезарядку таких способностей, как Cloak and Dagger и счетчик гарантированного критического удара\/уклонения для Drunken Brawler.",
        "Визуально сбрасывает перезарядку Tranquil Boots, но отсчет все равно идет.",
        "Не сбрасывает перезарядку Refresher Orb, Ex Machina, Town Portal Scroll или других Refresher Shard.",
        "Нет общего времени перезарядки с Refresher Orb."
      ],
      "mana": null,
      "abilityName": "Reset Cooldowns",
      "cooldown": "200",
      "description": "Сбрасывает время перезарядки всех ваших предметов и способностей.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Refresher Shard полностью передаваем. Несмотря на то, что Refresher Shard нельзя купить, его можно продать за 500 золота. Но сделать это сможет только герой, первый поднявший предмет. Если курьер был первым юнитом, поднявшим Refresher Shard, его никто не сможет продать, даже если он останется в курьере или его возьмет позднее герой.",
    "Несмотря на то, что Refresher Shard нельзя купить, его можно продать за 500 золота. Но сделать это сможет только герой, первый поднявший предмет.",
    "Если курьер был первым юнитом, поднявшим Refresher Shard, его никто не сможет продать, даже если он останется в курьере или его возьмет позднее герой.",
    "Несколько Refresher Shard не собираются вместе, каждый занимает отдельную ячейку инвентаря.",
    "В отличии от Aegis of the Immortal, Refresher Shard не забирается Рошаном."
  ],
  "cost": "Н\/Д",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Выпадает из Рошана",
  "name": "Refresher Shard",
  "description": "В эпоху нескончаемой битвы воля Бессмертного к победе не угасала ни на миг.",
  "trivia": [
    "Иконка и внутриигровая модель предмета основаны на Refresher Orb. Активируемая способность использует тот же звук и визуальные эффекты что и Refresher Orb."
  ],
  "upgradeIn": null,
  "bonuses": null,
  "tips": [
    "Refresher Shard - то же самое, что и Refresher Orb, но с одним зарядом, так что советы для Refresher Orb также работают.",
    "При этом предмет не требует маны для применения и ничего не стоит, что даёт много возможностей для героев, которые, как правило не собирают или не могут собрать Refresher Orb (из-за нехватки маны для его использования, золота для покупки или просто наличия более эффективных вариантов для покупки.)",
    "У Refresher Shard разное время перезарядки с Refresher Orb. Учитывая, что мана для использования предмета не нужна, это дает возможность героям, которые уже имеют Refresher Orb, использовать их заклинания три раза за сражение.",
    "В некоторых случаях будет выгоднее продать Refresher Shard за золото, чтобы приблизить покупку ключевых предметов, нежели его использовать."
  ]
}