{
  "abilities": [
    {
      "name": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "−0,25 сек. интервала у Battery Assault",
          "talentRight": "Невосприимчивость к магии внутри шестерней Power Cogs"
        },
        {
          "talentLvl": "20",
          "talentLeft": "+100 к урону от Rocket Flare",
          "talentRight": "Rocket Flare раскрывает невидимость"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+24 к урону от Battery Assault",
          "talentRight": "+2 к атакам для уничтожения шестерни от Power Cogs"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+60 к сжиганию маны у Power Cogs",
          "talentRight": "–2 сек. перезарядки Rocket Flare"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/26\/Clockwerk_Battery_Assault_1.mp3\/revision\/latest?cb=20191215184902",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "При применении прерывает произносимые заклинания Clockwerk.",
        "Продолжает действовать, даже если герой обезврежен.",
        "Всего выстреливает шрапнелью 16 (TagTalent 24) раз сразу после использования способности.",
        "Может нанести до 320\/720\/1120\/1520 урона без талантов (до уменьшения). Может нанести до 704\/1104\/1504\/1904 урона с выбранным талантом на увеличение урона. Может нанести до 480\/1080\/1680\/2280 урона с выбранным талантом на снижение интервала между выстрелами. Может нанести до 1056\/1656\/2256\/2856 урона при двух выбранных талантах.",
        "Может нанести до 704\/1104\/1504\/1904 урона с выбранным талантом на увеличение урона.",
        "Может нанести до 480\/1080\/1680\/2280 урона с выбранным талантом на снижение интервала между выстрелами.",
        "Может нанести до 1056\/1656\/2256\/2856 урона при двух выбранных талантах.",
        "Выбор таланта на увеличение урона мгновенно обновляет урон, наносимый действующей Battery Assault.",
        "Выбор таланта на снижение интервала между выстрелами не влияет на интервалы уже действующей Battery Assault. Не изменяет интервалы при обновлении действующей способности. Способность должна сначала закончиться.",
        "Не изменяет интервалы при обновлении действующей способности. Способность должна сначала закончиться.",
        "Каждая шрапнель сначала наносит урон, затем применяет дебафф.",
        "Наносит урон существам в тумане войны, но не действует на невидимых, неуязвимых и исчезнувших существах.",
        "Бафф от нескольких применений Battery Assault не складывается, но обновляет длительность."
      ],
      "mana": "100",
      "item_behaviour": [],
      "name": "Battery Assault",
      "cooldown": "24\/22\/20\/18",
      "description": "Выпускает высокомощную шрапнель в случайных существ неподалёку, нанося им незначительный магический урон и ненадолго их оглушая.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Радиус: 275",
        "Интервал выстрелов: 0,7 (TagTalent 0,45)",
        "Урон за шрапнель: 20\/45\/70\/95 (TagTalent 44\/69\/94\/119)",
        "Длительность оглушения: 0,1",
        "Длительность: 10,5"
      ],
      "legacy_key": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/34\/Clockwerk_Power_Cogs_1.mp3\/revision\/latest?cb=20191215184910",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Шестерни всегда размещаются одинаково. 8 шестерней располагаются так, что образуют круг вокруг Clockwerk. Центр круга остаётся пустым. Каждая шестерня появляется на расстоянии 215 единиц от Clockwerk, эффективно блокируя радиус в 255 единиц благодаря своим размерам столкновения. Все шестерни располагаются на расстоянии 164,5 единиц друг от друга. Вместе с их размером столкновения промежуток между шестернями составляет 4,5 единицы. То есть любое существо, оказавшееся внутри круга из шестерней, не сможет выбраться, если оно не имеет беспрепятственное перемещения.",
        "8 шестерней располагаются так, что образуют круг вокруг Clockwerk. Центр круга остаётся пустым.",
        "Каждая шестерня появляется на расстоянии 215 единиц от Clockwerk, эффективно блокируя радиус в 255 единиц благодаря своим размерам столкновения.",
        "Все шестерни располагаются на расстоянии 164,5 единиц друг от друга. Вместе с их размером столкновения промежуток между шестернями составляет 4,5 единицы.",
        "То есть любое существо, оказавшееся внутри круга из шестерней, не сможет выбраться, если оно не имеет беспрепятственное перемещения.",
        "Шестерня отталкивает первое вражеское существо, которое подошло к ней на расстояние 185 снаружи. Шестерня может ударить только один раз.",
        "Шестерни ударяют только тех существ, которые имеют ману (например, крипа-мага). Существам без запаса маны удар шестерней не наносится (к примеру, Рошан).",
        "Удар шестерни не требует обзора, она может атаковать невидимых существ и врагов в тумане войны.",
        "Удар отбрасывает существо назад на дистанцию в 300 единицы со скоростью в 300 единиц за 1 секунды.",
        "Существа отбрасываются назад в том же направлении, с которого они затронули шестерню.",
        "Во время отбрасывания назад существо полностью обезврежено. Нанесение урона и потеря маны происходят после окончания отбрасывания. Сначала наносится урон, затем сжигается мана.",
        "Нанесение урона и потеря маны происходят после окончания отбрасывания. Сначала наносится урон, затем сжигается мана.",
        "Не ударяет существ, которые ранее уже были затронуты эффектом принудительного движения от других источников, исключая Force Staff и Hurricane Pike.",
        "Несмотря на то, что удары наносят шестерни, источником эффектов (урона, сжигания маны, отталкивания) ялвяется Clockwerk, а не шестерня.",
        "Отталкиваемые враги уничтожают задетые деревья.",
        "Хотя шестерня имеет 100 единиц здоровья, атака по ней наносит 0 единиц урона. Полоска здоровья тоже не меняется при атаке шестерни.",
        "Существа, которые не находятся под контролем любого из игроков, не пытаются обойти шестерни, а просто идут на них, как будто их вообще нет. Фактически это заставляет их застревать в шестернях до тех пор, пока они не сменят направление (например, если их отвлечёт другое существо).",
        "Фактически это заставляет их застревать в шестернях до тех пор, пока они не сменят направление (например, если их отвлечёт другое существо).",
        "Также союзники могут атаковать и разрушать\/добивать шестерни, при этом им нужно сделать столько же атак, сколько и врагам. Только Clockwerk может уничтожить шестерни с одного удара.",
        "Только Clockwerk может уничтожить шестерни с одного удара.",
        "При получении таланта 25-го уровня, создаётся аура в центре шестерней, радиус которой составляет 225. Аура даёт иммунитет к заклинаниям заклинателю. Другие существа под его контролем не будут получать того же бонуса. Аура всегда длится столько же, сколько должны существовать шестерни. Если их всех уничтожить, то аура продолжит действовать. Эффект ауры задерживается на 0,5 сек.",
        "Аура даёт иммунитет к заклинаниям заклинателю. Другие существа под его контролем не будут получать того же бонуса.",
        "Аура всегда длится столько же, сколько должны существовать шестерни. Если их всех уничтожить, то аура продолжит действовать.",
        "Эффект ауры задерживается на 0,5 сек."
      ],
      "mana": "80",
      "item_behaviour": [],
      "name": "Power Cogs",
      "cooldown": "15",
      "description": "Создаёт вокруг героя барьер из заряженных шестерней, захватывая в ловушку всех ближайших существ. Шестерни отталкивают коснувшихся их снаружи врагов, сжигая здоровье и ману. Сработавшие шестерни отключаются. Враги могут уничтожить шестерню несколькими атаками, а владельцу способности на это требуется один удар.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,2+0,5",
        "Радиус появления шестерней: 215",
        "Количество шестерней: 8",
        "Атак для уничтожения: 2 (TagTalent 4)",
        "Радиус для отталкивания: 185",
        "Урон: 50\/125\/200\/275",
        "Сжигание маны: 50\/80\/110\/140 (TagTalent 110\/140\/170\/200)",
        "Дальность отталкивания: 300",
        "Длительность отталкивания: 1",
        "Длительность: 5\/6\/7\/8",
        "Радиус невосприимчивости к магии: 225",
        "Длительность задержки ауры: 0,5",
        "Сжигает ману и применяет урон, если дебафф был применен до иммунитета к заклинаниям и не был развеян."
      ],
      "legacy_key": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/da\/Clockwerk_Rocket_Flare_1.mp3\/revision\/latest?cb=20191215184914",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета ракеты — 2250.",
        "Дает летающий обзор в радиусе 600 единиц на 1 секунду во время полета и на 6 секунд после приземления в выбранной области. При выборе таланта 20-го уровня также даёт в выбранной области радиусом 600 единиц эффект раскрытия невидимости на 10 секунд. Эффект раскрытия невидимости предоставляется в виде ауры, которая влияет на врагов. Дебафф задерживается на 10 сек. Не может раскрыть Eyes In The Forest. Выбор таланта даст эффект раскрытия невидимости уже летящим ракетам. Однако уже долетевшие и взорвавшиеся ракеты не получат эффекта раскрытия невидимости.",
        "При выборе таланта 20-го уровня также даёт в выбранной области радиусом 600 единиц эффект раскрытия невидимости на 10 секунд.",
        "Эффект раскрытия невидимости предоставляется в виде ауры, которая влияет на врагов. Дебафф задерживается на 10 сек.",
        "Не может раскрыть Eyes In The Forest.",
        "Выбор таланта даст эффект раскрытия невидимости уже летящим ракетам. Однако уже долетевшие и взорвавшиеся ракеты не получат эффекта раскрытия невидимости.",
        "Однако уже долетевшие и взорвавшиеся ракеты не получат эффекта раскрытия невидимости.",
        "Ракету можно увидеть на мини-карте. Для союзников она отображается зелёным, для врагов — красным (для этого им нужен обзор)."
      ],
      "mana": "35\/40\/45\/50",
      "item_behaviour": [],
      "name": "Rocket Flare",
      "cooldown": "20\/18\/16\/14 (TagTalent 18\/16\/14\/12)",
      "description": "Выпускает сигнальную ракету в любую точку карты. Ракета взрывается в указанной зоне, нанося урон противникам и давая обзор данной зоны в течение 6 секунд.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: Глобальная",
        "Радиус: 600",
        "Урон: 80\/120\/160\/200 (TagTalent 180\/220\/260\/300)",
        "Длительность обзора: 6",
        "Длительность True Sight: 10",
        "Длительность задержки ауры True Sight: 0,5"
      ],
      "legacy_key": "R",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/0f\/Clockwerk_Overclocking_1.mp3\/revision\/latest?cb=20191215184907",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Для разблокироваки требуется Aghanim's Scepter. В режиме Ability Draft способность может быть разблокирована игроком выбравшим Hookshot.",
        "В режиме Ability Draft способность может быть разблокирована игроком выбравшим Hookshot.",
        "При применении прерывает произносимые заклинания Clockwerk.",
        "Сбрасывает перезарядки заклинаний, но не предметов.",
        "Оглушение нельзя чем-либо избежать — оно применится даже под действием неуязвимости или исчезновения. На длительность оглушения не влияет сопротивление эффектам.",
        "На длительность оглушения не влияет сопротивление эффектам.",
        "Повторное применение обновит длительность дебаффа, но не сбросит перезарядки."
      ],
      "mana": "150",
      "item_behaviour": [],
      "name": "Overclocking",
      "cooldown": "60",
      "description": "Сбрасывает перезарядку всех способностей и на время ускоряет передвижение и атаку. После окончания эффекта оглушает владельца.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0+0",
        "Доп. скорость движения: 30%",
        "Доп. скорость атаки: 200",
        "Длительность: 8",
        "Длительность оглушения: 4"
      ],
      "legacy_key": "F",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/09\/Clockwerk_Jetpack_1.mp3\/revision\/latest?cb=20201224171015",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Себя"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки. В режиме Ability Draft способность может быть разблокирована игроком выбравшим Hookshot.",
        "В режиме Ability Draft способность может быть разблокирована игроком выбравшим Hookshot.",
        "Пока Jetpack активен, герою не требуется поворачиваться для применения способностей и предметов.",
        "75 градусов\/сек. эквивалентны скорости поворота, равной 0,039.",
        "Clockwerk может поворачиваться не более 1 секунды после получения приказа. Это значит, что один приказ не будет вынуждать героя кружить вокруг точки. Конечный путь Clockwerk зависит от вектора, началом которого является изначальное местоположение Clockwerk, а концом — место, куда был отдан приказ. Вектор траектории будет коллинеарным (параллельным) этому вектору",
        "Конечный путь Clockwerk зависит от вектора, началом которого является изначальное местоположение Clockwerk, а концом — место, куда был отдан приказ. Вектор траектории будет коллинеарным (параллельным) этому вектору",
        "Clockwerk не обезврежен во время полёта и может использовать все способности и предметы. Применение Hookshot заканчивает действие Jetpack сразу после начала перемещения героя на крюке. Не прекращает полёт, если герой промахнулся.",
        "Применение Hookshot заканчивает действие Jetpack сразу после начала перемещения героя на крюке. Не прекращает полёт, если герой промахнулся.",
        "Скорость полёта равна скорости перемещения Clockwerk."
      ],
      "mana": "75",
      "item_behaviour": [],
      "name": "Jetpack",
      "cooldown": "16",
      "description": "Герой взмывает в небо. получая перемещение и обзор в полёте. Скорость передвижения увеличивается на 20%, но герой не может атаковать и имеет уменьшенную скорость поворота. Длится 6 сек. или до применения способности Hookshot.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0+0,53",
        "Скорость поворота в градусах\/сек.: 75",
        "Увеличение скорости передвижения: 20%",
        "Длительность: 6",
        "Может быть применено во время оцепенения. Герой взлетит в воздух и получит летающий обзор, но не сможет двигаться и будет медленнее поворачиваться.",
        ""
      ],
      "legacy_key": "G",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/8\/8c\/Clockwerk_Hookshot_1.mp3\/revision\/latest?cb=20191215184903",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя \/ Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Скорость полета крюка 4000\/5000\/6000, требуется 0,5 секунды, чтобы ему достигнуть максимальной длины.",
        "Когда крюк цепляется за существо, Clockwerk притягивается к нему с той же скоростью, с которой крюк летит к цели.",
        "В момент притягивания на Clockwerk действует безмолвие и обезоруживание, предотвращая атаки и использование им способностей. Можно использовать предметы.",
        "Притягивание отменяется, когда Clockwerk попадает под действие других источников принудительного движения.",
        "Clockwerk притягивается в направлении текущего местоположения выбранного существа, а не к месту, где оно изначально находилось. То есть, если цель переместилась или её передвинули, то траектория притягивания Clockwerk мгновенно изменится. Притягивание максимально занимает 0,5 секунды, поэтому если цель переместилась слишком далеко, то Clockwerk не сможет полностью до неё дотянутся.",
        "То есть, если цель переместилась или её передвинули, то траектория притягивания Clockwerk мгновенно изменится.",
        "Притягивание максимально занимает 0,5 секунды, поэтому если цель переместилась слишком далеко, то Clockwerk не сможет полностью до неё дотянутся.",
        "Область урона и оглушения вокруг Clockwerk срабатывает всегда вне зависимости от того, кого зацепил крюк - союзника или врага.",
        "При цеплянии за союзника он не оглушается и продолжает действовать как обычно. Не прерывает его действия.",
        "При цеплянии за врага он оглушается на 1,5\/1,75\/2 секунды или до момента приближения Clockwerk. То есть, если Clockwerk не притянулся к врагу, то враг оглушается только один раз. Это может произойти, если притягивание отменилось или цель передвинулась слишком далеко, пока длилось притягивание.",
        "То есть, если Clockwerk не притянулся к врагу, то враг оглушается только один раз.",
        "Это может произойти, если притягивание отменилось или цель передвинулась слишком далеко, пока длилось притягивание.",
        "Враг, за которого зацепились, также получит урон от области урона\/оглушения. То есть выбранная цель оглушается на 0,5 дольше, чем вторичные цели, поскольку на неё действует и базовое оглушение от крюка.",
        "То есть выбранная цель оглушается на 0,5 дольше, чем вторичные цели, поскольку на неё действует и базовое оглушение от крюка.",
        "Игнорирует курьеров."
      ],
      "mana": "150",
      "item_behaviour": [],
      "name": "Hookshot",
      "cooldown": "60\/45\/30",
      "description": "Быстро выпускает захватное устройство в указанном направлении. Если крюк попадает в живое существо, герой запускает себя в цель, оглушая её и нанося урон. Любые враги, с которыми герой сталкивается по пути, также получают урон и оглушаются.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 2000\/2500\/3000",
        "Максимальная дистанция: 2000\/2500\/3000",
        "Радиус захвата: 125",
        "Радиус получения оглушения и урона: 175",
        "Урон: 75\/175\/275",
        "Длительность оглушения: 1,5\/1,75\/2",
        "Дарует новую способность: Overclocking.",
        "Дарует новую способность: Jetpack."
      ],
      "legacy_key": "T",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 3.5,
    "attrStrength": 26.0,
    "attrIntelligence": 18.0,
    "attrIntelligenceInc": 1.5,
    "attrAgilityInc": 2.3,
    "attrAgility": 13.0
  },
  "description": "Clockwerk — это герой характеристики сила с ближним типом атаки. Clockwerk известен как один из самых разносторонних инициаторов-ганкеров в игре. Широкий спектр обезвреживающих способностей позволяет Clockwerk сеять хаос среди врагов и ломать их построение, давая своей команде большое преимущество в любой схватке. Его первая способность, Battery Assault, производит выстрел высокомощной шрапнелью в случайных ближайших существ, нанося незначительный магический урон и ненадолго оглушая. Вторая способность, Power Cogs, создает барьер из заряженных шестерней вокруг Clockwerk, захватывая в ловушку всех ближайших существ. Враги вне ловушки, пытаясь дотронуться до шестеренок, будут отбрасываться назад, теряя здоровье и ману. Нанесшие удар шестерни отключаются. Враги могут уничтожить шестерню за 2 удара, самому Clockwerk на это требуется один удар. Третьей способностью, Rocket Flare, герой выпускает сигнальную ракету в любую точку карты. Ракета взрывается в указанной зоне, нанося урон противникам и давая обзор данной зоны. Ультимативная способность, Hookshot, запускает захват в указанном направлении. Если крюк попадает в живое существо, Clockwerk запускает себя в цель, оглушая ее и нанося урон. Любые враги, с которыми Clockwerk сталкивается по пути, получают урон и оглушение. Немногие способны сбежать от Clockwerk, если он положит на них свой глаз, и его козни дают ему репутацию сильного союзника, которому рады в любой команде.",
  "history": "Ратлтрап — выходец из того же многочисленного народа, что и Кардел с Боушем, и он тоже возмещает свою низкорослость механическими приспособлениями и хитростью ума. Сын сына часовщика, Ратлтрап много лет учился ремеслу отца — до тех пор, пока война не сошла с гор и не унесла из равнинных поселений мирные профессии. «Теперь твоё ремесло — война», — сказал ему умирающий отец, пока деревня их прадедов дымилась, обугленная и сожжённая. Плох тот ремесленник, что винит свои инструменты, и Ратлтрап никогда не искал отговорок. Похоронив отца в руинах деревни, он устремился превратить себя в величайшее орудие войны всех миров и времён. Он поклялся, что его больше никогда не застанут врасплох — и соорудил, используя свои знания, механические доспехи, в сравнении с которыми снаряжение иноземцев было подобно консервным банкам. Теперь Ратлтрап не расстаётся со своими устройствами — некрупный, но смертоносный воин, достигший невероятных вершин в искусстве засад и разрушений. Он промышляет смертью, быстро прекращает жизнь неподготовленных противников с помощью своих творений и несёт знамя нового слова в военном ремесле. Который час? Час часовщика!",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "−0,25 сек. интервала у Battery Assault",
      "talentRight": "Невосприимчивость к магии внутри шестерней Power Cogs"
    },
    {
      "talentLvl": "20",
      "talentLeft": "+100 к урону от Rocket Flare",
      "talentRight": "Rocket Flare раскрывает невидимость"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+24 к урону от Battery Assault",
      "talentRight": "+2 к атакам для уничтожения шестерни от Power Cogs"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+60 к сжиганию маны у Power Cogs",
      "talentRight": "–2 сек. перезарядки Rocket Flare"
    }
  ]
}