{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/08\/Overwhelming_Blink_Overwhelming_Blink_1.mp3\/revision\/latest?cb=20210120233510",
      "effects": [
        "Дальность применения: Глобальная",
        "Макс. расстояние телепортации: 1200",
        "Неполное расстояние телепортации: 960",
        "Радиус: 800",
        "Базовый урон: 100",
        "Урон от силы: 150%",
        "Замедление скорости передвижения: 50%",
        "Замедление скорости атаки: 50",
        "Длительность замедления: 6",
        "Перезарядка при получении урона: 3"
      ],
      "notes": [
        "При применении позволяет избежать снаряды.",
        "Не перемещает на полное расстояние, если выбрана точка в пределах максимального расстояния.",
        "Если применить предмет дальше, чем позволяет способность, дальность перемещения составит 960 вместо 1200. Двойной щелчок по предмету переместит владельца в сторону союзного фонтана, используя неполное расстояние телепортации.",
        "Двойной щелчок по предмету переместит владельца в сторону союзного фонтана, используя неполное расстояние телепортации.",
        "Второй звук проигрывается, если расстояние телепортации превышает 960. Он слышен всем.",
        "В области действия сперва применяется дебафф, затем урон.",
        "Урон, превышающий 0 от любого игрока (включая союзников, но исключая себя) или Рошана, запускает перезарядку в 3 сек. Поскольку урон запускает перезарядку, а не отключает предмет, то её можно сбросить с помощью Refresher Orb, Refresher Shard и Rearm. При этом на зарядку не влияют Octarine Core или Руна волшебства. Не отключается от урона, отмеченного как отнимающий здоровье.",
        "Поскольку урон запускает перезарядку, а не отключает предмет, то её можно сбросить с помощью Refresher Orb, Refresher Shard и Rearm.",
        "При этом на зарядку не влияют Octarine Core или Руна волшебства.",
        "Не отключается от урона, отмеченного как отнимающий здоровье.",
        "Делит перезарядку с Blink Dagger, Swift Blink и Arcane Blink. Не делит перезарядку с Fallen Sky.",
        "Не делит перезарядку с Fallen Sky."
      ],
      "mana": "0",
      "abilityName": "Overwhelming Blink",
      "cooldown": "15",
      "description": "Мгновенно перемещает к указанной точке на расстоянии до 1200 После перемещения наносит урон, равный 6 + 3 от силы владельца, всем врагам в радиусе 100 и замедляет их передвижение на 150%, а атаку — на 50%. Замедление действует 50 сек. Предмет нельзя использовать, если последние 3 сек. его владелец получал урон от вражеских героев или Рошана.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "6800",
  "lore": null,
  "consistFrom": [
    "Blink Dagger",
    "Reaver",
    "Recipe"
  ],
  "name": "Overwhelming Blink",
  "description": "Редкий смертный удержит в руках этот ужасающий книжал, выкованный в чреве хаоса.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}