{"abilities":[{"effects":["Дальность применения: Глобальная","Минимальное расстояние прицеливания на строение: 70","Максимальное расстояние прицеливания на строение: 575","Время первого произнесения: 3","Время второго произнесения: 5","Увеличение времени последующих произнесений: 0,5","Радиус проверки недавней телепортации: 1150","Длительность проверки недавней телепортации: 25"],"notes":["Двойное нажатие на предмет на расстоянии не менее 1500 единиц от фонтана команды автоматически выберет его целью.","Если несколько героев телепортируются в одну точку в пределах длительности проверки телепортации, то длительность произнесения увеличивается за каждого героя. Первое произнесение займет 3, второе — 5, все последующие будут длиться на 0,5 секунды дольше предыдущего. Учитывает только телепортацию в радиусе 1150 от башен. Телепортация вне радиуса башни не увеличивают длительность произнесения. Учитывает телепортацию только от Town Portal Scroll. Остальные источники телепортации (в том числе Boots of Travel) игнорируются. Телепортация не обязательно должна быть успешной. Отмененные телепорты все равно учитываются и увеличивают длительность произнесения.","При выборе целью точку дальше союзных построек, телепортирует к ближайшей постройки в радиусе 575 от постройки. При выборе святыни вне базы максимальная дистанция равна 250.","Телепортация позволяет избегать снаряды.","Во время произнесения место телепортации обозначается визуальным эффектом, использующим цвет игрока, и проигрывается звук.","Эффект и звук видны и слышны всем. Визуальный эффект также виден при телепортации невидимого врага.","Также отмечает точку на миникарте для союзников. Отметка того же цвета, что и сам игрок, и существует всю длительность произнесения.","Во время произнесения дает летающий обзор в радиусе 200 в месте назначения — даже если телепортация была отменена. Обзор задерживается на 1 секунду.","Телепортация не отменяется, если выбранное строение было разрушено до завершения произнесения.","Не делит перезарядку с Boots of Travel. При этом телепортация с помощью Boots of Travel добавляет к перезарядке Town Portal Scroll 10 секунд (даже если предмет был готов к применению)."],"elements":["Способность Направленная на точку \/ Произносимая","Действует на Себя"],"description":"После 3 сек. произнесения заклинания, телепортирует героя к выбранной союзной постройке. При двойном нажатии телепортирует к фонтану своей команды."}],"cost":"50","description":"То, что нужно истинному герою.","attrs":["Активируемая Teleport","Зарядов 1","Можно разобрать? Нет","Можно сообщать? Нет"],"info":["Town Portal Scroll имеет отдельную ячейку в инвентаре героя и его нельзя выкинуть.","Герои начинают игру с бесплатным непродаваемым Town Portal Scroll. С начала игры у предмета идет перезарядка в 100 секунд.","Складывается в инвентаре с такими же предметами без ограничения. Цена продажи адаптируется к количеству предметов в слоте.","Town Portal Scroll — полностью передаваемый предмет.","Удерживание клавиши Alt показывает иконку со статусом телепорта под каждым портретом союзного героя в верхней части экрана. Иконка отображает текущую перезарядку телепортов. Если у союзника нет предмета для телепортации, то иконка не появляется. Если предмет находится в ранце, то его иконка бледнее. Приоритет отображения предметов в иконке: приоритет Boots of Travel выше, чем Town Portal Scroll и Boots of Travel 2-го уровня над Boots of Travel 1-го. В иконке не отображаются другие способности телепортации."]}