{
  "abilities": [
    {
      "notes": [
        "Interrupts Razor's channeling abilities upon cast",
        "Plasma Field expands and retracts at a speed of 636, taking a total of 2.2 seconds to fully expand and retract",
        "Plasma Field is centered on Razor for the full duration\n Provides 700 radius flying vision during the 4.4-second effect, following Razor and leaving a trail of vision which lasts 2 seconds",
        "The effect area is a 100 range wide annulus, a ring shape\n The ring starts 105 range away from Razor and expands for up to 700 range, reaching a total distance of 805\n Together with the damage width, it can hit units up to 905 range away",
        "The visual effect starts at Razor's location and expands for the same distance\n This means the visual effect is 105 range behind the damaging ring, and not centered on it",
        "The damage and movement speed slow are applied upon expanding and upon retracting, so each enemy can be hit twice\n However, enemies can only be affected once upon expanding and once upon retracting\n Although the slow debuff fully stacks, their durations are independent from each other\n With the radius, expanding and retracting speed, enemies within 477 range of Razor can be slowed for the max duration of 3 seconds\n It can be avoided by teleporting (e.g\n  Return) towards the expanding or retracting side over the ring after being affected\n Does not affect invisible units",
        "Can deal up to 70\/80\/90\/100 ‒ 160\/230\/300\/370 ( 130\/140\/150\/160 ‒ 220\/290\/360\/430) damage (before reductions) and slow for up to 10% ‒ 50%\/60%\/70%\/80% movement speed",
        "Plasma Field first applies the damage, then the debuff",
        "The damage and movement speed slow values are based on how far the ring traveled, reaching max values at 805 range\n 105 Distance: 35\/40\/45\/50 ( 65\/70\/75\/80) damage and 5%\/5%\/5%\/5% slow\n 205 Distance: 41\/51\/60\/69 ( 71\/81\/90\/99) damage and 8%\/9%\/9%\/10% slow\n 305 Distance: 48\/61\/75\/89 ( 78\/91\/105\/119) damage and 11%\/12%\/14%\/15% slow\n 405 Distance: 54\/72\/90\/108 ( 84\/102\/120\/138) damage and 14%\/16%\/18%\/20% slow\n 505 Distance: 61\/83\/105\/127 ( 91\/113\/135\/157) damage and 16%\/19%\/22%\/25% slow\n 605 Distance: 67\/94\/120\/146 ( 97\/124\/150\/176) damage and 19%\/23%\/26%\/30% slow\n 705 Distance: 74\/104\/135\/166 ( 104\/134\/165\/196) damage and 22%\/26%\/31%\/35% slow\n 805 Distance: 80\/115\/150\/185 ( 110\/145\/180\/215) damage and 25%\/30%\/35%\/40% slow\n 905 Distance: 80\/115\/150\/185 ( 110\/145\/180\/215) damage and 25%\/30%\/35%\/40% slow.",
        "TALENT NOTES Plasma Field now passively casts another instance after 0.8-seconds upon cast\n The passive cast does not trigger the cooldown and work while on cooldown, does not cost mana and works while Razor is disabled\n Other Plasma Field notes fully apply"
      ],
      "item_behaviour": [],
      "description": "Releases a wave of energetic plasma that grows in power as it expands, but also zaps on contraction, slowing and dealing damage to enemy units caught in its path. Damage and slow increases with distance from Razor. The Plasma Field hits each unit twice, once each direction.",
      "hot_key": "Q",
      "params": [
        "Cast Animation:  0+0",
        "Max Extension Radius: 700",
        "Damage Width: 100",
        "Min Damage: 35\/40\/45\/50 ( 65\/70\/75\/80)",
        "Max Damage: 80\/115\/150\/185 ( 110\/145\/180\/215)",
        "Min Move Speed Slow: 5%",
        "Max Move Speed Slow: 25%\/30%\/35%\/40%",
        "Slow Duration: 1.5",
        "Second Activation Delay:  0.8"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/1e\/Razor_Plasma_Field_1.mp3\/revision\/latest?cb=20191216022243",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Magical"
      ],
      "mana": "13\/12\/11\/10",
      "aghanim": null,
      "name": "Plasma Field",
      "cooldown": "125",
      "legacy_key": "F",
      "story": "The Lightning Revenant rules the Underscape with plasmatic power."
    },
    {
      "notes": [
        "Static Link is broken when either unit dies or the link gets stretched more than 800 range\n Nothing else can break the link\n The distance between Razor and the target is checked right before each damage steal interval\n If the distance is greater upon the check, the link breaks\n Since the link uses the ability's cast range, cast range increasing effects increase the link break distance and the move while attacking distance as well",
        "Provides shared vision over the target while draining",
        "Grants regular flat bonus attack damage to Razor while reducing the affected target's total attack damage\n Static Link keeps stealing damage even if the target's damage has reached 0",
        "Drains 1.05\/1.8\/2.55\/3.3 ( 1.8\/2.55\/3.3\/4.05) damage and attack speed in 0.15-second intervals, starting 0.15 seconds after cast, resulting in 34\/40\/47\/54 instances\n However, the values drained in 0.15-second intervals are not even\n Since decimals are not shown in the HUD, it can drain up to 34\/72\/117\/174 ( 84\/132\/186\/254) damage and attack speed when draining for the full duration",
        "Static Link orders Razor to attack the target upon cast, and upon each move order\n Allows Razor to move while attacking the Static Link target\n Razor still is facing the Static Link target while attacking, despite sometimes the attack animation showing otherwise\n To not attack the target while moving, a unit-targeted order or a ground-targeted order that is not a move or attack order must be given to Razor\n If auto-attack is set to ◎ Never, the stop (S) and hold (H) commands also stop Razor from attacking the target",
        "Can be cast on heroes, illusions and creep-heroes\n Fully affects already linked targets even when they turn invulnerable and hidden",
        "For  melee units, if the enemy target is farther than 350 range more than the attacker's range, the attack will always miss",
        "Static Link cannot be successively cast on units that already have attack damage drained\n This means it is impossible for one enemy to have multiple separate attack damage debuffs, except when interacting with  Soulbind\n However, it is possible to drain attack damage from multiple separate targets at the same time\n The attack damage buff on Razor fully stacks\n When targeting multiple enemies, only the first targeted enemy may be attacked while moving\n SOULBIND If any of the targets dies, or when any of the links is broken, Razor attacks the currently linked target\n Can be cast multiple times on the primary target, but not on the secondary target\n The link does not break upon the leash debuff expiring"
      ],
      "item_behaviour": [],
      "description": "Creates a charged link between Razor and an enemy Hero, stealing damage from the target and giving it to Razor. Allows Razor to attack while moving with the link active.",
      "hot_key": "W",
      "params": [
        "Cast Animation: 0.3+0",
        "Cast Range:  550",
        "Link Break Distance:  800",
        "Attack Damage Change per Second: 7\/12\/17\/22 ( 12\/17\/22\/27)",
        "Link Duration: 5\/6\/7\/8",
        "Buff Duration: 15\/16\/17\/18",
        "Attack Speed Change Percentage:  100%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f2\/Razor_Static_Link.mp3\/revision\/latest?cb=20191216022229",
      "effects": [
        "Ability: Target Unit",
        "Affects: Enemy Heroes"
      ],
      "mana": "40\/35\/30\/25",
      "aghanim": null,
      "name": "Static Link",
      "cooldown": "65",
      "legacy_key": "C",
      "story": "Razor's polarity channels electricity into his being, draining the power of his opposition."
    },
    {
      "notes": [
        "SHARD NOTES The Forked Lightning procs Globally on valid enemy targets in the following conditions: Whenever a unit, including wards, lands an attack on Razor, following Storm Surge's spell immunity notes\n On allied attacks\n Doing so applies only the movement speed slow on the proccing ally, but it still chooses enemies as secondary targets\n Triggers Globally on every unit-targeted ability cast on Razor, including ground-targeted abilities with unit-targeting option\n It neither follows the Spell Reflection list, nor the Spell Block list\n Projectile-based abilities trigger it on launch, not on impact\n Forked Lightning is applied after the triggering ability takes effect\n This means if the casting unit dies to the Forked Lightning's damage, the triggering ability still takes effect",
        "Does not proc on the following conditions: Attacks from buildings\n On missed attacks",
        "SHARD NOTES Forked Lightning's search radius is centered around the primary target (i.e\n the triggering unit), and not around Razor\n If the primary target is or turns spell immune, invulnerable or hidden, the forked lightning searches for 3 secondary targets in this case\n The primary target can still be affected by Forked Lightning while invisible or untargetable\n The secondary targets are chosen randomly within 900 radius centered around the primary target, there are no priorities\n If triggered by an attack, it does not target invisible and untargetable units or units inside the Fog of War as secondary targets\n If triggered by ability, it does target invisible units or units inside the Fog of War",
        "The forked lightning first applies the damage, then the debuff",
        "The forked lightning proc chance uses pseudo-random distribution"
      ],
      "item_behaviour": [],
      "description": "Passively increases your movement speed.",
      "hot_key": "E",
      "params": [
        "Self Move Speed Bonus: 6%\/12%\/18%\/24% ( 27%\/33%\/39%\/45%)",
        "Forked Lightning Proc Chance:  18%",
        "Search Radius:  900",
        "Number of Targets:  3",
        "Damage:  175",
        "Enemy Move Speed Slow:  50%",
        "Slow Duration:  1.5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b6\/Razor_Storm_Surge.mp3\/revision\/latest?cb=20210109142051",
      "effects": [
        "Ability: Passive",
        "Affects: Self ",
        "Damage: "
      ],
      "mana": null,
      "aghanim": null,
      "name": "Storm Surge",
      "cooldown": null,
      "legacy_key": "N",
      "story": "Merely approaching the Lightning Revenant is rewarded with shock therapy."
    },
    {
      "notes": [
        "Interrupts Razor's channeling abilities upon cast",
        "Eye of the Storm has the following priorities: The storm prioritizes enemies which have the  Static Link vision modifier on them, striking them over any other unit when within range, regardless of health values\n Then the lowest current health within the radius\n If there are multiple units with the same lowest health in range, Eye of the Storm chooses between them randomly\n When there are multiple enemies with the vision modifier within the radius, the storm chooses between them randomly on each strike",
        "The strikes are neither regular attacks nor instant attacks, so they fully ignore effects such as evasion and damage block sources\n This also means that they cannot trigger on-attack effects (i.e\n  Counter Helix or break enemy's  Tranquil Boots)\n The strikes first apply the armor reduction, then the damage\n The armor reduction debuff on units lasts as long as the storm, or until Razor dies\n Successive casts create multiple Eye of the Storms, their strike damage fully stacks, and the strike intervals are independent of each other",
        "Eye of the Storm immediately ends when Razor dies",
        "Does not affect wards,  Couriers,  Roshan, invisible units and units in the Fog of War",
        "Eye of the Storm can strike up to 42\/50\/60 ( 50\/60\/75) times and deal up to 2520\/3750\/5400 ( 3000\/4500\/6750) damage per target (before reductions)",
        "When Razor turns invisible, Eye of the Storm and its strike turn invisible as well, but still strike nearby enemies without them seeing or hearing them",
        "SCEPTER NOTES The strike now damages buildings, but does not reduce their armor\n Prioritizes units over buildings and fully ignores filler buildings\n It also allows it to strike 2 targets at the same time on each interval\n An enemy may only be hit by one strike at a time, so a lone target is not hit multiple times per instance"
      ],
      "item_behaviour": [],
      "description": "A powerful lightning storm strikes out at enemy units with the lowest health, dealing damage and reducing their armor.",
      "hot_key": "R",
      "params": [
        "Cast Animation:  0+0",
        "Radius: 500",
        "Number of Targets: 1 ( 2)",
        "Strike Interval: 0.7\/0.6\/0.5 ( 0.6\/0.5\/0.4)",
        "Damage per Strike: 60\/75\/90",
        "Armor Reduction per Strike: 1",
        "Duration: 30"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/01\/Razor_Eye_of_the_Storm_1.mp3\/revision\/latest?cb=20191216022238",
      "effects": [
        "Ability: No Target",
        "Affects: Enemies",
        "Damage: Physical"
      ],
      "mana": "80\/70\/60",
      "aghanim": null,
      "name": "Eye of the Storm",
      "cooldown": "100\/150\/200",
      "legacy_key": "E",
      "story": "Ride the lightning."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.8,
    "attrStrength": 22.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 2.2,
    "attrAgilityInc": 2.6,
    "attrAgility": 22.0
  },
  "description": "Steals enemy damage to add to his own. The whip that ushers the dead through the Narrow Maze brings just as much pain on the battlefield. Razor deploys a sweeping ring of Plasma Field to fry his enemies, he Links his foes to drain them of their power and use it against them. The Lightning Revenant is accompanied by an extraordinary Storm Surge. With a deadly lightning storm at his command, often times his foes found themselves entangled within the Eye of the Storm before even realizing it, as Razor watches and delights in his work as bolts of lightning reduce his foes to charred remains.  Carry Durable Nuker Pusher ★☆☆",
  "trivia": [
    "Razor's alternate\/fun name was Gillette, which is also the name of a reputable brand of shaving razors.",
    "Razor's attack response Link▶️ \"Ride the Lightning!\" is also the name of a Metallica's album and song (which references execution via electric chair).",
    "Razor's response upon picking the Aegis of the Immortal Link▶️ \"There is a lightning that never goes out.\" is a reference to a song \"There is a light that never goes out\" by The Smiths.",
    "Razor's response Link▶️ \"Conduct me where you will.\" is also a line said by Scrooge in A Christmas Carol."
  ],
  "history": "Among the emblematic powers that populate the Underscape, Razor the Lightning Revenant is one of the most feared. With his whip of lightning, he patrols the Narrow Maze, that treacherous webwork of passages by which the souls of the dead are sorted according to their own innate intelligence, cunning and persistence. Drifting above the Maze, Razor looks down on the baffled souls below, and delivers jolts of scalding electricity that both punish and quicken the souls as they decide their own fates, hurrying on toward luminous exits or endlessly dark pits. Razor is the eternal embodiment of a dominating power, abstract and almost clinical in his application of power. Yet he has a lordly air that suggests he takes a sardonic satisfaction in his work.",
  "talents": {
    "hero_talents": [
      {
        "talent_lvl": "25",
        "talent_right": "Creates a second Plasma Field Delayed by 0.8s",
        "talent_left": "Static Link Steals Attack Speed"
      },
      {
        "talent_lvl": "20",
        "talent_right": "+21% Storm Surge Move Speed",
        "talent_left": "-0.1s Eye of the Storm Strike Interval"
      },
      {
        "talent_lvl": "15",
        "talent_right": "+5 Static Link Damage Steal",
        "talent_left": "+14 Strength"
      },
      {
        "talent_lvl": "10",
        "talent_right": "+30 Plasma Field Damage",
        "talent_left": "+12 Agility"
      }
    ],
    "notes": [
      "The agility talent effectively grants Razor 2 main armor, 12 attack speed, and 12 main attack damage bonus.",
      "The strength talent effectively grants Razor 280 health and 1.4 health regeneration bonus."
    ]
  }
}