{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/23\/Wind_Waker_Cyclone.mp3\/revision\/latest?cb=20210120233455",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies",
        "Damage Magical"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "When cast on allies or enemies, applies a cyclone effect upon cast, turning them invulnerable and fully disabled. When cast on self, silences, mutes, and disarms the user. Right-clicking the ground causes the user to get moved via forced movement at a speed of 360. Since it uses forced movement, it ignores the user's turn rate, and allows the user to path through cliffs and trees. Targeting own Meepo Clones or Tempest Doubles behaves as if the item was self targeted.",
        "When cast on self, silences, mutes, and disarms the user.",
        "Right-clicking the ground causes the user to get moved via forced movement at a speed of 360.",
        "Since it uses forced movement, it ignores the user's turn rate, and allows the user to path through cliffs and trees.",
        "Targeting own Meepo Clones or Tempest Doubles behaves as if the item was self targeted.",
        "Unlike other Cyclone abilities, the duration of Cyclone is not affected by status resistance.",
        "Applies a basic dispel on the target upon cast.",
        "Cyclone first applies the invulnerable, then the dispel.",
        "Can target any unit that is not a ward or building.",
        "While in the air, the cycloned unit has no collision. However, a pathing blocker is created at the base of the cyclone within a 24 radius.",
        "The damage is applied at the end of the duration. If the cyclone gets dispelled, it still applies the damage as soon as the target lands.",
        "The damage is only applied to enemy targets.",
        "Can be cast on Roshan, but has no effect, since Roshan is immune to forced movement. The damage is still applied.",
        "Shares cooldown with Eul's Scepter of Divinity."
      ],
      "mana": "175",
      "abilityName": "Cyclone",
      "cooldown": "23",
      "description": "Sweeps a target unit up into a cyclone, making them invulnerable for 2.5 seconds. Cyclone can be cast on yourself, enemy units or allied units. Enemy units take 50 magical damage upon landing.",
      "params": [
        "Cast Range: 575",
        "Cyclone Radius: 24",
        "Damage: 50",
        "Self Cyclone Speed: 360",
        "Duration: 2.5",
        "Can be cast on self while spell immune. Cannot be cast on spell immune enemies."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 420 mana and 7.75 mana regen.",
    "For agility heroes, it grants 420 mana and 7.75 mana regen.",
    "For intelligence heroes, it grants 420 mana, 7.75 mana regen and 35 attack damage.",
    "Movement speed bonuses from multiple Wind Wakers fully stack.",
    "Stacks with all other movement speed bonuses."
  ],
  "cost": "7125",
  "lore": null,
  "consistFrom": [
    "Eul's Scepter of Divinity",
    "Mystic Staff",
    "Recipe"
  ],
  "boughtFrom": "Magical",
  "name": "Wind Waker",
  "description": "Proof enough to some that unseen forces manipulate the happenings of the material plane.",
  "trivia": [
    "The item's name may be a reference to The Legend of Zelda: The Wind Waker"
  ],
  "upgradeIn": null,
  "bonuses": [
    "+35 Intelligence",
    "+6 Mana Regeneration",
    "+50 Movement Speed"
  ],
  "tips": [
    "Use the Cyclone offensively by disabling an enemy before a gank, giving you the time to set up your abilities.",
    "Use the Cyclone on fleeing enemies to give your team the time to surround the target.",
    "Use the Cyclone on enemies in teamfights to take them out of the fight for a few seconds. This is especially effective on carries.",
    "Use the Cyclone on yourself during teamfights, baiting enemies into using their abilities on you, then becoming invulnerable to interrupt their burst damage.",
    "Use the Cyclone to buy yourself a little more time for abilities and items to come off cooldown, especially items like Blink Dagger or Blade Mail.",
    "Use the Cyclone on an enemy who has activated items like Blade Mail, Mask of Madness or Lotus Orb. Doing so will waste the duration of those items.",
    "Infused Raindrops can block the magic damage from Eul's Scepter without triggering Blink Dagger's cooldown.",
    "Eul's Scepter provides a cheap and beneficial dispel for support heroes who are very susceptible to silences. So when facing a lot of silences, or other strong but dispellable effects, Eul's Scepter is usually the best option.",
    "The bonus movement speed works well with other items that increase movement speed, such as Phase Boots."
  ]
}