{
  "abilities": [
    {
      "notes": [
        "Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.",
        "Талант на броню не дается иллюзиям.",
        "Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "Здоровье\/урон энтов больше в 1.8 раза",
          "talentRight": "Teleportation без перезарядки"
        },
        {
          "talentLvl": "20",
          "talentLeft": "-20% перезарядки заклинаний",
          "talentRight": "+30 к скорости атаки"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+4 призываемых энтов",
          "talentRight": "+8 к броне"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+15 к базовому урону от Wrath of Nature",
          "talentRight": "+25 к урону"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Nature%27s_Prophet_Sprout_1.mp3\/revision\/latest?cb=20191216020912",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо"
      ],
      "notes": [
        "Можно применить на любое существо, не являющееся строением или вардом и не находящимся в неуязвимом или спрятанном состоянии.",
        "Создает дерево каждые 45 градусов в радиусе 150 круга, образуя 8 деревьев в виде кольца, которое закрывает выделенное существо.",
        "Для выхода из круга деревьев достаточно разрушить одно из них.",
        "Деревья, созданные способностью Sprout, ничем не отличаются от остальных деревьев на карте. Эти деревья так же блокируют обзор, путь и взаимодействуют со способностями.",
        "Sprout дает летающий обзор в радиусе 500 единиц в месте его применения на всю длительность.",
        "Нельзя напрямую применить к древним крипам и крипам-героям.",
        "Существа, которые не находятся под контролем какого-либо игрока, не обходят деревья от способности, а проходят их насквозь, будто их там нет. Фактически они могут застрять до тех пор, пока не поменяют направление (например, их что-либо спровоцирует).",
        "Фактически они могут застрять до тех пор, пока не поменяют направление (например, их что-либо спровоцирует).",
        "Модель созданных деревьев меньше по размеру и она отличается внешним видом от деревьев, существующих на карте; к тому же эти деревья не имеют анимации разрушения.",
        "При выборе созданных Sprout деревьев Tango лечение длится вдвое дольше."
      ],
      "mana": "70\/90\/110\/130",
      "hotKey": "Q",
      "cooldown": "11\/10\/9\/8 (TagTalent 8,8\/8\/7,2\/6,4)",
      "description": "Окружает существо кольцом деревьев, удерживая его на месте.",
      "spellName": "Sprout",
      "params": [
        "Анимация применения: 0,35+1,14",
        "Дальность применения: 625\/700\/775\/850",
        "Радиус появления деревьев: 150",
        "Длительность: 3\/4\/5\/6",
        "Не может напрямую выбрать врагов с иммунитетом к заклинаниям, но окружает их, если цель заклинания — земля. Может выбрать союзников с иммунитетом.",
        "Блокируется, если целью является владелец предмета. Не блокирует размещение вокруг цели."
      ],
      "itemBehaviour": [],
      "legacyKey": "T",
      "story": "Тех, кто пытается одолеть стража лесов, неизменно окружают густые заросли."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d4\/Nature%27s_Prophet_Teleportation_1.mp3\/revision\/latest?cb=20191216020913",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Себя"
      ],
      "notes": [
        "При телепортации позволяет избежать снаряды.",
        "Двойное нажатие на способность автоматически начнет телепортировать героя на союзный фонтан.",
        "В отличии от телепортации от Town Portal Scroll и Boots of Travel, отмена не запускает перезарядку и не тратит ману.",
        "Во время произнесения заклинания вокруг самого Nature's Prophet и в конечной точке появляется видимый всем эффект.",
        "Также проигрывается звук в точке применения, но слышат его только враги в случае, если они видят Nature's Prophet."
      ],
      "mana": "50",
      "hotKey": "W",
      "cooldown": "50\/40\/30\/20 (TagTalent 40\/32\/24\/16)",
      "description": "Телепортирует в любую точку карты.",
      "spellName": "Teleportation",
      "params": [
        "Анимация применения: 3+0",
        "Дальность применения: Глобальная"
      ],
      "itemBehaviour": [],
      "legacyKey": "R",
      "story": "Вездесущий страж леса всегда готов прийти на помощь своим подчинённым."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f4\/Nature%27s_Prophet_Nature%27s_Call.mp3\/revision\/latest?cb=20191216020911",
      "effects": [
        "Способность Направленная на область",
        "Действует на Деревья"
      ],
      "notes": [
        "Nature's Call создать столько энтов, сколько деревьев находится в выбранной области.",
        "Уничтожает все деревья в области применения, независимо от числа призванных энтов.",
        "Энты всегда появляются в центре области.",
        "Требуется хотя бы одно дерево для применения способности. Попытка применить на площадь без деревьев будет выдавать сообщение об ошибке. Но если в момент применения в области действия способности исчезнут все деревья, заклинание не отменится, потратит ману и уйдет на перезарядку.",
        "Но если в момент применения в области действия способности исчезнут все деревья, заклинание не отменится, потратит ману и уйдет на перезарядку."
      ],
      "mana": "130\/140\/150\/160",
      "hotKey": "E",
      "cooldown": "37 (TagTalent 29.6)",
      "description": "Преобразует деревья в выбранной области в подконтрольных энтов.",
      "spellName": "Nature's Call",
      "params": [
        "Анимация применения: 0,5+1,23",
        "Дальность применения: 750",
        "Радиус: 150\/225\/300\/375 (TagTalent 275\/350\/425\/500)",
        "Число энтов: 2\/3\/4\/5 (TagTalent 6\/7\/8\/9)",
        "Время жизни энтов: 60"
      ],
      "itemBehaviour": [],
      "legacyKey": "F",
      "story": "Веродиция наделила стража лесов способностью призывать энтов — мифических разумных воинов природы."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7a\/Nature%27s_Prophet_Wrath_of_Nature_1.mp3\/revision\/latest?cb=20191216020919",
      "effects": [
        "Способность Направленная на точку \/ Направленная на существо",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Способность может быть применена на землю; она автоматически отскочит на ближайшего видимого врага.",
        "Отскоки происходят с интервалом в 0,25 секунды; для нанесения урона всем целям потребуется 4.25 сек. Каждый отскок увеличивает текущий урон на 11% процентов.",
        "Не нанесет урон курьеру, невидимым существам или существам в тумане войны.",
        "Не может попасть в одну и ту же цель дважды за одно применение.",
        "Здесь указано, сколько урона может нанести каждый отскок на каждом уровне способности (до уменьшений):",
        "Здесь указано, сколько урона может нанести каждый отскок на каждом уровне способности при улучшении Aghanim's Scepter (до уменьшений):",
        "Все отскоки вместе наносят до 5543,6\/7055,4\/8567,3 (TagTalent 6803,5\/8567,3\/10331,2) единиц урона (до уменьшений).",
        "Заклинатель получает одно накопление, увеличивающее урон, за каждого врага, убитого Wrath of Nature. Для получения накопления враг должен умереть от урона способности. Убийство врага под действием дебаффа Wrath of Nature бонуса не дает. У каждого накопления собственная длительность. Полоса состояния показывает текущее значение урона, даваемого накоплениями. У них нет ограничения.",
        "Для получения накопления враг должен умереть от урона способности. Убийство врага под действием дебаффа Wrath of Nature бонуса не дает.",
        "У каждого накопления собственная длительность.",
        "Полоса состояния показывает текущее значение урона, даваемого накоплениями. У них нет ограничения.",
        "Здесь указано, сколько урона может дать Wrath of Nature с определенным числом накоплений на каждом уровне: Уровень 1: 4 \/ 8 \/ 12 \/ 16 \/ 20 \/ 24 \/ 28 \/ 32 \/ 36 \/ 40 \/ 44 \/ 48 \/ 52 \/ 56 \/ 60 \/ 64 \/ 68 \/ 72 Уровень 2: 5 \/ 10 \/ 15 \/ 20 \/ 25 \/ 30 \/ 35 \/ 40 \/ 45 \/ 50 \/ 55 \/ 60 \/ 65 \/ 70 \/ 75 \/ 80 \/ 85 \/ 90 Уровень 3: 6 \/ 12 \/ 18 \/ 24 \/ 30 \/ 36 \/ 42 \/ 48 \/ 54 \/ 60 \/ 66 \/ 72 \/ 78 \/ 84 \/ 90 \/ 96 \/ 102 \/ 108",
        "Уровень 1: 4 \/ 8 \/ 12 \/ 16 \/ 20 \/ 24 \/ 28 \/ 32 \/ 36 \/ 40 \/ 44 \/ 48 \/ 52 \/ 56 \/ 60 \/ 64 \/ 68 \/ 72",
        "Уровень 2: 5 \/ 10 \/ 15 \/ 20 \/ 25 \/ 30 \/ 35 \/ 40 \/ 45 \/ 50 \/ 55 \/ 60 \/ 65 \/ 70 \/ 75 \/ 80 \/ 85 \/ 90",
        "Уровень 3: 6 \/ 12 \/ 18 \/ 24 \/ 30 \/ 36 \/ 42 \/ 48 \/ 54 \/ 60 \/ 66 \/ 72 \/ 78 \/ 84 \/ 90 \/ 96 \/ 102 \/ 108",
        "",
        "С Aghanim's Scepter отмечает задетых врагов дебаффом. Если враг умирает под его действием, то на месте врага появляется Энт. Если под действием эффекта умирает герой (или клон Meepo), на его месте появляется Большой энт. Смерть иллюзий и Tempest Double вызывает обычного энта. Если Nature's Call не изучена, появившиеся энты сразу умирают, не давая опыт врагам. Wrath of Nature сначала применяет дебафф, затем наносит урон. В режиме Ability Draft для призыва энтов должна быть выбрана Nature's Call.",
        "Если под действием эффекта умирает герой (или клон Meepo), на его месте появляется Большой энт.",
        "Смерть иллюзий и Tempest Double вызывает обычного энта.",
        "Если Nature's Call не изучена, появившиеся энты сразу умирают, не давая опыт врагам.",
        "Wrath of Nature сначала применяет дебафф, затем наносит урон.",
        "В режиме Ability Draft для призыва энтов должна быть выбрана Nature's Call."
      ],
      "mana": "175\/225\/275",
      "hotKey": "R",
      "cooldown": "85 (TagTalent 68)",
      "description": "Вызывает сгусток энергии, отскакивающий от врагов в зоне видимости по всей карте и наносящий им урон. С каждой новой целью урон от сгустка увеличивается. За каждое убитое существо герой получает доп. урон от атак на 50 сек.",
      "spellName": "Wrath of Nature",
      "params": [
        "Анимация применения: 0,5+0,97",
        "Дальность применения: Глобальная",
        "Дальность отскока: Глобальная",
        "Максимум целей: 18",
        "Доп. урон за скачок: 11%",
        "Урон: 110\/140\/170 (TagTalent 125\/155\/185) (TagTalent 135\/170\/205, 150\/185\/220)",
        "Бонус к атаке за убийство: 4\/5\/6",
        "Длительность доп. урона: 50",
        "Длительность дебаффа: 0 (TagAghanim 4)",
        "Увеличивает урон. Если от этой способности или в течение сек. после урона от неё умрёт существо, то на его месте появится энт, здоровье и урон которого зависят от уровня Nature's Call. Если умрёт герой — появится большой энт, имеющий 1650 здоровья и 72\/84\/96\/108 урона.",
        "Блокируется, если целью способности выбран владелец предмета. Не блокируется при выборе точки на земле."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": "Герой взывает к Веродиции, обращая её гнев против осмелившихся разорять природу."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 3.6,
    "attrAgility": 22.0
  },
  "description": "Nature's Prophet — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, каждая из которы - активная. Его первая способность, Sprout, окружает существо кольцом деревьев, не давая ему сбежать. Данные деревья не отличаются от обычных, и из них можно освободиться например с помощью Quelling Blade. Вторая способность, Teleportation, позволяет герою телепортироваться в любую точку карты спустя небольшое время. Третьей способностью, Nature's Call, преобразует участок деревьев в Энт которыми можно управлять. Ультимативная способность, Wrath of Nature, вызывает сгусток энергии, отскакивающий от врагов в зоне видимости по всей карте и наносящий им урон. С каждой новой целью урон от сгустка увеличивается. Улучшение с Aghanim's Scepter увеличивает урон и число отскоков. На месте смерти каждого существа, убитого этой способностью, появляется Энт, здоровье и урон которого зависят от уровня Nature's Call. При убийстве героя появляется большой Энт, здоровье и урон которого втрое больше обычного.",
  "history": "Когда богиня лесов Веродиция закончила заполнять мир зеленью, посадила исполненные духом семена, выманила из каменистых глубин вьющиеся ручейки и взяла с солнца обещание хранить всё растущее, то поняла, что время её пришло к концу и, как падают отжившие своё листья, она падёт оземь, так и не узрев своих плодов. Больно ей было покидать мир, ведь ростки ещё не прорвались сквозь землю и всё еще были нежны и беспомощны. В суме для семян Веродиция нашла последнее, забытое зерно. Прошептав в него единственное слово, она проглотила его и упала оземь. За долгую зиму её необъятное тело разложилось, вскормило почву, и по весне на ней поднялись ростки. И в утро весеннего равноденствия, когда весь лес ещё даже не начал просыпаться, то самое позабытое семя взошло, и из него выступил защитник природы, в полном расцвете сил, сильный и мудрый, и нёс он волю Веродиции в те места, что нуждались в защите… и тем, кому повезло звать его союзником.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "Здоровье\/урон энтов больше в 1.8 раза",
      "talentRight": "Teleportation без перезарядки"
    },
    {
      "talentLvl": "20",
      "talentLeft": "-20% перезарядки заклинаний",
      "talentRight": "+30 к скорости атаки"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+4 призываемых энтов",
      "talentRight": "+8 к броне"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+15 к базовому урону от Wrath of Nature",
      "talentRight": "+25 к урону"
    }
  ]
}