{"abilities":[{"spell":"Launches a ball of venom in a line, poisoning enemy units so that they take both initial damage and damage over time, as well as suffering slowed movement. Venomous Gale deals damage every 3 seconds over its duration.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["The gale travels at a speed of 1200, taking 0.71 seconds to reach max distance.","Can hit units up to 975 range away (travel distance + radius).","The slow decreases over time. Hit units regain 1% of their movement speed in 0.3 second intervals, starting 0.3 seconds after the debuff is applied.","A unit with less that 25% of its maximum health can be denied when it has the Venomous Gale debuff on.","After the initial damage, it deals damage over time in 3 second intervals, resulting in overall 6 damage instances.","Venomous Gale can deal up to 75\/250\/425\/600 damage to a single unit (before reductions).","The debuff from successive casts does not stack, only the duration is refreshed. This means the initial damage is not dealt again, since it only applies on debuff creation, but not on refresh.","The projectile has 280 radius flying vision. This vision does not last.","When the talent is chosen, spawns 2 Plague Wards around each hit enemy hero (including clones, excluding illusions). The wards are based on Plague Ward's level. They do not spawn if the ability is not learned. The wards are placed within 100 range of the hit enemy hero, on opposite sides of each other."],"mana":"125","elements":["Does not pierce spell immunity."],"cooldown":"21\/20\/19\/18 ( 13\/12\/11\/10)","name":"Venomous Gale","description":["Cast Animation: 0+0.57","Cast Range: 800","Max Travel Distance: 850","Gale Radius: 125","Initial Damage: 25\/50\/75\/100","Number of Instances: 5","Damage per Instance: 10\/40\/70\/100","Move Speed Slow: 50%","Duration: 15"],"hot_key":"Q","legacy_key":"E"},{"spell":"Adds poison damage to Venomancer's normal attacks, slowing movement speed.","effects":["Ability Passive","Affects Enemies","Damage Magical (HP Removal)"],"notes":["The damage from Poison Sting is flagged as HP Removal, so it does not trigger any on-damage effects.","The damage ticks in 1 second intervals, starting immediately as the debuff is placed, resulting in 6\/9\/12\/15 damage ticks.","The debuff from successive attacks does not stack, only the duration is refreshed.","Can deal up to 36\/126\/264\/450 (18\/63\/132\/225 when applied by Plague Wards) damage (before reductions)."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Does not pierce spell immunity."],"cooldown":"0","name":"Poison Sting","description":["Damage per Second: 6\/14\/22\/30","Move Speed Slow: 11%\/13%\/15%\/17% ( 23%\/25%\/27%\/29%)","Duration: 6\/9\/12\/15"],"hot_key":"W","legacy_key":"T"},{"spell":"Summons a plague ward to attack enemy units and structures. The ward is immune to magic. Wards gain the Poison Sting level from Venomancer, dealing 50% of the full damage.","effects":["Ability Target Point"],"notes":["Plague Wards automatically attack enemies within their attack range, using default auto-attack rules. It is possible to manually give the wards an attack target by just right-clicking an enemy in range. It is also possible to stop the wards from attacking by ordering them to stop (only works when the auto-attack option is turned off).","Plague Wards' attacks apply Poison Sting on enemies. The debuff stacks with that of Venomancer's own attacks, but their effects do not stack. This means that wards place a separate Poison Sting debuff on attacked enemies and do not refresh the debuff from Venomancer's attacks. However, the debuff placed by a ward is muted (does not damage or slow) if the enemy is also affected by Venomancer's debuff.","The damage source of the wards' Poison Sting is set to be Venomancer, not the wards themselves.","Plague Wards have a lower target priority than units and heroes, so they are attacked by towers and lane creeps last.","The wards gain their spell immunity through a buff, so it is possible for enemies to check the buff and ping-out how long the ward will last.","The wards' attack damage is not reduced by damage block abilities."],"mana":"20","elements":[],"cooldown":"5","name":"Plague Ward","description":["Cast Animation: 0+0.63","Cast Range: 850","Ward Duration: 40"],"hot_key":"E","legacy_key":"W"},{"spell":"A spreading ring of poison that does damage over time to enemy units around Venomancer. Poison Nova cannot deal lethal damage; targets will be left with at least 1 health.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["Interrupts Venomancer's channeling spells upon cast.","The ring expands with a speed of 500.","Poison Nova can hit units up to 830 ( 1630) range away (travel distance + width).","Despite the nova having a width, units between the ring and Venomancer are still hit, even when not within 255 width of the nova ring.","Deals damage in 1 second intervals, starting immediately as the debuff is placed, resulting in 19 ( 26) instances.","Poison Nova can never kill a unit. It does not drop affected units below 1 health from its damage ticks.","Can deal up to 760\/1235\/1710 ( 1040\/1690\/2340) ( 1425\/1900\/2375, 1950\/2600\/3250) damage to a single unit (before reductions).","The debuff from successive casts does not stack, only the duration is refreshed."],"mana":"200\/300\/400","elements":["Pierces spell immunity."],"cooldown":"140\/120\/100 ( 140\/120\/60)","name":"Poison Nova","description":["Cast Animation: 0+0.87","Radius: 575 ( 1375)","Nova Width: 255","Damage per Second: 40\/65\/90 ( 75\/100\/125)","Duration: 18 ( 25)"],"hot_key":"R","legacy_key":"V"}],"bio":"In the Acid Jungles of Jidi Isle, poison runs in the veins and bubbles in the guts of every creature that scuttles, climbs or swoops between fluorescent vines dripping with caustic sap. Yet even in this toxic menagerie, Venomancer is acknowledged as the most venomous. Ages ago, a Herbalist named Lesale crossed the Bay of Fradj by coracle, searching for potent essences that might be extracted from bark and root, and found instead a nightmare transformation. Two leagues into Jidi's jungle, Lesale encountered a reptile camouflaged as an epiphyte, which stung him as he mistakenly plucked it. In desperation, he used his partial knowledge of the jungle's herbal bounty, mixing the venom of the (swiftly throttled) reptile with the nectar of an armored orchid, to compound an antidote. In the moments before a black paralysis claimed him completely, he injected himself by orchid-thorn, and instantly fell into a coma. Seventeen years later, something stirred in the spot where he had fallen, throwing off the years' accumulation of humus: Venomancer. Lesale the Herbalist no longer—but Lesale the Deathbringer. His mind was all but erased, and his flesh had been consumed and replaced by a new type of matter—one fusing the venom of the reptile with the poisonous integument of the orchid. Jidi's Acid Jungles knew a new master, one before whom even the most vicious predators soon learned to bow or burrow for their lives. The lurid isle proved too confining, and some human hunger deep in the heart of the Venomancer drove Lesale out in search of new poisons—and new deaths to bring.","talentsTips":["Gold granted from the talent is unreliable gold.","The spell lifesteal talent stacks additively with other sources of spell lifesteal.","The spell lifesteal talent heals for 3% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions."],"trivia":["Venomancer's name, Lesale, may be a reference to \"Le Sale\", which is French for \"The Dirty\" or \"The Nasty\".","In DotA, Venomancer's hero model was a hydralisk. Hydralisks are a ranged combat unit of the Zerg, an alien race in Blizzard Entertainment's RTS game Starcraft. Hydralisks are a very common and well-known image in Blizzard games.","Venomancer's response \"It's in my nature.\" likely alludes to the animal fable The Scorpion and the Frog, in which the scorpion answers to why it stings the frog in the middle of a river, drowning them both."],"talents":["3x Plague Ward HP\/Damage:+800 Poison Nova AoE","15% Spell Lifesteal:+7s Poison Nova Duration","+12% Poison Sting Slow:Gale Hero Impact Summons 2 Wards","+90 Gold\/Min:-8 Venomous Gale CD"],"desc":"Lesale Deathbringer the Venomancer is a ranged agility hero who is focused on dealing damage over time and slowing enemies down. While unassuming due to his mediocre stats and low attack range, he can inflict surprising amounts of gradual damage with his poisonous abilities if left alone. Venomancer can unleash a Venomous Gale to infect enemies in a straight line, drastically slowing them while dealing damage over time. His attacks are just as hazardous thanks to his lethal Poison Sting, which adds a toxic effect to his normal attacks, poisoning opposing Heroes for a great amount of damage over a duration. Plague Ward lets him summon a sentient ward to a targeted point, which attacks enemies or structures. While weak on first use its power grows in numbers, which means the more the wards are placed the deadlier they become. This gives him good versatility, providing vision, pushing power, and a helpful block, preventing enemies from running away when trapped in a sticky situation. Venomancer's most dangerous ability is Poison Nova: though it is not lethal and does not kill an enemy by itself, the damage it inflicts is tremendous, the duration is very long, and its wide area of effect makes it difficult to avoid. It is mostly used to initiate battles, since Poison Nova cannot quickly inflict damage but rather degrades its targets over time. When combined together, the Venomancer is a powerful killing machine, like a virus, slowly killing enemies with venom and poisons. Despite being considered by most players as a support, because of his slowing capabilities, extra ward vision, and being item independent, this does not hinder his power to gank and kill enemies, especially in the earliest parts of the game, and with enough kills, farm, and domination, Venomancer can transition into a semi-carry, with formidable venomous power and deadly specialties."}