{"abilities":[{"spell":"Выплевывает в указанном направлении ядовитый шар, который наносит урон всем задетым врагам и отравляет их. Пораженные цели медленнее передвигаются, а также получают урон каждые 3 секунды действия способности.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Шар летит со скоростью 1200; требуется 0.71 секунды, чтобы он достиг максимальной дистанции.","Может поражать юнитов на расстоянии до 975 единиц (складывается из дистанции прохождения и радиуса).","Замедление уменьшается со временем. Пораженным юнитам возвращается 1% от их скорости передвижения с интервалом в 0,3 секунды спустя 0,3 секунды после применения дебаффа.","Юнит под действием этой способности может быть добит союзниками, если уровень его здоровья опустится ниже 25%.","После нанесения базового урона способность наносит периодический урон с интервалом в 3 секунды, срабатывая 6 раз.","Venomous Gale может нанести до 75\/250\/425\/600 единиц урона в одиночного юнита (до учета сопротивления).","Дебаффы от нескольких применений не складываются, но обновляют длительность.","Снаряд дает летающий обзор радиусом в 280 единиц в момент полета.","При выборе таланта способность создает 2 Plague Ward вокруг каждого пораженного вражеского героя (включая клонов, но исключая иллюзии). Созданные варды зависят от уровня Plague Ward. Они не появятся, если способность не была изучена. Варды размещаются в 100 единицах от пораженного вражеского героя напротив друг друга."],"mana":"125","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"21\/20\/19\/18 ( 13\/12\/11\/10)","name":"Venomous Gale","description":["Анимация применения: 0+0,57","Дальность применения: 800","Дистанция прохождения: 850","Радиус: 125","Урон от попадания: 25\/50\/75\/100","Количество срабатываний: 5","Периодический урон: 10\/40\/70\/100","Замедление скорости передвижения: 50%","Длительность: 15"],"hot_key":"Q","legacy_key":"E"},{"spell":"Добавляет в обычные атаки Venomancer яд, который снижает скорость передвижения.","effects":["Способность Пассивная","Действует на Врагов","Урон Магический (Отнимающий здоровье)"],"notes":["Урон от Poison Sting помечен как эффект, отнимающий здоровье, поэтому на него не срабатывает ни один эффект, срабатывающий от урона.","Урон наносится с интервалом в 1 секунду сразу после размещения дебаффа, срабатывая 6\/9\/12\/15 раз.","Дебаффы от нескольких атак не складываются, но обновляют длительность.","Может нанести до 36\/108\/216\/360 (18\/54\/108\/180 когда наносится с помощью Plague Wards) единиц урона (до учета сопротивления)."],"mana":"0","elements":["Может использоваться иллюзиями.","Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Poison Sting","description":["Периодический урон: 6\/12\/18\/24","Замедление скорости передвижения: 11%\/13%\/15%\/17% ( 19%\/21%\/23%\/25%)","Длительность замедления: 6\/9\/12\/15"],"hot_key":"W","legacy_key":"T"},{"spell":"Призывает Plague Ward, атакующий вражеских юнитов и сооружения. Вард невосприимчив к магии. Он получает текущий уровень вашей способности Poison Sting, нанося 50% от полного урона.","effects":["Способность Направленная на точку","Урон Физический"],"notes":["Plague Wards автоматически атакуют врагов в их радиусе атаки, используя стандартные правила авто-атаки. Можно вручную дать вардам цель для атаки, просто щелкнув правой кнопкой мыши по врагу в радиусе атаки. Также можно остановить атаку, отдав команду \"стоп\" (работает только в случае отключенной опции авто-атаки).","Атаки Plague Wards применяют Poison Sting к врагам. Дебафф складывается с дебаффом от атак Venomancer, но их эффекты - нет. То есть варды размещают отдельный дебафф от Poison Sting на атакуемого врага и не обновляет дебафф от атак Venomancer. При этом дебафф, размещенный вардом, отключается (не наносит урона или не замедляет), если на враг уже под действием дебаффа от Venomancer.","Источником урона от Poison Sting вардов является Venomancer, а не сами варды.","Plague Wards имеют более низкий приоритет в качестве целей, чем юниты и герои, поэтому башни и крипы на линии атакуют их в последнюю очередь.","Варды получают иммунитет к заклинаниям в качестве баффа, поэтому враги могут проверить бафф и приблизительно понять, сколько еще будет жить вард.","Урон от вардов не снижается способностями, блокирующими урон."],"mana":"20","elements":[],"cooldown":"5","name":"Plague Ward","description":["Анимация применения: 0+0,63","Дальность применения: 850","Длительность: 40"],"hot_key":"E","legacy_key":"W"},{"spell":"Venomancer рассеивает вокруг себя кольцо яда, постепенно наносящего урон. Эффект этой способности не может опустить здоровье существа ниже единицы.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Магический"],"notes":["При применении прерывает произносимые способности Venomancer.","Кольцо распространяется со скоростью 500 единиц.","Poison Nova может поражать юнитов на расстоянии до 830 ( 1630) единиц (складывается из дальности прохождения и ширины).","Несмотря на то, что у способности есть ширина, юниты между кольцом и Venomancer все равно задеваются, даже если не находятся в пределах 255 единиц ширины кольца яда.","Наносит урон с интервалом в 1 секунду сразу после размещения дебаффа, срабатывая 19 ( 26) раз.","Poison Nova никогда не сможет убить юнита. Урон от этой способности не смертельный (у цели останется 1 единица здоровья).","Может нанести до 760\/1235\/1710 ( 1040\/1690\/2340) ( 1140\/1615\/2090, 1560\/2210\/2860) единиц урона в одного юнита (до учета сопротивления).","Дебаффы от нескольких применений не складываются, а только обновляют длительность."],"mana":"200\/300\/400","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"140\/120\/100 ( 140\/120\/60)","name":"Poison Nova","description":["Анимация применения: 0+0,87","Радиус: 575 ( 1375)","Ширина: 255","Урон в секунду: 40\/65\/90 ( 60\/85\/110)","Длительность: 18 ( 25)"],"hot_key":"R","legacy_key":"V"}],"bio":"В Кислотных джунглях острова Джиди всякая ползучая, летучая или ходячая тварь содержит в себе яд — он бурлит в венах и пузырится в желудках, и ядовитые звери прыгают с одного токсичного дерева на другое по лианам брызжущим разъедающей кислотой. Но даже во всём этом ядовитом безумии одно существо считается гораздо опаснее всех местных обитателей. Много лет назад залив Фраджи на своей лодчонке пересёк травник по имени Лисейл. Он прибыл на опасный остров в поисках полезных экстрактов, добываемых из корней и коры местной флоры, но нашёл лишь жестокую судьбу. Зайдя на десять километров вглубь джунглей, Лисейл набрёл на искомый эпифит. Только растение оказалось замаскированным ящером, который сразу укусил потянувшуюся к нему руку. Травник отчаянно бросился делать из местных растений антидот, благо знаний хватало: нужно лишь смешать яд свежезадушенной рептилии с нектаром броненосной орхидеи. За считанные мгновения до полного паралича Лисейл ввел себе антидот через шип орхидеи и впал в кому. Семнадцать лет спустя что-то зашевелилось под многолетним слоем перегноя — но то был уже не травник Лисейл. То был Лисейл-смертоносец, веномант. Его сознание хоть и сохранилось, но необратимо исказилось, а старая плоть перегнила в новую материю — живую ткань, в которой смешались яд той рептилии и токсичная оболочка броненосной орхидеи. Так родился новый повелитель Кислотных джунглей, которого в скором времени уважали и боялись даже самые свирепые хищники. Но небольшой остров оказался недостаточно велик для веноманта — отголоски человеческих страстей повели Лисейла прочь, на поиски новых смертоносных токсинов и достойных жертв.","talentsTips":["Золото с таланта является ненадёжным.","Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.","Талант вампиризма заклинаний лечит на 1,4% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям."],"trivia":["Имя героя, Лесайл (англ. Lesale), возможно является отсылкой к слову \"Le Sale\", что в переводе с французского означает \"Грязный\" или \"Мерзкий\".","В DotA, герой использовал модель гидралиска. Гидралиск - тип юнита в стратегии реального времени Starcraft, также разработанной компанией Blizzard. Гидралиски являются основными и базовыми юнитами в игре."],"talents":["Тройные здоровье\/урон тотема от Plague Ward:+800 к радиусу Poison Nova","+15% к вампиризму способностями:+7 сек. действия Poison Nova","+8% замедления от Poison Sting:Venomous Gale по герою создаёт 2 Plague Ward","+90 золота в минуту:-8 сек. перезарядки Venomous Gale"],"tips":["Plague Ward наносят небольшой урон, однако в большом количестве могут нанести немало неприятностей врагу. Вражеские крипы будут атаковать варды в последнюю очередь. Они также могут заблокировать проход вражеским героям во многих местах. У вардов есть Poison Sting, наносящий 50% урона от текущего уровня прокачки (если цель бьет и вард и Venomancer, урон наносится только от большего источника урона). Если Rubick украдёт Plague Ward, у него появится Poison Sting того уровня, который был у Venomancer во время кражи. Также эту способность получат Plague Ward Rubick.","Ульт героя нужно использовать только в массовых боях, что позволит вашей команде легче их убить.","Plague Ward можно использовать в качестве обычного Observer Ward, устанавливая его в неразведанных местах, чтобы видеть противника. Однако, длительность варда в разы меньше, чем у обычного. Во время преследования противника, постоянно ставьте Plague Ward перед ним. Таким образом, противник будет замедляться и вы сможете его догнать."],"desc":"%"}