{"abilities":[{"spell":"Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["The spikes travel at a speed of 1600.","When targeting a unit, the spikes are released towards its current location upon cast. Spikes do not home, thus can be evaded.","Hit units are knocked up 350 range for the initial 0.5 seconds of the stun.","While in the air, other units may pass below hit airborne units.","The damage is applied upon landing, not upon getting hit.","The spikes take 0.52 seconds to reach max distance and can hit units up to 950 range away (travel distance + spikes radius). They take up to 0.56 seconds and can hit units up to 1025 range away when the general cast range increasing talent is chosen. They take up to 1.14 seconds and can hit units up to 1950 range away when Earth Spike's own range increasing talent is chosen. They take up to 1.19 seconds and can hit units up to 2025 range away when both talents are chosen.","Only the cast range and distance increase from the level 25 talent is displayed. The level 10 talent can further increase the cast range to 1575 and the distance 1900. The level 10 talent alone increases cast range to 575 and distance to 900.","When Earth Spike hits invisible units, the visual effects below the hit unit are still visible."],"mana":"70\/100\/130\/160","elements":["Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"12","name":"Earth Spike","description":["Cast Animation: 0.3+0","Cast Range: 500 ( 1500)","Spikes Travel Distance: 825 ( 1825)","Spikes Radius: 125","Damage: 80\/140\/200\/260","Stun Duration: 1.4\/1.8\/2.2\/2.6"],"hot_key":"Q","legacy_key":"E"},{"spell":"Transforms an enemy unit into a harmless beast, with all special abilities disabled.","effects":["Ability Target Unit ( Target Area)","Affects Enemies"],"notes":["Applies a hex on the target, setting its base movement speed to 140, silencing, muting and disarming it. However the target's movement speed is still affected by movement speed bonuses from items and abilities.","Since hex changes base movement speed and does not actually apply a slow, all speed effects are calculated using the 140 base speed.","Hex instantly destroys illusions.","Lion's hex transforms the target into a frog.","The talent turns Hex into an area-targeted spell, so that it cannot directly target units anymore."],"mana":"125\/150\/175\/200","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"30\/24\/18\/12","name":"Hex","description":["Cast Animation: 0+0.53","Cast Range: 500 ( 575)","Radius: 0 ( 325)","Set Movement Speed: 140","Duration: 2.5\/3\/3.5\/4"],"hot_key":"W","legacy_key":"D"},{"spell":"Absorbs the magical energies of a target enemy unit by taking mana from it every second.","effects":["Ability Target Unit \/ Channeled","Affects Enemies \/ Self"],"notes":["Can only be cast on units which have a mana pool.","The link breaks when the target gets out of vision, turns spell immune or invulnerable, exceeds the break distance, or runs out of mana.","Drains 2\/4\/6\/12 mana in 0.1 second intervals, starting 0.1 seconds after cast, resulting in up to 50 instances.","Can drain up to 100\/200\/300\/600 mana when fully channeled.","Instantly destroys targeted illusions on the first interval.","The multi target Mana Drain talent causes Mana Drain to automatically target 2 additional units within 400 radius around the primary target. Only targets units which have a mana pool. The targets are chosen randomly, there are no priorities. The secondary links do not break if the unit turns spell immune, invulnerable, hidden or runs out of mana. It does break when exceeding the link break distance. All links break as soon as the primary target cannot be affected anymore."],"mana":"10","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"16\/12\/8\/4","name":"Mana Drain","description":["Cast Animation: 0.3+0","Cast Range: 850 ( 925)","Search Radius: 0 ( 400)","Max Channel Time: 5","Max Targets: 1 ( 3)","Link Break Distance: 1200 ( 1275)","Mana Drain per Second: 20\/40\/60\/120","Move Speed Slow: 20%\/24%\/28%\/32%"],"hot_key":"E","legacy_key":"R"},{"spell":"Rips at an enemy unit, trying to turn it inside-out. Deals massive damage and grows stronger with each life it consumes.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["Places a debuff on the target upon cast, which applies the damage and the second debuff upon expiring. The debuff lasts 0.25 seconds. This means the can be avoided by being invulnerable, hidden or spell immune as the debuff expires.","If the target dies while having the second debuff, Finger Of Death gains a permanent damage bonus. The status buff on Lion keeps track of how many heroes died with the debuff.","Although only gaining damage from hero kills, the debuff is placed on every target. Gains damage from dying Meepo clones as well, but not from Tempest Doubles, illusions or creep-heroes.","Aghanim's Scepter causes Finger of Death to be cast on all enemy units within 325 radius of the target. This includes invisible enemies and enemies in the Fog of War. An area indicator is added to the mouse pointer, to make easier to tell whether or not enemies are within range."],"mana":"200\/420\/650 ( 200\/420\/625)","elements":["Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"160\/100\/40 ( 100\/60\/20)","name":"Finger of Death","description":["Cast Animation: 0.3+0.5","Cast Range: 900 ( 975)","Radius: 0 ( 325)","Effect Delay: 0.25","Base Damage: 600\/725\/850 ( 800\/925\/1050) ( 725\/875\/1025, 925\/1075\/1225)","Damage Bonus per Kill: 50","Kill Grace Duration: 3"],"hot_key":"R","legacy_key":"F"}],"bio":"Once a Grandmaster of the Demon Witch tradition of sorcery, Lion earned fame among his brethren for fighting on the side of light and righteousness. But adulation corrupts. With powers surpassed only by his ambition, the mage was seduced by a demon and turned to evil, trading his soul for prestige. After committing horrible crimes that marred his soul, he was abandoned. The demon betrayed him, striking better deals with his enemies. Such was Lion’s rage that he followed the demon back to hell and slew it, ripping it limb from limb, taking its demonic hand for his own. However, such demonoplasty comes at a cost. Lion was transfigured by the process, his body transformed into something unrecognizable. He rose from hell, rage incarnate, slaying even those who had once called him master, and laying waste to the lands where he had once been so adored. He survives now as the sole practitioner of the Demon Witch tradition, and those who present themselves as acolytes or students are soon relieved of their mana and carried off by the faintest gust of wind.","talentsTips":["The cast range talent also affects the max distance of Earth Spike and the link break distance of Mana Drain.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","Gold granted from the talent is unreliable gold.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["In the transition from DotA to Dota 2, the names of two of Lion's abilities were changed. Impale changed to Earth Spike and Voodoo changed to Hex.","Lion's rival response towards Witch Doctor \"All we need now is a wardrobe.\" is a reference to the second book in The Chronicles of Narnia book series by C.S. Lewis, titled The Lion, the Witch, and the Wardrobe."],"talents":["+325 AoE Hex:+1000 Earth Spike Range","+2 Mana Drain Multi Target:+500 Health","+120 Gold\/Min:+200 Finger of Death Damage","+90 Damage:+75 Cast Range"],"desc":"Lion, the Demon Witch, is a ranged intelligence hero, most commonly played as a support, who serves as a powerful offensive spellcaster. While exceptionally frail and vulnerable at all stages of the game due to his low health pool, armor, and movement speed, he has a tremendous amount of disabling and nuking power, allowing him to provide the necessary lockdown and burst damage to his team to bring down elusive and shifty enemies. Earth Spike is an area-of-effect line-based stun that also deals a moderate amount of damage. If Lion uses it at max level combined with his Hex, which briefly transfigures an enemy into a harmless critter, he can disable a single opponent for almost 7 seconds, more than enough time to bring down a lone enemy, especially if an ally is present. His ultimate, Finger of Death, serves as a powerful nuke and his primary source of burst damage to aid him in his endeavors. To offset the high mana cost of his abilities, he has Mana Drain, which provides him the sustenance he needs to continuously provide his disabling prowess in a skirmish. A team facing a Lion would do well to eliminate him first in a fight, lest it fall prey to his potent and disruptive spells."}