{"abilities":[{"spell":"Из земли прорывается полоса каменных шипов. Они подбрасывают врагов в воздух, а по приземлении оглушают их и наносят урон.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Скорость шипов - 1600 единиц.","При выборе юнита шипы выпускаются по направлению его текущего расположения. Так как шипы не выпускаются мгновенно, то от них можно уклониться.","Пораженные юниты подбрасываются вверх на 350 единиц на базовые 0,5 секунды оглушения.","Когда враги находятся в воздухе, то остальные юниты могут проходить под ними.","Урон наносится при приземлении, а не при получении удара.","Шипам нужно 0.52 секунды для достижения максимальной дистанции и они могут поражать юнитов на расстоянии до 950 единиц (складывается из дистанции прохождения и радиуса). При выборе таланта на дополнительную дальность применения требуется 0.58 секунд для достижения максимальной дистанции и они могут поражать юнитов на расстоянии до 1050 единиц. При выборе таланта, увеличивающего дистанцию прохождения шипов требуется 1.14 секунд для достижения максимальной дистанции и они могут поражать юнитов на расстоянии до 1950 единиц. При выборе двух талантов требуется 1.2 секунд для достижения максимальной дистанции и они могут поражать юнитов на расстоянии до 2050 единиц.","У способности отображаются только дальность применения и увеличение дистанции прохождения от таланта 25-го уровня. Талант 10-го уровня может увеличить общую дальность применения до 1600 единиц и дистанцию прохождения до 1925 единиц. Один только талант 10-го уровня увеличивает дальность применения до 600 единиц и дистанцию прохождения до 925 единиц.","Когда Earth Spike задевает невидимых юнитов, то визуальные эффекты будут отображены как на юнитах без невидимости."],"mana":"70\/100\/130\/160","elements":["Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"12","name":"Earth Spike","description":["Анимация применения: 0,3+0","Дальность применения: 500 ( 1500)","Дистанция прохождения: 825 ( 1825)","Радиус: 125","Урон: 80\/140\/200\/260","Длительность оглушения: 1.4\/1.8\/2.2\/2.6"],"hot_key":"Q","legacy_key":"E"},{"spell":"Превращает врага в безобидную зверюшку, блокируя все его способности.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Врагов"],"notes":["Применение проклятия на цель устанавливает значение её базовой скорости передвижения в 140 единиц, обезмолвивая, заглушая и обезоруживая её. При этом на цель продолжают действовать бонусы к передвижению от предметов и способностей.","Поскольку проклятие меняет базовую скорость передвижения и не применяет замедление, то все эффекты, влияющие на скорость, будут рассчитываться с учетом базовой скорости в 140 единиц.","Hex мгновенно уничтожает иллюзии.","Hex превращает вражеского героя в лягушку.","Талант превращает Hex в заклинание, направленное на область, поэтому им больше нельзя выбирать юнитов напрямую."],"mana":"125\/150\/175\/200","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"30\/24\/18\/12","name":"Hex","description":["Анимация применения: 0+0,53","Дальность применения: 500 ( 600)","Радиус: 0 ( 325)","Скорость передвижения цели: 140","Длительность: 2.5\/3\/3.5\/4"],"hot_key":"W","legacy_key":"D"},{"spell":"Поглощает магическую энергию цели, с каждой секундой передавая ее ману игроку.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов \/ Себя"],"notes":["Можно использовать только на юнитов, у которых есть запас маны.","Связь прерывается если цель выходит из обзора, получает иммунитет к заклинаниям или неуязвимость, выходит за пределы дистанции разрыва или у неё заканчивается мана.","Вытягивает 2\/4\/6\/12 единиц маны с интервалом в 0,1 секунду спустя 0,1 секунды после применения, срабатывая 50 раз.","Может вытянуть до 100\/200\/300\/600 единиц маны при полном произнесении.","Мгновенно уничтожает иллюзии при первом интервале.","Талант на несколько целей для Mana Drain позволяет способности автоматически выбрать 3-х дополнительных юнитов в радиусе 400 единиц около основной цели. Может выбрать только юнитов с запасом маны. Цели выбираются случайно и для них нет приоритетов. Вторичные связи не прерываются, если юниты получают иммунитет к заклинаниям, неуязвимость, прячутся или у них заканчивается мана. Связи прерываются только при выходе за пределы дистанции разрыва. Все связи рвутся в тот момент, когда способность больше не может действовать на основную цель."],"mana":"10","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/12\/8\/4","name":"Mana Drain","description":["Анимация применения: 0,3+0","Дальность применения: 850 ( 950)","Радиус поиска: 0 ( 400)","Макс. длительность: 5","Макс. кол-во целей: 1 ( 3)","Дистанция разрыва: 1200 ( 1300)","Вытягивает маны в секунду: 20\/40\/60\/120","Замедление скорости передвижения: 20%\/24%\/28%\/32%"],"hot_key":"E","legacy_key":"R"},{"spell":"Разрывает вражеское существо, пытаясь вывернуть его наизнанку. Наносит большой урон, который увеличивается с каждым убитым этой способностью врагом.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["При применении размещает дебафф на цель, наносящий урон, и второй дебафф при завершении первого. Дебафф длится 0.25 секунды. То есть урона можно избежать, если цель станет неуязвимой, спрячется или получит иммунитет к заклинаниям в момент истечения дебаффа.","Если цель умерла под действием второго дебаффа, то Finger Of Death получает постоянный бонус к урону. Иконка баффа у Lion отображает количество убитых под дебаффом героев.","Хоть урон дается только за убийство героя, но дебафф применяется к каждой цели. Бонусный урон также дается за умерших клонов, но не за иллюзии или крипов-героев.","Aghanim's Scepter позволяет использовать Finger of Death на всех вражеских юнитов в радиусе 325 единиц от основной цели. Целями также считаются невидимые враги и враги в тумане войны. К курсору мыши добавляется индикатор области, с помощью которого легче понять, входят ли враги в радиус действия или нет."],"mana":"200\/420\/650 ( 200\/420\/625)","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"160\/100\/40 ( 100\/60\/20)","name":"Finger of Death","description":["Анимация применения: 0,3+0,5","Дальность применения: 900 ( 1000)","Радиус: 0 ( 325)","Задержка: 0.25","Базовый урон: 600\/725\/850 ( 800\/925\/1050) ( 725\/875\/1025, 925\/1075\/1225)","Доп. урон за убийство: 50","Длительность учета убийства: 3"],"hot_key":"R","legacy_key":"F"}],"bio":"Некогда Великий магистр демонологии заслужил известность среди своих собратьев, сражаясь на стороне света и справедливости. Но лесть испортила его. Силы мага превосходило лишь его же честолюбие, и демон завлёк его на тёмную сторону, выменяв душу магистра на уважение других. Запятнав душу ужасными преступлениями, маг остался в одиночестве: демон предал его и стал искать выгоды у врагов. Ярость демонолога погнала его за предателем в самый ад, где, отрывая конечность за конечностью, он жестоко расправился с демоном и забрал себе его демоническую руку. Оказалось, что демонопластика не проходит бесследно. В ходе трансфигурации тело мага изменилось до неузнаваемости. Он восстал из ада и обрушил ярость на наш мир, убивая даже тех, кто однажды называл его господином, и не оставляя камня на камне в тех землях, где его когда-то обожали. Теперь он живёт в уединении, упражняясь в демонологии, а те, кто называют себя его помощниками или учениками, вскоре лишаются своей маны и растворяются в легчайших порывах ветра.","talentsTips":["Талант на дальность применения также влияет на максимальную дальность Earth Spike и дистанцию разрыва Mana Drain.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Золото с таланта является ненадёжным.","Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья."],"trivia":["При переходе из DotA в Dota 2, названия двух способностей Lion'а изменились. Impale переименовали Earth Spike, и Voodoo в Hex.","Фраза Lion - Играть \"To Hell and back\", возможно, является отсылкой к фильму \"To Hell and back\"(1955).","Фраза Lion при убийстве Witch Doctor - Играть \"All we need now is a wardrobe\", является отсылкой к книге \"Лев, колду́нья и платяной шкаф\" (The Lion, the Witch and the Wardrobe)."],"talents":["Hex применяется в радиусе 325:+1000 к дальности Earth Spike","+2 цели к Mana Drain:+500 к здоровью","+150 золота в минуту:+200 к урону от Finger of Death","+90 к урону:+100 к дальности способностей"],"desc":"%"}