{"abilities":[{"spell":"Snapfire unloads with a wide blast that damages and slows enemies in a cone. Enemies caught at point-blank range take an extra 50% damage.","effects":["Ability Target Point","Affects Enemy Units","Damage Magical"],"notes":["An additional visual effect is played on enemies hit at point-blank range. Damage dealt at point blank range is 120\/225\/330\/435 ( 210\/315\/420\/525)."],"mana":"80\/90\/100\/110","elements":["Does not pierce spell immunity."],"cooldown":"10","name":"Scatterblast","description":["Damage: 80 \/ 150 \/ 220 \/ 290 ( 140\/210\/280\/350)","Slow Duration: 1","Movement Slow: 100%","Point-Blank Range: 450","Disarm Duration: 0 ( 3)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Snapfire feeds a potent cookie to Mortimer or an ally, causing them to hop a short distance. The hopping unit stuns and damages enemies in the landing zone.","effects":["Ability Target Unit","Affects Allied Units","Damage Magical"],"notes":["The cookie travels at 700 speed and cannot be disjointed. Destroys trees upon landing."],"mana":"100","elements":["Partially pierces spell immunity."],"cooldown":"24 \/ 22 \/ 20 \/ 18","name":"Firesnap Cookie","description":["Hop Distance: 450","Impact Radius: 300","Impact Damage: 90 \/ 160 \/ 230 \/ 300","Cast Range: 700","Impact Stun Duration: 1.6 \/ 1.9 \/ 2.2 \/ 2.5","Health Restored: 0 ( 250)"],"hot_key":"W","legacy_key":"C"},{"spell":"Snapfire heats up her mounted turret to rapidly fire 6 fixed-damage attacks. Each attack slows the enemy's attack speed. Provides bonus attack range for the duration.","effects":["Ability No Target"],"notes":["Sets Snapfire's base attack time to 1.0, increases her attack speed by 300, and sets her attack damage to 45 \/ 60 \/ 75 \/ 90 for the duration. Each affected attack places an additional instance on the target and refreshes the duration of the whole stack. Can reduce up to 120\/150\/180\/210 attack speed if all attacks are aimed at one target. Attack speed slow also affects towers, even through Glyph of Fortification. Deals a total of 270\/360\/450\/540 damage."],"mana":"75","elements":["Does not pierce spell immunity."],"cooldown":"24 \/ 20 \/ 16 \/ 12","name":"Lil' Shredder","description":["Fixed Damage per Shot: 45 \/ 60 \/ 75 \/ 90","Bonus Range: 75 \/ 150 \/ 225 \/ 300","Attack Slow per Stack: 20 \/ 25 \/ 30 \/ 35","Attack Slow Duration: 3","Base Attack Time: 1.0","Attack Speed Bonus: 300","Attack Count: 6","Duration: 8"],"hot_key":"E","legacy_key":"E"},{"spell":"Snapfire's friend launches a barrage of firespit globs over 6 seconds. Globs cause impact damage and create pools of firespit, which slow and apply damage over time. Snapfire has a reduced turn rate for the duration and a minimum launch range of 600. Each glob can be targeted with a right click.","effects":["Ability Target Point \/ Channeled","Affects Enemy Units","Damage Magical"],"notes":["Shoots globs over a period of 6 seconds, meaning that one glob is shot every 0.857 ( 0.4) seconds. Skilling the +8 globs talent doubles the firing speed and maintains the 6 second period. Issuing a move command causes Snapfire to turn in the direction of the targeted point and re-targets subsequent globs at that point. If the command is targeted outside the maximum range or inside the minimum range, the glob will be launched the maximum\/minimum distance respectively in the direction of the move command. Enemies making contact with firespit pools receive a debuff that slows movement speed by 25% ( 50%) and deals 25\/37.5\/50 damage every 0.5 seconds. The debuff lingers for 0.5 seconds. The debuff does not stack. Touching any pool will refresh the debuff's duration."],"mana":"125 \/ 150 \/ 175","elements":["Does not pierce spell immunity."],"cooldown":"90","name":"Mortimer Kisses","description":["Glob Count: 8 ( 16)","Impact Radius: 275","Damage per Glob: 200 \/ 300 \/ 400","Burn DPS: 50 \/ 75 \/ 100","Firespit Pool Duration: 3","Movement Slow: 25% ( 50%)"],"hot_key":"R","legacy_key":"D"}],"bio":"Beatrix Snapfire and her dragon toad Mortimer are a welcome sight to the ragged folk who scratch out lives along the desert routes and oases scattered throughout Nanarak, the rain-forsaken gateway to the Outlands. As well known for her unrivaled skills as a weaponsmith as for dispensing wisdom, mirth, and the meanest firesnap cookies the world has ever seen, Beadie's survived to a ripe old age in a young keen's trade by being quick with her wits and even quicker with her guns. Indeed, the Outlands are littered with the bones of bandits and ne'er-do-wells who thought to take advantage of her small stature and propensity for kindness.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage."],"talents":["+8 Mortimer Kisses Launched:Scatterblast Applies 3s Disarm","+25% Mortimer Kisses Movement Slow:Lil' Shredder Uses Your Attack Damage","+60 Scatterblast Damage:Firesnap Cookie Restores 250 Health","+20 Movement Speed:+250 Health"],"desc":"Snapfire 20 + 3.3 16 + 1.9 18 + 2.2 Level Base 1 15 25 Health 200 600 1520 2180 Health regen 0 2 6.62 9.92 Magic res. 25% 26.2% 28.97% 30.95% Mana 75 291 651 915 Mana regen 0 0.9 2.44 3.54 Spell dmg 0% 1.26% 3.42% 4.96% Armor 2 4.56 8.82 11.86 Att\/sec 0.63 0.73 0.89 1.01 Move sp amp. 0% 0.8% 2.13% 3.08% Damage 30‒36 50‒56 96‒102 129‒135 Movement speed 300 Attack speed 100 Turn rate 0.5 Vision range 1800\/800 Attack range 500 Projectile speed 1800 Attack animation 1+1 Base attack time 1.6 Damage block 0 Collision size 24 Legs 2  Gib type Default"}