{"abilities":[{"spell":"Snapfire unloads with a wide blast that damages and slows enemies in a cone. Enemies caught at point-blank range take an extra 50% damage.","effects":["Ability Target Point","Affects Enemies","Damage Magical"],"notes":["Scatterblast travels at a speed of 3000, taking 0.73 seconds to travel the full distance.","Can hit units up to 1200 range away (travel distance + end radius).","The complete area is shaped like a cone.","Deals 40\/75\/110\/145 ( 70\/105\/140\/175) damage to units within point-blank range.","Scatterblast first applies the damage, then the movement speed slow ( then the disarm).","Leveling up Scatterblast, or choosing the damage increasing talent does not affect the damage of an already launched instance of Scatterblast."],"mana":"80\/90\/100\/110","elements":["Does not pierce spell immunity."],"cooldown":"10","name":"Scatterblast","description":["Cast Animation: 0.4+0.83","Cast Range: 800","Starting Radius: 225","Travel Distance: 800","End Radius: 400","Point-Blank Distance: 450","Damage: 80\/150\/220\/290 ( 140\/210\/280\/350)","Point-Blank Damage Bonus: 50%","Movement Speed Slow: 100%","Slow Duration: 1","Disarm Duration: 0 ( 3)"],"hot_key":"Q","legacy_key":"R"},{"spell":"Snapfire feeds a potent cookie to Mortimer or an ally, causing them to hop a short distance. The hopping unit stuns and damages enemies in the landing zone.","effects":["Ability Target Unit","Affects Allies \/ Enemies","Damage Magical"],"notes":["The projectile travels at a speed of 1000.","Cannot be cast on units that are currently channeling, making it impossible to accidentally cancel an allied channeling spell. If the ally starts channeling after projectile launch, the projectile does nothing upon impact. This includes self-casts","The target jumps range forwards upon projectile impact, 257 range high. While in the air, other units can pass below them.","During the jump, the target is fully disabled, unable to move, turn, attack or cast spells or items.","Can jump over other units and over impassable terrain.","The area damage and stun are applied upon losing the hop buff. This means if the leap gets interrupted, the effects are applied earlier.","Firesnap Cookie first applies the damage, then the stun.","Destroys trees within the impact area upon landing.","Has no cast backswing when cast on self.","Choosing the talent that adds the heal immediately updates already launched cookies, making them heal on impact."],"mana":"100","elements":["Can be cast while rooted or leashed.","Cannot be disjointed.","Partially pierces spell immunity."],"cooldown":"24\/21\/18\/15","name":"Firesnap Cookie","description":["Cast Animation: 0.2+0.57","Cast Range: 700","Self Cast Time: 0.3","Impact Radius: 300","Jump Distance: 450","Impact Damage: 90\/160\/230\/300","Heal: 0 ( 250)","Jump Duration: 0.5","Impact Stun Duration: 1.6\/1.9\/2.2\/2.5"],"hot_key":"W","legacy_key":"C"},{"spell":"Snapfire heats up her mounted turret to rapidly fire 6 fixed-damage attacks. Each attack slows the enemy's attack speed. Provides bonus attack range for the duration.","effects":["Ability No Target","Affects Self"],"notes":["Interrupts Snapfire's channeling spells on cast.","Increased Snapfire's attack range to 575\/650\/725\/800, and sets her base attack time to 1.","Sets Snapfire's damage to the given values. This means attack damage bonuses and reductions are completely ignored. When the level 20 talent is chosen, her attack damage is no longer set to a fixed value.","An attack charge is lost whenever an attack is executed, regardless of outcome. This means missed attacks use up charges as well.","The number of charges left is visible on the buff icon.","Lil' Shredder one debuff on the target. Following attacks increase its stack count. A number on the icon reveals the amount of stacks. The number is visible to everyone. Since only one debuff is used, each attack resets the duration of the entire stack.","This is how much attack speed Lil' Shredder reduces with up to 6 stacks on each level: Level 1: 15\/30\/45\/60\/75\/90 attack speed slow. Level 2: 20\/40\/60\/80\/100\/120 attack speed slow. Level 3: 25\/50\/75\/100\/125\/150 attack speed slow. Level 4: 30\/60\/90\/120\/150\/180 attack speed slow.","The attack speed slow is applied on any attacked target, including buildings and allies.","Can deal a total of 210\/300\/390\/480 damage with all 6 attacks (before reductions), considering the level 20 talent is not chosen.","The attacks first place the debuff, then apply their own damage.","Successive casts do not stack, but refresh the buff instead, resetting the amount of attacks and updating the range bonus.","Leveling up Lil' Shredder, or choosing the talent that makes it use regular attack damage, do not update the damage of an already existing instance from a previous cast.","When leveling up Lil' Shredder, refreshing the debuff does not update the slow value to the new level. In order to apply the higher value, the debuff must be placed anew."],"mana":"90","elements":["Does not pierce spell immunity."],"cooldown":"24\/20\/16\/12","name":"Lil' Shredder","description":["Cast Animation: 0+0","Attack Range Bonus: 75\/150\/225\/300","Attack Speed Bonus: 300","Base Attack Time: 1","Fixed Attack Damage: 35\/50\/65\/80 ( 0)","Number of Attacks: 6","Attack Speed Slow per Attack: 15\/20\/25\/30","Slow Duration: 3","Buff Duration: 8"],"hot_key":"E","legacy_key":"E"},{"spell":"Snapfire's friend launches a barrage of firespit globs over 6 seconds. Globs cause impact damage and create pools of firespit, which slow and apply damage over time. Snapfire has a reduced turn rate for the duration and a minimum launch range of 600. Each glob can be targeted with a right click.","effects":["Ability Target Area","Affects Enemies","Damage Magical"],"notes":["The projectiles have a minimum travel time of 0.8, maximum travel time of 2 seconds, and a projectile speed of 1300. This means up to 1625 range, the speed adapts to lower values, and for distance starting at 2600, the speed adapts to higher values.","For better readability, the turn rate during Mortimer Kisses is given as degrees per second, instead of radians per 0.03 seconds. 75 degrees per second equal a turn rate of 0.039.","Moritmer Kisses is canceled if Snapfire gets stunned, silenced, cycloned, hexed, slept, feared, or hypnotized. Taunts prevent Snapfire from changing locations for the globs, but do not cancel it. Mortimer Kisses can also be stopped manaully by giving Snapfire any other order besides moving.","The location for the globs can be changed with a move order. A move order is given by right-clicking, or by pressing the move hotkey and selecting a target point. Selecting a point outside the minimum\/maximum distance, the globs are launched using the minimu\/maximum distance towards the targeted direction. Although reducing turn rate a lot while active, the globs are launched where the order was targeted, they are not launched based on facing angle.","Snapfire is disarmed during Mortimer Kisses. Attack orders behave like move orders during disarms, so right-clicking an enemy sets a new locationas well.","The destination for each glob is marked with a red circle indicator, whicch is visible to allies only.","Launches globs in 0.75 ( 0.375) second intervals, starting immediately upon cast, resulting in 8 ( 16) globs.","Each glob deals the impact damage and leaves a laval puddle behind. The puddles last 3 seconds. The puddles apply the debuff on enemies in 0.5 second intervals, starting immediately as they are created, resulting in 6 instances. The debuff lasts 1 seconds, and deals 25\/37.5\/50 damage in 0.5 second interval, starting immediately upon being placed, resulting in 2 instances. Multiple instances of the debuff do not stack.","A single glob can deal a total of 400\/600\/800 damage, considering impact damage, and standing within the puddle for the full duration.","Provides 275 radius flying vision at the current targeted location for the globs, lasting until Mortimer stops launching projectiles.","The projectiels provide 500 radius flying vision as they travel. This vision lingers for 3.5 seconds at the impact area.","Leveling up the spell does not update the impact damage of already launched globs to the new level. However, the lava puddles are updated to apply the debuff with the new level's value. Already placed debuffs are not updated to the new level.","Choosing the slow increasing talent immediately updates all existing puddles to use the new value. However, already placed debuffs are not updated."],"mana":"125\/150\/175","elements":["Does not pierce spell immunity."],"cooldown":"90","name":"Mortimer Kisses","description":["Cast Animation: 0.5+0.73","Cast Range: 3000","Minimum Distance: 600","Maximum Distance: 3000","Impact Radius: 275","Turn Rate in Degrees per Second: 75","Number of Projectiles: 8 ( 16)","Impact Damage: 200\/300\/400","Debuff Damage per Second: 50\/75\/100","Movement Speed Slow: 15%\/20%\/25% ( 40%\/45%\/50%)","Launch Duration: 6","Puddle Duration: 3","Debuff Duration: 1"],"hot_key":"R","legacy_key":"D"}],"bio":"Beatrix Snapfire and her dragon toad Mortimer are a welcome sight to the ragged folk who scratch out lives along the desert routes and oases scattered throughout Nanarak, the rain-forsaken gateway to the Outlands. As well known for her unrivaled skills as a weaponsmith as for dispensing wisdom, mirth, and the meanest firesnap cookies the world has ever seen, Beadie's survived to a ripe old age in a young keen's trade by being quick with her wits and even quicker with her guns. Indeed, the Outlands are littered with the bones of bandits and ne'er-do-wells who thought to take advantage of her small stature and propensity for kindness.","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Snapfire's response \"Say hello to my little friend!\" is a reference to Tony Montana's line from the movie Scarface.","Snapfire's response \"This here's my boomstick\" is a reference to Ash's line from Army of Darkness.","Snapfire's response \" I love the smell of black powder in the morning\" is a reference to Lieutenant Colonel Bill Kilgore's line from Apocalypse Now .","Snapfire's response \" Oh give me a home, where the wildwings roam...\" is a reference to the Western folk song Home on the Range."],"talents":["+8 Mortimer Kisses Launched:Scatterblast Applies 3s Disarm","+25% Mortimer Kisses Movement Slow:Lil' Shredder Uses Your Attack Damage","+60 Scatterblast Damage:Firesnap Cookie Restores 250 Health","+20 Movement Speed:+250 Health"],"desc":"Snapfire is a ranged strength hero armed with a wide array of firepower, riding into battle on her dragon toad Mortimer. Her powerful Scattershot blasts foes who get too close, while her mounted turret increases her range, allowing her to unleash a barrage of rapid fire attacks. Snapfire's coveted Firesnap Cookies give allies a boost, allowing them to leap a short distance. The cookies aren't her only secret weapon, her dragon toad has the ultimate nasty surprise for the enemy team—a long range artillery barrage of Mortimer Kisses that coat the map in searing lava."}