{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/5\/55\/Nature%27s_Prophet_Sprout_1.mp3\/revision\/latest?cb=20191216020912",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: "
      ],
      "notes": [
        "Можно применить на любое существо, не являющимся строением или вардом и не находящимся в неуязвимом или спрятанном состоянии. Двойное нажатие автоматически выбирает себя.",
        "Двойное нажатие автоматически выбирает себя.",
        "Создает дерево каждые 45 градусов круга с радиусом 150, призывая кольцо из 8 деревьев, закрывающее выделенное существо. Деревья, созданные способностью Sprout, ничем не отличаются от остальных деревьев на карте. Эти деревья так же блокируют обзор, путь и взаимодействуют со способностями. Модель созданных деревьев меньше по размеру и она отличается внешним видом от деревьев, существующих на карте; к тому же эти деревья не имеют анимации разрушения. При выборе созданных Sprout деревьев Tango лечение длится вдвое дольше.",
        "Деревья, созданные способностью Sprout, ничем не отличаются от остальных деревьев на карте. Эти деревья так же блокируют обзор, путь и взаимодействуют со способностями.",
        "Модель созданных деревьев меньше по размеру и она отличается внешним видом от деревьев, существующих на карте; к тому же эти деревья не имеют анимации разрушения.",
        "При выборе созданных Sprout деревьев Tango лечение длится вдвое дольше.",
        "Для выхода из кольца деревьев достаточно разрушить одно из них.",
        "Sprout дает летающий обзор в радиусе 250 единиц в месте её применения на всю длительность. Этот обзор предоставляется не деревьями, поэтому даже при разрушении их всех он остаётся.",
        "Этот обзор предоставляется не деревьями, поэтому даже при разрушении их всех он остаётся.",
        "Существа под контролем ИИ не обходят деревья от способности, а проходят насквозь, будто их там нет. Фактически они могут застрять, пока не поменяют направление (например, их что-либо спровоцирует).",
        "Фактически они могут застрять, пока не поменяют направление (например, их что-либо спровоцирует).",
        "Нельзя напрямую применить к древним крипам и крипам-героям, но можно применить на землю.",
        "Аура ослепляет противников, заставляя их промахиваться в 200 случаев. Ослепление от Sprout использует псевдослучайное распределение. Аура привязывает противников, запрещая им использовать способности, дающие мобильность. Длительность задержки аур обоих дебаффов составляет 0,5 секунд.",
        "Аура ослепляет противников, заставляя их промахиваться в 200 случаев.",
        "Ослепление от Sprout использует псевдослучайное распределение.",
        "Аура привязывает противников, запрещая им использовать способности, дающие мобильность.",
        "Длительность задержки аур обоих дебаффов составляет 0,5 секунд.",
        "ПРИМЕЧАНИЯ К SOULBIND Действует на первичную и на вторичную цели как направленная на существо способность."
      ],
      "mana": "11\/10\/9\/8",
      "item_behaviour": [],
      "name": "Sprout",
      "cooldown": "70\/90\/110\/130",
      "description": "Окружает существо кольцом деревьев, удерживая его на месте. Даёт обзор в радиусе 250.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,35+0,44",
        "Дальность применения:  625\/700\/775\/850",
        "Радиус появления деревьев: 150",
        "Число деревьев: 8",
        "Длительность: 3\/4\/5\/6",
        "Радиус ауры: 200",
        "Шанс промаха: 100%",
        "Длительность задержки ауры: 0,5"
      ],
      "legacy_key": "T",
      "story": "Тех, кто пытается одолеть стража лесов, неизменно окружают густые заросли."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d4\/Nature%27s_Prophet_Teleportation_1.mp3\/revision\/latest?cb=20191216020913",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Себя"
      ],
      "notes": [
        "При телепортации позволяет избежать снаряды.",
        "↓↓ Двойное нажатие автоматически выбирает целью союзный фонтан.",
        "В отличии от телепортации от Town Portal Scroll и Boots of Travel, отмена не запускает перезарядку и не тратит ману.",
        "Во время произнесения заклинания вокруг самого Nature's Prophet и в конечной точке появляется видимый всем эффект.",
        "Также проигрывает звук в точке применения; он слышен врагам, только если они видят Nature's Prophet.",
        "ПРИМЕЧАНИЯ К SPELL STEAL Время произнесения этой способности не улучшается при краже."
      ],
      "mana": "62\/48\/34\/20 (TagTalent 0)",
      "item_behaviour": [],
      "name": "Teleportation",
      "cooldown": "50",
      "description": "Телепортирует в любую точку карты.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 3+0",
        "Дальность применения: Глобальная"
      ],
      "legacy_key": "R",
      "story": "Вездесущий страж леса всегда готов прийти на помощь своим подчинённым."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/f\/f4\/Nature%27s_Prophet_Nature%27s_Call.mp3\/revision\/latest?cb=20191216020911",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Деревья"
      ],
      "notes": [
        "Nature's Call может создать столько энтов, сколько деревьев находится в выбранной области.",
        "Уничтожает все деревья в области применения, независимо от числа призванных энтов.",
        "Энты всегда появляются в центре области.",
        "Требуется хотя бы одно дерево для применения способности. Попытка применить на площадь без деревьев будет выдавать сообщение об ошибке. Но если в момент применения в области действия способности исчезнут все деревья, заклинание не отменится, потратит ману и уйдет на перезарядку.",
        "Но если в момент применения в области действия способности исчезнут все деревья, заклинание не отменится, потратит ману и уйдет на перезарядку.",
        "ПРИМЕЧАНИЯ К ТАЛАНТАМ Талант 25-го уровня, вопреки описанию, не умножает здоровье и урон энтов на 2,5. Вместо этого он добавляет825 здоровья и 27\/39\/51\/63 мин.\/макс. урона от атаки энтам. Это увеличивает здоровье энтов в 2,5x раз. Это увеличивает средний урон от атак энтов в 2,5\/2,5\/2,5\/2,5x раз.",
        "Вместо этого он добавляет825 здоровья и 27\/39\/51\/63 мин.\/макс. урона от атаки энтам.",
        "Это увеличивает здоровье энтов в 2,5x раз.",
        "Это увеличивает средний урон от атак энтов в 2,5\/2,5\/2,5\/2,5x раз."
      ],
      "mana": "37 (TagTalent 29)",
      "item_behaviour": [],
      "name": "Nature's Call",
      "cooldown": "150",
      "description": "Преобразует деревья в выбранной области в подконтрольных энтов.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,5+1,23",
        "Дальность применения: 750",
        "Радиус: 150\/225\/300\/375 ( 275\/350\/425\/500)",
        "Число энтов: 2\/3\/4\/5 ( 7\/8\/9\/10)",
        "Время жизни энтов: 60"
      ],
      "legacy_key": "F",
      "story": "Веродиция наделила стража лесов способностью призывать энтов — мифических разумных воинов природы."
    },
    {
      "audioUrl": "",
      "effects": [
        "Способность: Ненаправленная",
        "Действует на: Вражеских героев",
        "Урон: Магический"
      ],
      "notes": [
        "Требуется Aghanim's Shard для разблокировки.",
        "Эффекты Curse of the Oldgrowth's мгновенно накладываются по всей ауре. У неё нет времени полёта.",
        "Периодически проверяет наличие деревьев в радиусе 15 и мгновенно адаптирует значения урона и замедления скорости передвижения. Деревья включают в себя энтов вне зависимости от фракции, обычные деревья, посаженные деревья (например, от Sprout).",
        "Деревья включают в себя энтов вне зависимости от фракции, обычные деревья, посаженные деревья (например, от Sprout).",
        "Наносит урон с интервалом в 1 секунду, начиная мгновенно после применения, в результате срабатывая 7 раз. Может нанести минимум 360\/480\/600\/720 урона (до учёта сопротивлений), если цель заперта в деревьях от Sprout Наносит 0 урона в секунду, если рядом с врагами нет деревьев. Полностью взаимодействует со эффектами от урона, если способности не на перезарядке, такие как Corrosive Skin, кроме тех способностей, которые обладают минимальным порогом урона (например, Gravekeeper's Cloak).",
        "Может нанести минимум 360\/480\/600\/720 урона (до учёта сопротивлений), если цель заперта в деревьях от Sprout",
        "Наносит 0 урона в секунду, если рядом с врагами нет деревьев.",
        "Полностью взаимодействует со эффектами от урона, если способности не на перезарядке, такие как Corrosive Skin, кроме тех способностей, которые обладают минимальным порогом урона (например, Gravekeeper's Cloak).",
        "Дебафф накладывает раскрытие на цель, но не предоставляет раскрытие невидимости, и замедляет скорость передвижения. Дебафф не накладывается на невидимых существ и врагов под действием Disguise.",
        "Дебафф не накладывается на невидимых существ и врагов под действием Disguise."
      ],
      "mana": "18",
      "item_behaviour": [],
      "name": "Curse of the Oldgrowth",
      "cooldown": "80",
      "description": "Накладывает сглаз на всех вражеских героев в радиусе 1200: они становятся видны в тумане войны, замедляются и получают периодический урон, зависящий от числа деревьев в радиусе 250. Энты считаются деревьями.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,2+0,4",
        "Радиус: 1200",
        "Радиус поиска деревьев: 250",
        "Урон в секунду за дерево: 15",
        "Замедление за дерево: 7%",
        "Длительность: 7"
      ],
      "legacy_key": "L",
      "story": "Даже могучий лесной пророк не одарён всевидением, и потому ему приходится полагаться на разведку и помощь разветвлённой сети долголетних друзей."
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/7\/7a\/Nature%27s_Prophet_Wrath_of_Nature_1.mp3\/revision\/latest?cb=20191216020919",
      "effects": [
        "Способность: Направленная на точку",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "notes": [
        "Способность можно применить на землю; она автоматически отскочит на ближайшего видимого врага.",
        "Отскоки происходят с интервалом в 0,25 секунды; для нанесения урона всем целям потребуется 4,25 сек. Каждый отскок увеличивает текущий урон на 10%.",
        "Не наносит урон курьерам, невидимым существам или существам в тумане войны.",
        "Не поражает одну и ту же цель дважды за одно применение.",
        "Все отскоки суммарно могут нанеси до 5243,9\/6839,9\/8435,8 (TagTalent 6611,9\/8207,9\/9803,8) урона. Чтобы узнать, сколько урона будет нанесено на каждом отскоке на каждом уровне, смотрите таблицу ниже.",
        "Чтобы узнать, сколько урона будет нанесено на каждом отскоке на каждом уровне, смотрите таблицу ниже.",
        "Заклинатель получает одно накопление, увеличивающее урон, за каждого врага, убитого Wrath of Nature. Для получения накопления враг должен умереть от урона способности. Убийство врага под действием дебаффа Wrath of Nature бонуса не дает. У каждого накопления собственная длительность. Иконка баффа показывает текущее значение урона, даваемого накоплениями. У них нет ограничения. Чтобы узнать, сколько бонусного урона от атаки получит герой за каждое убийство, смотрите таблицу ниже.",
        "Для получения накопления враг должен умереть от урона способности. Убийство врага под действием дебаффа Wrath of Nature бонуса не дает.",
        "У каждого накопления собственная длительность.",
        "Иконка баффа показывает текущее значение урона, даваемого накоплениями. У них нет ограничения.",
        "Чтобы узнать, сколько бонусного урона от атаки получит герой за каждое убийство, смотрите таблицу ниже.",
        "ПРИМЕЧАНИЯ К AGHANIM'S SCEPTER Wrath of Nature применяет к задетым врагам оцепенение, обезоруживание и раскрытие невидимости. Длительность начинается с 2 сек. и увеличивается на 0,106 за скачок. Wrath of Nature сначала применяет дебафф, затем наносит урон. Чтобы узнать длительность оцепенения на каждом из отскоков, смотрите таблицу ниже.",
        "Длительность начинается с 2 сек. и увеличивается на 0,106 за скачок.",
        "Wrath of Nature сначала применяет дебафф, затем наносит урон.",
        "Чтобы узнать длительность оцепенения на каждом из отскоков, смотрите таблицу ниже."
      ],
      "mana": "85 (TagTalent 60)",
      "item_behaviour": [],
      "name": "Wrath of Nature",
      "cooldown": "130\/160\/190",
      "description": "Вызывает сгусток энергии, скачущий по видимым врагам на всей карте. Он наносит жертвам урон, увеличивающийся с каждым задетым врагом. На 50 сек. увеличивает урон владельца способности за каждого убитого врага.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,5+0,97",
        "Дальность применения: Глобальная",
        "Дальность отскока: Глобальная",
        "Максимум целей: 18",
        "Доп. урон за скачок: 10%",
        "Базовый урон: 115\/150\/185 ( 145\/180\/215)",
        "Доп. урон за убийство: 6",
        "Длительность доп. урона: 50",
        "Мин. длительность оцепенения: 2",
        "Макс. длительность оцепенения: 3,8"
      ],
      "legacy_key": "W",
      "story": "Герой взывает к Веродиции, обращая её гнев против осмелившихся разорять природу."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 21.0,
    "attrIntelligence": 23.0,
    "attrIntelligenceInc": 3.7,
    "attrAgilityInc": 3.6,
    "attrAgility": 22.0
  },
  "description": "Телепортируется в любую точку карты Nature's Prophet будто вездусущ: вот он в гуще боя, а вот уже подготавливает ресурсы для следующей атаки. Благодаря способности телепортироваться в любое место и мгновенно создать армию воинов-энтов, он нападает на противников, когда те этого не ожидают, запирая их в кольце из деревьев. Воззвав к Веродиции, он обращает её гнев против врагов леса, а сами деревья накладывают дурной сглаз на противников.  Керри Лес Осада Побег Быстрый урон ★★☆",
  "history": "Когда богиня лесов Веродиция закончила заполнять мир зеленью, посадила исполненные духом семена, выманила из каменистых глубин вьющиеся ручейки и взяла с солнца обещание хранить всё растущее, то поняла, что время её пришло к концу и, как падают отжившие своё листья, она падёт оземь, так и не узрев своих плодов. Больно ей было покидать мир, ведь ростки ещё не прорвались сквозь землю и всё еще были нежны и беспомощны. В суме для семян Веродиция нашла последнее, забытое зерно. Прошептав в него единственное слово, она проглотила его и упала оземь. За долгую зиму её необъятное тело разложилось, вскормило почву, и по весне на ней поднялись ростки. И в утро весеннего равноденствия, когда весь лес ещё даже не начал просыпаться, то самое позабытое семя взошло, и из него выступил защитник природы, в полном расцвете сил, сильный и мудрый, и нёс он волю Веродиции в те места, что нуждались в защите… и тем, кому повезло звать его союзником."
}