{"abilities":[{"spell":"Causes a bladestorm of destructive force around Juggernaut, rendering him immune to magic and dealing damage to nearby enemy units.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Does not interrupt Juggernaut's channeling spells upon cast.","Applies spell immunity for the duration and a basic dispel upon cast.","During Blade Fury, Juggernaut cannot be affected by Ghost Scepter. The buff gets removed immediately.","Juggernaut can perform attacks, cast spells, and use items during Blade Fury, however, Omnislash is inactive for the duration and cannot be cast.","During Blade Fury, Juggernaut's attacks deal 0 damage, except against wards and buildings. Attack modifiers like Monkey King Bar, Diffusal Blade or Skull Basher still apply their effects and damage on procs. This means critical strike and lifesteal have no effect (despite their visual effects), since they are based on the actual damage dealt. Cleave has no effect either (despite the visual effect), since Juggernaut's attack damage is 0 upon attacking.","Deals 18\/23\/28\/32 ( 38\/43\/48\/52) damage in 0.2 second intervals, starting 0.2 seconds after cast, resulting in 25 damage instances.","Can deal up to 450\/575\/700\/800 damage to a single unit (before reductions). Can deal up to 950\/1075\/1200\/1300 damage when the damage increasing talent is chosen."],"mana":"120\/110\/100\/90","elements":["Cannot be used by illusions.","Does not pierce spell immunity."],"cooldown":"42\/34\/26\/18","name":"Blade Fury","description":["Cast Animation: 0+0","Radius: 250","Damage per Second: 90\/115\/140\/160 ( 190\/215\/240\/260)","Duration: 5","Movement Speed Bonus: 0 ( 50)"],"hot_key":"Q","legacy_key":"F"},{"spell":"Summons a Healing Ward which heals all nearby allied units, based on their max health. The Healing Ward moves at 400 movement speed after being summoned. Lasts 25 seconds.","effects":["Ability Target Area \/ Aura","Affects Allies"],"notes":["After cast, the ward automatically follows Juggernaut, if no other order is given.","The heal is provided by an aura. Its healing buff lingers for 2.5 seconds.","Can regenerate up to 55%\/82.5%\/110%\/137.5% of a unit's max health over its full duration.","Can fully regenerate a unit's health within 50\/33.33\/25\/20 seconds.","The healing auras of multiple Healing Wards do not stack.","Does not affect wards and buildings."],"mana":"140","elements":["Pierces spell immunity."],"cooldown":"60","name":"Healing Ward","description":["Cast Animation: 0.3+0.47","Cast Range: 350","Radius: 500","Max Health as Health Regen Bonus: 2%\/3%\/4%\/5%","Aura Linger Duration: 2.5","Duration: 25"],"hot_key":"W","legacy_key":"G"},{"spell":"Gives Juggernaut a chance to deal critical damage on each attack.","effects":["Ability Passive","Affects Enemies"],"notes":["Increases attack damage by an average of 16%\/20%\/24%\/28%.","The proc chances of multiple crit sources stack. If two sources of critical strike proc at the same time, the higher multiplier has priority.","Blade Dance uses pseudo-random distribution.","The sound and particles play upon start of the attack, not when the attack lands."],"mana":"0","elements":["Can be used by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Blade Dance","description":["Proc Chance: 20%\/25%\/30%\/35%","Critical Damage: 180%"],"hot_key":"E","legacy_key":"C"},{"spell":"Juggernaut leaps towards the target enemy unit with an attack, and then slashes other nearby enemy units at an increased attack rate. Juggernaut is invulnerable for the duration.","effects":["Ability Target Unit","Affects Enemies \/ Self","Damage Physical"],"notes":["Turns Juggernaut invulnerable and spell immune for the whole duration, and applies a basic dispel on cast.","The slash interval equals Juggernaut's current attack rate, divided by 1.8. This means the maximum possible interval for Omnislash is 3.89 and the minimum is 0.11, considering minimum and maximum possible attack speeds. The interval is not set on cast. On each slash, the interval updates based on his current attack rate.","Causes Juggernaut to perform instant attacks on enemies he slashes. These instant attacks are allowed to trigger attack modifiers normally. The instant attacks ignore disarms, but have no True Strike.","Can neither target nor jump on wards, couriers and buildings. Cannot target, but can jump on ancient creeps.","Can jump on invulnerable units, however, since Juggernaut attacks the targets, invulnerable (and ethereal) targets take no damage.","Cannot jump on units in the Fog of War, invisible or hidden units, Tombstone Zombies and on Astral Spirits.","If no valid targets are in range, Omnislash ends prematurely.","On each slash, Juggernaut is positioned at the opposite side of the target from Juggernaut's position, facing the target. The slash radius is centered around Juggernaut, not around the current target.","Juggernaut can cast spells and use items during Omnislash. However, Blade Fury is inactive for the duration and cannot be cast. During Omnislash, Juggernaut does not need to turn in order to cast targeted spells or items.","Provides 200 radius flying vision lasting 1 second on each slash around the current target.","Recasting Omnislash while the previous cast is still active refreshes the duration.","Centers the player's camera perspective on Juggernaut on cast, following his position during Omnislash."],"mana":"200\/275\/350","elements":["Partially blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"130 ( 70)","name":"Omnislash","description":["Cast Animation: 0.3+0","Cast Range: 350","Slash Radius: 425","Attack Rate Divisor: 1.8","Attack Damage Bonus: 30\/40\/50","Duration: 3\/3.25\/3.5 ( 4\/4.25\/4.5) ( 4\/4.25\/4.5, 5\/5.25\/5.5)"],"hot_key":"R","legacy_key":"E"}],"bio":"No one has ever seen the face hidden beneath the mask of Yurnero the Juggernaut. It is only speculation that he even has one. For defying a corrupt lord, Yurnero was exiled from the ancient Isle of Masks--a punishment that saved his life. The isle soon after vanished beneath the waves in a night of vengeful magic. He alone remains to carry on the Isle's long Juggernaut tradition, one of ritual and swordplay. The last practitioner of the art, Yurnero's confidence and courage are the result of endless practice; his inventive bladework proves that he has never stopped challenging himself. Still, his motives are as unreadable as his expression. For a hero who has lost everything twice over, he fights as if victory is a foregone conclusion.","talentsTips":["The all stats talent effectively grants Juggernaut 100 health, 0.5 health regen, 0.4% magic resistance, 0.8 armor, 5 attack speed, 0.25% movement speed, 60 mana, 0.25 mana regen, 0.35% spell damage and 5 attack damage.","The armor talent does not benefit illusions.","The health talent increases maximum health capacity, and keeps the current health percentage."],"trivia":["Juggernaut's backstory and appearance bear many similarities to that of the Seguleh people in the \"Malazan Book of the Fallen\" series of books by Steven Erikson.","Juggernaut's ultimate, Omnislash, is inspired by and named after the signature move of Cloud Strife from the game Final Fantasy VII.","The rare line \"Screw it, I'm going to five blades!\" is a reference to an article from The Onion about the increasing number of blades put into razors.","The line \"My blade is swifter.\" is a reference to the Heroes of Newerth hero Swiftblade, the game's own equivalent of Juggernaut.","The line \"And then... there were none...\" may be a reference to the Agatha Christie book by the same name.","The line \"I'm the Juggernaut, Lich!\" is a play on the quote \"I'm the Juggernaut, bitch.\", taken from a YouTube parody featuring re-dubbed scenes from X-Men: The Animated Series."],"talents":["+1s Omnislash Duration:+600 Health","+100 Blade Fury DPS:+10 Armor","+20 Attack Speed:+50 Blade Fury Movement Speed","+20 Movement Speed:+5 All Stats"],"desc":"Yurnero the Juggernaut is a melee agility hero whose abilities allow him to sprint into battle and recklessly devastate enemies in an impenetrable flurry of blades."}