{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная"
      ],
      "notes": [
        "На первом уровне позволяет выбирать в цель союзных существ не-героев. На втором уровне вдобавок позволяет выбирать в цель союзных героев."
      ],
      "mana": null,
      "abilityName": "Улучшение Town Portal Scroll",
      "cooldown": null,
      "description": "Улучшает свиток телепортации: он позволяет телепортироваться к существам, перезаряжается быстрее и не расходует заряды.",
      "params": [
        "Перезарядка телепортации: 40\/30"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Улучшение предмета усиливает пассивную способность Улучшение Town Portal Scroll. Можно улучшить лишь один раз.",
    "Общая стоимость в золоте для каждого уровня 2500\/4500.",
    "Основные бонусы к скорости передвижения от нескольких пар ботинок не складываются.",
    "Складывается со всеми другими бонусами к скорости передвижения.",
    "Наведение с зажатой клавишей ALT заставит иконку появиться под портретом каждого союзного героя вверху интерфейса, отображая состояние телепортов союзников. Иконка отображает текущую перезарядку их телепортов. Если союзник не имеет предмета для телепортации, иконка не отобразится. Если телепорт находится в ранце, он отобразится обесцвеченным. Boots of Travel имеет приоритет выше чем Town Portal Scroll и Boots of Travel 2-го уровня имеет приоритет выше над 1-м. Интерфейс не отображает другие способности для телепортации.",
    "Иконка отображает текущую перезарядку их телепортов. Если союзник не имеет предмета для телепортации, иконка не отобразится. Если телепорт находится в ранце, он отобразится обесцвеченным.",
    "Boots of Travel имеет приоритет выше чем Town Portal Scroll и Boots of Travel 2-го уровня имеет приоритет выше над 1-м. Интерфейс не отображает другие способности для телепортации."
  ],
  "cost": "2500",
  "lore": null,
  "consistFrom": [
    "Boots of Speed",
    "Recipe"
  ],
  "boughtFrom": "Аксессуары",
  "name": "Boots of Travel",
  "description": "",
  "trivia": null,
  "upgradeIn": [
    "Boots of Travel 2"
  ],
  "bonuses": [
    "+110\/130 к скорости передвижения"
  ],
  "tips": null
}