{"abilities":[{"spell":"Unleashes a breath of fire in front of Dragon Knight that burns enemies and reduces the damage their attacks deal.","effects":["Ability Target Point \/ Target Unit","Affects Enemies","Damage Magical"],"notes":["Breathe Fire travels at a speed of 1050.","Can hit units up to 1000 range away (travel distance + end radius).","The complete area is shaped like a cone.","Reduces hit targets' total attack damage, including raw damage bonuses.","The fire first applies the damage, then the debuff.","Has a cast backswing of 0.53 seconds while in Elder Dragon Form."],"mana":"100\/110\/120\/130","elements":["Does not pierce spell immunity."],"cooldown":"14\/13\/12\/11","name":"Breathe Fire","description":["Cast Animation: 0.2+0.47","Cast Range: 600","Starting Radius: 150","Travel Distance: 750","End Radius: 250","Damage: 90\/170\/240\/300","Attack Damage Reduction: 25% ( 55%)","Reduction Duration: 11"],"hot_key":"Q","legacy_key":"F"},{"spell":"Dragon Knight smites an enemy unit in melee range with his shield, stunning it while dealing minor damage. When in Elder Dragon Form, the cast range increases to 400.","effects":["Ability Target Unit","Affects Enemies","Damage Magical"],"notes":["While in Elder Dragon Form, Dragon Tail has a cast range of 400 and uses a projectile, instead of being instant. The projectile travels at a speed of 1600.","In human form, the spell does not rely on a projectile, meaning Strafe cannot disjoint it.","Dragon Tail first applies the damage, then the debuff."],"mana":"100","elements":["Can be disjointed.","Blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"12\/11\/10\/9","name":"Dragon Tail","description":["Cast Animation: 0+0.5","Cast Range: 150","Damage: 25\/50\/75\/100","Stun Duration: 2.5\/2.75\/3\/3.25 ( 4.5\/4.75\/5\/5.25)"],"hot_key":"W","legacy_key":"T"},{"spell":"The life blood of the Dragon improves health regeneration and strengthens armor.","effects":["Ability Passive","Affects Self"],"notes":["Can regenerate up to 240\/480\/720\/960 ( 480\/960\/1440\/1920) health in one minute."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break."],"cooldown":"0","name":"Dragon Blood","description":["Health Regen Bonus: 4\/8\/12\/16 ( 8\/16\/24\/32)","Armor Bonus: 3\/6\/9\/12 ( 6\/12\/18\/24)"],"hot_key":"E","legacy_key":"D"},{"spell":"Dragon Knight takes the form of one of three powerful elder dragons, increasing his speed, and Dragon Tail's range, while granting him new powers. LEVEL 1 Green Dragon - Corrosive Breath: attacks deal 20 poison damage per second for 5 seconds. Works on structures. LEVEL 2 Red Dragon - Splash Attack: attacks damage all enemy units in a 300 radius for 0%\/75%\/75%\/115%, with Corrosive Breath added to the targets. LEVEL 3 Blue Dragon - Frost Breath: slows movement speed by 40% and attack speed by 40 of enemy units in Splash Attack range for 3 seconds, with Corrosive Breath added to the targets.","effects":["Ability No Target","Affects Self \/ Enemies","Damage Magical \/ Physical"],"notes":["Level 4 is only available while having Aghanim's Scepter. The spell can still only be leveled 3 times, the Scepter automatically increases the level by 1.","Increases Dragon Knight's movement speed to 325, attack range to 500\/500\/500 ( \/600), and magic resistance to 25%\/25%\/25% ( \/55%).","Also gives Dragon Knight ranged attack properties. His attack projectiles travel at a speed of 900.","Level 1 transforms him into a green dragon, level 2 into a red dragon, level 3 into a blue dragon, and level 4 into a black dragon. The black dragon form is 30% larger than the other forms.","Elder Dragon Form is fully canceled on death. The Dragon Form buff is hidden, only the 3 attack modifier buffs are displayed.","Successive casts of Elder Dragon Form refresh the duration and update the form, adapting to the current level of the spell.","While in Elder Dragon Form, Dragon Knight gains the following attack modifiers through undispellable buffs:","Corrosive Breath: (Available for Level 1 and higher levels of Elder Dragon Form) Places a debuff, which deals magical damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 5 instances. When on level 2 or higher, the debuff is applied to all enemies within the splash radius. Can deal up to 100\/100\/100 ( \/150) damage to a unit (before reductions). Does not work against wards, works against allied units. Corrosive Breath fully affects buildings, meaning it can also be used to deny allied towers. However, buildings are only debuffed when directly attacked. Successive hits do not stack, but refresh the duration. The attacks first apply the debuff, then their own attack damage. However, on secondary targets, it first applies the splash damage, then the debuff. When an attack misses or is disjointed, the debuff is not applied within the radius.","Splash Attack: (Available for Level 2 and higher levels of Elder Dragon Form) When an attack misses or is disjointed, no splash damage is dealt. Splash damage physical damage, and is affected by Damage Block. Does not work against wards or buildings.","Frost Breath: (Available for Level 3 and higher levels of Elder Dragon Form) Does not work against wards, buildings, or allied units. Successive hits do not stack, but refresh the duration. The attacks first apply the debuff, then their own attack damage. The splash damage is applied after the debuff as well. When an attack misses or is disjointed, the slow is not applied within the radius."],"mana":"50","elements":["Partially usable by illusions.","Partially pierces spell immunity."],"cooldown":"115","name":"Elder Dragon Form","description":["Cast Animation: 0+0.5","Attack Range Bonus: 350\/350\/350 ( \/450)","Move Speed Bonus: 30","Magic Resistance Bonus: 0%\/0%\/0% ( \/30%)","Dragon Tail Cast Range Bonus: 250","Dragon Form Duration: 60","Corrosive Breath Damage per Second: 20\/20\/20 ( \/30)","Corrosive Breath Debuff Duration: 5","Splash Attack Radius: 300","Splash Attack Damage: 0%\/75%\/75% ( \/115%)","Frost Breath Radius: 300","Frost Breath Movement Speed Slow: 0%\/0%\/40% ( \/60%)","Frost Breath Attack Speed Slow: 0\/0\/40 ( \/60)","Frost Breath Debuff Duration: 3"],"hot_key":"R","legacy_key":"R"}],"bio":"After years on the trail of a legendary Eldwurm, the skilled dragon-slayer found himself facing a disappointing foe: the dreaded Slyrak had grown ancient and frail, its wings tattered, its few remaining scales stricken with scale-rot, its fangs ground to nubs, and its fire-gouts no more threatening than a pack of wet matchsticks. Seeing no honor to be gained in dragon-murder, the young knight prepared to turn away and leave his old foe to die in peace. But a voice crept into his thoughts, and Slyrak gave a whispered plea that the knight might honor him with death in combat. The knight agreed, and found himself rewarded beyond expectation for his act of mercy: As he sank his blade in Slyrak's breast, the dragon sank a claw into his throat. As their blood mingled, Slyrak sent his power out along the Blood Route, offering all its strength and centuries of wisdom to the knight. The dragon's death sealed their bond, and Dragon Knight was born. The ancient power slumbers in the knight, waking when he calls it; or perhaps it is the Dragon that calls the Knight...","talentsTips":["The health talent increases maximum health capacity, and keeps the current health percentage.","This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The strength talent effectively grants Dragon Knight 500 health, 2.5 health regen, 2% magic resistance and 25 attack damage.","Gold granted from the talent is unreliable gold."],"trivia":["In DotA, Dragon Knight's fun name was Trogdor, a character that first appeared in episode 58 of the \"Strong Bad e-mail\" show on the website HomestarRunner.com. He also has an alternate name when he transforms with his ultimate in DotA, in which he is named \"Arc Honist\".","In The Lab, a VR game by Valve, there are some Bendie soldiers who wield Dragon Knight's sword in the minigame Longshot, along with other Dota 2 weapons like Axe's war axe, Huskar's spear and Stout Shield."],"talents":["+2s Dragon Tail:2x Dragon Blood HP Regen\/Armor","+25 Strength:+180 Gold\/Min","+400 Health:+30 Damage","-30% Breathe Fire Damage Reduction:+3 Mana Regen"],"desc":"Davion, the Dragon Knight, is a durable melee strength hero with a relatively straightforward and yet versatile skill set. He has both an area-of-effect nuke and a lengthy single-target stun, giving him excellent farming and ganking capabilities. Though he has no real escape ability, his Dragon Blood provides him a hefty amount of armor and regen, making him capable of withstanding strong physical hits and recovering quickly. He is still very vulnerable in the early game, however, and needs to farm and stay alive in order to be effective in later stages. If he has enough levels and farm, Dragon Knight is very formidable in the late game due to his strong ultimate, Elder Dragon Form, which transforms him into a legendary dragon with a ranged attack, capable of eliminating multiple enemies at once."}