{"abilities":[{"spell":"Извергает огненное дыхание на вражеских юнитов в линии перед Dragon Knight, поджигая их и уменьшая урон от их атак.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Breathe Fire летит со скоростью в 1050 единиц.","Может поражать юнитов на расстоянии до 1000 единиц (складывается из дистанции прохождения и конечного радиуса).","Площадь поражения представляет собой конус.","Снижает весь урон пораженных юнитов, включая урон, даваемый атрибутами.","В форме Elder Dragon Form у способности время после применения равняется 0,53 секунды."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/13\/12\/11","name":"Breathe Fire","description":["Анимация применения: 0,2+0,47","Дальность применения: 600","Начальный радиус: 150","Дистанция прохождения: 750","Конечный радиус: 250","Урон: 90\/170\/240\/300","Снижение урона: 25% ( 45%)","Длительность снижения урона: 11"],"hot_key":"Q","legacy_key":"F"},{"spell":"Dragon Knight поражает своим щитом врага в радиусе ближнего боя, оглушая его и нанося небольшой урон. Когда рыцарь находится в форме дракона, он может применять заклинание с расстояния в 400 единиц.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["В форме Elder Dragon Form дальность применения становится 400 и способность использует снаряд вместо мгновенного применения. Скорость полета снаряда - 1600.","Dragon Tail сначала наносит урон, затем применяет дебафф.","В форме человека способность не использует снаряд, поэтому Strafe не может избежать оглушения."],"mana":"100","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"12\/11\/10\/9","name":"Dragon Tail","description":["Анимация применения: 0+0,5","Дальность применения: 150","Урон: 25\/50\/75\/100","Длительность оглушения: 2.5\/2.75\/3\/3.25 ( 4.25\/4.5\/4.75\/5)"],"hot_key":"W","legacy_key":"T"},{"spell":"Текущая в жилах Dragon Knight кровь дракона улучшает его регенерацию здоровья и броню.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Напрямую усиливает регенерацию здоровья; восстанавливает 0.4\/0.7\/1\/1.3 ( 0.8\/1.4\/2\/2.6) единиц здоровья с интервалом в 0,1 секунды.","Восстанавливает 240\/420\/600\/780 ( 480\/840\/1200\/1560) единиц здоровья за одну минуту."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением."],"cooldown":"0","name":"Dragon Blood","description":["Восстановление здоровья: 4\/7\/10\/13 ( 8\/14\/20\/26)","Дополнительная броня: 3\/6\/9\/12 ( 6\/12\/18\/24)"],"hot_key":"E","legacy_key":"D"},{"spell":"Герой обращается в одного из трёх могучих древних драконов, отчего быстрее передвигается, может дальше применять Dragon Tail и получает особые эффекты атаки: УРОВЕНЬ 1 — зелёный дракон с Corrosive Breath: отравляет жертв, нанося по 20 единиц урона в течение 5 секунд. Действует на строения. УРОВЕНЬ 2 — красный дракон с Splash Attack: атаки наносят урон всем врагам в радиусе единиц от цели, применяя на всех жертв Corrosive Breath. УРОВЕНЬ 3 — синий дракон с Frost Breath: замедляет на 3 секунды скорость передвижения всех врагов в радиусе действия Splash Attack на 30% и скорость их атаки на 30, также отравляя всех жертв эффектом Corrosive Breath.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический \/ Физический"],"notes":["Увеличивает скорость передвижения Dragon Knight до 310, а дальность атаки - до 500.","Также дает Dragon Knight снаряды дальней атаки. Его снаряды летят со скоростью в 900 единиц.","1-й уровень способности превращает его в зеленого дракона, 2-й уровень - в красного, 3-й уровень - в синего.","Elder Dragon Form полностью отменяется при смерти. Бафф Dragon Form скрытый, отображаются только 3 модификатора атаки.","Несколько использований Elder Dragon Form обновит длительность и форму, подстраиваясь под текущий уровень способности.","В форме Elder Dragon Form Dragon Knight получает следующие модификаторы атаки с неразвеиваемыми баффами:","Corrosive Breath: (Доступен на 1-ом, 2-ом и 3-ем уровне Elder Dragon Form) Тип урона: Магический Урон в секунду: 20 Длительность: 5 Размещает дебафф, который наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывающий 5 раз. На 2-ом и 3-ем уровне дебафф применяется ко всем врагам в максимальном радиусе урона по области. Может нанести до 100 единиц урона одному юниту (до учета сопротивления). Не работает на варды, но действует на союзных юнитов. Corrosive Breath полностью работает на строения, поэтому его также можно использовать для добивания союзных башен. Но при этом строения получают дебафф только при непосредственной атаке по ним. Несколько атак не складываются, но обновляют время действия дебаффа. В случае, если атака промахнулась или её избежали, дебафф не применяется в радиусе действия.","Splash Attack: (Доступен на 2-ом и 3-ем уровне Elder Dragon Form) Тип урона: Физический Радиус атаки: 300 Урон атаки: 75% В случае, если атака промахнулась или её избежали, урон соседним целям будет нанесен, но снизится на 50%. Не действует на варды или строения.","Frost Breath: (Доступен на 3-ем уровне Elder Dragon Form) Радиус замедления: 300 Замедление скорости передвижения: 30% Замедление скорости атаки: 30 Длительность замедления: 3 Не работает на варды, строения или союзных юнитов. Несколько атак не складываются, но обновляют время действия дебаффа. В случае, если атака промахнулась или её избежали, замедление не применяется в радиусе действия."],"mana":"50","elements":["Частично используется иллюзиями.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"115","name":"Elder Dragon Form","description":["Анимация применения: 0+0,5","Доп. дальность атаки: 350","Доп. скорость передвижения: 30","Доп. дальность применения Dragon Tail: 250","Длительность: 60"],"hot_key":"R","legacy_key":"R"}],"bio":"Спустя много лет выслеживания легендарного древнего дракона, рыцарь Дейвион наконец предстал перед своим врагом и страшно разочаровался: ужасающий Слайрак состарился и ослабел, его крылья были потрепаны, плоть прогнила, клыки отупели, а огненное дыхание было не страшнее коробка спичек. Не видя чести в его убийстве, молодой рыцарь хотел уйти и позволить старому врагу спокойно умереть. Но голос проник в его мысли, и Слайрак прошептал, что рыцарь окажет ему честь, позволив умереть в бою. Рыцарь согласился, и был вознагражден за проявленное милосердие: как только он вонзил свой меч в горло дракона, тот воткнул свой коготь ему в горло. Когда их кровь смешалась, Слайрак передал ему свои силы через кровяной поток, предлагая рыцарю свою стойкость и мудрость веков. Смерть дракона скрепила их союз. Так и родился Dragon Knight. Древние силы дремлют в рыцаре, просыпаясь, когда он зовет их себе на помощь; или, возможно, это дракон зовет рыцаря...","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Золото с таланта является ненадёжным.","Талант на силу в общем даёт Dragon Knight: 900 здоровья, 5 регенерации здоровья, 4% сопротивления магии и 40 урона от атаки."],"trivia":["В оригинальной DotA, Dragon Knight носил шутливое имя — Trogdor, это имя играбельного персонажа мини игры в Home Star Runner universe.","Dragon Tail – одно из самых продолжительных оглушений на первом уровне способности."],"talents":["+1,75 сек. оглушения от Dragon Tail:+40 к силе","+100% к броне и регенерации от Dragon Blood:+150 золота в минуту","+300 к здоровью:+30 к урону","+20% к снижению урона Breathe Fire:+3 маны в секунду"],"desc":"Dragon Knight — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Breathe Fire, Dragon Knight извергает огненное дыхание на вражеских юнитов в линии перед Dragon Knight, поджигая их и уменьшая урон от их атак. Вторая способность, Dragon Tail, поражает щитом врага в радиусе ближнего боя, оглушая его и нанося небольшой урон. Когда рыцарь находится в форме дракона, он может применять заклинание на большем расстоянии. Пассивная способность, Dragon Blood, увеличивает показатель брони героя и скорость восстановления здоровья. Ультимативная способность, Elder Dragon Form, превращает в одного из трех могущественных древних драконов, увеличивая свой урон, скорость передвижения и дальность применения Dragon Tail, а также получает новые способности."}