{"abilities":[{"spell":"Извергает огненное дыхание на вражеских юнитов в линии перед Dragon Knight, поджигая их и уменьшая урон от их атак.","effects":["Способность Направленная на точку \/ Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["Breathe Fire летит со скоростью в 1050 единиц.","Может поражать юнитов на расстоянии до 1000 единиц (складывается из дистанции прохождения и конечного радиуса).","Площадь поражения представляет собой конус.","Снижает весь урон пораженных юнитов, включая урон, даваемый атрибутами.","В форме Elder Dragon Form у способности время после применения равняется 0,53 секунды."],"mana":"100\/110\/120\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"14\/13\/12\/11","name":"Breathe Fire","description":["Анимация применения: 0,2+0,47","Дальность применения: 600","Начальный радиус: 150","Дистанция прохождения: 750","Конечный радиус: 250","Урон: 90\/170\/240\/300","Снижение урона: 25% ( 55%)","Длительность снижения урона: 11"],"hot_key":"Q","legacy_key":"F"},{"spell":"Dragon Knight поражает своим щитом врага в радиусе ближнего боя, оглушая его и нанося небольшой урон. Когда рыцарь находится в форме дракона, он может применять заклинание с расстояния в 400 единиц.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Магический"],"notes":["В форме Elder Dragon Form дальность применения равна 400 и способность использует снаряд вместо мгновенного применения. Скорость полета снаряда - 1600.","Dragon Tail сначала наносит урон, затем применяет дебафф.","В форме человека способность не использует снаряд, поэтому Strafe не может избежать оглушения."],"mana":"100","elements":["Можно избежать.","Блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"12\/11\/10\/9","name":"Dragon Tail","description":["Анимация применения: 0+0,5","Дальность применения: 150","Урон: 25\/50\/75\/100","Длительность оглушения: 2.5\/2.75\/3\/3.25 ( 4.5\/4.75\/5\/5.25)"],"hot_key":"W","legacy_key":"T"},{"spell":"Текущая в жилах Dragon Knight кровь дракона улучшает его регенерацию здоровья и броню.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Напрямую усиливает регенерацию здоровья; восстанавливает 0.4\/0.8\/1.2\/1.6 ( 0.8\/1.6\/2.4\/3.2) единиц здоровья с интервалом в 0,1 секунды.","Восстанавливает 240\/480\/720\/960 ( 480\/960\/1440\/1920) единиц здоровья за одну минуту."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением."],"cooldown":"0","name":"Dragon Blood","description":["Восстановление здоровья: 4\/8\/12\/16 ( 8\/16\/24\/32)","Дополнительная броня: 3\/6\/9\/12 ( 6\/12\/18\/24)"],"hot_key":"E","legacy_key":"D"},{"spell":"Герой обращается в одного из трёх могучих древних драконов, отчего быстрее передвигается, может дальше применять Dragon Tail и получает особые эффекты атаки: УРОВЕНЬ 1: зелёный дракон с ядовитой атакой Атаки отравляют цель, нанося ей 20 урона в секунду. Яд действует 5 секунд и наносит урон постройкам. УРОВЕНЬ 2: красный дракон с массовой атакой Атаки наносят 75%\/75%\/75%\/115% урона всем врагам в радиусе 300 от цели. Отравляет всех задетых врагов. УРОВЕНЬ 3: синий дракон с леденящей атакой На 3 секунды замедляет всех жертв массовой атаки, снижая их скорость передвижения на 40%, а скорость атаки — на 40. Отравляет всех задетых врагов.","effects":["Способность Ненаправленная","Действует на Себя \/ Врагов","Урон Магический \/ Физический"],"notes":["Уровень 4 доступен только с Aghanim's Scepter. У способности остается 3 уровня для изучения, а предмет автоматически повышает её уровень на 1.","Увеличивает скорость передвижения Dragon Knight до 320, дальность атаки — до 500\/500\/500\/600, а сопротивление магии — до 25%\/25%\/25%\/65%.","Также дает Dragon Knight снаряды дальней атаки. Его снаряды летят со скоростью в 900 единиц.","1-й уровень способности превращает его в зеленого дракона, 2-й уровень — в красного, 3-й уровень — в синего, 4-й — в черного. Черный дракон на 30% больше остальных.","Elder Dragon Form отменяется при смерти. Бафф Dragon Form скрытый, отображаются только 3 модификатора атаки.","Несколько использований Elder Dragon Form обновит длительность и форму, подстраиваясь под текущий уровень способности.","В форме Elder Dragon Form Dragon Knight получает следующие модификаторы атаки с неразвеиваемыми баффами:","Corrosive Breath: (Доступен с 1-го уровня Elder Dragon Form) Применяет дебафф, наносящий урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 5 раз. С 2-го уровня дебафф применяется ко всем врагам в максимальном радиусе урона по области. Может нанести до 100\/100\/100\/150 единиц урона юниту (до учета снижений). Не действует на варды, но действует на союзных юнитов. Corrosive Breath действует на строения, поэтому его также можно использовать для добивания союзных башен. Но при этом строения получают дебафф только при непосредственной атаке по ним. Несколько атак не складываются, но обновляют время действия дебаффа. В случае, если атака промахнулась или её избежали, дебафф не применяется в радиусе действия.","Splash Attack: (Доступен с 2-го уровня Elder Dragon Form) В случае, если атака промахнулась или её избежали, то урон по области не срабатывает. Урон по области физический, поэтому на него действует блокировка урона. Не действует на варды или строения.","Frost Breath: (Доступен с 3-го уровня Elder Dragon Form) Не действует на варды, строения или союзных юнитов. Несколько атак не складываются, но обновляют время действия дебаффа. Атаки сначала применяют дебафф, затем наносят урон. Урон по области также применяется после дебаффа. В случае, если атака промахнулась или её избежали, замедление не применяется в радиусе действия."],"mana":"50","elements":["Частично используется иллюзиями.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"115","name":"Elder Dragon Form","description":["Анимация применения: 0+0,5","Доп. дальность атаки: 350\/350\/350\/450","Доп. скорость передвижения: 30","Доп. сопротивление магии: 0%\/0%\/0%\/40%","Доп. дальность применения Dragon Tail: 250","Длительность: 60","Corrosive Breath: урон в секунду: 20\/20\/20\/30","Corrosive Breath: длительность дебаффа: 5","Splash: радиус атаки: 300","Splash: урон от атаки: 75%\/75%\/75%\/115%","Frost Breath: радиус: 300","Frost Breath: замедление скорости передвижения: 40%\/40%\/40%\/60%","Frost Breath: замедление скорости атаки: 40\/40\/40\/60","Frost Breath: длительность дебаффа: 3"],"hot_key":"R","legacy_key":"R"}],"bio":"Много лет рыцарь Дэйвион выслеживал легендарного древнего дракона, но когда наконец предстал перед своим врагом, страшно разочаровался: ужасающий Слайрак состарился и ослаб, его крылья истрепались, поредевшая чешуя прогнила, клыки отупели, а огненное дыхание стало не страшнее коробка отсыревших спичек. Не видя чести в его убийстве, Дэйвион хотел уйти и позволить старому врагу спокойно умереть. Но в его мысли проник голос: Слайрак прошептал, что рыцарь окажет ему честь, позволив умереть в бою. Рыцарь согласился, и был вознаграждён за проявленное милосердие: как только он вонзил свой меч в грудь дракона, тот пронзил его горло своим когтем. Когда их кровь смешалась, Слайрак передал рыцарю свою стойкость и мудрость веков. Смерть дракона скрепила их узы. Дэйвион словно родился вновь: древние силы дремлют в рыцаре, просыпаясь, когда он взывает к их помощи; или, быть может, это дракон взывает к рыцарю…","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Этот талант добавляет урон от атаки в прямой урон от атаки, так что он не даётся иллюзиям, и также не попадает под действие большинства эффектов увеличивающих или уменьшающих урон на процентное значение.","Талант на силу в общем даёт Dragon Knight: 500 здоровья, 2.5 регенерации здоровья, 2% сопротивления магии и 25 урона от атаки.","Золото с таланта является ненадёжным."],"trivia":["В оригинальной DotA, Dragon Knight носил шутливое имя — Trogdor, это имя играбельного персонажа мини игры в Home Star Runner universe.","Dragon Tail – одно из самых продолжительных оглушений на первом уровне способности."],"talents":["+2 сек. оглушения от Dragon Tail:+100% к броне и регенерации от Dragon Blood","+25 к силе:+180 золота в минуту","+400 к здоровью:+30 к урону","+30% к снижению урона Breathe Fire:+3 маны в секунду"],"desc":"Dragon Knight — это герой с ближним типом атаки, основной характеристикой которого является сила. Первой способностью, Breathe Fire, Dragon Knight извергает огненное дыхание на вражеских юнитов в линии перед Dragon Knight, поджигая их и уменьшая урон от их атак. Вторая способность, Dragon Tail, поражает щитом врага в радиусе ближнего боя, оглушая его и нанося небольшой урон. Когда рыцарь находится в форме дракона, он может применять заклинание на большем расстоянии. Пассивная способность, Dragon Blood, увеличивает показатель брони героя и скорость восстановления здоровья. Ультимативная способность, Elder Dragon Form, превращает в одного из трех могущественных древних драконов, увеличивая свой урон, скорость передвижения и дальность применения Dragon Tail, а также получает новые способности."}