{
  "abilities": [
    {
      "notes": [
        "Поражает существ на расстоянии до 1000 единиц (складывается из начального радиуса, дальности применения и конечного радиуса)",
        "Область поражения имеет форму конуса, расходящегося от Shadow Shaman. Начальный радиус начинается от самого Shadow Shaman, а не от позиции основной цели. Способность выбирает цели не случайно, а исходя от близости к основной цели и их доступности в зоне конуса",
        "Все молнии наносят до 140\/600\/1300\/2240 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 520\/1740\/3200\/4900) единиц урона (до уменьшений)",
        "Назначение модификатора неизвестно"
      ],
      "item_behaviour": [],
      "description": "Создаёт конус бесплотной энергии, который бьёт по нескольким вражеским существам.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,3+1,23",
        "Дальность применения: 600",
        "Начальный радиус: 200",
        "Максимальное расстояние: 500",
        "Конечный радиус: 300",
        "Число целей: 1\/3\/5\/7",
        "Урон: 140\/200\/260\/320 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 520\/580\/640\/700)"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/19\/Shadow_Shaman_Ether_Shock.mp3\/revision\/latest?cb=20191216023116",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "14\/12\/10\/8",
      "aghanim": null,
      "name": "Ether Shock",
      "cooldown": "100\/115\/130\/145",
      "legacy_key": "R",
      "story": "Когда-то красочные молнии Расты впечатляли зрителей. Но не повезёт тем, на кого эти молнии направлены."
    },
    {
      "notes": [
        "Применяет к цели проклятие, приравнивая её базовую скорость передвижения к 100, обезмолвивая, заглушая и обезоруживая её. При этом на скорость передвижения цели все еще влияют бонусы от предметов и способностей",
        "Мгновенно уничтожает иллюзии",
        "Проклятие Shadow Shaman превращает цель в курицу. Косметические предметы Lamb to the Slaughter и Golden Lamb to the Slaughter меняют модель на овцу"
      ],
      "item_behaviour": [],
      "description": "Превращает врага в безобидную зверюшку, лишая его возможности атаковать или применять способности.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0+1,13",
        "Дальность применения: 500",
        "Скорость движения цели: 100",
        "Длительность: 1,25\/2\/2,75\/3,5"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/1\/13\/Shadow_Shaman_Hex_1.mp3\/revision\/latest?cb=20191216023108",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Мгновенное убийство"
      ],
      "mana": "13 (TagTalent 10)",
      "aghanim": null,
      "name": "Hex",
      "cooldown": "70\/110\/150\/190",
      "legacy_key": "D",
      "story": "Раста часто заканчивал представление, превращая себя в курицу. Теперь он может унизить таким образом кого пожелает."
    },
    {
      "notes": [
        "Оглушение действует до тех пор, пока способность произносится. Если цель получила неуязвимость или её спрятали, то произнесение мгновенно завершается",
        "Раскрывает невидимости цели, если на момент применения она не была невидима или не уходила в невидимость",
        "Наносит урон с интервалом в 0,1 секунды сразу после начала применения, срабатывая 28\/35\/43\/50 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 38\/45\/53\/60) раз. Урон за тик рассчитывается как максимальный урон, поделенный на базовую длительность в 2,75\/3,5\/4,25\/5 сек., а затем на 10. Бонус от увеличивающего длительность <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> таланта не учитывается. В результате получается 2,182\/3,714\/4,706\/5,4 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 7,818\/8,143\/8,353\/8,5) урона за тик или 21,82\/37,14\/47,06\/54 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 78,18\/81,43\/83,53\/85) урона в секунду. Всего способность нанесет (до уменьшений) до 61,09\/130\/202,35\/270 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 218,91\/285\/359,18\/425) урона С увеличивающим длительность <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантом способность суммарно нанесёт 82,91\/167,14\/249,41\/324 урона. С обоими <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талантами суммарно нанесет до 297,09\/366,43\/442,71\/510 урона",
        "Лечение вычисляет по тому же принципу, что и урон. Оно применяется после каждого срабатывания урна. Всегда излечивает на полное количество здоровья за тик вне зависимости от того, сколько фактического урона было нанесено",
        "Увеличивающий урон <span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> талант мгновенно применяется к текущему применения",
        "В отличии от других направленных заклинаний длительность обзора для заклинателя равна длительность произнесения (даже если способность прервали), а не 2 секундам",
        "С  Aghanim's Shard призывает 4  змеиных тотема текущего уровня на расстоянии 100 единиц от цели на севере, западе, юге и востоке. Тотемы смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности. Эти тотемы так же получают улучшение от  Aghanim's Scepter и на них распространяются те же настройки автоатаки. Если  Mass Serpent Ward не изучена, то тотемы не призываются"
      ],
      "item_behaviour": [],
      "description": "Связывает врага магическими путами, не позволяющими передвигаться или атаковать, а также наносящими периодический урон.",
      "hot_key": "E",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 450 ( 525)",
        "Макс. длительность: 2,75\/3,5\/4,25\/5 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 3,75\/4,5\/5,25\/6)",
        "Общий урон\/лечение: 60\/130\/200\/270 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 215\/285\/355\/425)",
        "Число Serpent Ward:  4",
        "Время жизни вардов:  7"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/6b\/Shadow_Shaman_Shackles.mp3\/revision\/latest?cb=20191216023113",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов \/ Себя",
        "Урон: Магический"
      ],
      "mana": "16\/14\/12\/10",
      "aghanim": null,
      "name": "Shackles",
      "cooldown": "140\/150\/160\/170",
      "legacy_key": "E",
      "story": "Заклинание самообороны, познанное Растой после гибели его учителя на Кровоточащих холмах."
    },
    {
      "notes": [
        "Размещает змеиные тотемы каждые 36 градусов круга радиусом в 150 единиц, вызывая 10 тотемов. Тотемы создают непроходимый барьер, поэтому враги не могут из него выбраться без наличия сквозного прохождения. Для выхода или входа в круг достаточно разрушить один тотем. Тотемы смотрят в ту же сторону, куда смотрел Shadow Shaman при использовании способности",
        "Тотемы автоматически атакуют врагов в пределах дальности атаки, используя ◉ Стандартно стандартные правила автоатаки. Можно задать цель для атаки, используя A или  Нажатие ПКМ по цели в радиусе дальности атаки. С активной опцией «Приказ всем юнитам»: Ctrl+ Нажатие ПКМ на врага в пределах дальности атаки выберет его в качестве цели атаки всех тотемов. Также можно отдать приказ тотемам на прекращение атаки c помощью S (работает лишь с опциией автоатаки ◎ Никогда в настройках)",
        "Приоритет атаки тотемов ниже, чем у других существ и героев, поэтому башни и крипы будут их атаковать в последнюю очередь",
        "С  Aghanim's Scepter тотемы совершают мгновенные атаки по  врагу при запуске снаряда. То есть дополнительный снаряд выпускается одновременно со снарядом основной атаки. При этом не важно, промахнулась ли атака по главной цели или нет, дополнительный снаряд все равно будет запущен. Снаряд от дополнительной атаки летит с той же скоростью, что и снаряд от основной атаки, и его можно избежать так же, как и обычную атаку. Эти мгновенные атаки не активируют модификаторы атаки и эффекты, срабатывающие при атаке. Атаки змей не имеют эффект True Strike, они могут промахиваться. При этом на атаки влияют разные типы брони и уклонение. Не выбирают дополнительной целью варды, невидимых существ, существ с иммунитетом к атакам или в тумане войны. Выбирает целью постройки. Вторичная цель выбирается случайно без какого-либо приоритета"
      ],
      "item_behaviour": [],
      "description": "Призывает 10 невосприимчивых к магии змеиных тотемов, атакующих врагов и постройки.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,3+0,97",
        "Дальность применения: 550",
        "Радиус появления: 150",
        "Число вардов: 10",
        "Атак героев\/башен для уничтожения: 2 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 3)",
        "Атак не-героев для уничтожения: 4 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 6)",
        "Время жизни тотемов: 45",
        "Радиус разделенного урона:  875 (<span image=\"images\/Talent_tree_symbol.webp\">Talent_tree_symbol<\/span> 995)",
        "Доп. цели для атаки:  1"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/c7\/Shadow_Shaman_Mass_Serpent_Ward.mp3\/revision\/latest?cb=20191216023109",
      "effects": [
        "Способность: Направленная на точку",
        "Урон: Физический"
      ],
      "mana": "130\/120\/110",
      "aghanim": null,
      "name": "Mass Serpent Ward",
      "cooldown": "200\/350\/550",
      "legacy_key": "W",
      "story": "Заклинание змей было важным элементом в выступлениях Расты. Теперь же змеи беспрекословно выполняют его приказы."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.3,
    "attrStrength": 23.0,
    "attrIntelligence": 19.0,
    "attrIntelligenceInc": 3.5,
    "attrAgilityInc": 1.6,
    "attrAgility": 16.0
  },
  "description": "Призывает могучих змеев, наносящих урон Shadow Shaman быстро расчищает своей команде путь до вражеского Древнего. Он способен поразить противников ударом энергии, превратить нападающего в беспомощное животное и призвать могучие змеиные тотемы, которые с лёгкостью разрушат вражеские постройки.  Поддержка Осада Контроль Быстрый урон Инициация ★☆☆",
  "history": "Рождённый на Кровоточащих холмах, юный Раста жил впроголодь, пока его не подобрал странствующий шарлатан. За два медяка старый пройдоха мог предсказать судьбу. За три — кастрировать свинью. За пять — совершить обрезание. За хорошие харчи он мог облачиться в шкуру шамана и зачитать проклятия из древних книг, насылая их на ваших врагов. А чудной юнец, наполовину холмовой тролль, наполовину… что-то ещё, работал помощником и придавал налёт экзотики услугам старого ловкача. Всегда на шаг впереди облапошенных покупателей, на один город впереди взбешённых преследователей, эти двое путешествовали по гиблым землям до тех пор, пока шарлатан не понял, что его юный напарник на самом деле способен на то, чем сам старик только дурил зрителей. Его подопечный имел дар, который очень ценили клиенты. И вот юный Раста стал развлекать толпу, и прозвали его тогда шаманом теней. Напарники продолжили странствовать по городам, колдуя за деньги, а молва о кудеснике всё росла и росла. В конце концов странников настигло шарлатанское прошлое: их подкараулила толпа обманутых покупателей. Шарлатана убили, и впервые в жизни Раста использовал свою силу во зло, перебив всех нападавших. Он похоронил своего любимого учителя и теперь использует свою силу против любого, кто посягнёт на его жизнь."
}