{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/41\/Abyssal_Blade_Overwhelm.mp3\/revision\/latest?cb=20191227195611",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Self"
      ],
      "notes": [
        "Moves the user next to the target, positioning them randomly around the target.",
        "Does not disjoint projectiles upon teleporting.",
        "The user is ordered to attack the target.",
        "Can be cast on couriers.",
        "Despite the visual effects, the effect is instant and does not need to travel."
      ],
      "mana": "75",
      "abilityName": "Overwhelm",
      "cooldown": null,
      "description": "Blinks to and stuns a target enemy unit for 2 seconds. Pierces Spell Immunity.",
      "params": [
        "Cast Range: 550",
        "Stun Duration: 2"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/61\/Abyssal_Blade_Bash.mp3\/revision\/latest?cb=20191227195343",
      "effects": [
        "Ability Passive",
        "Affects Enemies",
        "Damage Physical"
      ],
      "notes": [
        "Abyssal Blade's bash does not stack with the bash of Skull Basher and other Abyssal Blades.",
        "When obtaining multiple items with the bash ability, only the one that has been continuously the longest in the inventory works.",
        "The proccing attack first applies the debuff, then its own damage.",
        "The bonus damage is dealt in one instance together with the attack damage, and counts as attack damage as well. It can be lifestealed off of, but it is not considered by crit or cleave. It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "It can be lifestealed off of, but it is not considered by crit or cleave.",
        "It is also not affected by percentage-based attack damage bonuses or reductions, but can be reduced with flat reductions.",
        "Adds an average of 25 damage to every attack for melee heroes, and 10 damage for ranged heroes.",
        "Does not work against wards and buildings, but works against allied units.",
        "Bash uses pseudo-random distribution.",
        "Abyssal Blade's Bash does not use a regular cooldown. It is neither displayed on the item icon when proccing, nor is it affected by cooldown manipulating effects."
      ],
      "mana": null,
      "abilityName": "Bash",
      "cooldown": "2.3",
      "description": "Grants melee heroes a 25% chance on hit to stun the target for 1.5 seconds and deal 100 bonus physical damage. Bash chance for ranged heroes is 10%.",
      "params": [
        "Proc Chance (Melee): 25%",
        "Proc Chance (Ranged): 10%",
        "Damage: 100",
        "Stun Duration: 1.5"
      ],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Ability Passive",
        "Affects Self"
      ],
      "notes": [
        "Does not work against wards (TagTalent Plague Ward, Mass Serpent Ward, Death Ward).",
        "Does not reduce physical damage from spells, except from Moon Glaives and The Swarm.",
        "Damage Block uses pseudo-random distribution.",
        "For more details, see Damage Block."
      ],
      "mana": null,
      "abilityName": "Damage Block",
      "cooldown": null,
      "description": "Grants a 50% chance to block 70 damage from incoming attacks on melee heroes, and 35 damage on ranged.",
      "params": [
        "Proc Chance: 50%",
        "Blocked Damage (Melee): 70",
        "Blocked Damage (Ranged): 35"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 450 health, 11 health regen and 35 attack damage.",
    "For agility heroes, it grants 450 health, 11 health regen and 25 attack damage.",
    "For intelligence heroes, it grants 450 health, 11 health regen and 25 attack damage.",
    "When held by Slardar, Spirit Breaker, Faceless Void, Bash cannot proc.",
    "When held by a hero that has the Time Lock passive (e.g. in Ability Draft), Bash cannot proc either."
  ],
  "cost": "6625",
  "lore": null,
  "consistFrom": [
    "Skull Basher",
    "Vanguard",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Abyssal Blade",
  "description": "The lost blade of the Commander of the Abyss, this edge cuts into an enemy's soul.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+10 Strength",
    "+250 Health",
    "+10 Health regeneration",
    "+25 Attack damage"
  ],
  "tips": [
    "Use Overwhelm to interrupt the enemy heroes' channeling such as Town Portal Scroll or any channeled abilities like Freezing Field.",
    "Although sometimes optional, it is best to buy items that grant attack speed which procs Bash more.",
    "Since the Bash pierces spell immunity, it is best used when facing heroes with spell immunity (such as Juggernaut or Lifestealer). The active ability also has a guaranteed 2-seconds stun that also pierces spell immunity.",
    "Be careful when facing heroes with skills\/items that applies strong dispel such as Aphotic Shield or Dark Pact, it is best to use abilities with silence or mute to compensate this."
  ]
}