{"abilities":[{"spell":"Consumes an enemy or neutral creep, acquiring any special abilities that it possessed.","effects":["Ability Target Unit \/ Autocast","Affects Enemy Units","Damage Pure (HP Removal)"],"notes":["The autocast is just to enable acquring spells of neutral creeps. It does not make Doom cast the spell automatically.","Can target all neutral creeps and summons, except for couriers, ancient creeps and creep-heroes. Can target ancient creeps (excluding couriers and Roshan) when the talent for it is chosen.","The targeted creep is instantly killed, granting its bounty and experience like a regular last hit.","Doom acquires neutral creep abilities only when casting Devour while its autocast is turned on. Can only gain abilities from neutral creeps. Other units' abilities cannot be gained. Abilities are gained instantly upon devouring the creep. The abilities use the original cast point of the neutral creeps they come from, however, the cast backswing differs depending on the spell (see chart). Abilities from neutral creeps are kept permanently, even through death, until another neutral creep with abilities is devoured with autocast on. When autocast is on, devouring a creep with no abilities does not remove the already acquired abilities. When devouring Ancient Black Dragons, Doom gets Fireball and Splash Attack, but not Dragonhide Aura. When devouring Ancient Thunderhides, Doom gets Frenzy and War Drums Aura, but not Slam.","The bonus gold is unreliable and granted when the debuff expires. Losing it upon death does not grant the gold.","Can regenerate up to 240\/640\/1040\/1440 health over its full duration.","Multiple instances of the modifier fully stack with each cast."],"mana":"40\/50\/60\/70","elements":["Not blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"70\/60\/50\/40","name":"Devour","description":["Cast Animation: 0.3+0.93","Cast Range: 300","Gold Bonus: 25\/50\/75\/100 ( 175\/200\/225\/250)","Health Regeneration Bonus: 3\/8\/13\/18","Digest Duration: 80"],"hot_key":"Q","legacy_key":"E"},{"spell":"Carpets the nearby earth in flames which damage enemies, while also granting him increased movement speed.","effects":["Ability No Target","Affects Enemies \/ Self","Damage Magical"],"notes":["Scorched Earth interrupts Doom's channeling spells upon cast.","Scorched Earth's radius is centered on Doom for the full duration.","Units under Doom's control benefit from Scorched Earth when they are inside the radius.","The movement speed bonus is provided by an aura, which lingers for 0.5 seconds.","The damage is independent from the aura.","Deals damage in 1-second intervals, starting 1 second after cast, resulting in up to 10\/12\/14\/16 possible instances.","Can deal up to 200\/360\/560\/800 ( 400\/600\/840\/1120) damage to a single enemy when within range for the entire duartion (before reductions).","Scorched Earth does not stack with itself. Casting the ability while it is active refreshes the buff.","Choosing the damage talent immediately upgrades damage of the current cast, however, leveling the spell up does not update it.","Choosing the movement speed talent or leveling up the spell does not update the speed of the current cast."],"mana":"60\/65\/70\/75","elements":["Partially pierces spell immunity."],"cooldown":"50\/45\/40\/35","name":"Scorched Earth","description":["Cast Animation: 0+1.27","Radius: 600","Damage per Second: 20\/30\/40\/50 ( 40\/50\/60\/70)","Move Speed Bonus: 11%\/12%\/13%\/14% ( 27%\/28%\/29%\/30%)","Aura Linger Duration: 0.5","Duration: 10\/12\/14\/16"],"hot_key":"W","legacy_key":"T"},{"spell":"Doom swings his burning sword, igniting the enemy. Stuns for 0.6 seconds and applies a 4 second burn that deals 25 + 1.25%\/2.5%\/3.75%\/5% of the target's Max HP as damage per second.","effects":["Ability Target Unit \/ Autocast","Affects Enemies","Damage Magical"],"notes":["Deals damage in 1-second intervals, starting 1 second after the debuff is applied, resulting in 4 instances.","Can deal up to 100 + 5%\/10%\/15%\/20% ( 17%\/22%\/27%\/32%) of the target's maximum health as damage (before reductions).","Multiple instances on the same target fully stack and work independently.","The stun is provided by a bash, which fully stacks with other bash abilities.","The attack first applies the debuffs, then its own damage.","Does not trigger for instant attacks.","Does not work against Roshan.","Choosing the damage talent or leveling up the spell does not update the damage of already existing instances."],"mana":"40","elements":["Not blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"16\/12\/8\/4","name":"Infernal Blade","description":["Cast Range: 150","Base Damage per second: 25","Max Health as Damage per Second: 1.25%\/2.5%\/3.75%\/5% ( 4.25%\/5.5%\/6.75%\/8%)","Damage Duration: 4","Bash Duration: 0.6"],"hot_key":"E","legacy_key":"V"},{"spell":"Inflicts a curse that prevents an enemy Hero from casting spells or using items, while taking damage over time.","effects":["Ability Target Unit","Affects Enemies","Damage Pure"],"notes":["Applies a basic dispel on the target upon cast, removing most buffs in the process.","Silences and mutes the target, preventing it from casting spells and using items.","Cannot be cast on ancient creeps. Can be cast on creep-heroes and illusions. In the case of a unit being both a creep-hero and ancient creep, the ancient unit tag takes priority, disallowing it to be targeted.","Deals damage in 1-second intervals, starting immediately upon cast, resulting in ( at least) 16 instances.","Can deal up to ( a minimum of) 400\/640\/880 ( 1040\/1280\/1520) damage (before reductions).","Heroes afflicted by Doom can be denied when their health drops below 25%.","Multiple casts on the same unit do not stack, but only refresh the duration.","When upgraded with Aghanim's Scepter, the debuff checks for the caster's presence before each damage interval. If the caster is within 900 range, one second gets added to the duration, effectively pausing the duration. On each interval, the debuff icon's duration indicator is updated, showing the remaining duration. Does not react on illusions of the caster.","Applies a break on the target when upgraded with Aghanim's Scepter, disabling passive abilities.","Leveling up the spell does not update the damage of already existing instances, but choosing the damage talent does."],"mana":"150\/200\/250","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"145","name":"Doom","description":["Cast Animation: 0.5+0.73","Cast Range: 550","Duration Stop Radius: 0 ( 900)","Damage per Second: 25\/40\/55 ( 65\/80\/95)","Duration: 16"],"hot_key":"R","legacy_key":"D"},{"spell":"There is no description for this ability.","effects":["Ability Passive","Affects Enemies","Damage Physical"],"notes":["Cleave damage cannot be amplified with spell damage amplification and cannot spell lifesteal.","Cleave damage is reduced by Damage Block.","The complete area is shaped like an isosceles trapezoid in front of Doom.","Fully stacks with other sources of cleaves. Each source of cleave works completely independent.","Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.","Despite the visual effect, cleave damage is applied instantly in the whole area."],"mana":"0","elements":["Cannot be used by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Cleave","description":["Starting Radius: 150","Distance: 650","End Radius: 360","Cleave Damage: 130%"]}],"bio":"He that burns and is not consumed, devours and is never sated, kills and is beyond all judgment--Lucifer brings doom to all who would stand against him. Bearing away souls on the tip of a fiery sword, he is the Fallen One, a once-favored general from the realm behind the light, cast out for the sin of defiance: he would not kneel. Six times his name was tolled from the great bell of Vashundol. Six and sixty times his wings were branded, until only smoking stumps remained. Without wings, he slipped loose from the tethers that bound him within the light and he fell screaming to earth. A crater in the desert, Paradise lost. Now he attacks without mercy, without motive, the only living being able to move freely between the seven dark dominions. Lashed by inescapable needs, twisted by unimaginable talents, Doom carries his own hell with him wherever he goes. Defiant to the last. Eventually, the world will belong to Doom.","talentsTips":["The evasion talent stacks multiplicatively with other sources of evasion."],"trivia":["In DotA, Doom used to be known as Doombringer, which was first kept as Doom Bringer in the transition to Dota 2. Later with the January 10, 2013 update, his name was changed to avoid copyright conflicts with Blizzard.","Several of Doom's abilities are inspired by Final Fantasy's Blue Mages. LVL? Death was based on the Level 5 Death ability and the mechanics of a LVL? S-flare. Devour is highly similar to Quina Quen's eat and cook ability from Final Fantasy IX. His ultimate, Doom, also shares the same name of another Blue Mage ability, but the mechanics differ.","His name, Lucifer, is taken from the Bible's Book of Isaiah and translates roughly to \"morning star\". It is often used to refer to the Biblical Devil (or Satan), thus fitting Doom's evil and demonic image.","Doom's ultimate icon depicts a pentacle which, despite its popular connotation as Satanic\/\"evil\" mark, is actually a Pagan symbol of protection. For its common \"evil\" symbolism to apply, the pentagram has to be inverted; this only occasionally occurs in-game, as the \"star\" inside the circle of the ability's particle effect slowly rotates.","Doom's response upon taking an Invisibility Rune, \"Heheheh, see no evil.\", refers to the Three wise monkeys and their associated phrase: \"See no evil, hear no evil, speak no evil.\" Riki also has this line.","His ultimate and signature ability, Doom, is derived from the Pit Lord's, a playable hero in Warcraft III: Frozen Throne. The original ability varied in that it was only castable on non-hero units, is non-removable, and would spawn a Doomguard on its death. The Doomguard's model was Lucifer's hero model in DotA."],"talents":["+130% Cleave:+3% Infernal Blade Damage","Devour Can Target Ancients:+40 Doom DPS","+150 Devour Bonus Gold:20% Evasion","+16% Scorched Earth Movement Speed:+20 Scorched Earth Damage"],"desc":"Lucifer, the Doom, is a melee strength hero with strong farming capabilities, good versatility, and one of the strongest single-target disables in the game. His very low starting armor makes him vulnerable to harassment, but his abilities and high health allow him to lane or even jungle quite effectively. A ruthless demon, Doom possesses malicious abilities revolving around greed, fire, and death. His Devour ability allows him to consume creeps, providing additional gold and allowing him to absorb their powers, using them to increase his own strength. Because there are numerous neutral creep abilities to choose from to supplement his other abilities, the role that he chooses to play is quite flexible. Scorched Earth serves numerous purposes, allowing him to chase, escape, regenerate, and slowly burn his enemies all at once. He can deal tremendous damage with Infernal Blade, an attack modifier which mini-stuns enemies and deals damage over time, based on their maximum health, making it a powerful nuking ability that scales into the late game. Finally, his namesake ultimate Doom serves as one of the strongest single-target lockdown abilities in the game. A unit afflicted with Doom takes intense damage over a lengthy duration while having all its active abilities - even those from items - completely silenced. With numerous expensive items in his arsenal and a key enemy hero rendered useless for a teamfight, a farmed Doom ensures that nobody can extinguish his flame."}