{"abilities":[{"spell":"Пожирает вражеского или нейтрального крипа, перенимая его способности.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Вражеских существ","Урон Чистый (Отнимающий здоровье)"],"notes":["Автоприменение просто разрешает перенимать заклинания нейтральных крипов. Оно не заставляет Doom автоматически применять способность.","Целью могут быть все нейтральные крипы и призываемые существа, за исключением курьеров, древних крипов и крипов-героев. При выборе соответствующего таланта целью могут стать древние крипы (исключая курьеров и Рошана).","Выбранный крип мгновенно умирает, при этом герой получит награду и опыт как будто он совершил последний удар.","Doom получает способности нейтральных крипов только есть способность находится на автоприменении. Может получать способности от нейтральных крипов. Способности других юнитов не передаются. Заклинания приобретаются мгновенно при пожирании нейтрального крипа. Способности используют то же время применения, что было у поглощенного юнита, однако задержка на применение зависит от заклинания (смотрите эту статью). Способности, перенятые от нейтральных крипов, сохраняются даже после смерти Doom до момента, пока герой не поглотит другого нейтрального крипа со способностями с включенным автоприменение. Если использовать заклинание с автоприменением на крипе без способностей, перенятые ранее способности сохранятся. Когда Doom пожирает Древнего дракона, то он получает Fireball и Splash Attack, но не Dragonhide Aura. Когда Doom пожирает Древнего громозавра, то он получает Frenzy и War Drums Aura, но не Slam.","За пожирание крипа вы получите как обычное, так и бонусное золото. Бонусное золото - это ненадёжное золото и предоставляется оно по истечению срока действия отрицательного эффекта. Если герой умрет во время переваривания, то он не получит дополнительное золото.","Восстанавливает здоровье в виде регенерации, регенерируя 0.3\/0.8\/1.3\/1.8 здоровья с интервалом в 0,1 секунды.","За всю длительность восстанавливает до здоровья.","Модификаторы от нескольких применений складываются."],"mana":"40\/50\/60\/70","elements":["Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"70\/60\/50\/40","name":"Devour","description":["Анимация применения: 0,3+0,93","Дальность применения: 300","Дополнительное золото: 25\/50\/75\/100 ( 175\/200\/225\/250)","Доп. восстановление здоровья: 3\/8\/13\/18","Длительность: 80"],"hot_key":"Q","legacy_key":"E"},{"spell":"Устилает пламенем землю вокруг героя, увеличивая его скорость передвижения, а также нанося урон противникам.","effects":["Способность Ненаправленная","Действует на Врагов \/ Себя","Урон Магический"],"notes":["При использовании Scorched Earth прерывает произносимые способности Doom.","Scorched Earth передвигается вместе с героем.","Подконтрольные существа героя также получают бонусы от этой способности, если остаются в радиусе действия.","Скорость передвижения предоставлена аурой, задерживающейся на 10\/12\/14\/16 секунды.","Урон не связан с аурой.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения, срабатывая до раз.","Может нанести до 200\/360\/560\/800 ( 400\/600\/840\/1120) единиц урона одному врагу, если он оставался в радиусе действия всю длительность (до учета сопротивлений).","Несколько применений Scorched Earth не складываются. Активация способности просто обновит бафф.","Выбор таланта на дополнительный урон мгновенно увеличит урон от текущего применения, но поднятие уровня способности урон не увеличивает.","Выбор таланта на дополнительную скорость передвижения не увеличит скорость передвижения от текущего применения."],"mana":"60\/65\/70\/75","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"50\/45\/40\/35","name":"Scorched Earth","description":["Анимация применения: 0+1,27","Радиус: 600","Урон в секунду: 20\/30\/40\/50 ( 40\/50\/60\/70)","Доп. скорость передвижения: 11%\/12%\/13%\/14% ( 27%\/28%\/29%\/30%)","Длительность задержки ауры: 0.5","Длительность: 10\/12\/14\/16"],"hot_key":"W","legacy_key":"T"},{"spell":"\"Поджигает жертву своим пламенным мечом, поджигая её и оглушая на 0.6 сек. Цель горит 4 сек. и каждую секунду получает урон, равный 25 + 1.25%\/2.5%\/3.75%\/5% от максимального запаса здоровья.","effects":["Способность Направленная на юнита \/ Авто-применяемая","Действует на Врагов","Урон Магический"],"notes":["Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа, срабатывая 4 раза.","Может нанести до 100 + 5%\/10%\/15%\/20% ( 17%\/22%\/27%\/32%) от максимального здоровья цели урона (до учёта сопротивлений).","Несколько применений на одну и ту же цель сочетаются и действуют независимо друг от друга.","Оглушение представлено оглушающим ударом, сочетающимся с другими способностями, использующими этот эффект.","Атака сначала применяет дебаффы, затем наносит урон.","Не действует на Рошана.","Выбор таланта на дополнительный урон или поднятие уровня способности не обновляет урон уже примененной способности."],"mana":"40","elements":["Не блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"16\/12\/8\/4","name":"Infernal Blade","description":["Дальность применения: 150","Начальный урон: 25","Сжигание от максимального здоровья: 1.25%\/2.5%\/3.75%\/5% ( 4.25%\/5.5%\/6.75%\/8%)","Длительность горения: 4","Длительность оглушения: 0.6"],"hot_key":"E","legacy_key":"V"},{"spell":"Вражеского героя настигает жуткая участь, отчего тот получает периодический урон и не может применять способности или использовать предметы.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Чистый"],"notes":["При использовании применяет к цели базовое развеивание, снимая большинство действующих баффов.","Обезмолвивает и заглушает цель, предотвращая применение заклинаний и использование предметов.","Нельзя применить на древних крипов. Можно применить на крипов-героев и иллюзии. В случае, если юнит одновременно и крип-герой, и древний крип, то приоритет отдается второму типу, не позволяя выбрать юнита целью ультимейта.","Наносит урон с интервалом в 1 секунду сразу после применения, срабатывая ( пока действует) 16 раз.","Может нанести до ( минимум) 400\/640\/880 ( 1040\/1280\/1520) единиц урона (до учета сопротивлений).","Союзники могут добить героев под действием Doom, если уровень их здоровья опустится ниже 25%.","Несколько применений на одного и того же юнита не складываются, но обновляют длительность.","При улучшении Aghanim's Scepter способность проверяет присутствие заклинателя перед каждым интервалом нанесения урона. Если заклинатель находится в пределах 900 единиц, то к длительности добавляется 1 секунда, позволяя эффективно останавливать длительность. На каждом интервале обновляется индикатор продолжительности, показывающий оставшееся время действия. Не реагирует на иллюзии заклинателя.","При улучшении Aghanim's Scepter применяет к цели истощение, отключая пассивные способности.","Поднятие уровня способности не обновит урон уже действующей способности, но выбор таланта на дополнительный урон способность улучшает."],"mana":"150\/200\/250","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"145","name":"Doom","description":["Анимация применения: 0,5+0,73","Дальность применения: 550","Радиус обновления эффекта: 0 ( 900)","Урон в секунду: 25\/40\/55 ( 65\/80\/95)","Длительность: 16"],"hot_key":"R","legacy_key":"D"},{"spell":"Для этой способности нет описания.","effects":["Способность Пассивная","Действует на Врагов","Урон Физический"],"notes":["Прорубающий урон нельзя увеличить усилением урона заклинаний и на него не действует вампиризм заклинаний.","Прорубающий урон снижается блокировкой урона.","Полная площадь по форме напоминает равнобедренную трапецию, исходящую перед Doom.","Полностью сочитается с другими источниками прорубающего урона. Каждый источник работает независимо от других.","Прорубающий удар не работает при атаке вардов, строений или союзных юнитов. На варды и строения прорубающий удар не действует.","Несмотря на визуальный эффект, прорубающий удар наносится сразу по всей площади."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Прорубающий удар","description":["Начальный радиус: 150","Дальность: 650","Конечный радиус: 360","Урон прорубающей атаки: 175%"]}],"bio":"Он — тот, кто горит, но не сгорает, пожирает, но не насыщается, убивает, но остается безнаказанным. Падший ангел несёт погибель всем, кто осмелится противостоять ему, срезая души остриём своего пламенного меча. Когда-то Люцифер был уважаемым генералом из мира за гранью света, но однажды не преклонил колени и был обвинён в грехе — неповиновении. Шесть раз пробил его имя великий колокол Вашундола. Шестьдесят и ещё шесть раз его крылья клеймили, покуда от них не остались лишь дымящиеся культи. Бескрылый, он потерял свою связь со светом и со страшным воплем пал оземь, оставив в пустыне кратер. Покинув Рай навеки, теперь он нападает на любого без повода и без пощады. Из всех живых существ лишь он волен ходить по семи тёмным владениям. Движимый непреложными стремлениями, искажённый невообразимыми способностями, он всегда несёт с собой свой собственный ад. Люцифер не покорится никому, и когда-нибудь мир будет принадлежать ему.","talentsTips":["Талант на уклонение мультипликативно сочетается с другими источниками уклонения."],"trivia":["Большинство названий способностей героя взяты из Final Fantasy. Название \"LVL? Death\" взято из способности в Level 5 Death ability. Способность \"Devour\" была взята из способности в Final Fantasy VIII, где позволяло игроку съесть монстра, чтобы захватить его характеристики. Способность Doom также взята из способности Blue Mage Doom, однако механика у обоих героев разная.","Имя героя - Люцифер. Так звали падшего ангела, который стал Дьяволом в Библии.","В обновлении версии 6.66 герой получил большой ряд изменений и улучшений способностей. Версия 6.66 и обновление данного героя имеет отсылку к числу \"666\", что в Библии упоминается как число скрытого апокалиптического зверя (дьявола), нумерологическое воплощение Сатаны.","Описание меча Eye of Omoz является отсылкой к древней мифологии, где стигийскийми пустошами являлась река Стикс, в подземном царстве Аида. Также это возможная отсылка к стигийским собакам - свите богини Гекаты, заправляющей всеми чудовищами в царстве Аида"],"talents":["+175% к прорубанию:+3% к урону горения от Infernal Blade","Devour можно применять на древних крипов:+40 к урону в секунду от Doom","+150 золота от Devour:+20% к уклонению","+16% к скорости передвижения от Scorched Earth:+20 к урону от Scorched Earth"],"desc":"Doom — это герой с ближним типом атаки, основной характеристикой которого является сила. Он имеет четыре способности, каждая из которых - активная. Его первая способность, Devour, пожирает вражеского или нейтрального крипа, перенимая способности, которыми он обладал и получая за его переваривание дополнительное золото. Например, если целью заклинания будет Кентавр-захватчик, то герой получит его способность War Stomp. Вторая способность, Scorched Earth, поджигает землю вокруг героя, нанося урон всем врагам в области действия, в то время как сам герой получает бонус к регенерации здоровья и скорости передвижения. Все призванные юниты, под контролем героя также получают эффекты этой способности. Третья способность, Infernal Blade, кратковременно оглушает и поджигает врага, нанося урон в процентах от максимального здоровья цели. Ультимативная способность, Doom, проклинает вражеского героя, в результате чего тот получает периодический урон и теряет возможность использовать способности или предметы. Улучшение с Aghanim's Scepter позволяет отключать большинство пассивных способностей и снимать положительные эффекты. Отсчет длительности не действует, пока герой находится вблизи цели."}