{"abilities":[{"spell":"Launches a bloody hook toward a unit or location. The hook will snag the first unit it encounters, dragging the unit back to Pudge and dealing damage if it is an enemy.","effects":["Ability Target Point","Affects Enemies \/ Allies","Damage Pure"],"notes":["The Meat Hook travels at a speed of 1450, taking 0.9 seconds to reach maximum distance.","Pudge receives the Followthrough buff upon cast, which disables Pudge. The duration of this modifier equals the time it takes for the hook to reach 66% of its max travel distance. This means with the default max distance of 1300, the self-disabling modifier lasts 0.59 seconds. The duration is based on the max distance (including range bonuses). It does not matter for how far the hook actually travels. This means when latching on a unit directly in front of Pudge, the self-disable still lasts its full duration.","The hook can hit units up to 1400 range away (max travel distance + search radius).","The search radius is centered around the hook's tip. Getting close to other parts of the hook has no effect.","Can only affect units while extending, not while retracting. Fully affects invisible units.","Cannot hit ancient creeps and invulnerable or hidden units.","The hook flies through impassable terrain and trees. It also can drag units over them.","Hooked enemies are fully disabled for the entire pull duration. Allies are not disabled. They can act freely while being pulled by the hook.","When the hook hits a unit, it provides 500 radius flying vision at the unit's location upon hit for 4 seconds.","Runes can be hooked as well. Doing so refunds the mana spent on the hook."],"mana":"140","elements":["Partially pierces spell immunity."],"cooldown":"27\/22\/17\/12 ( 22.95\/18.7\/14.45\/10.2) ( 4, 3.4)","name":"Meat Hook","description":["Cast Animation: 0.3+0.59","Cast Range: 1300","Max Travel Distance: 1300","Hook Search Radius: 100","Damage: 150\/220\/290\/360 ( 180\/270\/360\/450)"],"hot_key":"Q","legacy_key":"T"},{"spell":"A toxic cloud that deals intense damage and slows movement--harming not only enemy units but Pudge himself.","effects":["Ability Toggle \/ Aura","Affects Enemies \/ Self","Damage Magical"],"notes":["Rot does not interrupt Pudge's channeling spells upon toggling.","The self-damage is lethal, so it can be used to deny oneself.","The area damage and self-damage are independent from each other, so when the self-damage is blocked, the area damage is still applied.","The slow and damage are provided by an aura. This aura debuff lingers for 0.5 seconds. When an enemy leaves the area, the lingering debuff continues slowing and damaging until expiring. When Rot gets toggled off, the lingering debuff only slows, but stops dealing damage.","Deals 6\/12\/18\/24 ( 13\/19\/25\/31) damage in 0.2 second intervals. The time intervals are set for the whole game when Rot is toggled the first time.","Silencing or disabling Pudge does not turn Rot off, not even when hidden."],"mana":"0","elements":["Does not proc any on-cast effects when cast.","Does not pierce spell immunity."],"cooldown":"0","name":"Rot","description":["Cast Animation: 0+0","Radius: 250","Damage per Second: 30\/60\/90\/120 ( 65\/95\/125\/155)","Move Speed Slow: 11%\/18%\/25%\/32% ( 27%\/34%\/41%\/48%)","Aura Linger Duration: 0.5"],"hot_key":"W","legacy_key":"R"},{"spell":"Gives Pudge increased health regeneration, as well as bonus strength that increases each time Pudge kills an enemy Hero or it dies in his vicinity. Flesh Heap is retroactive, meaning it can gain charges before it is skilled, which then become active.","effects":["Ability Passive","Affects Self"],"notes":["Can regenerate up to 300\/480\/660\/840 health in one minute.","Denied enemy heroes grant a stack as well, as long as it happens within 450 range of Pudge.","Does not grant strength if the dying hero has Reincarnation, or is an illusion or Tempest Double, or if Pudge is dead as the kill happens. Does grant strength for Meepo clones, but only one stack, regardless of how many clones were nearby.","To gain strength from outside the vicinity radius, Pudge has to make the killing blow himself. His summons or illusions do not count.","Each stack effectively grants 20\/30\/40\/50 health, 0.1\/0.15\/0.2\/0.25 health regen, 0.08%\/0.12%\/0.16%\/0.2% magic resistance, and 1\/1.5\/2\/2.5 attack damage. The talent increases these to 60\/70\/80\/90 health, 0.3\/0.35\/0.4\/0.45 health regen, 0.24%\/0.28%\/0.32%\/0.36% magic resistance, and 3\/3.5\/4\/4.5 attack damage.","The number of stacks and amount of strength gained can be seen on the status buff icon.","Upon leveling Flesh Heap, all stacks adapt to its new level.","Upon gaining a stack, a red \"+1\" appears above Pudge's head, indicating that he gained a stack."],"mana":"0","elements":["Partially usable by illusions.","Not disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Flesh Heap","description":["Enemy Death Radius: 450","Kill Radius: 1600","Health Regeneration Bonus: 5\/8\/11\/14","Strength Bonus per Death: 1\/1.5\/2\/2.5 ( 3\/3.5\/4\/4.5)"],"hot_key":"E","legacy_key":"F"},{"spell":"Pudge chows down on an enemy unit, disabling it and dealing damage over time. Pudge gets healed for the same amount he damages. Lasts 3 seconds on Heroes, 6 seconds on creeps.","effects":["Ability Target Unit \/ Channeled","Affects Enemies \/ Self","Damage Magical"],"notes":["Fully disables the target as long as it is channeled.","Pulls the target closer to Pudge at a speed of 75. The pull debuff disappears when the target gets within 125 range of Pudge.","Provides True Sight over the target, but only when the target was not invisible or within a fade time upon cast.","Deals damage in 1 second intervals, starting immediately upon cast, resulting in up to 3 ( 6) (6 ( 9) against non-heroes) damage instances.","Can deal up to 180\/270\/360 + 90%\/180%\/270% ( 360\/540\/720 + 180%\/360%\/540%) of own strength as damage to the target hero (before reductions). Can deal up to 360\/540\/720 + 180%\/360%\/540% ( 540\/810\/1080 + 270%\/540%\/810%) of own strength as damage to the target non-hero unit (before reductions). Also heals Pudge for the same amount when fully channeled.","The damage and heal work independently from each other, meaning it always heals for the full amount per interval, regardless of how much damage the target takes.","Treats creep-heroes as heroes and ancient creeps as creeps.","Pudge's Dismember responses are global and audible to everyone, even through the Fog of War."],"mana":"100\/130\/170","elements":["Blocked by Linken's Sphere.","Pierces spell immunity."],"cooldown":"30\/25\/20 ( 25.5\/21.25\/17)","name":"Dismember","description":["Cast Animation: 0.3+0","Cast Range: 160","Hero Max Channel Time: 3 ( 6)","Non-Hero Max Channel Time: 6 ( 9)","Base Damage per Second: 60\/90\/120","Strength as Damage per Second: 30%\/60%\/90%","Base Heal per Second: 60\/90\/120","Strength as Heal per Second: 30%\/60%\/90%","Pull Speed: 75"],"hot_key":"R","legacy_key":"D"}],"bio":"In the Fields of Endless Carnage, far to the south of Quoidge, a corpulent figure works tirelessly through the night--dismembering, disembowelling, piling up the limbs and viscera of the fallen that the battlefield might be clear by dawn. In this cursed realm, nothing can decay or decompose; no corpse may ever return to the earth from which it sprang, no matter how deep you dig the grave. Flocked by carrion birds who need him to cut their meals into beak-sized chunks, Pudge the Butcher hones his skills with blades that grow sharper the longer he uses them. Swish, swish, thunk. Flesh falls from the bone; tendons and ligaments part like wet paper. And while he always had a taste for the butchery, over the ages, Pudge has developed a taste for its byproduct as well. Starting with a gobbet of muscle here, a sip of blood there...before long he was thrusting his jaws deep into the toughest of torsos, like a dog gnawing at rags. Even those who are beyond fearing the Reaper, fear the Butcher.","talentsTips":["The spell lifesteal talent stacks additively with other sources of spell lifesteal.","The spell lifesteal talent heals for 2.6% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction.","Gold granted from the talent is unreliable gold."],"trivia":["During The International 2015, Dendi wore a Pudge costume while playing in the All-Star Match.","Pudge's line upon landing a hook on an enemy \"Get over here!\" is a reference to the character Scorpion from the Mortal Kombat franchise, who uses the same line upon hitting his enemy with a similar hook ability.","Pudge's line \"Keep calm and carrion!\" is a play on the World War 2 British Propaganda phrase \"Keep calm and carry on\".","The reason Pudge's voice lines are done in a Cockney accent might be the popular rhyming slang term that stands for \"look\"; \"butcher's hook\", incidentally representing Pudge's signature move.","Most of Pudge's Dismember cast lines ( \"Fresh meat!\") are a reference to The Butcher from Diablo, a title from Blizzard Entertainment, who also says \"Fresh Meat\" as the player meets it the first time. In DotA1, the exact same sound is used by Pudge upon casting Dismember."],"talents":["+2.0 Flesh Heap Stack Str:+3s Dismember Duration","15% Cooldown Reduction:+180 Gold\/Min","+16% Rot Slow:13% Spell Lifesteal","+35 Rot Damage:+30% XP Gain"],"desc":"Pudge, the Butcher, is a melee strength hero feared for his incredible ganking prowess and risky, yet potentially rewarding playstyle."}