{"abilities":[{"spell":"Бросает окровавленный крюк в указанную цель или в выбранном направлении. Крюк зацепится за первое существо, в которое попадёт, притащит его к герою и нанесёт урон, если целью оказался враг.","effects":["Способность Направленная на точку","Действует на Врагов \/ Союзников","Урон Чистый"],"notes":["Крюк летит со скоростью 1450, достигая максимальной дистанции за 0.9 секунды.","При применении Pudge получает бафф Followthrough, обезвреживающий героя. Он длится столько же, сколько и время после применения. Время после применения Meat Hook динамично и длится, пока крюк не начнет втягиваться. То есть, с бонусами к дальности применения длительность времени после применения больше. При захвате юнита - меньше.","Крюк может цеплять юнитов на расстоянии до 1400 единиц (складывается из макс. дистанции прохождения и радиуса захвата).","Центром радиуса захвата является верхушка крюка. Приближение к остальным частям крюка никакого эффекта не даст.","Действует на юнитов только при запуске, но не при втягивании. Действует на невидимых юнитов.","Не может зацепить древних крипов, спрятанных или неуязвимых юнитов.","Крюк проходит сквозь непроходимую территорию и деревья и может протаскивать через них юнитов.","Зацепленные враги обезвреживаются на всю длительность притягивания. Союзники не обезвреживаются. Во время притягивания они могут свободно действовать.","При захвате юнита крюк в этой области дает летающий обзор в радиусе 500 единиц на 4 секунды.","Pudge может притягивать руны. В случае успеха затраченная маны восполняется."],"mana":"140","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"27\/22\/17\/12 ( 22.95\/18.7\/14.45\/10.2) ( 4, 3.4)","name":"Meat Hook","description":["Анимация применения: 0,3+0,53","Дальность применения: 1300","Макс. дистанция прохождения: 1300","Радиус захвата: 100","Урон: 150\/220\/290\/360 ( 180\/270\/360\/450)"],"hot_key":"Q","legacy_key":"T"},{"spell":"Ядовитое облако, которое замедляет врагов и наносит значительный урон как им, так и владельцу способности.","effects":["Способность Переключаемая \/ Аура","Действует на Врагов \/ Себя","Урон Магический"],"notes":["При использовании Rot не прерывает произносимые способности Pudge.","Урон, наносимый себе, летальный, поэтому с помощью этой способности можно совершить самоубийство.","Урон по области и урон по себе не связаны друг с другом, поэтому при блокировке урона по себе урон по области все равно применяется.","Замедление и урон представлены в виде ауры. Дебафф ауры задерживается на 0.5 секунды. Когда враги покидают область, то оставшийся дебафф продолжает замедлять и наносить урон до завершения. Когда Rot отключается, то дебафф продолжает замедлять, но больше не наносит урон.","Наносит 6\/12\/18\/24 ( 13\/19\/25\/31) урона с интервалом в 0,2 секунды. Интервал времени устанавливается при первом использовании Rot.","Если герой обезмолвлен, оглушен или спрятан, то выключить активированную способность нельзя."],"mana":"0","elements":["Не провоцирует эффекты своим применением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Rot","description":["Анимация применения: 0+0","Радиус: 250","Урон в секунду: 30\/60\/90\/120 ( 65\/95\/125\/155)","Замедление скорости передвижения: 11%\/18%\/25%\/32% ( 31%\/38%\/45%\/52%)","Длительность задержки ауры: 0.5"],"hot_key":"W","legacy_key":"R"},{"spell":"Увеличивает восстановление здоровья, а также даёт дополнительную силу за каждого убитого или погибшего поблизости вражеского героя. Заряды накапливаются с начала игры, но герой получит силу только после изучения способности.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Непосредственно увеличивает регенерацию здоровья, регенерируя 0.6\/0.9\/1.2\/1.5 здоровья с интервалом в 0,1 секунды.","Восстанавливает 360\/540\/720\/900 здоровья за минуту.","Неважно, как именно в радиусе умер вражеский герой - Pudge всегда получает заряд Flesh Heap.","Pudge всегда получает заряд, когда подсекает вражеского героя в радиусе 1600.","Если враг умер из-за Pudge на расстоянии, превышающем 1600, или если сам Pudge уже мертв, то заряд не прибавляется.","Не получает заряды от убийства иллюзий или клонов героев. Когда Pudge убивает клона Meepo, то все равно получает заряд, так как убийство клона также убивает главного Meepo.","Каждый заряд дает 20\/30\/40\/50 здоровья, 10%\/15%\/20%\/25% регенерации здоровья, 1\/1.5\/2\/2.5 урона. Талант увеличивает показатели до 60\/70\/80\/90 здоровья, 30%\/35%\/40%\/45% регенерации здоровья, 0.24%\/0.28%\/0.32%\/0.36% 3\/3.5\/4\/4.5 урона.","Количество зарядов и силы можно увидеть на иконке баффа.","При поднятии уровня Flesh Heap все заряды адаптируются к новым значениям.","После получения заряда над головой героя появляется красная надпись \"+1\", указывающая на получение заряда."],"mana":"0","elements":["Не может использоваться иллюзиями.","Не отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Flesh Heap","description":["Радиус: 450","Восстановления здоровья: 6\/9\/12\/15","Бонус к силе за заряд: 1\/1.5\/2\/2.5 ( 3\/3.5\/4\/4.5)"],"hot_key":"E","legacy_key":"F"},{"spell":"Герой заживо пожирает врага, оглушая его и нанося периодический урон, который зависит от силы владельца способности и излечивает его. Длится 3 секунды на героях и 6 секунд на крипах.","effects":["Способность Направленная на юнита \/ Произносимая","Действует на Врагов \/ Себя","Урон Магический"],"notes":["Обезвреживает цель на всю длительность произнесения.","Тащит цель к Pudge со скоростью 75. Дебафф притягивания исчезает как только цель оказывается в 125 единицах от Pudge.","Дает эффект True Sight на цель, но только в случае, если цель не была невидима или не уходила в невидимость при применении.","Наносит урон с интервалом в 1 секунду сразу после применения, нанося урон до 3 ( 6) (6 ( 9) на не-героях) раз.","Может нанести до 180\/270\/360 + 90%\/180%\/270% ( 360\/540\/720 + 180%\/360%\/540%) от своей силы в виде урона выбранному герою (до учета снижений). Может 360\/540\/720 + 180%\/360%\/540% ( 540\/810\/1080 + 270%\/540%\/810%) от своей силы в виде урона выбранному юниту не-герою (до учета снижений). При полном произнесении излечивает Pudge на те же значения.","Урон и лечение не связаны друг с другом, то есть способность всегда лечит на полное значение за интервал вне зависимости от количества полученного урона целью.","Считает крипов-героев за героев, а древних крипов - за крипов.","Реплики при использовании Dismember Pudge слышны всем даже сквозь туман войны."],"mana":"100\/130\/170","elements":["Блокируется Linken's Sphere.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"30\/25\/20 ( 25.5\/21.25\/17)","name":"Dismember","description":["Анимация применения: 0,3+0","Дальность применения: 160","Макс. длительность произнесения на героев: 3 ( 6)","Макс. длительность произнесения на не-героев: 6 ( 9)","Начальный урон в секунду: 60\/90\/120","Количество силы в урон: 30%\/60%\/90%","Начальное лечение в секунду: 60\/90\/120","Количество силы в лечение: 30%\/60%\/90%","Скорость притягивания: 75"],"hot_key":"R","legacy_key":"D"}],"bio":"На полях Вечной бойни, далеко на юге от Квойджа, тучная фигура упорно трудится под покровом ночи — расчленяет и потрошит павших, сгружая в кучи их конечности и потроха, — чтобы к рассвету поле боя было чисто. В этом проклятом мире ничто не разлагается само по себе — мертвецам не суждено вернуться обратно в землю, и не важно, насколько глубока могила. Окружённый стаями птиц-падальщиков, каждая из которых ждёт своего кусочка мёртвой плоти, мясник упражняется с лезвиями, и с каждым движением они становятся лишь острее. Вжик-вжик-тук. Плоть отсекается от костей, связки и сухожилия разрываются как мокрая бумага. И хоть мясницкое ремесло всегда было по вкусу тучному здоровяку, с годами у него проснулся интерес ещё и к тому, что остаётся после его работы. Сначала кусочек мускула там, потом глоточек крови здесь... Вскоре он впивался в самые крепкие тела подобно грызущей кость собаке. Даже те, кто не питают страха перед жнецом Смерти, предпочитают не связываться с мясником.","talentsTips":["Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.","Талант вампиризма заклинаний лечит на 2,6% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.","Талант на уменьшение перезарядки мультипликативно сочетается с Octarine Core и аддитивно с другими источниками уменьшения перезарядки.","Золото с таланта является ненадёжным."],"trivia":["Притягивая врага своим Meat Hook Pudge иногда может произнести фразу \"Get over here!\", которая принадлежит персонажу Scorpion из Mortal Kombat.","Персонаж Мясника в DotA основан на боссе из Diablo. Самое большое их сходство заключается в одинаковом аудиофайле, в котором произносится фраза \"Fresh Meat\"."],"talents":["+2 силы за заряд Flesh Heap:+3 сек. к длительности Dismember","-15% перезарядки способностей:+180 золота в минуту","+20% к замедлению от Rot:+13% к вампиризму способностями","+35 к урону от Rot:+30% к получаемому опыту"],"desc":"Pudge – это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Meat Hook, бросает окровавленный крюк в определенную область или юнита. Крюк зацепится за первого юнита, в которого попадет, притащит его к Pudge и нанесет урон, если это враг. Вторая способность, Rot, токсичное облако, которое постоянно наносит урон и замедляет противников, ранит не только вражеских юнитов, но и самого Pudge. Пассивная способность, Flesh Heap, дает Pudge регенерацию здоровья, а также дополнительную силу, которая увеличивается, когда Pudge убивает вражеского героя, или тот умирает поблизости. Способность начинает накапливать заряды уже до того, как будет выучена, но получить силу герой сможет, только изучив ее. Ультимативной способностью, Dismember, Pudge начинает заживо пожирать вражеского юнита, обездвиживая его и нанося периодический урон. Покупка Aghanim's Scepter позволяет снизить время перезарядки и увеличить урон Meat Hook."}