{"abilities":[{"spell":"Summons a gush of water to damage an enemy unit, reducing their movement speed and armor. Lasts 4 seconds.","effects":["Ability Target Unit ( Target Point)","Affects Enemies","Damage Magical"],"notes":["Gush's projectile travels at a speed of 2500.","Gush first applies the debuff, then the damage.","When upgraded, Gush releases a big wave, instead of a single target projectile. The wave always travels its full distance. When targeting a unit, the wave is released towards its direction on cast. However, it does not home in on the target. The wave travels at a speed 1500 instead of 2500 like the non-upgraded projectile, taking 1.2 seconds to travel the full distance. The wave can hit units up to 2040 range away (travel distance + radius). The wave fully affects invisible enemies and enemies inside the Fog of War. Provides 200 radius ground vision around each hit enemy for 2 seconds. The wave does not provide any vision. The second sound is used by the wave."],"mana":"90\/100\/110\/120","elements":["Can be disjointed.","Partially blocked by Linken's Sphere.","Does not pierce spell immunity."],"cooldown":"12 ( 9) ( 7, 5.25)","name":"Gush","description":["Cast Animation: 0.3+0.6","Cast Range: 700 ( 1800)","Wave Travel Distance: 0 ( 1800)","Wave Radius: 0 ( 240)","Damage: 110\/160\/210\/260 ( 210\/260\/310\/360)","Armor Reduction: 4\/5\/6\/7 ( 9\/10\/11\/12)","Move Speed Slow: 40%","Duration: 4"],"hot_key":"Q","legacy_key":"G"},{"spell":"Thickens Tidehunter's hide to passively block a portion of any incoming physical attack damage. The hide also removes negative status effects if the damage taken crosses a threshold. Does not stack with items that provide Damage Block.","effects":["Ability Passive","Affects Self"],"notes":["The damage reduction is Damage Block and the debuff removal is a strong dispel.","The damage reduction is always on and is not connected to the damage threshold for debuff removal.","The Damage Block does not work against wards ( Plague Ward, Mass Serpent Ward, Death Ward).","Does not reduce physical damage from spells, except from Moon Glaives and The Swarm.","Only damage from player owned sources (after reductions) is counted towards the debuff removal.","Damage counter for the debuff removal resets when Tidehunter does not take player based damage for 6 seconds.","It can't dispel those deal damage before debuff, since it applies dispel on damage but not after the whole effect.","A debuff removal proc is indicated by a sound effect and water particles on Tidehunter's skin."],"mana":"0","elements":["Partially usable by illusions.","Disabled by Break.","Pierces spell immunity."],"cooldown":"0","name":"Kraken Shell","description":["Damage Block Proc Chance: 100%","Damage Block: 12\/24\/36\/48 ( 42\/54\/66\/78)","Damage Threshold: 600\/550\/500\/450","Threshold Reset Timer: 6"],"hot_key":"W","legacy_key":"R"},{"spell":"Tidehunter swings his mighty anchor to attack and deal bonus damage to nearby enemies and reduce their attack damage.","effects":["Ability No Target","Affects Enemies","Damage Physical"],"notes":["Causes Tidehunter to perform instant attacks on enemies within the radius. These instant attacks are allowed to trigger attack modifiers, except cleave, normally. Has True Strike.","Only reduces base damage and that given by the primary attribute of affected units. Raw bonus damage is not reduced.","The smash first applies the debuff, then the instant attack.","Affects ancient creeps, but not Roshan."],"mana":"30\/40\/50\/60","elements":["Does not pierce spell immunity."],"cooldown":"7\/6\/5\/4 ( 5.25\/4.5\/3.75\/3)","name":"Anchor Smash","description":["Cast Animation: 0.4+0.3","Radius: 375","Attack Damage Bonus: 45\/90\/135\/180","Attack Damage Reduction: 30%\/40%\/50%\/60% ( 55%\/65%\/75%\/85%)","Duration: 6"],"hot_key":"E","legacy_key":"C"},{"spell":"Slams the ground, causing tentacles to erupt in all directions, damaging and stunning all nearby enemy units.","effects":["Ability No Target","Affects Enemies","Damage Magical"],"notes":["The tentacles travel at a speed of 725.","Hit units are knocked up 350 range for the initial 0.5 seconds of the stun.","While in the air, other units may pass below hit airborne units.","The damage is applied upon landing, not upon getting hit.","Ravage's effect is caused by a 250 units wide ring, which expands around the cast location at the given speed. This means units within 250 radius upon cast are hit instantly. The ring takes exactly 1.38 seconds to cover the remaining distance. It also means that it is possible to evade the effects by blinking inside the expanding ring shortly after cast."],"mana":"150\/225\/325","elements":["Does not pierce spell immunity."],"cooldown":"150 ( 112.5)","name":"Ravage","description":["Cast Animation: 0.3+0.57","Max Effect Radius: 1250","Effect Width: 250","Damage: 200\/300\/400","Stun Duration: 2.4\/2.6\/2.8"],"hot_key":"R","legacy_key":"V"}],"bio":"The Tidehunter known as Leviathan was once the champion of the Sunken Isles, but his motives are as mysterious as those of his people. We all know the importance of the Drylanders' shipping lanes, how empires may rise and fall according to who controls the open water. Far less is known of the submarine lanes, and how the warring tribes of the Meranthic Diaspora have carved out habitations through endless undersea skirmishes. In the fragile treaties between the Mer and Men, we can glimpse the extent of the drowned empires, but their politics appear complex and opaque. It would seem that Leviathan tired of such petty strife, and set off on his own, loyal only to his abyssal god, Maelrawn the Tentacular. He stalks the shallows now in search of men or meranths who stray into his path, and with a particular loathing for Admiral Kunkka, who has long been his nemesis for reasons lost in the deepest trenches of the sea.","talentsTips":["This attack damage talent is added as raw attack damage, so it does not benefit illusions, and is not affected by most percentage-based damage increasing or reducing effects.","The cooldown reduction talent stacks multiplicatively with Octarine Core and additively other sources of cooldown reduction."],"trivia":["The name Leviathan is derived from a sea monster in the Bible. It is also used to refer to any large sea monster or creature.","Previous designs of Tidehunter had him use a large hook as a weapon. This was later replaced by an anchor based on community feedback for several reasons: To match the theme of Anchor Smash. To add a reference to the model Tidehunter uses in Warcraft 3 DotA (which also uses a giant anchor as weapon). To add another connection between Tidehunter and Kunkka (the anchor is supposedly stolen from one of Kunkka's flagship, as written in the lore of Anchor Smash).","Tidehunter's line \"Ha ha ha! Women and children and Kunkka first.\" is a reference to the Birkenhead Drill, a historical protocol where women and children's lives would be saved first in the case of a life threatening situation, typically the sinking of a ship."],"talents":["+250 Damage:25% Cooldown Reduction","-5 Gush Armor:+30 Kraken Shell Damage Block","+25% Anchor Smash Damage Reduction:+40% XP Gain","+100 Gush Damage:+20 Movement Speed"],"desc":"Leviathan, the Tidehunter, is a melee strength hero who is formidable due to his uncommonly tough hide and his ocean spells that sweep enemies upward. He can be played as a support or as an offlane hero whose greatest strengths lie in being able to take heavy amounts of damage in the early game and the disabling powers of his spells."}