{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/0\/04\/Hurricane_Pike_Hurricane_Thrust_1.mp3\/revision\/latest?cb=20191227195440",
      "effects": [
        "Ally Cast Range: 650",
        "Enemy Cast Range: 450",
        "Ally Push Distance: 600",
        "Enemy Push Distance: 450",
        "Ally Push Duration: 0.4",
        "Enemy Push Duration: 0.2",
        "Number of Attacks: 5",
        "Attack Speed Bonus: 100",
        "Buff Duration: 6"
      ],
      "notes": [
        "↓↓ Double-tapping automatically target self.",
        "If the target is an ally, it pushes both the caster and target at a speed of 1500. If the target is an enemy, it pushes both the caster and target at a speed of 2250.",
        "If the target is an enemy, it pushes both the caster and target at a speed of 2250.",
        "Pushes the targeted ally based on their facing direction, while pushing the targeted enemy based on the caster's facing direction. The caster is pushed into the opposite direction, adding a 900 range distance between the caster and the targeted enemy. The caster is only pushed when the target was an enemy, not an ally.",
        "The caster is pushed into the opposite direction, adding a 900 range distance between the caster and the targeted enemy.",
        "The caster is only pushed when the target was an enemy, not an ally.",
        "Only grants the attack speed bonus and unlimited attack range buff against the targeted enemy. Attacking other units still uses the current attack speed and attack range. The bonus attack speed updates upon reaching attack point.",
        "The bonus attack speed updates upon reaching attack point.",
        "Gives the caster an attack order on the target if the target is an enemy. This effect works exclusively for ranged heroes.",
        "Multiple casts of Hurricane Pike on enemies do not stack, only refresh the duration.",
        "Hurricane Thrust does not disable affected units, so they still can cast abilities, attack and turn during the push. Does not interrupt channeling abilities of the affected target. However, being a unit-targeted ability, it interrupts the caster's channeling abilities upon cast.",
        "Does not interrupt channeling abilities of the affected target.",
        "However, being a unit-targeted ability, it interrupts the caster's channeling abilities upon cast.",
        "Does not push units affected by Flaming Lasso, Black Hole, Chronosphere or Duel. Cannot push units through Kinetic Field or Arena Of Blood. If a pushed unit is affected by Soulbind, it cannot push the unit further than its maximum break distance. If a pushed unit is leashed by Pounce, the leash gets instantly broken upon cast. However, if a pushed unit gets leashed after cast, it cannot push the unit further than the maximum radius.",
        "Cannot push units through Kinetic Field or Arena Of Blood.",
        "If a pushed unit is affected by Soulbind, it cannot push the unit further than its maximum break distance.",
        "If a pushed unit is leashed by Pounce, the leash gets instantly broken upon cast.",
        "However, if a pushed unit gets leashed after cast, it cannot push the unit further than the maximum radius.",
        "Cannot be cast on wards or buildings. Can be cast on Homing Missiles.",
        "Can be cast on Homing Missiles.",
        "Can move units over impassable terrain. Destroys trees within 100 radius the target come in contact with during the push.",
        "Destroys trees within 100 radius the target come in contact with during the push.",
        "Can be cast on Roshan but without pushing him, since Roshan is immune to forced movement. However, the caster still gets pushed and gains the buff.",
        "However, the caster still gets pushed and gains the buff.",
        "Casting on self or allies uses the default Force Staff sound.",
        "Shares cooldown with Force Staff-based items. Neither share cooldowns with Force Boots, nor Psychic Headband.",
        "Neither share cooldowns with Force Boots, nor Psychic Headband."
      ],
      "mana": "100",
      "abilityName": "Hurricane Thrust",
      "cooldown": "19",
      "description": "Pushes you and target enemy 450 units away from each other, and for 6 seconds, allows you to make 5 attacks against the target without range restrictions and with +100 attack speed. Works like Force Staff when used on self or allies.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Attack Range Bonus: 150"
      ],
      "notes": [
        "Attack range bonuses from multiple Dragon Lance-based items do not stack."
      ],
      "mana": null,
      "abilityName": "Dragon's Reach",
      "cooldown": null,
      "description": "Increases attack range of ranged heroes by 150.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "The item's attributes grants the following additional bonuses:",
    "300 health and 1.5 health regeneration.",
    "180 mana and 0.75 mana regeneration.",
    "20 attack speed and 3.33 main armor.",
    "15, 20 and 15 main attack damage to all \/ \/ heroes respectively."
  ],
  "cost": "4450",
  "lore": null,
  "consistFrom": [
    "Force Staff",
    "Dragon Lance",
    "Recipe"
  ],
  "name": "Hurricane Pike",
  "description": "A legendary pike once held as royal sigil of the ancient wyvern riders.",
  "trivia": [
    "Hurricane Pike's icon shows that it is half Force Staff, half Dragon Lance.",
    "The name may be from the last volume of Kaze no Stigma where the Hurricane Pike, also known as Kokusen, is a divine artifact that greatly enhances the power of a wind mage.",
    "Prior to the July 14, 2017 Patch, Hurricane Pike's active ability, Hurricane Thrust, did not have an official name. The name was taken from the Dota 2 Wiki and officially implemented into Dota 2."
  ],
  "upgradeIn": null,
  "tips": [
    "Make sure to have Observer and Sentry Wards, tower or cliff vision or you will lose sight of your target, rendering the unlimited range useless. Alternatively, you either need a spell of your own to give you vision over the enemy (such as Weaver's The Swarm), or work with an ally to keep vision over him ( Bounty Hunter's Track is the obvious choice, Thundergod's Wrath, Corrosive Haze, Thunder Strike, Haunt also work, to name a few).",
    "Alternatively, you either need a spell of your own to give you vision over the enemy (such as Weaver's The Swarm), or work with an ally to keep vision over him ( Bounty Hunter's Track is the obvious choice, Thundergod's Wrath, Corrosive Haze, Thunder Strike, Haunt also work, to name a few).",
    "Hurricane Pike can be used as an escape mechanism by pushing away persistent enemies.",
    "Enemies can be pushed away in mid-air, like during Earthshaker's upgraded Enchant Totem and units Tossed by Tiny.",
    "It is possible to propel yourself through Disruptor's Kinetic Field by using the active on an enemy with your back toward the rim, pushing yourself backwards through the barrier. Be wary, as this can also accidentally save an enemy from your team's Disruptor as well. This cannot be done with the normal self-push and regular Force Staff, both of which get stopped by the barrier."
  ]
}