{
  "abilities": [
    {
      "notes": [
        "Талант на силу в общем даёт Shadow Demon: 200 здоровья и 1 восстановления здоровья."
      ],
      "spellName": "Talent",
      "talents": [
        {
          "talentLvl": "25",
          "talentLeft": "2 заряда способности Disruption",
          "talentRight": "−30 сек. перезарядки Demonic Purge"
        },
        {
          "talentLvl": "20",
          "talentLeft": "−1,25 сек. перезарядки Shadow Poison",
          "talentRight": "−6 сек. перезарядки Soul Catcher"
        },
        {
          "talentLvl": "15",
          "talentLeft": "+200 к урону от Demonic Purge",
          "talentRight": "+25 к скорости передвижения"
        },
        {
          "talentLvl": "10",
          "talentLeft": "+10 к силе",
          "talentRight": "+15% к урону от Shadow Poison"
        }
      ]
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/39\/Shadow_Demon_Disruption.mp3\/revision\/latest?cb=20191216022837",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Вражеских героев \/ Союзных героев"
      ],
      "notes": [
        "Disruption обезвреживает цель, делает её неуязвимой и прячет на всю длительность изгнания. ↓↓ Двойное нажатие автоматически выбирает себя. Нельзя использовать на союзников, которые отключили помощь от Shadow Demon.",
        "↓↓ Двойное нажатие автоматически выбирает себя.",
        "Нельзя использовать на союзников, которые отключили помощь от Shadow Demon.",
        "Всегда создает иллюзии, даже если применяется на владельца способности или его союзников. Можно применять к иллюзиям, создавая новые иллюзии того же героя.",
        "Можно применять к иллюзиям, создавая новые иллюзии того же героя.",
        "Если выбранный герой\/иллюзия умирает во время Disruption, иллюзии не создаются.",
        "Если цель становится невидимой в момент изгнания Disruption, визуальные эффекты также становятся невидимыми.",
        "Позиция выбранного существа не перемешивается с позициями иллюзий. Оно всегда появляется между 2 иллюзиями. Иллюзии появляются в 108 единицах от героя, если его размер столкновения равен 24, и в 72, если размер столкновения равен 8. Каждая иллюзия появляется с одной из четырех сторон от героя и она смотрит в ту же сторону, что и он сам.",
        "Иллюзии появляются в 108 единицах от героя, если его размер столкновения равен 24, и в 72, если размер столкновения равен 8.",
        "Каждая иллюзия появляется с одной из четырех сторон от героя и она смотрит в ту же сторону, что и он сам.",
        "Иллюзии носят имя заклинателя, а не игрока, владеющего существом, раскрывая то, что они — иллюзии (если только способность не была применена на себя).",
        "Текущее здоровье иллюзий определяется при применении Disruption. То есть любое снижение здоровья от заклинаний Shadow Demon, произошедшее во время изгнания, не отразится на здоровье появившихся иллюзий.",
        "То есть любое снижение здоровья от заклинаний Shadow Demon, произошедшее во время изгнания, не отразится на здоровье появившихся иллюзий."
      ],
      "mana": "120",
      "hotKey": "Q",
      "cooldown": "27\/24\/21\/18 (TagTalent 0)",
      "description": "Ненадолго изгоняет цель из этого мира. После возвращения создаёт две иллюзии жертвы под управлением владельца способности.",
      "spellName": "Disruption",
      "params": [
        "Анимация применения: 0,3+0,6",
        "Дальность применения: 600",
        "Число иллюзий: 2",
        "Урон иллюзии: 30%\/45%\/60%\/75%",
        "Урон по иллюзии: 300%",
        "Время жизни иллюзии: 11\/12\/13\/14",
        "Длительность изгнания: 2,75",
        "Число зарядов: 2",
        "Время восстановления заряда: 27\/24\/21\/18"
      ],
      "itemBehaviour": [],
      "legacyKey": "D",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/2d\/Shadow_Demon_Soul_Catcher_1.mp3\/revision\/latest?cb=20191216022841",
      "effects": [
        "Способность Направленная на область",
        "Действует на Врагов"
      ],
      "notes": [
        "Непосредственно манипулирует здоровьем врагов, отнимая от него процент при действии дебаффа. Способность не наносит урон и не учитывается эффектами, манипулирующими уроном.",
        "Способность не наносит урон и не учитывается эффектами, манипулирующими уроном.",
        "Значение возвращаемого здоровья зависит от того, сколько здоровья было отнято изначально, а не на его текущем значении.",
        "Не действует на неуязвимых врагов и древних крипов."
      ],
      "mana": "80\/100\/120\/140",
      "hotKey": "W",
      "cooldown": "26\/24\/22\/20 (TagTalent 20\/18\/16\/14)",
      "description": "Захватывает души врагов в выбранной области, нанося им урон в размере доли от текущего здоровья. Когда эффект заканчивается, жертвы получают обратно половину потерянного здоровья. Действует и на существ, находящихся под эффектом способности Disruption.",
      "spellName": "Soul Catcher",
      "params": [
        "Анимация применения: 0,3+0",
        "Дальность применения: 700",
        "Радиус: 175\/200\/225\/250",
        "Потеря текущего здоровья: 20%\/25%\/30%\/35%",
        "Длительность: 10",
        "Дебафф остается, если был применен до иммунитета к заклинаниям."
      ],
      "itemBehaviour": [],
      "legacyKey": "C",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e4\/Shadow_Demon_Shadow_Poison_1.mp3\/revision\/latest?cb=20191216022839",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "В режиме Ability Draft способность недоступна из-за ограничения в один слот для неультимативных заклинаний.",
        "Shadow Poison движется со скоростью в 1000 единиц и всегда проходит полное расстояние за 1,5 сек.",
        "Поражает существ на расстоянии до 1700 единиц (складывается из дистации прохождения и радиуса).",
        "Действует на невидимых существ и на существ, находящихся под эффектом Disruption, использованного Shadow Demon. Игнорирует неуязвимых или спрятанных существ.",
        "Игнорирует неуязвимых или спрятанных существ.",
        "Мгновенно наносит базовый урон и добавляет 1 эффект всем вражеским существам в радиусе 200 единиц при каждом использовании. Яд сначала применяет дебафф или добавляет эффект, а затем наносит базовый урон. Несколько использований на одно и то же существо обновляет длительность всех накоплений. Первые 5 эффектов умножают урон за эффект на 1\/2\/4\/8\/16 в зависимости от их количества.",
        "Яд сначала применяет дебафф или добавляет эффект, а затем наносит базовый урон.",
        "Несколько использований на одно и то же существо обновляет длительность всех накоплений.",
        "Первые 5 эффектов умножают урон за эффект на 1\/2\/4\/8\/16 в зависимости от их количества.",
        "Каждый следующий эффект добавляет дополнительно по 50 (57,5) урона, поэтому урон начинает линейно расти после 5-го эффекта.",
        "Здесь указано, сколько урона могут нанести 1\/2\/3\/4\/5\/6 эффектов на каждом уровне (не принимая во внимание базовый урон): Уровень 1: 20\/40\/80\/160\/320\/370 (TagTalent 320\/640\/1280\/2560\/5120\/5177,5) урона. Уровень 2: 35\/70\/140\/280\/560\/610 (TagTalent 560\/1120\/2240\/4480\/8960\/9017,5) урона. Уровень 3: 50\/100\/200\/400\/800\/850 (TagTalent 800\/1600\/3200\/6400\/12800\/12 857,5) урона. Уровень 4: 65\/130\/260\/520\/1040\/1090 (TagTalent 1040\/2080\/4160\/8320\/16640\/16 697,5) урона.",
        "Уровень 1: 20\/40\/80\/160\/320\/370 (TagTalent 320\/640\/1280\/2560\/5120\/5177,5) урона.",
        "Уровень 2: 35\/70\/140\/280\/560\/610 (TagTalent 560\/1120\/2240\/4480\/8960\/9017,5) урона.",
        "Уровень 3: 50\/100\/200\/400\/800\/850 (TagTalent 800\/1600\/3200\/6400\/12800\/12 857,5) урона.",
        "Уровень 4: 65\/130\/260\/520\/1040\/1090 (TagTalent 1040\/2080\/4160\/8320\/16640\/16 697,5) урона.",
        "",
        "Применение Shadow Poison Release или потеря дебаффа Shadow Poison любым способом наносят урон от накоплений.",
        "Текущее число накоплений видно Shadow Demon и его союзникам над задетыми существами. Враги их не видят. Это число визуально ограничено 19, хоть у самого яда нет лимита накопления. Текущее число эффектов также отображается в иконке дебаффа, которая видна всем.",
        "Это число визуально ограничено 19, хоть у самого яда нет лимита накопления.",
        "Текущее число эффектов также отображается в иконке дебаффа, которая видна всем.",
        "Снаряд при движении дает летающий обзор в радиусе 200 единиц."
      ],
      "mana": "35\/40\/45\/50",
      "hotKey": "E",
      "cooldown": "2,5 (TagTalent 1,25)",
      "description": "Запускает в выбранном направлении облако, наносящее урон и отравляющее противников. Первые 5 попаданий по одной и той же цели увеличивают базовый урон от яда в 1\/2\/4\/8\/16 раз, а за последующие добавляется по 50 урона. Накопленный урон наносится по окончании действия эффекта или при применении дополнительной способности Release Poison.",
      "spellName": "Shadow Poison",
      "params": [
        "Анимация применения: 0,25+0",
        "Дальность применения: 1500",
        "Дистанция прохождения: 1500",
        "Радиус: 200",
        "Базовый урон: 26\/34\/42\/50 (TagTalent 416\/544\/672\/800)",
        "Урон за эффект: 20\/35\/50\/65 (TagTalent 320\/560\/800\/1040)",
        "Доп. урон за эффект: 50 (TagTalent 57,5)",
        "Длительность эффекта: 10",
        "Пытается нанести урон, если враг получил иммунитет к заклинаниям до выпуска яда."
      ],
      "itemBehaviour": [],
      "legacyKey": "W",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/64\/Shadow_Poison_Release.mp3\/revision\/latest?cb=20141213205911",
      "effects": [
        "Способность Ненаправленная"
      ],
      "notes": [
        "Shadow Poison Release разблокируется после изучения Shadow Poison и всегда остается активной. Способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний",
        "Способность недоступна в режиме Ability Draft из-за ограничения в один слот для неультимативных заклинаний"
      ],
      "mana": null,
      "hotKey": "D",
      "cooldown": null,
      "description": "Выпускает яд в заражённых врагах, нанося урон, даже если жертва спрятана способностью Disruption.",
      "spellName": "Shadow Poison Release",
      "params": [
        "Анимация применения: 0,3+0",
        ""
      ],
      "itemBehaviour": [],
      "legacyKey": "E",
      "story": null
    },
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/36\/Shadow_Demon_Demonic_Purge_1.mp3\/revision\/latest?cb=20191216022844",
      "effects": [
        "Способность Направленная на существо",
        "Действует на Врагов (TagAghanim Союзников)",
        "Урон Магический"
      ],
      "notes": [
        "Применяет к цели базовое развеивание, затем модификатор, действующий всю длительность способности. Урон\/лечение наносится в конце действия.",
        "Повторное применение на ту же цель убирает модификатор от предыдущего, активируя урон\/лечение, а затем накладывает новый.",
        "Действует на существо, находящееся под эффектом Disruption, использованной Shadow Demon.",
        "Урон\/лечение связаны с модификатором и применяются при его исчезновении любым путем. Они начинаются с 0 и увеличиваются на 1,43\/1,9\/2,38 (TagTalent 2,38\/2,86\/3,33) каждые 0,03 сек. действия, достигая максимальных значений за 7 сек.",
        "Они начинаются с 0 и увеличиваются на 1,43\/1,9\/2,38 (TagTalent 2,38\/2,86\/3,33) каждые 0,03 сек. действия, достигая максимальных значений за 7 сек.",
        "Замедление начинается с 100%, постепенно снижаясь до 20%. Затронутые существа восстанавливают 0,381% от своей скорости передвижения с каждым тиком сервера. То есть существа возвращают 11,43% от своей скорости передвижения в секунду.",
        "То есть существа возвращают 11,43% от своей скорости передвижения в секунду.",
        "Можно использовать на неуязвимых существ, применяя развеивание при использовании и дебафф, если неуязвимость можно развеять. Но, если неуязвимость развеять нельзя, то применяется только развеивание.",
        "Но, если неуязвимость развеять нельзя, то применяется только развеивание.",
        "С Aghanim's Scepter также применяет к цели истощение. Урон наносится после завершения эффекта истощения.",
        "Урон наносится после завершения эффекта истощения.",
        "С Aghanim's Shard позволяет применять модификатор к союзникам и излечивать их, несмотря на наличие неуязвимости. Не применяет к союзникам замедление или истощение. ↓↓ Двойное нажатие автоматически выбирает себя.",
        "Не применяет к союзникам замедление или истощение.",
        "↓↓ Двойное нажатие автоматически выбирает себя."
      ],
      "mana": "200",
      "hotKey": "R",
      "cooldown": "60 (TagTalent 30) (TagTalent 0)",
      "description": "Очищает цель, снимая с неё все положительные эффекты и замедляя её. Скорость передвижения цели постепенно возвращается к ней. По окончании действия скорость восстановится полностью, а цель получит урон. Действует на врагов под эффектом способности Disruption.",
      "spellName": "Demonic Purge",
      "params": [
        "Анимация применения: 0,3+0,6",
        "Дальность применения: 800",
        "Мин. урон: 0",
        "Макс. урон: 300\/400\/500 (TagTalent 500\/600\/700)",
        "Мин. замедление скорости передвижения: 20%",
        "Макс. замедление скорости передвижения: 100%",
        "Длительность замедления: 7",
        "Число зарядов: 3",
        "Время восстановления заряда: 60 (TagAghanim 30)",
        "Мин. лечение: 0",
        "Макс. лечение: 300\/400\/500 (TagTalent 500\/600\/700)",
        "Перезарядка заменяется 3 зарядами. Один заряд восстанавливается каждые 60 сек. Также на время действия отключает пассивные способности цели.",
        "Позволяет применить эту способность на союзника. Не замедляет его, постоянно развеивает отрицательные эффекты и излечивает в размере, равном урону способности."
      ],
      "itemBehaviour": [],
      "legacyKey": "G",
      "story": null
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.6,
    "attrStrength": 23.0,
    "attrIntelligence": 21.0,
    "attrIntelligenceInc": 3.6,
    "attrAgilityInc": 2.2,
    "attrAgility": 18.0
  },
  "description": "Shadow Demon — это герой с дальним типом атаки, основным атрибутом которого является интеллект. Его первая способность, Disruption, ненадолго изгоняет цель из мира и после возвращения создаются две иллюзии изгнанного героя, переходящие под ваш контроль. Вторая способность, Soul Catcher, проклинает всех врагов в определенном радиусе, отнимая у них часть здоровья. Половниа отнятого здоровья возвращается назад через определенное время. Противник, находящиеся под действием способности Disruption, всё равно могут стать целью заклинания. Третья способность, Shadow Poison, наносит урон при попадании и отравляет врагов. Урон может быть накоплен. Этот накопленный урон наносится по окончании действия Shadow Poison или при использовании дополнительной способности Shadow Poison Release. Ультимативная способность, Demonic Purge, очищает цель, снимая с нее все положительные эффекты и замедляя на время действия заклинания. Скорость передвижения цели постепенно возрастает, полностью восстанавливаясь к окончанию заклинания. По окончании действия цель получает урон. Эффект заклинания сработает на врагов, изгнанных способностью Disruption. Улучшение с Aghanim’s Scepter заменяет перезарядку способности на 3 заряда, восполняющиеся со временем. Также эта способность отключает пассивные способности цели на время действия.",
  "history": "Одни из верховных демонов с полным доступом к материальному миру, Doom занимается сугубо делами неинфернальных и низших спектральных сущностей, а Shadow Fiend путешествует исключительно с собирательскими экспедициями. Но вот демон тени Shadow Demon, наоборот, всегда уделял толику внимания и интереса к вещественному миру, будто чувствуя, что завладев этим хрупким перекрестком меж миров, он может заполучить ключ к власти и над остальными реальностями. Поначалу его призывали низшие колдуны, желания которых Shadow Demon исправно исполнял и регулярно демонстрировал собственную мощь маленькими порциями, постепенно увеличивая масштабы до тех пор, пока на него не обратили внимание величайшие демонологи — а после них и всяческие лорды, тираны, деспоты, иерофанты — сиречь те, чья ничтожная сила опиралась в основном на магию. Мастерство обмана демона было настолько велико, что всякий искренне считал, что именно он — его хозяин, а Shadow Demon — его слуга; тем временем, личность каждого «клиента» стиралась и заменялась необходимыми демону установками. В конце концов большинство членов культа превратились в бездушных марионеток, отростки его большой, злобной воли. Что же было следующим шагом в плане демона — остается лишь догадываться, так как как раз в то время Невермор впился в особенно прогнившую душу, и обнаружил, что там все залито тягучей нугой сущности Shadow Demon. Уловив тревожный звонок готовящегося заговора, грозившего нарушением древнего Договора Тени, Люцифер и Невермор заключили временный союз, чтобы уничтожить разрастающийся культ. Соединив заклинания невероятной мощи, они обратили столетия кропотливой работы демона в ничто, разнеся культ на куски, а его членов — в кровавые ошметки. Не осталось ничего, кроме маленькой искорки демонической тени. Бессмертной и неуничтожимой капельки Shadow Demon хватило, чтобы сразу же породить новый план. Демон сразу же принялся воплощать свою задумку в действие, все последующие столетия восполняя потери. Всё, до чего бы не дотрагивалась та толика тени, сразу же осквернялось — и сила ее, этой толики, росла. Из хаоса изуродованных частей, которые сшивались, сливались и переходили друг в друга, явилась новая форма демона, гораздо сильнее старой. Теперь он вновь владеет силой, а план всемирной власти уже очищен от старых ошибок. Казалось бы, такому совершенному существу, полному зла и жестокости, не найти места в нашем плотском мире… однако последователей у него предостаточно.",
  "talents": [
    {
      "talentLvl": "25",
      "talentLeft": "2 заряда способности Disruption",
      "talentRight": "−30 сек. перезарядки Demonic Purge"
    },
    {
      "talentLvl": "20",
      "talentLeft": "−1,25 сек. перезарядки Shadow Poison",
      "talentRight": "−6 сек. перезарядки Soul Catcher"
    },
    {
      "talentLvl": "15",
      "talentLeft": "+200 к урону от Demonic Purge",
      "talentRight": "+25 к скорости передвижения"
    },
    {
      "talentLvl": "10",
      "talentLeft": "+10 к силе",
      "talentRight": "+15% к урону от Shadow Poison"
    }
  ]
}