{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/9\/97\/Sentry_Ward_Plant.mp3\/revision\/latest?cb=20191227195528",
      "effects": [
        "Дальность применения: 500",
        "Атак героя для разрушения: 2",
        "Атак не-героя для разрушения: 8",
        "Длительность: 420"
      ],
      "notes": [
        "Даёт наземный обзор вокруг себя в радиусе 150 с длительностью в 12 секунд.",
        "Нельзя поставить внутри области фонтана (включая маленькую область перед подъёмом на базу), или в логове Рошана.",
        "Зажатая клавиша Ctrl позволяет владельцу передать союзнику один вард, вместо всей связки.",
        "Sentry Ward нельзя передать курьеру или духу-медведю с зажатой клавишей Ctrl.",
        "Перед установкой варда отображаются области появления нейтральных крипов, позволяя заблокировать лагеря.",
        "Также отображаются радиусы уже установленных Sentry Ward, показывая возможные области пересечения.",
        "Иллюзии и крипы-герои считаются за крипа при атаке варда, поэтому им нужно совершить 8 атак для уничтожения вместо 2 для героев."
      ],
      "mana": null,
      "abilityName": "Plant",
      "cooldown": null,
      "description": "Устанавливает невидимый тотем всевидения, раскрывающий невидимость вражеских существ и вардов в радиусе 900, если они в зоне вашей видимости. Действует 7 мин. Не даёт наземный обзор. Можно передать один вард союзному герою, зажав клавишу Ctrl.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 900",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Раскрытие невидимости распространяется по всей его области, ему ничто не препятствует.",
        "Эффект раскрытия невидимости распространяется аурой, действующей на врагов. Её негативный эффект задерживается на 0,5 сек.",
        "Нельзя обнаружить существ под эффектами Shadow Dance, Smoke of Deceit и мины Techies под действием Minefield Sign улучшенным Aghanim's Scepter.",
        "Зажатие клавиши Alt показывает радиус раскрытия невидимости всех союзных Sentry Ward."
      ],
      "mana": null,
      "abilityName": "True Sight",
      "cooldown": null,
      "description": "Даёт владельцу и его союзникам возможность видеть невидимых существ и варды в радиусе Sentry Ward.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Время исчезновения: 0"
      ],
      "notes": [
        "Способность и модификатор не отображаются в игре."
      ],
      "mana": null,
      "abilityName": "Невидимость",
      "cooldown": null,
      "description": "Этот юнит всегда невидим.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "50",
  "lore": null,
  "consistFrom": null,
  "name": "Sentry Ward",
  "description": "Вид растения, который когда-то выращивался в саду трусливого короля.",
  "trivia": null,
  "upgradeIn": [
    "Варды"
  ],
  "tips": null
}