{"abilities":[{"spell":"Герой вращает смертельно острые лезвия, нанося врагам вокруг урон, разрушая деревья и ненадолго снижая часть основного атрибута жертв. Способность наносит дополнительный урон за каждое срубаемое дерево.","effects":["Способность Ненаправленная","Действует на Врагов","Урон Чистый"],"notes":["При использовании прерывает произносимые заклинания Timbersaw.","Снижение атрибутов применяется до нанесения урона.","Снижение атрибутов основано на общем количестве базового атрибута задетых героев, включая дополнительные атрибуты. Снижение не обновляется, если цель получила или потеряла часть атрибутов после применения дебаффа.","До нанесения урона способность сначала снижает текущее здоровье на 20 единиц за каждую убранную единицу силы.","При потере дебаффа враги сначала восстанавливают только 19 единиц здоровья за потерянную единицу силу, а затем получают обратно свои атрибуты.","Не влияет на текущее процентное соотношение маны пораженных юнитов при возврате интеллекта.","Не может снизить значение любого атрибута до нуля.","Дебаффы от нескольких применений складываются, накладывая каждый раз отдельный дебафф.","Снижение атрибутов полностью работает на иллюзии, клонов Meepo и Tempest Double."],"mana":"70","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"6 ( 5.1)","name":"Whirling Death","description":["Анимация применения: 0+0","Радиус: 300","Урон: 90\/120\/150\/180","Доп. урон за дерево: 12\/18\/24\/30","Снижение основной характеристики: 13%\/14%\/15%\/16% ( 25%\/26%\/27%\/28%)","Длительность эффекта: 14"],"hot_key":"Q","legacy_key":"D"},{"spell":"Герой выпускает цепь, которая притягивает его к первому дереву на своём пути. Любой враг, задетый героем, получит урон.","effects":["Способность Направленная на точку","Действует на Себя \/ Врагов","Урон Чистый"],"notes":["Цепь летит со скоростью в 1600\/2000\/2400\/2800 единиц и всегда продолжает полет до достижения максимальной дистанции или зацепления за дерево.","Может зацепиться за дерево, которое находится на расстоянии до 850\/1050\/1250\/1450 ( 2250\/2450\/2650\/2850) единиц (складывается из максимальной дистанции прохождения и радиуса поиска дерева).","Выбранное дерево будет разрушено, когда цепь перестанет притягивать.","Может затянуть Timbersaw на непроходимую территорию и в деревья.","Timbersaw перестает притягиваться, если будет обезврежен в любой момент притягивания Timber Chain.","Если Timbersaw обезвредят до начала притягивания цепью, то она притянет его на очень короткое расстояние. Этого будет достаточно, чтобы нанести урон юнитам вокруг него или получить действие эффектов, основанных на расстоянии (к примеру, Rupture).","Timbersaw может использовать способности и предметы, но не может атаковать пока притягивается.","Клешня цепи дает короткий наземный обзор в радиусе 100 единиц, пока летит и наземный обзор в радиусе 400 единиц при достижении максимальной дистанции или зацеплении за дерево.","Если Timbersaw умирает в момент притягивания и мгновенно воскрешается (например, после выкупа), притягивание продолжит по возможности перемещать его по всей карте к выбранному дереву."],"mana":"60\/70\/80\/90","elements":["Нельзя применять в оцепенении.","Блокируется иммунитетом к заклинаниям."],"cooldown":"4 ( 3.4)","name":"Timber Chain","description":["Анимация применения: 0,3+0","Дальность применения: 800\/1000\/1200\/1400 ( 2200\/2400\/2600\/2800)","Макс. дистанция прохождения: 800\/1000\/1200\/1400 ( 2200\/2400\/2600\/2800)","Радиус поиска дерева: 50","Радиус урона: 225","Урон: 100\/140\/180\/220"],"hot_key":"W","legacy_key":"T"},{"spell":"Каждый раз, когда кто-то атакует героя, его броня и восстановление здоровья увеличиваются.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Срабатывает только при достижении атакой Timbersaw вне зависимости от расстояния. То есть, способность не срабатывает при промахнувшихся атаках.","Вторичные атаки от Moon Glaives, Split Shot и Flak Cannon не активируют Reactive Armor.","Срабатывает от вторичных атак других источников мгновенных атак.","Срабатывает от любых юнитов без исключения вне зависимости от команды или типа юнита (включая варды и строения).","Каждая успешная атака по Timbersaw дает ему 1 заряд. Заряд добавляется сразу до применения урона.","У каждого заряда собственная длительность, не связанная с другими зарядами. Количество зарядов отображается в иконке баффа.","Восстанавливает здоровье в виде регенерации здоровья; восстанавливает 0.1\/0.11\/0.12\/0.13 с интервалом в 0,1 секунды за заряд.","Каждый заряд может восстановить в общей сложности 10\/14.3\/19.2\/24.7 единиц здоровья.","Здесь указано, сколько регенерации здоровья дает Reactive Armor с определенным количеством зарядов на каждом уровне (включая талант на дополнительное количество зарядов). Уровень 1: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14 Уровень 2: 1.1\/2.2\/3.3\/4.4\/5.5\/6.6\/7.7\/8.8\/9.9\/11\/12.1\/13.2\/14.3\/15.4\/16.5\/17.6\/18.7\/19.8\/20.9\/22 Уровень 3: 1.2\/2.4\/3.6\/4.8\/6\/7.2\/8.4\/9.6\/10.8\/12\/13.2\/14.4\/15.6\/16.8\/18\/19.2\/20.4\/21.6\/22.8\/24\/25.2\/26.4\/27.6\/28.8\/30\/31.2 Уровень 4: 1.3\/2.6\/3.9\/5.2\/6.5\/7.8\/9.1\/10.4\/11.7\/13\/14.3\/15.6\/16.9\/18.2\/19.5\/20.8\/22.1\/23.4\/24.7\/26\/27.3\/28.6\/29.9\/31.2\/32.5\/33.8\/35.1\/36.4\/37.7\/39\/40.3\/41.6","Здесь указано, сколько брони дает Reactive Armor с определенным количеством зарядов на каждом уровне (включая талант на дополнительное количество зарядов). Уровень 1: 1\/2\/3\/4\/5\/6\/7\/8\/9\/10\/11\/12\/13\/14 Уровень 2: 1.1\/2.2\/3.3\/4.4\/5.5\/6.6\/7.7\/8.8\/9.9\/11\/12.1\/13.2\/14.3\/15.4\/16.5\/17.6\/18.7\/19.8\/20.9\/22 Уровень 3: 1.2\/2.4\/3.6\/4.8\/6\/7.2\/8.4\/9.6\/10.8\/12\/13.2\/14.4\/15.6\/16.8\/18\/19.2\/20.4\/21.6\/22.8\/24\/25.2\/26.4\/27.6\/28.8\/30\/31.2 Уровень 4: 1.3\/2.6\/3.9\/5.2\/6.5\/7.8\/9.1\/10.4\/11.7\/13\/14.3\/15.6\/16.9\/18.2\/19.5\/20.8\/22.1\/23.4\/24.7\/26\/27.3\/28.6\/29.9\/31.2\/32.5\/33.8\/35.1\/36.4\/37.7\/39\/40.3\/41.6","Количество зарядов также визуально отображается с помощью купола, закрывающего Timbersaw. Выхлопы из трубы костюма также начинают выпускать пламя до тех пор, пока не накопятся все заряды. У купола 4 части, которые выдвигаются по мере получения новых 4-х зарядов (1-4, 5-8, 9-12, 13-16). Купол вновь откроется при потере части накопленных зарядов."],"mana":"0","elements":["Частично используется иллюзиями.","Отключается истощением."],"cooldown":"0","name":"Reactive Armor","description":["Максимум эффектов: 6\/12\/18\/24 ( 14\/20\/26\/32)","Доп. броня от эффекта: 1\/1.1\/1.2\/1.3","Доп. восстановление здоровья от эффекта: 1\/1.1\/1.2\/1.3","Длительность одного эффекта: 10\/13\/16\/19"],"hot_key":"E","legacy_key":"E"},{"spell":"Запускает в указанное место пилу, которая вращается, наносит урон врагам и замедляет их передвижение. Замедление усиливается за каждые 5% потерянного здоровья. Пила наносит чистый урон и срезает все деревья на своём пути. Пока способность действует, её владелец не может атаковать и постепенно теряет ману.","effects":["Способность Направленная на область","Действует на Врагов \/ Себя","Урон Чистый"],"notes":["Chakram движется со скоростью 900. Обезоруживает Timbersaw с момента, когда Chakram запускается и до его полного возвращения. При движении напрямую к выбранной точке пила наносит моментальный урон и замедляет вражеских юнитов, оказавшихся на пути. При достижении выбранной области Chakram начинает расходовать ману, наносить периодический урон и применять замедляющую ауру. Расходует 8\/11.5\/15 единиц маны с интервалом в 0,5 секунды спустя 0,5 секунды после достижения выбранной области. Наносит 25\/37.5\/50 единиц урона (до учета сопротивления) с интервалом в 0,5 секунды спустя 0,5 секунды после достижения выбранной области. Chakram перестает расходовать ману и наносить урон, как только начнет возвращаться к владельцу. При возвращении Chakram снова наносит моментальный урон и замедляет вражеских юнитов, оказавшихся на пути, вновь размещая дебафф. Замедление от прохождения (в любом направлении) длится 0,5 секунды. Замедляющий дебафф от ауры при нахождении в пиле задерживается на 0,5 секунды. Замедляющий дебафф от прохождения и нахождения одинаковы. При этом дебафф прохождения можно развеять, а нахождения - нет.","Chakram вернется к Timbersaw при использовании Return Chakram или автоматически, если пила будет более чем в 2000 единицах от героя.","Первые 5% замедления скорости передвижения применяются на 100–96% здоровья, поэтому 100% замедление будет между 1% и 5% здоровья.","Моментальный урон может поразить одного и того же юнита только 2 раза за применение: в момент движения пилы к выбранной точке и при её возврате.","Замедление от нескольких Chakrams (оранжевого с голубым или нескольких оранжевых\/голубых Chakrams) не складывается.","Chakram дает летающий обзор в радиусе 300 единиц, пока вращается на месте в выбранном месте (а не в момент движения)."],"mana":"80\/140\/200","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"8 ( 6.8)","name":"Chakram","description":["Анимация применения: 0,3+0","Дальность применения: 1200","Радиус: 200","Моментальный урон: 100\/140\/180","Урон в секунду: 50\/75\/100","Замедление скорости передвижения за потерю 5% от макс. здоровья: 5%","Расход маны в секунду: 16\/23\/30","Длительность задержки ауры: 0,5","Длительность моментального замедления: 0,5"],"hot_key":"R","legacy_key":"C"},{"spell":"Возвращает Chakram к герою.","effects":["Способность Ненаправленная"],"notes":["Заменяет Chakram до полного возвращения оранжевого Chakram к Timbersaw.","При использовании не прерывает произносимые способности Timbersaw."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Return Chakram","description":["Анимация применения: 0+0"],"hot_key":"R","legacy_key":"C"},{"spell":"Запускает в указанное место запасную пилу, которая вращается, наносит урон врагам и замедляет их передвижение. Замедление действует всё сильнее за каждые 5% потерянного здоровья. Пила наносит чистый урон и срезает все деревья на своем пути. Пока способность активна, вы не можете атаковать и постепенно теряете ману.","effects":["Способность Направленная на область","Действует на Врагов \/ Себя","Урон Чистый"],"notes":["Требует Aghanim's Scepter для разблокировки.","Если Aghanim's Scepter приобретается до изучения Chakram, этот Chakram будет 1-го уровня.","Уровень этого Chakram равен уровню основного.","Этот Chakram действует как и основная способность. Два Chakram работают независимо друг от друга.","При этом Chakrams имеют общий замедляющий дебафф, поэтому дебаффы от них не складываются, но обновляют длительность друг друга.","Также обезоруживает Timbersaw, когда этот Chakram выпущен."],"mana":"80\/140\/200","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"8 ( 6.8)","name":"Second Chakram","description":["Анимация применения: 0,3+0","Дальность применения: 1200","Радиус: 200","Моментальный урон: 100\/140\/180","Урон в секунду: 50\/75\/100","Замедление скорости передвижения за потерю 5% от макс. здоровья: 5%","Расход маны в секунду: 16\/23\/30","Длительность задержки ауры: 0,5","Длительность моментального замедления: 0,5"],"hot_key":"D","legacy_key":"F"},{"spell":"Возвращает Chakram к герою.","effects":["Способность Ненаправленная"],"notes":["Заменяет Second Chakram до полного возвращения голубого Chakram к Timbersaw.","При использовании не прерывает произносимые способности Timbersaw."],"mana":"0","elements":["Не провоцирует эффекты своим применением."],"cooldown":"0","name":"Return Chakram (Aghanim's Scepter)","description":["Анимация применения: 0+0"],"hot_key":"D","legacy_key":"F"}],"bio":"Риззрак никак не мог забыть тех криков. Он лихорадочно крутил гайки и винты, строил, вырезал, ковал. Сон покинул его в угоду работе. Прошли уже месяцы с того момента, как он закрылся в мастерской своего дядюшки, и освобождение было близко как никогда. Почесав спину, Риззрак на мгновение закрыл глаза, и тут же перед ними предстали цветы, покачивающиеся на тихих волнах Бухты прорицаний за мгновения до того, как они обратятся облаком пыльцы, забивающей лёгкие и отбирающей жизни. Риззрак встрепенулся и заработал с ещё большим рвением. Часами мастерскую наполнял ритмичный визг шлифовального бруска: то Риззрак натачивал лезвия своих огромных пил, а в его разуме была только одна картина — как лозы удушали его соседей и опутывали дома. Потоп в Бухте прорицаний был ничем в сравнении с тем, что пустило корни в стены города. Риззрак думал, что пил-костюм сделает его сильнее, и эта мысль была последним рубежом перед поглощавшим разум страхом. Ветви, щепки и кровь. Когда город пал, Риззрак бежал от деревьев, что ходили, сражались и убивали. Деревья разбили ворота и заполонили город. Деревья разрушали последние укрепления Бухты прорицаний и преследовали немногих выживших. В абсолютной тишине мастерской раздавался грохот: Риззрак вытянул из костюма толстую цепь и дрожащими руками проверял каждое звено и клешню на её конце. Пил-костюм был готов. Всё ещё дрожа, он запустил обвешанный лезвиями механизм. Его обуял страх — страх перед тем, что его ждало и с чем ему предстоит сразиться, чтобы вернуть разуму покой. Запуская костюм, Риззрак знал, что он должен взглянуть своему страху в глаза, как и знал, что это совсем ему не понравится.","talentsTips":["Талант на здоровье увеличивает максимальный запас здоровья, и сохраняет текущий процент здоровья.","Талант на уменьшение перезарядки мультипликативно сочетается с другими источниками уменьшения перезарядки.","Талант на силу в общем даёт Timbersaw: 400 здоровья, 2 регенерации здоровья, 1,6% сопротивления магии и 20 урона от атаки."],"trivia":["В DotA, имя Timbersaw было Goblin Shredder, он являлся древесным резаком и совершенно не испытывал страха перед деревьями.","Реплика при убийстве героя Treant Protector \"If you fall in the woods, and I laugh, will anyone hear me?\" является отсылкой к популярному философскому вопросу: \"If a tree falls in a forest and no one is around to hear it, does it make a sound?\" (\"Слышен ли звук падающего дерева в лесу, если рядом никого нет?\") ","Реплика \"I'm not a lumberjack, and no, I'm not okay. I thank you.\" является отсылкой к кинофильму \"Монти Пайтон: а теперь нечто совсем другое», где они поют \"I'm a lumberjack and I'm okay\".","Реплика \"Trees? Why did it have to be trees?\" является отсылкой к фразе \"Snakes. Why did it have to be snakes?\" в фильме Indiana Jones: Raiders of the Lost Ark ","Две пилы от способности Chakram по цвету напоминают два портала из игр Portal и Portal 2, также сделанных компанией Valve.","Ультимативная способность Timbersaw Chakram, возможно является отсылкой к мифологическому дисковому оружию бога Вишну из Индийской мифологии. Оружие называлось \"Сударсана Шакра\" и являлось одним из самых сильнейших оружий в Индийской мифологии."],"talents":["+1400 к дальности Timber Chain:+12% уменьшения атрибутов от Whirling Death","-15% перезарядки способностей:+20 к силе","+8 к максимуму эффектов от Reactive Armor:+10% к урону от способностей","+2,5 маны в секунду:+225 к здоровью"],"desc":"Timbersaw — это герой с ближним типом атаки, основной характеристикой которого является сила. Его первая способность, Whirling Death, вращает смертельно острые лезвия, нанося врагам урон и разрушая деревья в области вокруг себя. Вражеские герои, получившие урон, дополнительно потеряют определенное значение своей основной характеристики. Способность нанесет чистый урон, если было срублено хоть одно дерево. Вторая способность, Timber Chain, выпускает гарпун, который цепляется за первое попавшееся дерево и притягивает героя к этому дереву. Любой враг, оказавшийся на пути, получит урон. Данной способностью герой притягивается к дальнему дереву, при этом нанося урон противникам, оказавшимся на пути. Пассивная способность, Reactive Armor, получает дополнительную броню и ускоренный реген здоровья, каждый раз, когда кто-то атакует Timbersaw. Ультимативная способность, Chakram, запускает лезвие вашей пилы в указанное место, где оно начинает вращаться, нанося урон врагам вокруг себя. Враги, атакованные пилой, будут передвигаться медленнее за каждые 5% потерянного здоровья. Лезвие наносит чистый урон и срезает деревья на своем пути до цели и при обратном движении. Timbersaw теряет возможность атаковать и теряет ману, пока способность активна. Улучшение с Aghanim's Scepter добавляет второй Second Chakram."}