{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/2\/21\/Medallion_of_Courage_Valor.mp3\/revision\/latest?cb=20191227195456",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies \/ Allies"
      ],
      "notes": [
        "Cannot be cast on self.",
        "Shares cooldown with Solar Crest.",
        "The debuff on self and the buff on allies\/debuff on enemies are independent from each other. Dispelling one does not dispel the other.",
        "A unit can be affected by the buff and the debuff at the same time, but not by multiple buffs or debuffs from it. This means when two opposing heroes cast it on each other, the debuffs refresh each other. When two allied heroes cast it on each other, both receive the buff and the debuff which are independent from each other. However, the buff and the debuff fully stack with those applied by Solar Crest.",
        "This means when two opposing heroes cast it on each other, the debuffs refresh each other.",
        "When two allied heroes cast it on each other, both receive the buff and the debuff which are independent from each other.",
        "However, the buff and the debuff fully stack with those applied by Solar Crest.",
        "Can be cast on any unit, except on wards and buildings."
      ],
      "mana": "0",
      "abilityName": "Valor",
      "cooldown": "12",
      "description": "If cast on an ally, grants them the 5 armor, and removing it from the caster. If cast on an enemy, reduces 5 armor on both the enemy and the caster. Cannot target spell immune enemies.",
      "params": [
        "Cast Range: 1000",
        "Self Armor Reduction: 5",
        "Enemy Armor Reduction: 5",
        "Ally Armor Bonus: 5",
        "Duration: 12",
        "Can be cast on spell immune allies. Cannot be cast on spell immune enemies."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "1025",
  "lore": null,
  "consistFrom": [
    "Chainmail",
    "Sage's Mask",
    "Blight Stone"
  ],
  "boughtFrom": "Support",
  "name": "Medallion of Courage",
  "description": "The bearer has no fear of combat.",
  "trivia": null,
  "upgradeIn": [
    "Solar Crest"
  ],
  "bonuses": [
    "+1.5 Mana Regeneration",
    "+5 Armor"
  ],
  "tips": [
    "Medallion of Courage is a common item on ganking heroes, as it provides additional physical damage through armor reduction, and grants some mana regeneration which helps regaining some mana between ganks.",
    "The armor reduction of the ability is a great tool to speed up killing Roshan, especially early on."
  ]
}