{"abilities":[{"spell":"Соединяет несколько врагов магической связью, в результате чего часть урона, полученного любым из них, наносится и остальным.","effects":["Способность Направленная на юнита","Действует на Врагов"],"notes":["У отскоков Fatal Bonds нет задержки: все цели связываются одновременно.","Приоритетными целями для связывания являются ближайшие юниты, ещё не находящиеся под действием дебаффа. То есть, при повторном использовании способность выберет врагов, не задетых первым применением, но если поблизости таких не будет, то связь сложится с предыдущим применением.","Может связывать существ в тумане войны, но не невидимых юнитов.","Не применяется и не действует на Рошана.","Распространяемый урон имеет тот же тип урона, что и источник урона. Это значит, что физический урон распространяется как физический, магический урон как магический и чистый урон как чистый. Из-за этого распространяемый урон взаимодействует с каждым эффектом, реагирующим на урон, таким как, например, отключение Blink Dagger.","Урон от Fatal Bonds имеет пометку \"неотражаемый\", что предотвращает взаимодействие урона с другими источниками урона с такой же пометкой.","Распространяет урон до того, как он будет уменьшен или усилен любым способом на получающей его цели. Когда, например Abaddon получает урон под эффектом от Borrowed Time, связь по-прежнему распространяет урон до того, как способность превратит его в лечение. Это также относится к иллюзиям. При повреждении связанной иллюзии, урон распространяется до того, как он будет увеличен для иллюзии. Это также касается последних ударов. Например, когда юнит с 10 единицами здоровья получает 1000 единиц урона, то связь по-прежнему распространит 12%\/16%\/20%\/24% ( 16%\/20%\/24%\/28%) от 1000 единиц урона по всем остальным связанным юнитам.","Способность распространяет только 3 типа урона. Урон, отнимающий здоровье, распространяться не будет.","Для целей, которые связаны - расстояние не имеет значения. Где бы они не находились, они будут распространять и получать урон.","Источником распространяемого урона всегда является Warlock. Если персонаж умрёт от получения урона с Fatal Bonds, то убийство засчитается Warlock в независимости от того, кто нанес урон, который распространился.","Урон, распространенный с помощью Fatal Bonds, не вызывает агрессию. Связанные нейтральные крипы не будут реагировать на урон.","Увеличивает общий урон от каждого источника на 7,8125E-9% ( 5,952380952381E-9%) при максимальном количестве связанных юнитов.","Последовательные использования Fatal Bonds полностью комбинируются и работают независимо друг от друга."],"mana":"140","elements":["Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"36\/30\/24\/18","name":"Fatal Bonds","description":["Анимация применения: 0,2+0","Дальность применения: 1000 ( 1150)","Радиус отскока: 700","Число отскоков: 6","Распространяемый урон: 12%\/16%\/20%\/24% ( 16%\/20%\/24%\/28%)","Длительность: 25"],"hot_key":"Q","legacy_key":"F"},{"spell":"Warlock шепчет заклинание, излечивая дружественных существ или нанося урон вражеским на протяжении времени.","effects":["Способность Направленная на юнита ( Направленная на область)","Действует на Врагов \/ Союзников","Урон Магический"],"notes":["Лечение или нанесение урона происходят с интервалом в 1 секунду спустя 1 секунду после использования способности, срабатывая 12 раз.","Может нанести до 180\/300\/420\/540 единиц урона цели (до учёта сопротивления), или же исцелить на то же значение союзного персонажа.","Последующие использования Shadow Word полностью комбинируются и работают независимо друг от друга на цели.","Можно применить на союзных курьеров.","Имеет две разные звуковые дорожки, первая воспроизводится, когда применяется на союзника, вторая - когда целью является враг.","Талант превращает Shadow Word в заклинание, направленное на область, поэтому им больше нельзя выбирать существ напрямую."],"mana":"120\/130\/140\/150","elements":["Частично блокируется Linken's Sphere.","Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"16 ( 9)","name":"Shadow Word","description":["Анимация применения: 0,5+0,6","Дальность применения: 450\/550\/650\/750 ( 600\/700\/800\/900)","Радиус: 0 ( 300)","Урон в секунду: 15\/25\/35\/45","Лечение в секунду: 15\/25\/35\/45","Длительность: 12"],"hot_key":"W","legacy_key":"W"},{"spell":"Мощный замедляющий поток энергии, со временем становящийся сильнее. Действует до 16 секунд. Эффект сохраняется в течение 3 секунд после того, как враг покинул зону действия или заклинание прервалось.","effects":["Способность Направленная на область \/ Произносимая","Действует на Врагов"],"notes":["Сила замедления базируется на длительности произнесения, а не на том, сколько цель провела времени в радиусе действия.","Замедление увеличивается в процентном соотношении на 3,5%\/7%\/10,5%\/14% с интервалом в 0.5 секунды, начиная с 0.5 секунды после применения заклинания.","Чтобы получить максимальное замедление в размере 84%, нужно произносить заклинание в течении 12\/6\/4\/3 секунд соответственно.","Негативный эффект замедления применяется или обновляется с одинаковыми интервалами."],"mana":"70\/90\/110\/130","elements":["Блокируется иммунитетом к заклинаниям."],"cooldown":"50\/46\/42\/38","name":"Upheaval","description":["Анимация применения: 0,5+0","Дальность применения: 1200 ( 1350)","Радиус: 650","Макс. длительность: 16","Замедление скорости передвижения за секунду: 7%\/14%\/21%\/28%","Максимальное замедление: 84%","Длительность замедления: 3"],"hot_key":"E","legacy_key":"E"},{"spell":"Вызывает из пучин Голема, оглушающего врагов на 1 секунду. Время жизни голема — 60 секунд, он получает меньше урона от заклинаний и при атаке накладывает на жертву Permanent Immolation и Flaming Fists.","effects":["Способность Направленная на область","Действует на Врагов","Урон Физический"],"notes":["Големы всегда призываются в центре выбранной области.","Големы - это крипы-герои и древние крипы, поэтому некоторые способности взаимодействуют с ними иначе. Для более подробной информации перейдите по ссылкам.","Chaotic Offering, улучшенный Aghanim's Scepter, после задержки призывает первого голема а затем с задержкой второго, увеличивая длительность оглушения до 1,4 секунды.","После применения уничтожает деревья в пределах 600 единиц в выбранной области.","Визуальный эффект и звуки во время задержки эффекта видны и слышны для всех.","Также играет звуковой эффект во время использования, который также слышен для всех.","Если выбрать талант на 20 уровне, то после смерти Warlock будет призван один голем, в месте его смерти. Характеристики этого голема основаны на текущем уровне Chaotic Offering. Также применяются все таланты 25 уровня, в зависимости от того, какой выбран. Aghanim's Scepter не влияет на характеристики этого голема и не вызывает при смерти Warlock 2 големов. Голем не будет призван, когда Warlock умрёт с Aegis of the Immortal в инвентаре. В отличии от обычного применения голем от таланта вызывается мгновенно при смерти Warlock. Оглушение по области от Chaotic Offering также применяется вокруг Warlock.","Если выбрать талант на 25 уровне, то големы будут иметь постоянный иммунитет к заклинаниям."],"mana":"250\/375\/500","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"170","name":"Chaotic Offering","description":["Анимация применения: 0,5+0,7","Дальность применения: 1200 ( 1350)","Радиус оглушения: 600","Задержка: 0,5","Количество големов: 1 ( 2)","Длительность оглушения: 1","Длительность жизни големов: 60"],"hot_key":"R","legacy_key":"R"},{"spell":"Наносит дополнительный урон врагам поблизости при атаке.","effects":["Способность Пассивная","Действует на Врагов"],"notes":["Не работает на строения и варды.","Не наносит урон существам в призрачной форме и с иммунитетом к атакам.","Радиус начинается с атакованой цели.","Урон также наносится атакованой цели, не только ближайшим юнитам."],"mana":"0","elements":["Отключается истощением.","Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Flaming Fists","description":["Радиус: 300","Урон: 40\/50\/60"]},{"spell":"Обжигает противников рядом с големом, нанося им периодический урон.","effects":["Способность Аура","Действует на Врагов"],"notes":["Permanent Immolation - это аура. Её дебафф задерживается на 0.5 секунды.","Наносит урон с интервалом в 1 секунду спустя 1 секунду после применения дебаффа.","Может нанести до 1815\/3025\/4235 единиц урона одному существу (до учета сопротивлений), если оно оставалось в пределах действия всю длительность.","Permanent Immolation от нескольких големов полностью складываются."],"mana":"0","elements":["Отключается истощением.","Блокируется иммунитетом к заклинаниям."],"cooldown":"0","name":"Permanent Immolation","description":["Радиус: 300","Урон в секунду: 30\/50\/70","Длительность задержки ауры: 0.5"]},{"spell":"Это существо невосприимчиво к эффектам большинства заклинаний.","effects":["Способность Пассивная","Действует на Себя"],"notes":["Разблокируется только при выборе правого таланта на 25 уровне.","Иммунитет к заклинаниям дается постоянным эффектом состояния, вместо способности."],"mana":"0","elements":["Не отключается истощением."],"cooldown":"0","name":"Иммунитет к заклинаниям","description":["Доп. сопротивление магии: 100%"]}],"bio":"Будучи ректором и главой отдела реликвий в скрытых архивах Ультимирской академии, Дэмнок Лэнник неустанно искал затерянные, редкие и запретные тома. Ни проклятые храмы, ни коварные пещерные ходы — ничто не заставило бы Дэмнока свернуть с тропы, стоило ему прознать, что, быть может, в конце пути он найдет хотя бы жалкий кусочек свитка с древними знаниями. И так часто приходилось ему сталкиваться с сущностями, оставленными защищать эти древние знания, что он наконец посчитал необходимым изучить таинства магии. С такой же одержимостью принялся Дэмнок за учение, с какой отправлялся в опаснейшие походы за записями — и превзошёл всех чернокнижников Ультимирской академии за время, которого остальным хватило бы, лишь чтобы изучить самые основы. В последнюю очередь он вырезал себе посох из дредвудского дерева и заточил в него духа из Глубин Ада. И, ожидая дня, когда он найдёт последнюю затерянную книгу заклинаний, Дэмнок приступил к своему собственному произведению — Чёрному гримуару. Сомнений нет: он будет весьма поучительным.","talentsTips":["Талант на броню не дается иллюзиям."],"trivia":["In DotA, Warlock's ultimate is named Rain of Chaos and the summoned unit was called an Infernal, a hulking golem with green-colored flames. Both names were changed in the transition to Dota 2 to avoid copyright conflict.","Warlock's response \"Just for that, I'm unfiending you.\" when killed is probably a play on \"Unfriending you\" an action in the popular social network Facebook where a person removes another from their friend list.","The response \"Bloodied but unbowed\" when respawning is a reference to William Ernest Henley's poem \"Invictus\".","Fatal Bonds' sound effect is based on this otherwise unused voice line.","Warlock, Disruptor и Axe произошли из одного племени – Oglodi."],"talents":["Големы получают +100% к сопротивлению магии:+25 к броне голема","+300 к радиусу применения Shadow Word:При смерти призывается голем","-7 сек. к перезарядке Shadow Word:+10 к броне","+150 к дальности способностей:+4% к урону от Fatal Bonds"],"desc":"Warlock — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Он имеет четыре способности, каждая из которых является активной. Первая способность, Fatal Bonds, соединяет несколько врагов магической связью, в результате чего 25% от урона, полученного любым из них, наносится и остальным. Второй способностью, Shadow Word, Warlock излечивает дружественных существ или наносит урон вражеским на протяжении некоторого времени. Третьей способностью, Upheaval, герой замедляет врагов потоком энергии, со временем становящийся сильнее. Ультимативной способностью, Chaotic Offering, Warlock вызывает из пучин Warlock's Golem, оглушающего врагов на 1 секунду. Время жизни голема — 60 секунд, он получает меньше урона от заклинаний и при атаке накладывает на жертву Permanent Immolation и Flaming Fists. Если изучить талант на 25 уровне то у големов также будет и Иммунитет к заклинаниям. Улучшение с Aghanim's Scepter позволяет призывать двух големов со сниженными параметрами до 75% и наградой за убийство на 50%."}