{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/c\/ca\/Infused_Raindrop_Magical_Damage_Block.mp3\/revision\/latest?cb=20191227195443",
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Срабатывает только на магический урон, равный или превышающий 50 (до уменьшений), урон нанесённый самому себе и урон полученный от союзников. При срабатывании блокирует до 120 урона (до уменьшений). Также игнорирует все виды усиления урона, включая усиление урона заклинаний. Имеет наивысший приоритет в группе заклинаний, отрицающих урон, блокируя урон первым. Имеет наивысший приоритет, чем Dispersion и Blade Mail, то есть предмет заблокирует урон до отражения. Имеет более низкий приоритет, чем Mana Shield, то есть щит уменьшает урон до того, как его заблокирует Infused Raindrops.",
        "При срабатывании блокирует до 120 урона (до уменьшений).",
        "Также игнорирует все виды усиления урона, включая усиление урона заклинаний.",
        "Имеет наивысший приоритет в группе заклинаний, отрицающих урон, блокируя урон первым.",
        "Имеет наивысший приоритет, чем Dispersion и Blade Mail, то есть предмет заблокирует урон до отражения.",
        "Имеет более низкий приоритет, чем Mana Shield, то есть щит уменьшает урон до того, как его заблокирует Infused Raindrops.",
        "Если у героя несколько Infused Raindrops, то при срабатывании заряд будут терять все предметы, но блокировать урон — только один.",
        "Не поглощает урон и не расходует заряды при перезарядке."
      ],
      "mana": null,
      "abilityName": "Magical Damage Block",
      "cooldown": "7",
      "description": "Теряет один заряд и блокирует до 120 магического урона. Срабатывает, только если урон был больше 50. Изначально имеет 6 зарядов и пропадает вместе с последним из них.",
      "params": [
        "Граница минимального урона: 50",
        "Блокируемый магический урон: 120",
        "Количество зарядов: 6",
        "При иммунитете к заклинаниям, Infused Raindrops не реагирует на магический урон."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Доступен для покупки начиная с 3 минуты игры. После этого имеет перезарядку восстановления в 1 секунду.",
    "Infused Raindrops не складывается в инвентаре. Каждый Infused Raindrops занимает отдельную ячейку. Регенерация маны от нескольких Infused Raindrops складывается.",
    "Регенерация маны от нескольких Infused Raindrops складывается.",
    "Стоимость продажи зависит от оставшегося количества зарядов Infused Raindrops. Один заряд имеет стоимость продажи в 18,75 золота."
  ],
  "cost": "225",
  "lore": null,
  "consistFrom": null,
  "boughtFrom": "Снаряжение",
  "name": "Infused Raindrops",
  "description": "Стихийная защита от магических атак.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+0,8 к регенерации маны"
  ],
  "tips": [
    "Infused Raindrops поглощает урон от Eul's Scepter of Divinity Cyclone, поэтому Cyclone не сможет отключить Blink Dagger, позволяя герою телепортироваться после окончания действия предмета.",
    "Хорошо работает против героев, которые давят на начальной стадии игры способностями с магическим уроном, особенно против тех, кто имеет способность с большим уроном и высокой стоимостью маны, например, Queen of Pain, Leshrac, Lich, Visage и Lina.",
    "Infused Raindrops также хорошо работает против способностей с низким уроном, таких как Static Remnant, Arc Lightning и Arcane Bolt, однако эти заклинания тратят заряды Infused Raindrops намного быстрее, чем способности с большим уроном и долгой перезарядкой. То же самое относится к пассивной способности Maelstrom Chain Lightning.",
    "Так как Infused Raindrops игнорирует способности с уроном ниже 50, он не эффективен против способностей с периодическим уроном, таких как у Viper, Warlock, Jakiro и Huskar. Infused Raindrops не очень эффективен против периодического урона, потому что предмету необходим высокий урон, чтобы израсходовать заряд. Одна такая способность может задействовать заряды Infused Raindrops несколько раз на протяжении всей длительности, тратя заряды на довольно-таки низкий урон, по сравнению со способностями с мгновенным уроном. Способности, такие как Venomous Gale и Shadow Strike, наносят продолжительный периодический урон, который с лёгкостью потратит 2 заряда за всю длительность, блокируя при этом низкий урон.",
    "Infused Raindrops не очень эффективен против периодического урона, потому что предмету необходим высокий урон, чтобы израсходовать заряд. Одна такая способность может задействовать заряды Infused Raindrops несколько раз на протяжении всей длительности, тратя заряды на довольно-таки низкий урон, по сравнению со способностями с мгновенным уроном. Способности, такие как Venomous Gale и Shadow Strike, наносят продолжительный периодический урон, который с лёгкостью потратит 2 заряда за всю длительность, блокируя при этом низкий урон.",
    "Способности с короткой длительностью, такие как Frostbite или несколько Burning Spear (всего с 5 применениями), также тратят заряды, так как наносят минимальный необходимый урон, позволяя врагам применять способности с более высоким уроном, пока предмет находится на перезарядке.",
    "В конце игры, Radiance сжигает заряды Infused Raindrops без особых усилий и с минимальным количеством заблокированного урона, что делает его не очень эффективным против Radiance.",
    "Infused Raindrops не стоит использовать в сочетании с другими способностями отрицающих урон, таких как Aphotic Shield или Refraction, потому что он всё ещё тратит заряд и блокирует урон до того, как это сделает способность, тратя заряд на урон, который уже был бы заблокирован способностью."
  ]
}