{
  "abilities": [
    {
      "spell": "Fires an intense energy beam, dealing damage and blinding the target, causing it to miss all physical attacks.",
      "effects": [
        "Ability Target Unit",
        "Affects Enemies",
        "Damage Pure"
      ],
      "notes": [
        "Plays a sound effect during the cast time, which is audible to everyone.",
        "Uses the creep duration for creep-heroes.",
        "The laser first applies the damage, then the debuff.",
        "When upgraded with Aghanim's Scepter, the Laser bounces to the closest enemy hero within a 450 radius of its current target. The bounces happen instantly, with no time interval between them. Has no bounce limit. Can only bounce to heroes (including clones), illusions and creep-heroes. When the primary target is a regular creep\/summon, it still bounces to valid targets within range. Does not bounce on invisible units or units in the Fog of War. Can never hit the same unit twice per cast."
      ],
      "mana": "110\/130\/150\/170",
      "elements": [
        "Partially blocked by Linken's Sphere.",
        "Does not pierce spell immunity."
      ],
      "cooldown": "20\/18\/16\/14",
      "name": "Laser",
      "description": [
        "Cast Animation: 0.4+1",
        "Cast Range: 650 ( 725)",
        "Bounce Radius: 0 ( 450)",
        "Damage: 80\/160\/240\/320 ( 180\/260\/340\/420)",
        "Miss Chance: 100%",
        "Hero Duration: 3\/3.5\/4\/4.5",
        "Creep Duration: 6"
      ],
      "hot_key": "Q",
      "legacy_key": "E"
    },
    {
      "spell": "Launches a pair of rockets at the nearest visible enemy heroes within 2500 range.",
      "effects": [
        "Ability No Target",
        "Affects Enemy Heroes",
        "Damage Magical"
      ],
      "notes": [
        "Heat-Seeking Missile interrupts Tinker's channeling spells upon cast.",
        "The missiles travel at a speed of 700.",
        "When all missiles hit, they collectively can deal up to 250\/400\/550\/700 ( 500\/800\/1100\/1400) damage (before reductions).",
        "Does not target units which are out of vision (e.g. invisible), invulnerable or hidden.",
        "Does target hero clones and illusions.",
        "When no valid targets were in range, the rockets are released and fall on the ground, showing that the cast failed.",
        "When choosing the level 25 talent, the rockets also inflict a short stun on enemies they hit. The rockets first apply their damage, then the debuff."
      ],
      "mana": "80\/100\/120\/140",
      "elements": [
        "Can be disjointed.",
        "Does not pierce spell immunity."
      ],
      "cooldown": "25",
      "name": "Heat-Seeking Missile",
      "description": [
        "Cast Animation: 0+1.2",
        "Search Radius: 2500",
        "Number of Targets: 2 ( 4)",
        "Damage per Rocket: 125\/200\/275\/350",
        "Stun Duration: 0 ( 0.3)"
      ],
      "hot_key": "W",
      "legacy_key": "T"
    },
    {
      "spell": "Enlists an army of robotic minions to destroy enemy units in an area around Tinker.",
      "effects": [
        "Ability Target Point",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "The robots move at a speed of 400 and move a distance up to 1800 forwards, taking 4.5 seconds to travel the full distance.",
        "The 900 spawn radius is centered and fixed around the cast point, not on Tinker's location.",
        "The spawn area is a line with 1800 length, which is centered 900 range behind the targeted cast point.",
        "So the overall affected area is rather square-shaped, with 1800 side lengths.",
        "Robots spawn in 0.0417 second intervals at a random point of the line, which is 24 robots per second, for a total of 144 robots.",
        "Robots do not spawn at points of the spawning line which are outside of the map boundaries.",
        "When an enemy comes within 50 radius of a robot, the robot deals damage in 150 radius around itself and then disappears.",
        "If a lone enemy stands still within the area for the full duration, they would take an average of 189.44\/284.16\/378.88\/473.6 ( 284.16\/378.88\/473.6\/568.32) damage (before reductions).",
        "If each explosion could hit a single target, it would deal up to 2304\/3456\/4608\/5760 ( 3456\/4608\/5760\/6912) damage (before reductions).",
        "The robots do not explode and deal area damage when colliding with couriers.",
        "The sound effect upon cast is not audible by enemies. The marching sounds are."
      ],
      "mana": "145\/150\/165\/190",
      "elements": [
        "Does not pierce spell immunity."
      ],
      "cooldown": "35",
      "name": "March of the Machines",
      "description": [
        "Cast Animation: 0.53+0.63",
        "Cast Range: 300 ( 375)",
        "Robot Spawn Radius: 900",
        "Robot Collision Radius: 50",
        "Robot Explosion Radius: 150",
        "Robot Explosion Damage: 16\/24\/32\/40 ( 24\/32\/40\/48)",
        "Spawn Duration: 6"
      ],
      "hot_key": "E",
      "legacy_key": "C"
    },
    {
      "spell": "Resets the cooldown on most of Tinker's items and abilities.",
      "effects": [
        "Ability No Target \/ Channeled",
        "Affects Self"
      ],
      "notes": [
        "The following items cannot be rearmed: Arcane Boots, Black King Bar, Hand of Midas, Helm of the Dominator, Linken's Sphere, Meteor Hammer, Aeon Disk, Necronomicon, Pipe of Insight, Refresher Orb, and Refresher Shard. Visually resets the cooldown of Tranquil Boots, but does not skip the broken state. Does not reset charges on charge-based items ( Bottle, Drum of Endurance). Only refreshes items in Tinker's inventory and backpack. Items in stash, in other units' (e.g. couriers) inventories or dropped items are unaffected. Only refreshes items owned by Tinker. Allied items in his inventory or backpack are not refreshed. When the channeling is interrupted, nothing is rearmed.",
        "Can rearm Crimson Guard and Mekansm, but does not reset their stack restriction timer. The same rule applies when rearming Guardian Greaves, but Mend still restores mana.",
        "Can rearm Manta Style, but recasting it replaces the previous illusions.",
        "Can rearm a disabled Blink Dagger and Heart of Tarrasque as well as the cooldown of Skull Basher and Abyssal Blade.",
        "Rearm's sound gets shorter with each level to match the decreasing channel time.",
        "The Rearm modifier has only informational purpose."
      ],
      "mana": "100\/200\/300",
      "elements": [
        "Pierces spell immunity."
      ],
      "cooldown": "0",
      "name": "Rearm",
      "description": [
        "Cast Animation: 0.53+0",
        "Channel Time: 3\/1.5\/0.75"
      ],
      "hot_key": "R",
      "legacy_key": "R"
    }
  ],
  "bio": "Boush the Tinker's diminutive race is known for its intelligence, its cunning, and its prickly relationship with magic. As a matter of pride, they survive by their wits, and use only those powers of nature that may be unlocked through rational methodologies. Even this forbearance has led to a great deal of trouble, as Boush can attest. Once a key investigator of natural law, Boush the Tinker led a vast intellectual investigation into the workings of nature, founding a subterranean laboratory in the rumored, mist-wreathed wastes of the Violet Plateau. While scorning mages for the dangers they visit upon the world, Boush and his Tinker associates haughtily wrenched open a portal to some realm beyond comprehension and ushered in some nightmares of their own. A black mist rose from the cavernous interior of the Violet Plateau, shrouding it in permanent darkness from which sounds of horror perpetually emanate. Boush escaped with only his wits and the contraptions he carried, the sole Tinker to survive the Violet Plateau Incident.",
  "talentsTips": [
    "The cast range talent does not affect the jump distance of Laser.",
    "The spell lifesteal talent stacks additively with other sources of spell lifesteal.",
    "The spell lifesteal talent heals for 2% from non-hero units. Treats creep-heroes as creeps and does not heal off of illusions.",
    "The armor talent does not benefit illusions."
  ],
  "trivia": [
    "The Tinker's voice actor, Harry \"Hal\" Robins, also voiced Dr. Isaac Kleiner in Half-Life 2 and the scientists of Black Mesa in Half-Life. Many of Tinker's voice lines reference characters and events from the Half-Life universe. In addition, the name \"Violet Plateau\" is quite similar to \"Black Mesa\", and the events described in Tinker's backstory are remarkably similar to the events of Half-Life. Tinker's responses upon killing Broodmother's Spiderlings \"Lamarr, is that you?\" and \"Lamarr?!\" are a reference to Dr. Kleiner's \"debeaked\" pet headcrab, Hedy Lamarr. Many of Tinker's lines while using Rearm come directly from Half-Life 2 including \"The massless field flux should self-limit\" and \"I've clamped the manifold parameters to… CY base and LG orbifold… Hilbert inclusive\". Tinker's death line \"It's probably not a problem, probably\" is also a reference to Dr. Kleiner, who says it in the beggining of Half Life's second chapter right before the equipment he and his team are working on suffers a catastrophical malfunction and causes the alien invasion of Black Mesa. Tinker's selecting respones \"With my brains and your brawn, we'll make an excellent team\" is also a quote from Dr. Kleiner.",
    "The Tinker's alternate\/fun name in DotA was \"X!!\", the name of a professional DotA player.",
    "Tinker's line \"I tink! Therefore I am!\" is a reference to the philosophical statement \"I think, therefore I am.\" proposed by René Descartes. Its original Latin words are \"Cogito ergo sum.\"",
    "Tinker's line \"Tinker, failure…Soldier…Fie…\" is a reference to the 1974 spy novel Tinker, Tailor, Soldier, Spy by British author John le Carré about George Smiley (who was played by Gary Oldman in the 2011 film adaptation).",
    "Tinker's death line \"The machine, stops.\" is a reference to the short story of the same name by E.M. Forster."
  ],
  "talents": [
    "+0.3s Heat-Seeking Missile Ministun:+100 Laser Damage",
    "+8 March of the Machines Damage:+10 Armor",
    "10% Spell Lifesteal:+30 Movement Speed",
    "+75 Cast Range:+6% Spell Amplification"
  ],
  "desc": "Boush, the Tinker, is a ranged intelligence hero who leverages great mobility and blistering nukes to push lanes and gank his enemies. Tinker's ultimate Rearm resets the cooldown on his items and abilities, allowing him to deal prodigious damage with his Laser, Heat-Seeking Missiles and with items such as Dagon. By refreshing Boots of Travel, Rearm also grants Tinker vast mobility, enabling him to pressure multiple lanes with his March of the Machines. Tinker's mana costs are very high, however, so to remain a global threat he must regularly regenerate at his fountain. His mana dependency and modest stat gain make quickly acquiring Boots of travel a key to success. When played with the right items, good mana management and mechanical skill, there are few heroes Tinker will not evaporate."
}