{"abilities":[{"spell":"Выпускает луч сконцентрированной энергии, который наносит урон и ослепляет цель, из-за чего та промахивается всеми физическими атаками.","effects":["Способность Направленная на юнита","Действует на Врагов","Урон Чистый"],"notes":["Во время применения проигрывается звуковой эффект, который слышен всем.","На крипов-героев способность действует столько же, сколько и на крипов.","При улучшении Aghanim's Scepter, способность отскакивает в ближайшего вражеского героя в радиусе 400 от начальной цели. Все отскоки срабатывают одновременно без какой-либо задержки между ними. У отскоков нет лимита по количеству. Может отскакивать только от героев (включая копии), иллюзий и крипов-героев. Если первичная цель окажется обычным крипом\/призванным существом, способность продолжит перескакивать только к подходящим целям в радиусе действия. Не отскакивает от невидимых юнитов или юнитов, находящихся в тумане войны. Не может ударить одну и ту же цель дважды за одно применение способности."],"mana":"110\/130\/150\/170","elements":["Частично блокируется Linken's Sphere.","Блокируется иммунитетом к заклинаниям."],"cooldown":"20\/18\/16\/14","name":"Laser","description":["Анимация применения: 0,4+1","Дальность применения: 650 ( 660)","Радиус отскока: 0 ( 400)","Урон: 80\/160\/240\/320 ( 180\/260\/340\/420)","Шанс промаха: 100%","Длительность на героях: 3\/3.5\/4\/4.5","Длительность на крипах: 6"],"hot_key":"Q","legacy_key":"E"},{"spell":"Запускает пару ракет в ближайших видимых вражеских героев в радиусе 2500 единиц.","effects":["Способность Ненаправленная","Действует на Вражеских героев","Урон Магический"],"notes":["Использование Heat-Seeking Missile прерывает произнесение заклинаний.","Ракеты летят со скоростью 900 единиц.","При попадании всех ракет, они все могут нанести до 250\/400\/550\/700 ( 500\/800\/1100\/1400) единиц урона (до учета сопротивления).","Не считает целями юнитов вне зоны обзора (в том числе невидимых), неуязвимых или спрятанных.","Считает целями копии героев и иллюзии.","Если в радиусе действия нет подходящих целей, ракеты вылетают и падают на землю, показывая, что применение способности было неуспешным."],"mana":"120\/140\/160\/180","elements":["Можно избежать.","Блокируется иммунитетом к заклинаниям."],"cooldown":"18","name":"Heat-Seeking Missile","description":["Анимация применения: 0+1,2","Радиус: 2500","Количество целей: 2 ( 4)","Урон от ракеты: 125\/200\/275\/350","Длительность оглушения: 0 ( 0,3)"],"hot_key":"W","legacy_key":"T"},{"spell":"Призывает армию механических слуг, атакующих врагов вокруг Tinker.","effects":["Способность Направленная на точку","Действует на Врагов","Урон Магический"],"notes":["Роботы движутся со скоростью 400 единиц на расстояние 1800 единиц за 4.5 секунды.","Область появления роботов радиусом 900 единиц зафиксирована за точкой применения, а не за местоположением самого Tinker.","Область появления является линией длиной 1800 единиц, которая начинается в 900 единицах позади точки примения.","Так что вся площадь области появления роботов представляет собой квадратную форму со стороной в 1800 единиц.","Роботы появляются с промежутком в 0.0417 секунды в случайных точках по области применения, получается 24 робота в секунду, и всего появляется 144 робота.","Роботы не появляются там, где площадь примения выходит за границы карты.","Когда враг подходит на расстояние 50 единиц от робота, он наносит урон в радиусе 150 единиц от себя, а затем исчезает.","Если один враг с площадью столкновения в 24 единиц будет неподвижно стоять все время действия способности, он может получить до 189.44\/284.16\/378.88\/473.6 ( 284.16\/378.88\/473.6\/568.32) единиц урона (до учета сопротивления).","Если каждый взрыв мог бы сработать на одну цель, то на неё бы сработало до 2304\/3456\/4608\/5760 ( 3456\/4608\/5760\/6912) единиц урона (до учета сопротивления).","Роботы не взрываются и не наносят урон при столкновении с курьером.","Звук применения способности не слышен врагам, но звук движения роботов им слышен."],"mana":"130\/150\/170\/190","elements":["Частично проходит сквозь иммунитет к заклинаниям."],"cooldown":"35","name":"March of the Machines","description":["Анимация применения: 0,53+0,63","Дальность применения: 300 ( 310)","Радиус появления роботов: 900","Радиус столкновения роботов: 50","Радиус взрыва роботов: 150","Урон от взрыва: 16\/24\/32\/40 ( 26\/34\/42\/50)","Длительность: 6"],"hot_key":"E","legacy_key":"C"},{"spell":"Cбрасывает время перезарядки способностей и большинства предметов героя.","effects":["Способность Ненаправленная \/ Произносимая","Действует на Себя"],"notes":["У следущих предметов способность не сбрасывает время перезарядки: Aeon Disk, Arcane Boots, Black King Bar, Hand of Midas, Helm of the Dominator, Linken's Sphere, Meteor Hammer, Necronomicon, Pipe of Insight, Refresher Orb, Refresher Shard и Tome of Knowledge. Визуально сбрасывает перезарядку у Tranquil Boots, но отсчет восстановления все равно идет. Не восстанавливает заряды у предметов ( Bottle, Drum of Endurance). Перезаряжает только те предметы, которые находятся в инвентаре Tinker. На предметы в рюкзаке, в других юнитах (в том числе курьере) или выброшенные из инвентаря перезарядка не работает. Перезаряжает только предметы, принадлежащие Tinker. На предметы союзников способность не работает. Если прервать произнесение способности, ничего не перезарядится.","Может перезарядить Crimson Guard и Mekansm, но не сбрасывает таймер перезарядки способностей предметов. То же правило действует и на Guardian Greaves, но Mend восстанавливает ману.","Может перезарядить Manta Style, но повторное использование предмета просто заменит предыдущие иллюзии.","Может перезарядить отключенные Blink Dagger и Heart of Tarrasque так же, как и перезарядку Skull Basher и Abyssal Blade.","Звук от использования Rearm становится все короче с каждым уровнем с уменьшением времени применения."],"mana":"100\/200\/300","elements":["Проходит сквозь иммунитет к заклинаниям."],"cooldown":"0","name":"Rearm","description":["Анимация применения: 0,53+0","Длительность произнесения: 3\/1.5\/0.75"],"hot_key":"R","legacy_key":"R"}],"bio":"Карликовый народец, которому принадлежит Боуш, известен своими изобретательностью, хитростью и нелюбовью к магии. Гордятся они, что зарабатывают себе на хлеб исключительно разумом, применяя лишь те силы природы, которым могут найти объяснение. Но даже такая сдержанность может обернуться трагедией — уж Боушу ли не знать. Когда-то он был одним из главных исследователей законов природы, основателем подземной лаборатории всего и вся, расположенной под окутанным туманами Фиолетовым плато. Презирая магов за опасность, которую те представляют для мира, Боуш и его помощники, не ведая об опасности, открыли портал в некий мир за гранью разумения и оказались во власти собственных кошмаров. Чёрный туман покрыл Фиолетовое плато вечной тьмой, откуда теперь доносятся полные ужаса звуки. Только благодаря всяким штуковинам собственного изобретения Боушу удалось бежать. Один он пережил беду Фиолетового плато.","talentsTips":["Талант на дальность применения не влияет на дальность отскоков Laser.","Золото с таланта является ненадёжным.","Талант на броню не дается иллюзиям."],"trivia":["Актёр, озвучивший Tinker, Harry 'Hal' Robins, также озвучивал персонажа Доктора Кляйнера в игре Half-Life 2.","Многие реплики Tinker являются отсылками к персонажам и событиям из вселенной Half-Life.","Любительское\/шуточное имя Tinker было \"X!!\", имя профессионального игрока в DotA."],"talents":["Ракеты от Heat-Seeking Missile оглушают на 0,3 сек.:+100 к урону от Laser","+10 к урону от March of the Machines:+10 к броне","+11% к уменьшению расхода и сжигания маны:+150 золота в минуту","+125 к дальности способностей:+10% к урону от способностей"],"desc":"Tinker — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Способность Laser позволяет выстрелить из лазерной пушки в противника, нанося мгновенный чистый урон, который не блокируется физической защитой, и ослепляя врагов, заставляя их промахиваться. Способностью Heat-Seeking Missile герой выстреливает ракетами по двум ближайшим вражеским героям. Способность March of the Machines позволяет герою вызвать армию маленьких роботов, которые наносят урон всем, по которым они будут идти, включая вражеских героев и крипов. Благодаря способности Rearm герой перезаряжает все свои способности и большинство предметов для дальнейшего использования."}