{
  "abilities": [
    {
      "spell": "Выпускает луч сконцентрированной энергии, который наносит урон и ослепляет цель, из-за чего та промахивается всеми физическими атаками.",
      "effects": [
        "Способность Направленная на юнита",
        "Действует на Врагов",
        "Урон Чистый"
      ],
      "notes": [
        "Во время применения проигрывается звуковой эффект, который слышен всем.",
        "На крипов-героев способность действует столько же, сколько и на крипов.",
        "При улучшении Aghanim's Scepter, способность отскакивает в ближайшего вражеского героя в радиусе 400 от начальной цели. Все отскоки срабатывают одновременно без какой-либо задержки между ними. У отскоков нет лимита по количеству. Может отскакивать только от героев (включая копии), иллюзий и крипов-героев. Если первичная цель окажется обычным крипом\/призванным существом, способность продолжит перескакивать только к подходящим целям в радиусе действия. Не отскакивает от невидимых юнитов или юнитов, находящихся в тумане войны. Не может ударить одну и ту же цель дважды за одно применение способности."
      ],
      "mana": "110\/130\/150\/170",
      "elements": [
        "Частично блокируется Linken's Sphere.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "20\/18\/16\/14",
      "name": "Laser",
      "description": [
        "Анимация применения: 0,4+1",
        "Дальность применения: 650 ( 660)",
        "Радиус отскока: 0 ( 400)",
        "Урон: 80\/160\/240\/320 ( 180\/260\/340\/420)",
        "Шанс промаха: 100%",
        "Длительность на героях: 3\/3.5\/4\/4.5",
        "Длительность на крипах: 6"
      ],
      "hot_key": "Q",
      "legacy_key": "E"
    },
    {
      "spell": "Запускает пару ракет в ближайших видимых вражеских героев в радиусе 2500 единиц.",
      "effects": [
        "Способность Ненаправленная",
        "Действует на Вражеских героев",
        "Урон Магический"
      ],
      "notes": [
        "Использование Heat-Seeking Missile прерывает произнесение заклинаний.",
        "Ракеты летят со скоростью 900 единиц.",
        "При попадании всех ракет, они все могут нанести до 250\/400\/550\/700 ( 500\/800\/1100\/1400) единиц урона (до учета сопротивления).",
        "Не считает целями юнитов вне зоны обзора (в том числе невидимых), неуязвимых или спрятанных.",
        "Считает целями копии героев и иллюзии.",
        "Если в радиусе действия нет подходящих целей, ракеты вылетают и падают на землю, показывая, что применение способности было неуспешным."
      ],
      "mana": "120\/140\/160\/180",
      "elements": [
        "Можно избежать.",
        "Блокируется иммунитетом к заклинаниям."
      ],
      "cooldown": "25",
      "name": "Heat-Seeking Missile",
      "description": [
        "Анимация применения: 0+1,2",
        "Радиус: 2500",
        "Количество целей: 2 ( 4)",
        "Урон от ракеты: 125\/200\/275\/350",
        "Длительность оглушения: 0 ( 0,3)"
      ],
      "hot_key": "W",
      "legacy_key": "T"
    },
    {
      "spell": "Призывает армию механических слуг, атакующих врагов вокруг Tinker.",
      "effects": [
        "Способность Направленная на точку",
        "Действует на Врагов",
        "Урон Магический"
      ],
      "notes": [
        "Роботы движутся со скоростью 400 единиц на расстояние 1800 единиц за 4.5 секунды.",
        "Область появления роботов радиусом 900 единиц зафиксирована за точкой применения, а не за местоположением самого Tinker.",
        "Область появления является линией длиной 1800 единиц, которая начинается в 900 единицах позади точки примения.",
        "Так что вся площадь области появления роботов представляет собой квадратную форму со стороной в 1800 единиц.",
        "Роботы появляются с промежутком в 0.0417 секунды в случайных точках по области применения, получается 24 робота в секунду, и всего появляется 144 робота.",
        "Роботы не появляются там, где площадь примения выходит за границы карты.",
        "Когда враг подходит на расстояние 50 единиц от робота, он наносит урон в радиусе 150 единиц от себя, а затем исчезает.",
        "Если один враг с площадью столкновения в 24 единиц будет неподвижно стоять все время действия способности, он может получить до 189.44\/284.16\/378.88\/473.6 ( 284.16\/378.88\/473.6\/568.32) единиц урона (до учета сопротивления).",
        "Если каждый взрыв мог бы сработать на одну цель, то на неё бы сработало до 2304\/3456\/4608\/5760 ( 3456\/4608\/5760\/6912) единиц урона (до учета сопротивления).",
        "Роботы не взрываются и не наносят урон при столкновении с курьером.",
        "Звук применения способности не слышен врагам, но звук движения роботов им слышен."
      ],
      "mana": "145\/150\/165\/190",
      "elements": [
        "Частично проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "35",
      "name": "March of the Machines",
      "description": [
        "Анимация применения: 0,53+0,63",
        "Дальность применения: 300 ( 310)",
        "Радиус появления роботов: 900",
        "Радиус столкновения роботов: 50",
        "Радиус взрыва роботов: 150",
        "Урон от взрыва: 16\/24\/32\/40 ( 24\/32\/40\/48)",
        "Длительность: 6"
      ],
      "hot_key": "E",
      "legacy_key": "C"
    },
    {
      "spell": "Cбрасывает время перезарядки способностей и большинства предметов героя.",
      "effects": [
        "Способность Ненаправленная \/ Произносимая",
        "Действует на Себя"
      ],
      "notes": [
        "У следущих предметов способность не сбрасывает время перезарядки: Arcane Boots, Black King Bar, Hand of Midas, Helm of the Dominator, Linken's Sphere, Meteor Hammer, Aeon Disk, Necronomicon, Pipe of Insight, Refresher Orb и Refresher Shard. Визуально сбрасывает перезарядку у Tranquil Boots, но отсчет восстановления все равно идет. Не восстанавливает заряды у предметов ( Bottle, Drum of Endurance). Перезаряжает только те предметы, которые находятся в инвентаре Tinker. На предметы в рюкзаке, в других юнитах (в том числе курьере) или выброшенные из инвентаря перезарядка не работает. Перезаряжает только предметы, принадлежащие Tinker. На предметы союзников способность не работает. Если прервать произнесение способности, ничего не перезарядится.",
        "Может перезарядить Crimson Guard и Mekansm, но не сбрасывает таймер перезарядки способностей предметов. То же правило действует и на Guardian Greaves, но [[|16px|link=Guardian Greaves#Mend]] Mend восстанавливает ману.",
        "Может перезарядить Manta Style, но повторное использование предмета просто заменит предыдущие иллюзии.",
        "Может перезарядить отключенные Blink Dagger и Heart of Tarrasque так же, как и перезарядку Skull Basher и Abyssal Blade.",
        "Звук от использования Rearm становится все короче с каждым уровнем с уменьшением времени применения."
      ],
      "mana": "100\/200\/300",
      "elements": [
        "Проходит сквозь иммунитет к заклинаниям."
      ],
      "cooldown": "0",
      "name": "Rearm",
      "description": [
        "Анимация применения: 0,53+0",
        "Длительность произнесения: 3\/1.5\/0.75"
      ],
      "hot_key": "R",
      "legacy_key": "R"
    }
  ],
  "bio": "Карликовая раса, выходцем из которой приходится Боуш, знаменита своей хитростью, умом и способностями в работе с механизмами. Они гордо отрицают любую магию и выживают только своими силами — с помощью того, чему можно найти рациональное объяснение. Как выяснилось, такая гордыня ни к чему хорошему не приводит — и Боуш может подтвердить это своим примером. Когда-то он был одним из главных исследователей законов природы, основателем подземной лаборатории всего и вся, расположенной под окутанным туманами Фиолетового плато. Презирая магов и опасность, которую они представляют для мира, профессор Боуш и его коллеги самонадеянно открыли портал в неизвестное параллельное измерение, на продолжительное время погрузившись в параллельные миры своих кошмаров. Черный туман покрыл Фиолетовое плато, и оттуда стали постоянно доноситься крики ужаса. Боуш — единственный, кто смог пережить бесконечно долгие ужасы и невзгоды того места, используя лишь свой ум и найденные по пути приспособления. Единственный выживший Tinker из всех, что пропали без вести в инциденте на Фиолетовом плато.",
  "talentsTips": [
    "Талант на дальность применения не влияет на дальность отскоков Laser.",
    "Талант на вампиризм заклинаний аддитивно сочетается с другими источниками вампиризма заклинаний.",
    "Талант вампиризма заклинаний лечит на 6% от не-героев. Считает крипов-героев как крипов и не лечит от урона по иллюзиям.",
    "Талант на броню не дается иллюзиям."
  ],
  "trivia": [
    "Актёр, озвучивший Tinker, Harry 'Hal' Robins, также озвучивал персонажа Доктора Кляйнера в игре Half-Life 2.",
    "Многие реплики Tinker являются отсылками к персонажам и событиям из вселенной Half-Life.",
    "Любительское\/шуточное имя Tinker было \"X!!\", имя профессионального игрока в DotA."
  ],
  "talents": [
    "+0,3 сек. оглушения от ракет Heat-Seeking Missile:+100 к урону от Laser",
    "+8 к урону от March of the Machines:+10 к броне",
    "+10% к вампиризму способностями:+30 к скорости передвижения",
    "+75 к дальности способностей:+6% к урону от способностей"
  ],
  "tips": [
    "Laser - это очень мощная способность, который наносит чистый урон. Используйте его как основной источник урона.",
    "У Heat-Seeking Missile очень большая дальность попадания. Вы можете спокойно использовать его для нанесения урона противникам с безопасного расстояния.",
    "March of the Machines это отличная способность для прокачивания. Хотя, чтобы использовать её точно нужно немного приловчиться. Вы можете одновременно запустить несколько March of the Machines используя Rearm, чтобы нанести массовый урон в радиусе.",
    "Boots of Travel - это основной предмет для Tinker. Используемый вместе с Rearm, он позволяет вам перемещаться по карте с большой скоростью. Как только у вас появляются Boots of Travel и Soul Ring, начинайте телепортироваться по линиям и обратно на фонтан, чтобы собирать золото со всей карты. Механика действий очень проста: телепортируйтесь на линию, нажимайте Soul Ring, затем используйте March of the Machines после чего Rearm. Затем то же самое, так как Rearm сбрасывает время перезарядки до нуля, и вы опять можете использовать эту схему. Запустив 2-3 марша роботов, вы можете телепортироваться на фонтан, чтобы восстановить ману. Также не забывайте помогать союзникам на линии, используя на них свой Bottle.",
    "Старайтесь участвовать во всех сражениях. Комбинация Heat-Seeking Missile, Laser, Rearm, Heat-Seeking Missile должна быть достаточной, чтобы добить любых убегающих противников начале\/середине игры.",
    "Заклинание Rearm отнимает ману сразу после нажатия, но способности и предметы не будут перезаряжены пока не закончится время применения. Это значит, что если вы прервёте Rearm во время применения, мана будет потрачена, а перезарядки с заклинаний и предметов не сбросятся.",
    "Scythe of Vyse в совокупности c Rearm позволит вам дольше держать в противника в Hex'е, что позволит легче его убить."
  ],
  "desc": "Tinker — это герой с дальним типом атаки, основной характеристикой которого является интеллект. Данного героя можно отлично отнести к классу Пушеров (тех героев, которые способны в одиночку пронести линию врагу). Способность Laser позволяет выстрелить из лазерной пушки в противника, нанося мгновенный чистый урон, который не блокируется физической защитой, и ослепляя врагов, заставляя их промахиваться. Способностью Heat-Seeking Missile герой выстреливает ракетами по двум ближайшим вражеским героям. Способность March of the Machines позволяет герою вызвать армию маленьких роботов, которые наносят урон всем, по которым они будут идти, включая вражеских героев и крипов. Благодаря способности Rearm герой перезаряжает все свои способности и большинство предметов для дальнейшего использования."
}