{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/e\/e1\/Aeon_Disk.mp3\/revision\/latest?cb=20171111013143",
      "effects": [
        "Граница здоровья: 70%",
        "Уменьшение получаемого\/наносимого урона: 100%",
        "Сопротивление эффектам: 75%",
        "Длительность: 2,5"
      ],
      "notes": [
        "Срабатывает при получении урона, превышающего 0 (до уменьшений), от вражеских или союзных игроков. Не срабатывает от урона, наносимого себе или помеченного как отнимающий здоровье.",
        "Не срабатывает от урона, наносимого себе или помеченного как отнимающий здоровье.",
        "При активации однократно применяет сильное развеивание к владельцу.",
        "Дает владельцу 100% уменьшение получаемого урона, но не его отрицание. Отнимающий здоровье урон не уменьшается. То есть усиление получаемого урона можно противопоставить эффекту.",
        "То есть усиление получаемого урона можно противопоставить эффекту.",
        "Также дает владельцу 100% уменьшение наносимого урона, поэтому урон им не наносится, если у владельца нет усиления наносимого урона.",
        "Также дает 75% сопротивления эффектам; сочетается по закону убывающей полезности с другими источниками сопротивления.",
        "Источник урона, активировавший Combo Breaker, нивелируется. Но, если здоровье владельца было выше 70%, оно исчезнет, но не упадет ниже 70%.",
        "Но, если здоровье владельца было выше 70%, оно исчезнет, но не упадет ниже 70%.",
        "Не защищает от мгновенно убивающих эффектов.",
        "Покупка нового Aeon Disk сбрасывает перезарядку."
      ],
      "mana": null,
      "abilityName": "Combo Breaker",
      "cooldown": null,
      "description": "Если здоровье владельца упадёт ниже 70%, он получит магический щит, который сильным очищением развеет большинство эффектов, а также на 2,5 сек. увеличит сопротивление эффектам на 75% и не даст наносить или получать урон. Срабатывает только от урона игроков. Перезарядка увеличивается после каждого использования.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "3000",
  "lore": null,
  "consistFrom": [
    "Vitality Booster",
    "Energy Booster",
    "Recipe"
  ],
  "name": "Aeon Disk",
  "description": "Могущественный артефакт, давным-давно, как поговаривают, выкраденный из Белого инкубатория.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}