{
  "abilities": [
    {
      "audioUrl": null,
      "effects": [
        "Способность Пассивная",
        "Действует на Себя"
      ],
      "notes": [
        "Увеличивает характеристики активного Tranquil Boots на +45 к скорости передвижения и 0 к регенерации здоровья.",
        "Идёт на перезарядку после успешного попадания атакой по герою, или когда любой враг успешно попал по владельцу. Урон от атаки не важен, даже атака с нулевым уроном сломает сапоги. Вторичные атаки от Flak Cannon и Split Shot также считаются, но отскоки от Moon Glaives не считаются. Прорубающий удар, урон по области и Psi Blades не могут сломать сапоги вторичных целей.",
        "Урон от атаки не важен, даже атака с нулевым уроном сломает сапоги.",
        "Вторичные атаки от Flak Cannon и Split Shot также считаются, но отскоки от Moon Glaives не считаются.",
        "Прорубающий удар, урон по области и Psi Blades не могут сломать сапоги вторичных целей.",
        "Не отключается при атаке юнитов не-героев. Считает крипов-героев за крипов.",
        "Перезарядка попадает под воздействие Cooldown Reduction у Octarine Core, Руна волшебства или талантов. Но обновление предмета (TagTalent Refresher Orb или Rearm) не уберет поломанное состояние. Таймер перезарядки исчезнет, но сапоги останутся отключенными на оставшуюся длительность.",
        "Но обновление предмета (TagTalent Refresher Orb или Rearm) не уберет поломанное состояние. Таймер перезарядки исчезнет, но сапоги останутся отключенными на оставшуюся длительность."
      ],
      "mana": null,
      "abilityName": "Break",
      "cooldown": "13",
      "description": "Если владельца атаковало существо или он атаковал героя, то предмет 13 сек. не будет восстанавливать здоровье, а бонус к скорости передвижения уменьшится до 45.",
      "params": [
        "Уменьшение скорости передвижения: 25",
        "Уменьшение регенерации здоровья: 14",
        "Иллюзии всегда имеют отключенную версию в их инвентаре."
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Бонусы к скорости передвижения от нескольких пар сапог не сочетаются.",
    "Сочетается со всеми другими бонусами к скорости передвижения.",
    "Регенерация здоровья от нескольких Tranquil Boots полностью сочетается."
  ],
  "cost": "925",
  "lore": null,
  "consistFrom": [
    "Boots of Speed",
    "Wind Lace",
    "Ring of Regen"
  ],
  "boughtFrom": "Поддержка",
  "name": "Tranquil Boots",
  "description": "",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+14 к регенерации здоровья",
    "+70 к скорости передвижения"
  ],
  "tips": null
}