{
  "abilities": [
    {
      "notes": [
        "Длительность подъема состоит из 0,9\/1,2\/1,5\/1,8 сек\n зависания в воздухе и 0,3 секунды приземления",
        "Поднятое существо оглушается при нахождении в воздухе и на него не действует оглушение по области при приземлении\n Модификатор оглушения всегда применяется дебаффом, а статус главного модикатора зависит от стороны, к которой принадлежит цель\n С <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard при применении к союзнику оглушение можно развеять с помощью сильного развеивания, но подъем развеять нельзя\n Поскольку сам подъем не оглушает цель, то при развеивании оглушения во время подъема союзник может атаковать, поворачиваться и применять заклинания и предметы",
        "Пока цель в воздухе, остальные существа могут под ним проходить",
        "При досрочном завершении подъема существо мгновенно приземляется, применяет оглушение по области и затем наносит урон",
        "При приземлении поднятое существо разрушает деревья в радиусе 325 единиц вокруг себя",
        "Не может поднять  Рошана; он будет оглушен на длительность подъема",
        "Применение Telekinesis на существ под действием  Black Hole,  Chronosphere или  Duel не сделает ничего, но способность потратит ману и уйдёт на перезарядку",
        "При улучшении с <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard способность, применённая на союзников или на себя, будет использовать уменьшенную перезарядку, чем при применении на противников\n ↓↓ Двойное нажатие автоматически выбирает себя",
        "Дальность применения с учетом эффекта  Arcane Supremacy для каждого уровня будет равна: Уровень 1: 650\/700\/750\/800\n Уровень 2: 675\/725\/775\/825\n Уровень 3: 700\/750\/800\/850\n Уровень 4: 725\/775\/825\/875."
      ],
      "item_behaviour": [],
      "description": "Используя телекинез, герой ненадолго поднимает противника в воздух, а затем швыряет его обратно на землю — с такой силой, что оглушает всех врагов рядом с ним.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,1+0,97",
        "Дальность применения: 550\/575\/600\/625",
        "Радиус оглушения: 325",
        "Длительность подъема: 1,2\/1,5\/1,8\/2,1 ( 1,8\/2,1\/2,4\/2,7)",
        "Длительность оглушения: 1,2\/1,4\/1,6\/1,8",
        "Урон от приземления:  175"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/a\/a2\/Rubick_Telekinesis_1.mp3\/revision\/latest?cb=20191216022735",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов ",
        "Урон: "
      ],
      "mana": "28\/26\/24\/22 (TagTalent 16\/14\/12\/10) (TagTalent 19,6\/18,2\/16,8\/15,4, 11,2\/9,8\/8,4\/7)",
      "aghanim": null,
      "name": "Telekinesis",
      "cooldown": "110",
      "legacy_key": "Z",
      "story": "Даже самый величайший маг может колдовать забавы ради."
    },
    {
      "notes": [
        "Заменяет  Telekinesis при применении на врага и остается до приземления выбранного существа",
        "Позволяет выбрать место приземления существа после завершения длительности подъема\n Не прерывает досрочно подъем",
        "Выбор точки, превышающую максимально доступную дальность, приведет к смене точки на находящуюся на расстоянии 375 ( 615) по направлению к изначально выбранной\n Враг перемещается к выбранной точке за оставшиеся 0,3 секунды от длительности подъема, поэтому скорость может варьироваться от 0 до 1250 ( 2050) в зависимости от выбранного расстояния",
        "Можно использовать несколько раз, пока существо подвешено\n Оно приземлится на последнюю выбранную точку\n Если сменить целевую точку в момент, когда существо уже приземляется, то оно все равно продолжит движение к предыдущей точке\n Однако при достижении этой точки цель мгновенно телепортируется на новую целевую точку, применив все эффекты при приземлении",
        "Центр выбранной области отмечен зелеными частицами, видимые только союзникам"
      ],
      "item_behaviour": [],
      "description": "Указывает место, в которое цель приземлится после окончания действия Telekinesis.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0,1+1,07",
        "Дальность применения: Глобальная",
        "Макс\n дальность броска: 375 ( 615)",
        "Радиус оглушения: 325",
        "Длительность оглушения: 1,2\/1,4\/1,6\/1,8",
        "Урон:  175"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/31\/Toss_impact.mp3\/revision\/latest?cb=20141123220921",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Telekinesis Land",
      "cooldown": "0",
      "legacy_key": "Z",
      "story": null
    },
    {
      "notes": [
        "Требуется <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard для разблокировки",
        "Заменяет  Telekinesis при применении на союзника или себя и остается до приземления выбранного существа\n Позволяет выбрать место приземления существа\n При применении уменьшает оставшуюся длительность подъема до 0,5",
        "Выбор точки, превышающую максимально доступную дальность, приведет к смене точки на находящуюся на расстоянии 693,75 ( 1137,75) по направлению к изначально выбранной\n Союзник перемещается к выбранной точке за последние 0,3 секунды от длительности подъема, поэтому скорость может варьироваться от 0 до 2312,5 ( 3792,5) в зависимости от выбранного расстояния\n После применения способность становится неактивной",
        "Можно использовать при оглушении, урагане, сне, провокации, исчезновении или при принудительном движении",
        "Нельзя использовать при безмолвии, проклятии или активном запрете действий\n Нельзя поставить в ⇧ Shift-очередь",
        "Центр выбранной области отмечен зелеными частицами, видимые только союзникам"
      ],
      "item_behaviour": [],
      "description": "Указывает место, в которое вы приземлитесь после окончания действия Telekinesis.",
      "hot_key": "Q",
      "params": [
        "Анимация применения: 0+0",
        "Дальность применения: Глобальная",
        "Макс\n дальность броска: 693,75 ( 1137,75)",
        "Радиус оглушения: 325",
        "Задержка броска: 0,5",
        "Длительность оглушения: 1,2\/1,4\/1,6\/1,8"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Направленная на область",
        "Действует на: Врагов"
      ],
      "mana": "0",
      "aghanim": null,
      "name": "Telekinesis Land (Aghanim's Shard)",
      "cooldown": "0",
      "legacy_key": "Z",
      "story": null
    },
    {
      "notes": [
        "У Fade Bolt нет лимита скачков\n Они происходят с интервалом в 0,25 секунды\n Каждый скачок снижает текущий урон способности на 6%\n Не перескакивает на невидимых существ и существ в тумане войны\n Никогда не поражает одно и то же существо дважды за применение\n Скрытый модификтор требуется для скачков",
        "Уменьшает основной урон от атаки задетых существ\n Дополнительный урон не уменьшается",
        "За первые 5 скачков суммарно нанесёт 443,5\/776,1\/1108,7\/1441,4 урона (до уменьшений)\n Fade Bolt проделает 75\/84\/90\/94 скачков до достижения 1 единицы урона",
        "Fade Bolt сначала наносит урон, затем применяет дебафф",
        "Дальность применения с учетом эффекта  Arcane Supremacy равна 900\/950\/1000\/1050"
      ],
      "item_behaviour": [],
      "description": "Герой создаёт мощный поток магической энергии, который перемещается между противниками, нанося им урон и снижая урон от их атак. Каждый последующий скачок наносит меньше урона.",
      "hot_key": "W",
      "params": [
        "Анимация применения: 0,1+0,93",
        "Дальность применения: 800",
        "Дальность скачка: 440",
        "Число скачков: Неограниченно",
        "Базовый урон: 100\/175\/250\/325",
        "Снижение урона за скачок: 6%",
        "Уменьшение урона от атак: 14%\/21%\/28%\/35% ( 26%\/33%\/40%\/47%)",
        "Длительность: 10"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/6\/69\/Rubick_Fade_Bolt_1.mp3\/revision\/latest?cb=20191216022739",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Врагов",
        "Урон: Магический"
      ],
      "mana": "16\/14\/12\/10 (TagTalent 11\/9\/7\/5)",
      "aghanim": null,
      "name": "Fade Bolt",
      "cooldown": "120\/130\/140\/150",
      "legacy_key": "X",
      "story": "Любимое заклинание, позволяющее избавиться от возможных убийц, по сути своей довольно примитивно."
    },
    {
      "notes": [
        "Накладывает общее усиление исходящего урона на Rubick\n Сочетается аддитивно с другими источниками общего усиления исходящего урона\n Усиление действует только на урон от заклинаний, который не отмечен как отнимающий здоровье\n Урон от атаки не усиливается\n Arcane Supremacy вместе с увеличивающим урон от украденных способностей при помощи  Spell Steal  талантом увеличивает их урона на 54%\/58%\/62%\/66%"
      ],
      "item_behaviour": [],
      "description": "Знания тайной магии позволяют герою наносить больше урона от способностей, а его заклинания действуют на врага дольше обычного.",
      "hot_key": "E",
      "params": [
        "Доп\n дальность применения: 100\/150\/200\/250",
        "Доп\n урон от способностей: 14%\/18%\/22%\/26%"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Arcane Supremacy",
      "cooldown": null,
      "legacy_key": "N",
      "story": "Многие маги никогда не смогут стать Великими..."
    },
    {
      "notes": [
        "Перезарядка всех украденных заклинаний и количество зарядов сохраняются\n При повторном получении ранее использованного заклинания оно не будет моментально готово к повторному применению, кроме описанных здесь исключений\n При первом получении способности Rubick получает то же число зарядов, что и герой при её изучении\n Сбрасывающие перезарядку эффекты не будут взаимодействовать со способностями, которыми Rubick не владеет в данный момент",
        "При этом длительность распоряжения способностью в обновляется, перезарядка способности — нет\n Эффекты, сбрасывающие перезарядку, не действуют на заклинания, которых нет у Rubick на момент сброса",
        "Анимация применения всех украденных заклинаний Rubick равна , за исключением заклинаний, перечисленных здесь",
        "Способности, даруемые <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter или <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, не требуют у Rubick приобретения Aghanim's Scepter или Aghanim's Shard для их кражи",
        "Любые способности, создающие иллюзии, создают иллюзии самого Rubick, основанные на их визульном представлении, а не иллюзии изначального героя",
        "Способности, взаимодействующие с призываемыми и  приручаемыми существами, следуют правилам общего накладывания: Существа с ограниченным временем жизни (например,  Forge Spirit и  Chaotic Offering и др.) не умирают при потере способности\n Существа с бесконечной длительностью жизни (например,  Summon Spirit Bear) мгновенно умирают при потере способности, если не указано другое",
        "Украденные прерываемые способности способности обычно заканчиваются преждевременно, если Rubick теряет их во время произнесения, что имеет тот же эффект, что и их прерывание во время произнесения\n Тем не менее, есть несколько исключений, перечисленных здесь"
      ],
      "item_behaviour": [],
      "description": "В этой ячейке будет находиться способность, полученная с помощью Spell Steal.",
      "hot_key": "D",
      "params": [
        "Анимация применения: 0,15+?",
        "Штрафное время анимации после применения для способностей нейтральных крипов: 1,37"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Украденная способность 1",
      "cooldown": null,
      "legacy_key": "?",
      "story": null
    },
    {
      "notes": [
        "Подспособности от способностей (например,  Ethereal Jaunt) автоматически приобретаются, занимая эту ячейку, их нельзя вручную украсть\n Связанные способности не приобретаются"
      ],
      "item_behaviour": [],
      "description": "В этой ячейке будет находиться способность, полученная с помощью Spell Steal.",
      "hot_key": "F",
      "params": [
        "Анимация применения: 0,15+?"
      ],
      "audioUrl": "",
      "effects": [
        "Способность: Пассивная",
        "Действует на: Себя"
      ],
      "mana": null,
      "aghanim": null,
      "name": "Украденная способность 2",
      "cooldown": null,
      "legacy_key": "?",
      "story": null
    },
    {
      "notes": [
        "Полный перечень уникальных взаимодействий с Spell Steal можно найти здесь",
        "Украденная способность летит к Rubick в виде снаряда со скоростью в 1200 единиц\n Rubick получает заклинание (и теряет предыдущее украденное) при попадании в него снаряда",
        "Не может украсть больше, чем 1 ( 2) заклинания в одно и то же время\n Когда персонаж уже имеет две украденные способности, при краже нового заклинания самая старая способность теряется\n Только что украденная способность всегда занимает четвертую ячейку\n Предыдущая украденная способность смещается на пятую ячейку, а ранее украденное заклинание теряется\n Все украденные способности теряются при смерти",
        "Не может украсть пассивные способности, способности предметов или активные модификаторы атаки (за исключением  Walrus PUNCH!)\n Может украсть только у героев (включая клонов, но исключая иллюзии)\n Не может украсть следующие заклинания:  Stone Remnant,  Quas,  Wex,  Exort,  Invoke,   Divided We Stand,  Mischief,  Morph,  Rearm,  Minefield Sign и  Stone Form\n Может красть способности только у героев, включая клонов и исключая иллюзии\n Если пассивная способность получает активный компонент при улучшении, то Rubick может украсть эту способность",
        "Уровень украденного заклинания равен уровню заклинания у врага на момент кражи\n Уровень обновляется только при повторной краже\n Имеющиеся у цели <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter или <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard не учитываются при краже, Rubick всегда крадёт не улучшенную версию\n Однако если сам Rubick владеет <span image=\"items\/aghanim's_scepter\/full.webp\">[Aghanim's Scepter]<\/span> Aghanim's Scepter или <span image=\"items\/aghanim's_shard\/full.webp\">[Aghanim's Shard]<\/span> Aghanim's Shard, то украденные способности будут улучшены\n Бонусы от  талантов для заклинаний не копируются",
        "Spell Steal можно применить только на героев, поэтому способности нейтральных крипов (например,  Ensnare) не может быть приобретена, кроме случаев со следующими условиями:  Doom применил полученную при помощи  Devour способность\n  Clinkz применил полученную при помощи   Death Pact способность",
        "Увеличение длительности дебаффов распространяется только на длительность дебаффов украденных заклинаний, действующих на врагов\n Дебафф определяется красной рамкой вокруг иконки эффекта\n Следует тем же правилам, что и сопротивление эффектам",
        "Усиливающий урон заклинаний  талант действует только на урон украденных заклинаний",
        "Снижающий перезарядку украденных способностей  талант взаимодействует с перезарядками только украденных способностей",
        "Дальность применения с учетом эффекта  Arcane Supremacy равна ( 1500\/1550\/1600\/1650)"
      ],
      "item_behaviour": [],
      "description": "Герой улавливает следы магической энергии, обучаясь таинствам последней способности, применённой выбранным противником. Полученная способность находится в распоряжении героя несколько минут либо пока он не погибнет.",
      "hot_key": "R",
      "params": [
        "Анимация применения: 0,1+0,93",
        "Дальность применения: 1000 ( 1400)",
        "Максимум украденных способностей: 1 ( 2)",
        "Время применения украденного заклинания: 0,15",
        "Доп\n время действия украденных эффектов: 10%\/20%\/30%",
        "Длительность: 180\/240\/300",
        "Снижение перезарядок украденных способностей:  25%",
        "Доп\n урон от украденных способностей:  40%"
      ],
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/b\/b3\/Rubick_Spell_Steal_1.mp3\/revision\/latest?cb=20191216022733",
      "effects": [
        "Способность: Направленная на существо",
        "Действует на: Вражеских героев"
      ],
      "mana": "20\/12\/4",
      "aghanim": null,
      "name": "Spell Steal",
      "cooldown": "25",
      "legacy_key": "Q",
      "story": "...но даже их ограниченные магические способности могут оказаться весьма полезными."
    }
  ],
  "mainAttributes": {
    "attrStrengthInc": 2.0,
    "attrStrength": 21.0,
    "attrIntelligence": 25.0,
    "attrIntelligenceInc": 3.1,
    "attrAgilityInc": 2.5,
    "attrAgility": 23.0
  },
  "description": "Крадёт вражеские заклинания и использует их сам. Rubick неустанно ищет полезные вражеские способности, которые можно использовать против их бывших владельцев. Поднимая противников в воздух и указывая, где им упасть, Rubick сеет хаос в их рядах.  Поддержка Контроль Быстрый урон ★★★",
  "history": "Любому колдуну под силу использовать заклинание или два, а некоторые из них могут даже обучаться достаточно долго, чтобы стать волшебником, но лишь самым талантливым дозволено носить титул мага. Впрочем, как и в любом другом кругу колдунов, ощущение сплоченности никогда не гарантировало гладкого соперничества. Уже известный в высшем колдовском кругу как дуэлянт и ученый, Rubick никогда и не думал, что у него есть задатки мага. До тех пор, пока его не попытались убить в седьмой раз. Со вздохом выкинув двенадцатого из так называемых убийц со своего балкона, он осознал, насколько безнадежно неинтересны стали покушения на его жизнь. Раньше внезапный щелчок пальца или воспламеняющийся на чьей-то руке огонь заставляли его радостно пружинить при ходьбе, но теперь все стало страшно предсказуемо. Ему хотелось более серьезной борьбы. Итак, надев свою боевую маску, он сделал то, что сделал бы любой волшебник, желающий продвинуться в сообществе: он объявил о своих намерениях убить мага. Вскоре Rubick осознал, что напав на одного мага, он напал на них всех, и те обрушились на него всеми силами. Каждое заклинание любого из его противников было неостановимым потоком энергии, всякая атака - рассчитанным на убийство ударом. Но очень скоро случилось то, чего враги Рубика не ожидали: их мастерство обратилось против них. Внутри урагана магии Рубик хохотал, незаметно читая и копируя способности одного, чтобы использовать их против другого, создавая хаос в ряду тех, кто объединился против него. Посыпались обвинения в предательстве, и вскоре колдуны обратились друг против друга, даже не подозревая, кто привел их к такой гибели. Когда битва наконец утихла, все вокруг было обуглено и заморожено, изрезано, облито и порвано. Лишь Рубик выделялся из беспорядка, слегка побитый, но восхищенный случившемуся на этой неделе торжеству. Ни у кого не нашлось мощи возразить ему, когда он подал заявку на принятие в Скрытый Совет, и Одиннадцать Иллюзорных как один согласились вручить ему титул Великого мага."
}