{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/d\/d1\/Meteor_Hammer_Meteor_Hammer_1.mp3\/revision\/latest?cb=20191227195458",
      "effects": [
        "Ability Target Area \/ Channeled",
        "Affects Enemies",
        "Damage Magical"
      ],
      "notes": [
        "When interrupted during the channeling, the spell does nothing, wasting the cooldown and mana.",
        "The visual effect at the target area during the channeling is visible to allies only.",
        "The visual effect around the caster is visible to everyone who has vision on the caster.",
        "The casting sound effect is audible to everyone who has vision on the caster.",
        "The meteor takes 0.5 seconds to hit the ground after the channeling.",
        "Upon landing, all enemies within the area, including buildings but excluding wards, get damaged, stunned and receive a damaging debuff.",
        "The meteor first applies the debuffs, then the impact damage.",
        "Deals damage in 1 second intervals, starting 1 second after the debuff is placed, resulting in 7 total instances, including the impact damage.",
        "Can deal a total of 690 damage to units and 375 to buildings (before reductions).",
        "Multiple casts on the same targets do not stack, but refresh the duration instead. Stacks with the debuff of Fallen Sky.",
        "Stacks with the debuff of Fallen Sky.",
        "Provides flying vision within the targeted area for 3.8 seconds, starting upon channel begin. This vision stays even when the channeling gets canceled.",
        "This vision stays even when the channeling gets canceled.",
        "Destroys trees within the radius upon impact.",
        "Does not share cooldown with Fallen Sky."
      ],
      "mana": "125",
      "abilityName": "Meteor Hammer",
      "cooldown": "24",
      "description": "After a successful channel, summons a meteor that strikes a 315 AoE, stunning enemies for 1.75 seconds and dealing impact damage. Continues to deal damage over time to enemy units and buildings for 6 seconds.",
      "params": [
        "Cast Range: 600",
        "Channel Time: 2.5",
        "Impact Radius: 315",
        "Effect Delay: 0.5",
        "Impact Damage (Units): 150",
        "Impact Damage (Buildings): 75",
        "Damage per Second (Units): 90",
        "Damage per Second (Buildings): 50",
        "Burn Duration: 6",
        "Stun Duration: 1.75"
      ],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "For strength heroes, it grants 160 health, 7.3 health regen, 1.33 armor, 8 attack speed, 96 mana, 2.9 mana regen and 8 attack damage.",
    "For agility heroes, it grants 160 health, 7.3 health regen, 1.33 armor, 8 attack speed, 96 mana, 2.9 mana regen and 8 attack damage.",
    "For intelligence heroes, it grants 160 health, 7.3 health regen, 1.33 armor, 8 attack speed, 96 mana, 2.9 mana regen and 8 attack damage."
  ],
  "cost": "2350",
  "lore": null,
  "consistFrom": [
    "Perseverance",
    "Crown",
    "Recipe"
  ],
  "boughtFrom": "Weapons",
  "name": "Meteor Hammer",
  "description": "An enchanted hammer forged of metals discovered in the ruins of a village destroyed by a great star storm.",
  "trivia": null,
  "upgradeIn": null,
  "bonuses": [
    "+8 Strength",
    "+8 Agility",
    "+8 Intelligence",
    "+6.5 Health Regeneration",
    "+2.5 Mana Regeneration"
  ],
  "tips": [
    "Meteor Hammer can be hard to aim, as the long and obvious casting allows most opponents to interrupt or dodge the ability. Use the active in conjunction with disables, or after the target has expended their escape abilities.",
    "If you find yourself vulnerable to disables, you wanna invest for a Black King Bar or a Linken's Sphere to prevent your channelling from getting interrupted easily.",
    "Meteor Hammer can be considered a situational item for teams that require extra siege power, as it deals 375 damage against buildings (about 1\/4 of the HP of a Tier 1 tower).",
    "Meteor Hammer can be used to quickly clear jungle stacks and creep waves."
  ]
}