{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/4\/4f\/Healing_Salve_Salve.mp3\/revision\/latest?cb=20191227195430",
      "effects": [
        "Дальность применения: 250",
        "Доп. восстановление здоровья: 30",
        "Длительность на себе: 13",
        "Длительность на союзниках: 6,5"
      ],
      "notes": [
        "↓↓ Двойное нажатие по предмету применит его на себя.",
        "Можно использовать только на героев (включая иллюзии) и крипов-героев.",
        "Владельцу не нужно поворачиваться к цели, чтобы использовать на неё предмет.",
        "Успешные применения на одну и ту же цель не складываются, но обновляют длительность.",
        "Может восстановить до 390 здоровья за всю длительность, при применении на себя. Может восстановить до 195 здоровья за всю длительность, при применении на союзников. Выбор в цель своих крипов-героев, клонов или иллюзий также восстанавливает половину значения.",
        "Может восстановить до 195 здоровья за всю длительность, при применении на союзников.",
        "Выбор в цель своих крипов-героев, клонов или иллюзий также восстанавливает половину значения.",
        "Урон свыше 0 от игрока (включая союзников, исключая себя) или Рошана развеет эффект. Эффект не будет развеян уроном, помеченным как отнимающий здоровье.",
        "Эффект не будет развеян уроном, помеченным как отнимающий здоровье."
      ],
      "mana": "0",
      "abilityName": "Salve",
      "cooldown": "0",
      "description": "Увеличивает восстановление здоровья выбранного существа на 30. Действует 13 сек. Восстановление прекращается, если получить урон от вражеского героя или Рошана. Лечит наполовину меньше при применении на союзника.",
      "params": [],
      "itemBehaviour": [],
      "story": null
    }
  ],
  "cost": "100",
  "lore": null,
  "consistFrom": null,
  "name": "Healing Salve",
  "description": "Магическая мазь, которая может быстро исцелить даже самые глубокие раны.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}