{
  "abilities": [
    {
      "audioUrl": "https:\/\/static.wikia.nocookie.net\/dota2_gamepedia\/images\/3\/38\/Guardian_Greaves.mp3\/revision\/latest?cb=20150428143328",
      "effects": [
        "Радиус: 1200",
        "Восстановление здоровья: 300",
        "Восстановление маны: 200",
        "Длительность ограничения повторного лечения: 39"
      ],
      "notes": [
        "При использовании прерывает произносимые заклинания.",
        "При использовании применяет базовое развеивание на владельца, снимая большинство дебаффов.",
        "После развеивания происходит лечение.",
        "Затрагивает каждое союзное существо, включая иллюзии, неуязвимых и спрятанных существ, исключая варды и постройки.",
        "Не лечит существ, на которых уже подействовал эффект Mend менее 39 секунд назад или Restore от Mekansm менее 64 секунд назад. В этот период существам все равно будет даваться мана. В панели эффектов можно посмотреть время окончания баффа для его повторной активации.",
        "В этот период существам все равно будет даваться мана.",
        "В панели эффектов можно посмотреть время окончания баффа для его повторной активации.",
        "Клоны Meepo не могут использовать Mend."
      ],
      "mana": null,
      "abilityName": "Mend",
      "cooldown": null,
      "description": "Восстанавливает 300 здоровья и 200 маны всем союзникам вокруг, а также снимает с владельца большинство отрицательных эффектов.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    },
    {
      "audioUrl": null,
      "effects": [
        "Радиус: 1200",
        "Доп. регенерация здоровья: 2.5",
        "Доп. броня: 3",
        "Порог усиления бонуса: 20%",
        "Усиление регенерации здоровья: 16",
        "Усиление брони: 10",
        "Длительность задержки ауры: 0,5"
      ],
      "notes": [
        "Сочетается с другими источниками брони и регенерации здоровья, за исключением Guardian Aura от нескольких Guardian Greaves.",
        "Регенерирует до 150 (960 при усилении) здоровья в минуту.",
        "Не действует на варды, постройки и неуязвимых юнитов.",
        "Усиление действует только на героев (включая иллюзии). Существа не-герои получают только базовые бонусы.",
        "Эффект ауры задерживается на секунды."
      ],
      "mana": null,
      "abilityName": "Guardian Aura",
      "cooldown": null,
      "description": "Действует на союзников вокруг. Увеличивает их восстановление здоровья на 2.5 и броню на 3. Если уровень здоровья союзного героя ниже 20%, то аура будет действовать на него сильнее, восстанавливая 16 здоровья в секунду и увеличивая броню на 10.",
      "params": null,
      "itemBehaviour": [],
      "story": null
    }
  ],
  "additionalInformation": [
    "Дополнительная скорость передвижения от нескольких пар сапогов не суммируется.",
    "Складывается с другими бонусами скорости передвижения."
  ],
  "cost": "5100",
  "lore": null,
  "consistFrom": [
    "Mekansm",
    "Arcane Boots",
    "Buckler",
    "Recipe"
  ],
  "name": "Guardian Greaves",
  "description": "Один из множества священных инструментов, созданных во славу Всезнающего.",
  "trivia": null,
  "upgradeIn": null,
  "tips": null
}